{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "# Introduction:\n\nFerrari (RACE) is a well-known auto manufacturer that produces vehicles that are the pinnacle of the automobile industry. Having a legendary status and a fiercely loyal fan base, Tifosi. RACE relentlessly protects its brand image. Limiting the number of vehicles sold per year, who it sells its cars to, and even controlling where its product ends up online. This fierce protection of brand image is because most of Ferrari’s value comes from its strong brand goodwill that rivals the likes of Google, Disney, and even Coke. Ferrari is so adamant about protecting their brand image that it even opposes engaging in M&A, as it believes that doing so will dilute the Ferrari company's unique genetics. ([SOURCE](https://sg.news.yahoo.com/finance/news/ferrari-does-not-buy-other-145645411.html))\n\n\n\n# Market:\n\n***South Korea***\n\nTaking a look at each country’s attitude towards luxury goods, South Korea is the most receptive towards luxury goods ([SOURCE](https://uofhorang.com/south-korea-the-country-with-the-highest-per-capita-luxury-goods-consumption/#:~:text=Koreans'%20per%20capita%20spending%20on,globally%20(data%20from%202022).)). On top of that, globally South Korea is also ranked 13 in terms of GDP ([SOURCE](https://www.worlddata.info/asia/south-korea/economy.php#:~:text=Worldwide%20gross%20domestic%20product%20in,is%20currently%20at%20rank%2013.)). This means that South Korea is the target market for RACE given their willingness to purchase luxury and their ability to purchase luxury. However, the number of shipments to South Korea is so small that RACE does not report the individual country’s % contribution.\n\n\n\n***China***\n\n“Young market...the number of car that we shipped with this market is not so big.” - 2023 Q4 Earnings conference. China is a big opportunity for RACE for several reasons 1) China is a rapidly growing economy thanks to massive government subsidies and cheaper labor, which means that there are more and more wealthy citizens. 2) China’s culture cares about “Face”. Face is, in essence, social status. Having a luxury car in China is seen as a status symbol. RACE doesn't intend to rapidly expand in China as it is trying to control the supply of Ferraris in China to create the impression of scarcity and drum up value. However, I believe that the growing class of wealthy individuals in China represents a large opportunity for RACE.\n\n\n\n***Luxury Goods***\n\nThere is a growing distinction between “New Money” and “Old Money”. Old Money means generational wealth where they prefer less flashy but significantly higher-quality products, “Stealth Wealth”. Whereas New Money means a growing group of people who transitioned above the middle class, they see the need to buy flashy products with strong logos to flaunt their wealth. There is also a growing desire amongst younger people to purchase luxury goods due to social media constantly promoting these goods, creating the impression that to own a luxury product is to be part of an exclusive group, playing into the large FOMO factor of this demographic. As an example, 62% of GUCCI’s customers are under 35 ([SOURCE](https://jingdaily.com/posts/gucci-success-millennials-gen-z)) This distinction means that the demographic of customers purchasing luxurious goods is not the ultra-wealthy but the rising upper middle class. So, I believe that RACE's main demographic is the younger New Money crowd.\n\n\n\n# Revenue:\n\n***Cars and Spare Parts***\n\n“Cars and Spare Parts” include selling Ferrari cars, their spare parts, and personalization.  Taking a look at data from ([SOURCE](https://www.statista.com/statistics/695882/number-of-car-shipments-made-by-the-italian-sports-car-company-ferrari/))\n\nWhen forecasting the number of shipments, from FY11 to FY23 the number of Ferrari shipped grew at a Y/Y CAGR of 6.00%. I assumed that this growth rate would tick slightly upwards as RACE pushes out its electric vehicle line-up and its new Purosangue line-up. However, in perpetuity, I assumed that RACE would taper the growth rate of their shipments down towards historical averages to keep the total number of Ferraris on the road low to maintain the brand’s image. \n\nWhen forecasting the Revenue/Shipment, I believe that in the earlier years of my forecast due to RACE pushing out their newer EVs, they would not increase prices to a large extent. However, over time due to the growth in the number of wealthy people ([SOURCE](https://www.forbes.com/sites/russellflannery/2022/09/21/world-will-have-nearly-40-more-millionaires-by-2026--credit-suisse/)), RACE would increase the sale price of their cars to control the number of Ferrari on the road and maintain the luxurious image of a Ferrari. I also believe that over time as Personalization becomes more prevalent in the Ferrari experience ([SOURCE](https://www.mckinsey.com/capabilities/growth-marketing-and-sales/our-insights/the-value-of-getting-personalization-right-or-wrong-is-multiplying)), RACE can charge a higher amount. I believe that in perpetuity, Revenue/Shipment grows at a slightly higher rate than the perpetual inflation rate. As Ferraris are luxury goods, they command a higher premium and are likely to attract consumers who are price-inelastic.\n\n\n\n***Sponsorship, Commercial and Brand***\n\n“Sponsorship, Commercial and Brand” includes brand sponsorship Ferrari earns from F1 and other racing events and any merchandise sold.\n\nThe main value driver behind Ferrari isn’t the fact that they’ve managed to raise their revenue but rather it’s because the Ferrari branding has become more and more valuable over time due to their prominence in motorsports. As a proxy, I took a look at professional soccer teams, soccer teams have massively low margins attributable to a few factors such as 1) Uncertainty in performance and 2) inflating player salaries. A sports team can’t control how it will perform as every sport is very dynamic with multiple unpredictable factors at play, consistently poor performance will lead to the team losing fans, and in turn, since there are less monetizable eyeballs the team will end up losing sponsorship deals. The valuation of these sports teams is largely based on precedent transactions as there are no stable cash flows that these teams can generate. In the case of F1 where there are only 10 teams, there is not much competition for talent which negates the issue of inflating player salaries. RACE has also been consistently placing in the top spots in F1. So, Ferrari hopes it can leverage this branding to appeal to sponsors. \n\nWhen forecasting the number of sponsors, I took a look at the number of sponsors to Ferrari’s F1 team, Scuderia Ferrari. This is so as Ferrari places heavy emphasis on their F1 team specifically mentioning their importance to Ferrari’s strong brand recognition. And, “Formula 1 is a channel through which Ferrari's potential target audience can be reached directly” ([SOURCE](https://www.cascade.app/studies/ferrari-strategy-study)). I believe to not overly dilute the value of being a team sponsor, RACE caps the number of sponsors at 40. \n\nWhen forecasting Revenue/Sponsor, sponsorship is mainly for advertising purposes which is a cyclical expenditure that explains the recent decline in the growth rate of revenue/sponsor. I assumed that in the first 2 years of my forecast, given the uncertainty in macro conditions advertising spending would remain depressed. However, ultimately, as the Ferrari brand increases in value so will the sponsorship amount. In perpetuity, I assumed that revenue/sponsor would grow at a slightly higher rate than the perpetual inflation rate.\n\n\n\n***Engines***\n\n“Engines” includes any engine sold to Maserati and other F1 teams. However “Maserati whose contract expired at the end of 2023. Therefore, from the first quarter 2024 onward, any residual contribution from the sales of engine and spare parts, whether for sport cars or racing, will be reported in the bar, named others.” - 2023 Q4 Earnings Conference. So, I lumped Engines and Others together.\n\n\n\n# Cost:\n\n***COGS***\n\nWhen forecasting COGS, RACE incurs higher costs in their earlier years of producing the new line-up of EVs. I assumed that over time as RACE’s supply chain matures they can maintain their historic margins. According to ([SOURCE](https://ycharts.com/companies/RACE/gross_profit_margin)), RACE’s pre-covid margins hovered around 52%.\n\n\n\n***SG&A and Others***\n\nWhen forecasting the Number of Employees, Cost/Employee, and Others, opting for less granularity I forecasted it as a % of historical averages.\n\n\n\n***R&D***\n\nGiven management’s push towards producing higher quality EVs, it has led to a lot of front-loaded R&D expenditure in FY21, which management ended up cutting back in FY22 and FY23. So, when forecasting R&D I assumed that in the earlier years of my forecast R&D expenditure would remain at recent historical levels before tapering back to 18.5% at pre-covid levels\n\n\n\n# Taxes:\n\nGiven that RACE is incorporated in The Netherlands, the marginal tax rate is 25.80% ([SOURCE](https://taxsummaries.pwc.com/netherlands/corporate/taxes-on-corporate-income#:~:text=Standard%20corporate%20income%20tax%20(CIT,excess%20of%20the%20taxable%20income.)). So, in perpetuity, I assumed that RACE would pay taxes at 25.80%.\n\n\n\n# WACC:\n\nRFR (1M Avg) = 4.37%  \nStable Market ERP ([SOURCE](https://pages.stern.nyu.edu/~adamodar/New_Home_Page/datafile/ctryprem.html)) = 4.60%  \nBeta ([SOURCE](https://finance.yahoo.com/quote/RACE/)) = 1.01  \nCOE = 9.02%\n\nRACE has no bond rating. So, I decided to apply a synthetic rating from ([SOURCE](https://pages.stern.nyu.edu/~adamodar/New_Home_Page/datafile/ratings.html))  \nFY23 EBIT = 1617.37M  \nFY23 Interest Expense = 29.26M  \nFY23 Interest Coverage Ratio = 55.3x  \nBy Synthetic Rating, RACE would be rated “AAA”, given that The Netherlands is also rated “AAA”. RACE is appropriate to be rated AAA.  \nAAA Bond Yield = 4.37%  \nMarginal Tax Rate = 25.80%  \nAT COD = 3.24%\n\nStock Price (5D Avg) = $390.20  \nShares O/S = 243.75M  \nMarket Value of Equity = 95111.25M  \nWeighted Average Maturity of Debt = 3 Years.  \nFY23 Interest Expense = 29.26M  \nMarket Value of Debt = 2005.61M\n\n%Debt =2.07%  \n%Equity = 97.93%  \n%WACC = 8.90%\n\n\n\n# Conclusion:\n\nUltimately in my base case, I value RACE at $267.31 per share. I believe that RACE is heavily overvalued as investors highly value the goodwill built by RACE. The function for shipment revenue is the quantity shipped and price per shipment. RACE faces a dilemma where if they increase their quantity shipped it would increase revenue but at the same time dilute the value of the Ferrari brand. There is a possibility that management could increase the other variable instead, but I am skeptical at what pace is management able to raise it comfortably. I believe that the road forward for RACE is to lean more heavily into its merchandise to remain in the public consciousness and to continue building brand goodwill.\n\nBase Case: \\[[INSERT](https://imgur.com/a/quc3b3u)\\]  \nBest Case: \\[[INSERT](https://imgur.com/a/ybN2jVV)\\]  \nWorst Case: \\[[INSERT](https://imgur.com/a/mhxYAEG)\\]  \nSanity Check: \\[[INSERT](https://imgur.com/a/JgrJyAI)\\]  \nRevenue Model: \\[[INSERT](https://imgur.com/a/9JsLdcm)\\]  \nCost Model: \\[[INSERT](https://imgur.com/a/DAS0c5b)\\]  \nChange in NWC Schedule: \\[[INSERT](https://imgur.com/a/T32HqtP)\\]  \nDebt Schedule: \\[[INSERT](https://imgur.com/a/5NDQIm2)\\]",
  "user_reports": [],
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Ferrari (RACE) DCF Analysis",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "",
  "downs": 0,
  "thumbnail_height": null,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_1dprbw3",
  "quarantine": false,
  "link_flair_text_color": null,
  "upvote_ratio": 0.79,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 21,
  "total_awards_received": 0,
  "media_embed": {},
  "thumbnail_width": null,
  "author_flair_template_id": null,
  "is_original_content": false,
  "author_fullname": "t2_cbzn3vw",
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Company Analysis",
  "can_mod_post": false,
  "score": 21,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "self",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "post_hint": "self",
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1719495013,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>Introduction:</h1>\n\n<p>Ferrari (RACE) is a well-known auto manufacturer that produces vehicles that are the pinnacle of the automobile industry. Having a legendary status and a fiercely loyal fan base, Tifosi. RACE relentlessly protects its brand image. Limiting the number of vehicles sold per year, who it sells its cars to, and even controlling where its product ends up online. This fierce protection of brand image is because most of Ferrari’s value comes from its strong brand goodwill that rivals the likes of Google, Disney, and even Coke. Ferrari is so adamant about protecting their brand image that it even opposes engaging in M&amp;A, as it believes that doing so will dilute the Ferrari company&#39;s unique genetics. (<a href=\"https://sg.news.yahoo.com/finance/news/ferrari-does-not-buy-other-145645411.html\">SOURCE</a>)</p>\n\n<h1>Market:</h1>\n\n<p><strong><em>South Korea</em></strong></p>\n\n<p>Taking a look at each country’s attitude towards luxury goods, South Korea is the most receptive towards luxury goods (<a href=\"https://uofhorang.com/south-korea-the-country-with-the-highest-per-capita-luxury-goods-consumption/#:%7E:text=Koreans&#x27;%20per%20capita%20spending%20on,globally%20(data%20from%202022\">SOURCE</a>.)). On top of that, globally South Korea is also ranked 13 in terms of GDP (<a href=\"https://www.worlddata.info/asia/south-korea/economy.php#:%7E:text=Worldwide%20gross%20domestic%20product%20in,is%20currently%20at%20rank%2013.\">SOURCE</a>). This means that South Korea is the target market for RACE given their willingness to purchase luxury and their ability to purchase luxury. However, the number of shipments to South Korea is so small that RACE does not report the individual country’s % contribution.</p>\n\n<p><strong><em>China</em></strong></p>\n\n<p>“Young market...the number of car that we shipped with this market is not so big.” - 2023 Q4 Earnings conference. China is a big opportunity for RACE for several reasons 1) China is a rapidly growing economy thanks to massive government subsidies and cheaper labor, which means that there are more and more wealthy citizens. 2) China’s culture cares about “Face”. Face is, in essence, social status. Having a luxury car in China is seen as a status symbol. RACE doesn&#39;t intend to rapidly expand in China as it is trying to control the supply of Ferraris in China to create the impression of scarcity and drum up value. However, I believe that the growing class of wealthy individuals in China represents a large opportunity for RACE.</p>\n\n<p><strong><em>Luxury Goods</em></strong></p>\n\n<p>There is a growing distinction between “New Money” and “Old Money”. Old Money means generational wealth where they prefer less flashy but significantly higher-quality products, “Stealth Wealth”. Whereas New Money means a growing group of people who transitioned above the middle class, they see the need to buy flashy products with strong logos to flaunt their wealth. There is also a growing desire amongst younger people to purchase luxury goods due to social media constantly promoting these goods, creating the impression that to own a luxury product is to be part of an exclusive group, playing into the large FOMO factor of this demographic. As an example, 62% of GUCCI’s customers are under 35 (<a href=\"https://jingdaily.com/posts/gucci-success-millennials-gen-z\">SOURCE</a>) This distinction means that the demographic of customers purchasing luxurious goods is not the ultra-wealthy but the rising upper middle class. So, I believe that RACE&#39;s main demographic is the younger New Money crowd.</p>\n\n<h1>Revenue:</h1>\n\n<p><strong><em>Cars and Spare Parts</em></strong></p>\n\n<p>“Cars and Spare Parts” include selling Ferrari cars, their spare parts, and personalization.  Taking a look at data from (<a href=\"https://www.statista.com/statistics/695882/number-of-car-shipments-made-by-the-italian-sports-car-company-ferrari/\">SOURCE</a>)</p>\n\n<p>When forecasting the number of shipments, from FY11 to FY23 the number of Ferrari shipped grew at a Y/Y CAGR of 6.00%. I assumed that this growth rate would tick slightly upwards as RACE pushes out its electric vehicle line-up and its new Purosangue line-up. However, in perpetuity, I assumed that RACE would taper the growth rate of their shipments down towards historical averages to keep the total number of Ferraris on the road low to maintain the brand’s image. </p>\n\n<p>When forecasting the Revenue/Shipment, I believe that in the earlier years of my forecast due to RACE pushing out their newer EVs, they would not increase prices to a large extent. However, over time due to the growth in the number of wealthy people (<a href=\"https://www.forbes.com/sites/russellflannery/2022/09/21/world-will-have-nearly-40-more-millionaires-by-2026--credit-suisse/\">SOURCE</a>), RACE would increase the sale price of their cars to control the number of Ferrari on the road and maintain the luxurious image of a Ferrari. I also believe that over time as Personalization becomes more prevalent in the Ferrari experience (<a href=\"https://www.mckinsey.com/capabilities/growth-marketing-and-sales/our-insights/the-value-of-getting-personalization-right-or-wrong-is-multiplying\">SOURCE</a>), RACE can charge a higher amount. I believe that in perpetuity, Revenue/Shipment grows at a slightly higher rate than the perpetual inflation rate. As Ferraris are luxury goods, they command a higher premium and are likely to attract consumers who are price-inelastic.</p>\n\n<p><strong><em>Sponsorship, Commercial and Brand</em></strong></p>\n\n<p>“Sponsorship, Commercial and Brand” includes brand sponsorship Ferrari earns from F1 and other racing events and any merchandise sold.</p>\n\n<p>The main value driver behind Ferrari isn’t the fact that they’ve managed to raise their revenue but rather it’s because the Ferrari branding has become more and more valuable over time due to their prominence in motorsports. As a proxy, I took a look at professional soccer teams, soccer teams have massively low margins attributable to a few factors such as 1) Uncertainty in performance and 2) inflating player salaries. A sports team can’t control how it will perform as every sport is very dynamic with multiple unpredictable factors at play, consistently poor performance will lead to the team losing fans, and in turn, since there are less monetizable eyeballs the team will end up losing sponsorship deals. The valuation of these sports teams is largely based on precedent transactions as there are no stable cash flows that these teams can generate. In the case of F1 where there are only 10 teams, there is not much competition for talent which negates the issue of inflating player salaries. RACE has also been consistently placing in the top spots in F1. So, Ferrari hopes it can leverage this branding to appeal to sponsors. </p>\n\n<p>When forecasting the number of sponsors, I took a look at the number of sponsors to Ferrari’s F1 team, Scuderia Ferrari. This is so as Ferrari places heavy emphasis on their F1 team specifically mentioning their importance to Ferrari’s strong brand recognition. And, “Formula 1 is a channel through which Ferrari&#39;s potential target audience can be reached directly” (<a href=\"https://www.cascade.app/studies/ferrari-strategy-study\">SOURCE</a>). I believe to not overly dilute the value of being a team sponsor, RACE caps the number of sponsors at 40. </p>\n\n<p>When forecasting Revenue/Sponsor, sponsorship is mainly for advertising purposes which is a cyclical expenditure that explains the recent decline in the growth rate of revenue/sponsor. I assumed that in the first 2 years of my forecast, given the uncertainty in macro conditions advertising spending would remain depressed. However, ultimately, as the Ferrari brand increases in value so will the sponsorship amount. In perpetuity, I assumed that revenue/sponsor would grow at a slightly higher rate than the perpetual inflation rate.</p>\n\n<p><strong><em>Engines</em></strong></p>\n\n<p>“Engines” includes any engine sold to Maserati and other F1 teams. However “Maserati whose contract expired at the end of 2023. Therefore, from the first quarter 2024 onward, any residual contribution from the sales of engine and spare parts, whether for sport cars or racing, will be reported in the bar, named others.” - 2023 Q4 Earnings Conference. So, I lumped Engines and Others together.</p>\n\n<h1>Cost:</h1>\n\n<p><strong><em>COGS</em></strong></p>\n\n<p>When forecasting COGS, RACE incurs higher costs in their earlier years of producing the new line-up of EVs. I assumed that over time as RACE’s supply chain matures they can maintain their historic margins. According to (<a href=\"https://ycharts.com/companies/RACE/gross_profit_margin\">SOURCE</a>), RACE’s pre-covid margins hovered around 52%.</p>\n\n<p><strong><em>SG&amp;A and Others</em></strong></p>\n\n<p>When forecasting the Number of Employees, Cost/Employee, and Others, opting for less granularity I forecasted it as a % of historical averages.</p>\n\n<p><strong><em>R&amp;D</em></strong></p>\n\n<p>Given management’s push towards producing higher quality EVs, it has led to a lot of front-loaded R&amp;D expenditure in FY21, which management ended up cutting back in FY22 and FY23. So, when forecasting R&amp;D I assumed that in the earlier years of my forecast R&amp;D expenditure would remain at recent historical levels before tapering back to 18.5% at pre-covid levels</p>\n\n<h1>Taxes:</h1>\n\n<p>Given that RACE is incorporated in The Netherlands, the marginal tax rate is 25.80% (<a href=\"https://taxsummaries.pwc.com/netherlands/corporate/taxes-on-corporate-income#:%7E:text=Standard%20corporate%20income%20tax%20(CIT,excess%20of%20the%20taxable%20income.\">SOURCE</a>). So, in perpetuity, I assumed that RACE would pay taxes at 25.80%.</p>\n\n<h1>WACC:</h1>\n\n<p>RFR (1M Avg) = 4.37%<br/>\nStable Market ERP (<a href=\"https://pages.stern.nyu.edu/%7Eadamodar/New_Home_Page/datafile/ctryprem.html\">SOURCE</a>) = 4.60%<br/>\nBeta (<a href=\"https://finance.yahoo.com/quote/RACE/\">SOURCE</a>) = 1.01<br/>\nCOE = 9.02%</p>\n\n<p>RACE has no bond rating. So, I decided to apply a synthetic rating from (<a href=\"https://pages.stern.nyu.edu/%7Eadamodar/New_Home_Page/datafile/ratings.html\">SOURCE</a>)<br/>\nFY23 EBIT = 1617.37M<br/>\nFY23 Interest Expense = 29.26M<br/>\nFY23 Interest Coverage Ratio = 55.3x<br/>\nBy Synthetic Rating, RACE would be rated “AAA”, given that The Netherlands is also rated “AAA”. RACE is appropriate to be rated AAA.<br/>\nAAA Bond Yield = 4.37%<br/>\nMarginal Tax Rate = 25.80%<br/>\nAT COD = 3.24%</p>\n\n<p>Stock Price (5D Avg) = $390.20<br/>\nShares O/S = 243.75M<br/>\nMarket Value of Equity = 95111.25M<br/>\nWeighted Average Maturity of Debt = 3 Years.<br/>\nFY23 Interest Expense = 29.26M<br/>\nMarket Value of Debt = 2005.61M</p>\n\n<p>%Debt =2.07%<br/>\n%Equity = 97.93%<br/>\n%WACC = 8.90%</p>\n\n<h1>Conclusion:</h1>\n\n<p>Ultimately in my base case, I value RACE at $267.31 per share. I believe that RACE is heavily overvalued as investors highly value the goodwill built by RACE. The function for shipment revenue is the quantity shipped and price per shipment. RACE faces a dilemma where if they increase their quantity shipped it would increase revenue but at the same time dilute the value of the Ferrari brand. There is a possibility that management could increase the other variable instead, but I am skeptical at what pace is management able to raise it comfortably. I believe that the road forward for RACE is to lean more heavily into its merchandise to remain in the public consciousness and to continue building brand goodwill.</p>\n\n<p>Base Case: [<a href=\"https://imgur.com/a/quc3b3u\">INSERT</a>]<br/>\nBest Case: [<a href=\"https://imgur.com/a/ybN2jVV\">INSERT</a>]<br/>\nWorst Case: [<a href=\"https://imgur.com/a/mhxYAEG\">INSERT</a>]<br/>\nSanity Check: [<a href=\"https://imgur.com/a/JgrJyAI\">INSERT</a>]<br/>\nRevenue Model: [<a href=\"https://imgur.com/a/9JsLdcm\">INSERT</a>]<br/>\nCost Model: [<a href=\"https://imgur.com/a/DAS0c5b\">INSERT</a>]<br/>\nChange in NWC Schedule: [<a href=\"https://imgur.com/a/T32HqtP\">INSERT</a>]<br/>\nDebt Schedule: [<a href=\"https://imgur.com/a/5NDQIm2\">INSERT</a>]</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": true,
  "pinned": false,
  "over_18": false,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/Tkr4AaNQe5FAKIhTr1xDsoA76BAwiAMgSpEuw2eK6ek.jpg?auto=webp&s=ac236dff798b16ef2533004f1a07c13f3522d4c9",
          "width": 1282,
          "height": 657
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/Tkr4AaNQe5FAKIhTr1xDsoA76BAwiAMgSpEuw2eK6ek.jpg?width=108&crop=smart&auto=webp&s=f48002bf105e367fcb8131cad2f9c81571173a19",
            "width": 108,
            "height": 55
          },
          {
            "url": "https://external-preview.redd.it/Tkr4AaNQe5FAKIhTr1xDsoA76BAwiAMgSpEuw2eK6ek.jpg?width=216&crop=smart&auto=webp&s=66ccaad4b6ca7de3c21b09b1496b67aa38d9c111",
            "width": 216,
            "height": 110
          },
          {
            "url": "https://external-preview.redd.it/Tkr4AaNQe5FAKIhTr1xDsoA76BAwiAMgSpEuw2eK6ek.jpg?width=320&crop=smart&auto=webp&s=43ee9a4ae69796ee35ceb9520ffceea4a221c361",
            "width": 320,
            "height": 163
          },
          {
            "url": "https://external-preview.redd.it/Tkr4AaNQe5FAKIhTr1xDsoA76BAwiAMgSpEuw2eK6ek.jpg?width=640&crop=smart&auto=webp&s=539254ee93f5f6d878170da77b8e3e1741e6e7c6",
            "width": 640,
            "height": 327
          },
          {
            "url": "https://external-preview.redd.it/Tkr4AaNQe5FAKIhTr1xDsoA76BAwiAMgSpEuw2eK6ek.jpg?width=960&crop=smart&auto=webp&s=4bd33e2bab56e3fa895907b09368b71be619013a",
            "width": 960,
            "height": 491
          },
          {
            "url": "https://external-preview.redd.it/Tkr4AaNQe5FAKIhTr1xDsoA76BAwiAMgSpEuw2eK6ek.jpg?width=1080&crop=smart&auto=webp&s=114ec115621f940102b89f1ca64f45964cfeba64",
            "width": 1080,
            "height": 553
          }
        ],
        "variants": {},
        "id": "6ToKJ6eg6vYEcdAPxOxoF9kvHgwuNkqvqxWZijTNvDk"
      }
    ],
    "enabled": false
  },
  "all_awardings": [],
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "1235582c-6848-11eb-96e8-0e132357f477",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#d6890a",
  "id": "1dprbw3",
  "is_robot_indexable": true,
  "num_duplicates": 0,
  "report_reasons": null,
  "author": "Hanzoisbad",
  "discussion_type": null,
  "num_comments": 2,
  "send_replies": true,
  "media": null,
  "contest_mode": false,
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/1dprbw3/ferrari_race_dcf_analysis/",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/1dprbw3/ferrari_race_dcf_analysis/",
  "subreddit_subscribers": 8018603,
  "created_utc": 1719495013,
  "num_crossposts": 0,
  "mod_reports": [],
  "is_video": false,
  "comments": [
    {
      "subreddit_id": "t5_2qjfk",
      "approved_at_utc": null,
      "author_is_blocked": false,
      "comment_type": null,
      "awarders": [],
      "mod_reason_by": null,
      "banned_by": null,
      "author_flair_type": "text",
      "total_awards_received": 0,
      "subreddit": "stocks",
      "author_flair_template_id": null,
      "likes": null,
      "replies": [],
      "user_reports": [],
      "saved": false,
      "id": "laotp5k",
      "banned_at_utc": null,
      "mod_reason_title": null,
      "gilded": 0,
      "archived": false,
      "collapsed_reason_code": null,
      "no_follow": true,
      "author": "stiveooo",
      "can_mod_post": false,
      "created_utc": 1719587002,
      "send_replies": true,
      "parent_id": "t3_1dprbw3",
      "score": 1,
      "author_fullname": "t2_9amaa",
      "approved_by": null,
      "mod_note": null,
      "all_awardings": [],
      "collapsed": false,
      "body": "mine is 264$\n\nill keep buying. but keep it below 5%",
      "edited": false,
      "top_awarded_type": null,
      "author_flair_css_class": null,
      "name": "t1_laotp5k",
      "is_submitter": false,
      "downs": 0,
      "author_flair_richtext": [],
      "author_patreon_flair": false,
      "body_html": "<div class=\"md\"><p>mine is 264$</p>\n\n<p>ill keep buying. but keep it below 5%</p>\n</div>",
      "removal_reason": null,
      "collapsed_reason": null,
      "distinguished": null,
      "associated_award": null,
      "stickied": false,
      "author_premium": false,
      "can_gild": false,
      "gildings": {},
      "unrepliable_reason": null,
      "author_flair_text_color": null,
      "score_hidden": false,
      "permalink": "/r/stocks/comments/1dprbw3/ferrari_race_dcf_analysis/laotp5k/",
      "subreddit_type": "public",
      "locked": false,
      "report_reasons": null,
      "created": 1719587002,
      "author_flair_text": null,
      "treatment_tags": [],
      "link_id": "t3_1dprbw3",
      "subreddit_name_prefixed": "r/stocks",
      "controversiality": 0,
      "depth": 0,
      "author_flair_background_color": null,
      "collapsed_because_crowd_control": null,
      "mod_reports": [],
      "num_reports": null,
      "ups": 1
    },
    {
      "subreddit_id": "t5_2qjfk",
      "approved_at_utc": null,
      "author_is_blocked": false,
      "comment_type": null,
      "awarders": [],
      "mod_reason_by": null,
      "banned_by": null,
      "author_flair_type": "text",
      "total_awards_received": 0,
      "subreddit": "stocks",
      "author_flair_template_id": null,
      "likes": null,
      "replies": [],
      "user_reports": [],
      "saved": false,
      "id": "laljo4n",
      "banned_at_utc": null,
      "mod_reason_title": null,
      "gilded": 0,
      "archived": false,
      "collapsed_reason_code": null,
      "no_follow": true,
      "author": "dewhit6959",
      "can_mod_post": false,
      "created_utc": 1719529294,
      "send_replies": true,
      "parent_id": "t3_1dprbw3",
      "score": 1,
      "author_fullname": "t2_pnavzoewb",
      "approved_by": null,
      "mod_note": null,
      "all_awardings": [],
      "collapsed": false,
      "body": "cut-n-paste award",
      "edited": false,
      "top_awarded_type": null,
      "author_flair_css_class": null,
      "name": "t1_laljo4n",
      "is_submitter": false,
      "downs": 0,
      "author_flair_richtext": [],
      "author_patreon_flair": false,
      "body_html": "<div class=\"md\"><p>cut-n-paste award</p>\n</div>",
      "removal_reason": null,
      "collapsed_reason": null,
      "distinguished": null,
      "associated_award": null,
      "stickied": false,
      "author_premium": false,
      "can_gild": false,
      "gildings": {},
      "unrepliable_reason": null,
      "author_flair_text_color": null,
      "score_hidden": false,
      "permalink": "/r/stocks/comments/1dprbw3/ferrari_race_dcf_analysis/laljo4n/",
      "subreddit_type": "public",
      "locked": false,
      "report_reasons": null,
      "created": 1719529294,
      "author_flair_text": null,
      "treatment_tags": [],
      "link_id": "t3_1dprbw3",
      "subreddit_name_prefixed": "r/stocks",
      "controversiality": 0,
      "depth": 0,
      "author_flair_background_color": null,
      "collapsed_because_crowd_control": null,
      "mod_reports": [],
      "num_reports": null,
      "ups": 1
    }
  ]
}