{
  "title": "[deleted by user]",
  "score": 164,
  "selftext": "[removed]",
  "link_flair_text": null,
  "id": "1bxwyxn",
  "num_comments": 24,
  "created_utc": 1712469028,
  "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/",
  "comments": [
    {
      "id": "kyfqvyw",
      "score": 62,
      "body": "I need to get a promotion before the next crash because this is literally the only free money hack on the planet",
      "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kyfqvyw/",
      "created": 1712472622,
      "depth": 0,
      "replies": [
        {
          "id": "kyg6rf4",
          "score": 4,
          "body": "Lmfao. You need more 8balls",
          "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kyg6rf4/",
          "created": 1712483914,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyfy6ao",
      "score": 25,
      "body": "Isn't the whole point of leveraged ETFs that you *aren't* supposed to hold them long-term? Something about the leveraged return hurting on the downside more than the upside in the long-term.",
      "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kyfy6ao/",
      "created": 1712477660,
      "depth": 0,
      "replies": [
        {
          "id": "kyfztby",
          "score": 8,
          "body": "That’s a myth. \n\nhttps://www.bogleheads.org/forum/viewtopic.php?f=10&t=272007",
          "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kyfztby/",
          "created": 1712478849,
          "depth": 1,
          "replies": [
            {
              "id": "kyg1w6t",
              "score": 15,
              "body": "I think [this](https://www.afrugaldoctor.com/home/volatility-decay-dont-hold-leveraged-etfs-long-term) discussion disagrees along with [this](https://www.afrugaldoctor.com/home/leveraged-etfs-and-volatility-decay-part-2) follow-up, what do you think?\n\n>A natural question then arises: if we are so sure about the S&P 500 going up in the long run, why not borrow money to invest in it? If we could borrow money on better terms than the S&P 500 returns, we’ll come out ahead. The idea of borrowing money, also known as using leverage, is probably as old as investing itself. Leverage allows us to amplify the returns on investment, but of course, any potential losses are amplified as well. Use of leverage is very common in real estate investing - why pay full price for a rental property when you can pay 20% down instead? Your potential returns are amplified 5-fold. \n\n\n\n> Of course, leveraged ETFs are active products with high expense ratios. UPRO has an expense ratio of 0.93, which is quite high compared to VOO at 0.03. The reason for such a high expense ratio is that leveraged ETFs incur significant fees from daily rebalancing and interest and transaction fees. But isn’t the expense ratio worth it if UPRO can triple the S&P 500’s performance? In fact, since stocks will almost certainly go up in 30, 20, or even 10 years, shouldn’t long-term investors all invest in a leveraged ETF instead?\n\n>The answer is a resounding NO. Leveraged ETFs are designed for short-term trading. Due to a phenomenon called volatility decay, holding a leveraged ETF long-term can be very dangerous. This is the case even with a hypothetical “perfect” leveraged ETF which incurs no expense ratio and perfectly replicates 3x the index every day!\n\n>Let’s look at a hypothetical index, the A Frugal Doctor (AFD) index, that starts at 1000. Over the next week of trading, the index posts small but consistent gains daily and ends the week at 1011. Let’s also have a hypothetical ETF, the triple-leveraged AFDx3, which perfectly amplifies every daily movement by 3x and ends the week at 1034. In this scenario, triple leveraging worked as expected. \n\n>More realistically, however, stocks are volatile and the index fluctuates from trading activity. It gains 3% one day and loses 7% the next, and so on. After a week of trading, the index still ends at 1011. Let’s see how AFDx3 performed compared to AFD itself under these circumstances. As you can see, although AFD ended up overall for the week, AFDx3 underperformed the index and ended in the red! The amplification of both gains and losses makes AFDx3 much more volatile than AFD itself, and can result in a sequence of returns where the index ends positive but the leveraged version does not. In fact, because any loss is so devastating when amplified, the leveraged ETF can only reliably beat the index if volatility was minimal, and even when it beats the index, it is unlikely to return 3x of the index itself. And remember that AFDx3 is a “perfect” triple leveraged ETF with no expenses! Also, consider the downside risk: if a normal index ends down 34%, you still have 66% of your portfolio value left for a future recovery. But a triple leveraged product will be wiped out completely.\n\nAgain, I don't think leveraged ETFs are bad and shouldn't be touched, I just think they are not a good pick for long-term large percentage of your portfolio.",
              "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kyg1w6t/",
              "created": 1712480373,
              "depth": 2,
              "replies": [
                {
                  "id": "kygehld",
                  "score": 3,
                  "body": "This is a terrible answer. This basically just says leverage bad and high cost. Ok ETFs were all higher cost 10/20 years ago so were they bad investments? The leverage example you have given is literally child math. We had a total 33.7% decline in 2022 and TQQQ didn't go to zero. Go research why. There is no real possibility like in your example of a single day 34% decline because of circuit breakers. It's all just myths and bad information like OP says.\n\nLETFs are definitely more risky and a 70:30 for a 65y old investor who sweats when the index goes down 0.5% those should never touch these which is why all the influencer keep saying this. Risk adjusted they're slightly worse than the underlying ETFs. Compared to options they're safe AF. If you don't feel safe there's also just 1.25x leverage that has research behind it of being just straight up beneficial almost always.\n\nThe opinion that you link here is mostly for elderly investors because most investment advice is aimed at the elderly because they have more money around. That's where advisors make money. If you're younger a total wipeout is way less of a risk then underperforming due to bad strategies that are too safe.\n\n[https://www.spglobal.com/spdji/en/documents/education/education-leveraged-strategies-benefits-of-implementing-a-moderate-amount-of-leverage.pdf](https://www.spglobal.com/spdji/en/documents/education/education-leveraged-strategies-benefits-of-implementing-a-moderate-amount-of-leverage.pdf)",
                  "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kygehld/",
                  "created": 1712489147,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "kyg5a1a",
                  "score": 2,
                  "body": "Just to clarify because this doesn’t. \n\nJust say the index ends the day up 5% 5 days in a row but intraday on each of those days there was some pretty big swings, the leveraged ETF would have to rebalance its exposure daily. Because of the rebalancing and how compounding gains work (missing out on .5% here and there due to rebalancing) the losses can add up quickly. \n\nConstantly having to rebalance the leveraged ETF can add up to a lot of missed gains during times of volatility, other known as volatility decay. \n\nThe longer you hold a leveraged ETF the more risk you incur.",
                  "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kyg5a1a/",
                  "created": 1712482841,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kyg8aie",
                      "score": 3,
                      "body": "[deleted]",
                      "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kyg8aie/",
                      "created": 1712485002,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "kyg9j1x",
                          "score": 1,
                          "body": "You’re not factoring in there is much more volatility post-Covid than pre-Covid and that expense ratio of 0.92% over a ten year period will eat up a lot of your CAGR. \n\nBut hey man, if you can make it work and you think you found something not many know about stop trying to convince people and capitalize on it. Let us know by posting some life changing gains then write a book and a retire.",
                          "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kyg9j1x/",
                          "created": 1712485865,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "kyiz548",
                  "score": 1,
                  "body": "There's no free lunch. Any type of outsized returns will have large drawdowns. If you had 100k in NVDA in 2021 it would be ~30k at one point in 2022 and close to 300k now.\n\nThe 2x and 3x long ETFs with low volatility underlyings (SPY/QQQ, not TSLA) can very well be held long term since the decay effect isn't as severe with smaller moves + there are simply more up days than down days. That's why you can hold leveraged long ETFs like TQQQ, but leveraged short ETFs trend to zero over time. If you don't believe me look up TQQQ vs SQQQ charts over the past 10 years. Drawdowns can be severe with TQQQ, similarily to holding a volatile stock, but as long as the market makes new ATHs you'll come out ahead vs just holding QQQ.",
                  "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kyiz548/",
                  "created": 1712524763,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "kyg60p2",
                  "score": -1,
                  "body": "This is absolutely the right way to think about leveraged ETFs. The problem with these kinds of ETFs stems from the simple fact that if you lose 50% you need to make 100% back to be where you were before but if you make 50% you only need to lose 33% to be back where you started. So the amplification in some way works stronger when the returns are negative than when they are positive.",
                  "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kyg60p2/",
                  "created": 1712483378,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kyg6tpz",
                      "score": 4,
                      "body": "That’s all returns though, I get what you mean though. There’s always a real possibility you could blow your account for a solid three years or even completely",
                      "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kyg6tpz/",
                      "created": 1712483960,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "kygcep4",
      "score": 7,
      "body": "You got lucky and essentially timed the bottom of the market. Others that buy in now and hold will not be as fortunate.",
      "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kygcep4/",
      "created": 1712487831,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyg0jgl",
      "score": 6,
      "body": "TQQQ GANG ![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)",
      "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kyg0jgl/",
      "created": 1712479384,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyg9lym",
      "score": 3,
      "body": "0.88% expense ratio, i'll pass.",
      "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kyg9lym/",
      "created": 1712485923,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyfveuf",
      "score": 7,
      "body": "0.88% expense ratio, isn't that high?",
      "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kyfveuf/",
      "created": 1712475701,
      "depth": 0,
      "replies": [
        {
          "id": "kyg48wt",
          "score": 4,
          "body": "are you kidding lmao",
          "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kyg48wt/",
          "created": 1712482090,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kygaj5x",
      "score": 2,
      "body": "What sort of positions and did you trade daily/weekly? Looking at the TQQQ chart, April 2021 was ~50 and April 2024 is ~60. Did you hit the selloff in Dec 2021 and buy back perfectly?",
      "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kygaj5x/",
      "created": 1712486559,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyflei6",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 weeks ago\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kyflei6/",
      "created": 1712469045,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyg2f7b",
      "score": 1,
      "body": "V nice",
      "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kyg2f7b/",
      "created": 1712480750,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kygeujo",
      "score": 1,
      "body": "Interesting",
      "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kygeujo/",
      "created": 1712489367,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kygfq5p",
      "score": 1,
      "body": "Market is probably dead money for the next couple years, I can't wait to see the update on this post in 2 years when all the gains are gone and spy is back at 410.",
      "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kygfq5p/",
      "created": 1712489882,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyg6qo7",
      "score": 1,
      "body": "You obviously didn’t trade or invest prior to the 15 year bull market.",
      "permalink": "/r/wallstreetbets/comments/1bxwyxn/deleted_by_user/kyg6qo7/",
      "created": 1712483899,
      "depth": 0,
      "replies": []
    }
  ]
}