{
  "title": "I like the Weed Stonks but do the Weedstonks like me? TLRY if you are out there please help us.",
  "score": 163,
  "selftext": "Bags are packed. TLRY send me into early retirement please thank you ",
  "link_flair_text": "Loss",
  "id": "1byvnt3",
  "num_comments": 196,
  "created_utc": 1712576300,
  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/",
  "url_overridden_by_dest": "https://i.redd.it/fyh1e9fls8tc1.jpeg",
  "comments": [
    {
      "id": "kyls2tk",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 2896 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyls2tk/",
      "created": 1712576305,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kym2j63",
      "score": 28,
      "body": "Earnings tomorrow",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kym2j63/",
      "created": 1712581354,
      "depth": 0,
      "replies": [
        {
          "id": "kymffhi",
          "score": 25,
          "body": "So I’ve heard…. Irwin better slither up on that call and make some snake oil sales",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymffhi/",
          "created": 1712586471,
          "depth": 1,
          "replies": [
            {
              "id": "kymw97a",
              "score": 25,
              "body": "TLRY has missed the past 5 or 6 earnings calls\n\nThey met expectations the call prior to that but the stock went down anyways.\n\nIt’s a trash company. A dilution train chugging along. And they really have no choice. 900 million in liabilities, only 400 million cash, burn 200 million a year in cash, negative net incomes.\n\nThe only way they can continue to fund this operation is to dilute to raise money. They could sell assets or start making money but I wouldn’t hold my breath. \n\nIts trash. They also pay their grower in shares given at a preferred price that the grower then instantly dumps onto the market to get paid. We have pretty strong evidence this is the case bc when shareholders voted against dilution TLRY just gave their grower enough preferred stock to ram the vote through anyways. \n\nI hope they eat shit on earnings. I have a small put position dated out to June and I never play options. That’s how trash I think this company is.",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymw97a/",
              "created": 1712592431,
              "depth": 2,
              "replies": [
                {
                  "id": "kyn1zfc",
                  "score": 30,
                  "body": "Well damn I wish somebody told me all this before I bought calls",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyn1zfc/",
                  "created": 1712594458,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kyn47mq",
                      "score": 35,
                      "body": "You could do this thing where you look at a company’s financial statements and Google around to read news about them\n\nI think they call it research",
                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyn47mq/",
                      "created": 1712595226,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "kyn51db",
                          "score": 17,
                          "body": "nah your typical WSBer just believes all DD from ppl trying to pump a stock they're holding heavy bags on.  Its why we have the reputation of being regarded.",
                          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyn51db/",
                          "created": 1712595508,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "kynieqw",
                              "score": 9,
                              "body": "I feel attacked",
                              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynieqw/",
                              "created": 1712600240,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "kynpngw",
                                  "score": 3,
                                  "body": "at least you are self aware.  That's a notch up for the average WSBer.",
                                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynpngw/",
                                  "created": 1712602934,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "kz1iub0",
                                      "score": 2,
                                      "body": "I hold shitcoins and penny stocks what am I?",
                                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kz1iub0/",
                                      "created": 1712818160,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "kynrgg1",
                      "score": 2,
                      "body": "Yes trust a random regard on wsb. Always a good call",
                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynrgg1/",
                      "created": 1712603633,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "kynkdhq",
                  "score": 17,
                  "body": "You were off about how many earnings Tilray has missed in the last two years for one. They delivered record net revenue in Q1 2024 and their alcohol business is growing every quarter. They've proven a consistent commitment to lowering their EBITDA which again, has been seen in recent filings. They've said they'll be free-cash flow positive by Q4 2024. They're poised to fill a soon to be large vacuum in Germany post legalization\n\nYou're focusing on the negatives about Tilray in particular when every company in this sector is facing the same issues with margins, cash burn rate, etc because of the regulatory state of affairs which, any of us who are bullish on cannabis, believe changes are happening in the next few years. Rescheduling/Excise tax reform alone will be huge news.\n\nYou also visibly hate this stock/sector very much and just come off like you have an emotional take on the facts. You've posted on this thread multiple times and just have a huge chip on your shoulder, I guess well see in the end whos right",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynkdhq/",
                  "created": 1712600960,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kyo3808",
                      "score": 4,
                      "body": "It will take long time until commertial legalisation happens in Germany. The US won't come through either. Democrats will keep campaigning on a \"maybe\" for a couple election cycles, while republicans will straight up not do it due to hardliners.\n\nAll the while Tilray keeps burning money and diluting. Just go long on big tobacco. They will dominate once legalisation happens anyways.",
                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyo3808/",
                      "created": 1712607757,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "kyo7b9h",
                          "score": 2,
                          "body": "Their alcohol business is doing plenty to keep them afloat now - as of the last few months it’s officially a larger portion of their revenue. If that growth can stay consistent they will be able to weather the storm \n\nI don’t need to see full legalization - just a couple strong catalysts for my options to print - then I’ll be buying and holding long \n\n@ Republicans - take a look at how many of them are supporting SAFE banking - the winds are shifting and they know it",
                          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyo7b9h/",
                          "created": 1712609169,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "kypwbg0",
                              "score": 1,
                              "body": "What is safe banking?",
                              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kypwbg0/",
                              "created": 1712632966,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "kyq3kdz",
                                  "score": 2,
                                  "body": "legislation milling around the house and senate to allow cannabis companies to do business using the US banking system",
                                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyq3kdz/",
                                  "created": 1712636501,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "kyq5edb",
                                      "score": 1,
                                      "body": "thanks!",
                                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyq5edb/",
                                      "created": 1712637493,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "kynmos3",
                      "score": 2,
                      "body": "K I’m here in trade view\n\nI got TLRY zip\n\nI’m seeing 7 red earnings reports\n\nThose reds mean a negative surprise\nNow they might have hit revenues but they missed on EPS on every single one and only 3 of the seven did they not miss revenues as well\n\nSo the biggest mistake here is I said 5-6\n\nIt’s actually 7\n\nWow every company in the sector sucks dick? This is your argument. Hey TLRY might suck dick but all of weed stocks suck dick!\n\nReally convincing me \n\n\nI do hate TLRY. But you fanboy the sector and the stock. So we both are biased.",
                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynmos3/",
                      "created": 1712601828,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "kynvkr3",
                          "score": 1,
                          "body": "Except I came in with facts and a reasonable argument and you have nothing to dispute them with and you're spinning out.\n\nGood luck with your short position",
                          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynvkr3/",
                          "created": 1712605156,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "kynw21r",
                              "score": 1,
                              "body": "lol k. I did dispute them but you do you homie.",
                              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynw21r/",
                              "created": 1712605322,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "kyqrwiy",
                  "score": 2,
                  "body": "I got out after doing some research, seems like trash. CEO is a joke as well. Paying himself millions while the company is in the doldrums!",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyqrwiy/",
                  "created": 1712653061,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "kynjpvm",
                  "score": 3,
                  "body": "routinely forecasts wild targets \n\nearly last year they give up on 2024 EOY because they were on pace to miss it by -80%\n\nwholly based on US legalization and the pipe dream assumption their market share of it would be better (and grow more) than their measly 6-8% market share they routinely average in Canada\n\nthey’re not a giant operation. google their remaining Ontario facility. even that doesn’t look like a 2 billion dollar operation\n\nwas exponentially more sketchy when they were “worth” 35 billion in 2019 yet they operated out of that backwoods shit hole warehouse in Nanaimo, BC on Vancouver Island.\n\nthe valuations even yet today are wild. look at their green house in Ontario and actual Canadian earnings and it’s still wildly overpriced. going long, you’re betting somehow they’re going suddenly grow massively in the US.\n\nbut why would Canadian firms. they have no early mover advantage now. no product advantage. a logistical disadvantage and overall profit margin disadvantage. \n\nand worst, they have no branding—Canadian regulation prevents branding. they can brand once they arrive in the US but by then US cannabis branding and marketing will already be destroying them.\n\ncome US legalization, it won’t be a product or quality war—it’ll be a branding war. Canadian firms won’t be able to even remotely compete with the best (and richest) performing US firms.\n\nif you got some DD that suggests otherwise and that Tilray’s 5-8% Canadian market share does in fact have a snow ball’s chance in hell at being >1% in the US after a year of federal legalization, I’d love to see it tho—and how such a tiny Canadian firm is gonna compete in the US with now-bigger US firms.",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynjpvm/",
                  "created": 1712600717,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kynmrhp",
                      "score": 3,
                      "body": "You’re so fucking based bro",
                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynmrhp/",
                      "created": 1712601857,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "kyr0euk",
                      "score": 1,
                      "body": "Tilray is going to be a major player in the German medical and commercial recreational market which IS coming eventually.  I know right now it’s just grow at home and club legalization but commercial weed is coming to Germany eventually",
                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyr0euk/",
                      "created": 1712659175,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "kynki4u",
                      "score": 0,
                      "body": "Lot of words to basically say nothing",
                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynki4u/",
                      "created": 1712601007,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "kynsf7f",
                  "score": 1,
                  "body": "You never play options? What the fuck are you doing here on WSB then?",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynsf7f/",
                  "created": 1712604007,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "kynqqlu",
                  "score": -1,
                  "body": "You are forgetting that TLRY is growing cannabis  in Canada with economies of scale (very cheap). US companies have to have a separate operation in every state ( very expensive) because of current laws. If legalisation happens and TLRY enters the grand US market it will be consolidation time for the US companies.\n\nedit. Actually you probably dont. Your following comments show your DD went as far as looking at the TLRY chart for 2min looking for red earnings icons. Followed by probably reading someone elses opinion online.",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynqqlu/",
                  "created": 1712603356,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kynr5rc",
                      "score": 0,
                      "body": "Is it cheap when you pay your grower in shares you forced dilution through at the expense of shareholders? :)",
                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynr5rc/",
                      "created": 1712603518,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "kyoxh96",
                          "score": 1,
                          "body": "Used to grow on an east coast farm few years back, I was given the chance to receive common stock as part of my paycheck. Worked pretty fuckin well for me and everyone I worked with that chose this option. Can’t imagine how happy our cultivator over @Tilray is 🤑",
                          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyoxh96/",
                          "created": 1712619085,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "kyp2ic3",
                              "score": -1,
                              "body": "Not what we are talking about at all but ok bud",
                              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyp2ic3/",
                              "created": 1712621065,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "kyqz66v",
                                  "score": 1,
                                  "body": "You’re literally shitting on an employee (grower) getting paid with common stock. gain some knowledge before you speak with your prepubescent un evolved guh brain buddy",
                                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyqz66v/",
                                  "created": 1712658368,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "kyr5j31",
                                      "score": 1,
                                      "body": "lol this is so reductive I’m not even going to bother \n\nGood luck buddy you’re gonna need it out in the world",
                                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyr5j31/",
                                      "created": 1712662030,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "kypuem3",
              "score": 1,
              "body": "I have 5/17 $3c that I’ll hold into earnings and will add on weakness once IV drops. Its sideways until then",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kypuem3/",
              "created": 1712632137,
              "depth": 2,
              "replies": [
                {
                  "id": "kytlod3",
                  "score": 2,
                  "body": "I have 5/17 $2.5 call, currently with 1,000 shares buying constantly buying the dips and holding",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kytlod3/",
                  "created": 1712694413,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kytxl4a",
                      "score": 2,
                      "body": "Yup. DCA’d today and picked up some $2.5c too. Biden admin will keep talking about rescheduling and weed will keep pumping. Buy the dip.",
                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kytxl4a/",
                      "created": 1712698473,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "kymjyi6",
      "score": 13,
      "body": "I’m in. $3 calls",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymjyi6/",
      "created": 1712588098,
      "depth": 0,
      "replies": [
        {
          "id": "kympdvl",
          "score": 4,
          "body": "Same, cmon big money!",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kympdvl/",
          "created": 1712590022,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kyn071n",
          "score": 2,
          "body": "If he’s in, I’m in",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyn071n/",
          "created": 1712593836,
          "depth": 1,
          "replies": [
            {
              "id": "kyn0wpy",
              "score": 4,
              "body": "Shallow Fucking Value. I’m Ameripoor",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyn0wpy/",
              "created": 1712594086,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "kyuozer",
          "score": 1,
          "body": "Im still in. How are we feeling my boy",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyuozer/",
          "created": 1712708897,
          "depth": 1,
          "replies": [
            {
              "id": "kyuq3rc",
              "score": 1,
              "body": "Welp calls expire Friday. Unless there’s a rescheduling or some good news for weed this week I’m done for.",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyuq3rc/",
              "created": 1712709322,
              "depth": 2,
              "replies": []
            },
            {
              "id": "kyuq5gj",
              "score": 1,
              "body": "Welp calls expire Friday. Unless there’s a rescheduling or some good news for weed this week I’m done for.",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyuq5gj/",
              "created": 1712709334,
              "depth": 2,
              "replies": [
                {
                  "id": "kyv9udi",
                  "score": 1,
                  "body": "Shit.  Im sorry.  Mine are until right after 4/20",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyv9udi/",
                  "created": 1712717217,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kyvbkt9",
                      "score": 2,
                      "body": "Good luck!",
                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyvbkt9/",
                      "created": 1712717971,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "kymped5",
          "score": 1,
          "body": "Same, cmon big money!",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymped5/",
          "created": 1712590027,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kymagzv",
      "score": 13,
      "body": "Smoke em if you got em.",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymagzv/",
      "created": 1712584586,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kylvbl4",
      "score": 24,
      "body": "Dam how much weed do you smoke ?",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kylvbl4/",
      "created": 1712577969,
      "depth": 0,
      "replies": [
        {
          "id": "kyly0ew",
          "score": 13,
          "body": "Clearly not enough cause those brands put out garbage weed.\nI smoke a lot 🤣",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyly0ew/",
          "created": 1712579280,
          "depth": 1,
          "replies": [
            {
              "id": "kymd0dj",
              "score": 6,
              "body": "Trulieve has the the state of Florida in their pockets with the medical program here even with how shitty their weed is. ",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymd0dj/",
              "created": 1712585573,
              "depth": 2,
              "replies": [
                {
                  "id": "kyme1ou",
                  "score": 2,
                  "body": "My buddy is in Florida, he sends me choices from his dispo, I’ve seen their garbage… puke city.\n\nI’m very picky however, I grew my own for years",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyme1ou/",
                  "created": 1712585962,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kymg7b7",
                      "score": 5,
                      "body": "Yeah it's trash but Trulieve pretty much owns the program by a lot. They push tons of shake.",
                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymg7b7/",
                      "created": 1712586756,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "kyoybhy",
                  "score": 1,
                  "body": "While I do hate Truelieve, there are some dispos in FL that have absolute fire. I know, check my post history.",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyoybhy/",
                  "created": 1712619418,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kyp19w3",
                      "score": 1,
                      "body": "That doesnt mean shit in WSB. Most them aren’t publicly traded.",
                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyp19w3/",
                      "created": 1712620577,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "kynae1d",
                  "score": 0,
                  "body": "Trulieve is absolute ass. Flowery has some fire weed from preferred gardens and 710 labs etc",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynae1d/",
                  "created": 1712597387,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kyncm6d",
                      "score": 2,
                      "body": "Yes but the volume those companies push is nothing compared to TL. You can actually pull this from the State if you're interested to see who sells how much. They got all these boomers here smoking lows for the price of highs.\n\nhttps://knowthefactsmmj.com/about/weekly-updates/",
                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyncm6d/",
                      "created": 1712598175,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "kymn9lg",
              "score": 2,
              "body": "What’s the play then?",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymn9lg/",
              "created": 1712589265,
              "depth": 2,
              "replies": [
                {
                  "id": "kymnqm8",
                  "score": 6,
                  "body": "Fuck if I know, I’m probably the poorest one here. Every move I make, goes south.",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymnqm8/",
                  "created": 1712589430,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kyms4s1",
                      "score": 2,
                      "body": "Yeah, cause you spend it all on weed, so who’s selling the best weed?",
                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyms4s1/",
                      "created": 1712590980,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "kymvet6",
                          "score": 4,
                          "body": "I cant answer that for you.\nWhile I’ve smoked weed for the last 27 years and grew up on both sides of the border, I’ve lived in Canada since legalization. A lot of brands you guys have, we don’t and whatever you guys do have that we do as well, is marketed under different names and labels.\n\n\nLemme smoke this joint I just rolled, look up the chain at the brands I buy and see if they sell stateside and who the parents are",
                          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymvet6/",
                          "created": 1712592127,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "kym5bbd",
              "score": 1,
              "body": "Facts lol",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kym5bbd/",
              "created": 1712582529,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "kymfze9",
          "score": 0,
          "body": "None",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymfze9/",
          "created": 1712586674,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kylz6e1",
      "score": 33,
      "body": "Still crazy to me that y’all can afford to drop a quarter mil on a gamble and I have to save up for my weekly Big Mac",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kylz6e1/",
      "created": 1712579845,
      "depth": 0,
      "replies": [
        {
          "id": "kymfrnv",
          "score": 14,
          "body": "WSB. Will Suck Balls for money",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymfrnv/",
          "created": 1712586596,
          "depth": 1,
          "replies": [
            {
              "id": "kymurmj",
              "score": 3,
              "body": "Will Suck Balls for a hamburger, let alone a Big Mac.",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymurmj/",
              "created": 1712591901,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "kymc2cx",
          "score": 2,
          "body": "You can do a weekly BigMac?",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymc2cx/",
          "created": 1712585215,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kymksm9",
          "score": -1,
          "body": "Dude that’s literally all I can afford these days 😭",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymksm9/",
          "created": 1712588391,
          "depth": 1,
          "replies": [
            {
              "id": "kymku9m",
              "score": 1,
              "body": "I can’t even buy weed anymore i’m so poor 😭",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymku9m/",
              "created": 1712588407,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "kym1orl",
      "score": 60,
      "body": "Damn, if I had that much money I would just cash out and enjoy life.",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kym1orl/",
      "created": 1712580975,
      "depth": 0,
      "replies": [
        {
          "id": "kymmun0",
          "score": 16,
          "body": "I’ll enjoy life more when I have enough money to just retire. Why work until you’re 65 just because you wanted a nice car or something when you were younger? When you could instead save the money and not have to work decades earlier?\n\nYou can enjoy life without spending all of that.",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymmun0/",
          "created": 1712589118,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kymfckv",
          "score": 17,
          "body": "What life? This isn’t enough to do anything with",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymfckv/",
          "created": 1712586441,
          "depth": 1,
          "replies": [
            {
              "id": "kymkkue",
              "score": 30,
              "body": "Can’t even buy half a lambo with that kind of money let alone a mansion to park it in ",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymkkue/",
              "created": 1712588314,
              "depth": 2,
              "replies": [
                {
                  "id": "kynsjti",
                  "score": 3,
                  "body": "Dude.  Co-op’ing lambos and mansion is going to take off because of your post.  Sounds like a perfect prediction.",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynsjti/",
                  "created": 1712604055,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "kymo20x",
              "score": 13,
              "body": "Maybe not now but I probably would try less risky options for long term compounding gains with that money.",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymo20x/",
              "created": 1712589543,
              "depth": 2,
              "replies": [
                {
                  "id": "kyo0hxc",
                  "score": 4,
                  "body": "Do you know what sub you’re on?",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyo0hxc/",
                  "created": 1712606833,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kyo0txj",
                      "score": 4,
                      "body": "As much as I enjoy a good degenerate play I’ve also gotta be conscious of what’s the most prudent decision, especially in OPs case.",
                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyo0txj/",
                      "created": 1712606947,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "kyn6t6f",
                  "score": 1,
                  "body": "wut?",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyn6t6f/",
                  "created": 1712596124,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "kymdr8v",
      "score": 17,
      "body": "Just loaded up on some Tilray calls this morning. Earnings is looking good so why not",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymdr8v/",
      "created": 1712585853,
      "depth": 0,
      "replies": [
        {
          "id": "kymfmbu",
          "score": 8,
          "body": "Indeed why not. Buy some shares also. And tell  friend or 10000 . I need out go this thing already",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymfmbu/",
          "created": 1712586541,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kymo7pt",
          "score": 3,
          "body": "Why should earnings be good? The legalization in Germany came too late to impact Q1.",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymo7pt/",
          "created": 1712589598,
          "depth": 1,
          "replies": [
            {
              "id": "kyn50h8",
              "score": 4,
              "body": "Booooze, don't discount the booze. This earnings hints at whether the beer and whisky side hustle is printing or a bust.",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyn50h8/",
              "created": 1712595500,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "kymwcy3",
          "score": 0,
          "body": "How is earnings looking good\n\nThe earnings expectations already had to be revised down by Wallstreet\n\nThat’s usually not a great sign bud",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymwcy3/",
          "created": 1712592469,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kym9ky0",
      "score": 9,
      "body": "I'm doing my part. I'm smoking as much as I can.",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kym9ky0/",
      "created": 1712584243,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kymiqth",
      "score": 8,
      "body": "I like this stock",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymiqth/",
      "created": 1712587668,
      "depth": 0,
      "replies": [
        {
          "id": "kyn05xx",
          "score": 4,
          "body": "I also like this stock",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyn05xx/",
          "created": 1712593825,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kymeoht",
      "score": 7,
      "body": "oooooffffff.... I feel better now",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymeoht/",
      "created": 1712586196,
      "depth": 0,
      "replies": [
        {
          "id": "kymfo3h",
          "score": 2,
          "body": "Glad I could help",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymfo3h/",
          "created": 1712586558,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kylssxs",
      "score": 6,
      "body": "That Msox position will definitely help your retirement goals, I love swinging that ticker.",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kylssxs/",
      "created": 1712576687,
      "depth": 0,
      "replies": [
        {
          "id": "kymfvi7",
          "score": 3,
          "body": "It’s been the best trading vehicle. This position is my 3rd time coming in and out in the last month or so",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymfvi7/",
          "created": 1712586635,
          "depth": 1,
          "replies": [
            {
              "id": "kymnjq4",
              "score": 1,
              "body": "Love to hear it and same lol. This is my 3rd position iv swung as well.  Oh and call premiums are insane on hype spikes.",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymnjq4/",
              "created": 1712589363,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "kymtcws",
      "score": 6,
      "body": "Patience with tlry it's just a matter of time the company will be bought out I keep buying and I'll wait cuz I know I'm right.",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymtcws/",
      "created": 1712591410,
      "depth": 0,
      "replies": [
        {
          "id": "kyns9jt",
          "score": 3,
          "body": "I’m in long term on all lots. All I got is time.",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyns9jt/",
          "created": 1712603946,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kylt1qi",
      "score": 9,
      "body": "Tell the DEA that even the conservative germany has legalized cannabis and everything will be good for you \nAnd for me 🤣",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kylt1qi/",
      "created": 1712576812,
      "depth": 0,
      "replies": [
        {
          "id": "kymfy3z",
          "score": 3,
          "body": "Ann?!!! You hear this? I know you are watching Ann!!!!",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymfy3z/",
          "created": 1712586662,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kynglt5",
          "score": 2,
          "body": "We finally had a government without our conservative party for once. Although that will probably change again with the next elections",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynglt5/",
          "created": 1712599577,
          "depth": 1,
          "replies": [
            {
              "id": "kyo63p1",
              "score": 0,
              "body": "Currently our parties are not really conservatives, thats why we had legalized it. It's good to be not criminal anymore if a normal person smokes/has just weed... \nBut in the next election, i am pretty sure we will have conservatives again, they get always the most votes and it doesn't work quite well for the current parties. Maybe our parties have to spend too much focus due to the fucking war, idk... I hope that even Magas want to stabilize democracy.  if not, our democracy/economy will went not very well, even for US. but of course not that hard as europe.\nNostradamus has spoken xD",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyo63p1/",
              "created": 1712608747,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "kymxquk",
      "score": 10,
      "body": "TLRY controls 35% market share in Germany 🤝🌝 Cannabis is no longer considered a narcotic in Germany.\n\nRead the official government German site regarding Cannabis laws\n\n[https://www.bundesgesundheitsministerium.de/themen/cannabis/faq-cannabisgesetz](https://www.bundesgesundheitsministerium.de/themen/cannabis/faq-cannabisgesetz)\n\nhttps://preview.redd.it/t0iu7lw46atc1.jpeg?width=1078&format=pjpg&auto=webp&s=6af7e4a8c11f94e3579a198eec9a540638ec6222",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymxquk/",
      "created": 1712592958,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyn0k5l",
      "score": 3,
      "body": "You’re fine. Just wait for the inevitable s3 and make ur money.",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyn0k5l/",
      "created": 1712593964,
      "depth": 0,
      "replies": [
        {
          "id": "kynsq5b",
          "score": 1,
          "body": "Didn’t come this far to come this far",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynsq5b/",
          "created": 1712604120,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kynv3lk",
      "score": 3,
      "body": "With all the hate in these comments it's \"inverse WSB\" time definitely buying calls",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynv3lk/",
      "created": 1712604992,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kym207e",
      "score": 5,
      "body": "how long have you been bagholding TLRY?",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kym207e/",
      "created": 1712581111,
      "depth": 0,
      "replies": [
        {
          "id": "kymf8kj",
          "score": 15,
          "body": "84 years?",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymf8kj/",
          "created": 1712586400,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kylxms0",
      "score": 5,
      "body": "My hope is that there is a lot of institutional money that hasn’t touched these stocks for “political” reasons (for lack of a better word). Once it’s legalized major money will flow in. So now is a great time for individuals to invest before the big boys join the fun. 🤷‍♂️🤞",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kylxms0/",
      "created": 1712579097,
      "depth": 0,
      "replies": [
        {
          "id": "kymg3an",
          "score": 9,
          "body": "My hope is that a lot of dumb money runs the bid up and I can unload to the next generation of bag holders",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymg3an/",
          "created": 1712586715,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kym04sp",
          "score": 4,
          "body": "![img](emote|t5_2th52|18630)",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kym04sp/",
          "created": 1712580284,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kym5hzl",
          "score": 1,
          "body": "It won't because business competition eats away all profit margin. Weed will trend towards the cost of tea. The government will tax it to death. Black market and homegrown weed is better quality and cheaper. It's a race to the bottom. Maybe once the industry is full consolidated into vertically integrated duopoly the will be some profit ",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kym5hzl/",
          "created": 1712582605,
          "depth": 1,
          "replies": [
            {
              "id": "kym763e",
              "score": 4,
              "body": "Tea is not a good comparison, try cigarettes or alcohol, which both continue to print money with thousands of options and competition.  You just have to have exposure with the winning brand",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kym763e/",
              "created": 1712583288,
              "depth": 2,
              "replies": [
                {
                  "id": "kymaane",
                  "score": 3,
                  "body": "Those are both addictive substances. And most brands still go out of business ",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymaane/",
                  "created": 1712584519,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kymeht2",
                      "score": 7,
                      "body": "Have you never met a pothead or smoked weed, id argue the lifestyle and feeling are definitely addictive. Def different than drinking a cup of tea",
                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymeht2/",
                      "created": 1712586128,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "kymnwvs",
                          "score": 5,
                          "body": "I’ve been off smoking weed for a little over 2 weeks now after 4-5 years of smoking pretty much daily. Can confirm it’s very addictive, I’ve been craving a joint every day. It’s awful.",
                          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymnwvs/",
                          "created": 1712589493,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "kyn5xx1",
                          "score": 1,
                          "body": "I smoke for medical reasons... I have to remind myself to consume my medicine as I really don't actually crave it.  I recently went overseas and didn't consume anything for 2 weeks (I was hiking miles in a jungle so I was sleeping well each night, I just use weed to fall asleep)\n\nNow what the real play will be when it goes legal federally big tobacco will come in with a chemically modified version that is addictive.",
                          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyn5xx1/",
                          "created": 1712595822,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "kym97j7",
              "score": 3,
              "body": "I see the opportunity to make some money in weed stocks for about 2 years after legalization \n\nAnd only if legalization happens. This trickle down reform strategy is exactly what the governments want. \n\nI agree-",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kym97j7/",
              "created": 1712584098,
              "depth": 2,
              "replies": []
            },
            {
              "id": "kym85a6",
              "score": 2,
              "body": "No way bro. It will be like corporate distilleries vs moonshine.",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kym85a6/",
              "created": 1712583677,
              "depth": 2,
              "replies": [
                {
                  "id": "kymatlf",
                  "score": -5,
                  "body": "Except it's not in reality. I can spend $20 for a bag of hydroponic fertilizer and a weed clone and grow a 5lb plant in my backyard. Give three pounds to my friends . Sell one for $400 to find next years grow and have one left for myself .\n\n\nThe product is better than corporate dudded bud mite schwagg. \n\n\nIt's done. \n\n\nWeed was money because it was illegality moated. \n\n\nThe era is over",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymatlf/",
                  "created": 1712584717,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kymi9qt",
                      "score": 4,
                      "body": "You're only thinking about the flower and missing the bigger picture here.  There's so many more products and markets that can be tapped into with broader legalization.  I for one think the beverage market is going to equal and maybe even surpass the alcohol market in the decades to come.  I've personally seen a shift of people swapping out their Whiteclaws and other coolers for these cannabis beverages.  You also can't ignore the pharmaceutical market which has much higher margins and not just the Medical cannabis products but the over the counter products like CBD gelcaps for use as an anti-inflammatory and creams to help with arthritis.  I think we're just scratching the surface and in the future we'll see these other aspects of the business far exceed the sales of flower.",
                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymi9qt/",
                      "created": 1712587500,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "kyn6a6j",
                          "score": -2,
                          "body": "why pay more for a beverage with THC in it when I can pop a 10 mg THC pill that costs $2?\n\nIts so clear to me that most cannabis stock investors aren't users, and when actual cannabis consumers warn you they just get downvoted ![img](emote|t5_2th52|4271)",
                          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyn6a6j/",
                          "created": 1712595940,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "kyncgr4",
                              "score": 1,
                              "body": "Why do people drink beer when liquor will get you there quicker for less?  People like to have options, what's good for one is not always good for all.  I think the beverage market will be more commercially accepted over time, we'll probably start seeing them at bars and sport venues eventually.",
                              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyncgr4/",
                              "created": 1712598123,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "kyncuaa",
                                  "score": 0,
                                  "body": "People are cost conscious especially in the current economy.  Ppl just want to get a buzz cheap.  It’s why in cannabis legal states alcohol sales go down… why cuz a $10 joint will keep you buzzed all night without a hangover.",
                                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyncuaa/",
                                  "created": 1712598253,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "kynn22g",
                                      "score": 1,
                                      "body": "The cannabis beverages give you a decent long lasting buzz without the hangover too and the price point is reasonable in my area and each can typically has 10mg of THC.  You also cannot ignore the fact that a lot of people do not want to smoke so these give them a great alternative without the smell from the smoke which would be more off putting in a sports venue or bar.",
                                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynn22g/",
                                      "created": 1712601967,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "kynoc69",
                                          "score": 2,
                                          "body": "You realize they make a THC powder that can be added to any drink for $1 in Colorado?  so why would I pay $6-9 for a THC drink when I can buy a soda for $3 say I'm the designated driver and have fun all night for a few bucks?\n\nEdibles are 1-3$ per serving too.",
                                          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynoc69/",
                                          "created": 1712602442,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "kym1jms",
      "score": 2,
      "body": "Take a risk....buy into LABS.TO",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kym1jms/",
      "created": 1712580912,
      "depth": 0,
      "replies": [
        {
          "id": "kymfa7b",
          "score": 1,
          "body": "Ok I will do it",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymfa7b/",
          "created": 1712586417,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kym9da6",
      "score": 2,
      "body": "How do you screenshot in schwab. It doesnt allow me to",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kym9da6/",
      "created": 1712584160,
      "depth": 0,
      "replies": [
        {
          "id": "kymfhyj",
          "score": 1,
          "body": "From the app… never had a problem",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymfhyj/",
          "created": 1712586496,
          "depth": 1,
          "replies": [
            {
              "id": "kymm7rw",
              "score": 1,
              "body": "It blocks me from screenshotting for \"security reasons\"",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymm7rw/",
              "created": 1712588896,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "kymg0eq",
      "score": 2,
      "body": "You put 100k in weed stock",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymg0eq/",
      "created": 1712586685,
      "depth": 0,
      "replies": [
        {
          "id": "kymg7z5",
          "score": 2,
          "body": "I think it’s more? But yes that would be true",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymg7z5/",
          "created": 1712586763,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kymgrtj",
      "score": 2,
      "body": "Save yo mony: buy a pound",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymgrtj/",
      "created": 1712586965,
      "depth": 0,
      "replies": [
        {
          "id": "kyn042g",
          "score": 3,
          "body": "Got both",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyn042g/",
          "created": 1712593807,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kymp1eg",
      "score": 2,
      "body": "Again I say to anybody that will listen:  IMCC has treated me well and it is this fools opinionis that they will treat me weller. -",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymp1eg/",
      "created": 1712589885,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyn3uqz",
      "score": 2,
      "body": "Start praying they hype some ai weed during earnings call tomorrow",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyn3uqz/",
      "created": 1712595103,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kynb0d5",
      "score": 2,
      "body": "Hahaha holy fucking shit I wound up here cause I'm spending 100 from my minimum wage paychecks on tlray stock instead of booze cause the hospital wants 2500 to take out the Stent in my kidney that's gonna cause complications in 3 months and would take me about 3 months of not spending a penny from every paycheck to pay for. \n\nJeees man once you have a couple hundred grand isnt stuff like 401ks and hysa and mutual funds better for you? I'm on wsb because walking into any bank telling them I need a financial advisor for the fast food paycheck I get would have me laughed at.",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynb0d5/",
      "created": 1712597611,
      "depth": 0,
      "replies": [
        {
          "id": "kynsyf6",
          "score": 1,
          "body": "What’s a 401k? Is that like a call option? Mutual funds? Never heard of her",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynsyf6/",
          "created": 1712604206,
          "depth": 1,
          "replies": [
            {
              "id": "kyrm73r",
              "score": 2,
              "body": "I guess nows the time to learn eh buddy? AND I BOUGHT CALLS MAN. told myself Ramen for two weeks will pay off.",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyrm73r/",
              "created": 1712669673,
              "depth": 2,
              "replies": [
                {
                  "id": "kys10pz",
                  "score": 1,
                  "body": "Never. I’m doubling down",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kys10pz/",
                  "created": 1712675144,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "kynmr0j",
      "score": 2,
      "body": "My calls are cooked ![img](emote|t5_2th52|4267)",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynmr0j/",
      "created": 1712601852,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyomiwf",
      "score": 2,
      "body": "I really thought WSB would set their money on fire and run this up to around $5 so I could make a couple bucks. Maybe they’ll not get smoked on earnings in the AM.  Doubt it though.",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyomiwf/",
      "created": 1712614824,
      "depth": 0,
      "replies": [
        {
          "id": "kyp533p",
          "score": 3,
          "body": "The WSB of 2021 would have. The 2024 version has people talking about mutual funds and dividends and something called a 401k?",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyp533p/",
          "created": 1712622068,
          "depth": 1,
          "replies": [
            {
              "id": "kyp7slp",
              "score": 2,
              "body": "Just a little pump daddy please?  $5 is all I need",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyp7slp/",
              "created": 1712623108,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "kyonl44",
      "score": 2,
      "body": "Never understood the bullishness on weed.  It's an agricultural operation with no moat at its core.  None of them have a huge brand value or anything.\n\n\nWhat's the upside?  Poor margins, poor revenue, with loads of competition.  ",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyonl44/",
      "created": 1712615230,
      "depth": 0,
      "replies": [
        {
          "id": "kyp56iw",
          "score": 1,
          "body": "The upside is all that green next to all the stonks except TLRY. The upside is it also goes to green",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyp56iw/",
          "created": 1712622104,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kzs83me",
          "score": 1,
          "body": "while id say that the \"reefer-madness\" of pre covid are over, the potentials arent even quantifyable. weed has never been legal in the US so of course there isnt anything to go off of. For me personally, weed stonks are a when not if it becomes legal. and with current political issues, i think certain candidates will have to reach into their bag of shinny keys to jangle in front of their \"center-leaning\" youngsters to even have a chance. and onw of those keys is green ![img](emote|t5_2th52|4276)",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kzs83me/",
          "created": 1713240287,
          "depth": 1,
          "replies": [
            {
              "id": "kztfdh8",
              "score": 2,
              "body": "Once it's legalized after an initial period prices will drop and fall in line with other agricultural commodities.  The only reason prices are high is prohibition.",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kztfdh8/",
              "created": 1713268529,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "kyoxgs3",
      "score": 2,
      "body": "Everybody can look at all the numbers and all the money and all the finances and all the debt it doesn't mean a damn thing.\nIn the end like every industry three companies will be standing tlry  will be one of them and they'll be bought out.",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyoxgs3/",
      "created": 1712619080,
      "depth": 0,
      "replies": [
        {
          "id": "kyp5bha",
          "score": 1,
          "body": "Maybe. Or wsb can find its balls again and send this to 10 for a few minutes and let me drop this bag",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyp5bha/",
          "created": 1712622156,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyrfism",
      "score": 2,
      "body": "This joint is getting murdered this morning. Hope the best for you.",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyrfism/",
      "created": 1712666889,
      "depth": 0,
      "replies": [
        {
          "id": "kyrgzdb",
          "score": 1,
          "body": "https://preview.redd.it/058dxhirbgtc1.jpeg?width=1290&format=pjpg&auto=webp&s=ea98da3788595e342e1a8919287ad6ba42890418\n\nI love it",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyrgzdb/",
          "created": 1712667520,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyrv70x",
      "score": 2,
      "body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyrv70x/",
      "created": 1712673073,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l212sff",
      "score": 2,
      "body": "Daddy's Home",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/l212sff/",
      "created": 1714526739,
      "depth": 0,
      "replies": [
        {
          "id": "l21cj5l",
          "score": 2,
          "body": "Everyone who wanted to dance on my grave…. Guess who’s back?I ended up getting the MSOX position up to 45k shares at approx 4.78 average and closed it out today. I’m sure I will do something stupid with it\n\nhttps://preview.redd.it/4f6947fb7qxc1.jpeg?width=1290&format=pjpg&auto=webp&s=480005cc773822f6c897065054ae651ae6885f1c",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/l21cj5l/",
          "created": 1714530488,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kym2q7p",
      "score": 2,
      "body": "26 minutes left for there to be a 10$ gap down on spy",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kym2q7p/",
      "created": 1712581441,
      "depth": 0,
      "replies": [
        {
          "id": "kym346q",
          "score": 3,
          "body": "Wot",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kym346q/",
          "created": 1712581609,
          "depth": 1,
          "replies": [
            {
              "id": "kym3pt9",
              "score": 3,
              "body": "I thought I was in the daily",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kym3pt9/",
              "created": 1712581866,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "kymm5ng",
      "score": 3,
      "body": "Told you stoners to cash out when u had the chance. \n\nJust go have another bowl, you'll feel better",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymm5ng/",
      "created": 1712588875,
      "depth": 0,
      "replies": [
        {
          "id": "kyn6pxm",
          "score": 0,
          "body": "Ok dad",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyn6pxm/",
          "created": 1712596093,
          "depth": 1,
          "replies": [
            {
              "id": "kysoxsc",
              "score": 0,
              "body": "Told you, son.",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kysoxsc/",
              "created": 1712683380,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "kymyqth",
      "score": 1,
      "body": "Weed fucked us over last year. Not doing that again.",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymyqth/",
      "created": 1712593305,
      "depth": 0,
      "replies": [
        {
          "id": "kynshxw",
          "score": 1,
          "body": "I like the pain. More!!!!",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynshxw/",
          "created": 1712604035,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyn22gv",
      "score": 1,
      "body": "No $curlf?",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyn22gv/",
      "created": 1712594488,
      "depth": 0,
      "replies": [
        {
          "id": "kynsmon",
          "score": 1,
          "body": "Nah. Bloated beast",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynsmon/",
          "created": 1712604085,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kynu5kb",
      "score": 1,
      "body": "They don't like you and the market doesn't like them. Philip Morris and British American Tobacco are too big and efficient to compete with. Once you get real legitimacy for weed they will own it like they do tobacco.",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynu5kb/",
      "created": 1712604661,
      "depth": 0,
      "replies": [
        {
          "id": "kynucgl",
          "score": 2,
          "body": "But they don’t even know me",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynucgl/",
          "created": 1712604731,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyo315o",
      "score": 1,
      "body": "🤪🤪🤪",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyo315o/",
      "created": 1712607692,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyqe23z",
      "score": 1,
      "body": "Weed stonks are already puffed out after a day and a half. The only one still making wild moves is ACB but I don't expect that to last much longer.",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyqe23z/",
      "created": 1712642782,
      "depth": 0,
      "replies": [
        {
          "id": "kyqvk9t",
          "score": 1,
          "body": "This is why I love WSB. You have a sea of green with a splash of red. And the red is all anyone can see",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyqvk9t/",
          "created": 1712655835,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyt7io6",
      "score": 1,
      "body": "Damn... They totally shit the bed on earnings. There go my calls 😂",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyt7io6/",
      "created": 1712689685,
      "depth": 0,
      "replies": [
        {
          "id": "kyuj5nq",
          "score": 2,
          "body": "The earnings actually weren’t Horrible for them…. But yikes",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyuj5nq/",
          "created": 1712706623,
          "depth": 1,
          "replies": [
            {
              "id": "kyujf2b",
              "score": 1,
              "body": "Man the stock tanked lol. Good thing my calls are virtually worthless as of right now, so there is no point at selling for a 90% loss.",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyujf2b/",
              "created": 1712706727,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "kyuzdyq",
      "score": 1,
      "body": "post the loss porn",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyuzdyq/",
      "created": 1712712957,
      "depth": 0,
      "replies": [
        {
          "id": "kyv1461",
          "score": 1,
          "body": "https://preview.redd.it/0nxigxdx4ktc1.jpeg?width=1000&format=pjpg&auto=webp&s=175db1bf95be12311818ac8137c53a4108f7edfe\n\nI bought 10k more shares in pre market. Enjoy",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyv1461/",
          "created": 1712713643,
          "depth": 1,
          "replies": [
            {
              "id": "kzs79r2",
              "score": 1,
              "body": "coomed at the rebuy",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kzs79r2/",
              "created": 1713239861,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "kyw3z43",
      "score": 1,
      "body": "MAPS is the way!",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyw3z43/",
      "created": 1712734865,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kz2s2on",
      "score": 1,
      "body": "SNDL formed a Golden Cross today with 50/200 day moving average for the first time since 2021... Strong buy signal with huge upside potential!! 20x\n\nhttps://preview.redd.it/c1z5cy73wutc1.png?width=1507&format=png&auto=webp&s=47ee47a2070abd34d732b8bdf00829066be459f5",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kz2s2on/",
      "created": 1712843835,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kymknj5",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymknj5/",
      "created": 1712588341,
      "depth": 0,
      "replies": [
        {
          "id": "kyn6ogs",
          "score": 2,
          "body": "Not maybe . I’m definitely into that",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyn6ogs/",
          "created": 1712596079,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kynlxug",
      "score": 1,
      "body": "Truly a regard play. Tilray is a trap.",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynlxug/",
      "created": 1712601546,
      "depth": 0,
      "replies": [
        {
          "id": "kynsk0j",
          "score": 2,
          "body": "Yes",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynsk0j/",
          "created": 1712604057,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kymtw99",
      "score": 0,
      "body": "TLRY is a trash company with trash financials",
      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kymtw99/",
      "created": 1712591599,
      "depth": 0,
      "replies": [
        {
          "id": "kynsbp3",
          "score": 4,
          "body": "Sir…. You know the rest",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynsbp3/",
          "created": 1712603969,
          "depth": 1,
          "replies": [
            {
              "id": "kyrvmhm",
              "score": 1,
              "body": "Hey champ you ok this morning? Need me to send Reddit cares?",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyrvmhm/",
              "created": 1712673229,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "kyndpgp",
          "score": 2,
          "body": "Damn you are desperate huh",
          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyndpgp/",
          "created": 1712598552,
          "depth": 1,
          "replies": [
            {
              "id": "kyneqvo",
              "score": 2,
              "body": "The financials are trash\n\nI’m welcome to entertain arguments against that fact\n\nBut you’re not gonna find many",
              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kyneqvo/",
              "created": 1712598914,
              "depth": 2,
              "replies": [
                {
                  "id": "kynfvgt",
                  "score": 3,
                  "body": "You were off about how many earnings Tilray has missed in the last two years for one. They delivered record net revenue in Q1 2024 and their alcohol business is growing every quarter. They've proven a consistent commitment to lowering their EBITDA which again, has been seen in recent filings. They've said they'll be free-cash flow positive by Q4 2024. They're poised to fill a soon to be large vacuum in Germany post legalization\n\nYou're focusing on the negatives about Tilray in particular when every company in this sector is facing the same issues with margins, cash burn rate, etc because of the regulatory state of affairs which, any of us who are bullish on cannabis, believe changes are happening in the next few years. Rescheduling/Excise tax reform alone will be huge news.\n\nYou also visibly hate this stock/sector very much and just come off like you have an emotional take on the facts. You've posted on this thread multiple times and just have a huge chip on your shoulder, I guess well see in the end whos right",
                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynfvgt/",
                  "created": 1712599311,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kynn2hh",
                      "score": 0,
                      "body": "You just reposted the same comment as above which I’ve already responded to\n\nTalk about desperation",
                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynn2hh/",
                      "created": 1712601971,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "kynvtwc",
                          "score": 1,
                          "body": "This post is near the bottom - other post is where people will actually see it and decide if you're full of shit or not",
                          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynvtwc/",
                          "created": 1712605244,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "kynwkmm",
                              "score": 1,
                              "body": "I mean they can just go into trade view and see TLRY missing earnings past 7 earnings, missing revenues 4 of those 7\n\nThey can go to macro trends and look at the financials\n\nNegative net incomes of 1 billion last year\n\n200 million cash burn annually\n\nOnly 400 million in cash\n\nNegative net incomes last quarter\n\nWildly inflated assets with 3 of the 4 billion being intangibles and goodwill\n\n900 million in liabilities\n\nOr Google a chart of shares outstanding for TLRY and see that it’s an escalator up\n\nAll the company does is dilute dilute dilute\n\nNgl too their products look like total ass, sparkling water with thc or CBD or whatever. Yeah ok. Total shit product\n\nMost of the craft beers they bought are trash the most popular one was shock too which makes primarily hard ciders\n\nNot a very popular drink, hard ciders. \n\nBut go off king <3",
                              "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynwkmm/",
                              "created": 1712605497,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "kynwy06",
                                  "score": 2,
                                  "body": "seethe",
                                  "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynwy06/",
                                  "created": 1712605622,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "kytljy3",
                                      "score": 1,
                                      "body": "Hey boss you doing ok? I sold my call today for like a 45% gain. Thanks to you TLRY boys I can always count on you to pump this trash back up. I’ll be back to short it again when you do",
                                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kytljy3/",
                                      "created": 1712694372,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "kytnevc",
                                          "score": 1,
                                          "body": "I was just thinking of you\n\nAnd yeah I’m doing just fine, I was in at 1.75 and I’m waiting for excise tax and rescheduling. Chillin 👍🏻\n\nKeep on being miserable and petty tho. Take care",
                                          "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kytnevc/",
                                          "created": 1712694984,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "kynx9uf",
                                      "score": 1,
                                      "body": "Not an argument \n\nGuess you’re spinning out already huh",
                                      "permalink": "/r/wallstreetbets/comments/1byvnt3/i_like_the_weed_stonks_but_do_the_weedstonks_like/kynx9uf/",
                                      "created": 1712605742,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}