{
  "title": "[deleted by user]",
  "score": 81,
  "selftext": "[removed]",
  "link_flair_text": null,
  "id": "1bzbc3w",
  "num_comments": 24,
  "created_utc": 1712614760,
  "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/",
  "comments": [
    {
      "id": "kypabtz",
      "score": 22,
      "body": "I honestly have no clue how they calculate housing to make it fit the numbers we get. My house increased 100% in value in like 2 years. How the F do they get to their sub 10% numbers with that figured in? My grocery bill is easily up 25%-35%. Gas is up like 50%.",
      "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kypabtz/",
      "created": 1712624075,
      "depth": 0,
      "replies": [
        {
          "id": "kyps6dk",
          "score": 54,
          "body": " .",
          "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kyps6dk/",
          "created": 1712631200,
          "depth": 1,
          "replies": [
            {
              "id": "kyr0pul",
              "score": 9,
              "body": "Thank you sir",
              "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kyr0pul/",
              "created": 1712659368,
              "depth": 2,
              "replies": []
            },
            {
              "id": "kyrnnu8",
              "score": 3,
              "body": "What about rent increases?",
              "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kyrnnu8/",
              "created": 1712670252,
              "depth": 2,
              "replies": [
                {
                  "id": "kyshpw0",
                  "score": 6,
                  "body": "They just dont count most of the things the avg person pays for. Its totally manipulated data.",
                  "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kyshpw0/",
                  "created": 1712680920,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "kytvqwx",
                  "score": 1,
                  "body": "Thats what happened after baroque and before secession and modernism, right?",
                  "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kytvqwx/",
                  "created": 1712697821,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "kyoqinc",
      "score": 29,
      "body": "1) underreport inflation  \n\n\n2) growth magically looks amazing",
      "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kyoqinc/",
      "created": 1712616357,
      "depth": 0,
      "replies": [
        {
          "id": "kyp32pp",
          "score": 8,
          "body": "Welcome to China?",
          "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kyp32pp/",
          "created": 1712621290,
          "depth": 1,
          "replies": [
            {
              "id": "kypq9ds",
              "score": 2,
              "body": "China is experiencing deflation.",
              "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kypq9ds/",
              "created": 1712630413,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "kyp1tib",
      "score": 21,
      "body": "Let me guess....LIES?????",
      "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kyp1tib/",
      "created": 1712620793,
      "depth": 0,
      "replies": [
        {
          "id": "kyp35rq",
          "score": 7,
          "body": "“Everyday! More lies!”",
          "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kyp35rq/",
          "created": 1712621323,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyow59m",
      "score": 16,
      "body": "Open wide.   They about to drop a deuce.",
      "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kyow59m/",
      "created": 1712618564,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyon7au",
      "score": 7,
      "body": "Goldman Sachs economists have been particularly bullish over the past few years. When most of his Wall Street peers warned that rising interest rates and high inflation meant a recession was imminent in 2022 and 2023, Goldman’s chief economist and head of global investment research Jan Hatzius put the odds of that dire outcome in a range of 15% to at most 35%.\n\nThe bullish call proved prescient last year, with the economy running strong and most Wall Street forecasters abandoning their recession calls in favor of a “soft landing” scenario—where inflation fades and the economy avoids a recession, but growth proves anemic at best.\n\nOver the past few months, however, after a few hot inflation and jobs reports, many of Wall Street’s prognosticators have shifted their forecasts once again to a “no landing” scenario—where economic growth remains strong, but inflation also remains an issue. \n\nRelated video: The Fed feels it 'can't get it wrong again' and will err on the side of caution, economist says (CNBC)\n\nContinuing their contrarian streak, Goldman Sachs economists have a different, more bullish view. In a Friday note to clients, a team led by the investment bank’s chief U.S. economist David Mericle said they expect “much stronger” GDP growth in 2024 (2.5%), a significant drop in inflation, and three interest rate cuts from the Federal Reserve. It’s a sort of goldilocks forecast for the economy that seems paradoxical, on its face. Goldmans economists say you could be forgiven for thinking so.\n\n“We are often asked whether these forecasts aren’t contradictory—won’t stronger growth prevent inflation from falling or even reignite it? We don’t think so, for two reasons,” they wrote.\n\nFirst, the team explained that supply-side economic growth should prevent supply-demand imbalances and labor market tightness that drives inflation. Elevated immigration, for example, is increasing the size of the labor force, preventing wages from surging in a way that could reignite inflation. “So far measures of labor market tightness have continued to fall or move sideways, not rise, despite strong GDP growth,” Goldman’s economists wrote. “We expect these measures to remain roughly where they are through the remainder of this year.”\n\nAnd even if the labor market does tighten further—i.e. the unemployment rate falls or job openings rise—the impact on inflation “would be quite small compared to the impact of the major disinflationary forces we expect this year,” according to Mericle and his team.\n\nSignificant post-pandemic disinflationary forces are the second major reason why Goldman’s economists believe inflation can fall in 2024, even as economic growth rises. The first of these forces is the “catch-down” effect of the Fed’s lagging shelter inflation data. Goldman’s economists have long argued that the Fed’s measure of shelter inflation lags the reality on the ground, where home and rent prices are barely rising, leading to higher cumulative official inflation numbers. That trend should fade this year, leading to a 2 percentage point drop in shelter inflation in 2024, according to Goldman’s calculations. \n\nOn top of that, pandemic-era shortages and supply chain issues have been “resolved,” inventories are rising, and “competition is kicking back in,” the economists said. That should lead to falling prices for things like cars, in particular, where part shortages caused prices to soar during the pandemic. With “the final echoes of the 2022 inflation surge” fading, we really “can have both strong growth and lower inflation,” according to Goldman Sachs.\n\nOf course, not everyone is so bullish. Just this week, JPMorgan Chase CEO Jamie Dimon argued in his annual letter to shareholders that he’s preparing for a range of economic scenarios, including one where interest rates spike to “8% or even more.”\n\nDimon said investors should “beware” of the potential for higher interest rates and a recession, adding that “economically, the worst-case scenario would be stagflation, which would not only come with higher interest rates but also with higher credit losses, lower business volumes and more difficult markets.” In this regard, Dimon was echoing the flood of predictions from economists in 2022 that the economy was headed for a repeat of the stagflationary 1970s.\n\nApollo’s chief economist Torsten Slok has also repeatedly warned that he believes the Fed won’t be able to cut rates at all in 2024, with inflation proving difficult to tame. The veteran market watcher fears investors are reliving the 1990s tech bubble amid the AI boom as well, and things  typically don’t end well during periods of rising rates with bubbly stock valuations.\n\nThis story was originally featured on Fortune.com",
      "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kyon7au/",
      "created": 1712615082,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyp97ps",
      "score": 5,
      "body": "We’ve had strong economy with low inflation since the 90s lol gtfo",
      "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kyp97ps/",
      "created": 1712623649,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyp51fu",
      "score": 13,
      "body": "Complete bullshit and lies. Inflation has been rampant especially in Europe.",
      "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kyp51fu/",
      "created": 1712622050,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyqpvn4",
      "score": 2,
      "body": "Keep the money out of rotation, don't give it to working people to spend but funnel it to the top to \"invest\" to pump the market. Same trick they use for 40 years.",
      "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kyqpvn4/",
      "created": 1712651484,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyow6jd",
      "score": 4,
      "body": "Now shut up and go back to work you peon… and stop asking questions.",
      "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kyow6jd/",
      "created": 1712618577,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kypntso",
      "score": 2,
      "body": "You gaslight everyone and have universities push economics that only work for the rich so you have entire generations indoctrinated!",
      "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kypntso/",
      "created": 1712629427,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyomd5a",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 7 months ago\n**Total Comments** | 5620 | **Previous Best DD** | \n**Account Age** | 7 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kyomd5a/",
      "created": 1712614764,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kypjqp6",
      "score": 1,
      "body": "If you can have low growth and high inflation, it stands to reason you can have high growth and low inflation",
      "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kypjqp6/",
      "created": 1712627797,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyozqhg",
      "score": 0,
      "body": "If you were bullish when everyone was bearish, should you be bearish when everyone is bullish?",
      "permalink": "/r/wallstreetbets/comments/1bzbc3w/deleted_by_user/kyozqhg/",
      "created": 1712619973,
      "depth": 0,
      "replies": []
    }
  ]
}