{
  "title": "Boeing - don't buy this dip, either",
  "score": 480,
  "selftext": "I've been closely watching Boeing's stock price as it has grinded lower, falling from the $200s down to the $170s. I expect this gradual decline to continue, even though I believe it's a long-term buy.\n\nOne of the issues is that people tend to get very emotional when discussing Boeing, and that's a problem in itself. But in the short to medium term, Boeing will also be suffering from some significant cash flow challenges:\n\n1. Defense Business: Boeing is working through some very poor defense contracts. These will roll off in the coming years, but defense margins remain very poor in the meantime.\n2. Commercial Business: Boeing has had to deal with poor contracts from the COVID-19 pandemic, unproductive production lines, and inventory issues. The news flow doesn't help, and it's possible they may not get back to full production until next year.\n3. Services Business: This part of the business is doing fine, but how long can it support the two money-losing segments?\n\nThe underlying value is there, but these fundamental cash flow issues go beyond just the negative news. In the next 3-6 months, I believe Boeing is a bad buy.\n\nThe stock should benefit from a reset, but that will be difficult given Boeing's semi-governmental status and the politics they have to manage. It's essentially a value trap right now. I think it's a screaming buy once they work through these problems, but not yet.  Stay away!",
  "link_flair_text": "Discussion",
  "id": "1c09848",
  "num_comments": 210,
  "created_utc": 1712712142,
  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/",
  "comments": [
    {
      "id": "kyuxbva",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 weeks ago\n**Total Comments** | 100 | **Previous Best DD** | \n**Account Age** | 9 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyuxbva/",
      "created": 1712712146,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyviggs",
      "score": 187,
      "body": "I agree with your conclusion, but the reasons you cited are not all entirely accurate – though the right sentiment is there. (Edit: lol idk why I kept typing like anyone is gonna read all of this)\n\nTheir issue on defense is not really poor contracts… It’s poor execution (i.e. T-7 delays, various KC-46 issues over the years, etc.), missing out on FLRAA (went to Bell’s V-280), FARA getting canceled, and so on. The picture there is mixed and long term success will come down to execution going forward, NGAD program selection, and NGAS program (last two not really worth speculating about this early). Further tanker orders are anticipated ahead of NGAS, so that’s a plus…\n\nOn the commercial OE side, I’m not sure where you’re getting info about bad contracts, though I suppose there are likely some... If anyone has gotten bad contracts, it’s their suppliers that got locked into long-term pricing before the high inflation kicked in. They weren’t exactly flexible for any suppliers that weren’t sole source.\n\nInventory issues are largely an industry problem due to supply chain issues (mostly on the engine side right now) that have been taking a long time to subside… They’ve only delivered one 777 this year so far as others are parked as they wait for GE engines. Though stocking for their 737 ramp prior to rates being stalled hurts, too. They weren’t at “full” production to begin with as they were early in a multi-year ramp up on MAX, but the FAA has stalled rate hikes and it’s anyone’s guess how long that will take.\n\nAftermarket is doing fine and may even get a *slim* benefit from its inability to ramp deliveries (as older aircraft remain in service and in need of repairs), though it’s probably immaterial. The good news there is that demand for aircraft remains strong enough that these older planes will keep flying for awhile.\n\nAftermarket is where the margins come from for most aero companies, so you’re right about needing to lean on that segment.\n\nThe next year is going to be tough for Boeing, at the very least. That being said, it’s not lost on the market how irreplaceable they are in the aero sector (Airbus can’t fulfill all of the demand and COMAC is not a threat for the foreseeable future), so it’s hard to say how far down the stock will go…\n\nEdit: I typed too much and nobody will make it this far, but here’s a good [article](https://aviationweek.com/aerospace/manufacturing-supply-chain/quarter-when-boeing-broke) that runs through a lot of their issues.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyviggs/",
      "created": 1712721193,
      "depth": 0,
      "replies": [
        {
          "id": "kyw0s6x",
          "score": 48,
          "body": "I read it all. Good write up. Thanks for the knowledge",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyw0s6x/",
          "created": 1712732453,
          "depth": 1,
          "replies": [
            {
              "id": "kywrgjk",
              "score": 21,
              "body": "Don't lie. You read the words aloud to the class but don't actually know what you read.",
              "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywrgjk/",
              "created": 1712750651,
              "depth": 2,
              "replies": [
                {
                  "id": "kywvn0c",
                  "score": 16,
                  "body": "Ok you got me.\n\nSeriously tho. Good write up",
                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywvn0c/",
                  "created": 1712752620,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "kyx9uvq",
                  "score": 1,
                  "body": "Mouth noises",
                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyx9uvq/",
                  "created": 1712758380,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "kywtjz9",
          "score": 13,
          "body": "Bingo. As you wrote, its not bad contracts, it's bad execution. The question is WHY?  Starliner,  KC46, Air Force One, T7, 737MAX, now the 777 allegations. My feeling is that investor confidence shouldn't return until Boeing moves its headquarters back to Seattle, puts the engineers back on the factory floor and gets rid of the bureaucratic bloat that hides accountability.  Was anyone fired because the door plug bolts were not installed on the 737?  If not, its because the system is set up to deflect responsibility, not assign it.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywtjz9/",
          "created": 1712751659,
          "depth": 1,
          "replies": [
            {
              "id": "kyxbkp3",
              "score": 1,
              "body": "What are the air force one allegations?",
              "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxbkp3/",
              "created": 1712759005,
              "depth": 2,
              "replies": [
                {
                  "id": "kz24uge",
                  "score": 1,
                  "body": "Boeing lost $2 billion on the contract to replace the president's aircraft.",
                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kz24uge/",
                  "created": 1712833686,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kz25uxr",
                      "score": 1,
                      "body": "What a bunch of fuckin idiots lol",
                      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kz25uxr/",
                      "created": 1712834241,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "kywah1k",
          "score": 5,
          "body": "Extremely questionable about NGAD and NGAS. Boeing wasn’t the first pick for them even before their fuck ups have been revealed.\n\nThe government isn’t awarding some of their best contracts to them in this environment, in what is likely going to be the first year of a presidency. The hate towards Boeing at this point by the public means they’d avoid if only for the public backlash.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywah1k/",
          "created": 1712739924,
          "depth": 1,
          "replies": [
            {
              "id": "kyww6t3",
              "score": 2,
              "body": "Probably correct for NGAD but it’s still early. You might be discounting their chances on NGAS a little too much but I won’t discount their reputation’s damage there. There are other defense programs out there of course that they’re on and will be on, but I was simply listing the major ones.",
              "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyww6t3/",
              "created": 1712752866,
              "depth": 2,
              "replies": [
                {
                  "id": "kyxo337",
                  "score": 2,
                  "body": "NGAD is expected late 2024 to early 2025 last time I checked. Either way though, Boeing is very much a last place contender for both even before the recent BS with Boeing.\n\n  \nLM is almost guaranteed to win as primary contractor because of the experience with F22. Like all large contracts, Boeing will likely be subcontracted out to, but their odds as primary contractor are likely close to 0.",
                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxo337/",
                  "created": 1712763410,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kyy1g91",
                      "score": 3,
                      "body": "Agreed on all counts – I’m not sure where I indicated optimism about their chances. My comment regarding it being too soon to speculate was in the context of the stock price. As in, it’s not worthy taking a position in anticipation of them winning/losing that bid… Since they’re not really expected to win, it’s reasonable to think it’s inherently priced in.\n\nSimply pointing out some of the larger programs yet to be awarded.",
                      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyy1g91/",
                      "created": 1712768057,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "kyybni1",
                          "score": 3,
                          "body": "Thats fair.",
                          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyybni1/",
                          "created": 1712771542,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "kyyeq84",
                      "score": 1,
                      "body": "I might contest you on a few points. A significant amount of the F-22 was contracted out to Boeing, to the point where Wikipedia calls it “The Lockheed Martin/Boeing F-22 Raptor” (https://en.wikipedia.org/wiki/Lockheed_Martin_F-22_Raptor?wprov=sfti1#) in the first wiki paragraph. Boeing has a lot of work experience in that area. Boeing is also the prime for the F/A-18, so they do have fighter jet prime experience.\n\nBut specifically the thing that I think makes Boeing a better contender than you think, is that Boeing has much more experience/success in unmanned systems than LM. Avionics is also an area that Boeing outclasses LM. When it comes to the F-22, LM had Boeing do all the avionics work. That is going to be huge for this contract. Don’t underestimate them. Sure there is some trouble at Boeing in some programs, but others are going extremely well.",
                      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyyeq84/",
                      "created": 1712772585,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "kz9m80n",
                          "score": 1,
                          "body": "A significant amount of literally everything was contracted out to literally everyone. \n\nBasically every contractor of note is involved in some fashion.\n\nI even said in the post you relied to that they will likely still get some subcontracting. They do have some areas that work well.\n\nBut they are almost guaranteed to not be the prime contractor. If the current drama wasn’t going on and Boeings reputation wasn’t absolute scum in the eyes of the public, they would have had a chance. They’d be the underdogs, but would have a 7chance to be prime contractors.\n\nWith that taken into account though? Short of LM, NOC and others have their executives all turn out to be Russian spies or some other massively ridiculous scandal, the odds of Boeing winning are so low as to be rounded to 0.\n\nThe absolute only way they get it, is if the government weighs that it’s the ONLY way to save Boeing as they DO occasionally win contracts out like that so as to keep some competition going. That would be a huge political scandal in what is an extremely tight situation between D/R right now.",
                          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kz9m80n/",
                          "created": 1712944536,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "kyw2ki2",
          "score": 2,
          "body": "Great points! Thank you for this.  \nAnd even if there are numerous financial reasons for the stock to go lower, it has a level of deep resiliency. It's too valuable to the US infrastructure for the government to let it fail. Investors/consumers know this, and I think the big players are relying on that herd mentality to make anything underneath where it is now a value buy.\n\nThat being said I do hold some puts and desperately hope the market agrees with OP lol",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyw2ki2/",
          "created": 1712733789,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kywfxk5",
          "score": 1,
          "body": "I made it to the end. I wish you had elaborated.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywfxk5/",
          "created": 1712743985,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kyzdqm1",
          "score": 1,
          "body": "Keep this post up, Regard. BA will make $ for us but it will take patience. Let me know when you're in. Good post. Thx",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyzdqm1/",
          "created": 1712784188,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kyzkfqr",
          "score": 1,
          "body": "Thanks for the comment.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyzkfqr/",
          "created": 1712786547,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyv1622",
      "score": 224,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv1622/",
      "created": 1712713664,
      "depth": 0,
      "replies": [
        {
          "id": "kyv59mf",
          "score": 78,
          "body": "We’re going to see Boeing memes for years. Until there’s a major overhaul of existing planes and a fresh set of suits nothing will change. \n\nPeople are talking about Boeing’s stock bottoming and one of their planes hasn’t even crashed yet - which will absolutely happen because nothing will change until one does.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv59mf/",
          "created": 1712715311,
          "depth": 1,
          "replies": [
            {
              "id": "kyv9pwy",
              "score": 55,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv9pwy/",
              "created": 1712717164,
              "depth": 2,
              "replies": [
                {
                  "id": "kyvweke",
                  "score": 36,
                  "body": "Have you seen the recent article regarding a Boeing executive leaving a flight because it was a new max.   \n   \n> I would absolutely not fly a Max airplane,” Ed Pierson, a former senior manager on Boeing’s 737 program, told the LA Times. “I’ve worked in the factory where they were built, and I saw the pressure employees were under to rush the planes out the door. I tried to get them to shut down before the first crash.”.  \n    \nhttps://www.google.com/amp/s/amp.theguardian.com/business/2024/feb/01/boeing-manager-737-max",
                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvweke/",
                  "created": 1712729361,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kywbvwm",
                      "score": 5,
                      "body": "Not sure where you're from, but the Max-9 doesn't fly in Europe. To my knowledge they fixed the issues with the MCAS. The recent engine cowling had absolutely 0 to do with it being a boeing plane. Tbh I'm also scared of the MAX, but you may not have a choice.\n\nSafety is also due to the airline do you not think? Many European airlines with Boeing planes have no fatalities (i.e ryanair)",
                      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywbvwm/",
                      "created": 1712741013,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "kywc9k9",
                          "score": 8,
                          "body": "With Ryan air you just wish you'd died instead",
                          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywc9k9/",
                          "created": 1712741305,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "kywe1rk",
                          "score": 5,
                          "body": "Iirc ryanair doesn't use any of the newer planes. They tend to use older planes to cut costs of buying a new fleet. They have ordered a shit load of the new 737- max 10s though, just haven't gotten many yet. I notice more use of the airbus a320s when I fly.   \n   \nhttps://corporate.ryanair.com/about-us/our-fleet/. \n    \nI have also noted on a handful of occasions the 737-8200 \"gamechangers\" being used.",
                          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywe1rk/",
                          "created": 1712742644,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "kywebc7",
                              "score": 2,
                              "body": "Is 737-800 safe in your view? I think ryanair has some MAX's in their fleet.\n\nCurrently debating Vueling vs Ryanair for a trip to Barcelona this summer. The ryanair trips are more convenient times but is also Boeing.",
                              "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywebc7/",
                              "created": 1712742838,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "kywhfb7",
                                  "score": 5,
                                  "body": "As a mechanic who works on 737-700s, -800s, and Max 8s currently I would have no qualms about flying on any of those I listed. The Max MCAS issues were largely resolved both with redundancies as well as the ability to disable it should all redundancies fail. Boeing’s quality control has come under serious scrutiny which has slowed production. Overall I do think this slowdown could be a positive as mistakes inevitably can happen with human factors, manufacturing, etc and by slowing production that *should* allow more time for assemblies to be inspected more closely and hopefully mitigate future issues as much as possible. Time will tell if they get it figured out, for the sake of air travel as a whole I hope they do.",
                                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywhfb7/",
                                  "created": 1712744996,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "kywi1dl",
                                      "score": 1,
                                      "body": "That's reassuring, I think the media are also scaring people (myself included). Like this engine cowling wasn't actually a Boeing fault was it? It happened to an airbus plane a few years ago, but it wasn't put in \\*every\\* British newspaper whereas this one has.",
                                      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywi1dl/",
                                      "created": 1712745403,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "kywidiu",
                                          "score": 2,
                                          "body": "I’m not on the investigation of that recent incident however that cowling that came unlatched was not a Boeing issue. The latches are dual stage, a main latch and then a smaller latch that locks the latch itself down(easier to show than explain). It’s my suspicion the incident that occurred recently was likely due to one or more of the latches being closed just far enough that at a quick glance may have looked latched(like on a preflight walkaround) but wasn’t latched far enough to engage the secondary part of the lock. This is speculation on my part but it’s the most likely cause I can think of offhand",
                                          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywidiu/",
                                          "created": 1712745622,
                                          "depth": 9,
                                          "replies": []
                                        },
                                        {
                                          "id": "kywimi4",
                                          "score": 2,
                                          "body": "Also as far as the media, aviation is one of those industries that even small mistakes or oversights can snowball and having had that cowl incident and the prior door plug blowout and then the early Max program issues it’s been a rough number of years for Boeing.",
                                          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywimi4/",
                                          "created": 1712745782,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "kywgrao",
                                  "score": 1,
                                  "body": "I think they've been flying long enough to weed out any issues. The max 10s are relatively new. The plus side, most of the 8200s were made prior to the current c-suite being in charge.",
                                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywgrao/",
                                  "created": 1712744545,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "kywgxjt",
                                      "score": 1,
                                      "body": "Max 10 isn’t out yet I don’t think, but no fucking way I’d fly on one when it first comes into service.\n\nRyanair should be safe this summer 🙏",
                                      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywgxjt/",
                                      "created": 1712744662,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "kyxco53",
                                  "score": 1,
                                  "body": "at this point any 737-800 issues are the fault of the airlines. I think southwest has been flying them for over 15 years now",
                                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxco53/",
                                  "created": 1712759398,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "kyxpfct",
                              "score": 1,
                              "body": "Good to know they’ll pretty much only have Boeing in their fleet. Haven’t flown Ryanair in ages but now I know that I should avoid at all cost",
                              "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxpfct/",
                              "created": 1712763873,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "kyxte10",
                                  "score": 2,
                                  "body": "I would avoid new stuff. Their older models are sound as they don't have any of the shit systems built into them.",
                                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxte10/",
                                  "created": 1712765281,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "kyxxzml",
                                      "score": 1,
                                      "body": "Yes those 300 Boeings 737 coming in the next 10 years 🫣",
                                      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxxzml/",
                                      "created": 1712766878,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "kyxyihh",
                                          "score": 2,
                                          "body": "Calls on ferries? Or boats?",
                                          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxyihh/",
                                          "created": 1712767061,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "kyvgo53",
                  "score": 31,
                  "body": "People are already refusing to fly on Boeing. My family’s flying cross country next week and I made damn sure we were gonna be on an Airbus.",
                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvgo53/",
                  "created": 1712720323,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "kyx075x",
                  "score": 2,
                  "body": "Will people really refuse to fly Boeing? People talk a big game, but in the end they’ll fly on whatever is available. People have really short attention spans and memories.",
                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyx075x/",
                  "created": 1712754600,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "kywmt8e",
                  "score": 1,
                  "body": "Lol. Have fun driving cross country next time.",
                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywmt8e/",
                  "created": 1712748259,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "kywqj21",
                  "score": 1,
                  "body": "You could argue Boeing knows this and sends least fault planes to countries where shareholders demographic will most use. Of course hypothetically",
                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywqj21/",
                  "created": 1712750191,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "kyvdu79",
              "score": 0,
              "body": "Better be the CEO's and bean counter's plane then",
              "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvdu79/",
              "created": 1712718996,
              "depth": 2,
              "replies": []
            },
            {
              "id": "kywavdn",
              "score": 1,
              "body": "Copying my last comment:\n\n\nIm literally taking a 17 hour flight on one (787 dreamliner) to singspore in may.... Business class seats though so atleast I'll die in style.\n\nActually on the trip I'll be on 3 dreamliner flights and then a 737-800.....",
              "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywavdn/",
              "created": 1712740234,
              "depth": 2,
              "replies": [
                {
                  "id": "kywkonn",
                  "score": 2,
                  "body": "There hasn't been a single dreamliner fatality, it's pretty safe aircraft.",
                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywkonn/",
                  "created": 1712747045,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kyxzdnr",
                      "score": 1,
                      "body": "Yeah i know, monkey brain not know though",
                      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxzdnr/",
                      "created": 1712767356,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "kywqe64",
                  "score": 1,
                  "body": "Nice which airline as they spec the interior and seating comfort and not Boeing",
                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywqe64/",
                  "created": 1712750123,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kyxz9i1",
                      "score": 2,
                      "body": "United",
                      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxz9i1/",
                      "created": 1712767317,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "kyv52bt",
          "score": 7,
          "body": "The problem is bean counters trying to trim quality so they can add to their margin.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv52bt/",
          "created": 1712715228,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kyvwkf9",
          "score": 4,
          "body": "fair points. but at what point does BA start blaming airlines? Are not most of these incidents maintenance issues? Should airlines not share responsibilities with BA?",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvwkf9/",
          "created": 1712729470,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kywqgkl",
          "score": 1,
          "body": "EASY FIX!!!!!! Re-brand the company to McDonnell Douglas!",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywqgkl/",
          "created": 1712750157,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kywsor5",
          "score": 1,
          "body": "Boeing doesn't make the engines.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywsor5/",
          "created": 1712751247,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kyvpeyi",
          "score": 0,
          "body": "lol. Both examples of worries you mentioned are maintenance related (more than likely United Airlines). \nTell me you don’t know what you’re talking about w/o telling me you don’t know what you’re talking about. \n\nOther than that tho yah I agree with your overall sentiment.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvpeyi/",
          "created": 1712724952,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyv858u",
      "score": 86,
      "body": "i already have a may 17 225$ call that i bought at peak price 🤦‍♂️",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv858u/",
      "created": 1712716496,
      "depth": 0,
      "replies": [
        {
          "id": "kyvpkuv",
          "score": 42,
          "body": "May 2025, right? Right?!?",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvpkuv/",
          "created": 1712725046,
          "depth": 1,
          "replies": [
            {
              "id": "kywppbn",
              "score": 7,
              "body": "nope 🤣",
              "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywppbn/",
              "created": 1712749778,
              "depth": 2,
              "replies": [
                {
                  "id": "kywqa7v",
                  "score": 14,
                  "body": "Close it before its worthless ![img](emote|t5_2th52|31226)",
                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywqa7v/",
                  "created": 1712750069,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kywu8nc",
                      "score": 1,
                      "body": "Only right answer.",
                      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywu8nc/",
                      "created": 1712751978,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "kyyn2yr",
                      "score": 1,
                      "body": "just sold for 13$ 🤦‍♀️",
                      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyyn2yr/",
                      "created": 1712775368,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "kyyqm1m",
                          "score": 1,
                          "body": "Its ok, as long as you learned. Im still losing money on MSTR because I can never learn my lesson,blew half of my account on it ![img](emote|t5_2th52|31225)",
                          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyyqm1m/",
                          "created": 1712776542,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "kyvj5uq",
          "score": 9,
          "body": "Womp womp. Sorry.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvj5uq/",
          "created": 1712721550,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kyvq2j6",
          "score": 4,
          "body": "lol why didn’t you go lower and June or July?!",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvq2j6/",
          "created": 1712725332,
          "depth": 1,
          "replies": [
            {
              "id": "kywqqpj",
              "score": 2,
              "body": "Are you disorientated",
              "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywqqpj/",
              "created": 1712750298,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "kyw51g4",
          "score": 4,
          "body": "Got some jun 20, 2025 210$ calls",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyw51g4/",
          "created": 1712735681,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyuylzv",
      "score": 162,
      "body": "Positions or gtfo",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyuylzv/",
      "created": 1712712651,
      "depth": 0,
      "replies": [
        {
          "id": "kyv21rj",
          "score": 104,
          "body": "Reverse cowboy",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv21rj/",
          "created": 1712714014,
          "depth": 1,
          "replies": [
            {
              "id": "kyv27vj",
              "score": 44,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv27vj/",
              "created": 1712714082,
              "depth": 2,
              "replies": [
                {
                  "id": "kyv58l6",
                  "score": 17,
                  "body": "Amazonian you say?",
                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv58l6/",
                  "created": 1712715299,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kyv9ifs",
                      "score": 8,
                      "body": "I’m now suddenly flexible",
                      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv9ifs/",
                      "created": 1712717075,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "kyvitdx",
                      "score": 8,
                      "body": "Oh fuck you're gonna make me snu snu",
                      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvitdx/",
                      "created": 1712721373,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "kyvjur1",
                          "score": 13,
                          "body": "The spirit is willing, but the flesh is spongy and bruised",
                          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvjur1/",
                          "created": 1712721907,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "kyv9m3a",
                      "score": 2,
                      "body": "And MY axe!",
                      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv9m3a/",
                      "created": 1712717119,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "kyw61az",
                  "score": 5,
                  "body": "Alyssa: So, for you, to fuck is to penetrate. You're used to the more traditional definition. You inside some girl you duped, jackhammering away, not noticing that bored look in her eyes.\n\nBanky Edwards: Hey, I always notice that bored look in their eyes, alright?",
                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyw61az/",
                  "created": 1712736458,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "kyvp109",
          "score": 2,
          "body": "Helicoptr",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvp109/",
          "created": 1712724728,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyv2hlh",
      "score": 48,
      "body": "The CEOs and VPs didn't care shit about their workers and consumers, trying always to pinch and dime so they can get their fat bonuses and now they are paying the consequences. What did it for me was the killing of the whistleblower",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv2hlh/",
      "created": 1712714192,
      "depth": 0,
      "replies": [
        {
          "id": "kyvi7f8",
          "score": 17,
          "body": "And killing their customers. Can't believe I said that... Profit before lives right?",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvi7f8/",
          "created": 1712721068,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kyy0ri5",
          "score": 2,
          "body": "The rumor I've heard repeated but doesn't make it true was the culture shift from engineering led decision-making to incompetent but higher ranking executive group think dominating their priorities. Too general to be useful but does make me hesitate rather than want to risk catching falling knives.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyy0ri5/",
          "created": 1712767824,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kyve3z4",
          "score": -2,
          "body": "not giving a shit about workers is bullish",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyve3z4/",
          "created": 1712719121,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyvpz16",
      "score": 21,
      "body": "Boeing is not what is used to be\n\nBoeing was awarded 4.2 billion dollars from NASA In 2014 to develop the starliner. \nSpaceX Created it's space capsule in 2020 and was awarded nasas contract.\nToday Boeing is still working to develop the starliner.\nMeanwhile SpaceX has almost fully developed starship(the largest rocket system in history) \n\nBoeing 777-9x was suppose to enter service In 2020.  Now that looks like it will be 2025 to 2026.\n\nAll of the incompetence, has pushed back the factory production of the Boeing 737. The airlines, logistics, and everyone is taking a huge hit because of Boeing's delays. They literally cannot groe. Entire hubs are having to delay expansion.\n\nIt's only a matter of time before Airbus jumps into rescue the day\n\nThis public private partnership seems to have grown into a monster at Boeing. A monster of government backed incompetence.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvpz16/",
      "created": 1712725276,
      "depth": 0,
      "replies": [
        {
          "id": "kywbkh9",
          "score": 5,
          "body": "Airbus seems to be already doing that, now there's even talk about splitting spirit Aereosystems between AIR and BA, but i feel like AIR will get the better deal out of this, overall AIR is just better positioned in the business airmarket rn, i gotta say tho, when it comes down to defense BA is still ahead of AIR.  \n(I have a large position in AIR and haven't held BA positions since early 2023 btw)",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywbkh9/",
          "created": 1712740770,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyv376j",
      "score": 62,
      "body": "https://preview.redd.it/h17bpcpc7ktc1.jpeg?width=403&format=pjpg&auto=webp&s=4d8615d09ad82250aee0d00e58b21b7e10a84164\n\nCalls because their all time chart looks like a cock and im rock hard rn ![img](emote|t5_2th52|8883)",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv376j/",
      "created": 1712714477,
      "depth": 0,
      "replies": [
        {
          "id": "kyza8uk",
          "score": 1,
          "body": "Got to say it's missing a ball though. The shot won't be that high.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyza8uk/",
          "created": 1712782990,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyv336o",
      "score": 13,
      "body": "This stock has chlamydia",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv336o/",
      "created": 1712714432,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyv2n7g",
      "score": 11,
      "body": "Good call. I am with you on this one!! Honestly, as of right now, I am already trying to get into this stock. Since I have started buying, you can bet that it will fall much further from here \n\n![img](emote|t5_2th52|4271)",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv2n7g/",
      "created": 1712714254,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyw0059",
      "score": 8,
      "body": "I disagree with OP\n\n1. Defense\n\n- f15ex buy is good money for Boeing\n- Chinook f model replacement money is coming\n- upcoming tanker batch procurement is unlikely to go for a a330 mrtt based solution..I'm sure the Boeing lobbyists will kill it if it does.\n- kc-46 Pegasus need not make money on a program basis. It's the lifetime sustainment costs that will make bank. Have you any idea how much it costs to maintain, upkeep and continuously fly a widebody ? \n\n2. Commercial\n\n- 787 has the best in class efficiencies. 350 cannot match this except in terms of payload at certain range\n- 787 is about the midpoint mark in the production curve and a refreshed or new engine option or improved version is likely to be out in another 5 years\n- 787-10 is a sleeper hit that is positioned to capture the 300ER/300 replacement market in Asia \n- 737-10 max may be old but its fleet commonalities and demand is still strong as airbus can't pump out enough 321neos\n- any clean sheet 737 replacement will likely be met by a rewinged a320neo option, which can only go larger or longer, which can be squeezed by a cheaper 787 shrink (787-3 renewed, see the Lehman analysis) \n- commercial is in a shitpile of its own doing, but Boeing has and always been a engineering company. It can deliver when pushed comes to shove.\n- you're right on the call that boeing will suffer cashflow wise, but it will be for the next 1-2 years and when the max production rates go back up to 56 per month, Boeing will be king of the hill.\n\n3. Services \n- don't know much except that they operate a legacy logistics model for their gold care program e.g like caterpillar with massive inventory and warehouses\n- lots of potential efficiency gains and potential to be unlocked here.\n\nMy target is for boeing to go down to 160 in the next 6 months and back to 220 in the next 2 years",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyw0059/",
      "created": 1712731894,
      "depth": 0,
      "replies": [
        {
          "id": "kz0qr4g",
          "score": 1,
          "body": "regard here fell in love with the stock",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kz0qr4g/",
          "created": 1712802985,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyv3ylq",
      "score": 7,
      "body": "I am locked in, prisoner.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv3ylq/",
      "created": 1712714778,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyv3sjc",
      "score": 4,
      "body": "Not sure if you are using the term value trap correctly, but I get your point",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv3sjc/",
      "created": 1712714710,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyv35dp",
      "score": 9,
      "body": "I’m slowly SLOWLY beginning to build a position. Despite their commercial issues, they have huge military contracts that aren’t going anywhere. If it holds October’s low (176.25) - that will definitely show strength in the face of adversity. \n\nHaving said that, I have my stops placed. If it breaks through this support, there is a good chance it can come down to 120ish. Keeping close eye, but liking the risk/reward.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv35dp/",
      "created": 1712714456,
      "depth": 0,
      "replies": [
        {
          "id": "kyvqqpf",
          "score": 9,
          "body": "I wouldn’t mind seeing an historic $120 drop off by April 12 👀",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvqqpf/",
          "created": 1712725738,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kyv3fwb",
          "score": 7,
          "body": "Unfortunately, the military contracts are not profitable, either.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv3fwb/",
          "created": 1712714574,
          "depth": 1,
          "replies": [
            {
              "id": "kyv3mrl",
              "score": 3,
              "body": "How do you figure? Not arguing, just wondering.",
              "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv3mrl/",
              "created": 1712714648,
              "depth": 2,
              "replies": [
                {
                  "id": "kyv4rcr",
                  "score": 10,
                  "body": "It's public information.  They are saddled with fixed cost contracts. Boeing has... problems.",
                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv4rcr/",
                  "created": 1712715104,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "kyv6x32",
                      "score": 4,
                      "body": "Boeing has problems but wallstreet have bigger problems the degenerates that they are.\n\nThey'll start screaming calls tomorrow.",
                      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv6x32/",
                      "created": 1712715987,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "kyv6p50",
                      "score": 2,
                      "body": "So where do you realistically see the bottom?",
                      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv6p50/",
                      "created": 1712715897,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "kyx0dzy",
              "score": 1,
              "body": "Would you say the same about RTX and other gov't contractors? I don't follow this sector much but am thinking about it, no matter to me it'll be Call or Put directions.",
              "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyx0dzy/",
              "created": 1712754679,
              "depth": 2,
              "replies": [
                {
                  "id": "kyx0u3t",
                  "score": 1,
                  "body": "Nah, this was Boeing going aggressively after fixed cost contracts thinking inflation will stay low.  Other defense players are a screaming buy.  Wars are not stopping.",
                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyx0u3t/",
                  "created": 1712754863,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "kyvzutr",
          "score": 3,
          "body": "I’m 💯 doing the same . I think 176 is key level if broken . I’m buying if it drops more. There is 30% upside after a year when this issues are done away",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvzutr/",
          "created": 1712731787,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyve7eh",
      "score": 11,
      "body": "Translation: OP is short BA, and intends to go long later this year.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyve7eh/",
      "created": 1712719165,
      "depth": 0,
      "replies": [
        {
          "id": "kywpkzl",
          "score": 2,
          "body": "It took far too much scrolling to find this.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywpkzl/",
          "created": 1712749717,
          "depth": 1,
          "replies": []
        },
        {
          "id": "kywuvuj",
          "score": 2,
          "body": "Translation, he’s trying to time the dip. Sounds like a buy right now.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywuvuj/",
          "created": 1712752275,
          "depth": 1,
          "replies": [
            {
              "id": "kyzrwur",
              "score": 1,
              "body": "Send him my best regards. The only thing dipping faster than the market is a Boeing plane.",
              "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyzrwur/",
              "created": 1712789353,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "kyvk0xt",
      "score": 4,
      "body": "I’d say don’t buy it at all, shit company…",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvk0xt/",
      "created": 1712721994,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvowvl",
      "score": 4,
      "body": "I just cashed in on all my puts because it’s just run into a major support. You may or may not believe in technicals but fundamentally they’re in a holding pattern till they get their issues sorted and will be at the mercy of the news cause you better believe they’ll miss earnings in a few weeks. \n\nI would wait till ER to at least see whether or not it holds on to ~$175 before getting a large-ish position short or long. If it somehow holds, it’s a long way up so you won’t miss much and if it doesn’t hold, which imo is likely, you’ll get a better entry…",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvowvl/",
      "created": 1712724662,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvrj41",
      "score": 5,
      "body": "By this logic, I expect Boeing to go up tomorrow.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvrj41/",
      "created": 1712726224,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvmjf5",
      "score": 7,
      "body": "I don't think the loss of brand power and goodwill are priced into the stock. Everybody is asking what the next quarter's earnings will look like. Meanwhile their customers are plotting full shifts to Airbus and Comac. \n\nWe might have had all the warnings and close calls we're going to get. Defective airplanes are out there, and they are going to crash. That hidden liability hasn't entered most people's brains yet. \n\nBA will have its resources tied up in court, and will fall behind in the development of new products. It will become the Intel of aerospace, except less able to deliver its product.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvmjf5/",
      "created": 1712723321,
      "depth": 0,
      "replies": [
        {
          "id": "kyyfaog",
          "score": 1,
          "body": "intel got bailed out by AI for anyone brave enough to buy in the mid to upper 20s like a year ago. \n\nBA just needs to announce that they're putting AI in charge of all of the bureacratic bullshit to trim costs and catch shit and the stock would moon\n\n/s",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyyfaog/",
          "created": 1712772777,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyv7whz",
      "score": 3,
      "body": "I will buy a little lower",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv7whz/",
      "created": 1712716395,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvdupd",
      "score": 3,
      "body": "To top this off another engineer whistleblower just sounded off today that upper management has forced them to push through safety regulations and standards to remedy a production bottleneck! Specifically on the 787s. Says like 1400 planes out there are fucked up and have a significantly reduced product lifespan and are vulnerable to problems…. Lovely company!",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvdupd/",
      "created": 1712719002,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyv52yg",
      "score": 7,
      "body": "It'll be in the 220s a year from now if not higher.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv52yg/",
      "created": 1712715236,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyv62qu",
      "score": 5,
      "body": "Damn…..I already bought calls!",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv62qu/",
      "created": 1712715643,
      "depth": 0,
      "replies": [
        {
          "id": "kyvj3xc",
          "score": 5,
          "body": "It's okay, you're inversing this regard's advice.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvj3xc/",
          "created": 1712721522,
          "depth": 1,
          "replies": [
            {
              "id": "kyvqwe2",
              "score": 2,
              "body": "It’s all good….I have over 2 years for them to try and catch up!",
              "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvqwe2/",
              "created": 1712725837,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "kyv9tx5",
      "score": 7,
      "body": "Boeing is holding the bag!  Think about this for any aviation types.  Other than the software issues (which were catastrophic and should have been vetted prior to launch of 737 max), the majority of the issues appear to be one of 2 possibilities.  1.  Boeing manufacturing is below aviation standards.  \n2. Maintenance departments are short cutting or are not applying appropriate training procedures set about by Boeing.  \n\nI would say with the TFOA (things falling off aircraft) and engine issues that it could be the latter.  Furthermore, when a mishap occurs it can vary easily become a liability blame game.  Bottom line is I wonder what really has been the cause and contributing factors of these Mishaps (other than the software).  NTSB mishap investigators are the only ones who really know.  \n\nThat leaves me with the impression that Boeing is apprehensive of defending the quality (go on the offensive against maint departments) and would rather cut leadership and rebuild to save face.  Clearly, it is a no win situation for Boeing for at least a year if you are a value investor",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv9tx5/",
      "created": 1712717212,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvdkh7",
      "score": 2,
      "body": "Puts?",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvdkh7/",
      "created": 1712718870,
      "depth": 0,
      "replies": [
        {
          "id": "kyww7xf",
          "score": 1,
          "body": "Sold  for  $160  4/19  before earnings, to be safe.  Buying puts is another option, but you’re risking losing money.  Could buy a couple as a longshot for \n after earnings reported to cash in on any possible freefall.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyww7xf/",
          "created": 1712752880,
          "depth": 1,
          "replies": [
            {
              "id": "kyxb91h",
              "score": 1,
              "body": "What’s your projected pricing for them and timeline look like?",
              "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxb91h/",
              "created": 1712758888,
              "depth": 2,
              "replies": [
                {
                  "id": "l0q49hr",
                  "score": 2,
                  "body": "Hi. Sorry did not answer.   I can't give anyone financial advice as I'm not a big maverick in the market.  Boeing appears to be doing \"well\" considering they are 2 days away from earnings, but a surprise drop/pullback could occur.  Or a surprise up too.  It's a gamble.  PPL with big money & access to info not published in the news (or not yet ) with lots of shares can cause dramatic price movements, up or down.",
                  "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/l0q49hr/",
                  "created": 1713784113,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "kyvdo58",
      "score": 2,
      "body": "Puts? Keeps going down. Do you think we see 160?",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvdo58/",
      "created": 1712718917,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvf5tv",
      "score": 2,
      "body": "Why was stock at 250 YTD with the same contracts and issues ??",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvf5tv/",
      "created": 1712719608,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvi25y",
      "score": 2,
      "body": "I’m in august calls. Do I take 50% loss or can it be higher in august?",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvi25y/",
      "created": 1712720996,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvi75p",
      "score": 2,
      "body": "Well I just bought 16 shares at 184. Probably not bottom, but it will come back.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvi75p/",
      "created": 1712721064,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvmg87",
      "score": 2,
      "body": "Don’t buy any Boeing dip. Nothing has changed culturally. Currently you have a new pig that they’re fitting with new lipstick.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvmg87/",
      "created": 1712723272,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvpmbu",
      "score": 2,
      "body": "!remindme 5 months",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvpmbu/",
      "created": 1712725070,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kywg8jn",
      "score": 2,
      "body": "I'm not buying this dip, but the next bigger dip. Stocks, not calls. This shit show is a long-term play that the company won't go bankrupt.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywg8jn/",
      "created": 1712744194,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvoizm",
      "score": 4,
      "body": "Also, Boeing assassinated a whistleblower for quality control. They should fail and burn to the ground.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvoizm/",
      "created": 1712724438,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyv175b",
      "score": 3,
      "body": "I GTFO, bought in 2020 so I snuck out with a decent return. I wouldn’t doubt if it dropped into the 130s before leveling out if the problems continue to persist.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv175b/",
      "created": 1712713676,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvdor9",
      "score": 5,
      "body": "I'm now shopping for airlines that fly Airbus on the routes I'm taking. No more Boeing for a very long time",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvdor9/",
      "created": 1712718925,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvt7jr",
      "score": 2,
      "body": "https://preview.redd.it/bgsa29ge9ltc1.jpeg?width=1284&format=pjpg&auto=webp&s=e456b610604ce3508d344d3f442f911601e14e72\n\nJust spent the last week in Seattle. Every few hours there was a 747 in the air it seems. Long BA. Museum of Flight is amazing",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvt7jr/",
      "created": 1712727268,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyv06qw",
      "score": 1,
      "body": "I wouldnt dare",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyv06qw/",
      "created": 1712713274,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvhjvq",
      "score": 1,
      "body": "![img](emote|t5_2th52|12787)",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvhjvq/",
      "created": 1712720751,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvhlji",
      "score": 1,
      "body": "Curious on the new whistleblower.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvhlji/",
      "created": 1712720774,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvjjsr",
      "score": 1,
      "body": "I started a position today, right before a big red candle of doom appeared.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvjjsr/",
      "created": 1712721747,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvpipv",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvpipv/",
      "created": 1712725012,
      "depth": 0,
      "replies": [
        {
          "id": "kyvpldm",
          "score": 1,
          "body": "I will be messaging you in 5 months on [**2024-09-10 04:56:52 UTC**](http://www.wolframalpha.com/input/?i=2024-09-10%2004:56:52%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvpipv/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1c09848%2Fboeing_dont_buy_this_dip_either%2Fkyvpipv%2F%5D%0A%0ARemindMe%21%202024-09-10%2004%3A56%3A52%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201c09848)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvpldm/",
          "created": 1712725055,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyvt1ok",
      "score": 1,
      "body": "But they were setup.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvt1ok/",
      "created": 1712727168,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvttol",
      "score": 1,
      "body": "The difference between this \"dip\" and the last is that the last major dip was caused by hundreds of people dying.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvttol/",
      "created": 1712727664,
      "depth": 0,
      "replies": [
        {
          "id": "kywap1v",
          "score": 1,
          "body": "But still profitable right?",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywap1v/",
          "created": 1712740096,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyvvixx",
      "score": 1,
      "body": "agree... waiting for it to hit the $120s",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvvixx/",
      "created": 1712728768,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvyzan",
      "score": 1,
      "body": "Look for the trend to remain in a downtrend",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvyzan/",
      "created": 1712731158,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvz5d7",
      "score": 1,
      "body": "It is THE Boeing, I buy whenever it dips",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvz5d7/",
      "created": 1712731280,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvzl8u",
      "score": 1,
      "body": "Bro the doors are flying off mid flight no one is buying this dip 😂",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvzl8u/",
      "created": 1712731598,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvzm8s",
      "score": 1,
      "body": "I agree with market sentiment right now but Boeing is one of the two plane manufacturers. They have tons of orders nobody else can deliver. I think Stock is worth looking at 160$",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvzm8s/",
      "created": 1712731618,
      "depth": 0,
      "replies": [
        {
          "id": "kyzby9b",
          "score": 1,
          "body": "120",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyzby9b/",
          "created": 1712783574,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyvzwz3",
      "score": 1,
      "body": "I can make it go up for y'all. All I have to do is buy puts.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvzwz3/",
      "created": 1712731830,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyw2lwz",
      "score": 1,
      "body": "I’ll probably cash in my puts now. It was a good ride though. Not many trades are so obvious. ",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyw2lwz/",
      "created": 1712733818,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kywan62",
      "score": 1,
      "body": "As in dip while in sky?...",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywan62/",
      "created": 1712740057,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kywat34",
      "score": 1,
      "body": "!remindme 2 months",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywat34/",
      "created": 1712740183,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kywd31u",
      "score": 1,
      "body": "I don't know anything about anything but Boeing is definitely on my radar as a future buy, just hasn't hit any price levels I'm interested in yet",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywd31u/",
      "created": 1712741925,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kywd94d",
      "score": 1,
      "body": "maybe RTX will buy them",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywd94d/",
      "created": 1712742052,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kywhrzf",
      "score": 1,
      "body": "Boeing needs to start a war for money",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywhrzf/",
      "created": 1712745230,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kywj3cm",
      "score": 1,
      "body": "There has to be a gut job from the top down. That'll take 12-18 months.\n\nMy company is going through this right now, I'm just riding out the lower stock price for better strike points on options....\n\nAirbus will always be competition but US government will bail Boeing out when it gets critical.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywj3cm/",
      "created": 1712746075,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kywkish",
      "score": 1,
      "body": "Boeing been through worst their stock bounce back",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywkish/",
      "created": 1712746948,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kywndyf",
      "score": 1,
      "body": "Rycey is the stock to buy instead.  It’s up a lot over past year but long term has much more room to grow.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywndyf/",
      "created": 1712748570,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kywnr8n",
      "score": 1,
      "body": "Kind of like GMs in the 70s. Too many bean counters in charge.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywnr8n/",
      "created": 1712748766,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kywovgv",
      "score": 1,
      "body": "Boeing now has an image problem. As a company you don't want that. Right now people are thinking hope my airplane doesn't go down. That's bad. Any sane CEO would have rectified this immediately but because of their non existent QA. \n\n\nThat being said long term they are still a play because of being a monopoly. Just hedge your bets for short terms. Beside media loves extra reporting on Boeing right now",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywovgv/",
      "created": 1712749355,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kywsug1",
      "score": 1,
      "body": "These threads always tend to have 1 or 2 well thought out unbiased replies. then it's hoards of r/all being dramatic and throwing up their feelings all over the comment section.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywsug1/",
      "created": 1712751322,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kywsx3d",
      "score": 1,
      "body": "I am buying a share a day",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywsx3d/",
      "created": 1712751357,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kywt0zp",
      "score": 1,
      "body": "This is exactly why you should buy $ERJ",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywt0zp/",
      "created": 1712751410,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kywuy0j",
      "score": 1,
      "body": "<<Government Bailout has entered the chat>>",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywuy0j/",
      "created": 1712752302,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kywv7ns",
      "score": 1,
      "body": ">1. Defense Business: Boeing is working through some very poor defense contracts \n \nSo you’re telling me we’re gonna start a new war soon, PUMP IT UP",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kywv7ns/",
      "created": 1712752426,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyx1brx",
      "score": 1,
      "body": "My bull case for BA rn is their allowed production is super low and sentiment is in the toilet. Can it be worse? Yes, but likely less than the up side. BA mgmt got the wakeup calls (no pund intended) and is working on it. It'll take a while thru engr & red tapes, but countries and airlines need BA to turn around their quality and production. I believe upside is at better chance than downside now. Thoughts?",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyx1brx/",
      "created": 1712755066,
      "depth": 0,
      "replies": [
        {
          "id": "kyx27va",
          "score": 2,
          "body": "Issue is it will take time to work through the issues.  Airlines will scream for and lobby for more airplanes.  Eventually they will get them, but the administration is running on the plank of \"big business bad\" and wants to show it stands up to the injustice against the little guy (see the justice department's vaporware case against AAPL, for example).  On top, there are real issues without simple solves.  I haven't seen any BA planes fall to ground in last two years, but people keep talking about quality as if loose rivets can't happen in maintenance.  The challenges are real.  BA is a strong investment as sum of parts.  It's possible it may go the GE way and split Defense and Commercial.  Again - long term play.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyx27va/",
          "created": 1712755430,
          "depth": 1,
          "replies": [
            {
              "id": "kyzchu6",
              "score": 1,
              "body": "Speaking of GE, didn't BA try to court GE Air's CEO to join? No success yet, but it would be a good change.",
              "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyzchu6/",
              "created": 1712783761,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "kyx29lx",
      "score": 1,
      "body": "It’s priced in. If you think it’s a long term buy, there’s no reason to wait.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyx29lx/",
      "created": 1712755449,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyx7ti3",
      "score": 1,
      "body": "defense margin is fixed for every company isn’t that’s the purpose of cost +",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyx7ti3/",
      "created": 1712757623,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyxa9e1",
      "score": 1,
      "body": "How can you have “poor margins” on defense contracts, that’s like selling crack and claiming you’re not making money",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxa9e1/",
      "created": 1712758528,
      "depth": 0,
      "replies": [
        {
          "id": "kyxb870",
          "score": 1,
          "body": "3 words: fixed rate contracts. These were signed in a 0 inflation environment.  The bean counters misjudged.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxb870/",
          "created": 1712758880,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyxbgyx",
      "score": 1,
      "body": "So where do u think BA will bottom out because it’s already below is closing price of $213 on Jan 2 2023",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxbgyx/",
      "created": 1712758968,
      "depth": 0,
      "replies": [
        {
          "id": "kyxd8z6",
          "score": 1,
          "body": "It's a falling knife.  Hard to pin the bottom.  $120 will be a good entry point.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxd8z6/",
          "created": 1712759604,
          "depth": 1,
          "replies": [
            {
              "id": "kyzcsf8",
              "score": 1,
              "body": "Yeah. On chart, 120 seems decent and the time it takes to get there, hopefully many issues are ironed out by then.",
              "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyzcsf8/",
              "created": 1712783861,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "kyxhaoq",
      "score": 1,
      "body": "Too many words, magic man. Time to buy puts on airplane doors",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxhaoq/",
      "created": 1712761030,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyxiodl",
      "score": 1,
      "body": "is this financial advice?",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxiodl/",
      "created": 1712761520,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyxkhoq",
      "score": 1,
      "body": "Can’t really see myself supporting Boeing after that John Oliver news segment. Just seems like an awful company to work for and put lives in the hands of.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxkhoq/",
      "created": 1712762159,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyxstzz",
      "score": 1,
      "body": "Remember that time when Boeing assassinated a whistleblower and nobody gave a fuck?\n\nThat was dope.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxstzz/",
      "created": 1712765085,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyxz4h3",
      "score": 1,
      "body": "You forgot that Boeing has investors from Russia...",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyxz4h3/",
      "created": 1712767270,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyy0vzk",
      "score": 1,
      "body": "The culture at boeing is so toxic. I live nearby and have chatted with people who used to work there. You literally get in trouble for \"working too hard\". I worked at a go-kart track and I had to brace myself when the boeing yuck yucks would roll in. Rowdiest guys I'd ever seen. They acted like a bunch of middle schoolers. I couldn't believe they were assembling aircraft. I hope they can turn it around. It's just a lot of poor management.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyy0vzk/",
      "created": 1712767866,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyy414m",
      "score": 1,
      "body": "Could someone explain me how Boeing Defence is doing poorly even though there are multiple wars going on? I’m getting into the stock market and I’m trying to understand the market and economics behind this.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyy414m/",
      "created": 1712768942,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyy578e",
      "score": 1,
      "body": "150 july puts printing",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyy578e/",
      "created": 1712769345,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyy71u8",
      "score": 1,
      "body": "How do you research or learn about a company/industry to come up with an opinion like you have? Any general tips on where to start or fundamental things one should learn when evaluating/understanding a company/industry?",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyy71u8/",
      "created": 1712769976,
      "depth": 0,
      "replies": [
        {
          "id": "kyybc7p",
          "score": 2,
          "body": "There isn't much magic to it: generally, you have sufficient information available publically to make decisions.  Read the earning reports, read the P&L (learn to if you don't know how), and then read how market values similar businesses.  Finally, patience.  Most theses take time to pan out.  If you are wrong, accept that you were wrong.  You can be right on fundamentals, but still get killed if you are wrong on timing.",
          "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyybc7p/",
          "created": 1712771436,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "kyzkpsl",
      "score": 1,
      "body": "man i hope i saw this post earlier bought 240c already 5/17",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyzkpsl/",
      "created": 1712786651,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyzowd4",
      "score": 1,
      "body": "Haha nope. Agreed. Don’t buy.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyzowd4/",
      "created": 1712788212,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyzvnrz",
      "score": 1,
      "body": "![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4267)",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyzvnrz/",
      "created": 1712790789,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kz3ohmm",
      "score": 1,
      "body": "You’re wrong. I just bought in and everything I touch turns to gold. Watch",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kz3ohmm/",
      "created": 1712854681,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kz78ern",
      "score": 1,
      "body": "This has to affect Airbuses stock prices at least in the long term?",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kz78ern/",
      "created": 1712906062,
      "depth": 0,
      "replies": []
    },
    {
      "id": "kyvjkzz",
      "score": 0,
      "body": "Boeing is a massive flaming sack of monkey shit.\nIt’s only going to get worse and may never actually recover. Why? It’s because of the knowledge and skill they’ve squandered away through profit driven decision making that went for the lowest cost labor and DEI scores above all else. The board of directors, executives, and senior managers could give a flying fuck if their decisions kill people so long as they get their nut, as proven by recent events. Airplanes are insanely complicated, if Boeing doesn’t design and build a new one within this decade it’s toast. It takes decades to build the knowledge base infrastructure to design and build a system this complex and what does Boeing do, they double down on DEI and go balls deep into India for their engineering labor.",
      "permalink": "/r/wallstreetbets/comments/1c09848/boeing_dont_buy_this_dip_either/kyvjkzz/",
      "created": 1712721765,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "Boeing is facing cash flow challenges and is not a good buy in the short to medium term despite being a long-term buy.",
    "companies": [
      "Boeing"
    ],
    "tickers": [
      "BA"
    ],
    "main_ticker": [
      "BA"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "The user analyzes Boeing's current challenges and advises against buying the stock now despite its long-term potential.",
    "stock_recommendations": "The user is recommending not to buy Boeing stock currently.",
    "is_recommending_stock_buying_or_selling": true,
    "buy_or_sell": "sell",
    "sentiment_summary": "There is negative sentiment because the author advises against buying Boeing stock due to short to medium term challenges.",
    "sentiment": "negative"
  }
}