{
  "title": "[deleted by user]",
  "score": 24,
  "selftext": "[removed]",
  "link_flair_text": null,
  "id": "1c77j30",
  "num_comments": 9,
  "created_utc": 1713457386,
  "permalink": "/r/wallstreetbets/comments/1c77j30/deleted_by_user/",
  "comments": [
    {
      "id": "l05xfxg",
      "score": 21,
      "body": "I’m guessing this news will somehow cause them to drop 5% in 30 seconds like TSM did right",
      "permalink": "/r/wallstreetbets/comments/1c77j30/deleted_by_user/l05xfxg/",
      "created": 1713457599,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l0616dq",
      "score": 6,
      "body": "Im doubling down on micron and hoping for a bounce back",
      "permalink": "/r/wallstreetbets/comments/1c77j30/deleted_by_user/l0616dq/",
      "created": 1713458855,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l060qpf",
      "score": 3,
      "body": "I agree the country needs to secure supply chains, chips included, but enough is enough with the money giveaways, AKA grants. If the companies need incentives, fine but get something in return, such as equity in the company or credit toward future purchases, and enough with the promises, get guarantees with failure costs. \n\nThe country can't afford fragile supply chains, but it also can't afford to spend billions on promises, meant if which will go unkept. \n\nThis is strictly yet another corporate welfare program, putting money directly into the pockets of owners of the chip companies.",
      "permalink": "/r/wallstreetbets/comments/1c77j30/deleted_by_user/l060qpf/",
      "created": 1713458711,
      "depth": 0,
      "replies": [
        {
          "id": "l0671x9",
          "score": 2,
          "body": "Something in return? It's called creating jobs, increasing spending which stimulates the economy... it's too risky for any companies to expand without government subsidiaries. Go back to school",
          "permalink": "/r/wallstreetbets/comments/1c77j30/deleted_by_user/l0671x9/",
          "created": 1713460828,
          "depth": 1,
          "replies": [
            {
              "id": "l06bhcu",
              "score": 3,
              "body": "Government spending always stimulates the economy. Permanent jobs are only created over the long term when these endeavors are successful, and queue often they are not. Here's a very recent example of a difference. During COVID the US government gave a trillion to Rx companies for the development, testing, and for initial doses of any vaccines developed. The UK did a similar thing but kept the intellectual property of the drugs, think patients. It worked just as well, but they paid far less for doses. There are many many other examples. \n\nThis is about efficiency and effectiveness. \n\nYou write it's too risky to expand without government subsidy, I agree. Which is why I'm for government support, but not give-always without guarantees / commitments.  \n\nBy the way, my first graduate degree was in the eighties, I got another one along the way. I've spent most of my time in management consulting. You may disagree with me, but I know what I'm talking about. \n\nThe likelihood of success is much much greater if some form of exchange is negotiated rather than a giveaway/grant. \n\nI won't insult you, as you did me, but it would be easy - your naivete is clear.",
              "permalink": "/r/wallstreetbets/comments/1c77j30/deleted_by_user/l06bhcu/",
              "created": 1713462293,
              "depth": 2,
              "replies": [
                {
                  "id": "l08hsr4",
                  "score": 1,
                  "body": "[deleted]",
                  "permalink": "/r/wallstreetbets/comments/1c77j30/deleted_by_user/l08hsr4/",
                  "created": 1713490659,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l0946ks",
                      "score": 1,
                      "body": "Consider the history of chip manufacturing. I've lived through it so I remember the broad strokes but not details such as dates, legislation, etc, but here is an interesting slice...\n\nWhen the US started using ICs AKA chips in military equipment they decided to use a lot of Intel CPUs. The problem was that the military required two domestic sources for all mission critical equipment, but one could only buy Intel chips from Intel. The requirement forced Intel to allow another domestic company to make Intel chips, or lose the business, likely at the time to Motorola or Texas Instruments, who might let another company make their CPUs. The problem was solved by partnering with a small chip maker at the time called Advanced Micro Devices, better known now as AMD. That's why to this day AMD makes Intel compatible chips. Unfortunately, as the US evolved more and more into a country in service to not Americans, but in service to global corporations, in order to be 'business friendly' and satisfy corporations, their industry groups, lobbiests, etc, many laws, regulations and rules were abolished. Gotta be business friendly, right? Maybe, but actually politicians couldn't jeopardize campaign donations, alternating lobbiests, etc. So here we are today. \n\nA solution better than throwing money at chip companies is to let capitalism and free markets do it's job. Dictate the requirements, as the military did prior to around the late eighties or early nineties, and allow companies (new and existing ones) to meet the requirements. Working with industry experts, the government could go back to the old two domestic sources regulation and a timeframe that would dictate demand, so the companies could know what they could sell by when. For example, 20% of CPUs supplied to the government by 2027 must be sources in the US, by 2030, some higher percentage, etc. \n\nThis works. The chips are at first likely to be more expensive than those made in Taiwan, but probably less than the throw money at the global corporations solution. But, the companies would rather just get free money, so that's what's happening. \n\nThis is just one specific example that happens to be the industry in question, chip producers, but their are many more. And I'm not saying this is the best and only other solution, just one that's better for America and Americans than what's happening. \n\nWhen the US economy was 2/3s of the world economy, what was good for GM (large corporations) was good for America, but a lot has changed since then. And this is no longer true. America, particularly politicians and Americans have to recognize that almost all large corporations are now global, with little allegiance to any country. Kowtowing to these global corporations does little to help the US, but a lot to help those global corporations. \n\nThe US must be very pro capitalism and free market competition, and much less pro business. Remember, business hate nothing more than stiff competition. But America and Americans have and will again if allowed to, thrive with very competitive free markets.",
                      "permalink": "/r/wallstreetbets/comments/1c77j30/deleted_by_user/l0946ks/",
                      "created": 1713501077,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l095alb",
                          "score": 1,
                          "body": "[deleted]",
                          "permalink": "/r/wallstreetbets/comments/1c77j30/deleted_by_user/l095alb/",
                          "created": 1713501667,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l0976bl",
                              "score": 1,
                              "body": "Bear in mind that if the rule requiring two domestic sources for chips used by the military had remained, the US wouldn't be in the pickle they're in today. \n\nSure, some might have been outsourced, but some would have stayed. \n\nAlso remember, China as a threat is a relatively new phenomena. Japan was the threat, and China was Japan's great enemy. Western history books are light in the topic, - the Third Reich attempted genocide of the Jews, but the Japanese killed many many more civilian Chinese than Germany did Jews. \n\nChina is a 'new', amazing, economic success.",
                              "permalink": "/r/wallstreetbets/comments/1c77j30/deleted_by_user/l0976bl/",
                              "created": 1713502677,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l09atc9",
                                  "score": 1,
                                  "body": "[deleted]",
                                  "permalink": "/r/wallstreetbets/comments/1c77j30/deleted_by_user/l09atc9/",
                                  "created": 1713504750,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l09atdb",
                                      "score": 1,
                                      "body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                                      "permalink": "/r/wallstreetbets/comments/1c77j30/deleted_by_user/l09atdb/",
                                      "created": 1713504751,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l05wtpm",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 2 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1c77j30/deleted_by_user/l05wtpm/",
      "created": 1713457390,
      "depth": 0,
      "replies": []
    }
  ]
}