{
  "title": "Severance Pay Yolo",
  "score": 25,
  "selftext": "Time to get roasted by WSB, woo!\n\nNot looking to go full regard, but I put my severance payment into SOFI ahead of earnings. And hey, I’m not going to use ChatGPT to convince you to join the 🚀🚀🚀🧨\n\nOops, how did that dynamite get in there…? Well, for every potential rocket, there’s the chance it explodes in your face.\n\nI’ve worked in Big Tech and FinTech, and think SoFi has a good shot at differentiating their offerings in the FinTech sector and recognizing a higher valuation, as they grow their technology offerings. \n\nSpecifically watching Galileo and Technisys. When you talk platforms and banking cores, it’s easy to lose people, but this is where the wonder of finance happens. This is how banks and firms offering financial products can better compete. Think upgrading your Windows 95 desktop to a new computer. Maybe that old thing can still run, and you don’t know how to get your old programs to run on the new one… but you’re going to have to switch.\n\nOutside of that, the continued cross selling of services will be important and lowered customer acquisition costs, which I think is doable.\n\nWhether the street is ready to recognize SoFi’s recent profitability and whether institutions continue to take significant share… that’s an argument to be had. I think we’re getting there and don’t buy the whole, well, the stock has been on a downtrend for years, why now? Well, because it’s profitable now, and differentiated from being purely a student loans company now.\n\nGot shares in my retirement account, calls in my day to day invest/trade account.",
  "link_flair_text": "YOLO",
  "id": "1c877ql",
  "num_comments": 25,
  "created_utc": 1713558991,
  "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/",
  "url_overridden_by_dest": "https://i.redd.it/3dre14gnyhvc1.jpeg",
  "comments": [
    {
      "id": "l0coikb",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 5 | **Previous Best DD** | \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0coikb/",
      "created": 1713558994,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l0couoe",
      "score": 11,
      "body": "The only issue is that there is no such thing as good news in a bear market",
      "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0couoe/",
      "created": 1713559120,
      "depth": 0,
      "replies": [
        {
          "id": "l0cq5pf",
          "score": 2,
          "body": "Valid concern. Hence my not going for April calls. But I’m also eyeing my May calls carefully. I think we get risk on again in the coming weeks, before the risk off trend continues. The street seems to want to shake off all the bad news, but I also don’t know how tenable a continued bull market is. I think a solid beat with a second quarter of profitability could see SoFi recognize a nice share price gain, enough to lift options, also considering it’s been bearish already for some time. Though whether it would sustain a gain or follow its trend is to be seen as well. So that’s my aim, either sell on solid earnings and a monetary move, or wait it out a bit for delayed reaction after potential price target increases and institutional ownership updates.\n\nTl;dr–maybe so, but it seems to often beat and move sharply up at least momentarily, or shortly after with PT increases. Lots of market chaos though, so I totally get the cautionary take.",
          "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0cq5pf/",
          "created": 1713559593,
          "depth": 1,
          "replies": [
            {
              "id": "l0cx30l",
              "score": 1,
              "body": "I see them moving in like 2030 bro",
              "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0cx30l/",
              "created": 1713562165,
              "depth": 2,
              "replies": [
                {
                  "id": "l0cya6g",
                  "score": 1,
                  "body": "If the market goes deep red till 2030? Maybe. I don’t see that happening though, and institutions have been steadily buying. It didn’t come in with institutional support. It had the plague of SPAC. It’s been steadily gaining mainstream awareness and that institutional support it has needed to stabilize and gain. And it’s finally profitable and diversified across the business. Unless they make some major missteps, I don’t see them trading sideways for longer than a year, imo.",
                  "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0cya6g/",
                  "created": 1713562617,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l0cxr6z",
      "score": 8,
      "body": "Lol people have been trying to pump $SOFI the past year thinkin' its some big underdog and has failed to perform even under the big bull market we've had.\n\n[https://new.reddit.com/r/wallstreetbets/comments/1c1mp2m/sofi\\_the\\_sleeper\\_about\\_to\\_blast\\_off/](https://new.reddit.com/r/wallstreetbets/comments/1c1mp2m/sofi_the_sleeper_about_to_blast_off/)\n\n[https://new.reddit.com/r/wallstreetbets/comments/1ba6364/im\\_buying\\_more\\_sofi\\_because\\_of\\_steve\\_mnuchin/](https://new.reddit.com/r/wallstreetbets/comments/1ba6364/im_buying_more_sofi_because_of_steve_mnuchin/)\n\n[https://new.reddit.com/r/wallstreetbets/comments/1acs8r6/sofi\\_earnings\\_play/](https://new.reddit.com/r/wallstreetbets/comments/1acs8r6/sofi_earnings_play/)\n\n[https://new.reddit.com/r/wallstreetbets/comments/1b8ncfe/its\\_the\\_middle\\_of\\_the\\_night\\_and\\_i\\_have\\_an/](https://new.reddit.com/r/wallstreetbets/comments/1b8ncfe/its_the_middle_of_the_night_and_i_have_an/)\n\nHow this time any different than those people?",
      "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0cxr6z/",
      "created": 1713562418,
      "depth": 0,
      "replies": [
        {
          "id": "l0czf9t",
          "score": 6,
          "body": "Oh I’ve seen those. It’s regular WSB fare. This isn’t some meme stock and you can’t just will it to rocket. It’s had to work against having limited institutional support and the plague of SPAC. It’s just had its first profitable quarter. See how PLTR took multiple profitable quarters to gain after a multi-year downtrend. SoFi has needed to prove itself and court institutional investors. The mainstream narrative is coming in and institutions have been buying. It’s the rinse and repeat of solid companies in the market that take time to bake. I’m not looking with rose colored glasses. I’m not expecting $25 EOY. People said NTDOY would go bankrupt because of Wii U. It traded bearishly and sideways until the market warmed up to them and the success of the Switch. It happens. SoFi isn’t exactly a run of the mill regional bank or just some wannabe FinTech. They have a good reputation and they’re making solid progress. If it justified such a high valuation during the SPAC roadshow, it certainly does now, imo. But it may take time to get there. Understandably.\n\nThe difference between me and previous posters is that I’ve worked Product in FinTech and Big Tech, and I’m decently realistic. Not telling people to load up on the rocket. I’m in the long game, but also following earnings and post-earnings moves.",
          "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0czf9t/",
          "created": 1713563047,
          "depth": 1,
          "replies": [
            {
              "id": "l0d07xt",
              "score": 2,
              "body": "Fair enough, appreciate the response. I'll see how the market does next week but otherwise fuck it, I might as well grab some shares to hold for a year and see how it plays out with lt cap gains.",
              "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0d07xt/",
              "created": 1713563348,
              "depth": 2,
              "replies": [
                {
                  "id": "l0d9qtv",
                  "score": 1,
                  "body": "A year sounds pretty good for this one, imo.\nI’m looking 5-10 years, but that’s because I think it’ll continue to grow, not that it’ll take that long to break out of this bearish pattern. Clearly I’m also trading shorter term as well. Will definitely be watching next week carefully as well.",
                  "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0d9qtv/",
                  "created": 1713567078,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l0csmcx",
      "score": 5,
      "body": "SOFI is not going to move this year",
      "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0csmcx/",
      "created": 1713560499,
      "depth": 0,
      "replies": [
        {
          "id": "l0ctdib",
          "score": 3,
          "body": "It already has, but given up gains each time. Traders have been making money. I’ve been doing both calls and puts, even though I’m long term bullish. If you mean no sustained move, I could see that. But I’m anticipating a breakout either this year or next, with continued profitability and Noto addressing concerns about the equity raise. Depends quite a bit, imo, on market sentiment, which is fickle right now. So I get it.",
          "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0ctdib/",
          "created": 1713560782,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l0e6u3b",
          "score": 2,
          "body": "This dude is trying to save you some money",
          "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0e6u3b/",
          "created": 1713581404,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l0ctynk",
      "score": 3,
      "body": "Yeah I blew half of my Tesla severance on a YOLO,  I could see this going to $12 if they have a good earnings in may, might grab a few cheap ones also",
      "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0ctynk/",
      "created": 1713561002,
      "depth": 0,
      "replies": [
        {
          "id": "l0cvsit",
          "score": 3,
          "body": "Yeah, I’d love to see $12. I can see it. Not banking on it, hence my mostly $9 strike, but would certainly welcome it and imo it merits $12, even though some argue it’s too rich a valuation. But then look at other FinTechs.",
          "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0cvsit/",
          "created": 1713561684,
          "depth": 1,
          "replies": [
            {
              "id": "l0tvdi3",
              "score": 2,
              "body": "Been holding SoFi shares since last November and just now entering calls! I’m feeling good that their earnings will be good with fair guidance. I think I’ll be grabbing calls for early May.",
              "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0tvdi3/",
              "created": 1713837621,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l0cy7d1",
      "score": 3,
      "body": "Good luck OP! Im tempted to hop in but I’ve been burned all 4 times I played sofi options. I better stick to something safe like NVDA or SMCI",
      "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0cy7d1/",
      "created": 1713562587,
      "depth": 0,
      "replies": [
        {
          "id": "l0d05e0",
          "score": 3,
          "body": "I appreciate it, thanks! Totally understandable, and I’d be lying if I said I totally trust SOFI not to burn a short term bullish trade. No delusional rockets here, but I’m seeing light at the end of the tunnel.",
          "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0d05e0/",
          "created": 1713563322,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l0rkj9o",
      "score": 3,
      "body": "My full port is on SOFI $10 calls for September.  Hopefully we hit.",
      "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0rkj9o/",
      "created": 1713804851,
      "depth": 0,
      "replies": [
        {
          "id": "l0wkpm5",
          "score": 2,
          "body": "By September I would hope rate cuts are in effect by then with more profitability",
          "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0wkpm5/",
          "created": 1713887332,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l0d132j",
      "score": 2,
      "body": "Should have played SPY",
      "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0d132j/",
      "created": 1713563677,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l0e6skl",
      "score": 2,
      "body": "Small cap growth is risky af right now... Honestly, I might play the other side — selling the calls. \n\nBuying Long ITM calls, and selling short OTM calls.\n\n$9 by May seems insane. The delta on that option is like 15.",
      "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0e6skl/",
      "created": 1713581384,
      "depth": 0,
      "replies": [
        {
          "id": "l0e7esj",
          "score": 1,
          "body": "Also, I don't think Sofi is that great\n\nI used it for a month after refinancing my student loans, and then paid them off. Not impressed with the UI/UX. Not convinced they're offering a differentiating banking/investment/loan experience.\n\nI like Wealthfront for banking and virgin fund investing. Margin rates are shit tho.",
          "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0e7esj/",
          "created": 1713581676,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l0dsh6k",
      "score": 1,
      "body": "Puts it is.",
      "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0dsh6k/",
      "created": 1713575045,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l0evuo1",
      "score": 1,
      "body": "☠️",
      "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0evuo1/",
      "created": 1713595077,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l0ew4c8",
      "score": 1,
      "body": "so what is galileo and techisys",
      "permalink": "/r/wallstreetbets/comments/1c877ql/severance_pay_yolo/l0ew4c8/",
      "created": 1713595234,
      "depth": 0,
      "replies": []
    }
  ]
}