{
  "title": "UL Solutions",
  "score": 23,
  "selftext": "Recently, a 130 year old company made an IPO and I wanna hear the regards' opinions about them.\n\nTo put it simply, UL Solutions (ULS) is doing testing for products safety and their performances and gives out certificates for safety regulatory compliances. This isn't a very competitive market and the relatively small number of companies and their age shows it. If I understand this company correctly, it is essentially a bottleneck business whose services are a must for everyone who doesn't wanna f\\*\\*k around with OSHA.\n\nIn terms of revenue, its not that interesting to say the least. No remarkable revenue increases, no spectacular margins to speak of. They have increased their debt significantly from 0.63 debt to equity to 1.63( a standard procedure of any recent IPO I suppose, but still worth mentioning)\n\nThe reason why this company caught my eye is that out of the 200m shares outstanding, only 38m (less than fifth) is free float. It's probably a normal deal with new IPO's and regulations regarding insider ownership and what not. but with current 6.7B market cap and current float of just 38m, the stock should be worth 175 dollars. It's worth 33 dollars at the moment.\n\nSecondly, and the more important detail, 20 insiders bought 16m dollars worth of stock, 13 of them bought more than 200k. It's been a while since I've seen such a huge insider purchase, combined with a large number of insiders, in a very short period of time.\n\nSo we have here an old, established business with market dominance, with a temporary discrepancy with the shares outstanding and free float and a massive insider buying.\n\nIf someone has a more interesting, deep take on this company and its business/legacy/whatever I'll be glad to hear.",
  "link_flair_text": "Discussion",
  "id": "1c8smt6",
  "num_comments": 14,
  "created_utc": 1713626787,
  "permalink": "/r/wallstreetbets/comments/1c8smt6/ul_solutions/",
  "comments": [
    {
      "id": "l0gmf15",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 2 weeks ago\n**Total Comments** | 21 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1bwvwkv/abercrombie_fitch_is_still_cheap_even_after_300/) \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1c8smt6/ul_solutions/l0gmf15/",
      "created": 1713626793,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l0h9au7",
      "score": 7,
      "body": "Why would the shares be worth 175$.\n6.7B/200m = 33.5.\nSo the shares should be valued at 33.5.",
      "permalink": "/r/wallstreetbets/comments/1c8smt6/ul_solutions/l0h9au7/",
      "created": 1713634882,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l0grvrt",
      "score": 8,
      "body": "I do a lot of work with UL. A lot of companies are required to have UL certification on their products or in my case our panels that we build. You can’t go wrong with it.",
      "permalink": "/r/wallstreetbets/comments/1c8smt6/ul_solutions/l0grvrt/",
      "created": 1713628753,
      "depth": 0,
      "replies": [
        {
          "id": "l0gvwgs",
          "score": 5,
          "body": "Yes. Came here to say this. You can’t really work around them.",
          "permalink": "/r/wallstreetbets/comments/1c8smt6/ul_solutions/l0gvwgs/",
          "created": 1713630193,
          "depth": 1,
          "replies": [
            {
              "id": "l0ldlk0",
              "score": 2,
              "body": "Well you can, makes panel  cheaper to sell.",
              "permalink": "/r/wallstreetbets/comments/1c8smt6/ul_solutions/l0ldlk0/",
              "created": 1713706641,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l0gti81",
          "score": 3,
          "body": "What is their path to growth?  Is it becoming \\*more\\* necessary?  Are they certifying significantly more items?  Are they providing additional certifications?  I get that they're necessary, but I don't know how they're going to grow in value...  I suppose if we predict many, many more products being made, therefore assume the proportion requiring UL certs will grow, therefore providing a pathway for ULS to grow, then maybe it's there.  But how does investing in ULS make more money than investing in the companies that are making the products that require certification?",
          "permalink": "/r/wallstreetbets/comments/1c8smt6/ul_solutions/l0gti81/",
          "created": 1713629334,
          "depth": 1,
          "replies": [
            {
              "id": "l0gvkn4",
              "score": 2,
              "body": "The bullish case would be: insiders know better about the company and its future direction and they are buying stock en masse. More science and technological innovation in the future will require safety regulations. If I'm correct and they are indeed a bottleneck business, they essentially have a huge moat which will guarantee cash flow",
              "permalink": "/r/wallstreetbets/comments/1c8smt6/ul_solutions/l0gvkn4/",
              "created": 1713630074,
              "depth": 2,
              "replies": [
                {
                  "id": "l0h3msb",
                  "score": 3,
                  "body": "100% for example, go to a target or wherever you go to buy miscellaneous household needs. Anything that is battery powered or requires the use of electricity HAS to be UL listed. I’m bullish on this as well. The whole point of UL is to ensure the safety of the product when used by the customer so they don’t electrocute themselves or it randomly catches on fire.",
                  "permalink": "/r/wallstreetbets/comments/1c8smt6/ul_solutions/l0h3msb/",
                  "created": 1713632945,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l0h76bs",
      "score": 3,
      "body": "UL is the global gold standard. ETL has been trying for decades and they're still not as prestigious. This reminds me that I should pickup some shares. Thanks.",
      "permalink": "/r/wallstreetbets/comments/1c8smt6/ul_solutions/l0h76bs/",
      "created": 1713634156,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le01taj",
      "score": 2,
      "body": "There is a lockup period for insiders, and they can only sell so much. Less than 20% of possible shares are out there. Why would you think the low flow of shares that has boosted the price be improved when more shares can be made available? There's no path to real growth, so I can't be hoping for some sudden moat to be made once the lockup period is done.",
      "permalink": "/r/wallstreetbets/comments/1c8smt6/ul_solutions/le01taj/",
      "created": 1721428615,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lt8idhv",
      "score": 1,
      "body": "Did you buy uls?  Seems upward trend",
      "permalink": "/r/wallstreetbets/comments/1c8smt6/ul_solutions/lt8idhv/",
      "created": 1729630875,
      "depth": 0,
      "replies": [
        {
          "id": "lt93asl",
          "score": 1,
          "body": "fuck yeah i did\n\nup 50%",
          "permalink": "/r/wallstreetbets/comments/1c8smt6/ul_solutions/lt93asl/",
          "created": 1729637821,
          "depth": 1,
          "replies": [
            {
              "id": "lt9y5hw",
              "score": 1,
              "body": "I think uls maybe lifetime hold, can’t fail?",
              "permalink": "/r/wallstreetbets/comments/1c8smt6/ul_solutions/lt9y5hw/",
              "created": 1729648655,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}