{
  "title": "ALCC and Oklo",
  "score": 42,
  "selftext": "With Sam Altman being the CEO of AltC and the Chairman of Oklo, I can’t really see the merger not going through. He has also stated already that he is excited for the opportunity. With that being said, is it (like most things) priced in or is there still the high likelihood that it jumps on the announcement (like most mergers)? \n\nTl/dr: Is Oklo an enticing enough company to cause ALCC to go up after merger news?",
  "link_flair_text": "Discussion",
  "id": "1cdytco",
  "num_comments": 55,
  "created_utc": 1714171174,
  "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/",
  "url_overridden_by_dest": "https://oklo.com/newsroom/news-details/2023/Oklo-an-Advanced-Fission-Technology-Company-to-Go-Public-via-Merger-with-AltC-Acquisition-Corp/default.aspx",
  "comments": [
    {
      "id": "l1f6mnh",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 12 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1f6mnh/",
      "created": 1714171179,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1f7wjt",
      "score": 21,
      "body": "There’s a shareholders vote on may 7th for approval of a merger (Shareholders before 4/5 can contribute in the vote). I believe it will go through because it will most likely send the stock flying. Altman with a clean energy companie seems like a great combination and if it goes through I’m very bullish on the company. Currently own some 5/17 17.5$ calls and some shares.",
      "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1f7wjt/",
      "created": 1714171694,
      "depth": 0,
      "replies": [
        {
          "id": "l1f8206",
          "score": 5,
          "body": "Do you think pump and dump or actual long term value?",
          "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1f8206/",
          "created": 1714171755,
          "depth": 1,
          "replies": [
            {
              "id": "l1fexoe",
              "score": 14,
              "body": "If you look at the trend of mergers, in both 2021 and now, you’ll notice there is always a surge up to the vote, and then after a decline.\n\nI personally in it for short term.  Then invest back in, in about 6 years when they actually have something to show ",
              "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1fexoe/",
              "created": 1714174550,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l1f8f31",
              "score": 8,
              "body": "I’m going to and have made 3 options plays. First was the announcement of a potential merger which was when the stock popped to 18$. Second is the one for the shareholders meeting. And third is if the company gets acquired. Those are my only options plays otherwise I’m in on shares for a while. I think it could be a longterm investment but only for shares. That’s atleast what I think",
              "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1f8f31/",
              "created": 1714171902,
              "depth": 2,
              "replies": [
                {
                  "id": "l1f8rks",
                  "score": 9,
                  "body": "I currently have strikes between 12.5 and 17.5 May 17-June 21, so here’s to hoping",
                  "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1f8rks/",
                  "created": 1714172044,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l1f8vhz",
                      "score": 3,
                      "body": "🥂",
                      "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1f8vhz/",
                      "created": 1714172089,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l1fdevz",
                  "score": 8,
                  "body": "The spike to $17.5 was NOT due to the merger news but some relatively insignificant deal. It's been known since last July that a deal must happen by July 12th, 2024. The voting date was only released  yesterday.",
                  "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1fdevz/",
                  "created": 1714173940,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l1fg36d",
                      "score": 4,
                      "body": "Correct",
                      "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1fg36d/",
                      "created": 1714175007,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l1i41tq",
              "score": 2,
              "body": "It’s fucking vapor.  If he could’ve brought it to the public market via IPO and made more money that way, he would’ve done it. It’s not worth what they are selling for so they sell to the plebs.  ",
              "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1i41tq/",
              "created": 1714227134,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l1ymiyu",
              "score": 1,
              "body": "Dump and dump for a while at least.",
              "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1ymiyu/",
              "created": 1714494899,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l1f88tc",
      "score": 20,
      "body": "It's definitely priced in as with all stocks, but majority of people just don't know about Oklo or ALCC and Sam Altman's involvement aside from this subreddit and r/spac. \n\nUsually seeing WSB degends buy stocks make me inverse, but buying shares at these levels are really safe given the $10.5 limit.\n\nEveryone knew about DJT since it's on WSJ and Reuters every day, and the SPAC spiked to $95 before going back to $17 levels before the merger (and obviously $60+)\n\nALCC is $13.00 right now with a 554m market cap, it's probably a good time before you start seeing OpenAI/Oklo news on mainstream media. Even a 1.6B market cap is over 3X ROI. Playing DJT made people over 600%\n\nAnything Sam touches whether it's Worldcoin, openAi, DXYZ, gets a huge huge pump (even if it dumps afterwards). We still haven't really seen a giant pump yet",
      "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1f88tc/",
      "created": 1714171832,
      "depth": 0,
      "replies": [
        {
          "id": "l1fay53",
          "score": 7,
          "body": "That’s a good point. Although it doesn’t mean much, when you compare DJT to ALCC, it looks like we’re in the same spot as DWAC was when the idea of a merger happened.\n\nhttps://preview.redd.it/nc3wssz6owwc1.jpeg?width=1039&format=pjpg&auto=webp&s=8c798f2ff3bf2c86a5aff0b64f3fcead6e7af3d5\n\nDJT top, ALCC bottom",
          "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1fay53/",
          "created": 1714172937,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l1if70x",
          "score": 2,
          "body": "Could u explain more about the $10.5 limit u said? From a rookie of SPAC followed this fission topic for a while",
          "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1if70x/",
          "created": 1714231500,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l1g26wp",
      "score": 17,
      "body": "Nuclear faces regulatory hurdles typically, but something Sam discusses is the impressive pipeline of deals and contracts that Oklo has lined up, that is hopeful. One thing that will be crucial to follow is the success of nuclear material acquisition by Oklo from INL (Idaho National Lab). [here is an article speaking a little bit about it](https://www.world-nuclear-news.org/Articles/Oklo-reports-progress-in-Idaho,-Ohio).\n\nWith that said, recycling spent Uranium is an actual brilliant idea. Many complaints surrounding nuclear involve waste, cost, and proliferation. Using recycled fuel waste addresses ALL of those concerns.\n\n1. By being able to recycle fuel rods we can effectively extend the life of manufactured Uranium fuel many times over. This will reduce fuel waste over time as we eventually transition to renewables or fusion gets off the ground.\n2. Again, by extending the life of the fuel, and doing it in house, Oklo won't need to continually acquire fuel for it's small moduclar reactors, or at least not as much. This reduces cost. It also means that they can acquire their fuel at a discount from companies, who would otherwise have to pay for their waste to be removed. Now those companies can sell it to Oklo, at a discount of course, and recoupe some of that loss. Oklo can also tap into the massive stockpile of already spent fuel waste that the government has buried away. Which according to the CEO, [would be able to meet all energy demands in the US for 100 years. I believe it. Nuclear material is extremely dense with energy.](https://www.youtube.com/watch?v=tXbWC1mDrl4) E=mc\\^2 or some shit.\n3. Proliferation. This is the big one honestly. When we dig up Uranium, it consists of several different isotopes. The most abundant of which is U-238. That is not really a good nuclear fuel, for most reactors, since it is relatively stable and hard to fission. What most reactors want is U-235. What we end up doing, in very simple terms, is we turn the raw material into a gaseous form and use centrifuges to increase the concentration of U-235, taking advantage of the difference in mass between isotopes. This process can produce fuel grade Uranium with enough U-235 to power a reactor. However, this whole process is the same process used to make weapons grade uranium. With Oklo though, and the advent of using recycled fuel waste to power reactors, you could actually de-proliferate, that is shut down the centrifuges used to spin up Uranium to high concentrations of U-235, and just rely on nuclear fuel waste to power your reactors. This could be revolutionary, not only from an energy standpoint, but from a foreign policy standpoint. How does Oklo do this? Basically, their reactor designs rely on fast neutrons as opposed to thermal neutrons to induce fission. These neutrons carry more energy, and are able to break apart transuranic atoms or even the heavy, and hugely abundant, U-238. Essentially, their nuclear reactors are more efficient. This is also not a novel idea. Other countries have been using recycled fuel, but I don't know of other reactors relying on fast neutrons.\n\nI think catching this wave early could be huge. The real question is what kind of future do you want to invest in? I believe in nuclear power. I believe in clean energy. And I believe in Sam Altman. I am long shares. If this idea gets off the ground it would be very groundbreaking. If it fails, then that's a future that is a little less bright anyways.",
      "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1g26wp/",
      "created": 1714184044,
      "depth": 0,
      "replies": [
        {
          "id": "l1g6smu",
          "score": 3,
          "body": "How exactly do you use nuclear waste without re-enriching it.  You can't just shove all the waste from a few reactors into one and make it work.  Nuclear waste is not fissile, so how does that plan work.  I'm not trying to be a dick, but am genuinely not understanding how what you said is physically possible.  Unless you are considering what is known as a breeder reactor, in which case the waste is Pu-239.  Pu-239 is very fissile, but this kind of reactor kind of negates the nonproliferation argument, as breeder reactors are exactly how weapons grade plutonium is made.",
          "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1g6smu/",
          "created": 1714186070,
          "depth": 1,
          "replies": [
            {
              "id": "l1gacpk",
              "score": 9,
              "body": "No I don't think you sound like a dick, I appreciate your participation. Several things to discuss here. [Here is the CEO of Oklo discussing more about it](https://www.youtube.com/watch?v=tXbWC1mDrl4) (Begins 21:10). [Also, here is Oklo talking about their process, I think a little more in depth, at the Nuclear Regulatory Commission meeting one year ago](https://www.youtube.com/watch?v=UZWU7AI9Ywc). Their reactor design does not require as high of a concertation of U-235 because they rely on fast neutrons to generate their fission reactions, transuranic or heavier isotopes of Uranium, such as U-238, now become usable. So basically, all existing uranium fuel waste right now in the US, that is thought of as useless by typical standards because of its \\~1% (don't quote me on that) concentration of U-235 at this point, becomes an invaluable fuel source for the Aurora power plant that Oklo is proposing. Essentially, nuclear reactors are getting more efficient. And the fuel waste of the past, is the fuel of the future. They wouldn't need to spin it back up. Most nuclear fuel waste consists of transuranic isotopes, or U-238. So I guess that the whole additional revenue stream is my bad there. They wouldn't be able to turn other company's fuel waste around for them. They would however be able to use it, and acquire it at a discount because other company's would be happy to sell it to them.",
              "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1gacpk/",
              "created": 1714187730,
              "depth": 2,
              "replies": [
                {
                  "id": "l1gdfph",
                  "score": 7,
                  "body": "Unfortunately, even though U-238 is just as good at fissioning fast neutrons as U-235, it is still not capable of sustaining a chain reaction. Uranium is typically broken up into three categories, Low enriched, high enriched, and weapons grade. Low enriched, which is the one that this company would use, is still around 5-10% U-235. This is because U-235 can fission thermal neutrons, whereas U-238 only begins to fission around 5-10 MeV. The problem with this is that both isotopes of uranium only emit neutrons at around 4.6 MeV. Essentially, Uranium cannot fission U-238, and this is why U-235 is always used in some quantity. If you look into France’s waste recycling program, they create plutonium from the waste, but the process still takes years. I am not saying this is a bad thing for the company, but math pretty much says that a 1% U-235 reactor can’t sustain energy production. I still love SNRs though, and do see a large industry for them in the future.",
                  "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1gdfph/",
                  "created": 1714189247,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l1gk5ik",
                      "score": 11,
                      "body": "Wow, level-headed and informed discussions on nuclear fission in a SPAC thread on WSB of all places. Thanks for these posts guys.",
                      "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1gk5ik/",
                      "created": 1714192814,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l1gmjjx",
                          "score": 10,
                          "body": "Haha I could go on about this stuff all day, I am studying it undergrad and am beginning my applications for a nuclear engineering masters soon",
                          "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1gmjjx/",
                          "created": 1714194150,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "l1gjz7o",
                      "score": 3,
                      "body": ">Uranium cannot fission U-238, and this is why U-235 is always used in some quantity.\n\nI am sorry, but this is not true. There is a spectrum of energies that the neutrons released from fission exist on. A percentage of them carry enough energy to split U-238. In the neutron life-cycle, this boosts the amount of existing fast neutrons initially present, before they slow down. It is denoted with the symbol ε. [Fast neutron reactors have already been designed and operating since the 50s according to the world nuclear association.](https://world-nuclear.org/information-library/current-and-future-generation/fast-neutron-reactors.aspx)\n\nI agree with you though, that under a strictly Uranium reactor design, you would need some elevated concentration of U-235. However, we are not only talking about Uranium, but other transuranic elements that can be used with fast neutrons more effectively. In the fuel waste for example that is spent and stored now in the ground, there is a significant concentration of transuranic elements that would work well in a fast neutron environment.\n\nI don't claim to fully understand all of Oklo's design, much of which might be proprietary, but fast neutron reactors are a real thing.",
                      "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1gjz7o/",
                      "created": 1714192718,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l1glarp",
                          "score": 4,
                          "body": "That source outlines how FNRs use plutonium and uranium which completely makes sense as it is fissile. Plutonium is not naturally occurring however, and requires breeder reactors to produce it.\n\nHere are the JEFF-3.2 fission cross sections of U-238\n\nhttps://preview.redd.it/rehv2yqdcywc1.jpeg?width=850&format=pjpg&auto=webp&s=3498d7957809801c43eeeeb022d85eae9b71577e\n\nAnd the ENDF/B cross sections (most widely used)\n\n[https://nuclear-power.com/wp-content/uploads/2015/05/Uranium\\_238.png](https://nuclear-power.com/wp-content/uploads/2015/05/Uranium_238.png)\n\nAnd finally, the energy probability distribution of fission from U-238\n\n[https://www.researchgate.net/profile/Hesti-Wulandari/publication/222569665/figure/fig1/AS:733465469276161@1551883203418/Energy-spectrum-of-neutrons-from-spontaneous-fission-of-238-U.png](https://www.researchgate.net/profile/Hesti-Wulandari/publication/222569665/figure/fig1/AS:733465469276161@1551883203418/Energy-spectrum-of-neutrons-from-spontaneous-fission-of-238-U.png)\n\nI can assure you, unless another fissile (high likelihood of fission) material is used which also produces greater than 1 neutron on average, a chain reaction cannot be sustained.\n\nEdit: I completely agree that FNRs exist and are useful, but they require more than just waste material to build. Unless a breeder reactor is used, which the US has largely outlawed internationally due to their ability to produce weapons grade material, Okla won’t be able to just buy the material they need\n\nAlso, take a look at the difference between the cross sections for U-238 and the other nuclear elements. It outlines the difference between fissile and fissionable\n\n[https://qph.cf2.quoracdn.net/main-qimg-ea37e5ab4e02f659a119fb1f3bf02ad6](https://qph.cf2.quoracdn.net/main-qimg-ea37e5ab4e02f659a119fb1f3bf02ad6)",
                          "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1glarp/",
                          "created": 1714193446,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l1gnzlq",
                              "score": 3,
                              "body": "I did not disagree with you that unless there is another fissile material present the chain reactor can be sustained. Only that Uranium cannot cause fission in Uranium-238. It does, to a smaller degree, and that is taken into account in all reactor designs, but I agree not in a substantial enough way to achieve criticality, under traditional PWR designs.\n\n  \nHowever, existing fuel waste stocks do contain a small percentage of Plutonium and other possible elements that can be used in a fast reactor design if enough processing occurs. [There is currently \\~85000 metric tons of spent nuclear fuel waste in the US alone, not accounting for allies that we would be open to exchanging fuel waste with.](https://www.gao.gov/nuclear-waste-disposal) If even a small percentage of that consists of plutonium \\~1%, it represents a huge store of potential energy for fast reactors. Keeping in mind, that it is not only plutonium that will be used, but also U-238.\n\nI have to start studying for an exam. I appreciate this discussion. I might return to it.",
                              "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1gnzlq/",
                              "created": 1714195001,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l1goki3",
                                  "score": 5,
                                  "body": "I totally agree that with plutonium present, it could be used as a fuel. But I think the physics of starting with uranium and switching to plutonium for the same reactor is a little tough. It does show an opportunity in expanding into different types of reactors though. For shits and gigs, I might run a sim on a reactor with 97% natural uranium and 3% Pu-239 to see what kind of criticality it achieves.",
                                  "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1goki3/",
                                  "created": 1714195348,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l1goqzn",
                                      "score": 4,
                                      "body": "Lol. You are clearly no regard. Cheers.",
                                      "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1goqzn/",
                                      "created": 1714195455,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l1goys3",
                                          "score": 4,
                                          "body": "Same to you, have a great one",
                                          "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1goys3/",
                                          "created": 1714195584,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l1g26xl",
          "score": -1,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1g26xl/",
          "created": 1714184045,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l1fti46",
      "score": 14,
      "body": "Long stocks and will join the shareholder vote. Had some calls and picked up more today, as well buying back short calls I had written. Pumped af for this. \n\nIf DJT can moon the way it did with a sheister at the helm, there’s no way this won’t generate buzz after the merger. Altman isn’t Elon he’s the real deal in the Silicon Valley VC scene. He already has shitloads of money he doesn’t need to run a SPAC to make a quick buck. Writing is on the wall for me.",
      "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1fti46/",
      "created": 1714180375,
      "depth": 0,
      "replies": [
        {
          "id": "l1hnc8z",
          "score": 0,
          "body": "This attitude makes me think $2 is coming in hot ",
          "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1hnc8z/",
          "created": 1714219407,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l1fuatm",
      "score": 8,
      "body": "Btw OP why did you post this old article? I thought this post was in response to the news this morning.  May 7th vote with merger to happen immediately afterwards. \n\nhttps://www.morningstar.com/news/pr-newswire/20240425ny98324/special-meeting-of-altc-acquisition-corp-stockholders-to-approve-business-combination-with-oklo-scheduled-for-may-7-2024\n\nIt feels kind of crazy that there’s so little buzz about this. But then again someone posted about DWAC and most people (myself included) didn’t listen. Not saying this is a guaranteed long term play, but make the profit on the way up and maybe also on the way down. This is the kind of company I really hope can succeed. They are literally recycling spent nuclear material from old plants to run their new ones. Dream scenario and exactly what AI will need.",
      "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1fuatm/",
      "created": 1714180704,
      "depth": 0,
      "replies": [
        {
          "id": "l1g84ya",
          "score": 3,
          "body": "Honestly I didn’t even realize the post was so old. I only thought the two companies entered the contract recently, so the mention of it made me think this was from the last couple weeks at most",
          "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1g84ya/",
          "created": 1714186687,
          "depth": 1,
          "replies": [
            {
              "id": "l1g8bl6",
              "score": 2,
              "body": "Hey no worries man. At least we're talking about. There should be way more buzz around this.",
              "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1g8bl6/",
              "created": 1714186772,
              "depth": 2,
              "replies": [
                {
                  "id": "l1g8g0a",
                  "score": 4,
                  "body": "Agreed, surprised clean energy backed by a major player isn’t getting much hype",
                  "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1g8g0a/",
                  "created": 1714186828,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l1gbid8",
                      "score": 1,
                      "body": "Meanwhile DJT at 5B market cap lmao",
                      "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1gbid8/",
                      "created": 1714188290,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l1gluoj",
                          "score": 2,
                          "body": "Honestly it’s ridiculous, tried to short it when it got back to 35 again and somehow it just kept pushing",
                          "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1gluoj/",
                          "created": 1714193752,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l1if1mi",
              "score": 1,
              "body": "Agreed. Iv will go through the roof too",
              "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1if1mi/",
              "created": 1714231443,
              "depth": 2,
              "replies": [
                {
                  "id": "l1jr4l3",
                  "score": 0,
                  "body": "I hope so but it’s already at about 200% and idk if it has much more room to go up",
                  "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1jr4l3/",
                  "created": 1714249553,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l1k6g0j",
                      "score": 1,
                      "body": "Oh it definitely will",
                      "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1k6g0j/",
                      "created": 1714255584,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l1tsl4w",
                          "score": 1,
                          "body": "Ha look at that, it’s up to like 250% now",
                          "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1tsl4w/",
                          "created": 1714417159,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l1tswtx",
                              "score": 1,
                              "body": "Yes sir",
                              "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1tswtx/",
                              "created": 1714417268,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l1fdk6s",
      "score": 5,
      "body": "Been in for a month. It will pump when vote goes through. Probably run up to the merger and then collapse day or today after like djt",
      "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1fdk6s/",
      "created": 1714174000,
      "depth": 0,
      "replies": [
        {
          "id": "l1fp11i",
          "score": 1,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1fp11i/",
          "created": 1714178545,
          "depth": 1,
          "replies": [
            {
              "id": "l1g8cee",
              "score": 6,
              "body": "The deal is reportedly for a market cap of 850MM, so there’s that",
              "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1g8cee/",
              "created": 1714186782,
              "depth": 2,
              "replies": [
                {
                  "id": "l1geg9n",
                  "score": 1,
                  "body": "Source?",
                  "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1geg9n/",
                  "created": 1714189769,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l1gek0q",
                      "score": 8,
                      "body": "https://preview.redd.it/o6s0ri1f2ywc1.jpeg?width=1290&format=pjpg&auto=webp&s=04a9c86c4ba81f0f672a86c166fabc4cdec3c1a4\n\nIt’s in the article I posted",
                      "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1gek0q/",
                      "created": 1714189823,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l1iekwe",
                  "score": 1,
                  "body": "Yeah I saw that too",
                  "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1iekwe/",
                  "created": 1714231269,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l1u92th",
          "score": 1,
          "body": "When vote goes through May 7th? Are you expecting a pump before, after, or both?",
          "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1u92th/",
          "created": 1714422839,
          "depth": 1,
          "replies": [
            {
              "id": "l1u96yr",
              "score": 1,
              "body": " Both. I’ll dump day of ticker change",
              "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1u96yr/",
              "created": 1714422880,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l1fazwg",
      "score": 2,
      "body": "Anyone know when NAV is removed? I heard May 2nd but don't see in filings.",
      "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1fazwg/",
      "created": 1714172957,
      "depth": 0,
      "replies": [
        {
          "id": "l1v5bd1",
          "score": 1,
          "body": "After ticker change",
          "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1v5bd1/",
          "created": 1714434980,
          "depth": 1,
          "replies": [
            {
              "id": "l1ymzg4",
              "score": 1,
              "body": "No it gets removed once vote passes",
              "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1ymzg4/",
              "created": 1714495053,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l1kcoqq",
      "score": 2,
      "body": "Saw a number of old interviews with Sam  consistently arguing that abundant \"intelligence\" and \"energy\" will revolutionize the world, etc. He says it is both hand-in-hand.  There's also a podcast where he says that during his sabbatical year he studied nuclear power, etc.  Anyways, Oklo is very consistent with his investment thesis.  Now, I don't know if Oklo will be successful, but Sam's credibility is on the line on this one. \n\nI'm long shares.",
      "permalink": "/r/wallstreetbets/comments/1cdytco/alcc_and_oklo/l1kcoqq/",
      "created": 1714258178,
      "depth": 0,
      "replies": []
    }
  ]
}