{
  "title": "Investing Pivot",
  "score": 46,
  "selftext": "I've been an active investor in ETFs and individual stocks since graduating college in 2010. I've tried a little bit of everything and learned a lot (from good investments and some really bad ones) along the way. I've done broad market ETFs, sector ETFs, leveraged ETFs, commodity ETNs, penny stocks, risky biotech stocks that \\*might\\* go to the moon but will probably get pink slipped, solid large cap stocks, memestocks, option spreads, option calls and puts. etc... It's been a wild ride and I've learned a lot. While I made a lot of bad investments, I am grateful that I didn't do anything too reckless and only gambled a little bit of my money on insane ideas.\n\nOverall my portfolio has done well in the past 14 years so I feel like I made money while going to school. I made a few really good large investments in large cap ETFs and a few companies that have done extremely well (NVDA, ANET, META, CYBR, BRK/B) But now it's time to simplify.\n\nNow I am applying all those lessons learned to update my portfolio holdings to just the ETFs and companies I believe in for the long term. At the end of last year I had a lot of random little investments in all kinds of companies and ETFs and it was just ridiculous. Over 60 individual company stocks and dozens of different ETFs. I took diversification to an extreme that just wasn't making a difference and holding me back due to opportunity cost.\n\nWhat I'm looking to do now is to sell off all the random ETFs and stocks that aren't my top picks. The famous saying from Warren Buffet about diversification I believe holds true about ETFs as well as individual companies. \"*If you can identify six wonderful businesses, that is all the diversification you need. And you will make a lot of money. And I can guarantee that going into a seventh one instead of putting more money into your first one is gotta be terrible mistake. Very few people have gotten rich on their seventh best idea. But a lot of people have gotten rich with their best idea.\"*\n\nNow I'm not nearly as good at evaluating companies as Warren Buffett. So my approach will be to identify my shortlist of favorite ETFs for long term growth as well as a few high conviction companies. I will consolidate my holdings into just these etfs / stocks.\n\nI've done a lot of research this is where I've landed. I will rebalance as needed to make sure i don't get overly concentrated.\n\nLarge Cap US S&P 500: VOO / SPLG\n\nDividend Growth: VIG\n\nLarge Cap Growth: SCHG\n\nMid Cap Growth: IMCG\n\nMid Cap Value: COWZ\n\nSmall Cap Value: CALF\n\nSemiconductors: SMH\n\nI'm also experimenting a little with GPIQ and SPHY for yield, but I'm more focused on growth than yield at this point.\n\nAs for individual stocks, my key holdings are:\n\nNVDA\n\nMETA\n\nGOOG\n\nBRK.B\n\nTSLA\n\nCYBR\n\nANET\n\nAVGO\n\nMSFT\n\nAMZN\n\nPLTR\n\nI realize this is very large cap growth / tech stock heavy... especially with some of my stock holdings also representing a significant weighting in the ETFs. But I am ok with this.I'm done with ETFs for REITS, Emerging Markets, International. In both good and bad economic environments since 2010 they don't typically provide outperformance and I would have been way better off just putting the money into a US S&P500 fund. I don't see any compelling reason to keep any money in these kind of funds anymore.I was looking for potential exposure to more small caps (esp growth) but I haven't found an ETF that is all that compelling in this space.\n\nCurious what feedback people have. Is there something big I'm missing by avoiding International and REITs? Am I too concentrated in large cap tech? Am I leaning way too much on good past performance of large caps? Are there any fantastic ETFs I should considering adding to my short list?\n\nFor years I tried to buy beat up sectors and stocks hoping they would outperform, but I've seen just the opposite. So my strategy now is to stay relatively diversified into ETFs / companies that have a history of consistent strong performance and strong business models.",
  "link_flair_text": "DD",
  "id": "1ceo2kh",
  "num_comments": 33,
  "created_utc": 1714249573,
  "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/",
  "comments": [
    {
      "id": "l1jr7im",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 5 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1jr7im/",
      "created": 1714249585,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1jsv6w",
      "score": 115,
      "body": "This is WSB where people go to lose all the money or brag about making a lot of money right before they lose it all on 0dte. You’d be better suited somewhere like r/stocks\n\nYou seem way too intelligent for this place.",
      "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1jsv6w/",
      "created": 1714250218,
      "depth": 0,
      "replies": [
        {
          "id": "l1yhq9a",
          "score": 3,
          "body": "Rather have him here than y’all. I prefer making big money than losing it.",
          "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1yhq9a/",
          "created": 1714493283,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l1jzpv6",
      "score": 28,
      "body": "Thanks for your Ted talk",
      "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1jzpv6/",
      "created": 1714252881,
      "depth": 0,
      "replies": [
        {
          "id": "l1lo2i0",
          "score": 4,
          "body": "Clap Clap Clap",
          "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1lo2i0/",
          "created": 1714280351,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l1kiimj",
      "score": 24,
      "body": "Sir you are lost ![img](emote|t5_2th52|4275)![img](emote|t5_2th52|31226)",
      "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1kiimj/",
      "created": 1714260669,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1k43qr",
      "score": 31,
      "body": "If ETFs are your strategy then I would just long SPY for long term growth. So much overlapping, why worry? \n\nPersonally I would enter using CSP. When the market is choppy I would sell short term CC to add to your holdings. Basically wheeling the ETF. \n\nHowever, this is WSB. We want to see you liquidate your portfolio and throw it all on AAPL puts with max leverage.",
      "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1k43qr/",
      "created": 1714254633,
      "depth": 0,
      "replies": [
        {
          "id": "l1k8m6r",
          "score": 10,
          "body": "I don’t get why more people don’t just go with SPY.  For a passive investor, it’s hard to beat.",
          "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1k8m6r/",
          "created": 1714256481,
          "depth": 1,
          "replies": [
            {
              "id": "l1kl1f0",
              "score": 8,
              "body": "VOO is cheaper",
              "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1kl1f0/",
              "created": 1714261754,
              "depth": 2,
              "replies": [
                {
                  "id": "l1mlxbo",
                  "score": 2,
                  "body": "If you really want cheapest you would utilize SPLG.",
                  "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1mlxbo/",
                  "created": 1714304051,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l1tqctw",
                      "score": 1,
                      "body": "What's everyone's opinion of SPPX?",
                      "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1tqctw/",
                      "created": 1714416399,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l1tqoso",
                          "score": 1,
                          "body": "You mean SPX (SPY Index)? Or SPPX (10 Year Treasuries)",
                          "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1tqoso/",
                          "created": 1714416513,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l1trarj",
                              "score": 1,
                              "body": "Sorry, it's SWPPX. I'm new here.",
                              "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1trarj/",
                              "created": 1714416721,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l1km8ya",
                  "score": 2,
                  "body": "But if u have alot of shares of spy you could sell options with more ease!",
                  "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1km8ya/",
                  "created": 1714262278,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l1kp7tc",
                      "score": 3,
                      "body": "Partially true but that’s not a passive investor",
                      "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1kp7tc/",
                      "created": 1714263586,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l1kpepb",
                          "score": 2,
                          "body": "Perhaps not, but I think its something I would do once I amass enough shares",
                          "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1kpepb/",
                          "created": 1714263671,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l1ktwl6",
              "score": 2,
              "body": "QQQM for tech",
              "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1ktwl6/",
              "created": 1714265649,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l1l4uf2",
              "score": 2,
              "body": "Actually, hold a few of the large ETF's longterm like SPY and you will outperform 90% of investment advisors.",
              "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1l4uf2/",
              "created": 1714270487,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l1l0raj",
      "score": 11,
      "body": "this isn't r/investing. this sub is for 10 baggers or bankruptcy.",
      "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1l0raj/",
      "created": 1714268670,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1jsneu",
      "score": 6,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1jsneu/",
      "created": 1714250134,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1l2lxt",
      "score": 5,
      "body": "Don’t hate it. Stock picks generally look decent. Curious to hear your specific rationale for PLTR as a long term hold (they dilute shareholders pretty regularly but I’ve done limited research) and  CYBR (don’t know enough about them)",
      "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1l2lxt/",
      "created": 1714269488,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1o8f6x",
      "score": 3,
      "body": "Listen, thank you for attempting to try and inform the people on here about this stuff. However, you are wasting your time as these degens only want 10x on 0DTE fren.![img](emote|t5_2th52|4271)",
      "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1o8f6x/",
      "created": 1714327892,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1juzgf",
      "score": 2,
      "body": "Most of my money is in a single dividend fund at the moment. I use that as collateral for occassional option trades. Thats all I need for the next 30 years.",
      "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1juzgf/",
      "created": 1714251041,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1lu9ks",
      "score": 2,
      "body": "![img](emote|t5_2th52|4259)",
      "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1lu9ks/",
      "created": 1714284307,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1xtntr",
      "score": 2,
      "body": "As others have pointed out already. Most of the individual stock you have are already in VOO. So what's the point in holding them individually? What's your allocation percentage look like between VOO and the individual stocks?",
      "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1xtntr/",
      "created": 1714484863,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1kmm2b",
      "score": 1,
      "body": "i sold all my VIG. the expense ratio is 2x VOO and had a lower yearly return. no poijt",
      "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1kmm2b/",
      "created": 1714262438,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1l86kb",
      "score": -3,
      "body": "Where do you see TSLA within the next month? Above 200 is likely?",
      "permalink": "/r/wallstreetbets/comments/1ceo2kh/investing_pivot/l1l86kb/",
      "created": 1714272004,
      "depth": 0,
      "replies": []
    }
  ]
}