{
  "title": "Intel : the opportunity of this decade for retails and the \"Duck You Wall Street\" really deserves",
  "score": 445,
  "selftext": "OK regards listen up!\nThis is my first and only planned post here since I joined this group at january 2021 at the Yolo of that particular stock who cannot be mentioned since it get modded away to see what WSB is all about.\n\nNot surprisingly, I saw bunch of complete regards having day dreams of how to get rich fast with buying calls or puts, both are losing strategy in the long term since you can't compete against cartel of big banks and big hedge funds that are making the opposite bet.\n\nThat's fine, that's amusing sometimes to see the losses, but if you want the real wins and give a real \"Duck You\" to wall street and actually gain wealth in the process:  \n\nPersistent investing always been the key against them at the stock market, aka DCA aka keep buying the ducking dip on those turnaround companies that Wall Street hates and tell you to get away from.\n\nWall Street needs you to buy those stocks at higher price few years from now when they finally upgrade them, they cannot afford you buy low and sell high, they make money when you buy high and sell low.\n\nI have been investing since 2011 and I encountered more then once Wall Street scam behavior.\n\nAt 2012 bought Facebook after the ipo when Wall Street said its going to die and stay away.\n\nAt 2014 bought Microsoft when the new ceo that we all know today shift the focus to Azure cloud unit and Wall Street kept say its dead company.\n\nAt 2017 bought AMD when Wall Street were scaring us about bankrupt scenario.\n\nToo many times Wall Street tried to scam their way that you won't hold the biggest opportunities in the stock market until they say so, let's end this now!\n\nNow let us talk about the opportunity of this decade : Intel.\n\nIntel might be the most hated stock of Wall Street nowdays, from analysts of the big banks, Jim Cramer on TV, kids at YouTube and Tiktok investing \"guides\". Literally everyone bushing this company.\n\nThere are solid reasons for this bashing of course, but there are also huge positive signs for the future that almost everyone ignores or hide from you.\n\nIntel is currently on multi years transition phase, it has officially split their manufacturing units (fabs) aka \"Intel Foundry\" and their chip design units aka \"Intel Products\".\n\nWhen you look at the numbers, you find that Intel Products are very profitable, able to cross the big downside of losing market share over the years and finally stabilize.\n\nIntel Foundry on the other hand is the losing part of Intel now, big losing part,  billions each quarter, this are the headlines you see on the news that scares you like Intel going bankrupt.\n\nAll those headlines, all the fear spread, what those scam analysts not mentioning that the big lose is due to the huge investing Intel is doing right now by building the next generation of fabs.\n\n\"Intel lost billions\" is not intel lost billions, it is in fact \"Intel investing billions to make huge money after that\".\n\nHow much money you ask? \n\nI believe Intel Foundry will have more then 50bil yoy revenue by 2030, which combine with Intel products can lead to 100bil+ revenue a year (double the revenue from now).\n\nIntel transition to seperate design (Intel products) and manufacturing (Intel foundry), is much needed not only for Intel, but for the entire western world and it is backed up by the US and Europe and their entire arsenal of defense contractors. \n\nAs the allmighty Warren Buffet like to say :\"never bet against America\".\n\nI'm not even talking about their other growth segments of mobileye and Altera, which they also expected to boost the bottom line in the future.\n\nMost importantly, Intel so close to achieve what the ceo planned 3 years ago in 5 nodes 4 years plan, which those analysts and media said 3 years ago it couldn't be done. Intel are so ducking close to achieve that, that those analysts realized they screwed up, but they can't tell you that yet, they just wait for the price to stay low so they can upgrade the stock price later on and look like a winner picking.\n\nThis is what Wall Street has always been doing.\nNow let's add few more amazing facts about this stock:\n\nTrading close to their book value as low risk factor.\n\nP/S less then 3 as cheap valuation.\n\nMassive Forward P/E expansion after capex of the new fabs will finish as value adding factor.\n\nThis is the holy trio for finding those life changing wealth investments at the stock market.\n\nSo how you can hurt this scammers of Wall Street that tells you to stay away from Intel and try prevent you taking advantage of this beautiful setup of wealth gain in the upcoming years, how you say? \n\nBy buying the stock now!\n\nDon't wait till they tell you it is time to buy, which probably the upgrades will start to come at late 2024 - mid 2025. Keep adding now each month, be consistent. This is the way to punch them and ruin their plans.\n\nSo what is the bottom line here you say? \n\nForward P/E between 6-8 in 2030! \n\nOn neutral scenario of 6 and solid multiple of 20, you will get fair value stock price of 120! \n\nThat is even before the extra growth after 2030, which I think we all understand that the chip industry will keep leading this world for the next age.\n\n120 fair valuation at 2030, that is my target. That is how much cheap this stock is right now since it trade at the lower 30.\n\nHere are my long term positions: \n\nNO CALLS , buying and holding the stock.\nHodling 38,208 Intel stocks at this moment of typing and keep counting, as I will keep buy each month after I get my paycheck.\n\nAverage price here of 32.2 \n\nThat is a major position for me, that currently account for more then 70% of my portfolio. Why? Because this is the most amazing opportunity I see for this decade.\n\nYour welcome, God speed, and buy the deep ducking value.",
  "link_flair_text": "Discussion",
  "id": "1cfrrec",
  "num_comments": 357,
  "created_utc": 1714370373,
  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/",
  "url_overridden_by_dest": "https://i.redd.it/g884d41bzcxc1.jpeg",
  "comments": [
    {
      "id": "l1r09dq",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r09dq/",
      "created": 1714370379,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1r3ztb",
      "score": 354,
      "body": "Interesting… waiting to see which way the comments skew to see how people feel about this… then go the other way.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r3ztb/",
      "created": 1714372916,
      "depth": 0,
      "replies": [
        {
          "id": "l1sbjme",
          "score": 27,
          "body": "This is the way.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sbjme/",
          "created": 1714398809,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l1s6rg2",
          "score": 75,
          "body": "Another day, another Intel scam post.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s6rg2/",
          "created": 1714396909,
          "depth": 1,
          "replies": [
            {
              "id": "l1tc03o",
              "score": 39,
              "body": ">Intel : the opportunity of this decade for retails and the \"Duck You Wall Street\" really deserves\n\nWill just say that I've been bag holding INTC for a decade. My first shares were purchased in 2010 back when Intel wasn't a joke yet. Bought a few dips. You guys can guess how much I'm down.\n\nNow I see OP telling me to wait ANOTHER decade for INTC?!??!?! At this point, I'm not sure if he's the coolest guy or if I want to fucking punch him in the face 🤡. Maybe both.",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1tc03o/",
              "created": 1714411518,
              "depth": 2,
              "replies": [
                {
                  "id": "l1tw370",
                  "score": 9,
                  "body": "highly regarded people like myself are here to save you bro. i just bought intel like a year ago cant wait to hold the bag for the next decade",
                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1tw370/",
                  "created": 1714418357,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l1u0dhi",
                      "score": 11,
                      "body": "I bought 2 months ago for the first time INTC, 30% down. Feels like my btc adventure all over again..",
                      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1u0dhi/",
                      "created": 1714419844,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l1u3fev",
                          "score": 7,
                          "body": "intel beat earnings like 29% this last quarter like lolz fundamentally intel makes sense imo but dont listen to me all i do is lose money with everythingive ever invested in other than physical gold bullion.",
                          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1u3fev/",
                          "created": 1714420889,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l1wbiq7",
                          "score": 2,
                          "body": "Same.",
                          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1wbiq7/",
                          "created": 1714452843,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lcmwt97",
                  "score": 2,
                  "body": "Barely made it out with PLTR but OP kinda has a point. You held it the entire time while it was favoured as such so you should’ve gotten out then bought back when it was catching hate.",
                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/lcmwt97/",
                  "created": 1720678192,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l1u6gh0",
          "score": 2,
          "body": "It's a long term hold according to Op, so just about no one here will be interested.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1u6gh0/",
          "created": 1714421935,
          "depth": 1,
          "replies": [
            {
              "id": "l1u9d14",
              "score": 2,
              "body": "It's high IV if you wanted to gamble it's as a better choice than many to be honest.",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1u9d14/",
              "created": 1714422938,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l1r8lze",
      "score": 182,
      "body": "The amount of INTC bets makes me worried…",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r8lze/",
      "created": 1714376317,
      "depth": 0,
      "replies": [
        {
          "id": "l1r8nkw",
          "score": 50,
          "body": "Not if you buy the stock",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r8nkw/",
          "created": 1714376351,
          "depth": 1,
          "replies": [
            {
              "id": "l1r90ne",
              "score": 94,
              "body": "The thing about INTC is it doesn’t really matter if you buy it now or in a year. But I respect your choice and assume you made a proper analysis. Good luck!",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r90ne/",
              "created": 1714376627,
              "depth": 2,
              "replies": [
                {
                  "id": "l1reu8y",
                  "score": 35,
                  "body": "It probably doesn't but it might matter if you buy it now or in 5 years.\nI don't expect Intel to meaningfully increase before 18A in 2025.",
                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1reu8y/",
                  "created": 1714381098,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l1rfeks",
                      "score": 17,
                      "body": "Are you not concerned of this being another 10nm situation where they get stuck?",
                      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rfeks/",
                      "created": 1714381532,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l1rfvde",
                          "score": 25,
                          "body": "Maybe, maybe not. That's why I am not buying until they at least release their new consumer chips (around Q4 24) using 20A. \nIf they look promising, I might consider buying the stock.\n\nAlso, Intel was tasked by Microsoft to build their new chips using 18A in 2025. I don't know whether the executives at Microsoft know more than we do but I have hope that they know what they're doing.",
                          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rfvde/",
                          "created": 1714381891,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l1t3qjs",
                              "score": 7,
                              "body": "I attended a conference last October in Vegas with Microsoft and Intel that made it seem like this was very much on track. Intel also talked a great deal about... I'm not sure how they described it but basically geographical diversification of cloud and manufacturing locations to ensure up time primarily for the benefit of getting this goal accomplished. This isn't inside info or anything but they're confidence level was high. But Microsoft also over hyped Copilot earlier that same month and had to push it back 6 months for more debugging and refinement... So 🤷🏽‍♂️",
                              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1t3qjs/",
                              "created": 1714408733,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "l1ssc8i",
                          "score": 7,
                          "body": "No, 18A is far enough along and has been sampled by multiple 3rd party companies to reasonably assume a 2025 Q4 launch is almost a certainty.",
                          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1ssc8i/",
                          "created": 1714404868,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l1ssw3c",
                          "score": 6,
                          "body": "I'm honestly not. I would have been with the MBA as CEO, but with Gelsinger helming, I think they're well situated to handle technical challenges in a way they haven't been in 25 years.",
                          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1ssw3c/",
                          "created": 1714405056,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l1rxhbz",
                          "score": 6,
                          "body": "They've still got a lot of wrinkles to work through, and gelsinger, a man with an actual technical/engineering background, is a good fit for the company. The stock won't get above 50$ however. This is intel we are talking about.",
                          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rxhbz/",
                          "created": 1714392767,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l1tcm9h",
                              "score": 8,
                              "body": "It doesn’t need to. I only need it to reach 40$.",
                              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1tcm9h/",
                              "created": 1714411721,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "l1stlhj",
                          "score": 3,
                          "body": "Everyone is about to get stuck.  2nm is on the verge of rolling out.  1.8 & 1.6nm are theoretically \\~2years out.   Even those node upgrades are very diminishing returns compared to what node transitions used to give us.  Think 10-15% improvements, rather than 50-100% improvements.\n\nUnless the industry shifts to an entirely different paradigm in the next \\~5 years, improvements are at a stalemate.  If nothing else is available at that time, maybe they can wring some small gains out for a year or two with more fine-tuned designs on the same process nodes, but progress will essentially be stalled without a whole new computing ecosystem.",
                          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1stlhj/",
                          "created": 1714405296,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l1t5dom",
                              "score": 4,
                              "body": "We've basically been wringing out small 10% gains for a decade now. Process technology has been hard slogging for a while.",
                              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1t5dom/",
                              "created": 1714409289,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l1t6prm",
                                  "score": 2,
                                  "body": "True enough, though the move to pervasive multi-core chips kept the perf climbing for a while, even after node shrinks started showing diminishing returns.",
                                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1t6prm/",
                                  "created": 1714409735,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "l1sz7tt",
                              "score": 4,
                              "body": "Ehh with their new VIA strat they can get more than 10-15% improvement. This is intel we are talking about they do a good job of improving routing and pulling another 20% performance out with their tocks. Tick down a size then improve routing with a tock. \n\nAMD’s routing is crap, their saving grace is their ML predictor. Which is why AMD isn’t really surpassing Intel despite having smaller transistors. If you have a smaller transistor but the trace length of the signals is not shorter you can’t get a higher bandwidth.\n\nI do agree though we are nearing the end of what can be achieved with binary chipsets though.",
                              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sz7tt/",
                              "created": 1714407203,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l1t6dwy",
                                  "score": 5,
                                  "body": "Via is just a packaging strategy, and most of the benefit of it is going to be realized in the 2-3 years.  By the time 1.8 & 1.6nm are out, there isn't much on the foundry's roadmaps to keep the perf climbing.  TSMC and intel both have silicon-integrated photonics in the pipeline (and in the market to a limited degree), that's mostly a datacenter improvement for now.   Unless it can somehow be adapted as a memory bus interface, and/or a next-gen PCI-E interface, it's unlikely to help the consumer segment much.",
                                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1t6dwy/",
                                  "created": 1714409625,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l1t6dy5",
                                      "score": 2,
                                      "body": "Well, I, for one, would NEVER hope you get hit by a bus.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                                      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1t6dy5/",
                                      "created": 1714409625,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l1utuo0",
                  "score": 2,
                  "body": "I thought that, and just decided to do it as it seemed to be at a pretty low spot 1.5 months ago already. \n\nI'm down 26% on that.",
                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1utuo0/",
                  "created": 1714430405,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l1rjjzj",
          "score": 1,
          "body": "I bet it does",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rjjzj/",
          "created": 1714384660,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l1rft9z",
      "score": 69,
      "body": "Is minus 28% in the last month a good or bad sign?",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rft9z/",
      "created": 1714381847,
      "depth": 0,
      "replies": [
        {
          "id": "l1s9s8v",
          "score": 33,
          "body": "Good sign for my buys, you all bagholders can get fucked though.\n\nMost of the regards bought Intel while it was still going through its full downfall with no future prospects in sight loaded on copium and chips act.\n\nGet in it at 25-30 range",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s9s8v/",
          "created": 1714398124,
          "depth": 1,
          "replies": [
            {
              "id": "l1s9t3h",
              "score": 10,
              "body": "Sounds like a typical, greedy retail investor.",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s9t3h/",
              "created": 1714398133,
              "depth": 2,
              "replies": [
                {
                  "id": "l1sarr1",
                  "score": 20,
                  "body": "What is anyone doing here if he is not greedy?",
                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sarr1/",
                  "created": 1714398509,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l1rk2gu",
          "score": 7,
          "body": "Did you want to buy at up 28%? Buy high sell low, true regard.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rk2gu/",
          "created": 1714385025,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l1s7zu6",
          "score": 6,
          "body": "Good sign.  Proves that the institutional investors are trying to duck us!",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s7zu6/",
          "created": 1714397409,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l1s3evv",
      "score": 48,
      "body": "FD: AyyMD fanboi and holder since 2016.  Hold *zero* INTC.\n\nThis is a fairly decent thesis but it ignores one very vital part, Pat Gelsinger.  Mad Pat is an engineer.  He designed the 486, literally wrote the book on the 386 that is on my bookshelf, and was the CTO during INTC's most successful period.  With Pat at the helm and making the right investments and improvements where its needed, INTC has the right conditions for a Dr. Lisa Su-style turnaround like she did with AMD.  \n  \nGoing long on INTC right now might not be a bad idea.  Sure it would be nice if it hit $25 again and just YOLO it, but this is a great DCA opportunity.\n\nActually considering INTC now for the first time ever OP, thanks.  Will go through the 10Qs and 10Ks.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s3evv/",
      "created": 1714395495,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1r81l6",
      "score": 97,
      "body": "> NO CALLS , buying and holding the stock. Hodling 38,208 Intel stocks at this moment of typing and keep counting, as I will keep buy each month after I get my paycheck.\n\n\n\ncalls it is. bought some on friday, ty sir",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r81l6/",
      "created": 1714375878,
      "depth": 0,
      "replies": [
        {
          "id": "l1s5oh8",
          "score": 11,
          "body": "You can just do super long calls, that's basically like holding the stock right?",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s5oh8/",
          "created": 1714396462,
          "depth": 1,
          "replies": [
            {
              "id": "l1s5w78",
              "score": 6,
              "body": "haha some deep ITM leaps, yeah. but it's gotta go at least up at some point or you're kinda fck'd\n\ncould sell ccs on  it too (poor man's covered call). just make sure to buy the call in a margin account",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s5w78/",
              "created": 1714396551,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l1rvgq6",
          "score": 4,
          "body": "$11 puts frrrrr",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rvgq6/",
          "created": 1714391773,
          "depth": 1,
          "replies": [
            {
              "id": "l1rvyvg",
              "score": 16,
              "body": "Now that’s regarded!",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rvyvg/",
              "created": 1714392022,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l1sm497",
              "score": 2,
              "body": "My dd had me buy $9 calls immediately before the stock crashed so that’s fun.",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sm497/",
              "created": 1714402700,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l1silu2",
      "score": 36,
      "body": "The exact same conversation being had here was had last year. \"Intel is dying\" \"Intel going to $10-20\" blah blah. \n\nMeanwhile I picked up a bunch around $25 and sold CC's all the way up to $50. Now it went back down and everyone is freaking out. I'm going to do the same thing I did last time: Not listen to any of you.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1silu2/",
      "created": 1714401447,
      "depth": 0,
      "replies": [
        {
          "id": "l1skfpa",
          "score": 6,
          "body": "Bingo",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1skfpa/",
          "created": 1714402103,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l1r1bd2",
      "score": 169,
      "body": "The government will never let intel fail. China would LOL at us",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r1bd2/",
      "created": 1714371088,
      "depth": 0,
      "replies": [
        {
          "id": "l1ra8ze",
          "score": 43,
          "body": "Intel is already falling flat on its face. China isn't even close to Intel, or the Koreans for that matter.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1ra8ze/",
          "created": 1714377563,
          "depth": 1,
          "replies": [
            {
              "id": "l1rq08o",
              "score": 83,
              "body": "Intel isn’t falling flat on its face.  People just don’t understand the semiconductor industry, or chip design.  Everything is done years ahead of time.  \n\nIntel DID fall flat on its face years ago.  And it took a half a decade plan for them to catch up.  In 2H this year there is a significant chance their foundry will be releasing silicon that is better than anything tsmc has to offer.  \n\nIntel has managed to stay afloat using essentially a glorified 14nm process against tsmc 5nm.  Now they are jumping back to being on par with tsmc.  Their design has always been decent, it’s just their foundry really screwed them.  It isn’t a slam dunk, these next years need to go like the last few.  But the last few years haven’t been intel falling on its face.  It has been intel managing to get back up again.",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rq08o/",
              "created": 1714388831,
              "depth": 2,
              "replies": [
                {
                  "id": "l1rwm7s",
                  "score": 31,
                  "body": "This is just not true. Intel is not and has never really been a foundry. They are working on that but it has always been captive production for their own designs. They still own the datacenter. \n\n10nm Rev 0 was a fuckup and there have been other missteps, but I wouldn't put that wholly on the fab guys. Intel's management has had issues for the last 15 years that can't be fixed back in a year or two (remember the atom design for mobile? x86 just doesn't play well with low power....). But give them another while. Backside power is gonna change shit kinda like the finfet design did (we do all remember that Intel did that first... And HKMG... and many other leaps that TSMC relies on...). Moving power delivery out of the topside metals is going to be a real game changer. \n\nIt has been known for a LONG time that the real bottleneck in any chip is all the RC through those metals. Fingers crossed they don't fuck this up at the upper echelons of management. Signed, long-term bagholder (since 2002)",
                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rwm7s/",
                  "created": 1714392344,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l1rxus1",
                      "score": 7,
                      "body": "Well I think that’s sort of splitting hairs and wasn’t really my point.\n\nThey were a foundry for a clientele of one.\n\nIf intel does as good as they hope they will, I think it’ll honestly largely be similar to how it was before.  Sure they will now do a little sales on the side.  But if their design team manages to pull back into first with the advantage of having an inside track to the leading foundry… how much extra silicon will they really have to sell?  And why?  Right now analysts already predict they won’t have enough capacity, and that’s with them being bearish on intel design and AI.\n\nI think in order for them to become a truly independent foundry, they would need a long time, and would need to beat out tsmc.  If tsmc and intel are on par… you would just be flooding the market, overly competing.  That’s not even mentioning Samsung.  Intel being able to sell to US military and a few other customers is nice, but not sure it is the big change they are acting like it is.  The second intel design becomes leader again due to the foundry catching up, intel is by far and away intel’s biggest customer.  Sort of like how apple buys 100% of tsmc’s newest node up for a while I think it’ll be the same for intel.  Sure they will have their half dozen outside customers, and people to buy old nodes they don’t need, but in the end it is pretty similar to what it always was IMO, unless they vanquish tsmc/samsung.  They simply don’t have the capacity to supply someone like apple or Nvidia or amd.  And it doesn’t make sense to make it unless they are well ahead of tsmc, or if they get some crazy assurances.  Finding that partner who actually wants intel to succeed over tsmc, outside of the us government/military will be hard because they are mostly competitors with intel.  They would rather tsmc or samsung(to a lesser extent because Samsung does compete with others in some areas) succeed because they aren’t competitors who will use their power to gain an advantage.",
                      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rxus1/",
                      "created": 1714392945,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l1ryre3",
                          "score": 9,
                          "body": "AAPL definitely does not have monopoly on TSMC supply per node. Ever heard of N4? That was/is a pure NVDA node. Nobody else uses it. Slightly different track height with different variable height, etc. \n\nYeah maybe splitting hairs but the distinction is important to nerds. \n\nOk I am a nerd. \n\nAnd also a degen gambler on WSB. So take it fwiw lol",
                          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1ryre3/",
                          "created": 1714393374,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l1s01i9",
                              "score": 8,
                              "body": "Apple always gets first crack at tsmc new node for the last few generations.  Tsmc does sell tons of other nodes they split off, and normally they go on to sell the node that apple buys 100% of to other people once apple gets their fill.  This gen was a bit different in that apple literally bought 100% of the bleeding edge node, then tsmc didn’t sell it to anybody else.\n\nThen after apple gets their dibs, other people in line get theirs.  Nvidia has never gotten a better node before apple.  It’s always apple first.  \n\nApple’s current gen of iPhones is made on tsmc 3nm.  They were the first customer of 3nm.  They bought 100% of the production for a while.  Then after apple gets everything they needed, others can also buy 3nm(but as I said this gen it will be a different node for all non apple customers).  Nvidia is on 4/5nm with their N4 node, depending on who you ask.\n\nSo, I am saying intel will always get that priority status from intel.  And unlike tsmc they don’t have the capacity to then sell to other massive buyers.",
                              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s01i9/",
                              "created": 1714393969,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "l1t5nw9",
                              "score": 2,
                              "body": "I designed on N4, and I sure as heck did not work at NVidia.",
                              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1t5nw9/",
                              "created": 1714409384,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l1s5l5o",
                  "score": 2,
                  "body": "Also ontop of that, their GPUs are actually now being recommended as capable and I feel with the next generation of hardware should definitely handle the mid to low end of desktop graphics ,",
                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s5l5o/",
                  "created": 1714396424,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l1ue2pf",
          "score": 1,
          "body": "It’s not about government letting it fail. \n\nIt’s more about demand and supply. China is one of intel’s biggest customer and the US government is doing everything to restrict free trade in Chips. What happens if China makes it own advance chips in the future? Well demand go elsewhere and intel loses out. It’s a bit like Qualcomm losing out to China trade because China has moved up to 7nm to 5nm chip manufacturing capability in the RISC-V realm.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1ue2pf/",
          "created": 1714424573,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l1wm7gl",
          "score": 1,
          "body": "The government does not have infinite power.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1wm7gl/",
          "created": 1714459428,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l1r23m5",
      "score": 47,
      "body": "I agree, and have made a sizeable INTC bet. Not to mention Gaudi...",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r23m5/",
      "created": 1714371610,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1r57j2",
      "score": 50,
      "body": "Do any of these prophecy posts actually deliver?",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r57j2/",
      "created": 1714373780,
      "depth": 0,
      "replies": [
        {
          "id": "l1r5sgd",
          "score": 111,
          "body": "It’s usually someone with heavy bags needing to unload.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r5sgd/",
          "created": 1714374205,
          "depth": 1,
          "replies": [
            {
              "id": "l1rd6vr",
              "score": 22,
              "body": "That doesn't narrow it down. We're all bag holders here.",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rd6vr/",
              "created": 1714379821,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l1rcn86",
              "score": 20,
              "body": "Yeah, okay, but he said buy stocks.  So, in this scenario, what you are suggesting is that the entirety of WSB has the purchasing power to bring INTC's stock price back to a position OP can unload his stock at.\n\nI really appreciate the contrarian views but they should have some basis in reality.",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rcn86/",
              "created": 1714379399,
              "depth": 2,
              "replies": [
                {
                  "id": "l1rjq2a",
                  "score": 16,
                  "body": "This is wsb. You're surrounded by idiots who can't plan more than weeklies.",
                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rjq2a/",
                  "created": 1714384783,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l1re9fr",
                  "score": 16,
                  "body": "I wrote exactly what I'm holding, at what price, target price + the intention to hold at least until 2030.\nNot going sell single share , only adding here over time.",
                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1re9fr/",
                  "created": 1714380647,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l1ry37b",
                      "score": 3,
                      "body": "I think your idea is solid. Let's just hope the upper management doesn't fuck this up again. I replied to a couple other comments. \n\nI've been holding INTC since 2002. I got my first shares after the splits back then. They used to be pretty generous with their engineers ;-)",
                      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1ry37b/",
                      "created": 1714393056,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l1r2hte",
      "score": 29,
      "body": "Respect, bro. I only have 3k shares lol",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r2hte/",
      "created": 1714371874,
      "depth": 0,
      "replies": [
        {
          "id": "l1r7urk",
          "score": 10,
          "body": "Same here",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r7urk/",
          "created": 1714375731,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l1rhvrc",
      "score": 22,
      "body": "Does this post mean Intel is going to keep dropping? ![img](emote|t5_2th52|4260)",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rhvrc/",
      "created": 1714383424,
      "depth": 0,
      "replies": [
        {
          "id": "l1rhwh0",
          "score": 32,
          "body": "Obviously. As I always say, a rising tide lifts all yachts.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rhwh0/",
          "created": 1714383440,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l1s7046",
      "score": 7,
      "body": "owning intel is also a hedge against china invading taiwan",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s7046/",
      "created": 1714397008,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1r8c4h",
      "score": 29,
      "body": "Everything he is saying isn't wrong. Foundry drag on earnings was $2B. Minus that, this quarter was a banger. Intel first to next gen fabrication. 16A, 14A. If that happens, they will have their pick of clients.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r8c4h/",
      "created": 1714376102,
      "depth": 0,
      "replies": [
        {
          "id": "l1rdq0h",
          "score": 15,
          "body": "Because they get to set the foundry price for the processor division they can pretty much choose which sector is profitable and which isn’t. \nThey could be hiding poor processor division profits in the foundry.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rdq0h/",
          "created": 1714380232,
          "depth": 1,
          "replies": [
            {
              "id": "l1s4mc5",
              "score": 4,
              "body": "Aren't intercompany revenues / expenses eliminated when consolidating financials for the street?",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s4mc5/",
              "created": 1714396019,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l1tj0vg",
              "score": 3,
              "body": "Read, their foundry took massive losses because they didn't allow them to set the price. The product side would only pay fair market value as in what tsmc charged.",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1tj0vg/",
              "created": 1714413891,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l1s8c13",
          "score": 4,
          "body": "Does “banger” mean it was good?  Thank you in advance.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s8c13/",
          "created": 1714397547,
          "depth": 1,
          "replies": [
            {
              "id": "l1sol90",
              "score": 3,
              "body": "Banger means good",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sol90/",
              "created": 1714403577,
              "depth": 2,
              "replies": [
                {
                  "id": "l1t0ko5",
                  "score": 3,
                  "body": "Thank you.",
                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1t0ko5/",
                  "created": 1714407662,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l1slu3f",
              "score": 2,
              "body": "Yes. I would have to run some calculations but margins would have been north of 50%",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1slu3f/",
              "created": 1714402601,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l1shpw9",
          "score": 2,
          "body": "TSMC is still ahead of Intel. They will reach 16A first, it just started making the news that TSMC's 1.6nm process will be in production in late 2026. Of course both TSM and INTC go down today.\n\nThe mistake many people are making is thinking that one or the other will win at the expense of the other. I think there is more demand for chips than the capacity to produce them. All fabs will make money.\n\nCars, robots, automation, AI - the demand for chips for the next 10 years will be greater than the production capacity. It will take the market 2-3 years to recognize that the chip manufacturers are among the most important companies in the world and over value them the same way as chip consumers (NVDA, AMZN, MSFT, GOOG, AAPL, META, etc.)\n\nI expect a bubble in the chip sector at some point by 2030.\n\nI own both TSM and INTC.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1shpw9/",
          "created": 1714401121,
          "depth": 1,
          "replies": [
            {
              "id": "l1slmim",
              "score": 2,
              "body": "Nobody believes that TSMC will hit 1.6nm first. Not even TSMC.",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1slmim/",
              "created": 1714402525,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l1r9kb9",
      "score": 80,
      "body": "Poorly managed company with rudderless leadership. The government giving them money will be a complete waste.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r9kb9/",
      "created": 1714377042,
      "depth": 0,
      "replies": [
        {
          "id": "l1rayjh",
          "score": 29,
          "body": "Agreed, but it will. Just like the major autos and Boeing, it will get floated along regardless.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rayjh/",
          "created": 1714378107,
          "depth": 1,
          "replies": [
            {
              "id": "l1rsbch",
              "score": 9,
              "body": "Sure but the risk free rate right now is like 5%\n\nIBM has been too big to fail for the last 10 years but has had no growth with a 4% yield, the same can happen to INTC.",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rsbch/",
              "created": 1714390131,
              "depth": 2,
              "replies": [
                {
                  "id": "l1rxcgz",
                  "score": 4,
                  "body": "IBM doesn't manufacture shit anymore. It's almost a pure IP play in semiconductors these days.",
                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rxcgz/",
                  "created": 1714392702,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l1syxfa",
          "score": 5,
          "body": "Yep there is a big difference between wall street being emotional vs a company being ran by Jack Welch MBAs who dont have a single clue about the product that the company is making and only focus on gutting the company for stock buybacks.\n\nGE, Boeing, Intel really figured out how easy it is to turn subsidies/breaks into stockbuy backs.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1syxfa/",
          "created": 1714407105,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l1sqki1",
          "score": 2,
          "body": "I had high hopes for Patrick Gelsinger.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sqki1/",
          "created": 1714404260,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l1s1wgh",
          "score": 1,
          "body": "Which is like a 100% guarantee the government will give them a blank check ",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s1wgh/",
          "created": 1714394822,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l1rkbpz",
      "score": 15,
      "body": "I am buying when it hits $23 a share",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rkbpz/",
      "created": 1714385205,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1rqq3e",
      "score": 9,
      "body": "Newest PYPL of WSB.... Baghold inbound.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rqq3e/",
      "created": 1714389246,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1r82mr",
      "score": 5,
      "body": "Max Short on snap today",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r82mr/",
      "created": 1714375900,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1t97ss",
      "score": 5,
      "body": "Intel is at a bargain price right now. It will be at least 50 by end of 2025. It's free money grab it if you can.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1t97ss/",
      "created": 1714410583,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1tfxl3",
      "score": 4,
      "body": "I'm using a 12900k and It's a great processor tbh. Intel will get their act together and catch up to AMD. They fixed a lot of the driver issues with their GPU's also.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1tfxl3/",
      "created": 1714412843,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1ry5nx",
      "score": 12,
      "body": "Intel isn’t going to have any meaningful gains **IF ANY** until 6-8 quarters from now.  I’m so tired of people being ridiculous about this.  \n\nIntel not only needs to beat TSMC, Samsung and others but needs to gain tons of customers and have profits with these customers. Just because Intel is building fabs doesn’t mean people will come others are building fabs. **Intel is going to have to beat them on price and tiny margins with a lot of revenue doesn’t mean much.**\n\nLet’s look at their debt and cash reserves. They have about 25 billion in cash and by year end will likely have in the mid 50’s in the billions of debt. Intel’s debt will likely accelerate. **Bigger debt = higher debt payments and interest payments that wash away profit gains**\n\n**Intel is very behind with Datacenter/AI chips. They are 3rd place and if AMD comes out with their new chip relatively soon they will be a distant 3rd place with Gaudi and a generation behind.** This will be another failed chip launch and will cost them. \n\nMobileye which was a bright spot doesn’t seem as bright anymore. Altera isn’t looking good either judging by that earnings report. \n\n**Other than Client Computing Group what are the bright spots for Intel**. They are basically losing at everything and if AMD ever even encroaches on that market especially the laptop market Intel will be fucked.  \n\nThese Fabs require money, time, cutting edge tech, execution and chip demand all at the same time. I don’t think Intel will get all of those here especially when they are going to start using a new node next year and new nodes regardless of company have their own pitfalls and challenges to overcome.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1ry5nx/",
      "created": 1714393089,
      "depth": 0,
      "replies": [
        {
          "id": "l1s8rzc",
          "score": 15,
          "body": "6-8 quarters. So 1.5-2 years. So the time to get in is nowish.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s8rzc/",
          "created": 1714397724,
          "depth": 1,
          "replies": [
            {
              "id": "l1sd4jz",
              "score": 2,
              "body": "Yeah that’s 1.5-2 years at a minimum. The stock is gonna continue to crash until then unless they have a stellar surprise or something that’s completely out of left field. \n\nIt will likely will be 2+ years until we see what 20A and 18A nodes will do for Intel and I don’t mean that as benchmarks but as actual profit and revenue with chips being shipped at volume. As well as pitfalls or challenges being crossed or being too tall a climb.  \n\nIf I was telling someone to invest in Intel at a minimum I would tell them to wait 6-8 quarters. Intel has come out and said that this year was going to be very challenging for them. \n\nWhy buy at 31$ a share when you can buy it in a year or two for 26$ or lower. \n\nAdditionally, new nodes have tons of challenges. Intel is betting it all on 20A and 18A to not only go smoothly but for it to be a market leader. If it doesn’t go smoothly they are fucked.",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sd4jz/",
              "created": 1714399418,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l1t7q10",
          "score": 3,
          "body": "THANK YOU.\n\nFull disclosure, I own Intel and am long on it.  I own it because rising seas raise all ships and that is the only reason, I don't expect it to outperform AMD, NVDA, TSCM, ARM etc.  \n\nEveryone simply ignores their debt profile when evaluating Intel and expects them to follow semiconductors like AMD or NVDA.  Intel's business is evaluated as a US based manufacturing company first and everything else second.  \n\nGo look at their Capital investments, depreciation, and their full balance sheet and you will see why Intel will continue to be the dog of the semiconductor market for the foreseeable future.  Even if they get this retooling right they're going to be carrying that expense and servicing that debt for a long time.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1t7q10/",
          "created": 1714410071,
          "depth": 1,
          "replies": [
            {
              "id": "l1te5ih",
              "score": 3,
              "body": "Yeah this is my feeling too. \n\nWhere the money is going is my problem. They can’t eliminate the dividend because at that point there will be no reason to own Intel over anyone else. So they have to continue to have it. \n\nThen you have the foundry loses probably exploding for the rest of this year and continuing into 2025 as well. It’s not impossible to think that halfway through 2025 their debt will balloon to 60 billion. At that point it wouldn’t even shock me if their debt would cost them in interest 2-4 billion a year which is no small number. That much interest can wipe almost a year of profits in one swoop.  \n\nAltera and Mobileye only had bad quarters but if that continues to trend for a couple quarters then a lot of “value” that Intel has in these companies is wiped out. Mobileye imo is especially vulnerable. Not for nothing but if the value of these go down by proxy the amount of levers Intel can pull to get out of hot water goes down. \n\nThe thing that bothers me most is people think that going to a new node is easy and won’t have its setbacks. It really doesn’t matter who it is there’s always going to be a challenge with these new modes. \n\nThe issue is Intel has no leg room to fuck this up. The stock will probably fall to the mid 20’s relatively soon and one fuck up afterwards, one delay, or issue will probably kill any investor confidence left and send the stock spiraling. At that point 60 billion in debt with a company that has declining revenues and market cap who’s only at barely 100 billion will look a hell of a lot worse.",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1te5ih/",
              "created": 1714412238,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l1rzuhz",
      "score": 10,
      "body": "There is a ton of insider buying which you almost never see.  Hedge funds have increased their stakes.  Intel near a 5 year low.  Something is going on that we do not know about",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rzuhz/",
      "created": 1714393878,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1r8mf5",
      "score": 25,
      "body": "I work in 2nm R&D. you're all regards for assuming they're going to do well in the long run.\n\nIntel itself is pulling a WSB. go give your money to a fuckin orangutan with a robinhood account, it's about the same chances.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r8mf5/",
      "created": 1714376326,
      "depth": 0,
      "replies": [
        {
          "id": "l1r9m7s",
          "score": 15,
          "body": "Which 2nm RD? Since I'm from the industry as well",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r9m7s/",
          "created": 1714377082,
          "depth": 1,
          "replies": [
            {
              "id": "l1s226k",
              "score": 4,
              "body": "How can you be in this industry and seriously think Intel is a good investment. What are you, the janitor at Intel?",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s226k/",
              "created": 1714394893,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l1ra530",
              "score": 6,
              "body": "I'm in BEOL. it's not looking good for Intel, I don't know why you'd gamble on a company that is unwilling to invest in foundry hardware.",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1ra530/",
              "created": 1714377479,
              "depth": 2,
              "replies": [
                {
                  "id": "l1radbz",
                  "score": 16,
                  "body": "where do you work ? I cannot tell exactly where I work but intel not investing in hardware is not true at all ![img](emote|t5_2th52|8882)",
                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1radbz/",
                  "created": 1714377656,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l1raknw",
                      "score": 7,
                      "body": "if you worked on new nodes, you'd know they're not investing. so I assume you're with some peripheral hardware company they're scaling older nodes with.\n\nIntel is not competitive on new nodes at all. they've got a sinking ship.",
                      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1raknw/",
                      "created": 1714377811,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l1rbc67",
                          "score": 11,
                          "body": "Actually not true what you assumed about me, not true about Intel not investing in new nodes since that is the majority of spending now with the new capital machines, I assume you say 18A going to fail ? Good luck",
                          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rbc67/",
                          "created": 1714378396,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l1rbo50",
                              "score": 6,
                              "body": "I've seen zero orders for 2nm BEOL so far, and you're talking about 18 Angstrom? let's see them scale 3nm first -- oh wait, they've done all that via TSMC. but let's go all in on a node they've not even started ramping in their own fabs.\n\nhistorically they are the worst, bitchiest, and most penny pinching customer on new nodes. they act like it in meetings. nothing has changed.",
                              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rbo50/",
                              "created": 1714378646,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l1rigx3",
                                  "score": 15,
                                  "body": "What are you talking about they're not investing in new hardware?  They just completed assembly of their first high na euv machine. ![img](emote|t5_2th52|31225)",
                                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rigx3/",
                                  "created": 1714383867,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "l1rbtmk",
                                  "score": 6,
                                  "body": "I would wait with your conclusion till mid of 2025, you will get a surprise",
                                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rbtmk/",
                                  "created": 1714378765,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "l1s55wn",
                                  "score": 3,
                                  "body": "You're so wrong its not even funny\n\nYou will realise when you see you missed a massive opportunity to get rich",
                                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s55wn/",
                                  "created": 1714396247,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l1t8mn7",
          "score": 2,
          "body": "This post chain should be pinned to the top of the thread. \n\nIntel is a joke within the semi industry. No one with an inside look at the company would invest a dime in it.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1t8mn7/",
          "created": 1714410383,
          "depth": 1,
          "replies": [
            {
              "id": "l1t9510",
              "score": 6,
              "body": "they refuse to pay for the technologies that enable the newer nodes. I've been in meetings with their senior directors yelling at 25 managers asking why their machines are behind, only to be told \"well... we didn't buy the option. it was 5% of the chamber cost.\"\n\nthey do stupid shit constantly. I'm very happy to have TSMC as the primary customer for my technologies.",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1t9510/",
              "created": 1714410556,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l1ru1wc",
      "score": 6,
      "body": "Don’t tell them about this stock. Keep buying the dips and wait for the pop a few years from now. Then post all your sweet gains.\n\nMobile eye alone makes Intc undervalued where it currently is. This only goes up once the foundry spending slows down. ",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1ru1wc/",
      "created": 1714391052,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1rhyek",
      "score": 3,
      "body": "Trillion dollar company",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rhyek/",
      "created": 1714383481,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1ruaa6",
      "score": 3,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1ruaa6/",
      "created": 1714391173,
      "depth": 0,
      "replies": [
        {
          "id": "l1s4s2c",
          "score": 3,
          "body": "That forecast is exactly match the forward pe of 6-8 at 2030 as I wrote , idk why you think it's bearish",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s4s2c/",
          "created": 1714396087,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l1s0n5t",
      "score": 3,
      "body": "Felt the same way two years ago, still holding :)",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s0n5t/",
      "created": 1714394248,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1s8gpx",
      "score": 3,
      "body": "Jim Cramer: check. YouTube: check. TikTok: check. Mention Dave Ramsey and I am sold.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s8gpx/",
      "created": 1714397599,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1sfz70",
      "score": 3,
      "body": " !RemindMe 5 years",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sfz70/",
      "created": 1714400487,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1tvt9f",
      "score": 3,
      "body": "if i had more money lying around id buy even MORE intel stock. that’s how i feel.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1tvt9f/",
      "created": 1714418262,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1twcfe",
      "score": 3,
      "body": "Looks like 90% of the regards here are against INTC, time to buy indeed, I'm with you OP",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1twcfe/",
      "created": 1714418445,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1u8yd3",
      "score": 3,
      "body": "I went long on intel today c:",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1u8yd3/",
      "created": 1714422796,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1rjnxf",
      "score": 6,
      "body": "What the fuck is up with reddit and pumping bags",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rjnxf/",
      "created": 1714384740,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1riur2",
      "score": 7,
      "body": "*Bagholder alert triggered...*",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1riur2/",
      "created": 1714384151,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1rnaah",
      "score": 2,
      "body": "Short term = put\n\nLong term = call",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rnaah/",
      "created": 1714387175,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1ru5ev",
      "score": 2,
      "body": "\nAnd in 10 years they’ll need to invest more billions in the new tech of the time to stay relevant while companies like Coca Cola don’t need to spend nearly as much money to change their product or compete. Fixed costs, competition, add uncertainty to the long term prospects of a tech business justifiably lead to a lower market valuation.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1ru5ev/",
      "created": 1714391103,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1rurd0",
      "score": 2,
      "body": "Did I math right? You're holding more than a million bucks worth?",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rurd0/",
      "created": 1714391417,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1sllk4",
      "score": 2,
      "body": "As someone that's had various hold position in Intel from 2018 until the start of 2024 I won't say no to buying it at 20 something dollars a share but unless you know when it's going to be at its lowest point and have knowledge of a surefire turn around, it's money that's gonna sit there. if you aren't doing options- and there's more profitable opportunities over the course of a year in the mean time. Their primary rivals are at or above what they are currently capable of producing so it's a waiting game of what does Intel have to show for all of their work, and what do banks and investors think of their efforts.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sllk4/",
      "created": 1714402516,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1spawe",
      "score": 2,
      "body": "Intel doubling revenue over the next 6 years would be barely beating inflation.\n\nJust look at how many times Intel has record breaking revenue through the 2010s and realize it doesn't mean shit because once adjusted for inflation Intel has basically been coasting.\n\nIntel needs to project significantly increased revenue in the next few years and then follow through with it. Then it'll be seen as a growth stock rather than the steady eddy blue chip that it is right now.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1spawe/",
      "created": 1714403824,
      "depth": 0,
      "replies": [
        {
          "id": "l1sq34y",
          "score": 3,
          "body": "Doubling the revenue with finished construction on the fabs should give them as I wrote between 6 to 8 eps at 2030, that is first and foremost deep value stock.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sq34y/",
          "created": 1714404096,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l1tv15e",
      "score": 2,
      "body": "I just said the same to my uncle who wants me to take the 8% loss and go out. My response, I tripledmy long position. It will come. \n\nI missed my chance with AMD, before they revealed ryzen, and ThermoScientific, when they bought invitrogen. I won't let that happen again.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1tv15e/",
      "created": 1714417996,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l5l51qp",
      "score": 2,
      "body": "Thanks for the post. I’m defn avoiding Intel now",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l5l51qp/",
      "created": 1716624349,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1s1qug",
      "score": 6,
      "body": "Holy shit, what is going on with this sub doubling down on Intel? Do you guys listen to the earnings calls? They are projecting flat y/y guidance while calling themselves the leaders in AI segments. This is during a time tech companies are telling us they are “aggressively” increasing cloud/DC and AI spending. \nThe CEO keeps claiming “this is the bottom” during these calls. He said this two years ago, more recently 2 earnings calls ago.. and then again last week. The government keep giving them money, and they still can’t get it together. \nIF they make the right decisions today, we aren’t going to see the effects for several years. Fabs take 3-5 years to build and get online. On the call they even said this - they mentioned 2030 as the turn around period. 2030!!!\n\nYou guys must have some serious bags and zero brains. Honestly this is baffling even for WSB.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s1qug/",
      "created": 1714394751,
      "depth": 0,
      "replies": [
        {
          "id": "l1s583x",
          "score": 3,
          "body": "You obviously didn't read, my entire point is holding and keep buying till 2030",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s583x/",
          "created": 1714396273,
          "depth": 1,
          "replies": [
            {
              "id": "l1s5gtl",
              "score": 5,
              "body": "So you plan to make no money/lose money for the next 6 years? You would be much better off investing in the index until then.",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s5gtl/",
              "created": 1714396373,
              "depth": 2,
              "replies": [
                {
                  "id": "l1s5p0d",
                  "score": 3,
                  "body": "I forecast intel return in the long run will be better then major index that's my entire point as cheap valuation to opportunity",
                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s5p0d/",
                  "created": 1714396468,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l1rtgmj",
      "score": 4,
      "body": "You have 38k shares at $32.2 and yet you're waiting for your next paycheck to buy. People with millions don't talk talk about waiting for their next paycheck.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rtgmj/",
      "created": 1714390741,
      "depth": 0,
      "replies": [
        {
          "id": "l1s4ggv",
          "score": 5,
          "body": "You be surprised how many with that or more sum of money still keep investing each month for better wealth in the future",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1s4ggv/",
          "created": 1714395950,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l1r0an4",
      "score": 6,
      "body": "Without a trust fund, you're not getting rich.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r0an4/",
      "created": 1714370402,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1r4r3s",
      "score": 4,
      "body": "Position or ban?\n\n\nSaw someone say nvidia would drop hugely in price the next 2 years is that because intel build the future?",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r4r3s/",
      "created": 1714373453,
      "depth": 0,
      "replies": [
        {
          "id": "l1r5ds0",
          "score": 3,
          "body": "Wrote my position",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1r5ds0/",
          "created": 1714373907,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l1ri5v3",
      "score": 4,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1ri5v3/",
      "created": 1714383639,
      "depth": 0,
      "replies": [
        {
          "id": "l1riiod",
          "score": 6,
          "body": "Not true about no one will use Intel foundry, already confirmed several big clients including Microsoft.\nAlso I'm going tell you lil secret, Nvidia going split their demand between tsmc and Intel in the future, this one might takes more time since Intel need to utilize also arm designs at their foundry services.",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1riiod/",
          "created": 1714383903,
          "depth": 1,
          "replies": [
            {
              "id": "l1rj9zj",
              "score": 5,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rj9zj/",
              "created": 1714384460,
              "depth": 2,
              "replies": [
                {
                  "id": "l1rk9w4",
                  "score": 9,
                  "body": "That's the beauty, they don't have to entirely match tsmc prices in foundry services.\nThere is strategic understanding in the west to not hold all the eggs on TSMC. Since Intel is the only western manufacturer (Samsung is korean)  that is in the picture beside tsmc for the next 10 years, you know that customers will be heading into Intel way.\nAlso as the foundry customers pov, it is better for the future competition on the price to split demand between 2 suppliers instead of throwing it all on 1.",
                  "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rk9w4/",
                  "created": 1714385168,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l1rij6c",
              "score": 1,
              "body": "Let them rot, who cares.",
              "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rij6c/",
              "created": 1714383912,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l1siyid",
      "score": 2,
      "body": "I have the same opinion here on Intel. You are not getting rich buying this year or even next year but before the turn of the decade Intel is gonna 2x - 3x at the minimum. The government is dumping too much into making them a global foundry competitor to TSM.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1siyid/",
      "created": 1714401575,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1t2s1g",
      "score": 2,
      "body": "https://preview.redd.it/z26ho4ae4gxc1.jpeg?width=1290&format=pjpg&auto=webp&s=4877a8c83c3c86ff6919015f5ed3376777a4999a",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1t2s1g/",
      "created": 1714408407,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1rsm9w",
      "score": 3,
      "body": "If Intel was guaranteed profitability because of their chips, the US government wouldn’t have stepped in to support them because PE firms would have been all over it. The reason Intel is getting money from Uncle Sam is because this is probably not going to pan out, but the US needs to capacity just in case.\n\nLook at nvda, smci, etc => share price goes up and they raise money from investors at high valuations because everyone knows they’re going to be profitable for the foreseeable future.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rsm9w/",
      "created": 1714390294,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1rv2iz",
      "score": 2,
      "body": "Intel bagholders kill me. By the time intc is even ready to compete we will be investing in something other than ai stocks. This boom will be ancient history. Remember metaverse? Intel fukked up, they missed the boat.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rv2iz/",
      "created": 1714391574,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1rq0b4",
      "score": 1,
      "body": "Shares I guess",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rq0b4/",
      "created": 1714388832,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1rqawb",
      "score": 1,
      "body": "You'll own nothing and be happy in 2030\nYou'll be the happiest",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rqawb/",
      "created": 1714389004,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1rtns2",
      "score": 1,
      "body": "!RemindMe in 5 years",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rtns2/",
      "created": 1714390844,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1ruoqf",
      "score": 1,
      "body": "Why don't you buy soxl?",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1ruoqf/",
      "created": 1714391380,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1rw20q",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1rw20q/",
      "created": 1714392065,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1sc909",
      "score": 1,
      "body": "Than*",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sc909/",
      "created": 1714399084,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1sdc67",
      "score": 1,
      "body": "My FA is super high on Intel",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sdc67/",
      "created": 1714399500,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1sdme6",
      "score": 1,
      "body": "TL;DR do the opposite of whatever he just said.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sdme6/",
      "created": 1714399608,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1sf8tt",
      "score": 1,
      "body": "Intel is a long hold game I know a few plants are being built here in the US and over seas, if they can get those operational quickly they might be useful by end of 2025 and should double or triple the stock because I need a break from these losses",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sf8tt/",
      "created": 1714400217,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1sffcv",
      "score": 1,
      "body": "105 shares here at $34, if we can even get up to $50 again or $60 I think that's still a nice profit.\n\nwondering if it ever catches that AI wave of NVDA or catch up to AMD.\n\n  \nAlso having to consider market caps not just stock price, when the the other prices may be higher but also may be less shares in existence as well.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sffcv/",
      "created": 1714400286,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1sghv4",
      "score": 1,
      "body": "Buy under 25",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sghv4/",
      "created": 1714400674,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1sid3s",
      "score": 1,
      "body": "So this is an interesting accounting question. They are reporting billions in \"operating losses\" which I don't believe actually includes the capex from building new foundries. But someone smarter than me should confirm",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sid3s/",
      "created": 1714401358,
      "depth": 0,
      "replies": [
        {
          "id": "l1sj6q1",
          "score": 2,
          "body": "IT IS now as part of Intel Foundry segment",
          "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sj6q1/",
          "created": 1714401657,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l1sktyl",
      "score": 1,
      "body": "Meet some people working at Intel. They are a bunch of cocky entitled know-it-all engineers feeling superior to others while consistently underdelivering, basically living in a bubble. Reality often humbles first then things might actually change for the better.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sktyl/",
      "created": 1714402245,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1sltk2",
      "score": 1,
      "body": "Yes, please purchase and hold the stock. Please inflate the stock price to $9 by 5/6. Because reasons.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sltk2/",
      "created": 1714402596,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1snd8i",
      "score": 1,
      "body": "me and my brain cell agree",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1snd8i/",
      "created": 1714403143,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1soxxf",
      "score": 1,
      "body": "I just bought some last week. Now this. Im fucked",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1soxxf/",
      "created": 1714403699,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1spmnh",
      "score": 1,
      "body": "I doubled down on this piece of shit, and on $ADBE too. Hope they pay for my summer holidays.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1spmnh/",
      "created": 1714403938,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1ss5lo",
      "score": 1,
      "body": "TLDR: PLZ BUY MY BAGS",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1ss5lo/",
      "created": 1714404804,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1ssy09",
      "score": 1,
      "body": "I believe in it but good lord this stock just doesn't move",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1ssy09/",
      "created": 1714405074,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1ssz0f",
      "score": 1,
      "body": "INTC in the 25-30 range imo is a no-brainer that'll obviously net you a decent amount by the early 2030s.\n\nThe question is just one of the time-value of money. If INTC@30 IN 2024 could **easily** at least double your money by 2030, where there other opportunities that you missed that could've been more fruitfall over that 6 year period?\n\nIdk. I'm confident enough that I put about 8% of my portfolio in INTC@32 average",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1ssz0f/",
      "created": 1714405083,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1su97i",
      "score": 1,
      "body": "I think Intel is a \"safe\" investment. This is of course looking down the road 2+ years.\n\n\nBut since it's a \"safe\" investment -- I won't touch it.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1su97i/",
      "created": 1714405519,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1sxnhb",
      "score": 1,
      "body": "Reads like an Arkk Invest speech by Cathie Wood",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1sxnhb/",
      "created": 1714406666,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1t4hww",
      "score": 1,
      "body": "Id consider buying INTC but i think there are other companies with better outlook. Also, im broke.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1t4hww/",
      "created": 1714408990,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1t7wwo",
      "score": 1,
      "body": "Proud intel bag holder",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1t7wwo/",
      "created": 1714410136,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1t9w4o",
      "score": 1,
      "body": " One word; Mimzy.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1t9w4o/",
      "created": 1714410811,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1tbqz9",
      "score": 1,
      "body": "As an Oregonian, I love this write up.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1tbqz9/",
      "created": 1714411435,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1tew5p",
      "score": 1,
      "body": "Remember when people were crying when AMD were 5$? Lmfao ",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1tew5p/",
      "created": 1714412491,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1tgaui",
      "score": 1,
      "body": "Not into Intel but I’m into how hyped you are about it. In the spirit of WSB, I’ll buy some calls",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1tgaui/",
      "created": 1714412968,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1tldxh",
      "score": 1,
      "body": "I mean it all sounds good but the stock is definitely not cheap. It was priced in with all the ai Bs which did not plan out. The stock is on normal price imoz buying this is no better than buying sp500. So i fail to see the opportunity here. Buy and hope everything goes according to plan for the next 6 years? Rather put it on black",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1tldxh/",
      "created": 1714414706,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1toq99",
      "score": 1,
      "body": "PUTs till 20's has been my strategy and since this regard posted holding to PUTs till mid 20's will definitely  make me money",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1toq99/",
      "created": 1714415846,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1u1t0r",
      "score": 1,
      "body": "It seems like intel and private equity have teamed up to help everyone get rid of their 401k",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1u1t0r/",
      "created": 1714420333,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1u2dcl",
      "score": 1,
      "body": "Can y’all push the IV higher so I can thetagang and make money",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1u2dcl/",
      "created": 1714420527,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1uagb4",
      "score": 1,
      "body": "BRO WHY IS INTEL DROPPING BRO IM GONNA DIE BRO WHAT THE FUCK BRO",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1uagb4/",
      "created": 1714423317,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1un8bp",
      "score": 1,
      "body": "damnit. Is intel a cult stock now? Guess I should drop my bags now before this shit goes under",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1un8bp/",
      "created": 1714427878,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1uscis",
      "score": 1,
      "body": "https://preview.redd.it/7x856f73whxc1.jpeg?width=938&format=pjpg&auto=webp&s=4c47f4c636780fc1a5bc2759748149ec6957404a",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1uscis/",
      "created": 1714429825,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1va131",
      "score": 1,
      "body": "I genuinly dont trust intel as a long term investment. I feel as if there are to many problems with there product in particular. I also feel the people who run it are untrustworthy even in comparison to other companies.",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1va131/",
      "created": 1714436876,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1wm2rc",
      "score": 1,
      "body": "Were you long Enron and Lehman because 'never bet against america'?\n\nAny guy who tries to push a trade with trite arguments   and by boasting about his (mostly imaginary) past successes deserves my downvote!",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1wm2rc/",
      "created": 1714459336,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1x9zx1",
      "score": 1,
      "body": "Why can't OP say fuck?",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1x9zx1/",
      "created": 1714476071,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1y4l8v",
      "score": 1,
      "body": "It’s never too late to stop loss and relocate that money into a firm that will grow it all back for you! 💵💵💵",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1y4l8v/",
      "created": 1714488792,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l1y4uji",
      "score": 1,
      "body": "Lost 36k in a famous Pharma ; sold it; bought NVIDIA; lose recouped and then some!",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/l1y4uji/",
      "created": 1714488881,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg5w4m5",
      "score": 1,
      "body": "How’s this play working out so far?",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/lg5w4m5/",
      "created": 1722616450,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg5zyxb",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1cfrrec/intel_the_opportunity_of_this_decade_for_retails/lg5zyxb/",
      "created": 1722617649,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "The post discusses Intel as a significant investment opportunity due to its transition phase and future growth potential.",
    "companies": [
      "Intel",
      "Facebook",
      "Microsoft",
      "AMD"
    ],
    "tickers": [
      "INTC",
      "META",
      "MSFT",
      "AMD"
    ],
    "main_ticker": [
      "INTC"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "The post argues that Intel is a valuable long-term investment opportunity despite negative Wall Street sentiment, urging consistent stock purchases.",
    "stock_recommendations": "The user is recommending to buy Intel stock.",
    "is_recommending_stock_buying_or_selling": true,
    "buy_or_sell": "buy",
    "sentiment_summary": "There is positive sentiment as the author is optimistic about Intel's future and advises buying the stock as a strategy against Wall Street's negative outlook.",
    "sentiment": "positive"
  }
}