{
  "title": "AMD's Q1 Call... the good, bad & ugly",
  "score": 127,
  "selftext": "Regarded WSB Community,\n\nThis is a post regarding AMD's call.\n\nRevenue in Q1 slightly beat expectations... so did EPS. Margins are getting better. All good execution.   \n\nThe guidance is decent, considering there are some **BAD** moving parts which I'll cover below.   \n\nI'll share the Good, Bad & Ugly starting backwards...   \n\n\\------------------------------------------------------------------------------------------------------------------------\n\nThe **UGLY**: **GAMING** \n\nGaming got killed in Q1 and will continue hurting. Why?   \n\n* PS5 pro preparing to launch this year (so consumers hold purchases).   \n* Gaming GPUs sell less due to new gaming architectures launching this year, with RDNA4 being teased in Computex in 5 weeks.     \n \n\n**This explains why gaming dropped by 48% (and will continue dropping in Q2).**\n\n**However, this is NOT a reason to be concerned, because:** \n\n* The Sony PS5 PRO will sell strong at launch... and will likely be hard to buy (as usual).   \n* RDNA4 will sell STRONG, as AMD will only target the mid-range (no high-end this gen).   \n* Gaming has low margins.\n\n\\------------------------------------------------------------------------------------------------------------------------\n\nThe **BAD**: Supply constraints impacting MI300   \n\nDuring minute 38 of the call (probably the most important item  discussed), while answering Vivek Arya's question (Bank of America), Dr.  Lisa Su explained that MI300 has more demand than supply also for Q2.  In essence, AMD can't sell enough due to supply constrains. AMD expects  supply to improve in the back half of the year, which is why they **raised the guidance** for over $4bn sales (up from $3.5bn).   \n\n**However, this is NOT a reason to be concerned, because:** \n\n* Demand exceeding supply means that the MI300 series is COMPETITIVE.   \n* As supply improves, so will sales... explaining why MI300 is doing **STRONG**.   \n* Supply will catch-up with demand in 2024, making it possible to exceed the \"over $4bn\" figure.   \n\n\\------------------------------------------------------------------------------------------------------------------------\n\nThe **GOOD: Data center GPUs, CPUs and MARGINS** \n\nThe most profitable and KEY products are selling **STRONG**.   \n\nMI300 is a success... and the ONLY reason why AMD didn't sell more  was due to supply constraints. Also, Turin is sampling and the Data  Center segment remains STRONG.   \n\nGrowth of 80% year over year is impressive... with **STRONG** double digit growth for 2024 guided.   \n\n\\------------------------------------------------------------------------------------------------------------------------\n\n**Conclusion:** \n\nAMD is supply constrained on MI300 products... but they were still  able to compensate the gaming segment (dropping 48%) and also embedded  (dropping 46%).   \n\nIt is likely that  $227 is a ceiling that will take many months to break.   \n\nAlso, today was a **BAD** day for markets, marking the close of the worst month of 2024.   \n\nHowever, guidance for MI300 sales is 2024 is up... to \"over $4bn\" (from $3.5bn).   \n\nI would've wanted to hear $5bn, but I'll likely have to wait until the Q2 ER, as supply improves.   \n\nThe stock will likely bleed tomorrow, but the core of AMD's thesis is still **STRONG**.",
  "link_flair_text": "DD",
  "id": "1ch88j6",
  "num_comments": 68,
  "created_utc": 1714522480,
  "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/",
  "comments": [
    {
      "id": "l20rw6w",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 183 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/) \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l20rw6w/",
      "created": 1714522482,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l20tit3",
      "score": 154,
      "body": "OP must have his life savings in AMD calls.",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l20tit3/",
      "created": 1714523118,
      "depth": 0,
      "replies": [
        {
          "id": "l218djw",
          "score": 102,
          "body": "**However, this is NOT a reason to be concerned, because:**\n\nI have calls. Please don't sell anymore\n\n-OP, probably.",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l218djw/",
          "created": 1714528848,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l21fqrk",
          "score": 12,
          "body": "This is no time for AMD calls, I don't know why anyone even tries. Maybe Q1 2025 they will have some results and a big ramp trajectory to show for AI. There's no reason to think there could be a catalyst before then.",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21fqrk/",
          "created": 1714531832,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l21infy",
          "score": 3,
          "body": "He bought the dip? Dahmp iet",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21infy/",
          "created": 1714533115,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l21ldof",
      "score": 18,
      "body": "Embedded, cyclical, down now, suffering from COVID double ordering overhang. Probably recovery end of year. Good business, not exciting.\n\n\nGaming, consoles cannot make the kind of profits AMD needs to grow into its market cap. PC graphics are hopeless and they haven't shown a willingness to do the massive investments needed to *maybe* compete with Nvidia's healthy gaming business someday. AMD has ~0% market share in gaming laptops and that's half of the TAM. Nvidia runs this segment and AMD's ~10% market share has thrown it into a vicious cycle where customers won't buy it, game developers won't thoroughly test and optimize for it, AMD won't invest into it because the revenue isn't there. It's bad, bad, bad.\n\n\nServer CPUs, suddenly it's a slow growth business. All big investment is going to AI instead. AMDs big selling point is not doing more computing to make customers more money, it's telling customers to buy one chip to replace 2 or 3 of their old chips and save space and energy. Good for customers but AMD is working their own way out of a job. People have been dooming about ARM taking over for a decade but massive cloud platforms are all finally settling on ordering custom chips for large parts of their spend. AMD has great products here but it's not going to bring disruptive growth anymore.\n\n\nClient has been all over the map since COVID. Direct CPU sales to consumers have been good but Intel has walked all over AMD in actual sales to OEMs, even when their chips were inferior. In fact it's the only thing bankrolling Intel's turnaround attempt now. The jury is out here, AMD is expanding product offerings later this year, time will tell if their sales team has figured out their own deficiencies. \"AI PCs\" simply don't matter now and when they finally matter someday, Intel will be the one to bring it to customers in volume in the most premium laptops. That's just how it has always worked.\n\n\nSo the only bright spot is AI. AMD is competitive enough to sell, but capacity is holding up the show. If AMD took a big gamble on supply, maybe this is a major growth driver in 2025 but big gambles are the opposite of their investment strategy for the last 10+ years. NVDA bet big on supply and got ahead of customer demand last year.\n\n\nI'm in all shares at 70 average cost basis, having added some at the last dip down to 60 and back up to 100. I'm looking at the big pile of meh and wondering how long it's going to be until the market declares AMD dead money and smacks it back below 100.",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21ldof/",
      "created": 1714534351,
      "depth": 0,
      "replies": [
        {
          "id": "l22kyq2",
          "score": 3,
          "body": "\n>AMD is competitive enough to sell, but capacity is holding up the show.\n\nLisa stated for the full year they are not supply constrained. What is the reason that the orders for MI300 are only raised by 500M to 4B ? Considering the lead times for high volume productions, these orders should already have been placed unless hyperscalers decided to bring their money to NVDIA. \nIt seems that the massive Capex expansion from hyperscalers goes essentially to Nvdia which takes entire market.",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l22kyq2/",
          "created": 1714557934,
          "depth": 1,
          "replies": [
            {
              "id": "l22s0nc",
              "score": 5,
              "body": "Nvidia has been ramping the business for a decade and kicked it into overdrive before H100 launch. They started earlier and from a much higher base, and committed a lot more cash to the cause.\n\n\nThis is still probably the most aggressive move AMD has ever done, at least in the Su era. They've got several billion committed to ramping up this product which is kinda nuts considering how small of a market niche their datacenter GPUs have been in the past and how novel the MI300 family architecture is.",
              "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l22s0nc/",
              "created": 1714562362,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l21ldpf",
          "score": 3,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21ldpf/",
          "created": 1714534351,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l224eem",
          "score": 3,
          "body": "Who the fuck buys gaming Laptops",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l224eem/",
          "created": 1714545394,
          "depth": 1,
          "replies": [
            {
              "id": "l22b4tn",
              "score": 3,
              "body": "Regards, look around, there’s more than you Think. ",
              "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l22b4tn/",
              "created": 1714550413,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l23jtmm",
              "score": 2,
              "body": "yeah unironically\n\nits such a weird thing to buy because why the fuck are you gaming on travel in most cases?\n\nI bought a $260 open-box laptop for \"gaming\" when I do work travel, but I would never think of spending like $1500+ on something like this because I am rarely if ever going to use it.\n\nnevermind the fact that you can build an absolute fucking behemoth of a gaming desktop for so cheap even with covid inflation. NVDA RTX 4060 is an absolute beast of a graphics card for only like $300-$350, and you only need another $1K or so to play most of even the top games at this point at like 1080p at a minimum",
              "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l23jtmm/",
              "created": 1714574363,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l22zrfo",
              "score": 1,
              "body": "I do.. but not for gaming, for developing.",
              "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l22zrfo/",
              "created": 1714566272,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l23dlaf",
              "score": 1,
              "body": "Everyone who doesn't have a stable living place for example students that need pc for studies but also want to game.\n\nEasy solution for parents, why would they trust to give their kid anything but the ready product.\n\nPeople who are too lazy and stupid to learn how to build PCs, they think gaming laptop is probably going to be fine, basically me 10 years ago.",
              "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l23dlaf/",
              "created": 1714572037,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l25196u",
              "score": 1,
              "body": "Zephyrus G14 is an excellent laptop.",
              "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l25196u/",
              "created": 1714592650,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l24bjsi",
          "score": 1,
          "body": "Right. Same position here.",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l24bjsi/",
          "created": 1714583886,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l20rz1x",
      "score": 59,
      "body": "Money is tight all around, it's every man for himself.",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l20rz1x/",
      "created": 1714522513,
      "depth": 0,
      "replies": [
        {
          "id": "l22jxyr",
          "score": 11,
          "body": "You're not a man",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l22jxyr/",
          "created": 1714557204,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l20z212",
      "score": 20,
      "body": "May we have a lil look at your bags?",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l20z212/",
      "created": 1714525282,
      "depth": 0,
      "replies": [
        {
          "id": "l23zv69",
          "score": 1,
          "body": "Wendy coupons sir",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l23zv69/",
          "created": 1714579941,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l20ujmi",
      "score": 31,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l20ujmi/",
      "created": 1714523518,
      "depth": 0,
      "replies": [
        {
          "id": "l249jib",
          "score": 0,
          "body": "Nope, it isn’t. It’s great, but not spectacular.",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l249jib/",
          "created": 1714583203,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l21q13b",
      "score": 12,
      "body": "Advanced Money Destroyer strikes back",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21q13b/",
      "created": 1714536600,
      "depth": 0,
      "replies": [
        {
          "id": "l23jvqg",
          "score": 1,
          "body": "actually a tale as old as time",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l23jvqg/",
          "created": 1714574384,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l219tne",
      "score": 11,
      "body": "AMD recently became my largest holding because they’re down so much from the highs and I plan to buy until the bottom happens. I think they improve sales numbers as supply increases which will obviously help the eps numbers that everyone wants. I think half of the draw down is from the supply issue (there’s no way the big money didn’t already realize the supply was struggling long before the earnings call) and half of the draw down is from the markets overall having a drawdown. Maybe not exactly 50/50 but that’s how I’m feeling about it. \n\nI’m not willing to play any contracts on it cause I have no idea when things are going to improve but I’m confident that AMD is going to be competitive and see another bull cycle. \n\nWhen it sees improvement of like 5% I’d probably enter a long leap but still don’t want to try to time when the increases happen with weeklies or even monthlies. Confident in a 12 month window of share ownership though. \n\nCurrent position - 20 shares (average basis $158.03) \n\nThanks for sharing your thoughts. Let me know if you disagree with what I’m saying and why, I’m always open to new viewpoints and perspectives because I could definitely be wrong.",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l219tne/",
      "created": 1714529402,
      "depth": 0,
      "replies": [
        {
          "id": "l21pdyj",
          "score": 3,
          "body": "I remember years ago at 5 bucks a share being a late teen thinking you can't go wrong. I stayed away from stocks. Then at 50 bucks I thought wow hot damn. And here we are. I bought in at like 160. Just gonna hold. Amd is a competitor to Nvidia and Intel. I'm sure in a year or 2 it'll be up and up. May not do what Nvidia did price wise but it's a solid company.",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21pdyj/",
          "created": 1714536280,
          "depth": 1,
          "replies": [
            {
              "id": "l23byzo",
              "score": 2,
              "body": "I bought in at 174 and held till it was 227.didnt sold because was thinking it will hit 250.but fuck now its way down.",
              "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l23byzo/",
              "created": 1714571416,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l23h4zq",
          "score": 1,
          "body": "Down so much from high? That is all you are going for?\n\n5.5 bil revenue with $123 million net income what are these baby numbers for a company with 255b market cap that should be growing like insane?\n\nWhat i don't understand is how the stock is still so high. May god have mercy on us.",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l23h4zq/",
          "created": 1714573380,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l22f5sh",
      "score": 5,
      "body": "no sympathy from Intel bagholder. You guys deserve that too",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l22f5sh/",
      "created": 1714553585,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l21dyvs",
      "score": 3,
      "body": "Seems like AMD always has a misfiring segment or two😩",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21dyvs/",
      "created": 1714531079,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l212cdl",
      "score": 13,
      "body": "Gaming down 48% (33% sequentially). \n\nEmbedded segment down 46% (20% sequentially)\n\nClient segment up 85% but down 6% sequentially.\n\nBright spot is data center segment but only 2% increase sequentially.\n\n7 cents EPS (down 83% sequentially)\n\nEven Non-GAAP is down 19% sequentially and up only 3% y/y\n\nOnly 40% of revenue is from data center/GPU, not exactly a company that's humming on all cylinders entering the AI era. \n\nAMD is more like Intel, a bunch of non-AI related chips that will always drag around their neck like an albatross.",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l212cdl/",
      "created": 1714526562,
      "depth": 0,
      "replies": [
        {
          "id": "l21lxi4",
          "score": 15,
          "body": "On the last point, AMD doesn't face the massive CAPEX challenges that Intel faces. If AMD sells fewer chips, they just make less profit. Intel sells fewer chips, the cost of their fabs make them bleed.",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21lxi4/",
          "created": 1714534608,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l20xxtx",
      "score": 8,
      "body": "Okay see you at 133.75",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l20xxtx/",
      "created": 1714524854,
      "depth": 0,
      "replies": [
        {
          "id": "l21is4c",
          "score": 5,
          "body": "You mean... *checks sheets* 125",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21is4c/",
          "created": 1714533175,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l20zkin",
      "score": 6,
      "body": "Aww that's okay you'll get through this. Don't give up![img](emote|t5_2th52|18630)",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l20zkin/",
      "created": 1714525479,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l20svfr",
      "score": 4,
      "body": "137 ish and I’m in",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l20svfr/",
      "created": 1714522863,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l212hhq",
      "score": 2,
      "body": "Where are your positions?",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l212hhq/",
      "created": 1714526617,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l217vyd",
      "score": 2,
      "body": "![img](emote|t5_2th52|18630)![img](emote|t5_2th52|18630)![img](emote|t5_2th52|18630)![img](emote|t5_2th52|18630)![img](emote|t5_2th52|18630)",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l217vyd/",
      "created": 1714528664,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l21q9l5",
      "score": 2,
      "body": "i like entering 6/21 calls when it hits 144-150. maybe tomorrow.",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21q9l5/",
      "created": 1714536717,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l21tvyy",
      "score": 2,
      "body": "Supply constraint is an industry issue if you listened carefully",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21tvyy/",
      "created": 1714538668,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l23827f",
      "score": 2,
      "body": "Buying the dip on payday and holding long.",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l23827f/",
      "created": 1714569860,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l23pr0h",
      "score": 2,
      "body": "The big problem that amd fanboys dont get amd has net margins of a car company not tech company ,amd is using nvidia hype for future grown but numbers dont add just put into a perspective nvidia had 60 billion revenue and 28 billion net profit for 2023 that 48% net margin ,amd had 22 billion revenue and not even 1 billion net profit with net margin of 4 %",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l23pr0h/",
      "created": 1714576465,
      "depth": 0,
      "replies": [
        {
          "id": "l26jz1n",
          "score": 1,
          "body": "Exactly. Intel and amd execution is hilariously bad compared to companies like nvidia and Broadcom. Don’t know why people believe pat when he was in engineering leadership positions when intel fell behind then badly managed VMware and is back at intel over promising and under delivering. People on Reddit believe him for some reason. ",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l26jz1n/",
          "created": 1714613194,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l214vtj",
      "score": 2,
      "body": "So what strike should a regarded person sell an amd put at tomorrow that expires Friday to catch the bottom and be potentially assigned? To sell a covered call thereafter?",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l214vtj/",
      "created": 1714527528,
      "depth": 0,
      "replies": [
        {
          "id": "l214wvy",
          "score": 14,
          "body": "Interesting tactic, but why play the market when you can simply beg on the street?",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l214wvy/",
          "created": 1714527539,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l219mhs",
          "score": 2,
          "body": "I'd say 7% under morning price for the strike, and hold selling covered calls until next Wednesday.  I'd put that wheel out till Friday, set for next week.  Likely a Monday spike that evaporates Monday, with at least another 5%, week over week.  To be honest, I'd wait at least another week in pursuit of assignment, because unless J Pow and friends decide to reduce interest tomorrow, stable stocks should lose at least (**at least!**) another 2% or 3% this week.  AMD is not a stable stock at the moment, so its fall should be double or triple its peers in a drop tomorrow due to sell-offs.",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l219mhs/",
          "created": 1714529323,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l21m158",
          "score": 2,
          "body": "120 and get ready to have it assigned after FOMC",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21m158/",
          "created": 1714534654,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l21a014",
      "score": 3,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21a014/",
      "created": 1714529471,
      "depth": 0,
      "replies": [
        {
          "id": "l21fvdy",
          "score": 4,
          "body": "It will sell great but only if the economy goes to shit and everyone gets another $1k stimmy check.",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21fvdy/",
          "created": 1714531887,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l21dt2z",
          "score": 1,
          "body": "Haha I thought this as well ",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21dt2z/",
          "created": 1714531010,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l229lv1",
      "score": 2,
      "body": "AMD si now new INTC.Giving weak guidance for next quarter.",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l229lv1/",
      "created": 1714549240,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l22cm5i",
      "score": 2,
      "body": "AMD is only at like 25% server market share, imo they have a lot of room to grow in the commercial space.",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l22cm5i/",
      "created": 1714551584,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l21bpka",
      "score": 1,
      "body": "[removed]",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21bpka/",
      "created": 1714530152,
      "depth": 0,
      "replies": [
        {
          "id": "l21bqjw",
          "score": 3,
          "body": "It's always a gamble, but if you're feeling lucky, go for it.",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21bqjw/",
          "created": 1714530163,
          "depth": 1,
          "replies": [
            {
              "id": "l2jzc18",
              "score": 1,
              "body": "I took some gains, I was up over 1k but I took like 200 in gains. I revenged my lost gains on qqq 0dte and made like $700. Played nvidia 0dte calls and made 1k. Good week. Time to pick it up again next week.",
              "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l2jzc18/",
              "created": 1714836289,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l21wbh0",
      "score": 1,
      "body": "I bought calls and sold Monday, made a nice profit.",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21wbh0/",
      "created": 1714540087,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l22ybx4",
      "score": 1,
      "body": "What supply chain issues? Freight companies are in a recession and everyone is thirsty to move freight, I can guarantee you there’s no supply chain issues. You can’t keep issuing that 2020 excuse forever because nobody is buying your garbage",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l22ybx4/",
      "created": 1714565589,
      "depth": 0,
      "replies": [
        {
          "id": "l249orf",
          "score": 1,
          "body": "It’s an industry wide issue",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l249orf/",
          "created": 1714583253,
          "depth": 1,
          "replies": [
            {
              "id": "l26jinf",
              "score": 1,
              "body": "Except fabless competitors like nvidia and Broadcom don’t have the same issues. amd and intel do not execute like their competitors. They are badly managed companies ",
              "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l26jinf/",
              "created": 1714613009,
              "depth": 2,
              "replies": [
                {
                  "id": "l274ca2",
                  "score": 2,
                  "body": "Nvda has the same issue. I literally invest in both AMD and NVDA",
                  "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l274ca2/",
                  "created": 1714622033,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l26kiht",
      "score": 1,
      "body": "How do you explain nvidia having annual datacenter revenue approaching 80 billion while amd is projecting maybe 4 billion in AI revenue? How does that make you bullish on amd. Amd has only has like 10% gpu market share they are a joke",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l26kiht/",
      "created": 1714613412,
      "depth": 0,
      "replies": [
        {
          "id": "l2h8ewb",
          "score": 1,
          "body": "The \"over $4bn\" statement was made for a single product family. The MI300.\n\nThey also sell MI250 accelerators, as well as datacenter serial processing units (EPYC server CPUs).\n\nThis is to explain why your statement is incorrect.\n\nDatacenter revenue for AMD comprises more than 1 product. Not just parallel compute (GPUs), but also serial compute (CPUs), where EPYC continues growing and taking market from Intel.\n\nThe MI300 operates with an **open code** ecosystem (ROCm), used by Microsoft, Meta, Oracle, etc. and under heavy supply constraints (they can't meet demand yet). This is why the product continues ramping.\n\nLate last year, AMD estimated MI300 revenue for 2024 to be $2bn... earlier this year they raised the number  to $3.5bn. Earlier this week, they said **over $4bn**. See a trend? They will raise the number again next quarter.\n\nBofA and Citibank said AMD was sandbagging... and they expect $7bn in MI300 revenue alone.\n\nIn addition, AMD's client segment (enterprise PC's and Laptops) grew by 85% year over year. This segment comprises PCs/laptops that corporations buy for their workforce... which are replaced regularly, specially now with new software uses (e.g. Microsoft copilot), which require more TOPS compute for AI\n\nLastly, gaming will have the PS5 Pro launching later this year, as well as new handheld PCs and consumer laptops, which take market from Intel. Read about Strix & Strix Halo, incredible products launching soon.\n\nAMD doesn't need to be #1 in GPUs... just like they didn't need to be #1 in CPUs to outshine Intel.\n\nYou may see AMD as a joke, but Microsoft, Meta, Oracle, Tesla and Sony do not.",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l2h8ewb/",
          "created": 1714784028,
          "depth": 1,
          "replies": [
            {
              "id": "l2h8g2z",
              "score": 1,
              "body": "Peasants will believe whatever they want.",
              "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l2h8g2z/",
              "created": 1714784042,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l21ih9i",
      "score": 1,
      "body": "Good summary.",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21ih9i/",
      "created": 1714533037,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l22nzyn",
      "score": 0,
      "body": "Amd will follow the path of Intel. Way to much focussed to fuck Intel and fucked Themself ![img](emote|t5_2th52|31226)",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l22nzyn/",
      "created": 1714559961,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l21eub4",
      "score": -5,
      "body": "Shit stock. Second rate company. Always has been. Were second fiddle to INTC for decades and now they are second rate in comparison to NVDA.",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l21eub4/",
      "created": 1714531448,
      "depth": 0,
      "replies": [
        {
          "id": "l249r2v",
          "score": 1,
          "body": "There’s always enough room for second best. I hold both AMD and NVDA stocks.",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l249r2v/",
          "created": 1714583275,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l22ffy3",
      "score": -1,
      "body": "You're right, saying a high demand/low supply product is bad is truly regarded indeed",
      "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l22ffy3/",
      "created": 1714553806,
      "depth": 0,
      "replies": [
        {
          "id": "l249vb4",
          "score": 1,
          "body": "It’s reality",
          "permalink": "/r/wallstreetbets/comments/1ch88j6/amds_q1_call_the_good_bad_ugly/l249vb4/",
          "created": 1714583314,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}