{
  "title": "Snowflake isn't worth $50 Billion Dollars",
  "score": 433,
  "selftext": "THESIS:\nThe issue with snowflake is that they’re a distributed data warehouse, not a distributed compute framework. \n\nHowever, distributed compute frameworks are more useful for complex “data science” tasks because most data needs to be ‘engineered’ before interesting analysis/machine learning can occur.\n\nThis post explores the idea that Snowflake is intentionally misleading investors by obfuscating the concrete services that they offer:\n\n- Snowflake DOES NOT offer a general purpose ‘distributed computing framework’ or ‘distributed compute runtime’.\n- Snowflake SHOULD NOT be compared to ‘spark’ in benchmarks\n- Snowflake DOES NOT (physically) store your data \n   - subtext: storing data in cloud object store is trivial\n\n\n\n\n\nTHE EVIDENCE/ANALYSIS I PROVIDE IS BASED OFF OF:\n\n- ~~- Carnegie Professor Andy Pavlo’s Snowflake lectures from his Advanced DB series~~\n\n\n- My opinions about misrepresented features that have limited real world utility\n- Misleading promotional information for investors\n- My (limited) experience using the product\n- Lack of substantive online discourse(Reddit, Youtube)\n\nDISCLOSURE: \n\n- I’ve held a long short position(<$8k) since ~December which I rolled over into a different long short position after the CEO resigned. Imo, the CEO resigning in February is worse in the long run for my position because it was a good business move. \n- FWIW, I don’t hold individual stocks; my entire portfolio is just VTI and this small amount of Snowflake puts. \n- I am a Software Engineer and I used Snowflake for a short period at work.\n\nMY CLAIMS: \n\n- Snowflake's differentiated utility is confusing to the lay investor, industry, and their own customers\n- Snowflake’s valuation should be closer to Vercel’s, in $5 - $10 billion range.\n\n\nThis Document Has All of My Notes So Far: \nhttps://docs.google.com/document/d/1SKBHX8Mpbwk9odplmycmC6Bgtr70ipNuszSUGcNNz20/edit?usp=sharing\n\nPlease offer brutal criticism and ask (specific, technical) questions! I want your opinions!\n\n\n---\n\nedit: after thinking about it, there is a fair amount of value in the management/governance side of the product(e.g. logging every query & job with a clear indication of the cost). Also, being able to selectively restrict the data which various employees can see. Though, this puts a lot of power(maybe too much) in the hands of the administrators.",
  "link_flair_text": "DD",
  "id": "1cirikp",
  "num_comments": 297,
  "created_utc": 1714685658,
  "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/",
  "comments": [
    {
      "id": "l2b48f7",
      "score": 351,
      "body": "Got it, snowflake is going to reach 350$ by November",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2b48f7/",
      "created": 1714686226,
      "depth": 0,
      "replies": [
        {
          "id": "l2cnwfc",
          "score": 83,
          "body": "Snowflake AIAIAIAIAIAIAIAI snowflake AI snowflake AI snowflake AI AI AI AI\n\nJust doing my part bro",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cnwfc/",
          "created": 1714709238,
          "depth": 1,
          "replies": [
            {
              "id": "l2cnwfz",
              "score": 23,
              "body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cnwfz/",
              "created": 1714709238,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l67mtxe",
          "score": 2,
          "body": "I agree but for a different reason - admin change",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l67mtxe/",
          "created": 1717007693,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2bdhg6",
      "score": 54,
      "body": "I ain’t reading all that but I’ll buy puts cuz it looks like you tried",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bdhg6/",
      "created": 1714689729,
      "depth": 0,
      "replies": [
        {
          "id": "l2be16v",
          "score": 6,
          "body": "thx fam <3",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2be16v/",
          "created": 1714689947,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2e8jq3",
          "score": 2,
          "body": "Calls",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2e8jq3/",
          "created": 1714742989,
          "depth": 1,
          "replies": [
            {
              "id": "l2e8lhy",
              "score": 2,
              "body": "Just to balance the universe I either become rich or you best of luck 🫶🏻",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2e8lhy/",
              "created": 1714743008,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l2bd21l",
      "score": 255,
      "body": "Im a software engineer too, worked with Snowflake for a while now and I very much dislike the software. However, Im convinced theyll make a shitton of money in the next few years because theyve succesfully duped a large amount of companies in thinking theyll fix their data science problems. Theres also a huuuuge influx in novice data scientists that will query their asses off trying to figure out quantum ESG analysis. Im looking at leap calls for 2026 precisely because I dislike this company and their tool.\n\n\nAlso lowkey expecting a buyout from MSFT or AMZN.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bd21l/",
      "created": 1714689559,
      "depth": 0,
      "replies": [
        {
          "id": "l2bpyhm",
          "score": 42,
          "body": "Why does any of the big cloud service provider need snowflake? They have their own offerings and better",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bpyhm/",
          "created": 1714694749,
          "depth": 1,
          "replies": [
            {
              "id": "l2d62uz",
              "score": 16,
              "body": "Many of the perspectives in this thread are from the Tech sector (ex. Machine learning, data science), which is an incomplete perspective. \n\nI am a Data/Solution Architect in the Healthcare sector. We are a very large consumer of RDBMS databases and our tech stack is in sync with many other industries like Finance. (Low tech companies with tech needs.) \n\nTraditionally, our sector has been very Microsoft SQL Server dominated for our on premise solution. The same is true for a number of low tech industries. For the cloud solution, everyone is swapping over to Snowflake.\n\nThis poises a significant risk to Microsoft because Microsoft SQL Server is one of their biggest products by Revenue. It is one of the biggest names in the “Intelligent Cloud” sector. \n\nIntelligent Cloud is much higher revenue than Personal Computing (Windows) and Productivity (Office). I suspect Microsoft have always used SQL Server to pad Azure numbers by pitting the two in the same category despite SQL Server mostly being an on premise product. \n\nhttps://www.microsoft.com/en-us/Investor/earnings/FY-2023-Q4/segment-revenues\n\nI’m a AWS Certified Solution Architect and as a requirement I pretty much need base knowledge of the entire gamut of AWS database offerings. \n\nSo I can speak with authority that all the AWS/Azure/GCP offerings are garbage compared to Snowflake. They are just lazy reskins of open source software (ex. PostgreSQL/MySQL to Redshift/Aurora, MongoDB to DocumentDB, etc.) \n\nThe UI is terrible. The features are terrible. And it’s embarrassing to admit (or maybe it shouldn’t be) but we are not big tech and our developers are not so competent to be able to finagle with their clunky open source command line solutions. That is why we were using SQL Server in the first place! \n\nAWS and Google may not care but, for Microsoft, a product is at risk that could be bigger than Windows. So it would not surprise me if they bought Snowflake (if FCC allows it). It’s an industry leading product and the spiritual successor to SQL Server in terms of use case.",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2d62uz/",
              "created": 1714720500,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l2cch7y",
              "score": 26,
              "body": "We migrate EDWs from Synapse and Redshift to Snowflake all the time. They are inferior products.\n\nAll the other shit Snowflake peddles though is pretty unimpressive. That is where a traditional cloud provider will shine in my opinion.",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cch7y/",
              "created": 1714704007,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l2brjo5",
              "score": 17,
              "body": "Customer base acquisition vs doing the sales grind",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2brjo5/",
              "created": 1714695412,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l2c7ul9",
              "score": 8,
              "body": "Amazon has the data storage but their \"using it for useful data science\" layer is very lacking",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c7ul9/",
              "created": 1714702047,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l2buutf",
              "score": 2,
              "body": "Plenty of people use both",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2buutf/",
              "created": 1714696771,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l2buznh",
          "score": 31,
          "body": "SNOW is not in a good spot. A lot of their top competitors are ahead of them on tech, particularly ML and GenAI. They’re a fine SQL warehouse and that’s it",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2buznh/",
          "created": 1714696825,
          "depth": 1,
          "replies": [
            {
              "id": "l2bvxj0",
              "score": 20,
              "body": "U can run Python inside the snow console as well to query data. They also released Snowpark a while ago which is similar to a pyspark but no one uses them.",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bvxj0/",
              "created": 1714697205,
              "depth": 2,
              "replies": [
                {
                  "id": "l2c1lh3",
                  "score": 33,
                  "body": "They tried to sell it to my team. They were trying to sell us that you can do whatever pandas stuff you were doing as is within snowpark. Turns out you have to make changes to adhere to their syntax. So now I have to 1) make code changes to migrate and 2) run on more expensive compute units. It was a no-brainer reject.",
                  "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c1lh3/",
                  "created": 1714699507,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l2cao35",
                      "score": 13,
                      "body": "facts",
                      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cao35/",
                      "created": 1714703229,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l2calto",
                  "score": 9,
                  "body": "No- this is the crux of my point.\n\n- Being able to run python via their console is not impressive.\n- SNOWPARK != SPARK\n\n\nedit: \nNo one has been able to tell me \n1) concretely, what is Snowpark?\n2) why is Snowpark useful? What value does Snowpark provide?",
                  "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2calto/",
                  "created": 1714703202,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l2cmln0",
                      "score": 5,
                      "body": "capitalism says more features. so there you have it it's a feature. you're welcome says snowflake",
                      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cmln0/",
                      "created": 1714708582,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l2d7fxi",
                      "score": 4,
                      "body": "Snowpark is useful because you can run python within the EDW solution, which is not something (most?) competing database solutions offer. \n\nSpark is something else. Spark is the T (transform) in ETL/ELT. So Snowpark is not a replacement for Spark but it doesn’t need to be because it offers Python coding on a different layer of the solution. \n\nA company can use Spark and Snowflake in the same tech stack. Conversely, it can use Snowflake and something else.\n\nTLDR; Just because it can be done in Spark  does not make SnowPark not useful. In my current company, we use both solutions together in addition to other products (ex. DBT). There are limitations to each product and Snowpark offers Python coding on the database level which is pretty nifty.",
                      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2d7fxi/",
                      "created": 1714721499,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l2dom66",
                          "score": 2,
                          "body": "This is basically what my startup does. Ingest and master customer data in databricks then push to their snowflake edw.\n\nSo we handle the etl and they get analytics ready data",
                          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2dom66/",
                          "created": 1714733723,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l2bw449",
                  "score": 7,
                  "body": "Yea and it’s expensive to use",
                  "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bw449/",
                  "created": 1714697281,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l2bxgt3",
                      "score": 3,
                      "body": "Which is exactly why they might make it big. Clients are stupid and have full willingness to throw tons of money at the shiny new tool. Its a gamble, but one I might take with a few K",
                      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bxgt3/",
                      "created": 1714697832,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l2c6cv5",
                          "score": 18,
                          "body": "I'm thinking the same thing and might be taking a big position in Snowflake soon. \n\nI hear all this talk from Data/Software engineers (I work a mixed SW/DE role) about Snowflake and it reminds me so much about competition between iPhones and Androids. Techies have always shat on Apple saying its overpriced and that android allows all this customization for cheaper and it's actually a better product and you don't get trapped in the ecosystem whatever. The majority of people though are just regular users that want something that just works. When I talk to a lot of casual people in my industry, they always bring up that yes, Snowflake is expensive, but it just works. Much like Apple. \n\nThe fact that they have the Snowflake market place where companies can be born or blow up for what they make there or the data they sell. All doing this while using the Apple model of keeping people trapped in their ecosystem. I think this could work well and all the posts I see about doubters, especially on WSB, makes me want to enter a position faster.",
                          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c6cv5/",
                          "created": 1714701433,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lj86cxw",
                              "score": 1,
                              "body": "Great answer. Buying more now before earnings later today.",
                              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/lj86cxw/",
                              "created": 1724255310,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l2c7wvv",
          "score": 13,
          "body": "Being able to run SQL in the same way you run it on a SQL server is boomer catnip. And Snowflake can pitch itself to people that don't know anything about the cloud because it comes off in the UI as a SQL Server management UI. It's brilliant marketing.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c7wvv/",
          "created": 1714702074,
          "depth": 1,
          "replies": [
            {
              "id": "l2d7xwu",
              "score": 5,
              "body": "Exactly. \n\nOur developers literally can’t use the other products and we are not replacing all our developers with tribal knowledge of all the data models. \n\nNor are we competing to hire Big Tech developers with bloated salaries. \n\nWe need a dumbed down solution! 😂",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2d7xwu/",
              "created": 1714721871,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l2cww1f",
              "score": 3,
              "body": "How many new ways are there to run sql? ",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cww1f/",
              "created": 1714714351,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l2c2cp9",
          "score": 2,
          "body": "Solid dd I’m in",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c2cp9/",
          "created": 1714699805,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2e0yze",
          "score": 2,
          "body": "Fake it till you make it",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2e0yze/",
          "created": 1714739871,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2e7yfn",
          "score": 2,
          "body": "I remember years ago, my mom complaining about some biotechnology companies she knew were BS, bit she couldn't profit off that since the market hadn't figured it out yet.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2e7yfn/",
          "created": 1714742756,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2elp8m",
          "score": 2,
          "body": "I don’t know if they’d get bought out by the big tech players except to land or expand certain key strategic accounts given the revenue multiplier we’re looking at here. They’re an expensive stock and these same big companies are still doing layoffs to keep their stock meeting investor targets somehow.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2elp8m/",
          "created": 1714747829,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2dls3c",
          "score": 1,
          "body": "The govt isn’t going to allow big tech to do any major buyouts any time soon, maybe if the company was going under but not while they are showing signs of growth.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2dls3c/",
          "created": 1714731990,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l5m7p93",
          "score": 1,
          "body": "Ya besides SNOW who else is there.  AMZN needs snow to juice AWS.   its a smart move.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l5m7p93/",
          "created": 1716647723,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8hjhtq",
          "score": 1,
          "body": "Agreed. We are migrating from SQL Server on prem to Snowflake. It's way overkill in theory. But SQL Server is actually faster with smaller data. So the \"upgrade\" has been bad. I get the hype for really big datasets that need MPP, but for small stuff, indexes are good and sharding can be bad.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l8hjhtq/",
          "created": 1718313476,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2h5mgz",
      "score": 38,
      "body": ">  Carnegie Professor Andy Pavlo’s Snowflake lectures from his Advanced DB series \n\nPlease don't cite my class for this. You don't know what you're talking about.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2h5mgz/",
      "created": 1714782812,
      "depth": 0,
      "replies": [
        {
          "id": "l2myugv",
          "score": 9,
          "body": "Hey dad, can you please flame the post in a more substantive, specific way?\n\n(in all seriousness, thank you for publishing your lectures, they are an INVALUABLE resource <3 )",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2myugv/",
          "created": 1714877791,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj48de4",
          "score": 1,
          "body": "this is funny",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/lj48de4/",
          "created": 1724193049,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2cfsbq",
      "score": 67,
      "body": "We migrated to Snowflake at work last year. It’s going to either 1) be acquired by a bigger company like oracle or 2) become much bigger than oracle\n\nIt’s the future",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cfsbq/",
      "created": 1714705432,
      "depth": 0,
      "replies": [
        {
          "id": "l2d0685",
          "score": 11,
          "body": ">It’s the future\n\nIt's more of the now / last 4 years. Now open formats are starting to take off a bit more (Iceberg, Delta). You'll still need an engine to query the open formats, but there's much less vendorlock than snowflake. So you can theoretically pay compute to whoever can run your engine (trino, photon, snowflake theoretically). This diversifies the competition quite a bit.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2d0685/",
          "created": 1714716435,
          "depth": 1,
          "replies": [
            {
              "id": "l2d8cuh",
              "score": 20,
              "body": "I work in healthcare industry. We want the vendor lock. Prior, we were using Microsoft SQL Server so we were already vendor locked. \n\nWe need one company that offers everything not a gazillion tiny open source solutions for every little problem.",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2d8cuh/",
              "created": 1714722178,
              "depth": 2,
              "replies": [
                {
                  "id": "l2md06j",
                  "score": 5,
                  "body": "The medical industry also uses Epic, and its the reason why hundreds of millions of Americans(doctors AND patients) have a worse experience.\n\nMaybe you should leave the technology decisions to people who know what they're talking about?",
                  "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2md06j/",
                  "created": 1714868021,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l5ma097",
                  "score": 1,
                  "body": "agreed Vendor lock is nice",
                  "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l5ma097/",
                  "created": 1716648654,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l2csrb9",
          "score": 10,
          "body": "That would be really ironic if Snowflake were acquired by Oracle because they were initially created to defeat Oracle!",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2csrb9/",
          "created": 1714711885,
          "depth": 1,
          "replies": [
            {
              "id": "l4d88c6",
              "score": 5,
              "body": "Snowflake was created as a reaction to Hadoop and the realization that you needed an entirely new database architecture if you were moving to the Cloud. It had nothing to do with defeating Oracle.   \n  \nThat said, it is really hard to disintermediate yourself, which is why Oracle failed in their move to the Cloud. By comparison, Microsoft made the difficult moves and successfully transitioned to the Cloud and Azure is a real player now in a way that Oracle Cloud is not. \n\nThe reason why AWS failed with Redshift and Microsoft failed with Synapse is precisely because they picked up on-prem technology and moved it to the Cloud without first adapting them to the reality of the Cloud. Those products inherited the limitations of what came before.\n\nThose early hyperscaler failures allowed Snowflake to thrive. If those products had worked well, Snowflake would have had a much more difficult time emerging.",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l4d88c6/",
              "created": 1715895358,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l5m9usy",
          "score": 1,
          "body": "ya, I think Amazon is going to buy it.  Everyone I know who uses it loves it",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l5m9usy/",
          "created": 1716648593,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldxauqg",
      "score": 28,
      "body": "So you posted this before snowflake & AT&T got fucked. Also you posted the Crowdstrike thing couple of hours before the outage. You're either a time traveller or u fw god",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/ldxauqg/",
      "created": 1721394769,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2c2o8t",
      "score": 22,
      "body": "I have no stake in the game but wanted to critique your product critique in your google doc. I think the product could be overvalued because there are many players and cloud-native offerings from AWS, Azure, etc.. But either way, I don't think there are any factors in your analysis that should suggest dips in the near future.\n\n1. Product sales stuff. Nothing new.\n\n2. Useful to know if you admin over Snowflake. Users would care less.\n\n3. I don't take away much from Snowpark except that Snowflake's Python and Java libraries are from Snowpark.\n\n4. It's not hard to load data if you google examples online. Snowflake's python connector library has an auto create table based on your Pandas dataframe too, so very low effort. If you can't do this then you're not a data engineer.\n\n5. Some of these are niche use-cases but some aren't exclusive to snowflake like Materialized Views.\n\n6. Jupyter notebook integrated into Snowflake is not a good selling point. You can write your python scripts outside like a normal data engineer would.\n\n7. Not watching vid.\n\n8. Unsure what this has to do with anything.\n\n9. It's not difficult to unpack json in Snowflake via SQL. \n\n10. Haven't used them either.\n\n11. Ok.\n\n12. I don't see the problem here.\n\n13. I don't see the usefulness here so I'm with you.\n\n14. ? lost on your train of thought here.\n\n15. It's not bad but more of an admin thing than anything.\n\n16.I'm not seeing what you're seeing here. You can query a database and all and get data back without issues. You don't need to know how to program to do that.\n\n17. Didnt listen cant comment.\n\n18. SaaS cloud offerings are nuanced about this stuff. This isn't new.\n\n19. I don't see any issue with it. They had to throw a number out there somehow. Take it with a grain of salt.\n\n20. Same price? 0.023 gb x 1000 = 23. \n\n21. Lol at the pic thats pretty g",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c2o8t/",
      "created": 1714699933,
      "depth": 0,
      "replies": [
        {
          "id": "l2curao",
          "score": 1,
          "body": "> Jupyter notebook integrated into Snowflake is not a good selling point. You can write your python scripts outside like a normal data engineer would.\n\nJupyter Notebook is better during development/iteration bc you can 'save your progress' in a sense.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2curao/",
          "created": 1714713055,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldwmo0b",
      "score": 20,
      "body": "Bro this guy is time traveler yolo shorting snowflake right now.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/ldwmo0b/",
      "created": 1721382661,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2b2qvp",
      "score": 100,
      "body": "Get a job.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2b2qvp/",
      "created": 1714685689,
      "depth": 0,
      "replies": [
        {
          "id": "l2bdfb4",
          "score": 17,
          "body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bdfb4/",
          "created": 1714689705,
          "depth": 1,
          "replies": [
            {
              "id": "l2bo793",
              "score": 4,
              "body": "What's wrong with job at Wendy's?",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bo793/",
              "created": 1714694024,
              "depth": 2,
              "replies": [
                {
                  "id": "l2bqeto",
                  "score": 3,
                  "body": "Your lips are turning pale",
                  "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bqeto/",
                  "created": 1714694938,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l2e9f4j",
                  "score": 1,
                  "body": "He’s a Wendy’s manager recruiting on Reddit. That’s why he’s saying to get a job.",
                  "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2e9f4j/",
                  "created": 1714743333,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l2bcn0t",
      "score": 32,
      "body": "SNOW Bottom is in",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bcn0t/",
      "created": 1714689394,
      "depth": 0,
      "replies": [
        {
          "id": "l2eh2yl",
          "score": 6,
          "body": "That's going to be my nickname in prison after I get caught for insider trading.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2eh2yl/",
          "created": 1714746200,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2cd69h",
      "score": 16,
      "body": "I think I’ll inverse this and buy snowflake, you convinced me when you put a reasonable value at 2x trailing revenue.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cd69h/",
      "created": 1714704300,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2h4hgs",
      "score": 16,
      "body": "And this? Or is he in on it as well…\n\nhttps://preview.redd.it/3a2pzbn60byc1.jpeg?width=1179&format=pjpg&auto=webp&s=feae693d18710900cad346983ae0b2dbb7ffbce0",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2h4hgs/",
      "created": 1714782317,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldx0eoe",
      "score": 14,
      "body": "So you post this and Snowflake has a massive issue, then you post Crowdstrike DD and they have a massive issue. Wtf mate",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/ldx0eoe/",
      "created": 1721390279,
      "depth": 0,
      "replies": [
        {
          "id": "le1sx6g",
          "score": 5,
          "body": "He posted this on May 2\nand then see what happened after .... \nhttps://www.techtarget.com/searchsecurity/news/366587176/Threat-actor-targeting-Snowflake-database-customers",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/le1sx6g/",
          "created": 1721458711,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2b515f",
      "score": 14,
      "body": "Buying calls",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2b515f/",
      "created": 1714686514,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2byhom",
      "score": 12,
      "body": "It’s like everyone and nobody gets the tech sector",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2byhom/",
      "created": 1714698252,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2bpyuo",
      "score": 10,
      "body": "A tech lesbian on Twitter is short $SNOW. Must be a great short",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bpyuo/",
      "created": 1714694753,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2brj9m",
      "score": 27,
      "body": "To your first point, what the fuck do you think snowpark container services is?\n\nWhat the fuck do you mean they don’t store your data? That’s literally what they do.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2brj9m/",
      "created": 1714695407,
      "depth": 0,
      "replies": [
        {
          "id": "l2c75ha",
          "score": 10,
          "body": "They mean Snowflake doesn't rent or own their own datacenters.  Everything's built on top of another cloud provider (your pick of AWS, GCP, or Azure).  The cloud providers themselves already charge quite high prices, particularly for some things you would care about in this space like egress, so you can be confident you're not getting a good deal.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c75ha/",
          "created": 1714701757,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2c8b3s",
          "score": 9,
          "body": "No, Amazon stores your data and Snowflake gives a nicer layer to interact with and query the data",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c8b3s/",
          "created": 1714702233,
          "depth": 1,
          "replies": [
            {
              "id": "l2c8cae",
              "score": 15,
              "body": "What sort of SnowFlake queries the data? Not a real man, I'd venture.",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c8cae/",
              "created": 1714702246,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l2c8wd2",
              "score": 4,
              "body": "If you want to be pedantic. AWS, GCP, Azure, or the customers own data does. But then you could argue nobody stores data unless they’re on prem. What’s your point?",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c8wd2/",
              "created": 1714702476,
              "depth": 2,
              "replies": [
                {
                  "id": "l2cb018",
                  "score": 5,
                  "body": "That it's a thin software layer on top of other people's clouds and that it thus doesn't have much moat against competition from those big cloud providers improving their data warehouse software offerings",
                  "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cb018/",
                  "created": 1714703372,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l2cltdd",
                      "score": 12,
                      "body": "This is such a moronically bad take. Have you ever actually used snowflake? I literally ran a team which had a 3M dollar per year Snowflake budget. \n\nThe idea it’s a “thin layer” over other clouds and has zero moat is just laughable. \n\nHave you used EMR? Have you used Spark? Have you used Flink? Do you know anything about data engineering or data warehouses at all?",
                      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cltdd/",
                      "created": 1714708200,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l2cb7sv",
                      "score": 2,
                      "body": "Ah yes. “What if google builds this?” The separation of compute and storage has actually allowed them to be cheaper than the cloud providers in this case. \n\nThere’s certainly a bear case, but it’s not in the tech",
                      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cb7sv/",
                      "created": 1714703464,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l2cjbrh",
                      "score": 1,
                      "body": "THIS!!",
                      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cjbrh/",
                      "created": 1714707041,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l2c6rrx",
          "score": 2,
          "body": "Putting my data into s3 on my behalf is not a service(especially because its easy enough to export transactional db data to s3). Also, you can use their data warehouse without physically moving your data to Snowflake's \"environment\".\n\nCan you explain to me why you believe snowpark container services is a useful feature in the context of their larger platform?",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c6rrx/",
          "created": 1714701601,
          "depth": 1,
          "replies": [
            {
              "id": "l2c98ml",
              "score": 2,
              "body": "Agreed on the first point. But that’s not what you get charged for. Compute will make up far more of your bill. \n\nFor customers who are already in the snowflake ecosystem, it can alter the way they interact with the data. Instead of building a separate app, they can build the app in snowflake. The real differentiator, if they figure it out, will be the marketplace. You can sell data and an app with it.",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c98ml/",
              "created": 1714702615,
              "depth": 2,
              "replies": [
                {
                  "id": "l2d55g1",
                  "score": 1,
                  "body": "Can you describe to me what \"building the app in Snowflake\" entails in specific terms? Maybe you can talk about components of \"the app\".\n\nAn example app would also suffice for the point I'm trying to make.",
                  "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2d55g1/",
                  "created": 1714719832,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l2c36rt",
      "score": 18,
      "body": "I can spot the PLTR bag holders in this thread",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c36rt/",
      "created": 1714700142,
      "depth": 0,
      "replies": [
        {
          "id": "l2cgp6y",
          "score": 6,
          "body": "Seriously. Reading these palantir comments has me wondering what planet they are on",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cgp6y/",
          "created": 1714705843,
          "depth": 1,
          "replies": []
        },
        {
          "id": "le0g1yf",
          "score": 1,
          "body": "This has not aged too well",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/le0g1yf/",
          "created": 1721434232,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2bi11m",
      "score": 9,
      "body": "Looks like it’s down ~20% from December so you winning.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bi11m/",
      "created": 1714691518,
      "depth": 0,
      "replies": [
        {
          "id": "l2bi1su",
          "score": 5,
          "body": "Hold.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bi1su/",
          "created": 1714691526,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2cdow6",
      "score": 8,
      "body": "Isn't SNowflake basically just Databricks with better sales/marketing? Databricks pitches their sale to the end users (the data scientists and tech people who will be using it), whereas Snowflake targets the execs/higher ups with buying decision power. They're both just data-crunching software on the cloud, that sits on top of the storage provided by the cloud, and competes with one another, and the cloud provider's data tools (AWS sagemaker, Azure Data Factory, tons of others). IDK I can never really figure it out, they have lots of marketing and getting their name out there, but little substance. And their webinars are trash and all pre-recorded",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cdow6/",
      "created": 1714704517,
      "depth": 0,
      "replies": [
        {
          "id": "l2cfrlx",
          "score": 6,
          "body": "Thank you for the comment- this is the crux of my point:\n\n- Snowflake IS NOT DATABRICKS (i.e. hosted spark)\n- Snowflake IS NOT \"data-crunching software on the cloud\". It was built to QUERY data, not to crunch it.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cfrlx/",
          "created": 1714705423,
          "depth": 1,
          "replies": [
            {
              "id": "l2h3suk",
              "score": 11,
              "body": "FYI.. I am a Snowflake employee. Some clarification about What Snowflake can do and what Snowpark is.\n\nSnowflake is absolutely a data crunching platform. Data Engineering use cases are the top workloads across all the customer base where PBs of data is processed daily. Free Sample datasets that come with every account even have tables with 240 Billion row tables that you can use to query or perform data transformations.\n\nSnowflake is NOT Databricks or Spark, it has its own engine that can handle SQL, Python, Java & Scala in an automatically distributed manner which is much faster than Spark on most DataEngineering jobs including massive datasets and do it in a much more fault tolerant manner with far fewer failures, errors or manual tweaking.\n\n**Snowpark** is Snowflake way of allowing Data Engineers and Data Scientists to use their favorite programming language of choice(Python/Java/Scala) and stay with the same code syntax & data frames(PySpark & Pandas) they already are using.\n\nIt allows you to do two things:\n\nFirst, it allows execution of native Python, Java, Scala(with 3rd party libraries) & SQL languages directly on Snowflake compute in an automatically distributed manner without any additional coding , configuration or maintenance. (This allows execution of ML & AI models on Snowflake as well as any other custom Data Engineering functions that can't be replicated in SQL such as a Python function to extract text from PDF() or perform Web Scrape from a website)\n\nSecond, it offers a client side library for developers wanting code using their local dev environment via their favorite IDE(VSCode, PyCharm & etc.) where their code is executed remotely on Snowflake serverless clusters allowing them to build & execute highly complex code against massive datasets directly from their local machines.\n\nExecution & Performance of the code is identical whether you use the Snowpark Client side library on your local machine or code directly within Snowflake UI as the data is already on Snowflake environment & execution is done on Snowflake clusters with direct access to data files.\n\nBenefits of Snowpark:\n\n1. Code syntax is 90%  compatible with PySpark, so there no need to learn or modify existing code.\n2. Python/Java/Scala code being executed on Snowflake compute has number of benefits:\n\n* If using local dev environment, Your local Python Environment/machine has no impact on performance. Your code will run super fast against TBs of data even if you run it from an old laptop. Alternative is to develop on Snowflake WebUI & where the code is already stored on Snowflake.\n* Any Native Python/java/Scala Functions & 3rd parties libraries you use or create locally in your code will be automatically uploaded to Snowflake compute cluster and the function will be automatically distributed across all nodes within a given cluster against the data.\n* Unlike Spark, you are not tied to a fixed size compute cluster that the code starts it execution with. Using Snowpark, you can issue SQL commands to resize the current cluster size within seconds dynamically (XS 1 to 6XL 512 nodes) . This allows scaling up before a large job then scale down immediately for the next job that is smaller. ( Better unit economics & SLAs)\n* Much more efficient & faster as you no longer have to move large volumes of data from your DWH/Lake to process then move the final dataset back into a DWH.  Instead code gets pushed to where the data resides and runs on compute that has access to it.\n* Much better security & governance. Data never leaves Snowflake Environment to a developers machine & all access and jobs are audited and logged.\n* Basically it allows you do what you are already doing with Python and orher  languages but do it in a much easier, faster, secure & problem free manner without having refactor your existing code or learn new coding skills.\n\nHere is a video of running a previously PySpark code on Smartphone after it was modified to use Snowpark dataframes where 6 Billion & 10M row tables are joined, aggregated and written to a new 360M row table in 16 secs on a Samsung Phone running Python 3.9\n\n[https://www.linkedin.com/posts/nick-akincilar-3417945\\_dataengineering-data-pipeline-activity-7142282080792543232-o4A4?utm\\_source=share&utm\\_medium=member\\_android](https://www.linkedin.com/posts/nick-akincilar-3417945_dataengineering-data-pipeline-activity-7142282080792543232-o4A4?utm_source=share&utm_medium=member_android)",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2h3suk/",
              "created": 1714782023,
              "depth": 2,
              "replies": [
                {
                  "id": "l2o7c30",
                  "score": 3,
                  "body": "- Self reported stats about \"Data Engineering\" are misleading because that term has specific meaning for professionals, but you can get away with using it loosely in investor material. Still waiting for someone to show me a serious data pipeline/workload they've run \"on Snowflake\".\n\n\n\n- Good job, you can run BIG QUERIES, we know. We've known since 2010. We've known since Dremel.\n\n\n\n- Just because you CAN use Snowflake to transform data doesn't mean you SHOULD use it to do that.\n\n\n\n- Anyone who looks at the documentation for their Python client libraries can see that that it's an O.R.M. (this point will make sense to SWEs) \n\n\n\n- If it's faster, then share it with the class. DROP THE GITHUB REPO WITH THE DOCKERFILE. Performance/benchmarking claims cannot be taken seriously if there is no way to replicate them.\n\n\n\n- For the reader: whenever you see phrases like \"allows execution of X/Y/Z on SNOWFLAKE\", replace the \"snowflake\" part with \"Cloud Compute(AWS, Azure, GCP)\".\n\n\n\n- Claims about SNOWPARK's IMPLEMENTATION can not be trusted because all \"Snowpark\" code is executed on the server-side(CSP's server).\n\n\n- Snowflake obfuscates this by often talking about \"query pushdown\" as if I need to care when I'm running SELECT * on people's personal data. \n\nEdit: Stop using irrelevant technical jargon to make your product sound more impressive. @SNOWFLAKE",
                  "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2o7c30/",
                  "created": 1714906898,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l2o81ce",
                      "score": 2,
                      "body": "> and stay with the same code syntax & data frames(PySpark & Pandas) they already are using.\n\na) PySpark is a Python 'Client' that sends SQL to a server running a 'Spark Executor'\n\nb) Pandas is a Python library for manipulating dataframes\n\nc) The Snowpark *client library* provides a *similar* frontend experience as these two libraries(i.e. sending SQL & operating on a \"\"excel spreadsheet type abstraction\"\", but behind the scenes, the same thing is NOT going on AT ALL.",
                      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2o81ce/",
                      "created": 1714907367,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l2phrow",
                          "score": 6,
                          "body": "Not sure what your point is. The goal here is not to build a better Spark using Spark technology. The goal is to provide the exact same coding as PySpark or Pandas but use a better tech than Spark to execute those jobs faster & w/o any configuration.\n\nYour argument is like saying Teslas are not true cars because they dont use a combustion engine like real cars. If you think Spark is the sole tech that can process big data and it is the fastest tech ever then not much I can say here.\n\nFrom the comments, it is pretty clear you are not very familiar on how things work on Snowflake.",
                          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2phrow/",
                          "created": 1714927540,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l2ps14y",
                              "score": 1,
                              "body": "There is no evidence that Snowflake's query engine is \"better tech\" because:\n\n-  it's closed source, so we cannot verify any claims made about it (convenient for Snowflake)\n- benchmarks that don't have an associated github repo + a dockerfile cannot be taken seriously.\n\n\nedit: good job flooding the information channel with unnecessary technical jargon though!!",
                              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2ps14y/",
                              "created": 1714931193,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l4dl0pv",
                                  "score": 2,
                                  "body": "\\[I work for Snowflake but do not speak for them.\\]  \n  \nDatabricks isn't open either. You seem to imply they are a charity, they aren't.  \n\nSnowflake doesn't exist in a vacuum. The vast majority of customers test Snowflake with their own data. The reason that benchmarks generally don't matter is they are easy to game. Ultimately what customers care about is loading ***their own*** data in multiple systems and testing them out. Speed is one component, ease of management is another. Cost is also important.   \n  \nMost companies moving from an on-prem database are going to feel right at home with Snowflake. Ask yourself this: after testing Snowflake directly against other solutions, and running the performance and pricing numbers, why are so many companies choosing Snowflake? In my opinion, marketing only gets you so far. It gets awareness. It perhaps gets customers to try the solution for themselves. But if the platform didn't work, that marketing would be wasted. Customers aren't dumb. Your thesis breaks down because customers try Snowflake every day and like what they see.",
                                  "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l4dl0pv/",
                                  "created": 1715900421,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l5858eu",
                                      "score": 1,
                                      "body": "your company's moat is yaml/cdk scripts/terraform 😳",
                                      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l5858eu/",
                                      "created": 1716410551,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l58ivad",
                                          "score": 1,
                                          "body": "Snowflake processes 5B queries per day with an extremely happy customer base. That doesn't happen by magic. Feel free to tune in to the Snowflake Keynotes on June 3rd to get a feel for just how differentiated Snowflake is and will continue to be in the future.",
                                          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l58ivad/",
                                          "created": 1716415393,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l2cpxzl",
              "score": 2,
              "body": "Yeah, but all of these services have the data crunching built on top of their core, in some form. Databricks has their multi-language code notebook. Snowflake has a similar notebook (Snowpark, I think?), plus some app store/environment to get third party doo-dads that are built on snowflake. Sagemaker is more about the notebook & code. ADF is a mix of ingestion and coding environment to do stuff with it. So they all just blend together in terms of what does stuff.\n\nIn any case, I feel like Snowflake is super heavy on hype and fugaze, so pretty sure we're on a similar page there.",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cpxzl/",
              "created": 1714710325,
              "depth": 2,
              "replies": [
                {
                  "id": "l2crcmb",
                  "score": 2,
                  "body": "no- this is what I keep saying:\n\nSNOWPARK IS NEITHER A NOTEBOOK NOR A *SPECIAL* CLIENT RUNTIME. It's incredibly misleading.",
                  "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2crcmb/",
                  "created": 1714711095,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l2d4hew",
      "score": 7,
      "body": "We use Snowflake. This thesis is rubbish. The new ceo is application driven. Exactly the right way to go. Massively undervalued",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2d4hew/",
      "created": 1714719366,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2ctcky",
      "score": 11,
      "body": "Bro you're a fucking dumbass to the extreme wtf regarded low IQ shit did I just skim? \n\n\n1. A snowflake warehouse does the compute\n2. Snowflake is a million times faster than the shit my company used to have. 8 hour queries run in 6 minutes so now I run more of them snowflake wins and I win. \n3. Snowflake is faster than pyspark hands down and I can do xomplex data engineering with ease in snowflake. \n\n\nJust because your dumbass can't submit a query and then sit there with your hand in your pants for the rest of the day anymore doesn't mean snowflake is bad, it actually means it's good because now your lazy ass has to do real work you bum",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2ctcky/",
      "created": 1714712221,
      "depth": 0,
      "replies": [
        {
          "id": "l2d32vd",
          "score": 4,
          "body": "I get it- Snowflake is pretty epic. When I understood how powerful it was, I was in awe (serious). That's what led to me researching it. I'm just saying it ain't worth $50 billion dollars.\n\n\n2. I'm sorry that your company just found out about the difference between OLTP and OLAP. Unfortunately, a lot of people are in that boat rn. \n\n3. This point is useless unless you want to post the github repo with your benchmark and the \"data engineering\" you're doing within snowflake. \n\n\n\nTo your final point, I'm advocating for solutions that are faster and more efficient than snowflake for all workloads haha.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2d32vd/",
          "created": 1714718395,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9rjm4z",
          "score": 1,
          "body": "Just benchmarked Snowflake vs Databricks and Databricks did it twice as fast at 1/3 the cost and all in SQL. This is why Snowflake is going down. \n\nPoint #3 is completely wrong. Databricks is faster and cheaper hands down.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l9rjm4z/",
          "created": 1719065468,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2b53ag",
      "score": 19,
      "body": "I don't know what their true valuation is, but if you think about it, Snowflake, Palantir, Databricks, few others are really who's delivering these AI real-world applications not these lame LLMs. One of these companies will be the next Google in 5 years, that's why these valuations are so out of whack with reality right now.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2b53ag/",
      "created": 1714686536,
      "depth": 0,
      "replies": [
        {
          "id": "l2b8fvz",
          "score": 33,
          "body": "As a data scientist i think snowflake is hot trash compared to palantir and databricks. Why would anyone lock themselves down to proprietary data warehouse when you don't have the advantage of a cloud ecosystem.\n\nPalantir offer a ready made solution to a number of industry use cases, which seem to be well made, would not be surprised if they do well. While databricks offers the compute base framework for more custom solutions. Databricks is great as it is integrated in the azure cloud and aws. The problem with databricks is that cloud providers already offer a watered down  open source version of databricks. (Apache spark).",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2b8fvz/",
          "created": 1714687779,
          "depth": 1,
          "replies": [
            {
              "id": "l2be4jf",
              "score": 8,
              "body": "Foundry is also offered on azure, aws and now oracle. Not to add that you can defintly customise solutions and with workflow builder or start from scratch. Idk where you got that they only delivered ready made solutions...that's just a recent offering on their aipnow platform.",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2be4jf/",
              "created": 1714689983,
              "depth": 2,
              "replies": [
                {
                  "id": "l2dl18b",
                  "score": 2,
                  "body": "Do we see palantir at $32 this year?",
                  "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2dl18b/",
                  "created": 1714731516,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "le0gxhz",
                      "score": 1,
                      "body": "Aged well",
                      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/le0gxhz/",
                      "created": 1721434593,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l2d6htz",
                  "score": 1,
                  "body": "You are right, you can add foundry to your cloud infrastructure. Makes sense if you data lake is already hosted in the same cloud location. It makes your extract process much better. They have a good product.",
                  "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2d6htz/",
                  "created": 1714720803,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l2bfzzv",
          "score": 6,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bfzzv/",
          "created": 1714690713,
          "depth": 1,
          "replies": [
            {
              "id": "l2brl8w",
              "score": 8,
              "body": "Sales isn’t losing any customers to Palantir. It’s DBX or a native cloud solution.",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2brl8w/",
              "created": 1714695430,
              "depth": 2,
              "replies": [
                {
                  "id": "l2bv6g6",
                  "score": 3,
                  "body": "This guy gets it^",
                  "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bv6g6/",
                  "created": 1714696899,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l2c3aq0",
          "score": 1,
          "body": "lol this is ignorance, go read about Microsoft’s revenue from AI projects this quarter",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c3aq0/",
          "created": 1714700189,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2cjcc0",
      "score": 3,
      "body": "My questions: \n\nWhy does Berkshire hold [somewhat small] Snowflake in its portfolio? \nAs a pedestrian investor, I would believe that Team Berkshire would exercise due dilligence before investing in a stock.\n\nSridhar Ramaswamy is a very experienced tech executive [previous stint at Google]. Even if the company's product offering may fall short at the moment, will Ramaswamy be able to execute a turn around?\nIf yes, then one may argue that Snowflake share priced at <160$ as of 2nd May, 2024 is undervalued!\n\nCloud based data storage, data analysis, data engineering/computing etc is likely is expand as more enterprise join the fray?\nSo isnt the potential customer base and order size for Snowflake likely to grow over time?",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cjcc0/",
      "created": 1714707049,
      "depth": 0,
      "replies": [
        {
          "id": "l2diutt",
          "score": 2,
          "body": "Fair points, but Snowflake has done nothing since they IPO'd and they have no moat (though the recent Streamlit acquisition is a plus). Also, the # of bulls here who don't understand anything about their service is evidence that they've been misleading investors.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2diutt/",
          "created": 1714730038,
          "depth": 1,
          "replies": [
            {
              "id": "l5mv97e",
              "score": 1,
              "body": "this is short sided, meta did terrible on IPO then hockey sticked.  The growth is massive for SNOW probably the biggest market we've seen. \n\nAlso what company doesn't want to just search ' why is 'x' product doing poorly this season'  etc.  That is massively valuable to any organization.  To be able to easily search using your data or other data is quite brilliant.",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l5mv97e/",
              "created": 1716656990,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l5mv000",
          "score": 1,
          "body": "Right, think about the depth berskhire has.  You have literally people still paying millions to have lunch with buffett.  You are telling me the top minds in the world aren't advising him or trying to show him where the world is going?  To take a stake in Snowflake must have been VERY compelling sell from whatever tech guys there were talking to.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l5mv000/",
          "created": 1716656890,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2cobvn",
      "score": 3,
      "body": "This is way too complex for this forum. What are we doing here folks? It’s 2024. Just yolo and poop on the floor and move on.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cobvn/",
      "created": 1714709461,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2e9z4l",
      "score": 3,
      "body": "THE EVIDENCE/ANALYSIS I PROVIDE IS BASED OFF OF: \n\n• Trust me bro.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2e9z4l/",
      "created": 1714743548,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2fkrla",
      "score": 3,
      "body": "I'm in software and efffing hate snowflakes, but I won't short it, they use some sort of black magic to get companies all in.   it's unbelievable how much money my org throws at it...",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2fkrla/",
      "created": 1714759919,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2ljgta",
      "score": 3,
      "body": "Snow melted long while ago.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2ljgta/",
      "created": 1714856100,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lew5rh9",
      "score": 3,
      "body": "SNOW ![img](emote|t5_2th52|4258)\n\nCRWD ![img](emote|t5_2th52|4258)\n\nLook forward to the next \"Company isn't worth $xxx Billion Dollars\" post OP",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/lew5rh9/",
      "created": 1721924748,
      "depth": 0,
      "replies": [
        {
          "id": "lizrqpr",
          "score": 1,
          "body": "IRM!",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/lizrqpr/",
          "created": 1724128732,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2c0n70",
      "score": 4,
      "body": "AFAIK Snowflake stores your data and runs on AWS.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c0n70/",
      "created": 1714699124,
      "depth": 0,
      "replies": [
        {
          "id": "l2c3l72",
          "score": 7,
          "body": "Snowflake stores the data in either AWS, Azure or GCP. If you are not on one of the cloud providers, they will host the data on their on S3 (AWS) storage bucket. They have their own proprietary compute engine that runs on the cloud providers hardware, like EC2.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c3l72/",
          "created": 1714700308,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2bqtdk",
      "score": 7,
      "body": "I’m a software engineer too, I didn’t got a chance to use snowflake but few of my friends who uses snowflake are absolutely loving it and they said they released some exciting new AI features which are pretty good he said. You have to ask a question for yourself \nThe stock has been dropped from almost $250 to $150 with in past 2 months and do you really think it can drop few more? And papa buffet still owns Snowflake at $120/share I guess. \nIMO it’s very a good company but little messed up financials\nI’m expecting at-least $250 to $300 share price by end of this year or mid next year!\n(It is better than $PLTR, I know some retail compare snow vs palantir, whoever works in Tech, they should vote Snow anyday)",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bqtdk/",
      "created": 1714695107,
      "depth": 0,
      "replies": [
        {
          "id": "l2ch14j",
          "score": 2,
          "body": "I know some data scientist that also love it",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2ch14j/",
          "created": 1714705997,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2c7tt7",
      "score": 2,
      "body": "I've always thought snowflake is basically Biquery.  1 godamn product. Saw through that shit from the begining.\nHad puts in may 2021. Fml",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c7tt7/",
      "created": 1714702038,
      "depth": 0,
      "replies": [
        {
          "id": "l2d271n",
          "score": 1,
          "body": "3 years have passed and they are still just bigquery haha",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2d271n/",
          "created": 1714717786,
          "depth": 1,
          "replies": [
            {
              "id": "l5mutlp",
              "score": 2,
              "body": "exactly, I am shorting google too they are just a search= they will be bankrupt in 2 years.",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l5mutlp/",
              "created": 1716656820,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l2chkug",
      "score": 2,
      "body": "While I agree with your analysis, taking a short position against a data solutions provider in the current AI boom cycle is ballsy. You’re basically betting on a bubble bursting in time for your puts to print. Your contention is  that only incompetent newbie data scientists will use snowflake, but that describes like 98% of existing AI companies…\n\nThe AI boom can stay irrational longer than your puts can stay solvent.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2chkug/",
      "created": 1714706247,
      "depth": 0,
      "replies": [
        {
          "id": "l2cse4h",
          "score": 1,
          "body": "I appreciate the comment. \n\nTBH, I don't expect to profit on these puts, because like you alluded to, markets are not rational and not everyone has equal information.\n\nEven incompetent newbie data scientists have no strict need for Snowflake and the barrier to entry is higher than firing up vscode or using Google collab.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cse4h/",
          "created": 1714711675,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2d86x0",
      "score": 2,
      "body": "One of the key principles that many people fail to realize is that AI == shitloads of data. In and out, exponentially increasing over time.\nThat is expensive to store, very expensive to query and even more expensive to process.\nOn top of that you can add supply chain bottlenecks that might be forming because all those NVDA + SMCI rigs sold lately needs mucho electricity.\nMy point is that 6-12 months from now we might see that a flexible service exploiting compute resources more effectively is much cheaper than other solutions. Is SNOW solves these issues? IDK judge for yourself",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2d86x0/",
      "created": 1714722055,
      "depth": 0,
      "replies": [
        {
          "id": "l2sq2qd",
          "score": 1,
          "body": "Scale of the industry is a valid argument pro snowflake argument🤝",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2sq2qd/",
          "created": 1714978354,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2dpa55",
      "score": 2,
      "body": "What company is a distributed compute framework",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2dpa55/",
      "created": 1714734106,
      "depth": 0,
      "replies": [
        {
          "id": "l2evq44",
          "score": 1,
          "body": "Databricks sells hosted Spark with a proprietary query engine, but this is also open-source technology",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2evq44/",
          "created": 1714751299,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2drgl2",
      "score": 2,
      "body": "Delete this I'm already down 25% on them",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2drgl2/",
      "created": 1714735307,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2e2fqz",
      "score": 2,
      "body": "It’s a matter of time cloud native services to catch up on them and customer to migrate, and their new customer acquisition slow down significantly. They will go the way of HortonWorks, Cloudera and the like… I don’t think any hyperscaler will want to buy them, not how they think and do anymore, buy longer term puts.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2e2fqz/",
      "created": 1714740509,
      "depth": 0,
      "replies": [
        {
          "id": "l4dc7fv",
          "score": 1,
          "body": "\"It’s a matter of time cloud native services to catch up on them and customer to migrate.\"\n\nWhy? You make it sound like AWS loses money when customers run Snowflake on AWS. They don't. AWS wants workloads to move from on-prem to the Cloud. Snowflake is a great way for customers to do that. What is the incentive for AWS to sink a lot of resources into Redshift when a customer running Snowflake on AWS means they still win the workload? I think of it this way. If AWS has 200 services, Snowflake plays nicely with 198 of them. Sure, maybe the customer isn't using EMR and Redshift, but they are still using EC2, S3, and a bunch of other services instead.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l4dc7fv/",
          "created": 1715896873,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2ed842",
      "score": 2,
      "body": "One thing missed is SNOW does not own their cloud.  They have to resell Azure, AWS, and GCP to their customers and add their costs on top of that.  The loss they show each Q is mostly what they owe the cloud providers each month.  They sell their services to customers for less than they owe the cloud providers just to offer those services.  AWS, GCP, and Azure can put them out of business just by taking away their discounts",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2ed842/",
      "created": 1714744776,
      "depth": 0,
      "replies": [
        {
          "id": "l4dd59s",
          "score": 1,
          "body": "Snowflake has a $2.5B commit with AWS:  \n[https://www.crn.com/news/cloud/snowflake-to-spend-2-5-billion-on-the-aws-cloud-over-five-years](https://www.crn.com/news/cloud/snowflake-to-spend-2-5-billion-on-the-aws-cloud-over-five-years)\n\nAnd those Snowflake customers are also customers of the Cloud providers. You're suggesting that AWS tell a $2.5B customer \"sorry, I'm taking away your discount\"? For a customer that is driving a massive amount of compute on their platform? What is your reasoning behind that idea in a world where Snowflake is jointly helping the Cloud providers move massive amounts of legacy Hadoop, Teradata, Netezza, and other on-prem workloads seamlessly to the Cloud?",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l4dd59s/",
          "created": 1715897243,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2en5t5",
      "score": 2,
      "body": "Hello I am a novice data scientist you all speak of and my company is acquiring snowflake … some pls ELi5… I’ve only just received a testing environment and am really unfamiliar with the software… pros/ cons??",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2en5t5/",
      "created": 1714748336,
      "depth": 0,
      "replies": [
        {
          "id": "l2ew6xd",
          "score": 3,
          "body": "The best way to find pros/cons is to try out the product and report back when you're done !",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2ew6xd/",
          "created": 1714751461,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2f4jk0",
      "score": 2,
      "body": "I don't think it's worth $50 Billion either, but I don't short it because I've seen how long the market can remain irrational. Tesla has been overvalued for several years now now with no end in sight.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2f4jk0/",
      "created": 1714754335,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2hcm4c",
      "score": 2,
      "body": "My only comment. Snow flake might be shit but there’s shittier companies worth more than $50B. Keep that in mind",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2hcm4c/",
      "created": 1714785874,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2kt9d9",
      "score": 2,
      "body": "Snowpark is the compute\n\nAnd they have a 80% margin bruh.\n\nThey may not do great but they’re not falling that much haha",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2kt9d9/",
      "created": 1714846667,
      "depth": 0,
      "replies": [
        {
          "id": "l2mrz60",
          "score": 1,
          "body": "Explain their negative net profit then. Can you link me the source on the 80% margin figure?",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2mrz60/",
          "created": 1714874574,
          "depth": 1,
          "replies": [
            {
              "id": "l2msuhy",
              "score": 1,
              "body": "80% is versus what they pay cloud providers.",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2msuhy/",
              "created": 1714874969,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "le12l49",
      "score": 2,
      "body": "\"Snowflake Inc. is an American cloud computing–based data cloud company based in Bozeman, Montana. It was founded in July 2012 and was publicly launched in October 2014 after two years in stealth mode.\"\n\n*after two years in stealth mode*\n\nchrist these companies are unbearable",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/le12l49/",
      "created": 1721443910,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2bnftt",
      "score": 2,
      "body": "Valuations don’t matter. Look at CVNA. It’s all BS",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bnftt/",
      "created": 1714693709,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2c9a70",
      "score": 2,
      "body": "I thought this was gonna be about Elon",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c9a70/",
      "created": 1714702633,
      "depth": 0,
      "replies": [
        {
          "id": "l2ctthc",
          "score": 1,
          "body": "Same.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2ctthc/",
          "created": 1714712493,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2cduck",
      "score": 2,
      "body": "I agree with your thesis, but so many stupid executives are easily manipulated into believing Snowflake can reduce their data usage expenses, so it might continue to get business. For example, we use AWS Redshift, and one of the executives constantly pushes us to get positive reviews from a Snowflake PoC, even though I firmly say it's no better than what we already have. \n\nIn another company where I work, we have full stack AWS, GCP, Teradata, etc., and recently got Snowflake with a promise of reduced query run costs and bringing transparency into expenses. I am unsure if we realized the benefits yet, but I feel frustration from people as you're now under scrutiny by executives as to who is utilizing how much.\n\nOverall, I agree with your statement about what Snowflake does but don't underestimate the stupid executives in these big companies.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cduck/",
      "created": 1714704580,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2b5uva",
      "score": 3,
      "body": "Wait a few years, inflation will make it worth $50 billion. We’ll all be millionths within a decade at this rate.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2b5uva/",
      "created": 1714686812,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2bgx6n",
      "score": 1,
      "body": "Expensive with underwhelming growth\n\nPass",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bgx6n/",
      "created": 1714691077,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2bz4cb",
      "score": 3,
      "body": "But they DO store data. That's the main point of them. This makes no sense at all.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bz4cb/",
      "created": 1714698510,
      "depth": 0,
      "replies": [
        {
          "id": "l2c5ivy",
          "score": 2,
          "body": "No, that's what I'm trying to tell you. THEY DONT. They utilize underlying cloud object store at cost.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2c5ivy/",
          "created": 1714701098,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2b2o8c",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 9 minutes ago\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 8 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2b2o8c/",
      "created": 1714685662,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2buoah",
      "score": 1,
      "body": "📈📈📈",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2buoah/",
      "created": 1714696698,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2caa63",
      "score": 1,
      "body": "First time looking at modern tech companies?",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2caa63/",
      "created": 1714703062,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2cu3f6",
      "score": 1,
      "body": "So calls?",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cu3f6/",
      "created": 1714712654,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2cwhi4",
      "score": 1,
      "body": "man, if u guys would really know anything, you wouldn't post on wsb.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cwhi4/",
      "created": 1714714103,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2cx1pp",
      "score": 1,
      "body": "Did anybody else click this post expecting shit talking Elon Musk, lol.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2cx1pp/",
      "created": 1714714446,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2ddxz5",
      "score": 1,
      "body": "Databricks are leading the category from a capability standpoint. The just don’t have the same traction in the mid market.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2ddxz5/",
      "created": 1714726405,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2dgeb8",
      "score": 1,
      "body": "How much is it worth.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2dgeb8/",
      "created": 1714728243,
      "depth": 0,
      "replies": [
        {
          "id": "l2dicgf",
          "score": 1,
          "body": "read the post",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2dicgf/",
          "created": 1714729673,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2dh23s",
      "score": 1,
      "body": "Hater![img](emote|t5_2th52|31226)",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2dh23s/",
      "created": 1714728734,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2e8pht",
      "score": 1,
      "body": "Bunch of snowflakes",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2e8pht/",
      "created": 1714743052,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2fjatf",
      "score": 1,
      "body": "You should build your own data warehouse. You should own your data.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2fjatf/",
      "created": 1714759406,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2gbosx",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2gbosx/",
      "created": 1714770581,
      "depth": 0,
      "replies": [
        {
          "id": "l2gnm3i",
          "score": 1,
          "body": "okay, but Snowflake isn't profitable... and they don't have lock-in... because as I previously explained, they don't store your data",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2gnm3i/",
          "created": 1714775189,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2ikoik",
      "score": 1,
      "body": "Databricks enters the chat.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2ikoik/",
      "created": 1714810750,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2kxsg6",
      "score": 1,
      "body": ">Snowflake DOES NOT store your data \n\nYes, they do.",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2kxsg6/",
      "created": 1714848250,
      "depth": 0,
      "replies": [
        {
          "id": "l2mrs2e",
          "score": 1,
          "body": "1) to be more precise: Snowflake does not physically store your data.\n\n2) You can opt into Snowflake managed Object Store; the benefit of this is a marginally faster initial query time when a warehouse starts up. \n\nA thin layer between you and CSP is not that valuable. Also, customers may choose to entirely not use Snowflake managed storage.",
          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2mrs2e/",
          "created": 1714874483,
          "depth": 1,
          "replies": [
            {
              "id": "l2nhfnz",
              "score": 1,
              "body": "You mean they are transitory in the code equation, i.e. someone else is the cloud provider and they use that provider to offer their storage solution? .",
              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2nhfnz/",
              "created": 1714887977,
              "depth": 2,
              "replies": [
                {
                  "id": "l2njhug",
                  "score": 2,
                  "body": "yes! \n\nSome additional context as well: when Snowflake was first created, the cloud was much newer and the APIs/frameworks/technologies for operating within the cloud were less mature (and some did not exist). SO, back between 2014 - 2021 there was probably was a ton of value in managing data on the user's behalf. Not the case going forward.",
                  "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2njhug/",
                  "created": 1714889345,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l2nkzc1",
                      "score": 2,
                      "body": "I think you're undervaluing the platforms ability to do what hiring specialists to setup can do for the scale that it's used, and I think you're under valuing the specialties of snowflake in the storage optimization space.\n\nWhen you're dealing with 1Bn records a day, it's easier to pay people that have a sole purpose to work that problem than solve it in house. It takes a very large size company to address a problem like that. The distance from the company that needs a large data store solution to a company that can solve their large data store solution is large.\n\nIn terms of dollar to data, it's far cheaper than ddog - as an example.",
                      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2nkzc1/",
                      "created": 1714890376,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l2nrsa1",
                          "score": 2,
                          "body": "1. true, there is value in their product being \"enterprise-grade\"\n\n2. Wym by storage optimization? compression is not a secret.\n\n3. Not sure what you mean here. Snowflake never sold itself as a no-code solution and it's business model is different than Palantir's(where the client pays for \"Solutions Engineers\"). It presents as a 100% cloud SaaS offering.",
                          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2nrsa1/",
                          "created": 1714895255,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l2nvms7",
                              "score": 1,
                              "body": "2. You can't just drop a postgres db in there, aws offers storage. azure offers storage. but snowflake is offering an abstraction to those storages. It's a next early step to data warehousing that avoids commitment and keeps the geo needs open  \n3. Agree, i'm talking about how snowflake is able to offer a solutions engineer that avoids having to hire an entire dept for a small company, and then once on that solution, if scale, then some of those optimzations are 'built in' with a cost and labor allocation to replace.",
                              "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2nvms7/",
                              "created": 1714898131,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l2nyprh",
                                  "score": 1,
                                  "body": "1. This sentence is a word salad, so let's break it down:\n\n> You can't just drop a postgres db in there.\n\na) Postgres is a transactional database(OLTP). We are talking about analytical db's (OLAP).\n\nb) Yes, you literally can just drop postgres anywhere you want thanks to containers.\n\nc) Snowflake is not offering an abstraction to those storages, unless you mean that in a very specific/precise way.\n\n\nd) not sure what you mean, but YES to the \"no commitment\" part. That's the best part of the product and very admirable for a SaaS company. \n\n\n\nThe credits they sell are good forever, so if the product is unusable NOW(while compute is relatively more expensive than it will be in the future) Snowflake can make \"free money\". \n\nIf the product were purposefully ass so that Snowflake could save on compute costs that would be defrauding their investors and their clients.",
                                  "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2nyprh/",
                                  "created": 1714900476,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l33c8vn",
                                      "score": 1,
                                      "body": "A few beers def put me off clear comms. Here we are again, I numbered these to align with your comment.   \n  \nFor your b. I think you are stating my point with your a.  \n\nFor your c, I concede to your point that Snowflake is deferring the cloud/datacenter to others, and they are just a configured layer to use those cloud resources on <behalf of> \n\nFor your d. IMO thats the point, and thats the value. you can go from 100M to 10B records/day into a table with SF and avoid adding higher cardinality to a team (more people) \n\nI think their beta view was pretty solid for a query tool. Have you seen metabase? That one is wild because its just 'lets connect to your established db' - which is why i've probably split a hair or two on these points.",
                                      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l33c8vn/",
                                      "created": 1715146472,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l351e89",
                                          "score": 2,
                                          "body": "d) unfortunately, this isn't secret sauce anymore. shoutout to all my yaml engineers.\n\nFor sure, it's a solid tool and people can get value out of it, but the $50 billion valuation is puzzling.\n\nI haven't seen metabase, but thanks for the suggestion- I'll check it out",
                                          "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l351e89/",
                                          "created": 1715180765,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l2bvpib",
      "score": 1,
      "body": "Why is snowflake worth anything? they seem to lose more money as they grow . Can someone explain how this is a profitable business",
      "permalink": "/r/wallstreetbets/comments/1cirikp/snowflake_isnt_worth_50_billion_dollars/l2bvpib/",
      "created": 1714697113,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "The post argues that Snowflake is overvalued at $50 billion as it is not a distributed compute framework, which limits its utility for data science tasks.",
    "companies": [
      "Snowflake",
      "Vercel"
    ],
    "tickers": [
      "SNOW",
      "VTI"
    ],
    "main_ticker": [
      "SNOW"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "The post criticizes Snowflake's valuation and argues that it misleads investors by not offering comprehensive computing frameworks.",
    "stock_recommendations": "The user recommends holding puts on Snowflake which indicates a bet on the stock decreasing in value.",
    "is_recommending_stock_buying_or_selling": true,
    "buy_or_sell": "sell",
    "sentiment_summary": "The sentiment is negative as the user criticizes Snowflake’s value and supports it with personal experiences and analysis, along with holding a short position on the stock.",
    "sentiment": "negative"
  }
}