{
  "title": "The technical bull case for $IBRX",
  "score": 76,
  "selftext": "[removed]",
  "link_flair_text": "DD",
  "id": "1cj2wor",
  "num_comments": 78,
  "created_utc": 1714721985,
  "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/",
  "comments": [
    {
      "id": "l2d83rw",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 weeks ago\n**Total Comments** | 122 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1cbinuc/lets_discuss_fannie_mae_and_freddie_mac_fnma_and/) [x](https://www.reddit.com/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/) \n**Account Age** | 1 month | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2d83rw/",
      "created": 1714721991,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2drii9",
      "score": 46,
      "body": "Thanks for the great DD as always, just like you did on ALCC. \n\nLymphoma took my mother way too early. Fuck cancer. I’m in.",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2drii9/",
      "created": 1714735335,
      "depth": 0,
      "replies": [
        {
          "id": "l2drr2y",
          "score": 11,
          "body": "Cancer has affected my family as well. I am sorry for your loss.",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2drr2y/",
          "created": 1714735461,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2daa4n",
      "score": 26,
      "body": "Thanks for this insanely good DD. Their pipeline is also insane, very promising stuff. Biotech stocks are unfortunately as irrational as it gets, but I hope this one prints. I'll either die or rise with you ![img](emote|t5_2th52|4276)",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2daa4n/",
      "created": 1714723623,
      "depth": 0,
      "replies": [
        {
          "id": "l2dadiu",
          "score": 11,
          "body": "I assume you read it, I really appreciate it. Put a lot of work into it.",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2dadiu/",
          "created": 1714723692,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2dq24a",
          "score": 5,
          "body": "Why are biotech stocks as irrational as it gets if you don’t mind me asking? I think betting on them early on is like betting on horses at the starting line, fair, but imagine if you could bet on horses mid race. IBRX is poised to emerge as a successful company given what I wrote, and it’s not too late to bet on them. They are pulling away as a clear leader in their space and are undervalued.  Anyways I’m with you. Holding this for the long term, even though I think they will see significant growth in the coming months.",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2dq24a/",
          "created": 1714734549,
          "depth": 1,
          "replies": [
            {
              "id": "l2dtoha",
              "score": 2,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2dtoha/",
              "created": 1714736453,
              "depth": 2,
              "replies": [
                {
                  "id": "l2e2eae",
                  "score": 8,
                  "body": "Hm, I see where you are coming from, but let me take the other side for a moment.\n\nIBRX current revenue stream is a measly 600 thousand dollars. 900 million dollars a year, if they get there in the coming years, would represent a 1500x increase to revenue. Seems pretty high to me. Analysts for this year have predicted an annual revenue for 2024 to be somewhere around 30 million. It was pointed out below in the comments that it looks like they are slated to make 40 million on their first batch of shipments to go out in mid May. That's on 1000 doses, and apparently they already have another 19000 already produced. I'm no math magician, but it would appear that analysts got this one wrong. \n\nI mention that Keytruda is able to treat other forms of cancer, but IBRX is far from done in testing its new drug. ANKTIVA is in the pipeline for treating 8 other diseases, including lung cancer and HIV. Also, let's not forget the results here. If ANKTIVA proves to be as effective in treating other forms of cancer as it is in treating bladder cancer, that would mean a substantial increase in revenue and lots of room to grow. Now am I saying they will explode overnight? No, but the ceiling is higher than you might think. Call contracts right now expiring in December 2025, over a year and a half from now, have a break even price of around 9.50. Do you think they will grow to 9.50 a share by then, considering they are around 9 now? Given their pipeline of additional treatments and the revenue stream that has yet to be accounted for, I think so.\n\nHowever, fuck all of this. From a moral perspective, they also have the high ground. They are advancing cancer treatment. We should all be rooting for them. Not betting against them.",
                  "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2e2eae/",
                  "created": 1714740492,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l2e7and",
                      "score": 1,
                      "body": "I appreciate your analysis and enthusiasm, but also the user with the previous comments raising the devil's advocate. \n\nI think all agree that the stock should raise in value, the question with these biotechs which I think the previous user was alluding is how much of their potential is already priced in. They already have a considerable market cap relative to their current revenue, which suggests the price could already be reflecting their potential earnings. The big question will be if after the expected sales that you mentioned, if they will bring something even further. If you already know about this, it's likely wallstreet knew a week before, but thanks for starting an interesting discussion here",
                      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2e7and/",
                      "created": 1714742497,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l2e8mgm",
                          "score": 1,
                          "body": "No I appreciate the discussion. Imo. The problem with the “everything is already priced in” paradigm is that as soon as we say everything is priced in, the market would move to take advantage of that determined predictability, thus changing. There is a constant butterfly effect going on it seems. It is a living thing in a sense, no equilibrium to be found. The question I ask myself is if Wallstreet has priced it in enough, and I don’t think so. They get it wrong sometimes.",
                          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2e8mgm/",
                          "created": 1714743018,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l2e8mhk",
                              "score": 1,
                              "body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                              "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2e8mhk/",
                              "created": 1714743019,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l2e7tb0",
                      "score": 1,
                      "body": "[deleted]",
                      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2e7tb0/",
                      "created": 1714742699,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l2ea6dh",
                          "score": 1,
                          "body": "[deleted]",
                          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2ea6dh/",
                          "created": 1714743626,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l2e8qph",
              "score": 1,
              "body": "Sorry, let me rephrase it: Short-term price swings are very irrational. There can be one single failed clinical trial and all the gains get wiped out because people are scared. Intrinsical value is hard to determine in biotech stocks, which is why the volatility is so insane imo. People also overestimate how informed and educated investors are, many people who invest in biotech unfortunately don't know shit about the diseases they target, how to read studies etc. because looking merely at financials does nothing in this industry. I once pitched an investment idea to the portfolio management team of my bank who needed a replacement for a stock and I was flabbergasted about the fact that I had to explain every second term, most of which were common knowledge in my eyes. Retail investors are even worse, they just trade based on vibes, FOMO and the incomplete way they interpret corporate news. I'm very pessimistic, I always like to assume that investors are uneducated in this area. In the long term? It's a solid company and I'm sure it will succeed, not gonna argue about that at all. I'm just not sure if December 25' is enough time, I am strongly convinced it is, but I personally just bought stocks because I never trust investors, a company can have a great business model, be profitable but sometimes the market can stay irrational longer than you can stay solvent. Hope your options print though, good luck! And thanks again for your DD, it must have taken hours, very much appreciated.",
              "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2e8qph/",
              "created": 1714743065,
              "depth": 2,
              "replies": [
                {
                  "id": "l2ea6iv",
                  "score": 1,
                  "body": "Don't mind me btw, your LEAPS have plenty enough of time to work with and I am sure there will be massive traction on this stock, I am just overly cautious (burned in the past by solid companies that just had bad investor's narratives despite being highly profitable)",
                  "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2ea6iv/",
                  "created": 1714743628,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l2ed2mo",
              "score": 1,
              "body": "Side, the market makes no sense. It truly is a casino.",
              "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2ed2mo/",
              "created": 1714744719,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l2du1jr",
      "score": 21,
      "body": "Oh man. You missed a lot. You talked about sales, but they did 40 million in sales last week.\n\nThat was with 1000 treatments.\n\nThey have another 19,000 already produced.\n\nDr. Soon-Shiang the CEO has built two other companies before. Both sold in the $30 billion dollar range. He has already said that this is his biggest company. Current market cap is something like 4 billion. He's expecting a Target price of $50 a share in the very immediate future.\n\nThey're going to need a lot of media coverage in order to achieve that. But Doc-CEO also owns the LA Times.\n\nThere's also a couple other catalysts happening this weekend besides the fireside chat.",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2du1jr/",
      "created": 1714736633,
      "depth": 0,
      "replies": [
        {
          "id": "l2dxlxy",
          "score": 10,
          "body": "Ain't no way he sells under $75",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2dxlxy/",
          "created": 1714738351,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2ebl30",
          "score": 1,
          "body": "Really don't wanna be a smart-ass but PSS is not the CEO (which is Richard Adcock) but the founder and chairman. Btw, would you mind sharing where he mentioned the target price of $50? Just genuinely curious cos I haven't heard about that",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2ebl30/",
          "created": 1714744164,
          "depth": 1,
          "replies": [
            {
              "id": "l2fc6ia",
              "score": 1,
              "body": "You're right about ceo... my bad.\n\nThe $50 is napkin math based off other quips.",
              "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2fc6ia/",
              "created": 1714756953,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l2e0b8y",
      "score": 13,
      "body": "Best and most informative DD I’ve seen on IBRX yet! But be careful, multiple people have been permabanned from wsb for mentioning this stock…ridiculous",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2e0b8y/",
      "created": 1714739580,
      "depth": 0,
      "replies": [
        {
          "id": "l2e11e6",
          "score": 6,
          "body": "My focus is on the cancer treatment that is why I took an interest in this stock. I threw a small bone to people who might be interested in the financials, but cancer has affected my family, and I really wanted to focus on the role ANKTIVA has in helping to manage/treat one form of it, for now and maybe more later on, since a lot of technical details are either lost on people or go unnoticed. Their drug marks an improvement in current treatments, and deserves attention. I really appreciate you and your comment by the way.",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2e11e6/",
          "created": 1714739901,
          "depth": 1,
          "replies": [
            {
              "id": "l2e1rj0",
              "score": 3,
              "body": "You mention it's in phase 2 for the other cancers, whats the speculation of approval and timeframe?",
              "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2e1rj0/",
              "created": 1714740218,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l384t3i",
              "score": 1,
              "body": "I get you, I feel the same way about CRISPR Technology, I’ve heard a lot of people trash talk CRISPR but it has saved my life, helping to form gene altering medication with Vertex Pharmaceuticals that made medicine for Cystic Fibrosis that went from mostly living in the hospital and being talked to about adding me to the list for a lung transplant to now going to work and school full time for the first time so I tell everyone about it I think it’s the future of curing genetic mutations!",
              "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l384t3i/",
              "created": 1715221038,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l2dy78m",
      "score": 8,
      "body": "I just needed to read the last paragraph, dude. Balls deep with calls. Leaps better for sure.",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2dy78m/",
      "created": 1714738624,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2duj08",
      "score": 5,
      "body": "Going all in at open. Current hold 200 shares.",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2duj08/",
      "created": 1714736874,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2diyql",
      "score": 7,
      "body": "I am in",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2diyql/",
      "created": 1714730114,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2dvqaq",
      "score": 7,
      "body": "I‘ve holding this company for the last PDUFA (May 23) and bought back in a few weeks ago: Don‘t let yourself get shaken out by short term volatility. Setup is insane: Billionair as founder, monster pipeline and 40% short interest.",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2dvqaq/",
      "created": 1714737458,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2e3twb",
      "score": 6,
      "body": "Top notch DD. While I do think this is going to be a cash cow, the important thing here is just how ground breaking this new treatment is. You hit the nail on the head with that. \n\nIn with 100 $10 calls for June. Planning to play this thing all the way up, so will roll up and out if necessary.",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2e3twb/",
      "created": 1714741091,
      "depth": 0,
      "replies": [
        {
          "id": "l2e5dzq",
          "score": 3,
          "body": "Professor! Thank you. You truly have a lot to teach about writing comments.",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2e5dzq/",
          "created": 1714741734,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2e0put",
      "score": 5,
      "body": "I ain’t reading all that. But fuck it I’m in.",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2e0put/",
      "created": 1714739760,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2e5zne",
      "score": 6,
      "body": "Thank you for breaking it down from a medical side of things. Love all the reference links, written like a true researcher and/or scientist!\n\nMy big question for today is now that I’m out of money should I sell my PAA calls and quadruple down on this. PAA is my only material holding left outside of IBRX at this point.",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2e5zne/",
      "created": 1714741980,
      "depth": 0,
      "replies": [
        {
          "id": "l2e7qes",
          "score": 3,
          "body": "Thank you. I’m super stoked that you like the post. I am am also in on PAA for dear life. January 26 calls so I’m not feeling the heat as much as some, but god damn, they are just taking a thwacking. Can’t tell you what to do with your money though unfortunately. Only that I actually believe in both plays, especially if you got in early on PAA when that dd was first written.  I want to see how their earning results affect the stock price before making any decision on PAA though. ",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2e7qes/",
          "created": 1714742668,
          "depth": 1,
          "replies": [
            {
              "id": "l2e95p4",
              "score": 1,
              "body": "Mine aren't as long tailed as yours, but still have some time Jan '25. That being said, while there is still risk here, IBRX just seems like the better investment if I set diversification aside.",
              "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2e95p4/",
              "created": 1714743231,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l2dti1a",
      "score": 8,
      "body": "I watched a friend waste away from bladder cancer. Disgusting and hopeless way to go, vibrant triathlete to wearing a colostomy bag. \n\nHolding 400 shares. I love cheap bio tech stocks…might lose a little, might rocket unexpectedly. Lets go!",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2dti1a/",
      "created": 1714736362,
      "depth": 0,
      "replies": [
        {
          "id": "l2dvnby",
          "score": 6,
          "body": "I‘ve holding this company for the last PDUFA (May 23) and bought back in a few weeks ago: Don‘t let yourself get shaken out by short term volatility. Setup is insane: Billionair as founder, monster pipeline and 40% short interest.",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2dvnby/",
          "created": 1714737419,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2d84zl",
      "score": 7,
      "body": "Money is power. Power corrupts. So do your part and invest!",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2d84zl/",
      "created": 1714722016,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2ec5hm",
      "score": 5,
      "body": "Why was it deleted :(",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2ec5hm/",
      "created": 1714744377,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2e4j7f",
      "score": 3,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2e4j7f/",
      "created": 1714741383,
      "depth": 0,
      "replies": [
        {
          "id": "l2e599d",
          "score": 5,
          "body": "They sent out first shipment a few days ago, a week ahead of schedule. Unlike most biotechs, they are under promising and over delivering.",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2e599d/",
          "created": 1714741681,
          "depth": 1,
          "replies": [
            {
              "id": "l2e5a1a",
              "score": 2,
              "body": "Lucky for some...",
              "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2e5a1a/",
              "created": 1714741690,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l2d9jph",
      "score": 2,
      "body": "I currently own 4 7/19 10c\nDo you think that the expire is too short/should I sell for futher expire",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2d9jph/",
      "created": 1714723072,
      "depth": 0,
      "replies": [
        {
          "id": "l2da7r9",
          "score": 6,
          "body": "I can't give professional financial advice, but as a personal preference, I prefer LEAPs by in large. You gotta give the company some room to play, and the sharks at thetagang will eat you up on short expirys. I expect this company to grow over time, not overnight. Drug development takes time. However, I think now is a really good time to buy. LEAP options are very cheap on this, and shares I believe are extremely undervalued.",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2da7r9/",
          "created": 1714723573,
          "depth": 1,
          "replies": [
            {
              "id": "l2db9yn",
              "score": 3,
              "body": "Yeah fuck leverage ill just buy stock and sleep.",
              "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2db9yn/",
              "created": 1714724380,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l2dawau",
              "score": 1,
              "body": "Do you plan to hold till expire or is there a certain price target you have for the stock where you would be happy to take profits?",
              "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2dawau/",
              "created": 1714724091,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l2dz4rz",
      "score": 2,
      "body": "https://preview.redd.it/8ulhm77kf7yc1.png?width=710&format=png&auto=webp&s=845e3d8587ca55e979c314a97b107ec12838b51d",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2dz4rz/",
      "created": 1714739047,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2ec5sa",
      "score": 2,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2ec5sa/",
      "created": 1714744381,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2fr4wv",
      "score": 2,
      "body": "Any reason why I cant read the post?",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2fr4wv/",
      "created": 1714762147,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2m8o3m",
      "score": 2,
      "body": "Why was this deleted?",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2m8o3m/",
      "created": 1714866144,
      "depth": 0,
      "replies": [
        {
          "id": "l2trnu7",
          "score": 1,
          "body": "also wondering",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2trnu7/",
          "created": 1715001771,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2eja6u",
      "score": 1,
      "body": "Cancer got my dad twice, he beat it twice. Cancer got to my 3 year old daughter, she beat it. Fuck Cancer, I'm in",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2eja6u/",
      "created": 1714746980,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2fgzil",
      "score": 1,
      "body": "Aaaaaaand it’s gone.",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2fgzil/",
      "created": 1714758609,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2devss",
      "score": -8,
      "body": "My short technical analysis on this.. 2 posts praising IBRX in one hour..  inverse it guys….. Puts we come..",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2devss/",
      "created": 1714727110,
      "depth": 0,
      "replies": [
        {
          "id": "l2dfg07",
          "score": 3,
          "body": "Your prerogative. I suggest you read the post.",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2dfg07/",
          "created": 1714727530,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2di4ii",
      "score": -7,
      "body": "\"deep dive\" + very long post = AI",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2di4ii/",
      "created": 1714729514,
      "depth": 0,
      "replies": [
        {
          "id": "l2djdc7",
          "score": 5,
          "body": "You think this was AI written? Lol I am flattered, but no. This was a genuinely researched post without AI.",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2djdc7/",
          "created": 1714730397,
          "depth": 1,
          "replies": [
            {
              "id": "l2dsrvn",
              "score": -1,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2dsrvn/",
              "created": 1714735990,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l2ddsvh",
      "score": -4,
      "body": "short",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2ddsvh/",
      "created": 1714726297,
      "depth": 0,
      "replies": [
        {
          "id": "l2de9xv",
          "score": 6,
          "body": "?",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2de9xv/",
          "created": 1714726651,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2de9z6",
          "score": 2,
          "body": "Just articulate your answers instead of being a Duck",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2de9z6/",
          "created": 1714726652,
          "depth": 1,
          "replies": [
            {
              "id": "l2f10ju",
              "score": 1,
              "body": "Im going to short the shit out of this stock. another pumpndump biotech",
              "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2f10ju/",
              "created": 1714753125,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l5gfmzk",
              "score": 1,
              "body": "gkdggg ggg dddd",
              "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l5gfmzk/",
              "created": 1716550036,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l2df6km",
      "score": -5,
      "body": "Biotech… too much hope, too much promises 999 out of 1000 go to 0. It’s too risky of an investment for non doctors and non scientists like me. I prefer straight numbers. Sales, margins, revenue, cash flow.",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2df6km/",
      "created": 1714727335,
      "depth": 0,
      "replies": [
        {
          "id": "l2dpu7n",
          "score": 2,
          "body": "Even if someone is a scientist, they are still extremely hard to predict.",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2dpu7n/",
          "created": 1714734427,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2dfvfi",
          "score": 2,
          "body": "I discuss revenues in the post some. IBRX is on the way up, not down. I’m not saying it will go to 1000, but it has a lot of room to grow upwards.",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2dfvfi/",
          "created": 1714727849,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2dg63b",
      "score": -5,
      "body": "Little late to the party",
      "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2dg63b/",
      "created": 1714728070,
      "depth": 0,
      "replies": [
        {
          "id": "l2dgwgz",
          "score": 5,
          "body": "I beg to differ. IBRX is just heating up. They haven’t even started selling their drug yet. And did you even read the post and see how many other treatment pathways are in the works? It’s an exciting time to buy right now. Break even price for leap call options right now is somewhere around $9.50. The stock hit that after hours today. And there is still 2 years left on the contract. They are extremely cheap.",
          "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2dgwgz/",
          "created": 1714728619,
          "depth": 1,
          "replies": [
            {
              "id": "l2dhdhk",
              "score": 1,
              "body": "I have been following it for months, I made nice money",
              "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2dhdhk/",
              "created": 1714728968,
              "depth": 2,
              "replies": [
                {
                  "id": "l2dhjpc",
                  "score": 4,
                  "body": "I got in yesterday. I made nice money too. Will continue to make nice money as it continues to climb. Still very early. Wait till they get their drug to market starting in May. Plus now they can focus on ANKTIVA for lung cancer treatment. Anyways, hope you liked the post. I’m off to bed.",
                  "permalink": "/r/wallstreetbets/comments/1cj2wor/the_technical_bull_case_for_ibrx/l2dhjpc/",
                  "created": 1714729093,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}