{
  "title": "As a CFD retail trader, for the love of god, watch out for stop loss hunting. ",
  "score": 265,
  "selftext": "",
  "link_flair_text": "Discussion",
  "id": "1cj6kst",
  "num_comments": 80,
  "created_utc": 1714736571,
  "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/",
  "url_overridden_by_dest": "https://i.redd.it/oh1g2e0y77yc1.png",
  "comments": [
    {
      "id": "l2dtxag",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 3 days ago\n**Total Comments** | 6 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2dtxag/",
      "created": 1714736575,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2dx69m",
      "score": 147,
      "body": "I see your point but stop losses save my ass more often than they do me a disservice.",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2dx69m/",
      "created": 1714738146,
      "depth": 0,
      "replies": [
        {
          "id": "l2ebtfh",
          "score": 19,
          "body": "Someone mind explaining how this works. Are the big players waiting to go long? They temp short and go long afterwards? Because these moves happen fast in 1-2 minutes.",
          "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2ebtfh/",
          "created": 1714744252,
          "depth": 1,
          "replies": [
            {
              "id": "l2fwnw2",
              "score": 13,
              "body": "And if they bring the price down to stop you out, don’t they also have to fill a bunch of buy orders at that price ?",
              "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2fwnw2/",
              "created": 1714764099,
              "depth": 2,
              "replies": [
                {
                  "id": "l2gbvfr",
                  "score": 27,
                  "body": "From what I understand, they sandwich the price temporarily to do it.\n\nStop losses force sell, which drives the price lower. So, they force price down taking profits and/or using big shorts they don't plan to see completely fulfilled that act like a big wall for price to not go above, then volitility gets stop losses triggered and drive price down to their wall of lower buy limits, and once they get enough buy limits filled, they close their shorts and TPs(sell limits) and release the pressure in the direction they wanted. In this way, stop losses from retail traders provide the liquidity necessary to pivot or augment a position.\n\nI remember watching whales do it in real time when I traded cypto.",
                  "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2gbvfr/",
                  "created": 1714770650,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l2gny55",
                      "score": 13,
                      "body": "I forgot to mention that doing this is very illegal--they aren't supposed to be making large limit trades just to manipulate price action and pick up more orders in their favor. Doesn't stop them, though.",
                      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2gny55/",
                      "created": 1714775324,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l2hhouy",
                          "score": 3,
                          "body": "It might be illegal in the traditional Finance market. But you see it all the time in crypto.",
                          "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2hhouy/",
                          "created": 1714788067,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "l2hq7k8",
                      "score": 1,
                      "body": "When they close their shorts then the market reverses (pivot).\n\nHow will they go about if they wanted to augment their positions? Like in the above picture,  if they wanted the downtrend to continue and want to build more positions at favourable price.\n\nAnd what do you mean by \"sandwich the price\"?\n\nI am new to intraday trading. Still getting the hang of it.",
                      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2hq7k8/",
                      "created": 1714791993,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l2hq7kt",
                          "score": 2,
                          "body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                          "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2hq7kt/",
                          "created": 1714791993,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l2i85w6",
                          "score": 3,
                          "body": "Imagine that a trader places a large limit buy order at 1k and limit sell order at 1.1k. Every time it goes to 1k, he buys, and the price can never go below that price as a result of him defending the price. Thus likewise as it approcahes 1.09K, it rams against his massive  1.1k sell limit order. Then he lets volitility accumulate buy and sell orders. With enough capital, hedge fund managers can defend prices, and so they use this to push price the direction they please. When they've accumulated enough buy limits, they move the price where they want to offload orders and take profit at 1.2k. Then, they knew that there are traders who wanted price at 1.4k and put a stop loss at 0.9k. So they force price to go back down, stop all those traders out, and take buy position limits defender around at 0.7-0.9k. Then force back up to 1.4k, because those traders might fomo back in since you just took their money and moved price the direction they already believed. \n\nSee, the hard part of trading with a lot of capital is liquidity. These giants can't just market order large prices without drastically affecting the price with the sharp demand they introduced to the market. They have to do it slowly so that they get a good price on their position. Thus, they strategically use limit orders to hedge against their own positions and accumulate buy limits at a better price.\n\nIntroducing: stop loss hunting! They can manipulate price to areas they believe there are lots of liquidity to reliabilty push price around and meet their quota, self imposed or otherwise. Accumulate positions, and then pick it up elsewhere. Its like a pack of animals or a swarm of locust, migrating and finding food and picking it clean until there are fair value gaps that move price rapidly, especially in times of low liquidity. They use large limit orders, maybe even TPs of multiple trades, to trap price into a small range, with a resistance and support temporarily up. All the different hedge funds compete to control the market price and offload fastest so they make the most money, or worse. \n\nSo what are retail traders? We are the liquidity that buy their limit orders. Don't use market order. That's the lesson. Also, use a SL but do it by will, not programmed imo so you dont get needless stopped by some random market order used offensively to test liquidity or even just mistakes/misjudgements by the hedgie.",
                          "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2i85w6/",
                          "created": 1714801831,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l2i9xvl",
                              "score": 2,
                              "body": "Thanks for taking the time to write this.",
                              "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2i9xvl/",
                              "created": 1714803001,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "l2i85wk",
                              "score": 1,
                              "body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                              "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2i85wk/",
                              "created": 1714801831,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l2ihnjd",
                      "score": 1,
                      "body": "Got any articles that explain that a bit more? Maybe with a diagram as I don’t get it lol",
                      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2ihnjd/",
                      "created": 1714808463,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l2jkeaj",
                          "score": 1,
                          "body": "Ill have to make one because i haven't seen anyone talk about this specifixally, but I've seen it happen many times.",
                          "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2jkeaj/",
                          "created": 1714830560,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l2jkllj",
                              "score": 1,
                              "body": "Yes pls",
                              "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2jkllj/",
                              "created": 1714830638,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l2gbvgh",
                      "score": 0,
                      "body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2gbvgh/",
                      "created": 1714770650,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l2dy2su",
          "score": 14,
          "body": "My message would be, don't put on a tight stop loss, don't have paper hands and you'll eventually be right. Consider even placing your order at the stop loss you initially wanted to set.",
          "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2dy2su/",
          "created": 1714738568,
          "depth": 1,
          "replies": [
            {
              "id": "l2elgy1",
              "score": 58,
              "body": "“You’ll eventually be right” lol or you fucking won’t and you lose it all. \n\nThe ego here is insane. I hope you’re using this unearned confidence to pick up dimes.",
              "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2elgy1/",
              "created": 1714747749,
              "depth": 2,
              "replies": [
                {
                  "id": "l2gxbod",
                  "score": 2,
                  "body": "60%of the time, I’m right every time",
                  "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2gxbod/",
                  "created": 1714779225,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l2emx71",
                  "score": -21,
                  "body": "I say this because my main strategy today is to short very overextended stocks on the weekly timeframe during uptrends. Like Nvidia, Meta, Wingstop. Pullback to the 50 weekly moving average and I take profit",
                  "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2emx71/",
                  "created": 1714748252,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l2enwhk",
                      "score": 19,
                      "body": "Unless they don’t pull back in which case you will lose all your capital since your other strategy is to just diamond hands on the belief you’ll eventually be right \n\nJust bc you see a moving avg (the most basic bitch of all technicals btw) doesn’t mean the stock will pull back to it. Moving averages are a past metric, they are backwards looking and lagging the actual price move. They tell us basically nothing about future price movement.\n\nThey aren’t bad but this is a super basic bitch strategy that has no guarantee. So again “ill eventually be right” seems pretty fucking stupid thing to say with this strategy",
                      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2enwhk/",
                      "created": 1714748596,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l2ep1h5",
                          "score": -9,
                          "body": "I know my strategy is stupidly simple but I am up for trying as there is always profit taking in the market at some point. Timing the market is impossible, so stop loss must leave a lot of room for short term volatility. BTW I don't yolo my whole portfolio",
                          "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2ep1h5/",
                          "created": 1714748998,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l2f91ve",
                              "score": 4,
                              "body": "I think I understand what you're saying. Correct me if I'm wrong. But to me every time I've made a trade and paper handed say nvda specifically on the large downward swings, if I just held on for another day or 2 I would've went green or at least broke even. Is this what you mean? Because I'm noticing this too.",
                              "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2f91ve/",
                              "created": 1714755876,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "l2fp6ki",
                              "score": 5,
                              "body": "Everyone here thinks any short position is akin to selling 5000 OTM calls that expire tomorrow, and all shortsellers will explode eventually.\n\n\nThe reality is, you lose sometimes and as long as you manage risk its just another trade.",
                              "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2fp6ki/",
                              "created": 1714761461,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l2e281m",
              "score": 14,
              "body": "> and you'll eventually be right. \n\nThere is an old saying from the Apes time that says the market can stay rtarded longer than you can stay solvent.",
              "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2e281m/",
              "created": 1714740417,
              "depth": 2,
              "replies": [
                {
                  "id": "l2edutd",
                  "score": 1,
                  "body": "The word is irrational but close enough regard",
                  "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2edutd/",
                  "created": 1714745012,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l2dzfto",
              "score": 9,
              "body": "I agree about paper hands. If one can't handle risk then one should just buy bonds. \n\nThe trick is knowing what is paper hands and what is prudent. I do pretty well at this but that particular chart would have probably hit my stop loss and have me laughing ruefully the next day. \n\nMany strategies work and work well. The key is to stick to one's plan and adjust said plan based on data from one's trades. Any strategy is going to have \"one of those days\" and while my performance is pretty darn good that particular chart would have given me one of those days. \n\nSome days you eat bear. Some days you and Halsin have a little quality time.",
              "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2dzfto/",
              "created": 1714739186,
              "depth": 2,
              "replies": [
                {
                  "id": "l2elm3t",
                  "score": 15,
                  "body": "“Either have insane risk tolerance for losing all your capital or buy bonds there’s literally no inbetween” \n\nYou guys are unhinged",
                  "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2elm3t/",
                  "created": 1714747800,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l2f1kht",
              "score": 1,
              "body": "Bear hunters can't hunt bulls, swine, or people. Only bears.\n\n[Can't stop loss hunt me when I don't use stop loss.](https://upload.wikimedia.org/wikipedia/en/7/79/Roll_Safe_meme.jpg)\n\nI think of it as not being a soft bitch. You either win and you take your loss. There is no STOP. Only yes or no.",
              "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2f1kht/",
              "created": 1714753315,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l2eyx4e",
              "score": 1,
              "body": "You do know that you can use put options to hedge too.  It's kind of like buying insurance for your stock that accounts for volatility.  The put premium cuts into potential future profits, but it functions similarly to a stop loss.",
              "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2eyx4e/",
              "created": 1714752396,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l2ec2d1",
          "score": 5,
          "body": "If your stop losses are saving your ass often, you're analysis is terrible.\n\nUse mental stop losses or risk the chances of having price trigger your stop only for it to bounce right back up/ or down, depending on your position.",
          "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2ec2d1/",
          "created": 1714744345,
          "depth": 1,
          "replies": [
            {
              "id": "l2ec411",
              "score": 14,
              "body": "Stop losses are for the risk-averse and weak-minded. If you can't handle the heat, stay out of the kitchen.",
              "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2ec411/",
              "created": 1714744362,
              "depth": 2,
              "replies": [
                {
                  "id": "l2et7r8",
                  "score": 2,
                  "body": "Thanks vmod!",
                  "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2et7r8/",
                  "created": 1714750435,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l2hhyii",
                  "score": 1,
                  "body": "Exactly ![img](emote|t5_2th52|8882)",
                  "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2hhyii/",
                  "created": 1714788187,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l2f061f",
              "score": 3,
              "body": "(Shrug)\n\nI make money.",
              "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2f061f/",
              "created": 1714752831,
              "depth": 2,
              "replies": [
                {
                  "id": "l2f9gn9",
                  "score": 0,
                  "body": "So do people at Wendy’s.",
                  "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2f9gn9/",
                  "created": 1714756017,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l2fgtl0",
                      "score": 1,
                      "body": "Whatever. I will be here years after know it alls have gone bust.",
                      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2fgtl0/",
                      "created": 1714758552,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l2dwk8y",
      "score": 29,
      "body": "im more a minnow than goldfish so this doesnt apply to me",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2dwk8y/",
      "created": 1714737858,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2e2lft",
      "score": 51,
      "body": "The fucks a stop loss?![img](emote|t5_2th52|4271)",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2e2lft/",
      "created": 1714740577,
      "depth": 0,
      "replies": [
        {
          "id": "l2fcxw4",
          "score": 20,
          "body": "An order that automatically sells when I'm in the red? Sounds more like a Take Loss to me. 🤔",
          "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2fcxw4/",
          "created": 1714757213,
          "depth": 1,
          "replies": [
            {
              "id": "l2fzz9b",
              "score": 2,
              "body": "Correct. Stop losses are like the bumpers in bowling. You use them if you have no idea what you're doing. They help you from going to 0, but they're not foolproof.",
              "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2fzz9b/",
              "created": 1714766072,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l2g1ki6",
          "score": 2,
          "body": "Yea how do I even set one? I don’t see a big dildo button for it anywhere??",
          "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2g1ki6/",
          "created": 1714766792,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2e2oxn",
      "score": 20,
      "body": "I would rather set an alert at my stop level, monitor the stock once the alert is triggered and always wait for the candle to finish. If it finishes below you can still take your loss.",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2e2oxn/",
      "created": 1714740618,
      "depth": 0,
      "replies": [
        {
          "id": "l2fw0ra",
          "score": 8,
          "body": "This is the way. Whales can see your stop loss. They can't see your alert. ",
          "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2fw0ra/",
          "created": 1714763872,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2fwtm2",
          "score": 3,
          "body": "But do you hold your resolve and take the loss or do you adjust it slightly so you don’t have to take the l",
          "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2fwtm2/",
          "created": 1714764155,
          "depth": 1,
          "replies": [
            {
              "id": "l2g0pwd",
              "score": 3,
              "body": "I give myself the benefit of the doubt and wait for 2 5 Minuten Bars to Close beneath the Support level, than im out",
              "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2g0pwd/",
              "created": 1714766437,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l2e6jgf",
      "score": 17,
      "body": "This is why trades are free now. They use your positions against you.",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2e6jgf/",
      "created": 1714742199,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2dxz5m",
      "score": 10,
      "body": "Totally agree, my fellow regard. Unless you are selling naked options, which implies no risk definition and requires lots of margin, you should know the amount of money you can lose right before you place your order. And, yes, CFD IS THE HEAVEN FOR TRADERS, 100%! I got busted in the past in CFD operations because I didn’t know at that time I was doing, but, nowadays, I know that was my fault. Anyways, CFD IS GOLD and I don’t use any kind of stop losses.",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2dxz5m/",
      "created": 1714738521,
      "depth": 0,
      "replies": [
        {
          "id": "l2dzjrn",
          "score": 4,
          "body": "I use Etoro with 5x leverage but it's bloody expensive to maintain positions until winning.",
          "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2dzjrn/",
          "created": 1714739235,
          "depth": 1,
          "replies": [
            {
              "id": "l2e0gwk",
              "score": 5,
              "body": "Now thats pod racing.",
              "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2e0gwk/",
              "created": 1714739652,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l2e0h99",
              "score": 3,
              "body": "Now thats pod racing.",
              "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2e0h99/",
              "created": 1714739657,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l2dyobt",
          "score": 3,
          "body": "What is a trustworthy cfd platform? Banned in US right? I love them too. Like options with no expiry ",
          "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2dyobt/",
          "created": 1714738840,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2e42bt",
      "score": 7,
      "body": "Very real thing. Watch out SL hunting is very real",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2e42bt/",
      "created": 1714741189,
      "depth": 0,
      "replies": [
        {
          "id": "l2e6xhv",
          "score": 3,
          "body": "yeah, AKA market manipulation",
          "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2e6xhv/",
          "created": 1714742353,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2eekyn",
      "score": 8,
      "body": "why would you want to stop your losses? i love my losses",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2eekyn/",
      "created": 1714745286,
      "depth": 0,
      "replies": [
        {
          "id": "l2eferm",
          "score": 4,
          "body": "Losses are just tax coupons for your next gains!!",
          "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2eferm/",
          "created": 1714745595,
          "depth": 1,
          "replies": [
            {
              "id": "l2ekf66",
              "score": 2,
              "body": "not in my roth!",
              "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2ekf66/",
              "created": 1714747381,
              "depth": 2,
              "replies": [
                {
                  "id": "l2eqruy",
                  "score": 2,
                  "body": "Are you retiring in the next month? If you're retiring years from now, you're good don't worry",
                  "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2eqruy/",
                  "created": 1714749597,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l2etgsa",
      "score": 7,
      "body": "https://preview.redd.it/8vuip0hed8yc1.jpeg?width=1389&format=pjpg&auto=webp&s=c0ec81d268c8fc07c579056cbce0ebdab4b281e2\n\nGoogle, this morning...lol. The whale strategy has always been the same!!",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2etgsa/",
      "created": 1714750522,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2fd5ot",
      "score": 6,
      "body": "Expiration is my stop loss 🥲",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2fd5ot/",
      "created": 1714757289,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2e30qv",
      "score": 3,
      "body": "I’m only starting but I have seen this a lot recently-  paper handed an apple 5/3 185 call that was super otm when I bought it-  closed it at a small loss mid week",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2e30qv/",
      "created": 1714740755,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2fgqtr",
      "score": 2,
      "body": "Stop losses on options are a reaaallll quick technique of the \"fuck-around-and-find-out\" method",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2fgqtr/",
      "created": 1714758526,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2g2gff",
      "score": 2,
      "body": "What's a StopLoss?\n\nI've only had StopGains.",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2g2gff/",
      "created": 1714767146,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2e2wgw",
      "score": 1,
      "body": "What’s a stop loss?!)!(!( yuyututotpto meow.",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2e2wgw/",
      "created": 1714740706,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2e6uny",
      "score": 1,
      "body": "Is this Loss?",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2e6uny/",
      "created": 1714742322,
      "depth": 0,
      "replies": [
        {
          "id": "l2e79vr",
          "score": 1,
          "body": "Between brackets is loss",
          "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2e79vr/",
          "created": 1714742489,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2ec5kc",
      "score": 1,
      "body": "CFD degenerate detected, your point is invalidated\n\n/s don't take it too serious, I just don't like it [wink]",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2ec5kc/",
      "created": 1714744378,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2fsezc",
      "score": 1,
      "body": "the Wick Fish is real",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2fsezc/",
      "created": 1714762595,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2ftvie",
      "score": 1,
      "body": "Jokes on you, I'm the crazy homeless guy next to the pond that likes to occasionally burn money for fun.",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2ftvie/",
      "created": 1714763113,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2fwsjo",
      "score": 1,
      "body": "Look at this hotshot using computational fluid dynamics to catch goldfish at the mall.",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2fwsjo/",
      "created": 1714764145,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2g5xw2",
      "score": 1,
      "body": "I don’t set stop losses for this reason. When a was a noob this would happen all the time",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2g5xw2/",
      "created": 1714768454,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2ge8du",
      "score": 1,
      "body": "thats why you wait to be at least +5% up before putting the tigh stop loss",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2ge8du/",
      "created": 1714771530,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2gi0e8",
      "score": 1,
      "body": "The objective of an exchange is to maximize liquidity. Stop losses bundled together at some price level -are- liquidity. If you are a big fish running some VWAP buy order, the exchange will end-up doing price discovery into those bundled stops and then continue higher. That's EXACTLY how the market works. You should ask yourself maybe where that support level comes from, who \"trained\" you on it and why. Eliminate that, rinse and repeat and maybe you have a chance. Why not enter a limit order in the small fish area and benefit from that liquidity?",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2gi0e8/",
      "created": 1714772971,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2gooj8",
      "score": 1,
      "body": "Some words to live by: watch out for liquidity grabs. If you dont know what liquidity is, you are the liquidity",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2gooj8/",
      "created": 1714775619,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2e3xvp",
      "score": 0,
      "body": "If you trade like a retail trader (never using stop losses or take profit), you are destined to reap retail trader profits (-99%)",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2e3xvp/",
      "created": 1714741137,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2e4yxg",
      "score": 0,
      "body": "Cfd retail trader lmao post one successfull trade I challenge you",
      "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2e4yxg/",
      "created": 1714741565,
      "depth": 0,
      "replies": [
        {
          "id": "l2e5rxh",
          "score": 4,
          "body": "https://preview.redd.it/9xpl6300o7yc1.jpeg?width=2159&format=pjpg&auto=webp&s=dc751b03a61b2c533bb8f9c069c41408fd99c6a3",
          "permalink": "/r/wallstreetbets/comments/1cj6kst/as_a_cfd_retail_trader_for_the_love_of_god_watch/l2e5rxh/",
          "created": 1714741893,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}