{
  "title": "Yarrr",
  "score": 149,
  "selftext": "",
  "link_flair_text": "Gain",
  "id": "1cjkpdb",
  "num_comments": 22,
  "created_utc": 1714774389,
  "permalink": "/r/wallstreetbets/comments/1cjkpdb/yarrr/",
  "url_overridden_by_dest": "https://i.redd.it/v51rkvhncayc1.jpeg",
  "comments": [
    {
      "id": "l2glmu3",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 467 | **Previous Best DD** | \n**Account Age** | 9 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1cjkpdb/yarrr/l2glmu3/",
      "created": 1714774393,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2hfqzw",
      "score": 19,
      "body": "My heart is happy, nature is healing",
      "permalink": "/r/wallstreetbets/comments/1cjkpdb/yarrr/l2hfqzw/",
      "created": 1714787233,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2kxfqy",
      "score": 2,
      "body": "How did you knew about this rally ??",
      "permalink": "/r/wallstreetbets/comments/1cjkpdb/yarrr/l2kxfqy/",
      "created": 1714848126,
      "depth": 0,
      "replies": [
        {
          "id": "l2nywe2",
          "score": 2,
          "body": "There were several large sweep and block options trades totaling just over one mill in premium, all bought at or above the ask, which was then caught and posted by people who monitor options flow. Thats what started this run. And those original call buys had dates as far out as the 1/17/25 leaps, furthest OTM you can get. This was intentional by someone/an institution with an extra million bucks to spend on deep OTM calls",
          "permalink": "/r/wallstreetbets/comments/1cjkpdb/yarrr/l2nywe2/",
          "created": 1714900620,
          "depth": 1,
          "replies": [
            {
              "id": "l2sa34y",
              "score": 1,
              "body": "Can u share where unusual option flow are posted",
              "permalink": "/r/wallstreetbets/comments/1cjkpdb/yarrr/l2sa34y/",
              "created": 1714968230,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l2p2nfm",
          "score": 2,
          "body": "In my case this was just an earnings play. Bought the sell-off after the last earnings and DCAd down on the prediction that volatility or news would pump it by the next earnings report. They were profitable for the first time last quarter, I expect interesting developments from Ryan Cohen.",
          "permalink": "/r/wallstreetbets/comments/1cjkpdb/yarrr/l2p2nfm/",
          "created": 1714921852,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2jpk91",
      "score": -4,
      "body": "Sell Monday and buy ALCC calls.",
      "permalink": "/r/wallstreetbets/comments/1cjkpdb/yarrr/l2jpk91/",
      "created": 1714832642,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2lywq5",
      "score": -1,
      "body": "Doesn’t take a business school degree to know that when free lunch is being offered (3% and 1% matches) you take it. Sorry to hear you’re so bitter about your meme stocks being halted. Time to move on with your life you’ll feel better dropping the grudge I promise",
      "permalink": "/r/wallstreetbets/comments/1cjkpdb/yarrr/l2lywq5/",
      "created": 1714862004,
      "depth": 0,
      "replies": [
        {
          "id": "l2p21lh",
          "score": 1,
          "body": "I think you meant to respond to the other thread. Probably didn't see it cuz you got downvoted to shit. Interesting how you made false claims and didn't respond to any of the facts spit back. Why you shilling so hard? \n\nGotta admit its pretty strange seeing someone dick riding RH so hard they commenting on nothing but screen shots of other accounts, but you do you. You wanna find out why they so desperate for funds they offering matches, be my guest, ain't my money.",
          "permalink": "/r/wallstreetbets/comments/1cjkpdb/yarrr/l2p21lh/",
          "created": 1714921617,
          "depth": 1,
          "replies": [
            {
              "id": "l2pakum",
              "score": 1,
              "body": "I did get downvoted pretty hard. Only trying to look out for everyone",
              "permalink": "/r/wallstreetbets/comments/1cjkpdb/yarrr/l2pakum/",
              "created": 1714924869,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l2hh9lm",
      "score": -7,
      "body": "Doesn’t get any less user friendly and miserable than trying to trade options on fidelity.. you can switch back to robinhood now it’s okay I promise",
      "permalink": "/r/wallstreetbets/comments/1cjkpdb/yarrr/l2hh9lm/",
      "created": 1714787883,
      "depth": 0,
      "replies": [
        {
          "id": "l2jdz12",
          "score": 3,
          "body": "You promise... What? That they have enough funds to back the DTCC requirements the next time there's a blowup? Cuz they didn't last time. \n\nThat they won't turn off the buy button like they've done multiple times before?\n\nYou're trading a nice UI/UX for a smaller player in a big game that gets pushed around whenever it comes down to the line. You will get fucked over and over again every time it really matters.\n\nIt's okay, I promise.",
          "permalink": "/r/wallstreetbets/comments/1cjkpdb/yarrr/l2jdz12/",
          "created": 1714827921,
          "depth": 1,
          "replies": [
            {
              "id": "l2jlwap",
              "score": -3,
              "body": "They have over $100B in assets under custody now so yes I promise you’re fine and it’s okay.. I keep my life savings on the platform. Turning off buying during extreme volatility with little liquidity on overnight trading isn’t a fair comparison considering other brokers don’t even offer overnight trading. Just let it go and move on brother",
              "permalink": "/r/wallstreetbets/comments/1cjkpdb/yarrr/l2jlwap/",
              "created": 1714831174,
              "depth": 2,
              "replies": [
                {
                  "id": "l2kb8qs",
                  "score": 2,
                  "body": "They turned off buying in the middle of the trading day, wtf are you talking about? So did webull and some others. Guess who didn't? \n\nSo nah I'm good, I'll stick with one of the most trusted brokers with the one of the longest histories, with the largest bankroll and a well deserved reputation for some of the best customer service in the biz.\n\nOh btw I have an RH account. I do enjoy it's UI. But I've enjoyed your unusual choice for dick riding even more. \n\n> I keep my life savings on the platform\n\nMan you sure you want to trust them with all three grand?",
                  "permalink": "/r/wallstreetbets/comments/1cjkpdb/yarrr/l2kb8qs/",
                  "created": 1714840491,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}