{
  "title": "Why Young People in the US Are Worse Off Than Their Parents | Scott Galloway",
  "score": 239,
  "selftext": "",
  "link_flair_text": "Chart",
  "id": "1ckl59u",
  "num_comments": 113,
  "created_utc": 1714891559,
  "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/",
  "url_overridden_by_dest": "https://v.redd.it/2lfuaabb0kyc1",
  "comments": [
    {
      "id": "l2nuu1r",
      "score": 1,
      "body": "Thanks for your submission!\n\nWe love new and original content here on WSB.\n\nWe have no tolerance for basic templated memes, reposts from the front page, or boomer memes.\n\nYes, this can be a little subjective at times, but we want to show you the best WSB has to offer!\n\nIf you need some guidance, don't hesitate to reach out to modmail and we'll give you some pointers!\n\nA few tips though!\n\n• Don't just submit a chart of the current price. Come on. Google only costs $5 per search. (wait, you guys are searching for free?)\n\n• Reaction gifs are fucking lame. Put that shit in a comment, no one wants to look at your face in real life anyways so why are you making a thread about it.\n\n• Don't repost stuff. All of us are terminally online, how dare you try and make us laugh with an image posted somewhere else. Jokes aside, we don't want to beat a joke to death, so give us some fresh OC and we'll be a lot cheerier.",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nuu1r/",
      "created": 1714897525,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2nv2gz",
      "score": 22,
      "body": "Older generations were too afraid to gamble 10k on 0dte stock derivatives. Fucking pussies",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nv2gz/",
      "created": 1714897703,
      "depth": 0,
      "replies": [
        {
          "id": "l2qd3jp",
          "score": 5,
          "body": "Paper hand generation",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2qd3jp/",
          "created": 1714938976,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2nqgly",
      "score": 39,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nqgly/",
      "created": 1714894279,
      "depth": 0,
      "replies": [
        {
          "id": "l2nv72h",
          "score": 9,
          "body": "*clap clap clap clap*",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nv72h/",
          "created": 1714897802,
          "depth": 1,
          "replies": [
            {
              "id": "l2nv733",
              "score": 0,
              "body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
              "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nv733/",
              "created": 1714897803,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l2nqa5z",
      "score": 38,
      "body": "Same as in Europe.\n\n  \nThe current financial system was designed for boomers, by boomers after the end of WW II.\n\nIt was about to break in 1971, but then Nixon took the dollar out of the gold standard.\n\nThen the Ponzi scheme began, introducing fiduciary money FIAT. Both the left and the right got an easy way out of recessions, money printing. And both abused it substantially over the decades. Pushing the problem a few years later, like a hot potato game.\n\nThis scheme it's becoming unbearable. And maybe we need a big reset, to level things out.",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nqa5z/",
      "created": 1714894149,
      "depth": 0,
      "replies": [
        {
          "id": "l2ntyia",
          "score": 7,
          "body": "How can I survive the big reset? I'm legit scared",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2ntyia/",
          "created": 1714896869,
          "depth": 1,
          "replies": [
            {
              "id": "l2nvcco",
              "score": 16,
              "body": "In the US? Buying guns.",
              "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nvcco/",
              "created": 1714897912,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l2nyo91",
              "score": 9,
              "body": "Have your bugout bag already prepped. A way to start fire. A way to purify water. A way to dig holes. Comfortable shoes because you may not be able to drive for long. Have dried foods whether it be mre or freeze dried meals. A GOOD knife. A way to sharpen said knife. There are survival apps that don't require cell signal. Download one and study it. Have a location in mind if you plan to travel. Populated spaces will become hostile. Actually, just go look at r/camping and find someone's kit for surviving in backcountry.",
              "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nyo91/",
              "created": 1714900442,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l2nvb3p",
              "score": -6,
              "body": "Bitcoin",
              "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nvb3p/",
              "created": 1714897886,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l2nurhz",
          "score": 2,
          "body": "Someone already pursues the idea of great reset, but I'm not sure it's the one you'd like to see",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nurhz/",
          "created": 1714897472,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2nsbbt",
          "score": 1,
          "body": "Irs unbearable in UK tbh",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nsbbt/",
          "created": 1714895647,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2npvnc",
      "score": 18,
      "body": "Seeing a lot of Galloway these days. I think most of this stuff is tolerable but houses as an investment vehicle and the resultant inability of people from my generation to buy and own houses even half as nice as their parents could (if they can afford a house at all) is an issue that needs to be tackled. If that one problem were fixed I think people would be fine with the other shit not quite keeping pace, because at least they'd own a piece of their country.",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2npvnc/",
      "created": 1714893853,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2nmrot",
      "score": 5,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 4376 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nmrot/",
      "created": 1714891625,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2nr69l",
      "score": 9,
      "body": "I remember when this grifter advertised crypto retirement scams on his podcast with fellow scumbag Kara Swisher",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nr69l/",
      "created": 1714894803,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2npuqy",
      "score": 13,
      "body": "Fuck that. I pay into social security, I want my money back when I retire. That's the deal. Otherwise it's just theft.",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2npuqy/",
      "created": 1714893834,
      "depth": 0,
      "replies": [
        {
          "id": "l2nqxtp",
          "score": 29,
          "body": "Wait do you really think that's still possible?\n\nPlease do the math...you're going to be in awe",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nqxtp/",
          "created": 1714894630,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2nsb59",
          "score": 5,
          "body": "It's more like an insurence. Most ppl will not get more than what they put in. A saftynet wouldn't work otherwise.",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nsb59/",
          "created": 1714895643,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2ns2ah",
          "score": 6,
          "body": "But if your net worth is over 10 million, do you really need 2,000 a month?\nOthers would need all of it to survive.",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2ns2ah/",
          "created": 1714895461,
          "depth": 1,
          "replies": [
            {
              "id": "l2nv5a7",
              "score": -7,
              "body": "That's a bad chain of thought. Productive people already receive far less from social security than they would have if they invested themselves.\n\n If you can afford to buy rice and beans for the rest of the month, do you really need your next paycheck? Yes, you've been working for it and already lose a chunk of it to taxes and other externalities, but others need all of it to survive.",
              "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nv5a7/",
              "created": 1714897764,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l2onleb",
          "score": 2,
          "body": "You think you're going to get Social Security when you're old? That's cute.",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2onleb/",
          "created": 1714915686,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2nsk9d",
          "score": 1,
          "body": "You wrote and signed a contract that is paid for by people who were not even born in time to agree upon it. You have placed a burden on them which they are not able to carry. You did not create a society that is capable of providing for you in your old age. Trying to take care of all of you is strangling the youth of this country and they will not be able to take care of you for much longer. I am sorry.",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nsk9d/",
          "created": 1714895830,
          "depth": 1,
          "replies": [
            {
              "id": "l2p9nbe",
              "score": 1,
              "body": "That is so beautifully written",
              "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2p9nbe/",
              "created": 1714924518,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l2nuro9",
      "score": 7,
      "body": "Never seen so much misinformation spoken so eloquently. His points are all wrong but he just doesn't see it.\n\n  \nHis point about social security is more fair, if you were to set it up now you'd want to do it differently. But it'd be quite controversial to get rid of it now after people have been contributing for decades. In any case, it's already a progressive system where your benefits do not scale with your contributions (i.e. the rich contribute relatively much for what they receive). The system could be adjusted for sure, I don't think getting rid of it makes sense.",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nuro9/",
      "created": 1714897476,
      "depth": 0,
      "replies": [
        {
          "id": "l2onhab",
          "score": 5,
          "body": "\"His points are all wrong.\" No context, examples, sources, or counterpoints.  \n\nYou've convinced me, and my mortgage is now $1,000, thank you.",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2onhab/",
          "created": 1714915634,
          "depth": 1,
          "replies": [
            {
              "id": "l2pngu1",
              "score": 2,
              "body": "I didn't really want to bother because it's rare to find anyone willing to even discuss in good faith.\n\n  \nAnyway there's a few claims he's making. For one that the young generation has it worse, in particular in terms of finances, housing and college. Only recently a study came out which claims the opposite, stating that gen z is financially better off than previous generations. As for college he's making apples to oranges comparisons. He claims it's expensive thus inaccessible. In reality the share of people going to college has sixfolded (6!) in the post-war era, it's been on a steady rise without stop for decades, and in fact college has never been so accessible as it is today.\n\n\n\nThen there's lots of stuff about housing & college prices in general. What he fails to mention here is that the price doesn't matter, what matters is whether it can be afforded. That's a function not just of price but also of financing costs. \n\n\n\nFor example: a house that's 300k in a world of 18% interest rates like the 1980s when he was in his 20s, will cost you 1.6m over the course of the entire loan. Whereas a house that's 600k (or double) in a world of 6.5% rates that we've seen in the past year, will cost 'only' 1.3m over the course of the loan.\n\n\n\nIn other words, even after adjusting for inflation, the price of housing can have doubled and it can still be cheaper, because we live in a world of vastly cheaper debt than previous generations. But he completely leaves this out, even though it's a major function of housing & college affordability. And it's the reason that in fact, we go to college more than ever before, and live in bigger homes with fewer people than ever before.\n\n\n\nThere's a sentiment that young people have it way worse that is not substantiated in fact. He even shows this in his own presentation, that median wages have been increasing for decades which is a great result, but then says it hasn't increased as fast as the S&P500... again, apples to oranges, and glosses over the fact ultimately all shareholders are people, and the biggest shareholders are pension/retirement funds for ordinary folk. \n\n\n\nAnyway, if you look at most indicators, we're living in a better time than ever. We live longer, work fewer hours, live in bigger homes, travel more, face fewer crimes, fewer wars, we consume more etc. There's tons of books to read on this topic. Like Steven Pinker's work, or just go to [ourworldindata.org](http://ourworldindata.org) and look around. There's tons of reason to be optimistic. There's no deliberate theft of old from young, no big scheme to fuck over gen z, no big crime of previous generations against the youth. I'm young and I'd in no way shape or form would want to switch with my parents or grandparents' generation. \n\n\n\nSo I reject his gloomy pessimistic anti-old victim mentality that I should have as a young person. Although I appreciate that he obviously cares deeply about other (young) people, and that he's willing to be self-critical, I disagree with his major points.",
              "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2pngu1/",
              "created": 1714929544,
              "depth": 2,
              "replies": [
                {
                  "id": "l2qcbw9",
                  "score": 2,
                  "body": "I appreciate you actually taking the time to give a thorough answer here.  While I disagree with some of your fundamental premises here, I understand where you are coming from.  Your data, as with his, and all data, can easily be misconstrued in order to prove a point. Looking at individual data points is never going to give the totality of the situation.  The reality of the world is what actually matters.\n\nYea, college is more accessible than ever before. But also far more expensive. You cannot deny that there's millions of people drowning in debt because of predatory lending practices.  More people in college also means that people are graduating into oversaturated job markets in which it is difficult to find high paying jobs in the field they have studied.\n\nThe idea that people are living in bigger, cheaper houses just does not pan out in actuality. You can easily see that houses are double the price now than they were in the '80s adjusted for inflation, as you have noted. But you're also getting half of the house in terms of square footage. Picking an 18% interest rate for the 1980s is kind of disingenuous when that was the absolute peak for a very short period of time. How is it that I can make substantially more money than both of my parents ever did combined, yet they could afford a much nicer, much larger house than I can? How is it that people used to have a home,  two cars, and support two children on a single income, while now you'll have two college educated professionals renting a one bedroom apartment, and struggling to find a home? My uneducated grandfather built his own home, and had seven children with a single income.  You cannot just simply chalk that up to the idea that they somehow worked harder.",
                  "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2qcbw9/",
                  "created": 1714938691,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l2pngv2",
                  "score": 1,
                  "body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                  "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2pngv2/",
                  "created": 1714929544,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l2nz3sv",
          "score": 3,
          "body": "Wow ALL of his points? Can’t believe he lied his age! How old is he really then?",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nz3sv/",
          "created": 1714900781,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2o99zc",
      "score": 2,
      "body": "So let's go get our money back.",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2o99zc/",
      "created": 1714908164,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2ntzfc",
      "score": 6,
      "body": "This may be interesting but it does not belong in the Wall Street Bets sub. Speaking as someone who agrees with some of the info in the video.",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2ntzfc/",
      "created": 1714896889,
      "depth": 0,
      "replies": [
        {
          "id": "l2nv9p0",
          "score": 4,
          "body": "Meh, whatever",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nv9p0/",
          "created": 1714897856,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2nrhhw",
      "score": 5,
      "body": "Man fk em kids I got calls on ww3",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nrhhw/",
      "created": 1714895032,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2nrxgl",
      "score": 2,
      "body": "Nope, wrong.  😑 \n\nThis isn’t the first generation that is worse off than their parents. It’s the SECOND.\n\nThe first was Gen X in the year 1980, after a decade of oil shocks, high inflation and high interest rates in the 1970s.\n\nInflation improved, earnings improved, they got ahead, and it be the same for this generation.",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nrxgl/",
      "created": 1714895361,
      "depth": 0,
      "replies": [
        {
          "id": "l2nz8hd",
          "score": 2,
          "body": "When house",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nz8hd/",
          "created": 1714900883,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2nuhlk",
      "score": 2,
      "body": "Fucking gold!",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nuhlk/",
      "created": 1714897266,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2np075",
      "score": 1,
      "body": "[removed]",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2np075/",
      "created": 1714893219,
      "depth": 0,
      "replies": [
        {
          "id": "l2np07c",
          "score": 1,
          "body": "https://i.redd.it/7sbbh83mmhn91.jpg\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2np07c/",
          "created": 1714893219,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2p7v4a",
      "score": 1,
      "body": "Its been a ride learn to make trillions as farmland dissappears and add kidnappers are allowed to Extortor fathers",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2p7v4a/",
      "created": 1714923851,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2nukry",
      "score": 2,
      "body": "ok but that's pretty dumb. he has no idea about economics so who knows what he lied about here. how do i know that? because he brought up minimum wage as something \"bad\" cuz it's low.\n\nthe only reason productivity didn't drop even more and wealth isn't lower, because minimum wage didn't really get higher. so low skilled ppl can work cuz they can easily produce their \"worth\"",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nukry/",
      "created": 1714897333,
      "depth": 0,
      "replies": [
        {
          "id": "l2nwg9k",
          "score": 1,
          "body": "Yeah half this shit is cherry picked or misleading. I tried to find the source for the first statistic about 25 year old's making less than their grandparents when adjusted for inflation, but his source is literally \"Prof G analysis\", which I'm pretty sure just means himself.",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nwg9k/",
          "created": 1714898746,
          "depth": 1,
          "replies": [
            {
              "id": "l2nyik4",
              "score": 1,
              "body": "Dude just Google it if you don't believe him. I googled it and, after adjusting for inflation, it looks like we do make less. But inflation isn't even a good hallmark for buying a home since the price of houses outpaces the inflation rate.\n\nOf course this is all coming from me, or Prof W analysis, so feel free to use all of human knowledge packaged neatly in your phone to double check.",
              "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nyik4/",
              "created": 1714900321,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l2nximd",
          "score": 1,
          "body": "I'm confused. Are you saying a low minimum wage is good or bad?",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nximd/",
          "created": 1714899557,
          "depth": 1,
          "replies": [
            {
              "id": "l2nzqtp",
              "score": 0,
              "body": "low minimum wage is good. no minimum wage is even better.\n\nMilton Friedman(nobel winner), Thomas Sowell has a lot of videos online about this. \n\nthe argument is that higher minimum wage just increases unemployment among low skilled workers. this is what happens every time. so the argument that \"low wage is not a living wage so needs a mandated minimum living wage for everyone\" doesn't work because what happens is that those people who couldn't live off of the low wage now can't live off even more because now they get 0 dollars instead of low wage. so they are even worse. plus there are a lot of other issues like higher entry to make a new business etc.\n\nsurprisingly enough the biggest beneficiaries for minimum wage laws are big corporations, because you mandate a big entry to be their competition so now they can become gigahuge monopole companies even more because now they have less competition.",
              "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nzqtp/",
              "created": 1714901282,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l2nvt1v",
          "score": 1,
          "body": "You watched the whole video and the thing you came away with is “nuh uh, minimum wage shouldn’t be higher” ?",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nvt1v/",
          "created": 1714898262,
          "depth": 1,
          "replies": [
            {
              "id": "l2nzewy",
              "score": 0,
              "body": "no, but i know from listening to 50h of economics from Milton Friedman (nobel economist winner) Thomas Sowell, Angus Deaton (nobel winner) that high minimum wage is bad. so him advocating for it shows he has no fucking idea what he is talking about. so about the other stuff i have no expertise in is just as untrustworthy.\n\nbut i could say the same thing to you. i wrote 4 lines and all you came away with \"nuh uh, he said high minimum wage is bad\"",
              "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nzewy/",
              "created": 1714901024,
              "depth": 2,
              "replies": [
                {
                  "id": "l2o066t",
                  "score": 2,
                  "body": "After you said Milton Friedman everything makes sense. 😂",
                  "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2o066t/",
                  "created": 1714901613,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l2p1zsl",
                      "score": -1,
                      "body": "is that supposed to mean you think milton friedman is wrong?\n\nwell after you implied that you know economics better than a nobel prize winner economist(+ 99% of economists who agree with him) everything makes sense :D",
                      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2p1zsl/",
                      "created": 1714921598,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l2pc75x",
                          "score": 1,
                          "body": "I think Uncle Milty is an actual con-artist. 😮",
                          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2pc75x/",
                          "created": 1714925481,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l2pcvv9",
                              "score": -1,
                              "body": ":D\n\nso is thomas sowell? or Angus Deaton?\n\nwhy do they give all these con artists nobel awards?\n\nis adam smith a con artist too? despite modern economy based on his 2books? \n\nbut i guess ppl like you who live in LaLa-Land believe everybody is a con-artist who have different opinion to yours, even if they are an expert at that field you know it better. god forbid you change your mind and worldview about things, it is always the world who is wrong (incluiding all the economists in the world :D ): D",
                              "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2pcvv9/",
                              "created": 1714925737,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l2pp421",
                                  "score": 2,
                                  "body": "Oh shut up you hypocrite. Paul Krugman also a Nobel recipient, but I highly doubt you see him as a reliable economist.",
                                  "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2pp421/",
                                  "created": 1714930128,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l2ptyxb",
                                      "score": 1,
                                      "body": "yes a famous leftist \"economist\" who famously predicted nearly everything wrong for the future. very reliable guy. \n\nbut to tell you the truth i didn't even know he got nobel nor did i read his thesis unlike the others. so he might have some expertise in those areas he got the nobel prize, despite having no idea about basic other stuff. plus deaton+friedman's nobel prize winning work was at least related to minimum wage somewhat so at least they knew what they were talking about lul.",
                                      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2ptyxb/",
                                      "created": 1714931902,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l2pu6iz",
                                          "score": 1,
                                          "body": "So basically you’re guilty of what you accused me of.\n\nWhat a clown.",
                                          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2pu6iz/",
                                          "created": 1714931980,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "l2pu71c",
                                      "score": 1,
                                      "body": "although i watched this debate of his with Deaton:\n\nhttps://www.youtube.com/watch?v=SRBsDcHoWZU&t=5s\n\nEDIT: full video of their debate:\n\nhttps://www.youtube.com/watch?v=g3WfzXUce2E",
                                      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2pu71c/",
                                      "created": 1714931986,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l2puujv",
                                          "score": 1,
                                          "body": "Zzzzzzzz",
                                          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2puujv/",
                                          "created": 1714932226,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l2oo0i1",
                  "score": 1,
                  "body": "I think part of the problem was that your comment was pretty incomprehensible. Definitely reads like someone who has an excellent handle on economics.",
                  "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2oo0i1/",
                  "created": 1714915876,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l2p27tu",
                      "score": 1,
                      "body": "well i do have an excellent handle on economics after 50h of studying it. i didnt have to invent stuff like adam smith did, all i had to do is learn it. so yes i have a good handle on it.",
                      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2p27tu/",
                      "created": 1714921685,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l2p2rx9",
                          "score": 0,
                          "body": "50 hours of listening to a single source, you're pretty much an expert now. My bad.",
                          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2p2rx9/",
                          "created": 1714921901,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l2p32im",
                              "score": 1,
                              "body": "i kinda am yes. unlike you who have no fucking idea about anything, you are expert of shitposting. listen to 1-2h of it and you will see how wrong you are if you dont believe me\n\nhow many hours do you think they teach basic economics in university per year?",
                              "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2p32im/",
                              "created": 1714922017,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l2p4x0w",
                                  "score": 1,
                                  "body": "You are right, I have no idea about anything at all. I'm sure your unfounded assumptions are valid. Your belief in the matter is all that counts anyway. Not any objective factual data.\n\nYour math is extremely sound though. If you take a class for 1.5 hrs per week, T/Th let's say, for 15 weeks, that's 45 hours. Excluding any homework.  So, about 50 hours yeah.\n\nYour expert level of economic analysis equates to one freshman level class. One semester, Econ 101. Understood, you have made your point precisely. Thank you for clearing it up.",
                                  "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2p4x0w/",
                                  "created": 1714922732,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l2pbm7j",
                                      "score": 0,
                                      "body": "exactly.\n\nbut the \"minimum wage\" argument is so basic, it's like asking a first year student in Math university if he is an expert at adding numbers together... which you know probably anybody is a fking expert after 4th grade elementary school.\n\nso yes, every first year student is an expert at basics like minimum wage just like you are an expert at adding 2 positive numbers together. (let's say less than 100 whole numbers). \n\nor another example: \n\nsince you did the math of this 1,5h per week for 15weeks and you calculated that it's 45hours, should i ask that you are an expert and can i believe yuo that 1,5h per week for 15weeks is 45hours?! it would be pretty dumb for me to ask that because you didnt need to invent multiplying, you only had to learn it. so yeah you are kinda an expert at multiplying. \n\nhope i shed some light how ignorant you are about this topic. too bad ppl like you never change. maybe in 3-4month when you forget about this conversation how you looked silly, then you will change your opinion about minimum wage and even openly teach it to ppl, but until then keep on believing that high minimum wage is good LOL.\n\n**note: btw** 1,5h per week for 15weeks is 22h. but ok. normally a full year is around 30 weeks 26 i think) so you were lucky that the end result 50h was ballparkly ok even if math wasn't ok. but i assume you made a mistake which is normal, and you can actually multiply basic thngs and can actually read and write like most humans.",
                                      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2pbm7j/",
                                      "created": 1714925259,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l2qf5l2",
                                          "score": 1,
                                          "body": "It's pretty silly that you think you cleared anything up, the only thing you proved is that you're much much dumber than I originally thought.  Well played. I said 1.5 hours a week on T/Th which is 2 days a week (T/Th means Tuesday/Thursday which would be any obvious for anybody who's been to college). Since you are not capable of basic math obviously. 1.5 * 2 = 3. 3 * 15 = 45. As I said. Maybe you are not yet an expert in multiplication, or you just have very poor reading comprehension. I'm not sure.  Also, the 30 weeks you mentioned is a year of college classes yes, but a single class only lasts for one semester, 15 weeks. I'm not sure what point you're trying to make here other than to further demonstrate your confusion, and lack of rational thought.\n\nBy your logic I'm also an expert in economics, except I have way more hours in than you do.  By your definition I'm probably a master in economics.  I've probably studied economics for 500 hours easily, and i don't consider myself any where near an expert. By your reasoning,I am also an expert in geology, anthropology, physics, chemistry, mathematics, biology, literature, art, feminism, philosophy.  I'm basically a fucking genius over here, by your reasoning. \n\nAnd I never took any stance on minimum wage, or advocated for anything in regard to the matter. Again you are simply making incorrect assumptions.  I only pointed out that listening to a single source for 50 hours in no way makes you an expert. It just proves that thinking so makes you an idiot. I could easily read five books in 50 hours, and obtain multiple points of view from nylon sources. But as we've already established, you don't read so well. \n\nThe fact that you think understanding the complexity economics is on par with the simplicity of addition and subtraction is very telling.",
                                          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2qf5l2/",
                                          "created": 1714939757,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l2oo1zq",
      "score": 0,
      "body": "Total bullshit there is no social contract. Us born kids are just lazy and uneducated.",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2oo1zq/",
      "created": 1714915895,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2nnjj0",
      "score": -7,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nnjj0/",
      "created": 1714892178,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2nrkzl",
      "score": -9,
      "body": "My parents were given 20K so they could buy a house. My husband and I lived in studio apartment for years into our mid thirties so we could afford a house. Interest rates were 12.5% to 17% on home mortgages. The price of gasoline tripled. Inflation was off the charts. We lived under constant threats of nuclear war. I had $11.00 an hour after earning my masters degree. We were low balled on salary because there were young and didn’t have experience or were women and men needed the money to support the family. After 49 years with professional licensure and years of dedication I made $25.00 per hour in 2019. This is to say yes young people are having a tough time but so have the last four generations before them also. I am sorry that they are dealing with difficulty but they need to know the wars, disease, inflation, civil strife and know that those who have gone before lived them ( their children and grandchildren) have lived with all they same or similar problems. They are not being singled out and this is the way of life",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nrkzl/",
      "created": 1714895106,
      "depth": 0,
      "replies": [
        {
          "id": "l2ooqtc",
          "score": 2,
          "body": "The way of life is to constantly make things worse for the generations that come after? Is that your point here? My grandfather had a gigantic house built, and had seven children, and did it on a single income, without a college education.",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2ooqtc/",
          "created": 1714916200,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2nr92y",
      "score": -27,
      "body": "Nonsense cherry-picked data. \n\nYoung people today have infinitely more opprunitities than any previous generation. The fact that so many can choose to make less money and still enjoy all the bread and circus with their cheap super computers in their pockets and endless entertainment speaks to that.\n\nHouses are a higher multiple of income, but houses today are so much better. Better size. Better layout. Better insulation. Better safety, never mind the fact that you can fill them with endless gadgets on the cheap.\n\nAs for college, adults can make a choice in where they go and what they pay. We have an overabundance of people getting nonsense degrees already. Why subsidize it further?\n\nAlso, why is this in /r/wsb? Go post in any other of the mindless complaining subreddits. People want to see things relating to markets here. Not the ignorant cries of the lazy youth.",
      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nr92y/",
      "created": 1714894860,
      "depth": 0,
      "replies": [
        {
          "id": "l2ns06g",
          "score": 15,
          "body": "You fit perfectly here you regard",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2ns06g/",
          "created": 1714895418,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2opbrx",
          "score": 3,
          "body": "Ok, Grandpa, let's get you to bed.  The idea that houses today are bigger and better than those of the past is completely delusional. Sure, we have better technology for installation and waterproofing, I'll give you that; it's also 100 times the price.",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2opbrx/",
          "created": 1714916454,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2nu1bm",
          "score": 3,
          "body": "New gen wants to buy house to live in not rent until death.",
          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nu1bm/",
          "created": 1714896928,
          "depth": 1,
          "replies": [
            {
              "id": "l2nuror",
              "score": -4,
              "body": "Meh, owning a home creates liquidity issues in the labor market. Ideally, we want the labor force to be as mobile as possible to migrate to where they are most productive. Being tied to real estate in a locale doesn't enable the liquidity we need in a modern labor force.\n\nAlso, even though I own several rentals myself, overall, homes are an inefficient allocation of capital. New gen should be looking to deploy their money more efficiently.",
              "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nuror/",
              "created": 1714897476,
              "depth": 2,
              "replies": [
                {
                  "id": "l2nwe55",
                  "score": 2,
                  "body": "Liquidity in the labour market? Are you just throwing buzzwords together and hoping they stick?\n\nAnd the last thing any country wants is a migrating labor force. We tend to like our workers working for us",
                  "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nwe55/",
                  "created": 1714898702,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l2nxk60",
                      "score": 0,
                      "body": "It's very simple. As a society, we want labor to be as liquid and fungible as possible. Labor is increasing inefficiently allocated as we add transactional friction to reallocating labor. Buying and selling a home is a major transactional friction.\n\nSame reason why unions are an absolute cancer on society",
                      "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nxk60/",
                      "created": 1714899590,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l2nxk6f",
                          "score": 5,
                          "body": "How about you funge on deez nuts. *right clicks erotically*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                          "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2nxk6f/",
                          "created": 1714899590,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l2o0315",
                              "score": 1,
                              "body": "[deleted]",
                              "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2o0315/",
                              "created": 1714901547,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l2o031l",
                                  "score": 1,
                                  "body": "How about you funge on deez nuts. *right clicks erotically*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                                  "permalink": "/r/wallstreetbets/comments/1ckl59u/why_young_people_in_the_us_are_worse_off_than/l2o031l/",
                                  "created": 1714901547,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}