{
  "title": "SPACs - The Art of The Steal - Analytics of DeSPACS",
  "score": 67,
  "selftext": "I write this post as a forewarning to those looking to invest into SPACs and DeSPACs. Over the long-run even DeSPACs that are well known typically underperform the market. I thought I would share the data I collected, so that others might be better informed with their stock purchases.\n\n**THE WELL KNOWN DeSPACs**\n\nhttps://preview.redd.it/yggey68tgmyc1.png?width=1618&format=png&auto=webp&s=27071d634875b20ce5d77222e74f3af9272e6af0\n\nThere are many more then just this. But I chose these as they were some of the most hyped DeSPACs over the last few years. You can probably see that the majority are deep red.\n\n**WELL LETS LOOK AT ALL THE SPACS I ANALYZED (mainly from 2021-2024):**\n\nI analyzed 448 DeSPACs in total to understand the full picture. If the company was bought out I set the price equal to the buyout price. If the price merged and the investor received stock, I calculated it based on the price of the stock that it merged with.\n\n[IPO offering price is typically 10 dollars and has been adjusted for reverse splits. This is close to the price the insiders originally valued the company at \\(typically overvalued still\\).](https://preview.redd.it/zk914wivgmyc1.png?width=667&format=png&auto=webp&s=54638a20be30e2e0b097140fff4adf138a7039b7)\n\nSo yeah, If you are a long-term holder of a DeSPAC, you have a higher chance of the company going Bankrupt/Delisted/Liquidated than being profitable on your purchase if you bought at what the insiders valued the company at.\n\n**OTHER STATS:**\n\nAverage Return: -68.8% Probability of >100% Return: 1.56% (only 7)\n\nProbability of losing 90% or more: 42.63% Probability of losing 99.9% or more: 10.04%\n\n**THE 33 PROFITABLE TICKERS AS OF 05/05/2024:**\n\nADSE 9.2% BWMX 121.03% ZGN 27.10% BOWL 25.45% ROIV 12.10%\n\nLFG 160% CLBT 7.2% CCCS 8.10% ROVR 10% ENVX 0.90%\n\nPNT 25% PWP 54.9% JBI 37.8% HIMS 12.6% NAMS 118.2%\n\nGRND 2.9% WEST 5.2% ALVO 44% AFRI 4.8% SYM 311.3%\n\nMLTX 352.6% under marketcap HHRS 53.6% OCS 28% NPWR 10.8%\n\nMTAL 28.5% ABL 20.6% ENGN 55.1% AIRJ 14.5% SOC 7.4%\n\nDJT 379.3% TH 12% DKNG 317.9%\n\nI'm not goin to list the 415 that are red, but the average return for just the red ones are -78.99%.\n\n**THE THREE SPACS THAT ARE GETTING SHILLED CURRENTLY:**\n\n**DJT (TRUTH SOCIAL) -** The stock has 40M free float and up to 210M full float when all is said and done. Trump has registered to sell all of his shares on the SEC filing dated the 15th of April (He owns 55% of the potential full float or about 65% of current float). He will be able to sell roughly in September, unless he gets a waver, then he may be able to sell earlier. Does not mean he will sell all his shares, but he does owe 1/2B in legal fees currently. Also there is 20M in Warrants that can get converted. LCID tanked 20% on the day that the warrants converted over.\n\n*If you are buying a stock that was valued by the insiders at around $10 for the IPO, and you are spending double to triple the value that the insiders overvalued the company at, well all I can say is good luck to you.*\n\n**ALCC (OKLO)-** Company is NOT an AI stock, it is a nuclear stock without approval from the NRC. It is nothing but an idea until they get approved. I'm all for Nuclear and would like to see this stock succeed, but it has a lot of hurdles to go through, and by hurdles I mean likely dilution to cover various business operations until they might get approval.\n\n**SKGR (WEBULL) -** let me say SOFI is down -30%. Financial stocks through SPACs don't always tend to do the greatest.\n\n**AUTHORS FINAL THOUGHTS:**\n\nSo before you get into the hype train -take a step back and make sure you understand the long-term outlook for these companies. Doesn't mean you can't trade them, just know what you are holding. An informed investor is better than someone who takes DD from a Wendy's worker.\n\nAlso, I conducted a seance with Victor Hugo, this is what he said about SPAC investors:\n\n\"The One Shall Kill The Other\" -By that, the SPAC shall kill the retail investor. We shall now construct your financial future if you buy these stocks at 2x - 4x the initial IPO offering Price ($10): You have become a tatterdemalion sitting beside the refuse of the sandwich shop in Paris owned by Dame de Wendsly. Long are your days, and longer are you nights. Your daily activity is to make gibberish sounds to the passerby that sounds like the letters G U and H smooshed into some illiterate nonsense.\"\n\nThanks Victor, also check out my book:\n\n[This is Not a Real Book](https://preview.redd.it/qmy7c4lygmyc1.png?width=652&format=png&auto=webp&s=708ade020dd2a41d0f163453a89b104f53413ed6)\n\nI have no positions on any DeSPAC or SPAC currently. I plan to enter into some sort of spread on DJT once I can better predict when the warrants will convert. (Trump's Accountant just got axed, so could be a while as there will likely need to be an amendment to their registration filing. Rather convenient for the whole fighting of the short seller thing the CEO keeps going on about.)",
  "link_flair_text": "Discussion",
  "id": "1ckt6ik",
  "num_comments": 60,
  "created_utc": 1714921218,
  "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/",
  "comments": [
    {
      "id": "l2p10ox",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 96 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2p10ox/",
      "created": 1714921222,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2patwb",
      "score": 49,
      "body": "ALCC is tied to AI because of Sam Altman albeit indirectly. He is most likely going to leverage his OpenAI connections to create deals for Oklo which will allow them to open data centers for AI based companies that uses clean energy. You never know if the NRC activities could be getting processed in the background and some sort of announcement can happen right as the merger occurs\n\nhttps://www.nrc.gov/reactors/new-reactors/advanced/who-were-working-with/licensing-activities/pre-application-activities/okla-aurora-powerhouse.html",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2patwb/",
      "created": 1714924963,
      "depth": 0,
      "replies": [
        {
          "id": "l2pkjpm",
          "score": 13,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2pkjpm/",
          "created": 1714928532,
          "depth": 1,
          "replies": [
            {
              "id": "l38y6y6",
              "score": 2,
              "body": "https://preview.redd.it/1xobjll3kczc1.jpeg?width=2880&format=pjpg&auto=webp&s=08a0cff97e7a1dfb5a68748c386ef124b380343d",
              "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l38y6y6/",
              "created": 1715236957,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l2q7n4h",
          "score": -6,
          "body": "I was trying to look into ALCC to understand their business better.  The four companies listed on their website that they say they are investors in are down significantly the last 2 years while ALCC stock was pretty constant.   Does have me questioning their judgment some.  I’m sure there’s more to their business but their website does not give much detail.",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2q7n4h/",
          "created": 1714936955,
          "depth": 1,
          "replies": [
            {
              "id": "l2qalo2",
              "score": 11,
              "body": "? ALCC is an acquisition company that will be disappear after the merger and turn into Oklo (Oklo.com) which is what you should be looking at\n\nSimilar to how DWAC turned into DJT",
              "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2qalo2/",
              "created": 1714938057,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l2qd3go",
              "score": 7,
              "body": "ALCC price history means nothing until it’s voted on and official.",
              "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2qd3go/",
              "created": 1714938975,
              "depth": 2,
              "replies": [
                {
                  "id": "l2rghkq",
                  "score": 2,
                  "body": "Didn’t it start at 10? For the cash injection that ALCC wants to give OKLO, doesn’t it needs to remain at 10 minimum? Why would it go any lower than that?",
                  "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2rghkq/",
                  "created": 1714954691,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l2shgn1",
                      "score": 1,
                      "body": "Because they give OKLO shares of ALCC depending on price and/or time (each SPAC deal is slightly different) the. OKLO sells those shares to invest in the business until they are cash flow positive. That’s why so many SPAC’s get crushed if they can’t build capital fast like a draftkings business model.",
                      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2shgn1/",
                      "created": 1714972492,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l2t0w3k",
                          "score": 1,
                          "body": "What does building capital fast mean here? OKLO will definitely not be cash flow positive anytime soon. Draftking was already doing somewhat well when it merged",
                          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2t0w3k/",
                          "created": 1714986617,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l3lh3cf",
          "score": 1,
          "body": "Is there an average timeline for these kind of things? What can a business conduct prior to the NRC approvals? Is there any way to generate revenue before NRC approvals?",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l3lh3cf/",
          "created": 1715446877,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2pehl1",
      "score": 20,
      "body": "Nice DD but almost no one into ALCC is waiting more than a few days after merger to unload. Most just want the usual post voting day to first day of trading run up that's seen in most SPACs.\n\nAnd as far as the NRC denying Oklo, it is expected as the governmental regulatory body is not keen into innovative techniques, which is what Oklo is trying. Either NRC relaxes its stringent regs so pioneers can try to produce nuclear energy efficiently or firms like Oklo die out.",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2pehl1/",
      "created": 1714926329,
      "depth": 0,
      "replies": [
        {
          "id": "l2peu6n",
          "score": 13,
          "body": "I want OKLO to succeed, I love nuclear Power. The NRC definitely is the scary factor at play for that company.",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2peu6n/",
          "created": 1714926461,
          "depth": 1,
          "replies": [
            {
              "id": "l2pi5pv",
              "score": 9,
              "body": "Same. Nuclear is a must. The Rus-Ukr war shows that if oil is cut off, countries (like Germany) shut down. The Texas hail that smashed $ Bil worth of solar panels proves nothing is impervious. It's nuclear waste handling that needs to be streamlined, along with prevention of anything remotely close to the Chernobyl meltdown.\n\nI hear from more knowledgable folks that Oklo has hired former NRC employees to \"persuade\" the govt. Seems like it is a case of cock-blocking by dinosaurs who harp too much on safety and don't realize new ideas are needed to ensure we don't run out of juice.",
              "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2pi5pv/",
              "created": 1714927681,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l2pwoms",
          "score": 6,
          "body": "“Almost noone into alcc is waiting more than a few days after merger to unload”… you know what happens when everyone is on the same boat? It often doesn’t playout the way everyone is expecting it to.",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2pwoms/",
          "created": 1714932903,
          "depth": 1,
          "replies": [
            {
              "id": "l2q7arq",
              "score": 2,
              "body": "![img](emote|t5_2th52|4275)",
              "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2q7arq/",
              "created": 1714936831,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l2svk1y",
          "score": 2,
          "body": "NRC cannot ‘relax’ the regs, lol. They don’t make the rules, they admin them. Regs are strigenent for a reason, ",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2svk1y/",
          "created": 1714982486,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2qw5cf",
      "score": 14,
      "body": "SPACS are a terrible investment generally. In the case of ALCC, I’m one of the people who bought in at $13 and plans on holding on. Even at $6 per billion after dilution, I’m investing at just over $2B valuation. This is a bet on Sam Altman. I don’t think he’s trying to cash out at these valuations. Open-AI speaks for itself. I’m betting that his SPAC will be an exception. But I do expect it to be volatile… best of luck to all",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2qw5cf/",
      "created": 1714946157,
      "depth": 0,
      "replies": [
        {
          "id": "l2rhd3u",
          "score": 10,
          "body": "Yeah like what does Altman has to gain by ruining his reputation for a cheap cash grab like Chamath? Altman potentially wants to raise a lot of money in future so why waste credibility on something this relatively small\n\nIf he believes that OKLO has the best chance to give the world small and safe nuclear generators then it’s not stupid to bet with him at $10-$15 per share rate",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2rhd3u/",
          "created": 1714955074,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2rkgxp",
          "score": 4,
          "body": "You aren't wrong, but I think that it can take several years for Oklo to get gov't permits, if ever.",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2rkgxp/",
          "created": 1714956427,
          "depth": 1,
          "replies": [
            {
              "id": "l2rqe46",
              "score": 2,
              "body": "That’s the same argument that has always been made for everything revolutionary from BTC to TSLA. It can take years for the tech to get there but not for the stock to get there in anticipation.",
              "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2rqe46/",
              "created": 1714959022,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l2toygl",
              "score": 1,
              "body": "Just get Chat-GPT to write the NRC reapplication ✍️",
              "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2toygl/",
              "created": 1715000615,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l2pcbg8",
      "score": 11,
      "body": "That auditor, Borgers, audited about 500 companies. There are about 500 spacs. Were they auditing every SPAC?",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2pcbg8/",
      "created": 1714925526,
      "depth": 0,
      "replies": [
        {
          "id": "l2pcj1w",
          "score": 2,
          "body": "Made me Laugh, Take my upvote!",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2pcj1w/",
          "created": 1714925606,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2q66hz",
      "score": 9,
      "body": "No VRT at 820%?",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2q66hz/",
      "created": 1714936437,
      "depth": 0,
      "replies": [
        {
          "id": "l2q7g97",
          "score": 3,
          "body": "I will add that to my dataset. Dataset should be complete from 2021-2024. I’m still compiling 2019-2020. I’ll add it to the list. Thanks man!",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2q7g97/",
          "created": 1714936884,
          "depth": 1,
          "replies": [
            {
              "id": "l2q8m8s",
              "score": 1,
              "body": "Now worries, guessing you have UTZ for that set also?",
              "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2q8m8s/",
              "created": 1714937317,
              "depth": 2,
              "replies": [
                {
                  "id": "l2q94r4",
                  "score": 3,
                  "body": "I have UTZ as a ticker I need to add, not currently in dataset yet, thanks again.",
                  "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2q94r4/",
                  "created": 1714937511,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l2q9ip0",
                      "score": 5,
                      "body": "👍 Must be a laugh wading through the -99% tickers . A good read though. I'd be curious how traditional IPOs over that time faired.",
                      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2q9ip0/",
                      "created": 1714937655,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l2s26bk",
          "score": 1,
          "body": "Are you in VRT? I'm bullish, but I don't think they have much more room to run, maybe 30%.",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2s26bk/",
          "created": 1714964178,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2qdqu1",
      "score": 6,
      "body": "Great post, I stay away from 99% of SPAC deals, I’m glad that was a great decision looking at these stats!\n\nThe only one I’ve ever held was draftkings and I don’t know that was SPAC plus I use it all the time. \n\nI also went for $12.50 ALCC calls but seeing so many people on here waiting to dump after the vote makes me wanna dump mine tomorrow as I’m already up 70%",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2qdqu1/",
      "created": 1714939222,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2p47mp",
      "score": 11,
      "body": "Thanks for this. Can you elaborate on timing of the possible dilution of ALCC? When are they allowed to etc. ",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2p47mp/",
      "created": 1714922459,
      "depth": 0,
      "replies": [
        {
          "id": "l2p9l4u",
          "score": 19,
          "body": "If you’re referring to insiders (not technically dilution) they’re locked up do to a securities law. 6 months or a year usually. Would just control F 180 days or 365/1year on the relevant filing. As far as typical dilution to raise capital, that’s not possible for 1 year, also do to sec rules. What kills spacs when they merge is usually FPAs, SEPAs. None on ALCC. \n\nThere’s a small backstop to meet the cash minimum requirement for the company of $250m they have really close to $250m already so it would likely be minimal (1 share/roughly $10). \n\nI don’t think there’s a PIPE, that’s the other thing that usually brings down spacs but I’m not 100% sure there. Would have to check the filing. That requires registration as well but usually takes 2-3 months post merger. Also no warrants or rights on this ticker. Which also dilutes the float.",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2p9l4u/",
          "created": 1714924496,
          "depth": 1,
          "replies": [
            {
              "id": "l2piens",
              "score": 8,
              "body": "Thanks. So there really \"shouldn't\" be much downside action? Not saying it won't dump at some point but still...looks like the whales can keep pumping this up.",
              "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2piens/",
              "created": 1714927767,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l2pde3i",
              "score": 5,
              "body": "Thanks a lot.",
              "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2pde3i/",
              "created": 1714925923,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l2rgqkq",
              "score": 3,
              "body": "No FPAs and SEPAs on ALCC- doesn’t that make OPs DD useless ?",
              "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2rgqkq/",
              "created": 1714954798,
              "depth": 2,
              "replies": [
                {
                  "id": "l2rn3tm",
                  "score": 7,
                  "body": "A little bit. There won’t be dumping on the side of ALCC. The one thing that hasn’t been mentioned is arbitrageurs. They buy spacs below nav and sell above nav, if it doesn’t go above they redeem their shares bc the trust usually grows from interest. The spac has been trading well above nav so I imagine most arbs are out at this point though. If they’re holding post merger for some odd reason, they might hold quite a few shares they can sell.",
                  "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2rn3tm/",
                  "created": 1714957581,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l2p4jpe",
          "score": 4,
          "body": "We don’t know anything definitive until post merger. At least for timeframe wise.",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2p4jpe/",
          "created": 1714922589,
          "depth": 1,
          "replies": [
            {
              "id": "l2p63jt",
              "score": 0,
              "body": "So can they dilute BEFORE the merger?",
              "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2p63jt/",
              "created": 1714923181,
              "depth": 2,
              "replies": [
                {
                  "id": "l2p7hk5",
                  "score": 9,
                  "body": "Not normally. Dilution is typically to raise capital to cover costs of operation, expansion ect. Insiders selling their stakes in the merged company (typically 6 month post merge) dilutes the free float.",
                  "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2p7hk5/",
                  "created": 1714923709,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l2qrur6",
      "score": 6,
      "body": "So what would, historically, be the best time to sell stock that goes through SPAC process, short swing? I have position in ALCC, 13.XX, its my first time playing this game and I am not smart.\n\nSell tmrw, wait for vote, couple days after vote? I am open to everything",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2qrur6/",
      "created": 1714944517,
      "depth": 0,
      "replies": [
        {
          "id": "l2qw6t0",
          "score": 2,
          "body": "Impossible to say, but typically when a stock is at peak excitement and converse it’s about time for a pullback.",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2qw6t0/",
          "created": 1714946173,
          "depth": 1,
          "replies": [
            {
              "id": "l2r5r56",
              "score": 1,
              "body": "Yep, looked little in SPACs in history. The whole accumulation process tends to take a couple of weeks sometimes. I dont know if I am mentally stable to survive that. We will see...",
              "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2r5r56/",
              "created": 1714950046,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l2p87iw",
      "score": 8,
      "body": "I think it would be more beneficial to see SPACs vs traditional IPOs",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2p87iw/",
      "created": 1714923980,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2pgffp",
      "score": 6,
      "body": "Good DD. I’m in at ALCC at $13.xx will surf the hype tomorrow and may sell if it goes up on Monday.\n\nI think this direct comparison with DWAC -DJT is too good to be true.\n\nOnly playing 500 shares",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2pgffp/",
      "created": 1714927049,
      "depth": 0,
      "replies": [
        {
          "id": "l2q3f8p",
          "score": 5,
          "body": "smart man playing shares, no impact from IV or theta decay like if you were long on options",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2q3f8p/",
          "created": 1714935417,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2pu94w",
          "score": 4,
          "body": "Yeah I'm in at $13.xx as well, roughly 107 shares. Plan to sell on Tuesday at the latest ",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2pu94w/",
          "created": 1714932007,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l2pz6wy",
          "score": 3,
          "body": "Same, jumped in at 14.xx and managed to avg down to 13.3. I'm not quite sure whether I'm going to hold into the ticker change or sell after the vote.",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2pz6wy/",
          "created": 1714933832,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2q35z3",
      "score": 2,
      "body": "i can vouch for this guy and his DD, fun times shorting VinFast, another SPAC garbage that was pumped to $80 and sank down to $3 now in less than 1 year",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2q35z3/",
      "created": 1714935320,
      "depth": 0,
      "replies": [
        {
          "id": "l2q3tfl",
          "score": 4,
          "body": "Lol, that was a great time. Can only hope the options come down a bit in volatility on DJT and we can do it all over again.",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2q3tfl/",
          "created": 1714935564,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2p6308",
      "score": 6,
      "body": "No one should put their money in SPACs ever.\n\nIt’s essentially wallstreets shitcoin.\n\nGreat data.",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2p6308/",
      "created": 1714923175,
      "depth": 0,
      "replies": [
        {
          "id": "l2r7pqo",
          "score": 3,
          "body": "This is WSB sir!",
          "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2r7pqo/",
          "created": 1714950877,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2qx8u8",
      "score": 1,
      "body": "oh yeah, I realized that too late though 😆",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2qx8u8/",
      "created": 1714946590,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2rayrj",
      "score": 1,
      "body": "Y’all talk too much",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2rayrj/",
      "created": 1714952280,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2rcbln",
      "score": 1,
      "body": "Game recognize DeGame",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2rcbln/",
      "created": 1714952869,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2soz86",
      "score": 1,
      "body": "SYM never mentioned anywhere but did great. SoftBank backed SPAC with working logistics tech for robotic palletizing/depalletizing warehouses. Hopefully it comes back down.",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2soz86/",
      "created": 1714977560,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2w8t8f",
      "score": 1,
      "body": "What about MP",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l2w8t8f/",
      "created": 1715033614,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l31o5yb",
      "score": 2,
      "body": "SoFi in this list of SPAC may surprise to the upside in H2 2024. This is a fintech company firing on all cylinders and is expected to be TTM GAAP net income profitable by Q3 2024 (November 2024). With 1-2 rate cuts expected in H2 2024, in addition to the company re-adjusting risk/reward in their three different segments of business, I would not be surprised if this does improves from $7 to $20 (SP) by year end. \n\n$20 or 200% gain may seem optimistic but if you were to value this solely as just growing \"bank\", this would imply a market Price to Tangible Book Value of 4-5x. Current Tangible Book Value is about $4, which implies $16-$20. If you were to value it as a fintech (given that SoFi does own Galileo and Technisys), all bets are off as to what the market would value this company at.",
      "permalink": "/r/wallstreetbets/comments/1ckt6ik/spacs_the_art_of_the_steal_analytics_of_despacs/l31o5yb/",
      "created": 1715120081,
      "depth": 0,
      "replies": []
    }
  ]
}