{
  "title": "I hope you guys bought CVNA puts",
  "score": 39,
  "selftext": "Looks like insiders are selling hard recently. I have never really understood how the stock could be worth so much, but I'm in with January $35 puts.",
  "link_flair_text": "Discussion",
  "id": "1clus1b",
  "num_comments": 87,
  "created_utc": 1715031149,
  "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/",
  "url_overridden_by_dest": "https://www.barchart.com/stocks/quotes/CVNA/insider-trades",
  "comments": [
    {
      "id": "l2w265v",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 8 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 310 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2w265v/",
      "created": 1715031153,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2w31pt",
      "score": 32,
      "body": "Good thing I added Cvna puts to my watchlist 😮‍💨,",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2w31pt/",
      "created": 1715031473,
      "depth": 0,
      "replies": [
        {
          "id": "l2w4v3e",
          "score": 14,
          "body": "Same, along with another 5 that are 80% up on the day. Watchlist 🥰🥰🥰",
          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2w4v3e/",
          "created": 1715032138,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2wgkud",
      "score": 46,
      "body": "I love when hedge funds get on Reddit and try to get retailers to buy puts so they can ride the wall of worry. I wouldn’t touch Cvna puts until August. Liquidity is back in this market. Short at your own peril. It’s wayyyyyy too early. This thing is probably going to 200 before 30",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2wgkud/",
      "created": 1715036648,
      "depth": 0,
      "replies": [
        {
          "id": "l2wmk9q",
          "score": 14,
          "body": "Nah, once the rate cut in June is officially canceled this shitstain gets flushed down the drain",
          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2wmk9q/",
          "created": 1715039121,
          "depth": 1,
          "replies": [
            {
              "id": "l2xttyb",
              "score": 2,
              "body": "We haven't even started talking about the rate hike in June yet",
              "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2xttyb/",
              "created": 1715058107,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l2wtor1",
              "score": -3,
              "body": "The rate cut is already priced out for June. You must not track Fed fund futures.",
              "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2wtor1/",
              "created": 1715042045,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l2wpry3",
          "score": 4,
          "body": "Timing doesn't have to be perfect, close enough is fine with this inflated pile of crap. Everyone knows this stock will be back to <50, just not when.\n\nInstead of trying to time it perfectly, just buy the direction and give yourself enough room to miss the perfect moment.",
          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2wpry3/",
          "created": 1715040448,
          "depth": 1,
          "replies": [
            {
              "id": "l2wudpa",
              "score": 3,
              "body": "I hear what you’re saying but it’s way too early to be shorting stuff right now. Janet yellen just announced treasury buy backs and the Fed is tapering its QT. And we’re like 1% away from ATH. You don’t think we’re going to at least 550 on Spy in the near term? If so you don’t think these risk assets will catch a bid?\n\nGood luck 🍀",
              "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2wudpa/",
              "created": 1715042323,
              "depth": 2,
              "replies": [
                {
                  "id": "l2x1nzj",
                  "score": 4,
                  "body": "That's the thing, though, nobody knows what will happen to the market, let alone an individual stock. Tomorrow, we could enter a significant period down. Next week, there might be a whistle-blower event within CVNA. And next month we could enter a major upswing of SP500 whilst CVNA tanks to 25 because there are better opportunities available and money flows out.\n\n\nTrying to time the market to within a few months is a fool's game.",
                  "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2x1nzj/",
                  "created": 1715045281,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l2xmbkl",
                      "score": -2,
                      "body": "Jerome Powell basically just told everyone the Fed put is in play. If you didn’t hear it you’re new to this game.",
                      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2xmbkl/",
                      "created": 1715054042,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l2xperz",
                          "score": 2,
                          "body": "If you truly believe that the public information you refer to has significant predictive power over what the price of CVNA will do in the coming months....well then sir you are truly delusionally regarded.",
                          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2xperz/",
                          "created": 1715055636,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l2xq79l",
                              "score": -3,
                              "body": "I never said I believed anything besides it has higher odds of going to 200 before it goes to 30 in the near term. More than likely it’ll trade somewhere between 90 - 150 until October.",
                              "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2xq79l/",
                              "created": 1715056058,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l36yr6i",
                  "score": 1,
                  "body": "Look at their balance sheet. They could conceivably be out of cash in 6 months.",
                  "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l36yr6i/",
                  "created": 1715204465,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l3c23ur",
                      "score": 1,
                      "body": "You guys are early",
                      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l3c23ur/",
                      "created": 1715286734,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lasp2i2",
                          "score": 1,
                          "body": "So far you’ve been spot on lol",
                          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/lasp2i2/",
                          "created": 1719642569,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lasr4ve",
                              "score": 1,
                              "body": "Dude these people will not allow this market to meaningfully fall until after this election. Uncertainty will hit in September and there may be the typical rebound after the election but I actually doubt it. \n\nI think if you want to be safe and not miss the down move maybe start shorting at the end of July and maybe you’ll get lucky and the market trades sideways for a bit until the fear sets in. But I would wait until we start seeing these next earnings reports to get bearish.",
                              "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/lasr4ve/",
                              "created": 1719643917,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lat8yce",
                                  "score": 1,
                                  "body": "Couldn’t agree more. So far the mkt is moving exactly how it does in election years. So if that continues July is up pretty big. WTF do you think is going on with cvna though? Is it some sort of short squeeze? Is it perhaps in some weird basket of stocks that helps it get dragged up? It shouldn’t be pumping like this",
                                  "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/lat8yce/",
                                  "created": 1719655982,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lavljik",
                                      "score": 1,
                                      "body": "Short answer: they have enough revenue to pump. Short sellers probably exited and added buying pressure last year. It won’t stop until everything stops because they may be winning the car auction market. But those are still going to be dead assets when things get repriced at some point. Lending hasn’t stopped so the consumer is still buying. This will change I promise lol. I know people now that are being approved on loans to consolidate their credit card debt. The bubble is out there, the powers that be are getting creative on keeping it going.",
                                      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/lavljik/",
                                      "created": 1719690445,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lfvbcgm",
                          "score": 1,
                          "body": "You guys are early. Hopefully you sold when it went back down to $100.",
                          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/lfvbcgm/",
                          "created": 1722457427,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l2wuz6r",
              "score": 2,
              "body": "puts/shorting is all about timing lol",
              "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2wuz6r/",
              "created": 1715042563,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l3c4q8z",
              "score": 0,
              "body": "Today is a prime example. You can be early on a short.",
              "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l3c4q8z/",
              "created": 1715287627,
              "depth": 2,
              "replies": [
                {
                  "id": "l3c56df",
                  "score": 1,
                  "body": "Dude, the price is literally lower than 2 days ago....\nMaybe it'll go higher, maybe it'll go lower on the short term, betting that it'll be <<100 in January 2026 is a valid approach regardless of that.",
                  "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l3c56df/",
                  "created": 1715287782,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l3c7ac0",
                      "score": 0,
                      "body": "If it goes to 200 first you’re going to be underwater the whole time you’re holding it. I’m with your thesis I’m just pointing out that we’re at an inflection point. If we have ONE cool inflation reading spy will be at 600 before you know it. The tide rises all boats.",
                      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l3c7ac0/",
                      "created": 1715288496,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lfvbjp5",
              "score": 0,
              "body": "Is CVNA < 50 in the room with you now? I told you, you’re early.",
              "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/lfvbjp5/",
              "created": 1722457490,
              "depth": 2,
              "replies": [
                {
                  "id": "lfvd5m0",
                  "score": 1,
                  "body": "Dude, it's been 3 months.... check back with me in 1.5 years, and we'll see who came out on top.\nAnd even if it's sitting at 200 then, who cares, I win some, and I lose some.\n\n\nHave you been waiting 3 months for this earnings call to go back to old Reddit posts to say: \"I told you so\" ?\n\n\nThat's kind of.....sad don't you agree?",
                  "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/lfvd5m0/",
                  "created": 1722458001,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfvfk04",
                      "score": 0,
                      "body": "It’s wallstreetbets, yes I waited 3 months to come back and say this. You need to learn more about liquidity. Your short position only has one thing going in its favor: CVNA is a shitty company. \n\nShorting companies should be done when you have multiple things going in its favor. Timing does matter when making long term plays.",
                      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/lfvfk04/",
                      "created": 1722458758,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfvhdkl",
                          "score": 1,
                          "body": "I'm sure in your head you are the hero, but it just seems kind of sad and awkward to do this.....\n\n\nThis is a short-term play of 1-2 years, which I believe has a good likelihood of paying out compared to the risk. If you want to point out that 3 months in it hasn't paid out yet, you just don't get it.\n\n\nI guess you are more into the monthly coin flips, even there it makes no sense to point at it going the \"wrong\" direction a few days in. You do understand that, don't you?",
                          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/lfvhdkl/",
                          "created": 1722459337,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lfvj3rd",
                              "score": 1,
                              "body": "I’m not trying to talk sh*t I’m really just trying to teach a lesson. And look if we’re being honest you getting so emotional tells me you didn’t sell when it went back to 100. I bet you were up 25-30% at that moment. I see so many investors saying “you can’t time the market” that is a sad old saying from an era when making money was easy. You absolutely can time the market. The problem is we get real emotional and follow single names. What you should be doing is tracking the overall market and single names. The narrative was clear in May, the FED and treasury signaled they were pumping the market. You could have sold for a 20-30% gain and then waited and got back in and shorted it again. That’s good EV. This shit is like poker, if you don’t time it right you’re killing your EV.",
                              "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/lfvj3rd/",
                              "created": 1722459891,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lfvmw8y",
                                  "score": 1,
                                  "body": "With respect, you have not much to teach me dude. You are teaching me how you still just don't get it, and don't even realize it yourself.\n\n\nIt's funny to see how you are projecting your own perspective into your hypothetical scenario. I don't know whether I could've sold for 20% when it dropped to 100, because that is not relevant to the play. I'm not checking this regularly, I'm not emotionally attached to whatever it does...\n\nI'm playing for it to sharply drop <<50 within the next 1.5 years. Why would I take profits if it's hovering at 100 for reasons unrelated to the fundamentals? That is a whole different play, which would've required a different entry and sizing.\n\n\nLook at your comment, your point is that if you time the market right in the time-frame of weeks/months you can be a profitable 'investor'. And then you turn around and say you think it's smart to take 20-30% profit.\nSure dude, talk to you in a few years and we'll see how things are going.",
                                  "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/lfvmw8y/",
                                  "created": 1722461134,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lfvng6f",
                                      "score": 0,
                                      "body": "You realize the best hedge funds out there, and I mean the best, are killing for a +30% annualized return on capital? If you’re ever up 30% and don’t sell you’re an absolute amateur.",
                                      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/lfvng6f/",
                                      "created": 1722461317,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lfw81so",
                                          "score": 1,
                                          "body": "This tells me more than enough about how (not) smart of a speculator you actually are.\n\nYou are talking about total annual returns of 30% being massive, but this is about individual positions within a constraint timeframe, many of which make-up the total return in the end.  \nDo you think hedge funds sell their individual positions and sit on cash when they achieve some specific return in a specific period? What do you think their actual returns would be if their individual positions automatically would get sold when they hit ..% profit?\n\nSaying that you should sell your position as soon as it hits a certain threshold for profit makes no sense, you end up missing ALL the runs above that threshold per definition. You will ALWAYS do worse than just the whole market, per definition.\n\n\n\nWhat you SHOULD do, and what professionals actually do:  \nYou make a thesis that you believe in based on the information available to you, then you find a strategy that has a positive expected value. Then you implement that strategy and continuously update your thesis and re-adjust if it changes enough.\n\nSo that means: If your thesis says that company A will be priced by the market at $100 by 2030, then you are not going to sell when it is priced $12 in 2025. No matter what your profit/loss would be at that time.",
                                          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/lfw81so/",
                                          "created": 1722468641,
                                          "depth": 9,
                                          "replies": []
                                        },
                                        {
                                          "id": "lfvnxgz",
                                          "score": 0,
                                          "body": "-amateur\n\nnoun\n\n1. a person who engages in a pursuit, especially a sport, on an unpaid rather than a professional basis.",
                                          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/lfvnxgz/",
                                          "created": 1722461475,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l2wgvf8",
          "score": 9,
          "body": "Also, this is almost exactly like the stupid post the other day about snap. Guess what happened? Snap is up like 15-20% since. \n\nSmart bears are hibernating right now. If you are a bear you should be in cash until summer or long the VIX into 2025.",
          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2wgvf8/",
          "created": 1715036768,
          "depth": 1,
          "replies": [
            {
              "id": "l2wsnbp",
              "score": 0,
              "body": "bears should be embracing Sell In May And Go Away",
              "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2wsnbp/",
              "created": 1715041622,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l31lv0t",
          "score": 1,
          "body": "After today's news.....u still think $200?",
          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l31lv0t/",
          "created": 1715119209,
          "depth": 1,
          "replies": [
            {
              "id": "l322nx6",
              "score": 2,
              "body": "You obviously didn’t read my comment. I said better chance of hitting 200 than 30 in the short term.",
              "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l322nx6/",
              "created": 1715125725,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l322sdx",
              "score": 1,
              "body": "Also what was today’s news?",
              "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l322sdx/",
              "created": 1715125774,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l2wguoc",
          "score": 0,
          "body": "I agree. Maybe sooner than August but this thing has some legs",
          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2wguoc/",
          "created": 1715036759,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2w3ae5",
      "score": 7,
      "body": "Imma buy cvna puts and sbux calls",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2w3ae5/",
      "created": 1715031563,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2w9xpl",
      "score": 5,
      "body": "Why wouldn't anyone exercise and sell at ATHs? They learned from 2021",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2w9xpl/",
      "created": 1715034042,
      "depth": 0,
      "replies": [
        {
          "id": "l2wexam",
          "score": -1,
          "body": "hi, could you explain a bit?\nthnx",
          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2wexam/",
          "created": 1715035985,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2w3roj",
      "score": 4,
      "body": "There has to be a reason that regarded chart doesn't automatically show the value for wherever you are horizontally on the chart.",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2w3roj/",
      "created": 1715031738,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2w4p5a",
      "score": 4,
      "body": "Damn straight",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2w4p5a/",
      "created": 1715032077,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2wp4ay",
      "score": 3,
      "body": "Ngl I’ve been in snap and cvna puts and sbux calls",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2wp4ay/",
      "created": 1715040178,
      "depth": 0,
      "replies": [
        {
          "id": "l2x4uzd",
          "score": 2,
          "body": "I just bought CVNA puts and SBUX calls today. Weird.",
          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2x4uzd/",
          "created": 1715046577,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2w4nlv",
      "score": 4,
      "body": "Maybe just mass profit taking 🤷‍♂️",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2w4nlv/",
      "created": 1715032062,
      "depth": 0,
      "replies": [
        {
          "id": "l2wyvmx",
          "score": 0,
          "body": "This. A lot of people did it in my company...",
          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2wyvmx/",
          "created": 1715044172,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2w858b",
      "score": 4,
      "body": "Shit company \nPraying my shorts print",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2w858b/",
      "created": 1715033360,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2x4xkq",
      "score": 2,
      "body": "Wen crash?",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2x4xkq/",
      "created": 1715046607,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2xakjv",
      "score": 2,
      "body": "Have 4 $30 Jan puts and plan on loading up if it goes 200+. Like I’m selling my MSFT calls and going balls deep. This shits gonna tank at some point.",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2xakjv/",
      "created": 1715048849,
      "depth": 0,
      "replies": [
        {
          "id": "l2xcszk",
          "score": 1,
          "body": "Agree. Going to keep adding my puts",
          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2xcszk/",
          "created": 1715049761,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2xkvrf",
      "score": 2,
      "body": "Thanks for the heads up! I like the 6/21 100p\n\nIV isn’t too bad, there’s some volume and OI.\n\nJust gonna buy 1 then average down 1 if needed. I’m scared of this stock and it’s weird hype train haha",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2xkvrf/",
      "created": 1715053332,
      "depth": 0,
      "replies": [
        {
          "id": "l2xl24c",
          "score": 2,
          "body": "Yes my all macro measures I don't see how they're crushing it while every other used dealers are struggling, especially when floorplan costs are sky high and margins being squeezed fast.",
          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2xl24c/",
          "created": 1715053418,
          "depth": 1,
          "replies": [
            {
              "id": "l2xlfia",
              "score": 2,
              "body": "Yes, the logical choice is puts. But this trash is not logical.\n\nI’m gonna look for my strike at around 3.50 contract. May be able to get a 2-3x on it if it drops fast enough.",
              "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2xlfia/",
              "created": 1715053603,
              "depth": 2,
              "replies": [
                {
                  "id": "l2xm02h",
                  "score": 1,
                  "body": "Just put in some orders for 110p 6/21. Any other suggestions from a timing perspective?",
                  "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2xm02h/",
                  "created": 1715053882,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l36zd5y",
                      "score": 1,
                      "body": "Went with 400 Puts $40 for that expiration as a lotto. This shit co blows up and I clear a mil.",
                      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l36zd5y/",
                      "created": 1715204681,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l322g8l",
      "score": 2,
      "body": "Sept & nov pootz $70. Cheers 🍻",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l322g8l/",
      "created": 1715125638,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l332r19",
      "score": 2,
      "body": "Why is nobody asking  why their Fin release shows Cash and cash equivalent went down $250 million……. Isn’t that still a substantial amount of cash??",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l332r19/",
      "created": 1715140933,
      "depth": 0,
      "replies": [
        {
          "id": "l36zjqv",
          "score": 1,
          "body": "Just look at their working capital. They may be struggling to make payroll early Q3. No amount of macro trend can fix that.",
          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l36zjqv/",
          "created": 1715204746,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l3d760q",
          "score": 1,
          "body": "Anyone….anyone??",
          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l3d760q/",
          "created": 1715302433,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l3337sc",
      "score": 2,
      "body": "This is ENRON with fucking tires fellas.  Trust Me…",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l3337sc/",
      "created": 1715141174,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4b6pd6",
      "score": 2,
      "body": "Inverse WSB strikes again",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l4b6pd6/",
      "created": 1715869486,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2xpcl1",
      "score": 1,
      "body": "All those guys gonna get convicted for fraud in a few years",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2xpcl1/",
      "created": 1715055604,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2xtqzj",
      "score": 1,
      "body": "What am I missing? The sales look pretty modest to me.",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2xtqzj/",
      "created": 1715058058,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2xxki9",
      "score": 1,
      "body": "I mean they have a lot of stock still, some bought in when it was like $7 or $35, it makes sense they’d sell some.",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2xxki9/",
      "created": 1715060438,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2zixoo",
      "score": 1,
      "body": "Nvidia ✈️✈️✈️✈️",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2zixoo/",
      "created": 1715093019,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l342afm",
      "score": 1,
      "body": "Put prices too high",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l342afm/",
      "created": 1715165501,
      "depth": 0,
      "replies": [
        {
          "id": "l3d7eu8",
          "score": 1,
          "body": "Agree",
          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l3d7eu8/",
          "created": 1715302534,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l351j4e",
      "score": 1,
      "body": "I don’t like to be on the side of retail. Yikes, I wish yall were bullish.",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l351j4e/",
      "created": 1715180813,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l3d7o0g",
      "score": 1,
      "body": "Why has the owners family and all executive staff selling their shares over last 2 months",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l3d7o0g/",
      "created": 1715302638,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfrxoya",
      "score": 1,
      "body": "Ouch …",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/lfrxoya/",
      "created": 1722407576,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2x2mgb",
      "score": 1,
      "body": "Wouldnt touch this stock with someone elses 10 foot pole",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2x2mgb/",
      "created": 1715045666,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l2x9v1d",
      "score": 1,
      "body": "The company managed to reduce their total debt by around $1b in the last 12 months, if I read correctly from Google finance. This is very impressive.",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2x9v1d/",
      "created": 1715048572,
      "depth": 0,
      "replies": [
        {
          "id": "l2ytm2y",
          "score": 5,
          "body": "That reduction of 1b debt was due to restructuring from unsecured notes to secured notes. Now all assets are collateralized for the debt. Earlier debt was not collaterized. Instead of 7b, its 6b now but collaterized with 10 to 12% cash interest.",
          "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2ytm2y/",
          "created": 1715082479,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l2wrdz4",
      "score": 0,
      "body": "So Many institutions own. They can do what they want.",
      "permalink": "/r/wallstreetbets/comments/1clus1b/i_hope_you_guys_bought_cvna_puts/l2wrdz4/",
      "created": 1715041105,
      "depth": 0,
      "replies": []
    }
  ]
}