{
  "title": "Uber position update and thoughts going forward",
  "score": 47,
  "selftext": "**Position Update**\n\nAbout a month ago I posted DD about how Uber was going to miss earnings. They reported yesterday before the open and as the prediction materialized, I had a lot of people ask me to post a position update and gains.\n\nWhen I created that post, I had just initiated a position of a 100 share short, 18 July $70 puts and 15 May $65 puts. I have since traded around the position and posted regular updates on the original post in the comments as they changed up until a couple of weeks ago.\n\nhttps://preview.redd.it/2ublza1defzc1.png?width=820&format=png&auto=webp&s=e23903f9ab8f9bb98781f9e5eb90ac984a7b5727\n\nThere's a lot here, but to summarize, I am now short 1100 shares and have closed all options except 10 lotto weekly $62 puts that I opened on Tuesday EOD that I expect to expire worthless. Net, on the options I made $8,185. On the short I'm up roughly $2,600 as of this morning with today's pump.\n\nI covered 200 shares of my 900 share short on Wednesday and opened 10 $65 puts and then added another 10 yesterday in the early session when the stock pumped and then sold them all an hour or two later.\n\n**Thoughts Going Forward**\n\nSo where do I stand now on Uber? I still think this is a trash business and easy short and I'm still significantly short with no plans to cover. Actually I promptly put out another 400 shares yesterday at the open. For those interested, here I'll explain why.\n\nThe CEO is full of crap. They have no play in self-driving, they divested themselves of their autonomous unit but still want the best of both worlds- to be considered a call on the future of self-driving by being “the network” while not actually investing any money in its development and slashing costs left and right to try and eek out a profit (which they still are barely able to do with peak travel).\n\nWhat makes Uber's situation unique is that they have enormous stock holdings relative to cash and they are barely profitable so these momentary movements have a huge effect on their quarterly income. Kinda crazy for a $160 billion company’s fortunes to be tied to three stocks with a combined market cap of $42 billion. I listened to Dara's interview yesterday on Squawk Box and he talked about their significant investments. What they really own are three spac stocks that they use as a call option on the autonomous/delivery future theme so they can play the foward-thinking future of logistics card.\n\nI travelled last quarter many times for work and I’ve never seen it so busy. Yet Uber still managed to miss gross bookings estimates. Their comps will never be more difficult than they are now and that is why I think this stock is heading much lower over the next several months. This is also the ultimate macro-sensitive stock as consumers will slash spending on ride sharing and delivery almost before anything else in a downturn.\n\n**But capital gains and losses are priced in and the Street doesn't care about them!**\n\nAt least half the replies to my original post pointed out that the accounting for cap gains/losses was well known and certainly priced in yet I never heard a single talking head mention that as a consideration. I guess it’s so well known it goes without saying? /s\n\nI even got the following chat from a concerned Redditor:\n\n*\"Hey saw your post on Uber. Not trying to hate but just a heads up that your thesis is wrong.*\n\n*1) People won’t care about those losses / it’s not part of core results.*\n\n*2) The value of the stock holdings represent a low single digit % of Uber’s market cap.*\n\n*Happy to help if you have any other q’s on stock stuff / I do this professionally\"*\n\n**Let this be a lesson-** **the street doesn’t know shit** and people don’t read earnings reports beyond the headline numbers. If I, a complete accounting layman could figure this out in about a half hour of research scanning their 10-Q, it is pretty clear nobody reads them.\n\nThis is a stock that has been divorced from reality for months as it’s more than doubled on no fundamental news. I still think its one of the best short opportunities in the market and headed much lower as comps get more and more difficult coming out of this travel season and their own efforts to maximize profitability. They have no more levers to pull and are entirely dependent on the ebbs and flows of the consumer and regulators.\n\nThey masquerade as a logistics tech autonomous platform company when what they really are is a glorified taxi company with much higher costs. The CEO is a charlatan. He has no innovative ability but for some reason Wall Street thinks he's the second coming of Steve Jobs. On the contrary he's a bean counter who has slashed their R&D budget to focus on achieving profitability which they still haven't been able to consistently achieve. They basically do two things- maintain apps and handle customer service inquiries. **This will never be a significantly profitable business. The economics of it just don’t work.**\n\n**Edit:** Just came across this on Twitter: [https://twitter.com/CNBCClosingBell/status/1788287155652923805](https://twitter.com/CNBCClosingBell/status/1788287155652923805)\n\nWhat an idiot. And this dude actually gets paid to spout this nonsense. So marked to market losses mean nothing? Then why didn't the bulls cite the 2x beat last quarter as a nothingburger?\n\nAnd the comparison to Berkshire is fucking hilarious. Uber is invested in complete garbage unprofitable shitcos and only three of them. The real reason they hold them is to pretend as if they're investing in autonomous driving and delivery in China. They have $5.5 billion in those investments and only $5 billion in cash. So when those stocks drop it makes a big difference. Of course the CEO will waive it off as nothing to make the numbers look better. But they also didn't even hit their estimates of gross bookings. That is the real reason the stock got hammered. I'll be back to see this putz when the stock has a 4 handle on it. From his analysis it is obvious he has no idea what he's even investing in (and he claims it's his largest position!).",
  "link_flair_text": "DD",
  "id": "1co15x8",
  "num_comments": 6,
  "created_utc": 1715271475,
  "permalink": "/r/wallstreetbets/comments/1co15x8/uber_position_update_and_thoughts_going_forward/",
  "comments": [
    {
      "id": "l3atwcf",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 6 years ago\n**Total Comments** | 4389 | **Previous Best DD** | \n**Account Age** | 13 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1co15x8/uber_position_update_and_thoughts_going_forward/l3atwcf/",
      "created": 1715271486,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l3ay60d",
      "score": 12,
      "body": "You got any other observations that I can money on? Lmk cuz I need some gains otherwise I'm sleeping in a Wendy's dumpster let alone work there.",
      "permalink": "/r/wallstreetbets/comments/1co15x8/uber_position_update_and_thoughts_going_forward/l3ay60d/",
      "created": 1715272990,
      "depth": 0,
      "replies": [
        {
          "id": "l3ay7ny",
          "score": 20,
          "body": "Observation: Go to a soup kitchen.",
          "permalink": "/r/wallstreetbets/comments/1co15x8/uber_position_update_and_thoughts_going_forward/l3ay7ny/",
          "created": 1715273006,
          "depth": 1,
          "replies": [
            {
              "id": "l3ayxjl",
              "score": 2,
              "body": "Tf I thought you were a bot this time. Didn't think you had a regard personality",
              "permalink": "/r/wallstreetbets/comments/1co15x8/uber_position_update_and_thoughts_going_forward/l3ayxjl/",
              "created": 1715273261,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8gv6om",
      "score": 1,
      "body": "So how much did you make?",
      "permalink": "/r/wallstreetbets/comments/1co15x8/uber_position_update_and_thoughts_going_forward/l8gv6om/",
      "created": 1718305415,
      "depth": 0,
      "replies": []
    }
  ]
}