{
  "title": "NYCB Sells Off $5B Loans to JPMorgan",
  "score": 24,
  "selftext": "NYCB tonight reported that they have agreed to sell $5B of warehouse mortgages to JPMorgan. \n\nThis company is shorted HEAVILY and it could squeeze soon. \n\nThe disposal of these so-called mortgage warehouse loans will bolster NYCB’s capital and improve its liquidity, with proceeds to be held in cash and securities, the company said Tuesday in a statement that didn’t disclose the terms. NYCB had told investors about two weeks ago that it was poised to do a deal of that size at par, minus a transaction fee.\n\n\nReasons why they are looking to shed these mortgages:\n\nNew York Community Bank Faces Headwinds: Heavy Loans and Short Sellers\n\nNew York Community Bank (NYCB) has found itself in rough waters recently. The bank's stock price has plummeted, and analysts point to a confluence of factors behind the struggles.\n\nCommercial Real Estate Exposure: A significant contributor to NYCB's woes is its heavy concentration on commercial real estate loans. This vulnerability stems in part from its 2023 acquisition of Signature Bank, which significantly increased its commercial real estate portfolio. The pandemic's work-from-home shift has dampened demand for office space, putting a strain on borrowers and raising the risk of defaults.\n\nRent-Regulated Multifamily Woes:  Adding to the commercial real estate woes is NYCB's sizeable portfolio of loans tied to rent-regulated multifamily buildings in New York City. Rising interest rates and inflation are squeezing these landlords, making it difficult to refinance loans or raise rents to cover increased expenses. New York's strict rent stabilization laws further limit their ability to recoup costs.\n\nInternal Control Issues:  Further complicating matters, NYCB identified weaknesses in its internal loan review processes. This raises concerns about the bank's ability to properly assess risk and manage its loan portfolio effectively. These issues led to a credit rating downgrade, further eroding investor confidence.\n\nShort Sellers Circle In:  With these vulnerabilities exposed, short sellers have piled on. Short sellers aim to profit by betting a stock price will fall. The factors mentioned above provide them with ammunition, as they believe NYCB's loan portfolio will lead to significant losses. A declining stock price can then trigger a self-fulfilling prophecy, as negative press and investor panic accelerate the fall.\n\nNYCB has taken steps to shore itself up, securing a capital infusion from outside investors. However, the bank faces an uphill battle. The health of the commercial real estate market and its ability to navigate the challenges of its rent-regulated loan portfolio will be crucial in determining its future.",
  "link_flair_text": "News",
  "id": "1csbxzr",
  "num_comments": 11,
  "created_utc": 1715745827,
  "permalink": "/r/wallstreetbets/comments/1csbxzr/nycb_sells_off_5b_loans_to_jpmorgan/",
  "comments": [
    {
      "id": "l43yi9c",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 14 hours ago\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1csbxzr/nycb_sells_off_5b_loans_to_jpmorgan/l43yi9c/",
      "created": 1715745830,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l43yzpn",
      "score": 7,
      "body": "Interesting will check this out at open",
      "permalink": "/r/wallstreetbets/comments/1csbxzr/nycb_sells_off_5b_loans_to_jpmorgan/l43yzpn/",
      "created": 1715746079,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l43yi1y",
      "score": 5,
      "body": "Hey, do you have a source? Please add a link in the post or as a reply to this comment!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
      "permalink": "/r/wallstreetbets/comments/1csbxzr/nycb_sells_off_5b_loans_to_jpmorgan/l43yi1y/",
      "created": 1715745828,
      "depth": 0,
      "replies": [
        {
          "id": "l447myl",
          "score": 3,
          "body": "https://finance.yahoo.com/news/nycb-sell-5-billion-mortgage-225839349.html",
          "permalink": "/r/wallstreetbets/comments/1csbxzr/nycb_sells_off_5b_loans_to_jpmorgan/l447myl/",
          "created": 1715750701,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l441ce9",
      "score": 5,
      "body": "They must be buying them for pennies on the dollar. Jamie hates the mortgage industry and the only reason they are in it is because the government makes them.",
      "permalink": "/r/wallstreetbets/comments/1csbxzr/nycb_sells_off_5b_loans_to_jpmorgan/l441ce9/",
      "created": 1715747256,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l443089",
      "score": 4,
      "body": "i agree",
      "permalink": "/r/wallstreetbets/comments/1csbxzr/nycb_sells_off_5b_loans_to_jpmorgan/l443089/",
      "created": 1715748119,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l44ccnf",
      "score": 5,
      "body": "https://preview.redd.it/5y2oftoj8j0d1.jpeg?width=1170&format=pjpg&auto=webp&s=90f44f25c32505c147735dab71610b139340334d",
      "permalink": "/r/wallstreetbets/comments/1csbxzr/nycb_sells_off_5b_loans_to_jpmorgan/l44ccnf/",
      "created": 1715753668,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4590w5",
      "score": 2,
      "body": "Put my 30$ in ![img](emote|t5_2th52|4258)",
      "permalink": "/r/wallstreetbets/comments/1csbxzr/nycb_sells_off_5b_loans_to_jpmorgan/l4590w5/",
      "created": 1715775249,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l45ewqs",
      "score": 2,
      "body": "Annnnnd back to 2008 ![img](emote|t5_2th52|4275)",
      "permalink": "/r/wallstreetbets/comments/1csbxzr/nycb_sells_off_5b_loans_to_jpmorgan/l45ewqs/",
      "created": 1715777840,
      "depth": 0,
      "replies": []
    }
  ]
}