{
  "title": "2AM Cannabis DD",
  "score": 65,
  "selftext": "Why Cannabis Has The Best \"Meme Stock\"\n\nHello fellow regards, its 1:50 AM im high, and im ready to give my first brief DD ever into the cannabis sector. I've been studying the cannabis sector since November, and i would like to give a brief DD on my thoughts. I AM NOT A PROFESSIONAL, JUST A DUDE WHOS TIRED AND REALLY LIKES WEED. This saying I might be wrong on some points and this is only my opinion at 2AM. I might try to do another post after more research with everyone's help. if you have any opinions or find any information please leave a comment and lets get high together.\n\n2019-2021: We already know the sector has tanked since 2021 and Canada's announcement into the industry. As some like INCR might have lost momentum from terrorist attacks in Isreal, others like SNDL had a \"meme\" approach into the U.S Cannabis Debt (SunSteam I believe its called). The important thing is companies overproduced, lost their competitive advantages, and had horrible timing. Whatever the various reasons are, almost the entire sector has taken a hit. Now when you bring up investing to the company, everyone will say \"its to risky and has no moat\" and yes this is true...or is it?\n\n2023-2024: As vaporizers have had a dominating approach into the market, cannabis \"carts\" are exposing the younger generations to an easier, \"odorless\", and convenient way to expose themselves to THC. Think as them as a gateway into the industry, and just like a Juul it exposes new audiences into the market and could create long term relationships. Not only has cannabis found new ways to be innovative, but the industry has seen an unreal amount of new consumers the past decade. And this will only keep growing as we keep removing world wide restrictions overtime like Germany.\n\nPast 6 Months: A new wave of young investors are ready to begin their journeys, now that trading is easier then ever. More then likely they're going to consider cheap stocks as they get high \\*cough cannabis\\*. Now im being bias, but coming from this generation shit feels high and im broke. Why would I invest $10 into META right now compared to SNDL? Theirs no doubt the sector has been seeing some of its most profit in years, And as the FDA rescheduling comes into play more then likely by this summer, its only a matter of time until the sector moons.\n\nThe Future: Im not a physic but I do have some judgements and opinions about the future of the cannabis sector. Firstly, long or short term many etfs like MSOS or YOLO look incredibly great right now. It'd be safer to play ETF's in the sector for long term investments. This is because of the incredibly small amount of tradable stocks in the sector. Few if any cannabis stocks are American companies, with the majority being Canadian or in the EU. With the amount of competition in the sector, there is a possibility we could see more American cannabis stocks listed on the NASDAQ exchange. Competition is already a killing factor within the industry, a flood of American ipo's could cause more viability in the market, and potential damage or benefit certain stocks.\n\nFinal Thoughts: With all this said, I completely understand the fear and hesitance people get when considering investing into the sector. There are many many risky factors, past issues, and future threats. But do NOT let that discourage you from investing just $5 long term. The sector is comparably undervalued compared to how overvalued CGC and Aurora was in 2021. For short term people are anticipating for the FDA reschedule, this would seriously open many doors and more profitable opportunities for the sector. Now the competition needs to be controlled for federal distribution and other meanings. The sector will only gain more popularity overtime=more profit.\n\nBest ETF's: MSOS, CNBS, YOLO, TOKE\n\nSafest As of Rn: GTLS, MSOS, SNDL,\n\nMy Favorite: SNDL. MSOS, CGC, CRON, TLRY\n\nEyeball: ACB, INCR (reddit wont let me post the others to prevent \"pump and dumps\" but look into hair testing, Colorado, and more stocks east)\n\nCannabis Is The Best Meme Sector, That Will Make Our Fellow Stoner Regards Even Higher :)\n\nSmall Sources: [https://flowhub.imgix.net/Resources/marijuana-usage-among-u.s.-adults-1969-2023.png](https://flowhub.imgix.net/Resources/marijuana-usage-among-u.s.-adults-1969-2023.png)\n\n[https://www.prnewswire.com/news-releases/sunstream-usa-poised-to-acquire-cannabis-assets-302134053.html](https://www.prnewswire.com/news-releases/sunstream-usa-poised-to-acquire-cannabis-assets-302134053.html)\n\nHope I did this right!",
  "link_flair_text": "DD",
  "id": "1ct612i",
  "num_comments": 44,
  "created_utc": 1715838853,
  "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/",
  "comments": [
    {
      "id": "l49ps6e",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 4 months ago\n**Total Comments** | 3 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l49ps6e/",
      "created": 1715838858,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l49ptms",
      "score": 56,
      "body": "Ask your dealer about investment opportunities.",
      "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l49ptms/",
      "created": 1715838885,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l49vlqk",
      "score": 11,
      "body": "Have you looked into why the NASDAQ has not been popular with the cannabis market? It’s because of federal regulation right? Do we know when we will see change in this legislation?",
      "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l49vlqk/",
      "created": 1715842916,
      "depth": 0,
      "replies": [
        {
          "id": "l49wljn",
          "score": 4,
          "body": "Its many factors but people are scared of the risks they would have to take. Companies currently struggle on moat, regulation, and taxs that severely hurt there performances and possible futures. This will change as regulation and moderation takes place these next few decades. I believe we could see the change take place this year, even possibly near summer or Christmas. Its not to risky now, but it for sure is if CGC hits $400 again.",
          "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l49wljn/",
          "created": 1715843658,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l4b1wuz",
          "score": 3,
          "body": "There are also massive shorts in play so whales can get in at a low price point at legalization.",
          "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l4b1wuz/",
          "created": 1715867697,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l4ckp2x",
          "score": 1,
          "body": "You hit the nail on the head, this sector will be shit until these companies can legally up-list to US exchanges. However, it sounds like someone is going to test things out once S3 goes into effect. I think Curaleaf will up-list this year and others will follow once they see nobody stopping them.",
          "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l4ckp2x/",
          "created": 1715886903,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l4a4zku",
      "score": 8,
      "body": "SNDL",
      "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l4a4zku/",
      "created": 1715850223,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4aw6lk",
      "score": 9,
      "body": "All you have to do is enable tax write offs for cannabis companies and all of a sudden profitability skyrockets. Literally a stroke of a pen and margin jumps double digits.",
      "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l4aw6lk/",
      "created": 1715865423,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l49qezu",
      "score": 17,
      "body": "To add to this, Biden is in trouble at the polls, especially with younger voters.  As the election looms and polls continue to show Brandon behind with razor thin margins especially in swing states, expect him to use weed as a carrot to attract younger disillusioned voters.\n\nTrump could very well counter with his own scheme of liberalizing federal marijuana policy, as this issue is a winner with both parties (it’s really just boomer republicans and olds who oppose it).  Meanwhile both sides are losing votes to RFK who has openly said marijuana legalization will be a top priority in his administration.  We very well might see a situation where all three candidates are tripping over themselves pledging to be the one to legalize harder and legalize faster.",
      "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l49qezu/",
      "created": 1715839285,
      "depth": 0,
      "replies": [
        {
          "id": "l49qq7i",
          "score": 11,
          "body": "All of them wants to be the one to legalize it, if it would boost and gain the ballots of the new voters then we could 100% see trump push for it too. If trump pushes the fda even harder for the reschedule he would gain an unreliable amount of support from both sides, and shock many.",
          "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l49qq7i/",
          "created": 1715839498,
          "depth": 1,
          "replies": [
            {
              "id": "l49qu47",
              "score": 2,
              "body": "unbelievable \\*",
              "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l49qu47/",
              "created": 1715839571,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l4nvdfc",
          "score": 1,
          "body": "Dude, this is bullshit. It always “matters” around election time in 2020 Biden spouted off something about rescheduling and we are just now hearing about before the polls. I don’t think anything significant will happen federally, but there is possibility with state to state adoption. Especially since states have been decriminalizing a bunch, I still think the industry has years before full adoption but I hope I’m wrong. ETFs for me and I’m gonna watch SNDL",
          "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l4nvdfc/",
          "created": 1716072993,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l4akq3j",
      "score": 4,
      "body": "Also when you wake up this morning I'd love to read any actual DD that you may have put together. I can only speak to TLRY where it seems they're moving focus to alcohol which is a gnarly saturated market. I feel like anything substantial in this market will likely be sucked up by the big guys like philip morris or whatever the hell they're called now, Altria?, and similar.",
      "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l4akq3j/",
      "created": 1715860175,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4c8564",
      "score": 4,
      "body": "Worth pointing out that Smoky Joe made the DEA decision to reschedule marijuana official this morning: [https://twitter.com/POTUS/status/1791152464617431389](https://twitter.com/POTUS/status/1791152464617431389) - this is kind of a big fucking deal",
      "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l4c8564/",
      "created": 1715882531,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l49q37v",
      "score": 7,
      "body": "I have PTSD from the mess this sub was in from $ACB years ago.",
      "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l49q37v/",
      "created": 1715839063,
      "depth": 0,
      "replies": [
        {
          "id": "l49qcj8",
          "score": 3,
          "body": "CGC and ACB 🚀",
          "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l49qcj8/",
          "created": 1715839240,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l4b1xhr",
      "score": 3,
      "body": "Sir, are you high?",
      "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l4b1xhr/",
      "created": 1715867703,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l49rb8t",
      "score": 2,
      "body": "📈🚀",
      "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l49rb8t/",
      "created": 1715839891,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4bf8pu",
      "score": 2,
      "body": "Ah weed stocks. I think they can only go up from their ATL but whether that’s weeks, months, years or decades from now…\n\nGiven people have been saying it’s coming for years already…",
      "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l4bf8pu/",
      "created": 1715872551,
      "depth": 0,
      "replies": [
        {
          "id": "l4bf9jx",
          "score": 3,
          "body": "Narradisall is clearly an optimist, however, I'm not so sure that their faith in the market is justified...",
          "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l4bf9jx/",
          "created": 1715872559,
          "depth": 1,
          "replies": [
            {
              "id": "l4bfev3",
              "score": 2,
              "body": "Ah VM, if that’s optimism for you it’s a sad state of affairs",
              "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l4bfev3/",
              "created": 1715872611,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l4apto5",
      "score": 1,
      "body": "According to the gigantic lines at the dispensaries here in Maryland, it's a very, VERY lucrative business.",
      "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l4apto5/",
      "created": 1715862644,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4aw65d",
      "score": 1,
      "body": "What about MJ ETF?",
      "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l4aw65d/",
      "created": 1715865418,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llwy2iw",
      "score": 1,
      "body": "ACB Aurora Cannabis - Can I get peoples thought on this company $150m in cash and $240m in yearly revenue. Cash flow positive after adjustments and no debt.\nThe stock price is bottom low at $5.30 usd what am I missing??",
      "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/llwy2iw/",
      "created": 1725686684,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l49sttc",
      "score": 1,
      "body": "noo haha. only SNDL",
      "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l49sttc/",
      "created": 1715840945,
      "depth": 0,
      "replies": [
        {
          "id": "l4a2t16",
          "score": 2,
          "body": "📈",
          "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l4a2t16/",
          "created": 1715848493,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l4ajpzg",
      "score": 0,
      "body": "There aren't really going to be any American weed companies until its federally legalized. Just seems to be no reason or benefit when it's still technically illegal.",
      "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l4ajpzg/",
      "created": 1715859661,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l49sdss",
      "score": -8,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l49sdss/",
      "created": 1715840634,
      "depth": 0,
      "replies": [
        {
          "id": "l49w2lt",
          "score": 8,
          "body": "But there is money in it? its a new industry that has had a lot of set backs, and currently doesnt have enough moderation. Long term we just don't know what could happen innovatively, regulative, and the possible influx in demand. Do keep in mind weed has been throwing stronger numbers then chocolate in America yearly, especially this current quarter, it might be a longshot but i think it could overthrow alcohol in popularity within the west in a few decades. \n\nSouce:\n\n[https://www.fox4news.com/news/americans-are-reportedly-spending-more-money-on-cannabis-than-chocolate](https://www.fox4news.com/news/americans-are-reportedly-spending-more-money-on-cannabis-than-chocolate)",
          "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l49w2lt/",
          "created": 1715843262,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l4akyd4",
          "score": 3,
          "body": "I'm waiting for legalized cocaine, that's when things will actually start to mean business.",
          "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l4akyd4/",
          "created": 1715860292,
          "depth": 1,
          "replies": [
            {
              "id": "l4ez73x",
              "score": 2,
              "body": "honestly there's one reality that an administration begin treating polluted drugs as a national security problem and take control of the supply chain, purifying the supply. so no more unexpected fentanyl or other things\n\nwould probably be a lot of money in helping the supply chain and harm reduction if the government throws money at it",
              "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l4ez73x/",
              "created": 1715923439,
              "depth": 2,
              "replies": [
                {
                  "id": "l4fb3t0",
                  "score": 2,
                  "body": "One harm-reduced 8 ball please!",
                  "permalink": "/r/wallstreetbets/comments/1ct612i/2am_cannabis_dd/l4fb3t0/",
                  "created": 1715931566,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}