{
  "title": "PetroDollar Recycling Into Gold Instead of US Treasuries - GOLD Bull Case",
  "score": 27,
  "selftext": "# Background\n\nPetrodollars refer to the U.S. dollars received by oil-exporting nations in exchange for their oil exports. Since oil is globally traded in U.S. dollars, these countries accumulate large surpluses of U.S. currency from their oil sales.\n\nTo recycle these petrodollar revenues back into the U.S. economy, oil exporters have historically reinvested a significant portion into U.S. Treasury securities issued by the U.S. government.\n\nOne of the earliest examples of this \"petrodollar recycling\" was a 1974 deal between the U.S. and Saudi Arabia, where Saudi petrodollars were deliberately channeled into purchases of U.S. Treasury bonds.\n\nBy investing their surplus petrodollars into U.S. Treasuries, oil exporters are essentially lending money to the U.S. government to finance its budget deficits and borrowing needs.\n\n This allows the U.S. to keep interest rates lower than they otherwise would be.\n\nOther than Treasuries, oil exporters also recycle petrodollars by investing in other U.S. assets like stocks, real estate, and through sovereign wealth funds that deploy capital across various U.S. investments.\n\nHowever, in recent years, with the rise of U.S. domestic oil production reducing import needs, the importance of petrodollar recycling into U.S. assets has diminished somewhat compared to previous decades.\n\nIn summary, the primary mechanism for recycling petrodollars back to the U.S. has been through oil exporters' purchases of U.S. Treasury securities, as part of broader investments into American financial assets and markets.\n\n# How has Recent Industrialization Onshoring Policy Helped or Hindered the Recycling of US Treasuries\n\n \n\nU.S. industrial policy initiatives aimed at onshoring and \"friend-shoring\" critical supply chains, particularly for electric vehicles (EVs) and clean energy technologies, have the potential to impact the traditional recycling of petrodollars into U.S. Treasuries in a few key ways:\n\nIncentivizing domestic production and reducing reliance on imports:\n\nThe Inflation Reduction Act (IRA) and other policies provide significant tax credits and incentives for manufacturing EVs, batteries, and critical minerals in the U.S. or countries with free trade agreements.\n\nThis could reduce U.S. reliance on imports from oil exporters, potentially decreasing their petrodollar surpluses available for recycling into Treasuries.\n\nShifting petrodollar flows towards domestic investments:\n\nAs oil exporters seek to capture the benefits of the IRA incentives, they may choose to directly invest more of their petrodollars into building domestic production capabilities for EVs, batteries, and minerals rather than purchasing Treasuries.\n\nThis would represent a shift in how petrodollars are recycled back into the U.S. economy.\n\nPotential trade tensions impacting petrodollar recycling:\n\nThe IRA's restrictions on sourcing from \"foreign entities of concern\" like China could create trade tensions with major oil exporters that have close economic ties to China.\n\nThis friction may impact their willingness to continue recycling petrodollars into U.S. assets like Treasuries.\n\nDiversification of petrodollar investments:\n\nSome oil exporters like Saudi Arabia have already been diversifying their investments away from just U.S. Treasuries into other assets like equities and real estate.\n\n The new industrial policies could accelerate this trend as they seek to capitalize on incentives in specific sectors.\n\nThe Biden administration's industrial policies aimed at onshoring supply chains have the potential to reduce the traditional recycling of petrodollars directly into U.S. Treasuries. However, those funds may increasingly flow into domestic manufacturing investments aligned with policy priorities like EVs and clean energy instead.\n\n# How Much Petrodollar is Recycled Into US Treasuries\n\nAccording to the U.S. Energy Information Administration, OPEC member countries earned around $1.1 trillion in net oil export revenues in 2022 alone.\n\nWhile the results don't provide exact figures, they suggest that historically a significant portion of these petrodollar revenues were recycled into U.S. Treasury securities, especially through arrangements with Saudi Arabia dating back to the 1970s.\n\nHowever, the results also indicate that in more recent years, this petrodollar recycling into Treasuries has likely diminished for a few key reasons:\n\nThe rise of U.S. domestic energy production has reduced reliance on oil imports\n\nOil exporters have been diversifying investments into other assets like equities and domestic economic development projects\n\nSome trade/geopolitical tensions may have impacted willingness to invest petrodollars into U.S. assets\n\nAssuming these trends, as a rough best guess, I would estimate that around 25-35% of total OPEC petrodollar revenues from 2012-2023 were recycled into purchases of U.S. Treasury securities.\n\nThis would translate into approximately $275 billion to $385 billion in petrodollar flows into U.S. Treasuries per year on average over this period.\n\n# Central Banks Recycling Into Gold\n\nIf foreign central banks (China, Russia and other BRICS nation) recycled $275 billion to $385 billion annually into purchasing gold instead of investing in U.S. Treasuries, it would likely lead to a significant increase in the price of gold. Here's my analysis:\n\nThe key factors to consider are:\n\nMassive new source of demand for gold\n\nAccording to the World Gold Council, the total global demand for gold in 2022 was around 4,741 metric tons, equivalent to approximately $237 billion at 2022's average price of $1,800/oz.\n\nIf $275-$385 billion was diverted from Treasuries into purchasing gold each year, it would represent an enormous new source of demand, potentially exceeding the entire current global demand.\n\nLimited supply response in the short-term\n\nGold mining production has very inelastic supply due to the long lead times required to open new mines. In 2022, total global gold supply was around 4,786 tons, with mine production accounting for 3,612 tons.\n\nIn the short run, such a massive demand shock from central banks would far outstrip any potential increase in supply from mining or recycling sources.\n\nInventory drawdowns cannot satisfy demand\n\nWhile central banks and investors could potentially sell existing gold holdings to meet some of the new demand, these inventories are limited. Central banks currently hold around 35,000 tons of gold reserves cumulatively.\n\nDrawing down these reserves significantly would be highly unlikely given gold's role as a reserve asset and safe-haven.\n\nGiven the massive scale of new demand from central banks compared to current supply and limited inventory buffers, basic economic principles indicate the price of gold would have to rise substantially.\n\nQuantifying the exact price increase is difficult, but analysts estimate that for every $100 billion in new investment demand, gold prices could rise by $350-$500 per ounce.\n\n***If the full $275-$385 billion was recycled into gold annually, following this estimate, it could realistically drive gold prices up to the range of $5,000-$8,000 per ounce in the short-to-medium term until new supply could come online.***\n\nIn summary, recycling $275-$385 billion of petrodollars from Treasuries into gold would represent a tectonic demand shock that would overwhelm current supply and inventories, forcing gold prices significantly higher, potentially into the $5,000-$8,000/oz range based on standard analysis of gold price-demand dynamics.\n\n# Gold is Sanction Proof US - China Conflict\n\nLet us look at what happened to Russian USD assets after the Ukraine invasion as a roadmap and warning to China's Central bank.\n\nRussian Central bank have been increasing their gold purchases, especially after the U.S. froze Russian assets held in dollars before the Ukraine war:\n\n1. To build a sanctions-proof reserve asset. Russia's central bank has added 1 million ounces of gold to its reserves since the start of the Ukraine war in 2022. This is likely part of a strategy to accumulate more gold as a reserve asset that cannot be frozen or seized by Western sanctions, unlike U.S. dollar holdings.\n2. To reduce exposure to the U.S. dollar. Russia has been working to decouple its economy from the U.S. dollar since 2013 in anticipation of potential sanctions. Buying more gold allows Russia to diversify away from dollar-denominated assets that are vulnerable to freezes and restrictions.\n3. To peg the ruble to gold. Russia pegged its currency, the ruble, to gold at a fixed rate of 5,000 rubles per ounce. Increasing gold reserves allows Russia to back up this new gold-pegged ruble policy.\n4. As a potential sanction-busting. Accumulating more gold gives Russia this potential sanction-circumvention option.\n5. Diversifying from frozen foreign reserves. With around $300 billion in Russian foreign reserves frozen by Western sanctions according to [2](https://www.reuters.com/world/europe/what-where-are-russias-300-billion-reserves-frozen-west-2023-12-28/), the Russian central bank is likely aiming to rebalance by building up its gold holdings as unfrozen, liquid reserves.\n\nIn essence, the freezing of Russian dollar assets and cut-off from the U.S.-dominated financial system has accelerated Russia's pre-existing efforts to move away from the dollar and accumulate gold as a sanctions-proof asset to support the ruble and potentially bypass restrictions if needed in the future. Increasing gold purchases is a key part of this de-dollarization strategy.\n\n# Chinese CryptoCurrency Back By Its Gold Reserve (Bretton Woods III / BRICS Wood I)\n\nChina potentially creating a cryptocurrency backed by gold:\n\n1. Disclose Official Gold Reserves.  For a credible gold-backed cryptocurrency, China would need to transparently disclose and have independently audited its true gold holdings. While official figures show around 2,000 tons, many analysts believe China's actual gold reserves could be much higher, potentially over 20,000 tons when including both monetary and non-monetary stocks.\n2. Establish a Gold Reserve Requirement.  China's central bank, the People's Bank of China (PBOC), would need to set aside a specific portion of its gold reserves to fractionally or fully back the issuance of the new cryptocurrency. This reserve ratio would determine how much of the digital currency's supply is backed by physical gold.\n3. Develop the Cryptocurrency Architecture.  The PBOC could create the technical architecture for issuing, managing, and recording transactions of the new gold-backed cryptocurrency on a blockchain or distributed ledger system. This could potentially leverage China's existing digital yuan CBDC project.\n4. Peg the Cryptocurrency to Gold.  The cryptocurrency's value would be explicitly pegged to a fixed weight of China's audited gold reserves, similar to how currencies were tied to gold under the historical Bretton Woods system. For example, each unit could represent 1 gram of gold held in reserves.\n5. Enable Gold Redemption to make the cryptocurrency fully convertible and \"backed\" by gold, holders would need a mechanism to directly redeem the digital currency for physical gold from China's reserves at the specified peg rate. This redemption right is key to ensuring its intrinsic value.\n6. Promote International Adoption among BRICS nation. China would likely need to ease capital controls and promote international trust and usage of its gold-backed cryptocurrency through bilateral trade agreements and opening it to foreign participation and exchange.\n\n# References\n\n\\[1\\] [https://podcasts.apple.com/us/podcast/jeff-currie-on-why-copper-is-his-highest-conviction/id1056200096?i=1000655893480](https://podcasts.apple.com/us/podcast/jeff-currie-on-why-copper-is-his-highest-conviction/id1056200096?i=1000655893480)\n\n\\[2\\] [https://podcasts.apple.com/us/podcast/viktor-shvets-on-how-the-fed-has-become-a-prisoner/id1056200096?i=1000655388796](https://podcasts.apple.com/us/podcast/viktor-shvets-on-how-the-fed-has-become-a-prisoner/id1056200096?i=1000655388796)\n\n\\[3\\] [https://podcasts.apple.com/us/podcast/hugh-hendry-on-the-terrifying-yen-move-and-risk-of/id1056200096?i=1000655029035](https://podcasts.apple.com/us/podcast/hugh-hendry-on-the-terrifying-yen-move-and-risk-of/id1056200096?i=1000655029035)",
  "link_flair_text": "DD",
  "id": "1cujnts",
  "num_comments": 16,
  "created_utc": 1715989123,
  "permalink": "/r/wallstreetbets/comments/1cujnts/petrodollar_recycling_into_gold_instead_of_us/",
  "comments": [
    {
      "id": "l4j2j6b",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 533 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1cso979/barrick_gold_gold_bull_case/) [x](https://www.reddit.com/r/wallstreetbets/comments/1cujnts/petrodollar_recycling_into_gold_instead_of_us/) \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1cujnts/petrodollar_recycling_into_gold_instead_of_us/l4j2j6b/",
      "created": 1715989130,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4jl77l",
      "score": 6,
      "body": "TLDR?",
      "permalink": "/r/wallstreetbets/comments/1cujnts/petrodollar_recycling_into_gold_instead_of_us/l4jl77l/",
      "created": 1715997411,
      "depth": 0,
      "replies": [
        {
          "id": "l4jwhfv",
          "score": 9,
          "body": "TLDR: \"There's nothing like the feeling of physical gold in your hands\" William Devane.",
          "permalink": "/r/wallstreetbets/comments/1cujnts/petrodollar_recycling_into_gold_instead_of_us/l4jwhfv/",
          "created": 1716002885,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l4kdk9x",
      "score": 3,
      "body": "Didn't China have a scandal a few years ago where much of their gold was just plated nickel. They had zero idea what is real and what is fake. So much so that Australia banned the import of gold from China",
      "permalink": "/r/wallstreetbets/comments/1cujnts/petrodollar_recycling_into_gold_instead_of_us/l4kdk9x/",
      "created": 1716012908,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4jw34d",
      "score": 2,
      "body": "What would keep people from buying up the gold backed crypto and trading it in for the gold? That gold would be gone about 5 minutes after they launched this ridiculous plan.",
      "permalink": "/r/wallstreetbets/comments/1cujnts/petrodollar_recycling_into_gold_instead_of_us/l4jw34d/",
      "created": 1716002678,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4jyxu3",
      "score": 2,
      "body": "Great summary, thanks!",
      "permalink": "/r/wallstreetbets/comments/1cujnts/petrodollar_recycling_into_gold_instead_of_us/l4jyxu3/",
      "created": 1716004191,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4k2ss5",
      "score": 3,
      "body": "Just a few thoughts off the hip on that:\n\nThe Spectre of the Dollar being torpedoed by foreign powers holding to much of it has been around for decades. In the 80s the movie \"The Rollover\" ran the theme. (Funny enough it basically predicted the factors leading to the financial crisis in 2007). Economically we´re talking mutually assured destruction here, since there is no world economy without the US economy. And Washington would likely counter that move by minting a 35 trillion Dollar coin or a currency reform. Also: All the gold in the world is worthless, if there is no more money to buy it.\n\nThe current rise of the gold price seems far more driven by investors, who lost trust in their own countries economies (for example in China) and will likely revert, when that picks up again. And no: If gold backed currencies (of any kind) were the answer, nations wouldn´t have abandoned them.\n\nGold as a sanctions buster is partially true. But let us not forget, we are talking people, carrying gold in their baggage   in order to pay in other countries (as has been seen in some cases, where iranian couriers were intercepted). As a method of international trading, it´s unsuitable.\n\nOf course a cryptocurrency based on gold would be different. But seriously? Transparency, openness and independent verification? In China? How about betting on the United States eliminating their debt by reasonable taxation and public spending instead?\n\nAnd honestly? All these gold to the moon theories usually spring up, when gold is booming. When it´s going through a low, everyone, except some economy preppers, tells you, why it won´t ever recover.\n\nGold can be a sound addition to your portfolio at a reasonable price. What that is can differ greatly according to your circumstances. Consider it a stock of shares, that is valued independent or even counterwise to the stock market, but if you bet all on gold on the economic roulette table, your chances of winning aren´t better, than betting or black or red...",
      "permalink": "/r/wallstreetbets/comments/1cujnts/petrodollar_recycling_into_gold_instead_of_us/l4k2ss5/",
      "created": 1716006357,
      "depth": 0,
      "replies": [
        {
          "id": "l4l8me8",
          "score": 6,
          "body": "Central banks got off the gold standard because of the Nixon shock and replaced GOLD with USD (Bretton Woods 2).\n\nRestructuring global financial architecture away from US Hegemony (USD) would use gold in the interim as there would be no Hegemon (pre Bretton Woods multipolar world)\n\nIn other world, a 3 body problem (multipolar order), in finance necessitate GOLD as a unit of exchange and store of value.\n\nUS could sell off all its GOLD reserves to shock and delay the transition into GOLD but that will not solve its terminal sovereign debt and fiscal crisis. It only delays it. GOLD would again climb back up to a higher equilibrium as it becomes the reference anchor of national account deficits in global trade.",
          "permalink": "/r/wallstreetbets/comments/1cujnts/petrodollar_recycling_into_gold_instead_of_us/l4l8me8/",
          "created": 1716033855,
          "depth": 1,
          "replies": [
            {
              "id": "l4naqoz",
              "score": 1,
              "body": "Switzerland dropped the gold standard in 1999. I may be missing something, but I fail to see any connection to the Nixon shock.",
              "permalink": "/r/wallstreetbets/comments/1cujnts/petrodollar_recycling_into_gold_instead_of_us/l4naqoz/",
              "created": 1716064239,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l4kk0os",
          "score": 3,
          "body": "You sound so sure of yourself 😂 respect the confidence but reality check needed 🤝",
          "permalink": "/r/wallstreetbets/comments/1cujnts/petrodollar_recycling_into_gold_instead_of_us/l4kk0os/",
          "created": 1716017256,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l4k2ssy",
          "score": 1,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1cujnts/petrodollar_recycling_into_gold_instead_of_us/l4k2ssy/",
          "created": 1716006357,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l4jwa5t",
      "score": 2,
      "body": "Executive summary: No",
      "permalink": "/r/wallstreetbets/comments/1cujnts/petrodollar_recycling_into_gold_instead_of_us/l4jwa5t/",
      "created": 1716002780,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4jui4d",
      "score": 1,
      "body": "So higher for long?",
      "permalink": "/r/wallstreetbets/comments/1cujnts/petrodollar_recycling_into_gold_instead_of_us/l4jui4d/",
      "created": 1716001862,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4na365",
      "score": 1,
      "body": "Bruh ain’t no way anyone here is gonna read this whole post",
      "permalink": "/r/wallstreetbets/comments/1cujnts/petrodollar_recycling_into_gold_instead_of_us/l4na365/",
      "created": 1716063970,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4lp8qz",
      "score": 1,
      "body": "There's not enough gold in the world to peg a large nation's currency to.",
      "permalink": "/r/wallstreetbets/comments/1cujnts/petrodollar_recycling_into_gold_instead_of_us/l4lp8qz/",
      "created": 1716041480,
      "depth": 0,
      "replies": [
        {
          "id": "l4lyob1",
          "score": 6,
          "body": "Uhm, thats why gold prices will go up to find steady state equilibrium of net global trade.",
          "permalink": "/r/wallstreetbets/comments/1cujnts/petrodollar_recycling_into_gold_instead_of_us/l4lyob1/",
          "created": 1716045182,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}