{
  "title": "$CRON : most likely cannabis company to be acquired OR make big acquisitions ",
  "score": 30,
  "selftext": "There's a lot of chatter over OTCs uplisting, Canadian companies acquiring MSOs such as SNDL, CGC, and now TRLY with their recent dilution aimed at expansion, but there has been no talk about a company with one of the best big tobacco backers in the game. Enter Cronos Group.\n\nAltria, $MO, the 80 billion dollar tobacco giant, purchased 45 percent of Cronos in 2019.\n\n\nhttps://investor.altria.com/press-releases/news-details/2019/Altria-Becomes-Largest-Shareholder-in-Cronos-Group-a-Leading-Global-Cannabinoid-Company/default.aspx\n\nThey purchased this portion of Cronos at a much higher valuation than it currently sits, buy they remain very invested in Cronos, looking to expand it into a strong US player. In their 2023 investor presentation, they mention on slide two that turning Cronos into a strong US contender is a high priority. What they've been waiting on is federal changes. Well, here we are now. \n\nLast year, there rumors that Cronos was looking to sell the company to Curaleaf. \n\n\nhttps://www.reuters.com/markets/deals/altria-backed-cannabis-producer-cronos-explores-sale-sources-2023-07-06/\n\nAlthough that didn't manifest, it is interesting for a number of reasons. \n\nA) Cronos is sitting on a ton of cash they got from the Altria deal. They have more cash on hand than anyone in the cannabis sector.  Over 800 million dollars. \n\nB) with that cash, Cronos has the ability to strengthen the balance sheet of any player that absorbs them. \n\nC) This part is HUGE: Altria's deal with Cronos gives Cronos exclusive rights to Altria's expansion in the cannabis sector. Altria cannot do anything cannabis related without going through Cronos. \n\nIf Curaleaf, or another big player, for example, wanted to do business with  Altria, they would have to acquire Cronos. \n\nSo I see a few different scenarios possibly playing out here. \n\n1. Altria aggressively builds up Cronos without adding to their current share position. They already own over 40 percent, so it benefits them greatly if Cromos expands in a strong way in the US. Cronos has a ton of cash to acquire MSOs and with Altria's guidance they will become a major player. I could even see a reverse merger where Pharmacann merges with Cronos to become one entity. Cronos purchased a 10 percent stake in Pharmacann a while back and Pharmacann has put off their IPO plans for a couple of years now. I would also look out for some sort of transaction including Gotham Green Partners considering they have the CEO of Gotham on their board. \n\n2. Altria decides to just buyout the rest of Cronos. This could be a cash deal or stock exchange. It would certainly be at a higher marketcap valuation than it currently sits. This would be great for anyone holding CRON shares and great for MO investors long term. \n\n3. A company like Curaleaf decides to acquire Cronos to obtain the ability to work with Altria. This would have to be a stock deal and would be dilutive to the larger company, but they do it to acquire the cash reserves to fix their balance sheet and to work with Altria. \n\n4. Scenario 3 happens and then in addition, $MO buys out the entire new entity. \n\nThere is going to be a lot of M&A in this sector in the company months and years. Big players have been waiting on rescheduling news to make their moves. The next few months the first few dominos wil probably fall. \n\nAll in all, Cronos somehow convinced a big tobacco company to give them an exclusive deal. This was a bad move on Altria's part. they either need to buy their way out of this or have another player buy their way out, or they need to help rapidly expand Cronos to turn it into a thriving business instead of a giant pile of cash company. No matter what, I believe there is an arbitrage here for people investing in the stock. \n\nThere is also a ton of incentive for Altria or Curaleaf to buy them out ASAP, as the cannabis sector is going to have richer premiums by the month now. \n\nI am long $cron and I'm not a financial advisor. \n",
  "link_flair_text": "DD",
  "id": "1cw546c",
  "num_comments": 17,
  "created_utc": 1716172509,
  "permalink": "/r/wallstreetbets/comments/1cw546c/cron_most_likely_cannabis_company_to_be_acquired/",
  "comments": [
    {
      "id": "l4tn8nz",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 5 days ago\n**Total Comments** | 61 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1cw546c/cron_most_likely_cannabis_company_to_be_acquired/) \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1cw546c/cron_most_likely_cannabis_company_to_be_acquired/l4tn8nz/",
      "created": 1716172514,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4uh7qc",
      "score": 11,
      "body": "Cash is not the only factor that is advantageous. SNDL has both cash and a debt-free balance sheet. Therefore, it is a much better option for exponential growth.",
      "permalink": "/r/wallstreetbets/comments/1cw546c/cron_most_likely_cannabis_company_to_be_acquired/l4uh7qc/",
      "created": 1716190721,
      "depth": 0,
      "replies": [
        {
          "id": "l4vn3ys",
          "score": 2,
          "body": "treatment license act brave judicious ring deserted spotted late relieved",
          "permalink": "/r/wallstreetbets/comments/1cw546c/cron_most_likely_cannabis_company_to_be_acquired/l4vn3ys/",
          "created": 1716215022,
          "depth": 1,
          "replies": [
            {
              "id": "l4vpqoq",
              "score": 2,
              "body": "Maybe used. Not thesedays.",
              "permalink": "/r/wallstreetbets/comments/1cw546c/cron_most_likely_cannabis_company_to_be_acquired/l4vpqoq/",
              "created": 1716216032,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l4tnacu",
      "score": 16,
      "body": "Let them smoke themselves to death.",
      "permalink": "/r/wallstreetbets/comments/1cw546c/cron_most_likely_cannabis_company_to_be_acquired/l4tnacu/",
      "created": 1716172534,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4tt9os",
      "score": 6,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1cw546c/cron_most_likely_cannabis_company_to_be_acquired/l4tt9os/",
      "created": 1716175371,
      "depth": 0,
      "replies": [
        {
          "id": "l4tvhyh",
          "score": 4,
          "body": "I think the arbitrage is on the other side of that play but i think MO will benefit greatly in the long run from whatever happens with CRON. Cronos is interesting. tons of cash. very small business operation close to profitability. but Cronos is basically just in hibernation mode right now until MO takes action. they have waited out the hardship in this sector and should be ready to pounce",
          "permalink": "/r/wallstreetbets/comments/1cw546c/cron_most_likely_cannabis_company_to_be_acquired/l4tvhyh/",
          "created": 1716176526,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l4w548d",
      "score": 2,
      "body": "I've done analysis on CRON.  The issue with the cannabis industry is that State operators are the ones getting rich off decriminalization.  You can think of these State operators as car dealership.  They control market share within their regions.  None of the Canadian cannabis companies can compete without buying out or muscling in on these state operators.\n\nCRON doesn't have much of a US presence.  I'm sure they have a reason for not deploying their $800M Cash but until they do, you can make more money trading semiconductors or gold stocks.",
      "permalink": "/r/wallstreetbets/comments/1cw546c/cron_most_likely_cannabis_company_to_be_acquired/l4w548d/",
      "created": 1716221664,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnmezs0",
      "score": 1,
      "body": "OP- any updates on your thesis?",
      "permalink": "/r/wallstreetbets/comments/1cw546c/cron_most_likely_cannabis_company_to_be_acquired/lnmezs0/",
      "created": 1726602544,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lokm8zv",
      "score": 1,
      "body": "Most recent quarterly results were pretty promising. Top line revenue growth in the 40%+ while weed prices are still insanely low. Canadian excise taxes are killing these weed growing companies. CEO of Cronos said there's already been a shift on the supply side. What happens when the price of weed rebounds upwards from here? What happens when Cronos expands into new markets as other countries legalize?  What happens when Canada inevitably eases on the excessive excise tax it imposes? You can look at this at so many different angles and it's a no brainer a lot of positive routes are available. And what is your downside at this valuation? The stock is trading for it's net current assets! Operating expenditures have been cut each year, the company is obviously in a FCF+ inflection point here and it's priced for the cash on it's balance sheet. My downside is backed dollar for dollar by the cash on the balance sheet (which they are earning significant interest on) while the upside has so much potential. No wonder I own 27,000 shares.",
      "permalink": "/r/wallstreetbets/comments/1cw546c/cron_most_likely_cannabis_company_to_be_acquired/lokm8zv/",
      "created": 1727119115,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4ty7rs",
      "score": 1,
      "body": "Ain't no one acquiring a sinking ship. Even if they did, it'd be for pennies on the dollar and you'd lose money. Look at what happened to Hexo.",
      "permalink": "/r/wallstreetbets/comments/1cw546c/cron_most_likely_cannabis_company_to_be_acquired/l4ty7rs/",
      "created": 1716177995,
      "depth": 0,
      "replies": [
        {
          "id": "l4tymxq",
          "score": 10,
          "body": "how is it a sinking ship? they're likely going to be EPS positive next quarter. just -.01 last earnings. and they have a ton of cash and Altria backing. they're just a small operation at the moment but that could change in a hurry if they think the time is now to act",
          "permalink": "/r/wallstreetbets/comments/1cw546c/cron_most_likely_cannabis_company_to_be_acquired/l4tymxq/",
          "created": 1716178229,
          "depth": 1,
          "replies": [
            {
              "id": "l4wlpwi",
              "score": 1,
              "body": "Lol they've been doing nothing for 9 yrs dude. Nothing is going to change for them now",
              "permalink": "/r/wallstreetbets/comments/1cw546c/cron_most_likely_cannabis_company_to_be_acquired/l4wlpwi/",
              "created": 1716227537,
              "depth": 2,
              "replies": [
                {
                  "id": "l4woym9",
                  "score": 5,
                  "body": "they've not been getting into debt while developing brands. every other cannabis company has been endlessly diluting because of their insane cash burn. it's basically a lab for $mo until they're ready to expand. and they will.",
                  "permalink": "/r/wallstreetbets/comments/1cw546c/cron_most_likely_cannabis_company_to_be_acquired/l4woym9/",
                  "created": 1716228685,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}