{
  "title": "FMC may soar on a spike in pesticide demand",
  "score": 31,
  "selftext": "FMC Corporation (FMC) produces and sells all 3 main types of agricultural pesticides: insecticides, herbicides and fungicides.  \n\nIn early 2022, FMC traded sharply higher as the war in Ukraine began. It was up 24% in 3 months as the rest of the market declined.  At this time, governments & farmers all over the world were concerned about disruption to the supply of grain and agricultural chemicals.  So, they began to stockpile essential agricultural pesticides.  \n\nCommodity prices, including corn & soybeans, were also up sharply in early 2022. So purchasers were willing to pay much higher prices for pesticides to ensure high yields.\n\nSince then, however, the stock has gotten crushed.  It's off 60% from its ATH.  And down 40% in the past 1 year alone.  The primary reason for the decline is the large stockpiles that were created in 2022.  \n\nIn 2023, instead of purchasing pesticides, farmers all over the world used significant quantities from existing stockpiles (destocking). \n\nTotal revenue in 2023 was down 31% year on year.  With revenue in North America down 48%!\n\nThe first signs that destocking is coming to an end have begun to emerge.  During their most recent earnings call, FMC announced expected 2024 revenue to increase 6% YOY.  The stock went up 9% on this news. But it's still at a deep discount when compared to pre-2022 levels (down around 40%).\n\nAlso, what may be getting overlooked is that 2023 weather conditions in North America were incredibly unfavorable for pesticide sellers.  And 2024 conditions are shaping up to be favorable and possibly exceptional.\n\nUnusually wet weather means more total applications of all 3 main types of agricultural pesticides: insecticides, herbicides & fungicides.  Heavy or more frequent rain can wash away pesticides, requiring farmers to repeat applications.  Also, wet conditions are ideal for the rapid growth of weeds, fungus and insect pests.  \n\nSo unusually dry weather means the opposite: a lower number of total pesticide applications required.  \n\nAnd 2023 was extremely dry!  In June 2023, more than 90% of the Midwest had abnormally dry conditions. And in July 2023, more than 25% of the entire Midwest was experiencing severe drought conditions. https://droughtmonitor.unl.edu/DmData/DataTables.aspx.. \n\nIf 2024 is average or wetter than normal, total North American pesticide use will increase dramatically year over year.  Currently, 70% of the Midwest has normal or wet conditions.  \nThere's evidence that 2024 La Niña conditions will bring wet conditions to the Midwest. I don't really want to get into that though because it's too speculative.\n\nAlso, late winter 2024 in the Midwest was incredibly mild.  The average high for the month of February in Cedar Rapids, Iowa was 50 degrees.  This is 18 degrees higher than normal.  \n\nWhy is this important?  Extreme cold kills certain fungi and insect pests every winter in the Midwest.  These pests can still be a problem, however.  Winds from the south blow fungal spores and moths (that lay armyworm & earworm eggs) to the Midwest normally in early spring. \n\nThe difference this year is that these pests may have had a full extra month to get established in much of the Midwest due to mild weather.  \n\nSo now we have 3 factors to drive pesticide demand higher in 2024:\n\n1. Signs that the worldwide destocking of pesticides is coming to an end.\n\n 2.  The change from extremely dry to normal or wet growing conditions in the Midwest.\n\n 3. A mild late winter in the Midwest that could allow pests more time to get established and thrive.\n\nI don't know why on Earth this stock has a P/E of only 6.6.  But I'm in for $15,000 worth of shares and I plan to hold until around earnings July 31st.  ",
  "link_flair_text": "DD",
  "id": "1cwobk1",
  "num_comments": 11,
  "created_utc": 1716233913,
  "permalink": "/r/wallstreetbets/comments/1cwobk1/fmc_may_soar_on_a_spike_in_pesticide_demand/",
  "comments": [
    {
      "id": "l4x3pi5",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 4 months ago\n**Total Comments** | 14 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1cwobk1/fmc_may_soar_on_a_spike_in_pesticide_demand/) \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1cwobk1/fmc_may_soar_on_a_spike_in_pesticide_demand/l4x3pi5/",
      "created": 1716233919,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4x6tkj",
      "score": 17,
      "body": "I just bought 100 shares. Because I trust you.",
      "permalink": "/r/wallstreetbets/comments/1cwobk1/fmc_may_soar_on_a_spike_in_pesticide_demand/l4x6tkj/",
      "created": 1716235029,
      "depth": 0,
      "replies": [
        {
          "id": "l4x73cs",
          "score": 7,
          "body": "Good luck to us",
          "permalink": "/r/wallstreetbets/comments/1cwobk1/fmc_may_soar_on_a_spike_in_pesticide_demand/l4x73cs/",
          "created": 1716235126,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l4xiqgr",
      "score": 5,
      "body": "I’m a user of FMC products. The one product I use, Segway, is now easily accessible as a generic. Patten must have been up. The rest of their products are not great. Don’t know if there is a correlation. Just my opinion as a consumer.",
      "permalink": "/r/wallstreetbets/comments/1cwobk1/fmc_may_soar_on_a_spike_in_pesticide_demand/l4xiqgr/",
      "created": 1716239317,
      "depth": 0,
      "replies": [
        {
          "id": "l4y5eon",
          "score": 2,
          "body": "It's a good point.  Patents for some products are expiring.  They have replacements lined up, but it does add some long term uncertainty.  My main point is that the revenue in the coming months will be significantly higher than what the market currently expects.",
          "permalink": "/r/wallstreetbets/comments/1cwobk1/fmc_may_soar_on_a_spike_in_pesticide_demand/l4y5eon/",
          "created": 1716248314,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l4x3sb5",
      "score": 2,
      "body": "Investing in pestilence—how quaint. Remember, money doesn't sleep, so perhaps try a leveraged ETF instead.",
      "permalink": "/r/wallstreetbets/comments/1cwobk1/fmc_may_soar_on_a_spike_in_pesticide_demand/l4x3sb5/",
      "created": 1716233947,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4ym1it",
      "score": 2,
      "body": "Fuck it, I’m in.",
      "permalink": "/r/wallstreetbets/comments/1cwobk1/fmc_may_soar_on_a_spike_in_pesticide_demand/l4ym1it/",
      "created": 1716255502,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l4x5h1y",
      "score": 1,
      "body": "Show your positions?",
      "permalink": "/r/wallstreetbets/comments/1cwobk1/fmc_may_soar_on_a_spike_in_pesticide_demand/l4x5h1y/",
      "created": 1716234549,
      "depth": 0,
      "replies": [
        {
          "id": "l4xbfoq",
          "score": 8,
          "body": "https://preview.redd.it/weld30vs4n1d1.jpeg?width=1079&format=pjpg&auto=webp&s=2a5e2f345e611d72a33268054b94f8b820402236",
          "permalink": "/r/wallstreetbets/comments/1cwobk1/fmc_may_soar_on_a_spike_in_pesticide_demand/l4xbfoq/",
          "created": 1716236682,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}