{
  "title": "Nvidia: Dell teams with Nvidia to offer new Blackwell GPUs in AI push",
  "score": 60,
  "selftext": "Dell Technologies (NYSE:DELL) said on Monday it is working with Nvidia (NASDAQ:NVDA) to offer the semiconductor company's latest Blackwell GPUs in its servers amid the artificial intelligence boom.\n\n\n\nDell's new PowerEdge XE9680L server comes with direct liquid cooling and sports eight Nvidia Blackwell Tensor Core GPUs. GPUs are increasingly power data centers — in favor of the more traditional CPUs created by Intel (INTC), AMD (AMD) and others — as they are better capable of handling for AI workloads.\n\n\n\n\"Organizations are moving quickly to capture the AI opportunity, which is why our collaboration with NVIDIA is so important,\" Dell founder and Chief Executive Officer Michael Dell said in a statement. \"Our expansion of the Dell AI Factory with NVIDIA continues our joint mission – we're making it easy for organizations to implement AI so they can move boldly into this next technological revolution.\"\n\n\n\n\"Generative AI requires a new type of computing infrastructure – an AI factory that produces intelligence,\" Nvidia Chief Executive Jensen Huang added. \"Together, NVIDIA and Dell are providing the world's industries with a full-stack offering – including computing, networking and software – that drives the copilots, coding assistants, virtual customer service agents and industrial digital twins of the digital enterprise.\"\n\n\n\nDell and Nvidia are also working on the Dell AI Factory in an effort to speed AI adoption and innovation, the two companies said in the statement.\n\n\n\nNvidia announced its new Blackwell line of GPUs in March, receiving much acclaim from Wall Street.\n\n\n\nSeparately on Monday, Dell announced that it would be working with Microsoft (MSFT) to offer new AI-powered PCs running on Qualcomm (QCOM) processors.",
  "link_flair_text": "News",
  "id": "1cx79nx",
  "num_comments": 13,
  "created_utc": 1716296263,
  "permalink": "/r/wallstreetbets/comments/1cx79nx/nvidia_dell_teams_with_nvidia_to_offer_new/",
  "comments": [
    {
      "id": "l512c52",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 461 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1cx79nx/nvidia_dell_teams_with_nvidia_to_offer_new/l512c52/",
      "created": 1716303691,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l510bv4",
      "score": 21,
      "body": "Time to short Super Micro Computer Inc. Assembling servers with AI chips is a low margin business. It's not just DELL, many more other assemblers would jump in this market soon. No reason why SMCI should have jumped 4,488.90% in 5 years.",
      "permalink": "/r/wallstreetbets/comments/1cx79nx/nvidia_dell_teams_with_nvidia_to_offer_new/l510bv4/",
      "created": 1716302971,
      "depth": 0,
      "replies": [
        {
          "id": "l556ber",
          "score": 2,
          "body": "isn't their competitive adv in some cooling tech?",
          "permalink": "/r/wallstreetbets/comments/1cx79nx/nvidia_dell_teams_with_nvidia_to_offer_new/l556ber/",
          "created": 1716367068,
          "depth": 1,
          "replies": [
            {
              "id": "l563teb",
              "score": 1,
              "body": "Yes, and that's their main USP. However, I am not quite sure if that's a unique barrier that others like Dell can't cross. Cooling tech for CPUs, GPUs, and machines in general, has been decades old. \n\nTheir main advantage has been close tie up with NVIDIA, whose chips have been hard to order. But if there is so much money in the business supply will only improve. Even NVIDIA would diversify to multiple assemblers as they won't want SMCI to be a bottle neck.\n\nSaid that, I have heard only good things about SMCI's scaling abilities. They have been pretty quick to adapt their assembly lines with new NVIDIA chips. I guess, others will learn too.",
              "permalink": "/r/wallstreetbets/comments/1cx79nx/nvidia_dell_teams_with_nvidia_to_offer_new/l563teb/",
              "created": 1716385463,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l51jk70",
      "score": 5,
      "body": "Calls on Dell right before earnings?",
      "permalink": "/r/wallstreetbets/comments/1cx79nx/nvidia_dell_teams_with_nvidia_to_offer_new/l51jk70/",
      "created": 1716309729,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l5195oy",
      "score": 2,
      "body": "Holy hell what is this grammar.",
      "permalink": "/r/wallstreetbets/comments/1cx79nx/nvidia_dell_teams_with_nvidia_to_offer_new/l5195oy/",
      "created": 1716306107,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l50j6n7",
      "score": 1,
      "body": "Hey, do you have a source? Please add a link in the post or as a reply to this comment!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
      "permalink": "/r/wallstreetbets/comments/1cx79nx/nvidia_dell_teams_with_nvidia_to_offer_new/l50j6n7/",
      "created": 1716296263,
      "depth": 0,
      "replies": []
    }
  ]
}