{
  "title": "Anti-trust lawsuits against Live Nation and Ticketmaster",
  "score": 104,
  "selftext": "Just saw this news break Justice Department is filing an anti-trust lawsuit against Live Nation Ticketmaster tomorrow.\n\nhttps://www.bloomberg.com/news/articles/2024-05-22/justice-department-to-seek-breakup-of-live-nation-ticketmaster?embedded-checkout=true\n\nLive Nation is already down 6.52 dollars in after hours trading. Is the Justice Department gonna win? Ticket prices are through the roof and aren't really justified IMO.",
  "link_flair_text": "Discussion",
  "id": "1cyjmry",
  "num_comments": 35,
  "created_utc": 1716436282,
  "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/",
  "comments": [
    {
      "id": "l59xkq0",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 112 | **Previous Best DD** | \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l59xkq0/",
      "created": 1716436286,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l59zfk3",
      "score": 57,
      "body": "Ticket master has some crazy high fees and the app is complete dogshit",
      "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l59zfk3/",
      "created": 1716437239,
      "depth": 0,
      "replies": [
        {
          "id": "l5a0om4",
          "score": 35,
          "body": "Yep. It's so extortionary and blatantly leverages being a monopoly and ensuring that there's no competition even though selling tickets is exceptionally easy. The fact the app and website is just godawful is cherry on top because they also have no reason to make it good. \n\nJust racking in $$$$ for being the pimp in the transaction.\n\nI hope Ticketmaster they get thoroughly obliterated.",
          "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5a0om4/",
          "created": 1716437893,
          "depth": 1,
          "replies": [
            {
              "id": "l5b8bvc",
              "score": 10,
              "body": "It absolutely annoys the shit out of me that when one fan sells a ticket to another fan ticketmaster takes about a $50 cut for doing basically nothing.",
              "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5b8bvc/",
              "created": 1716466149,
              "depth": 2,
              "replies": [
                {
                  "id": "l5dppe1",
                  "score": -2,
                  "body": "You used to have to ship the tickets in the mail! I get that it’s not worth 50$ but it’s not basically nothing.",
                  "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5dppe1/",
                  "created": 1716498378,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l5ed2mj",
                      "score": 0,
                      "body": "Okay, but that isn't the alternative anymore.",
                      "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5ed2mj/",
                      "created": 1716507924,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l59zavk",
      "score": 60,
      "body": "Good. Fuck Ticketmaster",
      "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l59zavk/",
      "created": 1716437172,
      "depth": 0,
      "replies": [
        {
          "id": "l5a07t8",
          "score": 11,
          "body": "Giving some thought to buying some long dated puts. If a recession hits less ticket sales and if the DoJ wins even more catalysts to help drive down share price.",
          "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5a07t8/",
          "created": 1716437646,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l5axrto",
      "score": 19,
      "body": "They need to be rekt, one of the most evil companies outside of Xfinity.",
      "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5axrto/",
      "created": 1716460419,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l5a98gj",
      "score": 10,
      "body": "Good. Fuck em",
      "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5a98gj/",
      "created": 1716442844,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l5c6qy7",
      "score": 6,
      "body": "The DOJ approved this merger in 2010. This is their own damn fault.",
      "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5c6qy7/",
      "created": 1716479399,
      "depth": 0,
      "replies": [
        {
          "id": "l5dgs16",
          "score": 2,
          "body": "Tin foil hat: This is part of that deal. They allowed the merger for bonus, allowed them a monopoly for some years before they're gonna fine them pennies on the dollar.",
          "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5dgs16/",
          "created": 1716495210,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l59xlzt",
      "score": 11,
      "body": "The peasants want to have nice things too, how dare they.",
      "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l59xlzt/",
      "created": 1716436303,
      "depth": 0,
      "replies": [
        {
          "id": "l5bjprm",
          "score": 1,
          "body": "Yeah, wreck them !!",
          "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5bjprm/",
          "created": 1716471087,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l5b9tdx",
          "score": 0,
          "body": "Bad bot",
          "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5b9tdx/",
          "created": 1716466844,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l5c8mw1",
      "score": 3,
      "body": "Yes! Fuck Tickermaster in the face and ears.",
      "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5c8mw1/",
      "created": 1716480041,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l5avb7h",
      "score": 5,
      "body": "Wait the government is going to..well govern...crazy y'all",
      "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5avb7h/",
      "created": 1716458799,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l5a4geh",
      "score": 3,
      "body": "Short squeeze potential for $SEAT …? The chart looks awful. But over 13% of float sold short. And the shares short is like 7.5x the average daily volume. They could stand to benefit from LYV’s potential woes, and it trades at like half the P/E of Live Nation.\n\nThe market has treated this stock like it’s gonna go out of business since it IPO’d. But the balance sheet isn’t THAT bad and they’re operating margin is usually over 10%.",
      "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5a4geh/",
      "created": 1716439980,
      "depth": 0,
      "replies": [
        {
          "id": "l5bazaf",
          "score": 2,
          "body": "Their fees are just as high so I'm not sure how much this really helps their bottom line",
          "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5bazaf/",
          "created": 1716467384,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l5csq8l",
          "score": 1,
          "body": "[removed]",
          "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5csq8l/",
          "created": 1716486922,
          "depth": 1,
          "replies": [
            {
              "id": "l5e4ae7",
              "score": -1,
              "body": ">The future of ticketing is Blockchain / NFT ticketing.\n\nIt’s really really not. Ticketmaster’s problem is being a rent-seeking monopolist, not their failure to switch their computing model to a distributed peer network.",
              "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5e4ae7/",
              "created": 1716504163,
              "depth": 2,
              "replies": [
                {
                  "id": "l5e55ty",
                  "score": 2,
                  "body": "*whoosh*\n\nIt really really is. \n\nNowhere did I say that Ticketmaster needed to switch to a distributed peer network. \n\nI'm talking about a technology shift that allows event holders and venues to easily and effectively issue their own secure tickets directly to customers without an intermediary. \n\nThis allows bands to both offer cheaper tickets and make more money while at the same time even eliminating fake tickets and scalping as well as a host of other benefits for event goers. Both sides come out winners because you only need two pieces of the pie instead of three. \n\nHave you bothered to look at any of the artists that are currently using this technology yet? Or are you just assuming you know what implementing this looks like and counting solely on your imagination and understanding?",
                  "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5e55ty/",
                  "created": 1716504517,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l5ehk5f",
                      "score": 0,
                      "body": ">I'm talking about a technology shift that allows event holders and venues to easily and effectively issue their own secure tickets directly to customers without an intermediary.\n\nThat's already possible with pre-blockchain technology. Blockchain doesn't solve this problem because it's not a problem. The only reason more venues don't do this already is that Ticketmaster tells them not to - which they can (usually) do because of their Monopoly status, not because of any technological barriers. And yes, some small producers reject Ticketmaster and go solo - it's not illegal or anything, it's just less competitive (again because Monopoly).\n\nSelling tickets is just not that hard. Venues sold tickets before computers existed, let alone before blockchain. You have a \"solution\" in search of a problem.",
                      "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5ehk5f/",
                      "created": 1716509883,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l5el5o8",
                          "score": 2,
                          "body": "> That's already possible with pre-blockchain technology.\n\nI disagree but I'm open to being wrong. Which exact technology are you referring to? And it better be comparable and can be implemented directly by artists or venues for under $5 per ticket (I went super high here to give you a fighting chance. Realistically it would be pennies) after overhead, distribution and final costs... Like an NFT ticket.\n\nDid you look at the use cases and the examples of the bands that are already using NFT ticketing? Please answer this first before we continue otherwise there's no point in moving forward. It seems sure either dodging the question or just being inconsiderate of answering my questions and expecting me to just answer yours. \n\nYou sound like a person saying “We don't need barcodes on this package of Wrigley's gum, The stock boy can just put price stickers on it like he does with everything else\" as barcodes were first introduced into supermarkets and quickly changed the landscape of checking out, pricing, inventory, and more. Even decades later we're still seeing changes and innovations like self checkout. \n\nMy point being is that if a simple black and white square with some lines on it representing a numeric string that can be red with a bar of light can transform multiple industries and both the consumer side and retail side as well as logistic side, maybe take a little bit of humility into your perspective of how much this tech is going to change multiple other industries. \n\nYou're home and your car title will be NFTs. You can remove title insurance from the closing cost of buying a house moving forward. Stocks and other securities will be tokenized. This will eliminate multiple avenues of fraud, the need for brokers, and the need for the majority of the regulatory body and enforcement agencies as the rules can be just simply programmed in. \n\nThat's a pretty ahead of the curve on a lot of things but I'm not prideful enough to think that I can't imagine a majority of what will come out of this. This is a paradigm shifting technology implications of that fully for quite some time. \n\nBut like with the invention of the automobile we can guarantee that certain services are headed the way of the dodo. The manufacturing of horse-drawn carriages and wagon wheels has gone down significantly since then. \n\nAlso since Uber and ride sharing apps came out taxi companies that had decades to innovate and upgrade have now a very small market share with most of the company's dying out. \n\nTicketmaster is sitting over there like fax machine right after email has just started to be a buzz word but virtually no one has used it.",
                          "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5el5o8/",
                          "created": 1716511445,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l5ihsqy",
                              "score": 2,
                              "body": "What sort of timeline do you think it would take for 50%/100% industry adoption of this technology to issue tickets? I'm probably going to buy some long dated puts against LYV and see where it goes with a possible recession and a DoJ successful lawsuit both powerful catalysts to drive down share price.",
                              "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5ihsqy/",
                              "created": 1716578323,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l5ilwqp",
                                  "score": 1,
                                  "body": "I'm not really sure at this point. That depends on how quickly the companies involved can make it seamless and user-friendly. \n\nThe majority of people need to be able to use it by simply opening an app and connecting their debit card, credit card, or PayPal and have zero understanding of what an NFT is ultimately. \n\nBut these companies are rapidly working towards this goal and are making leaps and b\n\nI'm keeping my eye trained closely on this space. There are multiple companies working towards this goal using multiple solutions, platforms, protocols, and tokens. \n\nBasically it's a toss up of who can do it first, better, and get contracts with some big players like the NFL or apple pay for example. That's something to look out for.\n\nWhen you see the technology ready to roll out to the point where your average 30 year old Taylor Swift fan can download an app and use it we're definitely there.",
                                  "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5ilwqp/",
                                  "created": 1716579842,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l5bbdwz",
      "score": 1,
      "body": "[removed]",
      "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5bbdwz/",
      "created": 1716467569,
      "depth": 0,
      "replies": [
        {
          "id": "l5bbel0",
          "score": 1,
          "body": "Better late than never!",
          "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5bbel0/",
          "created": 1716467578,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l5cekh0",
      "score": 1,
      "body": "I wouldn’t mind them being a monopoly on tickets if they would make their app/website work well. But they don’t because they have no competition so this is badly needed.",
      "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5cekh0/",
      "created": 1716482075,
      "depth": 0,
      "replies": [
        {
          "id": "l5dgg8h",
          "score": 2,
          "body": "You do realize that them being a monopoly is why they have no competition right?",
          "permalink": "/r/wallstreetbets/comments/1cyjmry/antitrust_lawsuits_against_live_nation_and/l5dgg8h/",
          "created": 1716495095,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}