{
  "title": "Boeing in the news again",
  "score": 66,
  "selftext": "https://washingtonpost.com/technology/2024/05/24/nasa-commercial-crew-boeing-spacex/\n\nBoeing is having a rough weekend. This  new problem would be even worse than the ship exploding. Imagine having to watch the crew slowly suffocate in orbit because they can't return home...",
  "link_flair_text": "Discussion",
  "id": "1d0s89o",
  "num_comments": 26,
  "created_utc": 1716692896,
  "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/",
  "comments": [
    {
      "id": "l5p4tx0",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 119 | **Previous Best DD** | \n**Account Age** | 8 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5p4tx0/",
      "created": 1716692898,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l5p7874",
      "score": 17,
      "body": "Paywall",
      "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5p7874/",
      "created": 1716694131,
      "depth": 0,
      "replies": [
        {
          "id": "l5pmizx",
          "score": 8,
          "body": "https://archive.is/SSckp",
          "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5pmizx/",
          "created": 1716703529,
          "depth": 1,
          "replies": [
            {
              "id": "l5ptmjc",
              "score": 2,
              "body": "Does this work for any paywall?",
              "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5ptmjc/",
              "created": 1716708727,
              "depth": 2,
              "replies": [
                {
                  "id": "l5qgk3b",
                  "score": 5,
                  "body": "Yes",
                  "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5qgk3b/",
                  "created": 1716725326,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l5r0cig",
                      "score": 6,
                      "body": "Works on most major sites. Sometimes a snap shot hasn't been created yet and you'll have to wait for it to generate but its quick most of the time. If you run into paywal often look up how to set up a bookmarklet for your browser. Clicking this one on a paywal site will auto-redirect you to the archive version. \n\n    javascript: (() => {  window.location = \"https://archive.is/\"+window.location.toString();})();",
                      "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5r0cig/",
                      "created": 1716734434,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l5q9h9b",
      "score": 23,
      "body": "now this is some fucking low effort posting OP. jesus christ. a Pay wall , AND you couldn't even put a fucking title ? fuck off",
      "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5q9h9b/",
      "created": 1716720897,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l5p4w91",
      "score": 21,
      "body": "Another day, another dollar...or in Boeing's case, another disaster.",
      "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5p4w91/",
      "created": 1716692929,
      "depth": 0,
      "replies": [
        {
          "id": "l5p9fyj",
          "score": 8,
          "body": "or also in Boeing's case, another blank check contract military contract",
          "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5p9fyj/",
          "created": 1716695336,
          "depth": 1,
          "replies": [
            {
              "id": "l5qrhi3",
              "score": 4,
              "body": "4.2B and still here and Space X did it for 2.6B 4 years ago",
              "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5qrhi3/",
              "created": 1716730731,
              "depth": 2,
              "replies": [
                {
                  "id": "l5qwhyy",
                  "score": 3,
                  "body": "Spacex designed and built everything themselves. All tolerances were from and by their own specs. Boeing farmed out the work to usual suspects and here we are. Lots of engineering with little practical execution. Another problem they keep having: they don’t know what they don’t know. Even with decades of space flight to comb over. \n\n*IF* they get this thing in flight…they’ll still be in the hole. So. Much. Money. Lost.",
                  "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5qwhyy/",
                  "created": 1716732877,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l5p8e6d",
      "score": 10,
      "body": "Cool thing is that no matter what shitty job Boeing does, it is of such national interest, that nothing will ever happen to them.\nIt is by now part of Government. That explains things I guess.",
      "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5p8e6d/",
      "created": 1716694762,
      "depth": 0,
      "replies": [
        {
          "id": "l5pcy01",
          "score": 6,
          "body": "Wish anyone had some balls in the government and just nationalize the shit out of them.",
          "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5pcy01/",
          "created": 1716697343,
          "depth": 1,
          "replies": [
            {
              "id": "l5pgxty",
              "score": 1,
              "body": "Wouldn't that just cause stagnation and solidify their problems?\n\nNationalisation isn't a good move for industries that rely on leading R&D to remain competitive. It's fine for things like utilities or healthcare - not so much this",
              "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5pgxty/",
              "created": 1716699792,
              "depth": 2,
              "replies": [
                {
                  "id": "l5phdim",
                  "score": 6,
                  "body": "Sell it to their competitors for profit. The Venn lines between mil contractors and the DOD is almost already a revolving circle. Just purge the BA goons and give their shit to someone else and make money off the deal. Literally everybody but old money corrupt fuckups at BA wins under that scenario.",
                  "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5phdim/",
                  "created": 1716700072,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l5phrf6",
                      "score": 0,
                      "body": "Firstly, there's only one major competitor in commercial aerospace, Airbus. Selling to foreigners will never happen because of national interest\n\nAs for their military arm, that's not where the problems lie - so why would you want to sell to the likes of Lockheed, etc. and reduce competition in the market?\n\nYour idea doesn't make sense",
                      "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5phrf6/",
                      "created": 1716700319,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l5pkxiv",
                          "score": 0,
                          "body": "It doesn’t make sense with your common surface level analysis. I said balls didn’t I? “They’re literally too big to fail bro” is your argument then? No one is, nothing is. There’s nothing inherently magical about BA or their executives, and just like everyone else that is established in smelling their own farts they are prone to decay corruption and general fuckupery which they’ve all displayed now publicly and in spades. \n\nIn a hypothetical scenario involving the nationalization and sell-off of Boeing's infrastructure, several U.S. competitors and smaller aerospace companies could potentially step in to acquire parts of Boeing's assets. Major U.S. competitors in the aerospace industry include Lockheed Martin, Northrop Grumman, and General Dynamics. These companies have diverse portfolios that encompass defense, space, and sometimes commercial aerospace capabilities. “There’s just one major competitor!” Yeah, now, under current circumstances, cool. But if you can think maybe just a few steps ahead you could see smaller aerospace companies like Spirit AeroSystems, Aerojet Rocketdyne, and Huntington Ingalls Industries could also be contenders for acquiring specific assets or capabilities of Boeing under such circumstances - especially when they get handed the infrastructure and get backed by the long dick of the government checkbook. Shit you could even then spin this into a much needed public win on the PR side of things, and you even got your bonus of increased market competition. So it’s a win, win, win, win, win at this point? Unless you’re a BA Stan, corrupt inside goon with your nose full of coke, or their hitmen of course. You’re welcome.",
                          "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5pkxiv/",
                          "created": 1716702437,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l5pu0i9",
                              "score": 1,
                              "body": "Your whole idea is to hand over Boeing's commercial aerospace business to companies that have little to no experience operating in that business at scale, just because you hope they do a better job\n\nNo one is doubting the likes of Lockheed, etc. can handle the military business, but that's not the area Boeing is failing in. So what do they know about commercial aerospace?\n\nAnd you think my analysis is surface level? Lol\n\nAlso, I never said they're too big to fail. That's the other guy. My point is - they can definitely fail. But nationalisation and spinoffs ain't the answer buddy",
                              "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5pu0i9/",
                              "created": 1716709024,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l5pw9bi",
      "score": 2,
      "body": "People keep talking about BA stock dropping, and tbf it has fallen a bit. But over the past few months it has been fairly stable even with all this bad news. In fact, the price was rising.",
      "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5pw9bi/",
      "created": 1716710753,
      "depth": 0,
      "replies": [
        {
          "id": "l5q9lfg",
          "score": 0,
          "body": "that's because the most important thing is the on going door plug issue which there haven't been too many updates on. instead people just keep posting clickbait articles involving a Boeing plane or their name and expecting the stock to drop.  posts like this are annoying as fuck, OP couldn't even put a proper title.",
          "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5q9lfg/",
          "created": 1716720977,
          "depth": 1,
          "replies": [
            {
              "id": "l5qcvb4",
              "score": 1,
              "body": "TBH, as soon as I see the link goes to Washington Post, I just assume it is trash.",
              "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5qcvb4/",
              "created": 1716723150,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l5trt6z",
      "score": 2,
      "body": "This is by far one of their biggest failures....It's basically an updated capsule on top of an Atlas V rocket which has been around since 2002.\n\nSpaceX is crushing it with dozens of flights on an all new platform & they got the smaller contract. \n\nTime for Boeing to be split up....",
      "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5trt6z/",
      "created": 1716774742,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l5qrn16",
      "score": 1,
      "body": "The last sentence of the article is priceless. How much is Boeing paying these guys?\n\n“I can say with confidence that the teams have absolutely done their due diligence,” Free, NASA’s associate administrator, said [back in April…]",
      "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5qrn16/",
      "created": 1716730799,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l5qrwdx",
      "score": 1,
      "body": "> The system is designed for Boeing by Aerojet Rocketdyne\n\nY’all look for any and every reason to buy puts on BA, yet you don’t read the articles you post to place blame where it actually belongs. \n\n[Aerojet Rocketdyne](https://www.l3harris.com/company/aerojet-rocketdyne) is now owned by [L3 Harris](https://finance.yahoo.com/quote/LHX/).",
      "permalink": "/r/wallstreetbets/comments/1d0s89o/boeing_in_the_news_again/l5qrwdx/",
      "created": 1716730911,
      "depth": 0,
      "replies": []
    }
  ]
}