{
  "title": "Investors gave a teenager $85 million to build hydrogen weapons. It’s been a 'disaster'",
  "score": 109,
  "selftext": "",
  "link_flair_text": "News",
  "id": "1d0vv0u",
  "num_comments": 59,
  "created_utc": 1716707430,
  "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/",
  "url_overridden_by_dest": "https://www.forbes.com.au/news/innovation/investors-gave-a-teenager-85-million-to-build-hydrogen-weapons-its-not-going-well/",
  "comments": [
    {
      "id": "l5prwfc",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5prwfc/",
      "created": 1716707435,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l5puorv",
      "score": 77,
      "body": "VC tech bros don't learn anything :) \n\nThornton is just the next Elizabeth Holmes or SBF of the military tech world.",
      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5puorv/",
      "created": 1716709539,
      "depth": 0,
      "replies": [
        {
          "id": "l5px8kg",
          "score": 27,
          "body": "Every startup using hydrogen as an energy carrier is the same scam with a different fake mustache on it.\n\nExcept in rockets there is zero merit for hydrogen in any other fuel application.",
          "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5px8kg/",
          "created": 1716711510,
          "depth": 1,
          "replies": [
            {
              "id": "l5pxe07",
              "score": 4,
              "body": "Whys that? No easy way to compress or store it?",
              "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5pxe07/",
              "created": 1716711626,
              "depth": 2,
              "replies": [
                {
                  "id": "l5py38c",
                  "score": 23,
                  "body": "Garbage round trip efficiency in fuel cell applications. Starting and ending in electricity usually 25-30% efficient, which means whenever batteries are an alternative, their cost of operations will always be 3-4X as cheap\n\nHilariously terrible volumetric efficiency that usually ends up displacing all your cargo/passenger space on planes, trucks and cars. You can get some of it back by refrigeration to liquid state but you give up the weight advantage in the process.\n\nVery difficult to keep safe and monitor leaks, because typical odor agents likes those added to natural gas do not readily mix well with hydrogen and can foul up fuel cell applications.",
                  "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5py38c/",
                  "created": 1716712169,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l5q1c2c",
                      "score": 9,
                      "body": "And it’s the smallest gas we have, which means it leaks easier, and is oh so combustible when it does. \n\nSome years ago a hydrogen fueling station blew up in Norway. If there had been people there they’d probably have been killed. \n\nhttps://www.nrk.no/nyheter/eksplosjon-ved-hydrogenstasjon-1.14582944\n\nThe explosion was registered by seismic measuring equipment 28 km away that reacted to sound waves.",
                      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q1c2c/",
                      "created": 1716714689,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l5q7oz1",
                      "score": 3,
                      "body": "Also the water inside the fuel cells freezes at sub zero temperatures, because water.",
                      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q7oz1/",
                      "created": 1716719603,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l5qtcyv",
                      "score": 2,
                      "body": "Thanks for your wrinkle! I didn’t know all that, and appreciate you taking the time explain why you think it sucks.",
                      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5qtcyv/",
                      "created": 1716731549,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l5q3udk",
              "score": 3,
              "body": "Trains and long haul semis make some sense.\n\nTrains are all electric anyway, weight and storage don't bother them. \n\nLong haul semis care about refuelling time a lot, H2 refuel is 5 min vs BEV recharge times.  You've already got most the necessary shielding in the giant steel frame rails, and volumetric efficiency doesn't matter as much as weight efficiency.\n\nThose both need Red H2 to make environmental sense, though.",
              "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q3udk/",
              "created": 1716716667,
              "depth": 2,
              "replies": [
                {
                  "id": "l5qfxei",
                  "score": 1,
                  "body": "If your train is electric, why don’t you just run the train with that electricity? From the wire?",
                  "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5qfxei/",
                  "created": 1716724966,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l5qtusu",
                      "score": 2,
                      "body": "Fam.\n\nEvery train you see is an electric train with a diesel generator.",
                      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5qtusu/",
                      "created": 1716731766,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l5qvs2x",
                          "score": 0,
                          "body": "Except the ones with an actual wire going in",
                          "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5qvs2x/",
                          "created": 1716732579,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l5rvsag",
                              "score": 1,
                              "body": "Those are not trains.  Light rail, trolley, or streetcars work with overhead electric, but no long haul cargo trains use direct electric since it's a bad idea for various reasons.",
                              "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5rvsag/",
                              "created": 1716746361,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l5s5xry",
                                  "score": 1,
                                  "body": "Lol, lmao even\n\n> As of 2012, electrified tracks accounted for nearly one third of total tracks globally.[9]\nAs of 2018, there were 72,110 km (44,810 mi) of railways electrified at 25 kV, either 50 or 60 Hz; 68,890 km (42,810 mi) electrified at 3 kV DC; 32,940 km (20,470 mi) electrified at 15 kV 16.7 or 16+2⁄3 Hz and 20,440 km (12,700 mi) electrified at 1.5 kV DC.[13]: 2 \n\n> The Trans-Siberian Railway mainly in Russia is completely electrified, making it one of the longest stretches of electrified railways in the world.[48]\n\nhttps://en.wikipedia.org/wiki/Railway_electrification\n\nYou saying the _Trans-Siberian railway_ does not have long haul cargo trains?",
                                  "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5s5xry/",
                                  "created": 1716750254,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l5sbgej",
                                      "score": 1,
                                      "body": "The article you linked -\n\n>Electrification in the US reached its maximum of 3,100 miles (5,000 km) in the late 1930s.[6][7][8]\nBy 1973, it was down to 1,778 route miles (2,861 km) (Class I railroads) with the top 3 being: Penn Central 829 miles (1,334 km), Milwaukee Road 658 miles (1,059 km), Long Island Rail Road 121 miles (195 km).\nIn 2013, the only electrified lines hauling freight by electricity were three short line coal haulers (mine to power plant) and one switching railroad in Iowa.[9] The total electrified route length of these four railroads is 122 miles (196 km). While some freight trains run on parts of the electrified Northeast Corridor and on part of the adjacent Keystone Corridor, these freight trains use diesel locomotives for traction. The total electrified route length of these two corridors is 559 miles (900 km). Diesel-powered freight runs similarly operate over the South Shore Line and the San Diego Trolley light rail system.\n\nSo less than 1% of ALL rail in the US is electrified.\n\nIt's not impossible, just much more difficult and expensive than the alternative.",
                                      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5sbgej/",
                                      "created": 1716752405,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l5u3k68",
                                          "score": 2,
                                          "body": "Meanwhile India is at 93.83%, China is at 75.20%, EU is at 55.98%, even shithole Russia with large distances is at 51.48%.\n\n\n> Electric locomotives usually cost 20% less than diesel locomotives, their maintenance costs are 25–35% lower, and cost up to 50% less to run.\n\n> Because railroad infrastructure is privately owned in the U.S., railroads are unwilling to make the necessary investments for electrification. In Europe and elsewhere, railway networks are considered part of the national transport infrastructure, just like roads, highways and waterways, so are often financed by the state. \n\n(No source on that statement but seems credible)\n\nhttps://en.wikipedia.org/wiki/Electric_locomotive\n\n\n> Diesel-powered trains transfer about 30-35 percent of the energy generated by combustion to the wheels, while supplying electricity directly from an overhead powerline transfers about 95 percent of the energy to the wheels.\n\nhttps://www.eesi.org/articles/view/electrification-of-u.s.-railways-pie-in-the-sky-or-realistic-goal",
                                          "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5u3k68/",
                                          "created": 1716780233,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l5rsc5r",
                  "score": 0,
                  "body": "Makes zero sense in both those applications.\n\nYou still need a substantially large buffer battery. On the Nikola semi it's 1/3 of the Tesla semi battery.\n\nThe Nikola FCEV semi is actually heavier than the equivalent range BEV semi.\n\n5 min refuel for trucks and trains is not possible. The Nikola semi is advertised as \"as low as 20 mins\". In practice pumps with that kind of flow rate don't exist commercially. Hydrogen pumps are already terriblly unreliable as they are. \n\nAnd finally, the single most crucial item to both of those applications is operating cost. Hydrogen will always be 3-4X as expensive as direct electric, at a minimum.",
                  "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5rsc5r/",
                  "created": 1716745054,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l5rtchp",
                      "score": 0,
                      "body": "I've worked on multiple H2 projects in logistics equipment development.\n\nUsing Nikola as a standard is like saying your two year old can't construct a house so it's not possible.\n\nGenerally speaking you need your fuel cell battery to be able to handle peak current alone for up to 2 minutes.  On a semi that means dealing with a ~300kW load for .034 hours, which can easily be handled by a 60-100kWh battery pack in either NMC or LiFePO4 flavors... Aka the battery pack on a normal BEV. \n\nH2 is more expensive currently, no doubt.  But there are a lot more factors than current price points.",
                      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5rtchp/",
                      "created": 1716745435,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l5rvvbw",
                          "score": 1,
                          "body": "Sure let's push Nikola out of the way and look at the rest of the scam industry.\n\nFind me a single hydrogen FCEV long haul(300+ mi) truck or train that can complete refueling in 5 mins like your previous comment said, in commercial operations at a commercial refueling station. \n\nYes I'm aware there are lab/prototype pumps that can do 10+kg/min. Just as there are prototype solid state BEVs that can charge in 5-10 mins.\n\nYour math for battery sizing is whack. NMC can only safely sustain 2C continuous discharge rate which gives 150KWh before any margins for NMC. For LFP yeah sure the discharge rate allows a much smaller battery, but to reduce depth of discharge and adding a cold weather margin you're still looking at more than 100kwh.",
                          "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5rvvbw/",
                          "created": 1716746394,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l5ryl03",
                              "score": 1,
                              "body": "Production, no.  Daimler prototype is public at 10min for 1000km refuel with Liquid H2.\n\nLast I checked the .5/.5/8 NMC could do 5C continuous but I'll have to go check when I get back to desktop.\n\nEither way, 70 or 150 kWh vs. Enron Muskrats 1mWh vaporware truck is a pretty big differential.\n\nCharging Solid States at that rate still requires basically an entire direct connection to a small to midsize powerplant-\n\n1MWh/5min = 16MW, not accounting for losses.\n\nTrains make the most sense because refuelling depots can be very concentrated, long haul trucks are on the maybe side of profitability with matured tech and distribution.\n\nAll the long haul combustion replacement tech has a long way to go, BEV and FCEV both have potential in that space long term though. \n\nAnyone talking about H2 medium duty or lower capacity outside of specific applications (e.g. inside warehouse forklifts) should be ignored though.",
                              "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5ryl03/",
                              "created": 1716747437,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l5s30rt",
                                  "score": 1,
                                  "body": "So of course this 5 min refuel FCEV is not commercially available.\n\nThere are existing supercharger stations with 60 stalls of 250kw each. Add a few Megapacks for peak load management big whoop.\n\nHow many retail Hydrogen stations can make or supply more than 100kg per day?\n\nWas your plan to use tanker trucks to bring in hydrogen, at the rate of 10 trucks to one tanker, instantly costing 10% of your efficiency? \n\nOr was it building a million acres of PV on site at each station to electrolyze on site?\n\nOr was it building a long long long pipe to a centralized station?",
                                  "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5s30rt/",
                                  "created": 1716749130,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l5s30sp",
                                      "score": 1,
                                      "body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                                      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5s30sp/",
                                      "created": 1716749131,
                                      "depth": 8,
                                      "replies": []
                                    },
                                    {
                                      "id": "l5sbrgj",
                                      "score": 0,
                                      "body": "You missed the part where I said Red H2 was a requisite.\n\nThat ain't my field, I just build vehicles.\n\nI just leave the chem nerds alone, mostly because they stare at you way too intensely.",
                                      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5sbrgj/",
                                      "created": 1716752523,
                                      "depth": 8,
                                      "replies": []
                                    },
                                    {
                                      "id": "l5sd8h4",
                                      "score": 0,
                                      "body": "You missed the part where I said Red H2 was a requisite.\n\nThat ain't my field, I just build vehicles.\n\nI just leave the chem nerds alone, mostly because they stare at you way too intensely.",
                                      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5sd8h4/",
                                      "created": 1716753099,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l5q20n8",
          "score": 0,
          "body": "Elon is the current one, surely. This guy is playing with chump change compared to Enron Musk",
          "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q20n8/",
          "created": 1716715223,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l5pwwnf",
      "score": 122,
      "body": "> Thornton was reaching into a blast chamber surrounding a hydrogen-powered gun when the gas unexpectedly ignited, blowing up the machinery and sending a spray of shrapnel across the room. Thornton was miraculously unharmed, but a colleague helping with the test was rushed to the hospital with hundreds of pieces of metal in his body. (The employee recovered, though some of the shrapnel remains.)\n\nHe may have fucked up with the hydrogen weapons, but we may get Iron Man",
      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5pwwnf/",
      "created": 1716711251,
      "depth": 0,
      "replies": [
        {
          "id": "l5pxk02",
          "score": 20,
          "body": "At least we got a man with iron",
          "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5pxk02/",
          "created": 1716711754,
          "depth": 1,
          "replies": [
            {
              "id": "l5q15w3",
              "score": 6,
              "body": "$85M for potato gun",
              "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q15w3/",
              "created": 1716714555,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l5q7tjk",
              "score": 2,
              "body": "Probably better than man with spiders.",
              "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q7tjk/",
              "created": 1716719699,
              "depth": 2,
              "replies": [
                {
                  "id": "l5q8hnt",
                  "score": 1,
                  "body": "Damn ok then.",
                  "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q8hnt/",
                  "created": 1716720186,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l5pwhxw",
      "score": 39,
      "body": "> Thornton built his team around a shared goal of helping America’s military interests, which he said started when he grew up helping his grandfather on a farm in West Texas\n\nWell if this doesn’t work out for him he already has the right catch-phrases in tow to go into politics",
      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5pwhxw/",
      "created": 1716710937,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l5q1md3",
      "score": 28,
      "body": "This is a joke, a 19 year old cannot make the most advanced weapon on this planet, I thought this is common sense.\n\nThis job should be done with people who at least gained a PhD in nuclear physics",
      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q1md3/",
      "created": 1716714915,
      "depth": 0,
      "replies": [
        {
          "id": "l5q2b14",
          "score": 23,
          "body": "Welcome to the future where kids with insane ideas get 80 mill to send us all to hell. Kid can't even buy beer but is playing with hydrogen gas",
          "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q2b14/",
          "created": 1716715452,
          "depth": 1,
          "replies": [
            {
              "id": "l5q36vb",
              "score": 6,
              "body": "A thermonuclear weapon is expremely complex, much much more complex than general atomic bombs... If US millitary spent $800b every year don;t have it idk why they think a teen could do it.... with $80m....\n\ngood news is humankind is saved lol",
              "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q36vb/",
              "created": 1716716150,
              "depth": 2,
              "replies": [
                {
                  "id": "l5q37hq",
                  "score": 6,
                  "body": "Oh please, teens are good for two things: inheriting my empire, and keeping the family lineage pure.",
                  "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q37hq/",
                  "created": 1716716164,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l5q7mdx",
                      "score": 2,
                      "body": "Thank you fellow ck3 player",
                      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q7mdx/",
                      "created": 1716719549,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l5q9jxw",
                          "score": 2,
                          "body": "Ah a sociopath of culture I see /s",
                          "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q9jxw/",
                          "created": 1716720948,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l5qcsoq",
                              "score": 2,
                              "body": "Not everyone gets the opportunity to have beautiful, fecund, genius, herculean children with their daughter.",
                              "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5qcsoq/",
                              "created": 1716723103,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l5qcz16",
                                  "score": 1,
                                  "body": "May you line reign 1000 years.",
                                  "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5qcz16/",
                                  "created": 1716723214,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l5qd3qe",
                                      "score": 2,
                                      "body": "May your family tree be perfect like the circle",
                                      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5qd3qe/",
                                      "created": 1716723295,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l5q3cio",
                  "score": 3,
                  "body": "It costs that much to get it right, but to get it wrong costs a lot less and can still be a disaster",
                  "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q3cio/",
                  "created": 1716716274,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l5q436s",
                  "score": 3,
                  "body": "We spent over $80mm recovering the recipe for the Styrofoam thermonukes need.\n\nSeriously, look up Fogbank.",
                  "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q436s/",
                  "created": 1716716858,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l5q5kwf",
                  "score": 3,
                  "body": "It isn't a thermonuclear weapon, its just regular guns using hydrogen gas as cobustible fuel instead of gunpowder or whatever they use.",
                  "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q5kwf/",
                  "created": 1716718019,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l5q5y0l",
          "score": 1,
          "body": "what about theoretical physics and theoretical degrees",
          "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q5y0l/",
          "created": 1716718299,
          "depth": 1,
          "replies": [
            {
              "id": "l5q9utq",
              "score": 1,
              "body": "*Mr. Fantastic has entered the chat*",
              "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q9utq/",
              "created": 1716721159,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l5q0xjg",
      "score": 9,
      "body": "I think the biggest mistake is he didn't ask r/noncredibledefense for advice\n\nBut nonetheless he got balls to make new concept of gun",
      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q0xjg/",
      "created": 1716714371,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l5psjnb",
      "score": 3,
      "body": "Not bad, I think it’s a great idea, but poor execution.",
      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5psjnb/",
      "created": 1716707916,
      "depth": 0,
      "replies": [
        {
          "id": "l5pzyyt",
          "score": 10,
          "body": "There's already hydrogen weapons, it's called the H bomb.",
          "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5pzyyt/",
          "created": 1716713622,
          "depth": 1,
          "replies": [
            {
              "id": "l5q8m1t",
              "score": 1,
              "body": "Yeah but this kid is democratizing H bombs",
              "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q8m1t/",
              "created": 1716720277,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l5q3777",
          "score": 1,
          "body": "Yeah building weapons is a great idea. Wtf?",
          "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q3777/",
          "created": 1716716157,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l5q5kqu",
      "score": 1,
      "body": "Thornton?  The car company from Cyberpunk?",
      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q5kqu/",
      "created": 1716718016,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l5q65xr",
      "score": 1,
      "body": "He didn't even finish MIT and still gets tens of millions to fuck with hydrogen gas lol.\n\n\nLike why use H2 exept for a thermonuclear bomb? Its hard to detect leaks of it and on top of that its literally the smallest molecule there is and so its the hardest gas to store in the world. \n\n\nIsn't military hardware supposed to be reliable and survive rough conditions? Seems stupid to have it on the frontline. Even the tiniest amount of damage could be catastrophical due to how small H2 molecule si and how easy it is for it to leak, from what I know.\n\n\nAlso is H2 even that good of a fuel?",
      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q65xr/",
      "created": 1716718469,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l5q7czl",
      "score": 1,
      "body": "Natural selection? I’m all for it let’s keep educating the smart youth.",
      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q7czl/",
      "created": 1716719361,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l5q9nvg",
      "score": 2,
      "body": "hydrogen expert and his team jumped ship just three months after securing $85 million in funding.\n\n\n“But three months after Bedrock reportedly led Mach’s series A funding round in October 2023, Limpaecher announced on LinkedIn that he was leaving Mach to start a new company, “bringing with me an existing team, technology, prototype products, customer relationships, and revenue” — effectively ending the company’s hydrogen ambitions. Responding to Limpaecher’s post, Thornton said: “Early this year we decided to spin this team off of Mach. While they were executing at an incredible level, we felt that it was best to focus on our core product line.” In an interview, Limpaecher said he was “glad Ethan supported our plans.”",
      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5q9nvg/",
      "created": 1716721023,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l5px3q7",
      "score": 0,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5px3q7/",
      "created": 1716711406,
      "depth": 0,
      "replies": [
        {
          "id": "l5pxw5r",
          "score": 2,
          "body": "can hydrogen explode... yes, so that means it is technically viable for things that need to explode.  But thats actually one of the problems with it.  It can explode very easily,  which is bad,  you want something that will explode on demand,  that can withstand the worst storage scenarios,  extreme heat,  and extreme cold and that can last a long time.\n\nhydrogen is explosive easy ( guy almost died already testing it ) and it cant be stored easily at all - it leaks through practically everything.\n\nI guess the novel idea here was to create they hydrogen on demand on the battefield... and produce shells?  Because storing hydrogen isnt happening.\n\nThey went into no details about it,  im guessing water into hydrogen... like a giant tank of water and electrolysis... im just guessing because what i described sounds really really stupid but i cant think of any idea.   \n\nThe article sucks and the only thing it effectively says is hes a 19 year old genius given 300 million dollars and he runs his company stupidely and takes dangerous risks almost killing himself - oh and the idea of creating explosives on a mobile device was scrapped ( i wonder why... )  sooo that leaves practically nothing of value because hydrogen isnt replacing gun powder.",
          "permalink": "/r/wallstreetbets/comments/1d0vv0u/investors_gave_a_teenager_85_million_to_build/l5pxw5r/",
          "created": 1716712016,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}