{
  "title": "ConocoPhillips to buy Marathon Oil in $17 billion all-stock deal that bolsters shale assets ",
  "score": 58,
  "selftext": "ConocoPhillips agreed on Wednesday to buy Marathon Oil in an all-stock transaction worth $17 billion, bolstering the company’s shale assets as the broader oil and gas industry undergoes a major wave of consolidation.\n\nThe deal will add 2 billion barrels of resources to ConocoPhillips’ inventory in the U.S., extending the company’s reach across shale fields in Texas, New Mexico and North Dakota.\n\n“This acquisition of Marathon Oil further deepens our portfolio and fits within our financial framework, adding high-quality, low cost of supply inventory adjacent to our leading U.S. unconventional position,” ConocoPhillips CEO Ryan Lance said in a statement.\n\nConocoPhillips’ purchase of Marathon Oil follows blockbuster deals announced last fall by its two bigger rivals, Exxon Mobil and Chevron, as the industry undergoes a transformational wave of consolidation.\n\nThe U.S. oil majors are growing even larger, buying up lucrative oil fields to boost shareholder returns even as governments are trying to accelerate the transition away from fossil fuels to mitigate climate change.\n\nLance said the Marathon Oil transaction would grow ConocoPhillips’ earnings, cash flow and shareholder returns after the deal closes in the fourth quarter. ConocoPhillips expects share buybacks worth $7 billion in the first year after the deal is completed and $20 billion in the first three years.\n\nThe merger is expected to generate $500 million in savings in the first year through reduced administrative and operating costs because the companies’ assets are adjacent to each other.\n\nConocoPhillips’ stock was down 3.3% in early trading following the announcement as Marathon Oil shares surged 7.3%. ConocoPhillips is the third-largest U.S. oil company with a market capitalization of $137 billion, while Marathon Oil has a market cap of $14.4 billion.\n\nConocoPhillips is the last of the top three U.S. oil companies to pull the trigger on a big acquisition. Exxon recently completed its acquisition of Pioneer Natural Resources for $60 billion after receiving the greenlight from the Federal Trade Commission. Hess Corporation shareholders voted on Tuesday to advance the company’s $53 billion merger with Chevron.\n\nSource: https://www.cnbc.com/2024/05/29/conocophillips-to-buy-marathon-oil-in-17point1-billion-all-stock-deal-that-bolsters-shale-assets.html",
  "link_flair_text": "Company News",
  "id": "1d3ccoe",
  "num_comments": 5,
  "created_utc": 1716989698,
  "permalink": "/r/stocks/comments/1d3ccoe/conocophillips_to_buy_marathon_oil_in_17_billion/",
  "comments": [
    {
      "id": "l6825tk",
      "score": 14,
      "body": "Yay, now I won't get it confused with Marathon Petroleum",
      "permalink": "/r/stocks/comments/1d3ccoe/conocophillips_to_buy_marathon_oil_in_17_billion/l6825tk/",
      "created": 1717012970,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l66dsfu",
      "score": 13,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1d3ccoe/conocophillips_to_buy_marathon_oil_in_17_billion/l66dsfu/",
      "created": 1716991969,
      "depth": 0,
      "replies": [
        {
          "id": "l675i5x",
          "score": 6,
          "body": "Yea as a MRO owner this struck me as quite cheap as well. Not really all that excited about it.",
          "permalink": "/r/stocks/comments/1d3ccoe/conocophillips_to_buy_marathon_oil_in_17_billion/l675i5x/",
          "created": 1717001736,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l66gotn",
      "score": 3,
      "body": "Dang.  MRO has performed so well.  I guess this is the opportunity to sell.",
      "permalink": "/r/stocks/comments/1d3ccoe/conocophillips_to_buy_marathon_oil_in_17_billion/l66gotn/",
      "created": 1716993044,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6f12mj",
      "score": 1,
      "body": "Boring.\n\nMore consolidation in a soon to be sunsetting industry.\n\nThis is probably the 4th huge Oil & Gas consolidation in the past year.",
      "permalink": "/r/stocks/comments/1d3ccoe/conocophillips_to_buy_marathon_oil_in_17_billion/l6f12mj/",
      "created": 1717121206,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6bdd5z",
      "score": 0,
      "body": "As a COP shareholder this is great news. Has been a fantastic stock recently",
      "permalink": "/r/stocks/comments/1d3ccoe/conocophillips_to_buy_marathon_oil_in_17_billion/l6bdd5z/",
      "created": 1717072072,
      "depth": 0,
      "replies": []
    }
  ]
}