{
  "title": "Walgreens announces price cuts on 1,300 items amid ongoing consumer spending fatigue ",
  "score": 215,
  "selftext": "Walgreens announced Wednesday it would continue to cut prices on some 1,300 items — the latest company to pivot to value amid signs U.S. consumers are experiencing spending fatigue.\n\nThe pharmacy chain said in a statement announcing a “summer of savings” the lower prices were in response to consumers ongoing struggles with elevated inflation rates that continue to bedevil the U.S. economy.\n\n“Walgreens understands our customers are under financial strain and struggle to purchase everyday essentials,” said Tracey D. Brown, EVP, President, Walgreens Retail & Chief Customer Officer. “We continue to be committed to our customers by lowering prices on over a thousand additional items, something we’ve been doing since October of 2023.”\n\nWalgreens previously pointed to a “challenging” retail environment when it announced its quarterly earnings in March.\n\nAmong the price cuts highlighted by the company:\n\nOne a Day 80ct Men’s and Women’s Gummy Vitamins, now $11.99 (was $13.49)\nAlways Pad Mod Regular (20ct), now $6.99 (was $7.49)\nClean & Clear Foaming Facial Cleanser now $6.99, (was $7.99)\nEucerin Advance Repair Hand Cream now $5.99, (was $7.29)\nPrices may be different based on your location.\n\nWalgreens’ announcement follows others by retail giants that also indicate greater awareness of consumers’ price sensitivities. Last week, Target announced lower costs for thousands of items in its stores, while Walmart recently unveiled an entire new line of food items costing $5 or less.\n\nThe post-pandemic economic recovery is now showing signs of splitting into a ‘K’-shaped one, with more well-off Americans able to sustain consistent levels of spending, even amid inflation rates that continue to hover above 3%. Lower-income consumers have been cutting back more substantially.\n\nIn its monthly consumer confidence report, released yesterday, the Conference Board business group said those making over $100,000 per year expressed the largest rise in confidence and was overall at a higher level than those for lower-income groups.\n\n“The lower-income consumer in the U.S. is stretched ... [and] is strategizing a lot to make their budgets get to the end of the month,” PepsiCo CEO Ramon Laguarta told analysts on the company’s conference call in April.\n\nMeanwhile, other areas of the economy more closely tied to wealthier consumers continue to outperform, especially travel. Even as American Airlines announced Wednesday it was cutting growth plans, analysts said the changes did not reflect a broader pullback.\n\n“American’s diminished [outlook] speaks far more to its flawed initial forecast than any broad-based shift in passenger demand,” JPMorgan airline analyst Jamie Baker said in a note about the airline on Wednesday.\n\nSource: https://www.cnbc.com/2024/05/29/walgreens-announces-price-cuts-on-1300-items-amid-ongoing-consumer-spending-fatigue.html",
  "link_flair_text": "Company News",
  "id": "1d3lgog",
  "num_comments": 64,
  "created_utc": 1717013174,
  "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/",
  "comments": [
    {
      "id": "l685in3",
      "score": 132,
      "body": "I noticed a lot of companies that sell goods have seen revenue declines in Q1. It seems that fiscal policy and the arrow of time are finally working together to drain off all the excess household liquidity.\n\nIf we could see the price of goods retreat that would be a huge win in the battle for inflation. But we have to be careful from here. This is the actual path to recession if we don't adapt to this tipping point because the consumer is the only thing keeping the music playing.",
      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l685in3/",
      "created": 1717014134,
      "depth": 0,
      "replies": [
        {
          "id": "l688tnh",
          "score": 36,
          "body": "> If we could see the price of goods retreat that would be a huge win in the battle for inflation.\n\nGoods deflation has been in effect since last month. Services and input costs (energy the most prominent) are still rising or make up a disproportionate amount of current inflation. This makes goods deflation a bad sign as it's evidence of demand destruction instead of declining input costs. Your logic only works if higher prices are the result of higher demand and input costs are static.",
          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l688tnh/",
          "created": 1717015282,
          "depth": 1,
          "replies": [
            {
              "id": "l68b2xu",
              "score": 30,
              "body": ">evidence of demand destruction\n\nDid anyone have an illusion that this is not what fiscal policy was intending to achieve?\n\nInflation is an imbalance of supply and demand. Demand destruction is exactly what they had hoped to happen. \n\nMaybe now you are realizing the dangerous game being played here. In order to defeat inflation we have to destroy demand enough to bring it back in line with supply but not TOO MUCH so as to induce a recession.",
              "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l68b2xu/",
              "created": 1717016068,
              "depth": 2,
              "replies": [
                {
                  "id": "l68dz9h",
                  "score": 11,
                  "body": "> Inflation is an imbalance of supply and demand.\n\nInflation is when too much liquidity is inserted into the system. \n\nA cheeseburger at McDonalds went from $1 in 2019 to $3.15 in 2024. Medium fries increased from $1.79 to. $4.19 during the same time period. Of course, the numbers I'm citing come from a L.A. franchise so the price jumps are rather absurd (and certainly influenced by elevated overhead costs). But price increases of 30-50% across the country are common.\n\nDid demand for fast food increase 50% in half a decade? I find this hard to believe. But the M2 money supply certainly grew enormously during COVID.\n\n> Demand destruction is exactly what they had hoped to happen.\n\nThis will fail to achieve the desired effect. Since we're in an era of fiscal dominance where deficit spending is out of control, monetary solutions like higher interest rates have limited viability to fix the problem. That assume both fixed money supply and fixed velocity. Even at 5.25-5.50%, Powell is still tapering QT to circulate $35 billion per month back into the system (the new buyback program begins today).\n\nThis also doesn't take into account the way the Cantillon effect creates disproportionate benefits when such increases in money supply occur. Why did asset prices balloon during this period even though economic activity was suppressed? Why did the stock market shoot to the moon, even though country-wide economic activity plunged?\n\n> Maybe now you are realizing the dangerous game being played here. In order to defeat inflation we have to destroy demand enough to bring it back in line with supply but not TOO MUCH so as to induce a recession.\n\nIn theory, yes. I don't see this working because: \n\n1) Excess demand is not the issue. Malinvestment certainly was a problem during the 2022 speculative bubble, but the frequent complaint among the immiserated is that essentials and ordinary costs of living are too high. Excess demand comes with significant surplus cash, leading to a population's plentiful spending on leisure activities and investment in small/medium-sized businesses. Think of the Roaring 20's or 1980's Japan - that's what excess demand looks like on a society-wide basis. \n\n2) The government is still spending hand over fist so GDP continues to \"grow\" at the expense of debt and an ever-shrinking premium.",
                  "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l68dz9h/",
                  "created": 1717017082,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l69zvr0",
                      "score": 6,
                      "body": "> Did demand for fast food increase 50% in half a decade? \n\nIts more accurate to say demand for fast food has been inelastic. Rising prices hasn't done much to reduce demand to eat out.",
                      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l69zvr0/",
                      "created": 1717040681,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6a29tk",
                          "score": -3,
                          "body": "It was a rhetorical question.\n\nFast food restaurants dropping prices now is proof customers have reached that limit. It's better to attempt to preserve their customer bases at a loss than have them purchase nothing at all. The more successful fast casual ones like Chipotle don't have to resort to this.",
                          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6a29tk/",
                          "created": 1717041903,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "l69x08w",
                      "score": -1,
                      "body": ">A cheeseburger at McDonalds went from $1 in 2019 to $3.15 in 2024. Medium fries increased from $1.79 to. $4.19 during the same time period.\n\nIs this that whole lame \"things cost so much when I order them on DoorDash/UberEats,\" that is in no way reflective of actual costs? Those are the prices when I check UberEats.\n\nCuz in person (check the app), it's 2.49 for a cheeseburger, and 2.49 for the fries (1.29 for a large fries using the deal).\n\nWhy are you acting like using a third party delivery app is reflective of actual prices?",
                      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l69x08w/",
                      "created": 1717039277,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6a1z8h",
                          "score": 4,
                          "body": "> Is this that whole lame \"things cost so much when I order them on DoorDash/UberEats,\" that is in no way reflective of actual costs?\n\n...no? I said these are actual prices, albeit excessive due to the franchise location being in an expensive city. People tend to forget McDonalds doesn't set the prices; the franchisee owners do to cover their expenses and amortization. \n\nIf we use country-wide prices [from the horse's mouth](https://www.cnbc.com/2024/05/29/mcdonalds-cost-increases.html#:~:text=Erlinger), the average cost of menu items is up 40% since 2019. Did demand for fast food increase by 40% in 5 years? Because if inflation is solely a product of excess demand, then that has to be the primary reason. Note Erlinger refutes this hypothesis *immediately* afterwards by claiming it was input costs. If we look through the quarterly earnings from this period, I doubt the sales figures would match it either. That would be a major coup plastered all over the news.",
                          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6a1z8h/",
                          "created": 1717041749,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l6aekyj",
                          "score": 2,
                          "body": "Do you live in LA? These prices are pretty close to what we pay as well.",
                          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6aekyj/",
                          "created": 1717049308,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l6bj0ew",
                              "score": 1,
                              "body": "No, but I randomly selected 3 places in LA, and UberEats showed the prices listed, while ordering for pick up in the app showed drastically reduced prices.",
                              "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6bj0ew/",
                              "created": 1717074560,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l69yyqh",
                      "score": -5,
                      "body": "lol those are not the prices for fries or burger.  LOL.  Medium fries at my McDs in one of the 4th largest metros in the US is $1.49",
                      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l69yyqh/",
                      "created": 1717040222,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6a2p3e",
                          "score": 3,
                          "body": "That's a great anecdote and all, but prices are up 40% nationwide.",
                          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6a2p3e/",
                          "created": 1717042126,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l68bm43",
                  "score": 2,
                  "body": "I mean, that’s the solution yeah. The only other way would be a government mandated market that forces companies to produce more supply.",
                  "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l68bm43/",
                  "created": 1717016251,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l6emjl8",
              "score": 2,
              "body": "Demand destruction is what the federal reserve has been wishing and praying for for the past 2 years straight.",
              "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6emjl8/",
              "created": 1717115434,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l6ad1mm",
              "score": 2,
              "body": "Fed has been fighting the market tooth & nail to achieve demand destruction, it’s good in their book.",
              "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6ad1mm/",
              "created": 1717048278,
              "depth": 2,
              "replies": [
                {
                  "id": "l6ahvwh",
                  "score": -2,
                  "body": "The fed is a corporate influenced hyperconsumerist institution. Infinite growth for higher profit margins is all that matters to CEOs who are totally not influencing any politicians or lobbying with billions of dollars to reduce regulation",
                  "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6ahvwh/",
                  "created": 1717051590,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6ahz2q",
                      "score": 3,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6ahz2q/",
                      "created": 1717051653,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6ajaba",
                          "score": 4,
                          "body": "It's a fact that billions of dollars are spent by corporate interests in lobbying. It is fact that regulations have been weakened decade by decade and only recently the most basic and mediocre of enforcing regulations on the books have begun against companies. Is this all coincidence? Is the ballooning CEO bonuses, the enriching of politicians and politicians turned private sector higher ups, the skyrocketing earnings that outpace inflation which pro-corporates are so quick to blame on increased wages, unions, strikes, and federal regulation all coincidence?\n\nThe anti-corporate sentiments of the disenfranchised has been played against one another where in the USA the socialists refuse to \"debase\" themselves with engaging in the capitalist systems' exploitative institutions and lose capital and political power while the fundamentalists blame \"wokeness\" and minorities being over-represented as the reason for corporations being evil and greedy. It's all a bunch of nonsense that doesn't get to the core of the issue, social mobility is dropping and wealth inequality is rising. Whereas the 1% would once take home 35-40% of the pie, it's passed over 50%. The middle class, inflation adjusted, is poorer and smaller than 50 years ago.",
                          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6ajaba/",
                          "created": 1717052584,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l68xoy9",
          "score": 5,
          "body": "well in my state it is tax assessor time where we learn our new property rates payable later this year... and up again this time nearly fifteen percent. people are seeing their income diluted from many angles but housing prices are in turn driving up assessments and some are being priced out of their homes.",
          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l68xoy9/",
          "created": 1717024473,
          "depth": 1,
          "replies": [
            {
              "id": "l6b32xd",
              "score": 3,
              "body": "My monthly HOA has increased from $430 in 2019 to $1140 in 2024. Thankfully I can afford it by budgeting elsewhere, but it’s definitely painful to see your raises completely eaten up by the same list of expenses that you already had.\n\nAlthough if this trend continues at the same pace along with property tax increases, I probably can’t afford it by 2030 unless I get some significant raises.",
              "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6b32xd/",
              "created": 1717066728,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l6a28lc",
              "score": 2,
              "body": "That sucks. Is there really no financial device that can ameliorate this kind of thing? What are you paying, 1% on property tax? In the last year, you gained 15% more home value, and lost .15% yearly of that home value in property tax? Gonna take what, 100 years for one to eat the other?\n\nIs there no bank or state/locality that will buy a share in your home to be redeemed at sale, and pay the property tax, or pay you enough to pay it? I know there are programs in my county where the county will do that at purchase by contributing to your down payment. Nobody doing it after purchase? Seems like a really solvable problem...\n\nCalifornia took a crack at it with prop 13 and to be frank it sucks. You could take out an equity loan, but... then you're paying off a loan...",
              "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6a28lc/",
              "created": 1717041885,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l68bely",
          "score": 3,
          "body": "A few weeks ago I remember reading that pandemic era savings had finally ran out.",
          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l68bely/",
          "created": 1717016178,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l69po32",
          "score": 4,
          "body": "Sounds like they have been price gouging and it hasn’t gone well.",
          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l69po32/",
          "created": 1717035989,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l68mzmy",
          "score": 2,
          "body": "Abercrombie, Dicks and Chewy all beat just today and Deckers or ELF just a couple days ago. It’s really differs from company.",
          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l68mzmy/",
          "created": 1717020349,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l68r2ut",
          "score": 2,
          "body": "The scenario you described sounds like the economy is one big \"musical chairs\" game of spending.\n\nOnce the spending stops, the music stops and you don't want to be left without a seat!",
          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l68r2ut/",
          "created": 1717021895,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l68wdyq",
      "score": 18,
      "body": "Walgreens I feel like it needs to find a new roll in retail, they have a solid pharmacy business, solid health wellness section, but at least a third of the store feels like walmart cast offs but at not great prices.  They need a reason to drive foot traffic,  maybe lower prices will help.  I can't wait until Boots gets sold.  Take that money and pay down debt, then earnings could start to grow again.",
      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l68wdyq/",
      "created": 1717023955,
      "depth": 0,
      "replies": [
        {
          "id": "l69yvuh",
          "score": 14,
          "body": "Ya I never understood when a store was like.... Well we sell cigarettes and $9 Doritos.",
          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l69yvuh/",
          "created": 1717040183,
          "depth": 1,
          "replies": [
            {
              "id": "l6bviys",
              "score": 2,
              "body": "Nowadays everyone else is selling the Doritos for 9 dollars too",
              "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6bviys/",
              "created": 1717079440,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l694xci",
      "score": 20,
      "body": "True price cuts or just a rollback of recent increases?",
      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l694xci/",
      "created": 1717027392,
      "depth": 0,
      "replies": [
        {
          "id": "l6b4wbr",
          "score": 13,
          "body": "50% increase followed by 10% decrease “sale”",
          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6b4wbr/",
          "created": 1717067776,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l69xztf",
      "score": 14,
      "body": "lol as if $.50-1 discounts will get me to buy the already overpriced (even before covid) stuff at Walgreens. They prey on people being desperate for something while there to jack up their prices",
      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l69xztf/",
      "created": 1717039752,
      "depth": 0,
      "replies": [
        {
          "id": "l6ak1jo",
          "score": 1,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6ak1jo/",
          "created": 1717053124,
          "depth": 1,
          "replies": [
            {
              "id": "l6bew6o",
              "score": 3,
              "body": "I know, but even *for* a convenience store, it’s too expensive. That’s what i was trying to say.",
              "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6bew6o/",
              "created": 1717072783,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l6ah59p",
      "score": 8,
      "body": "i like how all companies announce price cuts but never announce price raises",
      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6ah59p/",
      "created": 1717051074,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6b68pm",
      "score": 5,
      "body": "Lol, about time! I run a small trucking company, for the past 18 months it's been a bloodbath for us. Big companies like Convoy have bankrupted. Others like US Xpress got bought out for pennies - less than the value of their equipment. Midsized carriers between 100 and 500 trucks have been going down every week, smaller ones between 1 and 10 trucks - daily. Freight brokerages have been slashing their staff by the thousands. Freight rates have collapsed, everybody in the sector has been bleeding cash. \n\n\nThe US consumers have been buying LESS stuff for more money for too long. That's bad for my industry, we need volume and stuff to haul. We've been in a recession that's about to hit the rest of you very soon. ",
      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6b68pm/",
      "created": 1717068514,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6b9nyl",
      "score": 6,
      "body": "Good, don’t buy from these greedy corporations",
      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6b9nyl/",
      "created": 1717070284,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6ayi4n",
      "score": 4,
      "body": "Walgreens could drop prices and it would still probably be cheaper to buy the same things and have them delivered by Doordash, Shipt (Target) etc including tip and fees.",
      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6ayi4n/",
      "created": 1717063837,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l698lr6",
      "score": 9,
      "body": "I think we are probably in the goldilocks zone where stock prices haven't dumped from terrible news yet, but its not incredibly far off potentially. If Fed was halfway smart they would do a surprise rate cut in June of 25 bps and get ahead of this. Im not saying they should cut every meeting or anything, but that first rate cut will be psychologically beneficial to the economy more than materially decisive in the fight against inflation.  \n\nInstead we will likely see them react in the Fall after the wrecking ball is in full swing. Between price cuts at the consumer focused stores and the weak bond auctions we appear to be at a tipping point. This could just be a wobble, but it could also be much worse. The bond issue is the bigger problem. When bond auctions start failing hard it will already be too late.",
      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l698lr6/",
      "created": 1717028901,
      "depth": 0,
      "replies": [
        {
          "id": "l69yzof",
          "score": 0,
          "body": "Lol.   Predicting the next crash makes me throw money in the market.  \nThe cool thing is employment is up and wages are up every Friday auto 401k payments",
          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l69yzof/",
          "created": 1717040236,
          "depth": 1,
          "replies": [
            {
              "id": "l6a31ie",
              "score": 3,
              "body": "Im not predicting a market crash at all. Im saying there is enough warning signs to proceed with caution. It might just be a wobble that lasts for a few weeks. It might be something more serious. I doubt I will miss too much in the gains by chilling out for a few weeks to let this play out. I already did well enough this year that I could be flat for the remainder of the year and it would still be a good year for me. Already up 28% YTD. \n\nIf things get on a more solid footing I will get back into the riskier end of the market. Otherwise I will sit over in the dividend etfs and some boring stuff.",
              "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6a31ie/",
              "created": 1717042309,
              "depth": 2,
              "replies": [
                {
                  "id": "l6b2wut",
                  "score": 1,
                  "body": "Wobble?  When the dow hit me 40000?",
                  "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6b2wut/",
                  "created": 1717066626,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6c05a4",
                      "score": 1,
                      "body": "Dow is a tad over 38,000 right now and yes wobble.",
                      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6c05a4/",
                      "created": 1717081128,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6ca45g",
                          "score": 1,
                          "body": "Oh no!    \n\n\nIn all honesty I hope the Dow hits 26,000 again.    I always have cash ready.    But it may never dip that low again we'll see.",
                          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6ca45g/",
                          "created": 1717084607,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l6ctzh4",
                              "score": 1,
                              "body": "I doubt it will go that far.",
                              "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6ctzh4/",
                              "created": 1717092148,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l6blwy5",
      "score": 3,
      "body": "Walgreens is on its dying breath apparently. They cant fill prescriptions as well as cvs and they fumbled the covid bag to them as well. If you visit a walgreens store actually, you can see the dated state of things and disrepair yourself. \n\nGood riddance honestly they have sucked a lot last 10 years",
      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6blwy5/",
      "created": 1717075759,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l68fb2n",
      "score": 1,
      "body": "And I still would not buy their stock. Try and catch that falling knife",
      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l68fb2n/",
      "created": 1717017560,
      "depth": 0,
      "replies": [
        {
          "id": "l68qs5j",
          "score": 4,
          "body": "The corporate culture over there is clicky and cultish. It’s super cringe 😬",
          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l68qs5j/",
          "created": 1717021780,
          "depth": 1,
          "replies": [
            {
              "id": "l68sp6r",
              "score": 5,
              "body": "Also the store are run terrible. I know a few that work the stores. They are overworked, underpaid, and they don’t have enough staff and they have to close the pharmacy sometimes for a full day because I can’t get anybody to work. If they don’t want to go the way of Rite Aid which they bought quite a few of,they need to close doors and start consolidating staff and treating them a hell of a lot better. can you imagine a company that they expect their staff to ship out products for online orders five states away if not further. wouldn’t you have your distribution warehouses taking the online orders and shipping them and not individual stores?",
              "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l68sp6r/",
              "created": 1717022522,
              "depth": 2,
              "replies": [
                {
                  "id": "l6b4bxz",
                  "score": 1,
                  "body": "The urban ones by me were run poorly in terms of staffing and stocking, but they also just let the store be a free-for-all for shoplifters and the homelessness. Literally saw a dude load up a suitcase in the aisles while the employees ignored them.\n\nThey ended up closing one of the stores where this was the most profound and comically out of hand. Exemplifies horrible management, bad policy, and a lack of corporate controls. All point to low confidence they can make an effective turnaround.",
                  "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6b4bxz/",
                  "created": 1717067456,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l6861vf",
      "score": 5,
      "body": "Wow we are officially going to start seeing deflation soon. Feels like we are trending towards\na recession",
      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6861vf/",
      "created": 1717014318,
      "depth": 0,
      "replies": [
        {
          "id": "l688vgh",
          "score": 18,
          "body": "My dad owns a trucking company. Get ready for economic pain he keeps tells me.",
          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l688vgh/",
          "created": 1717015300,
          "depth": 1,
          "replies": [
            {
              "id": "l68hxeg",
              "score": 39,
              "body": "Then again, trucking people were saying this since 2 years ago.",
              "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l68hxeg/",
              "created": 1717018504,
              "depth": 2,
              "replies": [
                {
                  "id": "l68mv59",
                  "score": 17,
                  "body": "yep. in business and with business owners in particular things are never ''good'', in business the sky is always falling, the ship is always in danger of sinking and so and so forth. i just roll my eyes",
                  "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l68mv59/",
                  "created": 1717020303,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6jy5cb",
                      "score": 1,
                      "body": "As a business owner you feel like you are always in free fall after jumping out of a plane… constantly building the parachute hoping you don’t hit the ground. \n\nIt’s an odd feeling.",
                      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6jy5cb/",
                      "created": 1717200129,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l691q1m",
                  "score": 3,
                  "body": "The oversupply of truckers when the pandemic shortage happened was insane.",
                  "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l691q1m/",
                  "created": 1717026096,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l6b4urv",
              "score": 2,
              "body": "Freight has been in a recession since early 2022. One of my favorite indicators for that sector is the total number of carrier/brokerage authorities active compared against the load to asset ratio. Freight as a relatively commoditized industry sees cycles due to both demand and supply. \n\nI think this recession is more due to oversupply than demand, which is encouraging for the rest of the economy. We already are seeing some relief in that sector as many carriers/brokers are leaving the market - reducing the oversupply of capacity. Convoy being the most notable closure, but many companies with 50-100 trucks have been dropping like flies since middle of last year while demand has been relatively constant.\n\nIt sucks that what is good for freight sector (higher rates) is usually bad for consumers (higher landed costs for goods).",
              "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6b4urv/",
              "created": 1717067752,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l6aerfd",
              "score": 1,
              "body": "Does he have a date? Asking for a friend.",
              "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6aerfd/",
              "created": 1717049430,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l688mcp",
          "score": -3,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l688mcp/",
          "created": 1717015212,
          "depth": 1,
          "replies": [
            {
              "id": "l68atkl",
              "score": 13,
              "body": "They wouldn't be cutting prices if it was stagflation. That would imply prices are staying high",
              "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l68atkl/",
              "created": 1717015978,
              "depth": 2,
              "replies": [
                {
                  "id": "l68eb4k",
                  "score": -10,
                  "body": "Stagflation is when the things you need stay high (food, gas, insurance, housing, electricity) and things you don't need like hand cream, vitamins and facial scrub (mentioned above) go down. This is exactly what stagflation is.",
                  "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l68eb4k/",
                  "created": 1717017199,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l68j3c2",
                      "score": 9,
                      "body": "Stagflation is when inflation goes up, but the economy stays stagnant.",
                      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l68j3c2/",
                      "created": 1717018930,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l68ljdn",
                          "score": 7,
                          "body": "Stagflation is when you have a giant plastic deer and fill it with air.",
                          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l68ljdn/",
                          "created": 1717019812,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l6a62xm",
      "score": 2,
      "body": "Why do we need Walgreens and cvs, if Safeway and other grocery stores already have proper pharmacies?",
      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6a62xm/",
      "created": 1717043988,
      "depth": 0,
      "replies": [
        {
          "id": "l6jybf2",
          "score": 1,
          "body": "CVS isn’t just a pharmacy. They’re Aetna as well, a massive insurer, they also manufacture generic drugs and offer various other services.",
          "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6jybf2/",
          "created": 1717200201,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6em9oh",
      "score": 1,
      "body": "Love how it's all over the headlines when these damn corporations finally lower the prices.  They should run headlines like this every time they raise them too!  So that people really understand what is going on.",
      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l6em9oh/",
      "created": 1717115323,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l69peq0",
      "score": -1,
      "body": "I like to hike.",
      "permalink": "/r/stocks/comments/1d3lgog/walgreens_announces_price_cuts_on_1300_items_amid/l69peq0/",
      "created": 1717035876,
      "depth": 0,
      "replies": []
    }
  ]
}