{
  "title": "American shares tumble 15% after sales strategy backfires; carrier cuts growth ",
  "score": 74,
  "selftext": "American Airlines will slash its capacity growth in the second half of the year and consider a host of other changes to a sales strategy that backfired, CEO Robert Isom said Wednesday. The comments come a day after the carrier cut its revenue and profit forecast and said it is parting ways with its chief commercial officer, Vasu Raja.\n\nAmerican will grow capacity about 3.5% in the second half of the year compared with the year earlier, down from roughly 8% year-over-year growth in the first six months of 2024.\n\nThe company’s shares tumbled 15% on Wednesday while investors weighed the airline’s missteps as the peak travel season gets underway, with some analysts questioning how American can capitalize on what rivals expect to be a record summer.\n\nIsom said American is weighing changes to a plan Raja led to drive direct bookings at the airline in lieu of third-party sites and travel agencies, a strategy that included gutting the airline’s sales department.\n\nThe changes angered travel agencies who weren’t able to access some of the carrier’s fares as before, making it harder for them to sell tickets on American flights.\n\nThe chief commercial officer will leave the company next month.\n\n“We’ve used a lot of sticks. We’ve got to put some more carrots in place and make sure that our product is available wherever customers want to buy it,” Isom said at the Bernstein Strategic Decisions conference on Wednesday.\n\nAmerican in February said it would limit some travel agency bookings from being eligible to earn AAdvantage frequent flyer miles. Isom said Wednesday that the airline would reverse that decision.\n\n“That’s off,” Isom said. “We’re not doing that because it would create confusion and disruption for our end customer.”\n\nCorporate bookings\n\nRaja said last month American’s corporate booking growth was coming in behind big rivals Delta and United.\n\nCorporate bookings are particularly lucrative for airlines especially when those travelers book at the last minute when fares are at their highest — so called close-in bookings. Airlines had struggled during the pandemic and shortly afterward when business travel was slow to return, but carriers have seen improvement lately.\n\n“The weakness that you’ve seen in American is, I do believe, something that speaks to close-in bookings, the highest premium customers that, unfortunately, we haven’t made ourselves as available and easy to work with as we can,” Isom said.\n\nOn an earnings call last month, Raja said American’s corporate bookings were up mid-to-high single-digit percentage points in the first quarter compared with increases of around 14% touted by Delta and United.\n\n“A significant miss driven in part by close in bookings puts AAL’s ability to reap the full value of a robust summer flying season in greater doubt,” Bernstein airline analyst David Vernon said in a note.\n\nRevenue shortfalls\n\nAfter the market closed Tuesday, American said its unit revenues could fall as much as 6% in the second quarter from a year earlier, down from its forecast last month of a no-more-than-3% decline. Airlines make the bulk of their money during the second and third quarters, but some areas have fared better than others.\n\nIsom admitted Wednesday that the company has logged softer bookings than it expected and noted a supply and demand “imbalance” that has prompted carriers to discount tickets. He said industry capacity should come down in the second half of the year, while it slows its own growth.\n\nUnited, minutes after American’s forecast adjustment Tuesday, reiterated its second-quarter earnings estimates, though it didn’t provide a revenue outlook.\n\n“American’s diminished guide speaks far more to its flawed initial forecast than any broad-based shift in passenger demand,” JPMorgan airline analyst Jamie Baker said in a note Wednesday, adding United’s reiterated forecast was an encouraging sign for Delta.\n\nAmerican has also been prioritizing Sun Belt cities and its large hubs in Texas and North Carolina over coastal markets.\n\nThe Transportation Security Administration screened the most people ever over Memorial Day weekend, and executives from United and Delta have predicted a record summer, with very strong trans-Atlantic bookings.\n\nSource: https://www.cnbc.com/2024/05/29/american-airlines-growth-sales-strategy.html",
  "link_flair_text": "Company News",
  "id": "1d3lfav",
  "num_comments": 18,
  "created_utc": 1717013075,
  "permalink": "/r/stocks/comments/1d3lfav/american_shares_tumble_15_after_sales_strategy/",
  "comments": [
    {
      "id": "l6975r6",
      "score": 67,
      "body": "What a brain dead stupid strategy.. gut the sales department and make it harder for 3rd parties to sell the air tickets.\n\nI’m amazed at the stupidity of the C-suite",
      "permalink": "/r/stocks/comments/1d3lfav/american_shares_tumble_15_after_sales_strategy/l6975r6/",
      "created": 1717028309,
      "depth": 0,
      "replies": [
        {
          "id": "l69ao41",
          "score": 32,
          "body": "Stuff like this gives me hope that one day I too can be a complete idiot of an executive.",
          "permalink": "/r/stocks/comments/1d3lfav/american_shares_tumble_15_after_sales_strategy/l69ao41/",
          "created": 1717029754,
          "depth": 1,
          "replies": [
            {
              "id": "l6az8y6",
              "score": 5,
              "body": "You don’t have the right amount of idiot connections to make that happen.",
              "permalink": "/r/stocks/comments/1d3lfav/american_shares_tumble_15_after_sales_strategy/l6az8y6/",
              "created": 1717064336,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l69vurt",
          "score": 7,
          "body": "It seems to be a running theme for most companies to have a C-Suite that is intellectually defunct when it comes to how to properly operate a business. Just take a look at any retail company. Adapt to a new market or methodology? Hell no! Become a more expensive version of Dollar General with even less quality and cut all employee hours! Surely, that will boost revenue!",
          "permalink": "/r/stocks/comments/1d3lfav/american_shares_tumble_15_after_sales_strategy/l69vurt/",
          "created": 1717038744,
          "depth": 1,
          "replies": [
            {
              "id": "l6uw3ra",
              "score": 1,
              "body": "Always has been. A lot of people in every job are incompetent, with execs as the most visible.\n\nThat is capitalism is so useful. Over time, it devalues incompetently run businesses.",
              "permalink": "/r/stocks/comments/1d3lfav/american_shares_tumble_15_after_sales_strategy/l6uw3ra/",
              "created": 1717382917,
              "depth": 2,
              "replies": [
                {
                  "id": "l6uxxaj",
                  "score": 1,
                  "body": "Not really. Oftentimes, incompetent executives wind up insulated enough by the company's results that the shit results of their own decisions are paid less attention because a lot of shareholders are too stupid to comprehend the difference.",
                  "permalink": "/r/stocks/comments/1d3lfav/american_shares_tumble_15_after_sales_strategy/l6uxxaj/",
                  "created": 1717383755,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l69ek40",
      "score": 19,
      "body": "Gutting the sales department was insane. Instead of making it easier to do business with, they went the opposite way. nothing could have predicted this lol",
      "permalink": "/r/stocks/comments/1d3lfav/american_shares_tumble_15_after_sales_strategy/l69ek40/",
      "created": 1717031346,
      "depth": 0,
      "replies": [
        {
          "id": "l69vb96",
          "score": 3,
          "body": "I’m sure it gave the C suite a nice bonus.  Also sure Raja will have a most golden of parachutes to deploy.",
          "permalink": "/r/stocks/comments/1d3lfav/american_shares_tumble_15_after_sales_strategy/l69vb96/",
          "created": 1717038491,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l69avag",
      "score": 27,
      "body": "> a strategy that included gutting the airline’s sales department.\n\nThat's some Elon Musk level dumbassery right there.",
      "permalink": "/r/stocks/comments/1d3lfav/american_shares_tumble_15_after_sales_strategy/l69avag/",
      "created": 1717029836,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l68lr3z",
      "score": 4,
      "body": "Hmm. If it falls to ~11 I’m buying",
      "permalink": "/r/stocks/comments/1d3lfav/american_shares_tumble_15_after_sales_strategy/l68lr3z/",
      "created": 1717019891,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6anngk",
      "score": 2,
      "body": "It’s almost impressive how quickly they nose dived. They also completely killed their loyalty program, can’t expect people to be pushed towards your shopping portals and booking platforms for status and then make that status useless",
      "permalink": "/r/stocks/comments/1d3lfav/american_shares_tumble_15_after_sales_strategy/l6anngk/",
      "created": 1717055821,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l69vm6t",
      "score": 1,
      "body": "AA has decided to focus on the domestic market instead of international travel. If the worldwide economy tanked and overseas flights struggled it could have worked by having a strong domestic network. But as usual the AA think tank at skyview has made a blundering mistake.",
      "permalink": "/r/stocks/comments/1d3lfav/american_shares_tumble_15_after_sales_strategy/l69vm6t/",
      "created": 1717038633,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6bpfy4",
      "score": 1,
      "body": "Utterly predictable. They actively antagonized business travelers because they thought the post-Covid vacationer bump would last forever",
      "permalink": "/r/stocks/comments/1d3lfav/american_shares_tumble_15_after_sales_strategy/l6bpfy4/",
      "created": 1717077156,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l69civt",
      "score": 0,
      "body": "He done goofed, why leave the company until next month?",
      "permalink": "/r/stocks/comments/1d3lfav/american_shares_tumble_15_after_sales_strategy/l69civt/",
      "created": 1717030509,
      "depth": 0,
      "replies": [
        {
          "id": "l69egg7",
          "score": 7,
          "body": "next month is in 2 days",
          "permalink": "/r/stocks/comments/1d3lfav/american_shares_tumble_15_after_sales_strategy/l69egg7/",
          "created": 1717031304,
          "depth": 1,
          "replies": [
            {
              "id": "l69f3uz",
              "score": 0,
              "body": "It's still too long for this guy, should have been stopped right at the door.",
              "permalink": "/r/stocks/comments/1d3lfav/american_shares_tumble_15_after_sales_strategy/l69f3uz/",
              "created": 1717031577,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}