{
  "title": "Nelson Peltz sells entire Disney stake weeks after losing proxy battle  ",
  "score": 308,
  "selftext": "Activist investor Nelson Peltz has sold his entire stake in Disney, according to a person familiar with the matter.\n\nIn early April, Trian’s Peltz lost a proxy battle at Disney as shareholders reelected the company’s full slate of board nominees. Peltz had been seeking to elect himself and former Disney Chief Financial Officer Jay Rasulo to the company’s board.\n\nPeltz had long taken issue with Disney governance, taking particular aim at the company’s streaming strategy and a failed succession plan for CEO Bob Iger.\n\nSource: https://www.cnbc.com/2024/05/29/nelson-peltz-sells-disney-stake.html",
  "link_flair_text": "Company News",
  "id": "1d3nkd3",
  "num_comments": 58,
  "created_utc": 1717019119,
  "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/",
  "comments": [
    {
      "id": "l68tyzv",
      "score": 175,
      "body": "Made a billion plus regardless of the outcome.",
      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l68tyzv/",
      "created": 1717023011,
      "depth": 0,
      "replies": [
        {
          "id": "l690m6k",
          "score": 62,
          "body": "He won",
          "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l690m6k/",
          "created": 1717025646,
          "depth": 1,
          "replies": [
            {
              "id": "l69280r",
              "score": 57,
              "body": "I bet he doesnt feel like he \"won\", regardless of the profit he made. Also doesnt look like he won to the public, if hes taking his ball and going home because he couldnt be team captain. Glass half full/empty moment I guess.",
              "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l69280r/",
              "created": 1717026297,
              "depth": 2,
              "replies": [
                {
                  "id": "l698okg",
                  "score": 57,
                  "body": "$1B is a hell of a 2nd place prize. \n\nI’m still a long term believer in $DIS so the dip is fine but Peltz made a great short term bet, and I’m sure we haven’t seen the last of him",
                  "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l698okg/",
                  "created": 1717028934,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6bopuu",
                      "score": 11,
                      "body": "why are you a believer in $DIS? just curious because they seem to be floundering year after year. they're running IPs people used to care about into the ground. they're messaging is tone deaf and not reaching people",
                      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6bopuu/",
                      "created": 1717076876,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6dtot1",
                          "score": 3,
                          "body": "Parks are a cash cow. IP is deep and is fine… just watch Xmen 97! Disney + is getting to profitability. Iger fixing the place and handing it over to a successor. Streaming bundles will replace legacy cable, and reduce churn. \n\nIn 50 years, we’ll probably all be dead but the house of the mouse will still be telling good stories and entertaining people. It’ll be fine and that’s why I’m a long term investor.",
                          "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6dtot1/",
                          "created": 1717104564,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l6dx8a7",
                              "score": 2,
                              "body": "long term i can see but its hard to look past the wave of dogshit copy paste \"entertainment\" they've been putting out",
                              "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6dx8a7/",
                              "created": 1717105797,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l69cpwv",
                      "score": 19,
                      "body": "I agree. In no alternate universe would I be unhappy with 1B profit and getting rid of a troublesome boardroom seat if I were in the same situation.\n\n\n Its not like he doesnt have 50 other companies he can exploit with ethically questionable behavior as a consolation prize.  Back to slumming it in his other board seats and profitting off russian warcrimes I guess. He does seem the vindictive type to have another go later if the opportunity arises.",
                      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l69cpwv/",
                      "created": 1717030590,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l6959li",
                  "score": -7,
                  "body": "I’m sure he’s crying over his “loss” on a bed made of crates of 100 dollar bills.",
                  "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6959li/",
                  "created": 1717027533,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l698qko",
                      "score": 8,
                      "body": "I dont understand the super rich, but the common factor among most is that no matter how much they have, its never enough. Im sure hes fuming over his loss and the embarassment it caused him.  \n\n\nDespite coming out of it richer, he's lost respect and power, if he ever had any to begin with, and he knows it.",
                      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l698qko/",
                      "created": 1717028957,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l69dxzw",
                          "score": 3,
                          "body": "In a way I agree, in another way he is taking his money to infest some other companies to pay him out for short term gains. These douchebags just don't go away as long as they keep taking advantage of someone else.",
                          "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l69dxzw/",
                          "created": 1717031091,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l6feq59",
              "score": 1,
              "body": "He’s already a billionaire. He doesn’t care about the amount of money because he’s rich. He cares about the moral victory ",
              "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6feq59/",
              "created": 1717127108,
              "depth": 2,
              "replies": [
                {
                  "id": "l6g9jw2",
                  "score": 1,
                  "body": "It also looks like disney is on a decline, so it makes sense to sell if the value is probably only going down over the next years and going forward",
                  "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6g9jw2/",
                  "created": 1717146679,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l69dmo5",
          "score": -12,
          "body": "Probably a good sign when a short term douchebag piece of shit exits. He decided this is a good long term stock that he cant extract short term money from anymore.",
          "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l69dmo5/",
          "created": 1717030960,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l68legc",
      "score": 102,
      "body": "Well, yea, that checks out.",
      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l68legc/",
      "created": 1717019761,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l68lg0k",
      "score": 48,
      "body": "I think Trian netted $1 Billion, their average was $85.",
      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l68lg0k/",
      "created": 1717019777,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l68niw9",
      "score": 37,
      "body": "This sub loved trashing the man and saying anyone who disagreed with alternative views at Disney as it hit $120 was an idiot. \n\nMy how the turns table. Never change Reddit",
      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l68niw9/",
      "created": 1717020549,
      "depth": 0,
      "replies": [
        {
          "id": "l6b4q7o",
          "score": 13,
          "body": "Iger is the mistake Disney has made again.  He will once again straddle Disney with debt and in a state where the next ceo is destined to fail.  Operationally, he is cutting costs for short-term gains that can not continue and the next ceo will get blamed as Iger will pick the right time to leave before his decisions catch up to the bottom line.\n\nReminds me of the founder of starbucks going and coming and going and now not even a quarter as passed since he left and they want to bring him back.  So they'll repeat the same play again.  Ceo comes in and cuts costs operationally.  Leaveing the company in shambles where new ceo is left holding the bag and get blamed for debt incurred by previous ceo and lack of investment by previous ceo that co tributed to shortfalls in revenue and margins",
          "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6b4q7o/",
          "created": 1717067682,
          "depth": 1,
          "replies": [
            {
              "id": "l6du0df",
              "score": 3,
              "body": "There is no Disney Plus without Iger and all of his key acquisition. Debt is brutal and he overpaid for Fox assets but can’t blame him in hindsight. DIS will be fine",
              "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6du0df/",
              "created": 1717104676,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l6bznrh",
              "score": 5,
              "body": "Yep and its brutally obvious with Iger and his board cronies are colluding. Chapek was actually doing a very good job correcting the ship but the board clearly had plans to bring Iger back after covid and the fox merger settled into the books. Iger would have been fired if he was around for either of those things but ran away before it could happen.",
              "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6bznrh/",
              "created": 1717080955,
              "depth": 2,
              "replies": [
                {
                  "id": "l6fewvl",
                  "score": 0,
                  "body": "Chapek did a horrible job. He’s to blame",
                  "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6fewvl/",
                  "created": 1717127199,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6fp210",
                      "score": 5,
                      "body": "I see you bought the Iger propaganda... Chapek is an engineer and worked in Disney operations before CEO. He was righting the ship that Iger nearly sunk with his fox deal before bolting when COVID started to hurt.\n\nFirst, he needed to reduce the number of season pass holders clogging the parks. He tried to do that by raising the prices but no matter how much he raised it, they kept buying them. So he started limiting days. This was the correct path because what is still happening is that visitor are not enjoying their trips due to lines and crowds. Customer satisfaction was taking a hit and those customers spent about as much in a few days as season pass holders spend in a year. Season pass holders have turned Disney into their personal hangouts. I should know, my wife is one of them. She complains all day about prices and blackout days but just keeps buying the season pass and going there as often as possible.... why? Its literally still cheaper than most other family options. This is why I continue to allow it.\n\nSecond, he needed to do something with all the crap Iger bought for $50b... it was a disaster due to how fast the TV segment of the deal was shrinking and how the costs of maintain said legacy trash was spiraling out of control. That deal was so bad it overshadowed any gains Disney made elsewhere and is still destroying bottom line today. He chose to push forward with D+ which was the right thing to do because its evident that the tv segment was going to keep shrinking. It was either that, or write off most of that $50b as a loss.\n\nLast, he had to deal with COVID. In fact he was plopped right into the heat of it. Park and hotel/ship closures ensued and we all know how things went. Iger literally stepped out to avoid this.\n\nNote that even after Chapek left, Iger has literally not reversed any of his decisions and has even pushed Chapek's policies further in terms of pricing and the tickets are still selling out near instantly. He also did nothing with D+ after taking over aside from cutting budget which was obviously going to happen given the big integration with or without him. So basically Iger threw Chapek under the bus only to return and push Chapek's policies. Dude is a total hack job.",
                      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6fp210/",
                      "created": 1717132635,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l68oej5",
          "score": 34,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l68oej5/",
          "created": 1717020877,
          "depth": 1,
          "replies": [
            {
              "id": "l68q15d",
              "score": 37,
              "body": "Ever think that it could be the wave of really good news and positive signs, only broken by 1 bad quarter? Yall think way too short term. Disney will be fine",
              "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l68q15d/",
              "created": 1717021495,
              "depth": 2,
              "replies": [
                {
                  "id": "l68rhgx",
                  "score": -16,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l68rhgx/",
                  "created": 1717022054,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l68ssaa",
                      "score": 12,
                      "body": "Past performance is by far one of the worst indicators of future performance. If you had bough MSFT or AMZN in 2000-2001, it would've taken over a decade to recover that investment. Disney+ has continued to increase core and global subscribers, even with price hikes. The company should begin to get margins in the streaming division up, and revenue will grow more once we see them regularly releasing movies again. \n\nYou clearly haven't done in depth research into the company to understand just how good of a position the company is in forward facing. The parks division is set to grow by a steady 10% a year over the coming decades, with extremely strong margins. The DTC arm pulled in over 20B in revenue over the TTM period, and Disney is now at a point where they can slowly increase prices with time. People love to trash on the company, but as soon as their earnings start to show strength again, all of a sudden people will be talking about their large moat, strong corporate identity, and history of overcoming shortfalls. \n\nHell, just by a DCF valuation that has revenue growing by an average of 8% over the next decade with operating margins growing from their current 10% up to historical averages(18-20% for movies and cable, 25-27% for streamers, 30-35% for parks) you'd get a DCF valuation of 150-200$.",
                      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l68ssaa/",
                      "created": 1717022556,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l68v40f",
                          "score": 2,
                          "body": "[deleted]",
                          "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l68v40f/",
                          "created": 1717023452,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l68vxsn",
                              "score": 8,
                              "body": "I feel the same way. Disney will continue to make money and be an amazing brand. However when you compare it to other companies you can invest in. Why would you choose Disney? They have a terrible track record the last 5 years. The losses aren't even inflation adjusted.",
                              "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l68vxsn/",
                              "created": 1717023776,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "l68y4dl",
                              "score": -6,
                              "body": "I'm not saying that those companies are alike. I'm saying that past performance is not an indicator of future performance. If you were considering buying MSFT in 2013, you might have shied away because they hadn't moved much in over 13 years. But, if you bought in 2013, you would've been rewarded by a massive increase in the price. The same could easily be true for Disney. They've positioned themselves well in every industry after a crappy couple years(since 2019, most of Disney has been a crapshoot). If they start trading in the 70s and 80s, that's a perfect buying opportunity.",
                              "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l68y4dl/",
                              "created": 1717024644,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l69q3cs",
                  "score": -5,
                  "body": "How can you justify their multiples when their big pivot to high margin streaming failed and they’ve now doubled down on capital super intensive cruises and parks?",
                  "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l69q3cs/",
                  "created": 1717036171,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l69tqwh",
                      "score": 11,
                      "body": "Failed? How has it failed? They have 54B domestic D+, 63B D+ international, and 50B for Hulu. They brought in over 20B in revenue from the segment, which is only increasing. It took Netflix decades to get to where Disney got in just 5 years, and now that Disney is focusing on profit first in the area, they'll start to get to Netflix level margins(25%+).\n\nJust because parks and cruises are Capex heavy doesn't mean they aren't great businesses. Good rides at Disney parks last decades. The return on investments for the Disney parks is astronomical.",
                      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l69tqwh/",
                      "created": 1717037781,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6dtjhf",
                          "score": 0,
                          "body": "It’s not profitable and I’m not sure how they’ll get it profitable, and this is before they’re forced to spend even more money on Hulu that they foolishly FOMOd into at the height of streaming valuations. Their churn is 2x higher than Netflix’s and that’s before this profitability push you mentioned. \n\nParks and ships can be profitable, but they’ll never be ~infinite scale at minimal marginal cost like tech companies, which is what they’re valued at currently.",
                          "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6dtjhf/",
                          "created": 1717104513,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l6dvemg",
                              "score": 1,
                              "body": "What? First, D+ and Hulu recorded an operating profit last quarter, and they're gaining subscribers at a decent pace. Comparing anyone to Netflix in streaming is unfair, as they're the benchmark. D+ and Hulu have the lowest churn and highest subscriber count outside of Netflix. Profit comes the same way it came for Netflix. Netflix struggled with profitability for decades before recently becoming profitable. The same thing is the case for Disney. With time profit will come, but right now Disney is doing really well from a revenue and user perspective. It just requires a small price increase for them to be very profitable, which they'll likely do over time. \n\nThe parks have an operating margin of around 30%, which is the same as Apple. Don't talk about stuff you can disprove with a Google search",
                              "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6dvemg/",
                              "created": 1717105158,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l6ckdb4",
                  "score": -2,
                  "body": "What good news? They've been creatively bankrupt for a while now.",
                  "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6ckdb4/",
                  "created": 1717088430,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l699gsm",
              "score": 0,
              "body": "Bob Iger also came back which is more impactful than some short term agitator trying to make a quick buck.",
              "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l699gsm/",
              "created": 1717029259,
              "depth": 2,
              "replies": [
                {
                  "id": "l6cjy6i",
                  "score": 5,
                  "body": "Bob is the reason Disney is where it is.",
                  "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6cjy6i/",
                  "created": 1717088280,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6ff0je",
                      "score": 2,
                      "body": "There are two Bobs, which one?",
                      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6ff0je/",
                      "created": 1717127248,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6ftcpf",
                          "score": 2,
                          "body": "I don't count the one that stayed for 1 year. Whatever effect he had was based mainly on short term expectations and emotions.",
                          "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6ftcpf/",
                          "created": 1717135255,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l6959g5",
              "score": 0,
              "body": "You’re foolish if you think Disney is in the same position as it was when peltz started his first fight.",
              "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6959g5/",
              "created": 1717027532,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l6928wj",
          "score": 1,
          "body": "I mean I’ll trash him still. \n\nHow is him selling all of his shares indicative of him making a good board member?",
          "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6928wj/",
          "created": 1717026307,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6c9411",
      "score": 5,
      "body": "Nelson Peltz is a douchebag",
      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6c9411/",
      "created": 1717084260,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l691fhm",
      "score": 12,
      "body": "Is this the petulant \"table flip\" of the billionaire who doesnt get his way? Not a fan of disney, but it would be hilarious if it shot up after he fully divested. I have a feeling they will be healthier without him trying to meddle in every decision.",
      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l691fhm/",
      "created": 1717025977,
      "depth": 0,
      "replies": [
        {
          "id": "l69pc3j",
          "score": 17,
          "body": "Right now you just have Bob Iger and his hand-picked board of directors full of yes men. Looking at what they've done to their biggest brands I'd say they need some meddling.",
          "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l69pc3j/",
          "created": 1717035845,
          "depth": 1,
          "replies": [
            {
              "id": "l6ff38z",
              "score": -1,
              "body": "Bob Chapek is to blame, not Bob Iger",
              "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6ff38z/",
              "created": 1717127285,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l6cj65n",
      "score": 2,
      "body": "Take my billions and go home   umph.",
      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6cj65n/",
      "created": 1717087992,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l698yq8",
      "score": 6,
      "body": "Peltz is a POS",
      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l698yq8/",
      "created": 1717029050,
      "depth": 0,
      "replies": [
        {
          "id": "l69ktj6",
          "score": -1,
          "body": "Looks like Peltz downvoted you. I made it right.",
          "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l69ktj6/",
          "created": 1717033957,
          "depth": 1,
          "replies": [
            {
              "id": "l69m06z",
              "score": 4,
              "body": "Can’t imagine why anyone would ever downvote that comment. Well, maybe Nelson.\nFor your troubles. Here’s a good read. [https://www.lipstickalley.com/threads/peltz-house-of-horror.1276107/](https://www.lipstickalley.com/threads/peltz-house-of-horror.1276107/)",
              "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l69m06z/",
              "created": 1717034454,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l6c8vnj",
          "score": 0,
          "body": "I agree",
          "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6c8vnj/",
          "created": 1717084182,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l69r9it",
      "score": 5,
      "body": "Nelson has a small penis",
      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l69r9it/",
      "created": 1717036680,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6923av",
      "score": 3,
      "body": "Clown shit\n\nHow many ppl gobbled his knob just to watch him take his ball and go home",
      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6923av/",
      "created": 1717026244,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6dvdj8",
      "score": 1,
      "body": "People acting like Nelson took a huge “L” here when he literally made millions.",
      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6dvdj8/",
      "created": 1717105146,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6mz5s3",
      "score": 1,
      "body": "Sour grapes",
      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6mz5s3/",
      "created": 1717256379,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6941ud",
      "score": 1,
      "body": "Bye Felicia",
      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6941ud/",
      "created": 1717027036,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6bv27i",
      "score": 0,
      "body": "Well, goodbye disney. Shareholders decided to proceed with slow march into irrelevance. 10y return on that stock will be a joke - 5y already is",
      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6bv27i/",
      "created": 1717079270,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6a9cap",
      "score": 1,
      "body": "I respect the man for trying to fix Disney’s unfixable mistakes of recent years. I hope he invests that money into something less doomed to fail.",
      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6a9cap/",
      "created": 1717045906,
      "depth": 0,
      "replies": [
        {
          "id": "l6bl8mh",
          "score": -1,
          "body": "We would love him over at $fubo",
          "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6bl8mh/",
          "created": 1717075483,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6ap32j",
      "score": -2,
      "body": "Well. Disney is down 20% since. And yet Redditors is back sucking Disney’s pp as if they are back to End-game time",
      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6ap32j/",
      "created": 1717056903,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6c8fa8",
      "score": -1,
      "body": "Good riddance not everything in life is about money sometimes it’s about family",
      "permalink": "/r/stocks/comments/1d3nkd3/nelson_peltz_sells_entire_disney_stake_weeks/l6c8fa8/",
      "created": 1717084028,
      "depth": 0,
      "replies": []
    }
  ]
}