{
  "title": "Anyone else bullish on LAC?",
  "score": 22,
  "selftext": "Lithium Americas Corp (LAC) has been beat the the ground recently, largely due to a short report from Bleecker Street. Can’t help but feel this is a combination of panic and market manipulation. The long term value is there if the Thacker Lithium mine is completed and if lithium demand raises prices. With EVs being declared as long term goals for nearly every major car maker out there it seems like this price is too good to pass up. \n\nWith a~330M loan scheduled to be approved from GM, ~2 Billion in backing from the US govt, and the ~500M from the secondary share issuance, money isn’t expected to be an issue anymore to complete the project. \n\nAdmittedly share dilution is a red flag, but it seems the worst of it is priced in currently. \n\nIt all feels like a market overreaction waiting to be capitalized on. ",
  "link_flair_text": "Discussion",
  "id": "1d3o3qe",
  "num_comments": 34,
  "created_utc": 1717020467,
  "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/",
  "comments": [
    {
      "id": "l68nbes",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 hour ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l68nbes/",
      "created": 1717020471,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l68v4lc",
      "score": 22,
      "body": "I hope it goes back up, I'm holdin' bags like a chump over here.",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l68v4lc/",
      "created": 1717023458,
      "depth": 0,
      "replies": [
        {
          "id": "l72c5d3",
          "score": 2,
          "body": "Things been piece of shitting daily argentina counterpart has performed much better go figure ",
          "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l72c5d3/",
          "created": 1717509460,
          "depth": 1,
          "replies": [
            {
              "id": "l72c61z",
              "score": 1,
              "body": "It sounds like you're having some trouble with your investments, buddy. Maybe you should consider liquidating your assets and investing in something more stable, like index funds or physical gold. Don't let your emotions get the better of you - making impulsive decisions",
              "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l72c61z/",
              "created": 1717509467,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l68nczs",
      "score": 13,
      "body": "Why listen to the forecasts of peasants?",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l68nczs/",
      "created": 1717020488,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l68yw61",
      "score": 9,
      "body": "I bought LAC leaps for 2026 but I also have no idea what I’m doing :-)",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l68yw61/",
      "created": 1717024950,
      "depth": 0,
      "replies": [
        {
          "id": "lqi39et",
          "score": 1,
          "body": "What strikes did you end up buying?",
          "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/lqi39et/",
          "created": 1728156051,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l692ffq",
      "score": 20,
      "body": "Nah the LA Clippers aren't going anywhere when they're stuck relying on such injury-prone dudes",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l692ffq/",
      "created": 1717026379,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l68w58n",
      "score": 4,
      "body": "ALTM. LAC got crushed by a short report that came out recently",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l68w58n/",
      "created": 1717023858,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l699b2z",
      "score": 4,
      "body": "I am… been going in and out of it …. Finally settled on 4000@3.34 I really need some rocket ships to balance out a few bad trades . ![img](emote|t5_2th52|4258)",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l699b2z/",
      "created": 1717029192,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l69llgc",
      "score": 3,
      "body": "Now mind, I am in no way competent to talk about this, so consider my view not as advise, but an opinion.\n\nYou can´t really be bullish on stocks like this, because being bullish is saying, that there is a high degree of certainty, you will see strong results in the near or forseeable future. Projects like theirs however don´t give that kind of certainty. Indeed they offer a potential high yield cashflow further down the timeline, but they also carry a rather substantial risk of total failure and loss of your investment.\n\nMy view on these kind of projects is, to put money into them, you have lying around and don´t need to think twice about. A small investment, I consider lost at the moment I make it. If the project takes of, I´ll not make a fortunate but a reasonable cut of the good stuff, if they go broke, I won´t be surprised in the slightest and will not have lost to much.\n\nAgain, just from personal impression, projects like that will get hit in many ways, because things just don´t go as planned. Expect delays and bad news like that report to be common along the road. Don´t believe their phantasies and promises of a land of milk and honey. Look, whats reasonably there and if that is a business opportunity, without relying on miracles, think about investing early on.\n\nHowever, there tend to be small hypes ever so often as well. So personally I would not panic sell at the current price either, if I had overcommitted earlier. I´d wait for some opportunity to reduce my commitment with some small loss if necessary and thus lower the level of risk. And then see, if the ideas still pan out a couple of years down the line with the limited exposure, I just described.\n\nMy guilty pleasure in this regard is Renergen. I don´t think, they´ll ever be as big as their dreams, but if they just get the production going, there´s enough proven reserves (in their case LNG) to expect it to become a viable, well doing stock, worth way more, that where it is at now. But again: Years from now. If they get it done. And if they make the miracle happen. Well, I´ll be damned to complain... ;)",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l69llgc/",
      "created": 1717034283,
      "depth": 0,
      "replies": [
        {
          "id": "l69llh0",
          "score": 5,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l69llh0/",
          "created": 1717034283,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l69epyl",
      "score": 2,
      "body": "Be careful with Lithium stocks. I just dumped my position in one of the largest producers of Lithium. Lithium prices have bottomed, but it's still low, and demand for Lithium has been bleeding and may continue. If you're highly bullish on TSLA and the EV market in general, then I say get into it. If you're willing to hold hold for 2-3years may be a good play. Producers are coming together and trying to have better control of output to not over flood the market like they did last year.\n\nShare dilution has been happening in the last few months within lithium companies and managers have been selling their holdings. This may hint management believe lithium prices will be lower for a longer period and are holding on cash to weather the storm.",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l69epyl/",
      "created": 1717031416,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6asnra",
      "score": 2,
      "body": "I've held them since pre-split and am losing my ass. Down over 50% with an average over 8/share. Keep thinking about averaging down, but this damn thing loses 3-8% every day.",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l6asnra/",
      "created": 1717059632,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsax2zt",
      "score": 2,
      "body": "This aged excellent! I went bullish on Calls, and it printed like no ones business today.",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/lsax2zt/",
      "created": 1729131614,
      "depth": 0,
      "replies": [
        {
          "id": "lsax8dx",
          "score": 1,
          "body": "Haha was wondering if someone would come back to this. I’m still a few % down, but this is great news for long term prospects",
          "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/lsax8dx/",
          "created": 1729131673,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l68tein",
      "score": 3,
      "body": "I like the stock.",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l68tein/",
      "created": 1717022795,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l68v0ww",
      "score": 4,
      "body": "Just buy LIT if you bullish on lithium long term. Individal companies like this shit aren't worth the effort or time it takes to understand them. Also the chart speaks for itself.",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l68v0ww/",
      "created": 1717023418,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l69qgi1",
      "score": 1,
      "body": "I’m balls deep in this one. Kept averaging down. Maybe these 20 contracts will help.",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l69qgi1/",
      "created": 1717036330,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l69wc7l",
      "score": 1,
      "body": "Long term this is as good a shot at a 10 bagger as you’re going to find.  Could go lower short to medium term but I think anything under 4 is looking like a nice entry point.  Not huge into options personally but leaps is the way with this one I think.",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l69wc7l/",
      "created": 1717038966,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6a1ja7",
      "score": 1,
      "body": "Did they ever end up mining any lithium in America? NLAC No Lithium America",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l6a1ja7/",
      "created": 1717041521,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6a6m4n",
      "score": 1,
      "body": "i'VE only lost money playing with LAc",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l6a6m4n/",
      "created": 1717044293,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6b3aua",
      "score": 1,
      "body": "https://www.reddit.com/r/wallstreetbets/s/1rcHh3lGmT\nI posted about them a few months back because the loan announcement was imminent (though the size of it surprised me).  I think getting in under $4 is a good time but don’t expect to see any kind of actual ROI for at least 2-3 years when they get production ramped. Even then it’s a gamble that they’ll be profitable.  I made some money on options for the loan announcement but still hold just 20 shares.",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l6b3aua/",
      "created": 1717066855,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltjjsup",
      "score": 1,
      "body": "Oct 24: Bought a $2.50 Jan calls before the 10/16 GM announcement. Blind squirrel. \n\nSold today @ 33% gain. Will consider another bid should stock trade down to $3.\n\nThis is a highly speculative play that I'm happy to continue playing with, but only with cash I can afford to lose.",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/ltjjsup/",
      "created": 1729790032,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l69lb9y",
      "score": 1,
      "body": "As a Nevada native, I’ve been watching LAC with interest for some time. I had shares a few years ago and made some money but I’ve watched their decline for a while too.\n\nThey’ve recently cleared their legal roadblocks about conservation of the area and the government is giving them a boatload of money but progress is still slow. The ground they are on is good; the lithium is there and they will build a mining operation with that money.\n\nI think it’s undervalued, I will be buying in with the profits from my ASTS, but it’s a long ride, this won’t rocket up unless some unexpected news comes through. if I can go from 3.5 to 8-10 I’ll be happy",
      "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l69lb9y/",
      "created": 1717034164,
      "depth": 0,
      "replies": [
        {
          "id": "l69ns3l",
          "score": 1,
          "body": "Honestly not looking for a rocket, just looking for a little value. Agreed it feels undervalued given the large potential + GM partnership as well",
          "permalink": "/r/wallstreetbets/comments/1d3o3qe/anyone_else_bullish_on_lac/l69ns3l/",
          "created": 1717035189,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}