{
  "title": "Why dell stock is down after earnings report ",
  "score": 32,
  "selftext": "Dell earnings were surpassed analysts estimates and they did good but now I hope all of you know how earnings work they always look for future and the guidance for full year and next quarter weren’t looking so nice for Dell. Now it was not too much of bad guidance but with that being said the analysts now expect even lower earnings. Dell is a good company and I believe even if it fell down 18% I still think it will do good and come back up and regardless I would like to mentioned that never play with earnings like that because it’s like Russian roulette and you never know you might end up on which side anyway let’s see what’s markets brings Tommorow with the news of trump being found guilty. ",
  "link_flair_text": "Company Discussion",
  "id": "1d4gkb8",
  "num_comments": 59,
  "created_utc": 1717109100,
  "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/",
  "comments": [
    {
      "id": "l6ex968",
      "score": 106,
      "body": "> dell is a good company \n\nIs it? \n\nOperating incomes don’t seem to really be growing. You posted 1.6 billion, 1.5 billion, 1.75 billion in 2022. Then never topped 1.5 billion since \n\n82 billion in assets (includes 25 billion goodwill and other intangibles) with 84 billion in debt. That’s negative shareholder equity brother \n\nYou have 7 billion in cash but last quarter you burned 1.8, 1.4 before that, 1.8 before that. 2 before that, 1.5 before that\n\nSo with this rate of cash burn 7 billions not a lot\n\nYou guys say shit like “dells a good company” but never bother to do that hard part of proving it. Those financials don’t wow me. Meh at best.",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6ex968/",
      "created": 1717119687,
      "depth": 0,
      "replies": [
        {
          "id": "l6fe79g",
          "score": 34,
          "body": "Of course, that would take effort. We trade on vibes here only.",
          "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6fe79g/",
          "created": 1717126855,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6fsasw",
          "score": 9,
          "body": "Where do you get $84B in debt?",
          "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6fsasw/",
          "created": 1717134600,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6f1v8x",
          "score": 8,
          "body": "Hear hear. \n\nBefore I retired from the industry, it was amazing how many companies lined up behind Dell because \"they knew it\" or \"they liked it\". Frankly for most of IT it was a commodity play for servers and storage. Much of what they provided was comparable to HP, and HPE and others. \nTheir secret to winning contracts was it was either handed to them or they leveraged something in their portfolio like giving away VMware (when they owned it). My consulting group had to take a lot of their refresh projects, their consulting was average, promising a lot and looking for extras later. \nI am not impressed with them. \nOne of their big customers was Microsoft, which seemed to split their data centers between Dell and HPE equipment. Not sure if still true. \n\nThe disclosure by Microsoft of putting AI hw in the PC will certainly lift their refresh rates, but same for HPE and others. I suppose it's why they all will rise",
          "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6f1v8x/",
          "created": 1717121521,
          "depth": 1,
          "replies": [
            {
              "id": "l6f27ck",
              "score": 4,
              "body": "I like HPE better.",
              "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6f27ck/",
              "created": 1717121657,
              "depth": 2,
              "replies": [
                {
                  "id": "l6pk8t6",
                  "score": 1,
                  "body": "Me too. They have a refresh strategy for clients that is somewhat cloudlike, but putting infrastructure in the data center of the client or one they choose and uniquely access. Updates handled and the cost decreases or rises as the demand decreases/rises. Pay for use. When folks move to cloud they get latency problems to some apps, keeping it together solves that. Called \"Greenlake\". \n\nI like the mix of servers, storage, Aruba network and the high performance computing. \n\nDell claims the same, but it is just a leasing model.",
                  "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6pk8t6/",
                  "created": 1717292918,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lc6iy1y",
                      "score": 2,
                      "body": "They’re actually moving away from the leasing model and towards their Apex product which is pay per use.",
                      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/lc6iy1y/",
                      "created": 1720440785,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldly07k",
                          "score": 1,
                          "body": "Yeah, Dell is very price competitive. Michael Dell swoops in at the last minute of a big refresh deal and underside it. When they owned VMware, he would give it free to the customer to get the business, which could be millions off an 8 figure deal.HPE Greenlake won a lot of deals on price, but when the CEOs got in it could sway the deal. \nDell had to get price/performance  competitive again with Apex to compete with Greenlake. \n\nYeah, I watched these deals as a 3rd party but have a little bias. When Dell won, they did ok on pure HW replacement but not always the services. HPE had both. I saw a couple refreshes get moved to HPE in the last 10 years. \n\nAnother thing HPE had was a \"Silicon Root of Trust\".  Sounded like marketing BS but it was firmware technology that integrates security directly into the hardware level of the HPE server.  Those Dell and other servers tended to let the bios get hijacked and the result was these big enterprise outages. I saw companies like Merck get screwed and have to replace everything...I understand they went with HPE and the secured bios https://www.washingtonpost.com/news/the-switch/wp/2017/06/27/pharmaceutical-giant-rocked-by-ransomware-attack/",
                          "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/ldly07k/",
                          "created": 1721223881,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l6travf",
          "score": 3,
          "body": "Last year they had 6B in free cash flow where are you getting these cash burn numbers from lmfao",
          "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6travf/",
          "created": 1717365720,
          "depth": 1,
          "replies": [
            {
              "id": "l6ttj73",
              "score": 2,
              "body": "You’re looking at cash from from operating activities, fair thing to look at\n\nI’m looking at net cash flows \n\nNow maybe I shouldn’t be using net cash flows and I was hoping for good push back on this comment (didn’t get any tbh) \n\nNet cash flows is going to include some shit you could stop doing, like rebuying 2.4 billion dollars of stock. Had they not done that they’d have had positive cash flows\n\nThen again you stop doing your stock buyback and your share price probably suffers so\n\nBut if you can give me compelling reasons not to look at their bet and instead focus on their operating I’m all ears I like learning how to better evaluate a company",
              "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6ttj73/",
              "created": 1717366622,
              "depth": 2,
              "replies": [
                {
                  "id": "l6twoso",
                  "score": 3,
                  "body": "lol yeah… net cash flows is not the proper thing to look at. They bought back 2.4B of stock which is a great sign of financial health. They also paid off 4 billion more of debt than they took on. Operating cash flows almost 9B. Operating cash flows is how much they made from their business itself. Just because net cash flows are negative doesn’t mean they are burning cash. It just means they are using it towards bettering their company (buying back stock to reduce float and increase shareholder value, pay off debt, etc)",
                  "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6twoso/",
                  "created": 1717367905,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l6ot8sx",
          "score": 2,
          "body": "I work at dell and would never invest in the company long term ",
          "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6ot8sx/",
          "created": 1717281115,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6esmhf",
      "score": 23,
      "body": "It’s up 127.2% ytd and it’s only been 5 months. A lot of high flyers before earnings get sold off on profit taking by the algos or big banks unless it’s a massive blowout or stock split",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6esmhf/",
      "created": 1717117865,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6fd1xc",
      "score": 30,
      "body": "Disclosure: I am a massive DELL bull.\n\nDELL is down because expectations were through the roof and gross margin was down. DELL has grown at a faster rate than NVDA this year. There realistically was no possible way for them to meet these expectations to justify fucking $180 a share. Combine that with PCE tomorrow, a general tech sell-off, and an uninspired-sounding earnings call, you get -20%. That being said, IN MY OPINION, -20% is a massive over-reaction, as DELL is the largest server manufacturer in the world during an AI spending spree; they WILL be able to improve those margins as time goes on, just not as quickly as Wall Street (and I) had hoped. Additionally, they increased revenues and cash reserves and projected higher revenue for the year. Sucks that they weren't able to generate a better margin on AI this quarter, but as they said in the call, historically q1 is their worst quarter. I think it will continue to go up, just not 8% a day lol",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6fd1xc/",
      "created": 1717126305,
      "depth": 0,
      "replies": [
        {
          "id": "l6fpamb",
          "score": 6,
          "body": "When do you think we can recoup that dip?",
          "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6fpamb/",
          "created": 1717132775,
          "depth": 1,
          "replies": [
            {
              "id": "l6ftoxw",
              "score": 9,
              "body": "I bought more shares AH, and if it is still down 20% tomorrow morning I will probably be buying calls. My price target for ER was about 140 prior to earnings and 150-155 post, I maintain this expectation. Like I said above, I expect DELL to grow, just not at the batshit insane rate it has been.",
              "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6ftoxw/",
              "created": 1717135475,
              "depth": 2,
              "replies": [
                {
                  "id": "l6fz6bj",
                  "score": 2,
                  "body": "You reckon it’ll bounce back to 150 by next week?",
                  "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6fz6bj/",
                  "created": 1717139123,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6h0khw",
                      "score": 2,
                      "body": "If it recovers I think we could see it as soon as today.\n\nedit: lmao",
                      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6h0khw/",
                      "created": 1717161338,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6hvfdz",
                          "score": 1,
                          "body": "Do you think this is a case of cutting the losses and jumping ship, or holding out until the emotions wear off and people buy back in?",
                          "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6hvfdz/",
                          "created": 1717172482,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l6i0wh5",
                              "score": 1,
                              "body": "I think its a result of its insane run-up and valuation pre-earnings. when you are a 180$ stock you need to justify that to investors and DELL did not.",
                              "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6i0wh5/",
                              "created": 1717174397,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "l6n09ai",
                              "score": 1,
                              "body": "I jumped ship already, it's ridiculous seeing that happen after earnings. Lesson learned with these companies.",
                              "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6n09ai/",
                              "created": 1717256777,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l6ofcjk",
                                  "score": 1,
                                  "body": "Why did you jump ship? DELL is currently at 139 AH which is literally where it was 2 weeks ago, it's not gonna go back down below 100$ a share. If you had shares you might as well ride it out. Collect some dividends and chill.",
                                  "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6ofcjk/",
                                  "created": 1717275603,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l6ohp0f",
                                      "score": 1,
                                      "body": "I know I just couldn't stomach it continuously dropping.. this was my Roth",
                                      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6ohp0f/",
                                      "created": 1717276484,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l6oip8k",
                                          "score": 1,
                                          "body": "It's important to have stoplosses set up, friend. If you can't handle something dropping below a certain price you should probably set one up for that price.",
                                          "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6oip8k/",
                                          "created": 1717276871,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l6l3v73",
                  "score": 1,
                  "body": "Trying to understand the options hedging, noob here.\n\nShouldn't you be doing the opposite? Because if the price goes further down you also loose your option premium.",
                  "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6l3v73/",
                  "created": 1717220507,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6ohsyp",
                      "score": 3,
                      "body": "Doing the opposite of what? I bought more shares after hours because I thought (at the time) that DELL was massively oversold and I genuinely did not think I would ever see the stock that low again. Plus, I had been looking to increase my position in the company but it went off like a rocket before I could load up more. \n\nAs for buying calls, I did end up buying calls yesterday morning because again, I thought it was massively oversold. I bought 3x DELL 8dte 135c at about 9:30 AM PST, I was gonna hold it over the weekend but it increased far quicker than I anticipated so I sold it. There is always risk associated with trading options, so it's important not to get overly emotional so that you can think clearly in bizarre situations like yesterday. My philosophy for that options trade was: There is no reason for DELL to be -23% (at the time) while the market was also down even tho we had good PCE data. I'm (still) bullish on DELL. Therefore, I bought calls.",
                      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6ohsyp/",
                      "created": 1717276526,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6t9oq8",
                          "score": 4,
                          "body": "I am bullish on Dell because I have to be in order to make up for my ER losses",
                          "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6t9oq8/",
                          "created": 1717358998,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l6tyenk",
                              "score": 1,
                              "body": "💅",
                              "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6tyenk/",
                              "created": 1717368597,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "l6okyf5",
                          "score": 1,
                          "body": "[deleted]",
                          "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6okyf5/",
                          "created": 1717277758,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l6opyje",
                              "score": 1,
                              "body": "Ah, I see what you mean. Yes, I did not mean to hedge my position by buying those calls, I just thought the stock would recover a bit. I would have bought put options if I wanted to protect my shares, you are correct.",
                              "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6opyje/",
                              "created": 1717279756,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l6ho0ob",
      "score": 9,
      "body": "DELL earnings show strong demand for AI, but margin issue lead to decline",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6ho0ob/",
      "created": 1717169895,
      "depth": 0,
      "replies": [
        {
          "id": "l6ie8fa",
          "score": 1,
          "body": "This^",
          "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6ie8fa/",
          "created": 1717179035,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6ed73e",
      "score": 8,
      "body": "I was looking at Dell as they should benefit from data centers being refreshed.\n\nI'll have to read the transcript of the earnings call and analysts reports.  Especially now that it has come down.",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6ed73e/",
      "created": 1717111742,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6g5c3o",
      "score": 5,
      "body": "Dude, you're getting a Dell!",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6g5c3o/",
      "created": 1717143549,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6gsndu",
      "score": 6,
      "body": "Dell’s premarket price is down to $143. Approximately the same price it was *checks notes* 16 days ago.\n\nDell’s price is not a reaction to results at all. The stock price was pumped by institutions and insiders over the last few weeks and they’ve taken their profits. Dell is up ~$20 since it’s last earnings report.",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6gsndu/",
      "created": 1717157920,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6ezhjr",
      "score": 4,
      "body": "Wellllll should i sell right now and buy later again orrrrrr?",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6ezhjr/",
      "created": 1717120572,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6emp89",
      "score": 7,
      "body": "The guidance wasn’t bad at all. In fact they expect more compared to this quarter. “Revenue expected to be in the range of 23.5-24.5 billion” vs the 22.24billion reported today. \n\nAnd for the year, their guidance was at 93.5-97.5 billion, vs the 88.4 billion from last year. \n\nI don’t see why it shot down so much. Either way it’s already happened, I expect to see some recovery next week but probably not the whole 20% we lost today.",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6emp89/",
      "created": 1717115497,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6eolll",
      "score": 2,
      "body": "You can't really make a judgement one way or the other considering that the ER was posted to EDGAR after the market closed. After-hours trading activity isn't enough to gauge the market's (presumably kneejerk) reaction. Doing so is stupid - don't do that.",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6eolll/",
      "created": 1717116269,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6wnvkn",
      "score": 2,
      "body": "Yes this is my second option play… probably my last lol\n\nI bought 6/28 185 calls about 2 hours before it dropped, was down 97% 🙃\nNow I’m here trying to figure out how to minimize my losses on it😂",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6wnvkn/",
      "created": 1717420799,
      "depth": 0,
      "replies": [
        {
          "id": "l6wtme6",
          "score": 1,
          "body": "When is it expiring cause I would be holding long term",
          "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6wtme6/",
          "created": 1717423076,
          "depth": 1,
          "replies": [
            {
              "id": "l6wu77s",
              "score": 1,
              "body": "It expires 6/28, somehow it’s up today but I’m still down about 50-60%\n\nI figured I’d hold onto it, worst case it expires.. it’s just money lol",
              "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6wu77s/",
              "created": 1717423298,
              "depth": 2,
              "replies": [
                {
                  "id": "l6wuctr",
                  "score": 2,
                  "body": "If I’m going to be honest its the prolly going expire worthless unless miracle happens",
                  "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6wuctr/",
                  "created": 1717423358,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6x63qb",
                      "score": 1,
                      "body": "Yeah I figure the same, you’ll have that🤷🏻‍♂️",
                      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6x63qb/",
                      "created": 1717427569,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6x69ay",
                          "score": 2,
                          "body": "I’ll have to hold the stocks till I get my money back 😭",
                          "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6x69ay/",
                          "created": 1717427623,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l6e9b7w",
      "score": 1,
      "body": "Yup",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6e9b7w/",
      "created": 1717110259,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6ex4y4",
      "score": 1,
      "body": "I think it will recover some tomorrow and next 2 weeks should recover at least 5%.. just betting here so take it with grain of salt",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6ex4y4/",
      "created": 1717119642,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6nlr9v",
      "score": 1,
      "body": "I can say in my part we dish dell at my work , we go back at lenovo , problably a lot of it guy do it to, i can write all the day for the hardware problem i get with dell",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6nlr9v/",
      "created": 1717264501,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6o2yr6",
      "score": 1,
      "body": "I read that their AI-servers had almost zero profit margin. Most of the hype around Dell was about how they positioned themselves for being the frontier in providing AI into datacenters. Huge negative reaction ofc, especially seen in context of Nvidia earnings.",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6o2yr6/",
      "created": 1717270961,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l781ylu",
      "score": 1,
      "body": "https://www.barrons.com/articles/hp-enterprise-earnings-stock-price-bacd820e?siteid=yhoof2",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l781ylu/",
      "created": 1717597998,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6eh43q",
      "score": 1,
      "body": "good post",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6eh43q/",
      "created": 1717113277,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6fu55i",
      "score": 0,
      "body": "Whatever anyone says, it's Wall Street",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6fu55i/",
      "created": 1717135766,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6fv60s",
      "score": 0,
      "body": "It’s a bad company which good pumped to hell on the hope that AI would multiply their revenue like SMCI\n\nEarnings is the moment when reality sinks in a little",
      "permalink": "/r/stocks/comments/1d4gkb8/why_dell_stock_is_down_after_earnings_report/l6fv60s/",
      "created": 1717136431,
      "depth": 0,
      "replies": []
    }
  ]
}