{
  "title": "TLT - Too Low for Too Long",
  "score": 49,
  "selftext": "Ok degenerates...here's the play (with shades of Big Short..the movie..not your weenie):\n\nOne of the largest domestic Fixed Income ETFs, TLT, has been too low for too long and not for the right reasons. First, some context.\n\nTLT has an effective duration of 16 years and mainly comprises long duration US Treasury bonds, which as you know, gain value when the yields fall. Bonds also form part of a typical boomer portfolio with a 60/40 split. Though equities have been rallying hard this year, bonds are down \\~9% YTD and it's time that they get their payback. \n\n1. All is not well with the US economy: As the April jobs report showed, job growth is slowing down after a 6M period of gains. At the same time, credit card delinquencies of 30+ days are constantly creeping up ( remember I implied Big Short) along with stress on every other asset tied to rising yields. Large US Corporates have been pushing back on refinancing their long term debt and smaller companies are effectively resorting to much more expensive equity, increasing their riskiness. Layoffs are spreading across US (just talk to any of your friends who doesn't work at Wendys) and it's a matter of time before the economic data starts showing the deterioration of the job market. May jobs report is key and is coming out next Friday.\n\n2. Yield curve control: Janet Yellen (the lady who can see the future) effectively introduced Yield Curve Control when the Treasury started buying back its old bonds yesterday to increase liquidity after a 2 decade period. What this means that there's an effective floor on bond prices and Treasury would do what it takes to keep the long term rates subdued. Treasury also committed to keeping the coupon fixed for a while for new issuances which signals their intent to keep the yields low (no one likes to buy a bond not trading close to par at issuance).\n\n3. Long term rates crash in recession: Remember when 10 year US Treasury yield touched 50 basis points (0.5%) in 2020 during the height of Covid crises? Long term yields are a reflection of economy's health and there's no reason for them to stay elevated when all's not well with the US economy.\n\n4. Excessive short positioning: Hedge funds are short US Treasury long term bonds and now it's becoming an overcrowded trade. At the same time, implied volatility in long term options is very low, which means almost everyone is pricing out a US economic slowdown, which is exactly what we need to make a bank. See below article from Bloomberg Senior Commodity Strategist which implies that TLT is just a spart away from going to the Moon and might show a rally similar to Gold. \n\nhttps://preview.redd.it/ef4n8fr3cp3d1.png?width=1015&format=png&auto=webp&s=d6cceb670a0e5d79be73be2844e7cd808210fd4c\n\n5. Portfolio rebalancing: Most boomer portfolios are still 60/40 and rebalance on a monthly basis. Another reason for bonds/TLT to start rallying soon as equity markets have really outperformed fixed income YTD.\n\nTLDR: Options on TLT currently have low implied volatility. Market is underpricing risk of a US economic slowdown. Jan 17 2025 strike 100 calls are currently trading close to historical lows and were trading 5x-6x at the start of the year.  LONG Jan 17 2025 100 calls (the fact that these have more than 50k of Open Interest means that I'm not alone here).",
  "link_flair_text": "DD",
  "id": "1d4ouam",
  "num_comments": 68,
  "created_utc": 1717135930,
  "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/",
  "comments": [
    {
      "id": "l6fueia",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6fueia/",
      "created": 1717135934,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6fwgt2",
      "score": 45,
      "body": "I have no idea what you're talking about, but it was a lot of words and took some effort so I'm in ![img](emote|t5_2th52|4258)",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6fwgt2/",
      "created": 1717137293,
      "depth": 0,
      "replies": [
        {
          "id": "l6g4ulj",
          "score": 21,
          "body": "He saying SPY will go down so he want to play TLT, but I rather buy SPY put.\n\n0dte with my life saving in single trade of course",
          "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6g4ulj/",
          "created": 1717143195,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6h4u7w",
          "score": 5,
          "body": "TLDR; the next movie of Darren Aronofsky will be about an options trader.",
          "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6h4u7w/",
          "created": 1717163013,
          "depth": 1,
          "replies": [
            {
              "id": "l6i2atr",
              "score": 1,
              "body": "For real?",
              "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6i2atr/",
              "created": 1717174879,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l6g2ey7",
      "score": 21,
      "body": "I have 2400 shares of TLT, target price $130+ at eventual rate cut. But nobody knows when it will be. Still have more appetite for twice size positions but still holding out yet\n\nRate can stay higher for longer. Better to go with share and collect the coupon to gamble with something else while waiting for eventual payday",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6g2ey7/",
      "created": 1717141424,
      "depth": 0,
      "replies": [
        {
          "id": "l6gfh2o",
          "score": 6,
          "body": "This is what I’m doing atm as well",
          "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6gfh2o/",
          "created": 1717150812,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6js2tw",
          "score": 3,
          "body": "Doing this but with TMF. 3700 shares",
          "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6js2tw/",
          "created": 1717197622,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6go2ih",
      "score": 15,
      "body": "I own tlt and it’s my worst performing position. Tlt can suck my balls",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6go2ih/",
      "created": 1717155715,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6g2ie4",
      "score": 16,
      "body": "Maybe they were trading 5x more in january cuz 6months of theta has passed & stock is 10% lower. Hilarious that you want to do TA on option prices",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6g2ie4/",
      "created": 1717141491,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6fxg23",
      "score": 12,
      "body": "There has been nonstop talk about a slow down for 3 years now. The market is not failing to price the risk in because the market gives zero fucks about a slow down. At this point, the Fed is all that matters",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6fxg23/",
      "created": 1717137950,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6g2dkw",
      "score": 8,
      "body": "A pretty solid play. The absolute worst outcome, after extensive rate hikes is highly unlikely, increasing rates will cripple the budget. \n\nThe worst outcome will be that nothing changes and you get 4-5% yield every year. \n\nIn the event of rate cuts you will be handsomely rewarded.",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6g2dkw/",
      "created": 1717141395,
      "depth": 0,
      "replies": [
        {
          "id": "lfgvcga",
          "score": 2,
          "body": "There’s another scenario in which geopolitical risk spikes along with inflation.",
          "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/lfgvcga/",
          "created": 1722249588,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6gqv7e",
          "score": 2,
          "body": "Question from fellow regard: If I buy this ETF. I would get a \"yield\" which works as a \"dividend right?",
          "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6gqv7e/",
          "created": 1717157081,
          "depth": 1,
          "replies": [
            {
              "id": "l6hn7gw",
              "score": 2,
              "body": "Dividend is around $0.31 a month per share right now. And the majority of this amount should be exempt from state taxes because it’s US treasury income.",
              "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6hn7gw/",
              "created": 1717169608,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l6gs4yv",
              "score": 1,
              "body": "If it is a distributing fund then yes.",
              "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6gs4yv/",
              "created": 1717157683,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l6h6o5n",
      "score": 4,
      "body": "I am not sure about this play, inflation is kinda hot, there is no guarantee that we will not see higher rate, TLT is good if we know for sure that rate will go down. I will sit this one out, if we are anticipating economy is gonna go bad, then SPY put is a better option.",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6h6o5n/",
      "created": 1717163703,
      "depth": 0,
      "replies": [
        {
          "id": "lb2f0b9",
          "score": 2,
          "body": "What is hot in the inflation? I.e. can you think of a single component of the inflation today that is growing at above 2% rate?",
          "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/lb2f0b9/",
          "created": 1719798821,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lftdeb4",
          "score": 1,
          "body": "We do know for sure rates will go down. Guaranteed in September. And then probably 100 basis points in 2025, one cut per quarter.",
          "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/lftdeb4/",
          "created": 1722435161,
          "depth": 1,
          "replies": [
            {
              "id": "lftw8r2",
              "score": 2,
              "body": "it was until recently that we know there will be a rate cut in september, OP posted two months ago. this is why I didn't do option, but I got shares instead.",
              "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/lftw8r2/",
              "created": 1722441341,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l6xk4b3",
      "score": 5,
      "body": "Trade is up more than 40% since I posted..Treasury rally is just getting started!\n\nhttps://preview.redd.it/qm11r7qxvd4d1.png?width=645&format=png&auto=webp&s=6f811433b6edfde8519d01de9beeb8f7369d4b9e",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6xk4b3/",
      "created": 1717432348,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6gtihp",
      "score": 6,
      "body": "I think this is a quality play, most probably won't get it though. I think 50-50 TLT can drop one more time toward 86, and that's a strong support level, and there I'd get some Mar 2025 $100 or $105 calls.  Odds are good that rates slide into fall/winter, likely to 3-4%, sending bonds up and TLT up to at least 120, maybe more into next year, maybe even 130-140 if markets start dropping enough. The low vol can really make these calls pay off. \n\nThe real crazy play is what comes next though, like after TLT tops out 120-140, maybe in a year or two and after a ton of money is created to prop things up, we replay post-covid, inflation is set up to roar back, rates probably go nuts (and eventually tank markets), and TLT crashes 50% again, with low vol and which nobody expects, buying TLT leap puts at that top will have wild potential.",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6gtihp/",
      "created": 1717158318,
      "depth": 0,
      "replies": [
        {
          "id": "lb9qcyh",
          "score": 1,
          "body": "Pretty much like the 70’s",
          "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/lb9qcyh/",
          "created": 1719920423,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6g4pcw",
      "score": 3,
      "body": "What do you think will happen to long term rates if inflation starts to kick off again?",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6g4pcw/",
      "created": 1717143088,
      "depth": 0,
      "replies": [
        {
          "id": "l6gfipv",
          "score": 3,
          "body": "Will be increased",
          "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6gfipv/",
          "created": 1717150841,
          "depth": 1,
          "replies": [
            {
              "id": "l6gglqs",
              "score": 9,
              "body": "And TLT will be cooked 🩸",
              "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6gglqs/",
              "created": 1717151536,
              "depth": 2,
              "replies": [
                {
                  "id": "lb2f5li",
                  "score": 2,
                  "body": "Unlikely to happen with the current path of inflation readings.",
                  "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/lb2f5li/",
                  "created": 1719798885,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l6ggcge",
      "score": 3,
      "body": "If treasury auctions start failing what do you say about TLT ? I hold puts on it",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6ggcge/",
      "created": 1717151371,
      "depth": 0,
      "replies": [
        {
          "id": "lb2f8pt",
          "score": 2,
          "body": "You know we have the fed reserve that can buy that debt with one click, right? The whole thing is a game.",
          "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/lb2f8pt/",
          "created": 1719798921,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6h72t2",
      "score": 3,
      "body": "I know this conversation comes around every cycle, but it literally could be different this time…. Will the world stop buying US bonds? If that happens, the Fed loses control, yields spike and bond values drops through the floor.",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6h72t2/",
      "created": 1717163855,
      "depth": 0,
      "replies": [
        {
          "id": "l6juxb9",
          "score": 3,
          "body": "Eurozone + England are about to cut rates. USTs will become quite attractive if you can get  >100 bps in nominal yields. I don't know enough about forex to factor that in though",
          "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6juxb9/",
          "created": 1717198789,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6hpjiz",
      "score": 2,
      "body": "This guy thinks TLT is going to start trading like a meme stock",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6hpjiz/",
      "created": 1717170426,
      "depth": 0,
      "replies": [
        {
          "id": "l6i4fal",
          "score": 1,
          "body": "Fwiw CBOE is trying to add daily option expirations to it",
          "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6i4fal/",
          "created": 1717175617,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8lengm",
      "score": 2,
      "body": "While haters were hating, everybody in this trade doubled their investment in less than 2 weeks!!",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l8lengm/",
      "created": 1718379496,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb9reek",
      "score": 2,
      "body": "I’m holding TLT but selectively buying it here and there, knowing full well it could drop in price if inflation ticks up, US auction of bonds fail or if Japan or China hint that they’re gonna sell US bonds, but once rates drop, that’s when I’m gonna go full shopping spree on it",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/lb9reek/",
      "created": 1719920951,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6g1g4v",
      "score": 5,
      "body": "You belong here. You are talking to a bunch of regards who will not understand an iota of what you just posted, let alone know the ticker. I on the other hand have been thinking of yoloing 1 month's salary every other month on ATM leaps, because unless they raise rates, TLT is not going lower. Anything can happen, but if they increase rates, markets tank, banks go bankrupt, real estate crash, and rates come crashing down to save everyone again, and TLT goes to the moon. Oorrrrr, they lower rates eventually like they said they would, and TLT goes back up and I make money. But you right, overcrowded shorts on treasuries. And dont forget to buy a little TMF along the way.",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6g1g4v/",
      "created": 1717140724,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6fvr8z",
      "score": 2,
      "body": "in",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6fvr8z/",
      "created": 1717136821,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6kgotv",
      "score": 1,
      "body": "Long end can definitely re-price. Yellen bitched out when the 10yr treasury went to 5% in Oct last year and reduced the pace of bond issuance and went with bills. Treasury won’t be able to do this forever, there’s a real chance a bear steepener will un-invert the yield curve outside of a recession. The long TLT trade is a very crowded trade. Buyer beware",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6kgotv/",
      "created": 1717208272,
      "depth": 0,
      "replies": [
        {
          "id": "lb2ffha",
          "score": 1,
          "body": "What makes it crowded? Major investment banks do not recommend it, asset managers do their own thing in allocations, retail is growing but insignificant player.",
          "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/lb2ffha/",
          "created": 1719798999,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6fwm67",
      "score": 2,
      "body": "Not competent to speak on this. But Long term investment in US treasury bonds, when the United States barely avoided a whole series of shutdowns - meaning they would be unable to pay - is not what I would consider a reasonable path. Raise taxes, get Biden elected and have a functioning Congress. Then we can talk about the Dollar as a safe investment again. Or pay the interest, other nations pay, which hurdle towards bankruptcy every so often.",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6fwm67/",
      "created": 1717137394,
      "depth": 0,
      "replies": [
        {
          "id": "l6ga9hy",
          "score": 7,
          "body": "Raise taxes. Holy fuck, I can't believe how many people advocate for that. Let's throw more money at the worst performing capital allocator in the universe. They already take about half our money once you factor in income tax, property tax, inheritance tax, sales tax, and then the biggest fuck you of all: inflation.",
          "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6ga9hy/",
          "created": 1717147197,
          "depth": 1,
          "replies": [
            {
              "id": "l6gdozl",
              "score": 5,
              "body": "Yes exactly. Because if the United States of America had the tax level of the Reagan Era, it would not be anywhere near the debt level, we see. And bad at allocation? Let´s look at the US Postal Service. It was at some point expensive, but highly efficient. Then it´s budget was cut, until it became less efficient. And then it was cut to force it to become more efficient, until it became basically defunct. And then it was claimed, that government wasn´t able to do the job and postal service should be privatized. Destroying government by defunding is not proving inefficiency of government.\n\nThe best example is the IRS. Hire enough accountants and they will pay for themselves. Any of them, going through business records should bring in taxes, those businesses evaded paying, worth several times their salary. And that´s the numbers we have in germany, where tax evasion is much less rampant.\n\nIt´s kind of funny, that the CIA actually considers efficient taxation core part of rating of stability, yet the United States  are flaundering it themselves.\n\nAnd why now? Because that is, how economy works. If the economy is strong, you raise taxes and pay back debts. That prevents an overheating of the economy. One thing, you don´t need to do, when the taxews are higher, is raising interest rates, in order to slow the economy. If you lower the interest rates, you have cheaper money available for new enterprises - or houses.\n\nThe problem of the big economies these days is, that they do half-anitcyclic-strategies. They all adhere to the \"invest in a downturn - with debt if necessary - in order to get the economy going.\" But no one cares for the part, that says, \"raise taxes and repay debt, when the economy grows, so you keep room for decisions in the next downturn.\"",
              "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6gdozl/",
              "created": 1717149633,
              "depth": 2,
              "replies": [
                {
                  "id": "l6goq1q",
                  "score": 2,
                  "body": "\"If the economy is strong, you raise taxes and pay back debts.\"\n\n**And when is the last time they've done that?** The economy has been apparently booming, but only if you aren't paying attention. **Either it really has been booming, in which has why has the debt gone up trillion after trillion instead of being paid down?** Or else, it's really not that strong which can be evidenced by the fact that GDP hasn't even kept up with new debt. If deficit spending were removed from GDP, the economy actually shrunk. That's just evidence that real growth has stagnated, which is exactly why governments are churning out new dollars, debt, and spending bills.\n\nIf you think 34 trillion in debt is a sign of successful capital allocation, I'm glad you aren't running my business. We're in the middle of a debt spiral where they can hardly even keep up with paying down interest on the debt. This is not a healthy economy, it's an overheated, bifurcated economy whereby those with assets are doing well, and those without are barely keeping themselves above water.\n\nIf the government can't keep themselves above board while receiving all the taxes they do, plus the benefit of a reserve currency, plus being one of the most resource and innovative countries in the world, plus all the monetary debasement to lighten their debt load, then we should not be handing over more and more to see if they finally figure it out. They are inefficient, opaque, and people like you are way too gullible which gives them even more leeway to abuse their power.\n\nPS: questions for you are highlighted so that I can be a little more sure you won't just ignore those parts. If you have a cogent answer or a valid justification to the inevitable excuses, I'm all ears.",
                  "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6goq1q/",
                  "created": 1717156039,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6gtxtq",
                      "score": 2,
                      "body": "George HW Bush raised taxes in the early 90s after Reagan’s failed as fuck supply side economics did the fail. Then Clinton got elected and we had a goddamn surplus going into Bush 2’s first term in 2000. Alan Greenspan was worried about how to conduct monetary policy without a debt balance. \n\nThe reason we have debt is simple. Republican presidents are fucking awful at fiscal policies. They are objectively terrible at it.",
                      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6gtxtq/",
                      "created": 1717158509,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l6gtg6x",
              "score": 1,
              "body": "Yeah! It’s not like the government has ever done anything good at all like bringing electricity to rural areas, going to space, or inventing the Internet. \n\nWait…",
              "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6gtg6x/",
              "created": 1717158289,
              "depth": 2,
              "replies": [
                {
                  "id": "l6h7r6d",
                  "score": 2,
                  "body": "Oh, sorry, I thought it was people who did those things. People who think the government is responsible for everything good are ridiculous.",
                  "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6h7r6d/",
                  "created": 1717164106,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6hcd36",
                      "score": 2,
                      "body": "The government is made of people. What is your point?",
                      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6hcd36/",
                      "created": 1717165780,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lb2fktw",
          "score": 1,
          "body": "I think you are confusing a budget approval with the debt burden - the two are connected only vaguely.",
          "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/lb2fktw/",
          "created": 1719799060,
          "depth": 1,
          "replies": [
            {
              "id": "lb4enjx",
              "score": 1,
              "body": "Of course, you are quite right, that I mixed up things here. To be quite honest, I can have brain freezes like Biden somtimes, despite being several decades younger.\n\n  \nHowever I do content the notion, those two were only vaguely connected. Because, while in theory completely unrelated, the \"Underlying Security\" for both, passing a budget and raising or suspending the debt ceiling is a functioning congress. Thus as a complete layman, I´d state, congress coming close to not passing a budget is not the same as congress not suspending the debt ceiling, but it is heavily correlated and an indicator for congresses ability to do so.\n\nThe US government came close to hitting the debt ceiling - meaning not being able to pay interest - 3 times in 12 years. The next date - if I´m not wrong - wold be January first. Right in the middle of everything happening after the elections.\n\nSo in a scenario, where we deal with 3, 5, 10, 30 year bonds, the underlying security scimming bancrupty every couple of years, in my very personal opinion represents a risk, not yet reasonably priced into the rates of those bonds - or factored into the US government credit rating.",
              "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/lb4enjx/",
              "created": 1719839615,
              "depth": 2,
              "replies": [
                {
                  "id": "lb56321",
                  "score": 1,
                  "body": "Again, the interest is paid by the treasury department. They by default cannot default on their debt, as they can always print more money. You are welcome!:)",
                  "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/lb56321/",
                  "created": 1719849425,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lb8bvaq",
                      "score": 1,
                      "body": "That is nice to know. But are they always allowed to pay the interest? Or is there a constitutional debt ceiling, that would force them to stop doing so?",
                      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/lb8bvaq/",
                      "created": 1719889631,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l6h4oa9",
      "score": 0,
      "body": "T bonds have a historical return of like 3% I'm not even reading this",
      "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6h4oa9/",
      "created": 1717162951,
      "depth": 0,
      "replies": [
        {
          "id": "l6hnzi2",
          "score": 1,
          "body": "that’s the gist of it - look at the last fee years’ return and think about the historical return. what does that tell you?",
          "permalink": "/r/wallstreetbets/comments/1d4ouam/tlt_too_low_for_too_long/l6hnzi2/",
          "created": 1717169883,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}