{
  "title": "PCE data. Inflation maybe going away too slowly.",
  "score": 67,
  "selftext": "https://www.bea.gov/news/2024/personal-income-and-outlays-april-2024\n\nPrices\n\nFrom the preceding month, the PCE price index for April increased 0.3 percent (table 5). Prices for goods increased 0.2 percent, and prices for services increased 0.3 percent. Food prices decreased 0.2 percent and energy prices increased 1.2 percent. Excluding food and energy, the PCE price index increased 0.2 percent. Detailed monthly PCE price indexes can be found on [Table 2.4.4U](https://apps.bea.gov/iTable/?reqid=19&step=3&isuri=1&select_all_years=0&nipa_table_list=2013&series=m&first_year=2020&last_year=2022&scale=-99&categories=underlying&thetable=&_gl=1*185b3gc*_ga*MTcyNzI0OTgwMi4xNzE3MTU4NjM3*_ga_J4698JNNFT*MTcxNzE1ODYzNi4xLjEuMTcxNzE1ODY2MS4zNS4wLjA.#eyJhcHBpZCI6MTksInN0ZXBzIjpbMSwyLDMsM10sImRhdGEiOltbIm5pcGFfdGFibGVfbGlzdCIsIjIwMTYiXSxbImNhdGVnb3JpZXMiLCJTdXJ2ZXkiXSxbIkZpcnN0X1llYXIiLCIyMDIwIl0sWyJMYXN0X1llYXIiLCIyMDIzIl0sWyJTY2FsZSIsIjAiXSxbIlNlcmllcyIsIk0iXV19).\n\nFrom the same month one year ago, the PCE price index for April increased 2.7 percent (table 7). Prices for goods increased 0.1 percent and prices for services increased 3.9 percent. Food prices increased 1.3 percent and energy prices increased 3.0 percent. Excluding food and energy, the PCE price index increased 2.8 percent from one year ago.\n\nEdit:\n\nThe link above to the table Table 2.4.4U seems to only go to December 2023.\n\nThis is a viewer modified version of table [Table 2.4.4U](https://apps.bea.gov/iTable/?reqid=19&step=3&isuri=1&select_all_years=0&nipa_table_list=2013&series=m&first_year=2020&last_year=2022&scale=-99&categories=underlying&thetable=&_gl=1*ewfmy9*_ga*MTIzNTk5Njk0My4xNzE3MTU5MTY3*_ga_J4698JNNFT*MTcxNzE1OTE2Ny4xLjEuMTcxNzE1OTkwNS42MC4wLjA.#eyJhcHBpZCI6MTksInN0ZXBzIjpbMSwyLDMsM10sImRhdGEiOltbIm5pcGFfdGFibGVfbGlzdCIsIjIwMTYiXSxbImNhdGVnb3JpZXMiLCJTdXJ2ZXkiXSxbIkZpcnN0X1llYXIiLCIyMDIwIl0sWyJMYXN0X1llYXIiLCIyMDI0Il0sWyJTY2FsZSIsIjAiXSxbIlNlcmllcyIsIk0iXV19) that goes to April 2024.\n\nEdit: Apparently you have to click \"Modify\" and select \"2024 Q & M\" to be able to see January through April 2024 data. This may not work on every viewing device.",
  "link_flair_text": null,
  "id": "1d4uk6v",
  "num_comments": 67,
  "created_utc": 1717158963,
  "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/",
  "comments": [
    {
      "id": "l6guyc7",
      "score": 1,
      "body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6guyc7/",
      "created": 1717158964,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6gzdqe",
      "score": 39,
      "body": "core PCE came in 0.249% month over month, and was rounded down to 0.2%. Market forecasters were largely expecting between 0.22% to 0.26%, so this was actually on the high side of the forecast.\n\n[https://x.com/NickTimiraos/status/1796279892423926260/photo/1](https://x.com/NickTimiraos/status/1796279892423926260/photo/1)\n\n[https://www.federalreserve.gov/newsevents/speech/waller20240521a.htm](https://www.federalreserve.gov/newsevents/speech/waller20240521a.htm)\n\nFed likely needs core PCE month over month to come in at the most 0.20% (2.4% annualized) for at least 6 months before they can feel comfortable cutting. In fact, if core PCE month over month continues coming in at 0.20%, the core PCE will end 2024 at 3.0% year over year, higher than today at 2.8% YoY",
      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6gzdqe/",
      "created": 1717160858,
      "depth": 0,
      "replies": [
        {
          "id": "l6h5m6u",
          "score": 24,
          "body": "I don't understand this notion of assuming they'll cut the second we hit target. If we're hitting target.... Why cut?",
          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6h5m6u/",
          "created": 1717163309,
          "depth": 1,
          "replies": [
            {
              "id": "l6h6fr0",
              "score": 29,
              "body": "well 2.4% annualized isn't exactly hitting the target, but they'll cut because they're nervous about the recession. They're clearly very jumpy about it, and Fed Cook mentioned a few months back that they were hearing signs from local businesses about a very rapid slowdown starting in early 2024. That might've been why Powell was so dovish in Dec 2023 FOMC.\n\nThe Fed knows consumers and companies are (mostly) sheltered from high rates right now. Consumers refinanced their mortgage in 2020, and corporates refinanced their debt in 2020.\n\nThat means the ONLY people feeling the high interest rates are new homebuyers, car purchasers, consumers with credit card debt, corporates who have to refinance their debt today. In fact, people might be BENEFITING from high rates because their cash are now yielding extra income, and same for cash in big corporates.\n\nAs rates stay high for longer, a higher portion of those people will eventually be affected. People eventually need to move and sell their current house. Corporate debt will eventually mature and require refinancing. The Fed is afraid that rates are actually a lot more restrictive than it might look on the surface once those people actually get hit with high rates, and it will cause a very sudden/rapid shift in economic strength.",
              "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6h6fr0/",
              "created": 1717163618,
              "depth": 2,
              "replies": [
                {
                  "id": "l6h6zxk",
                  "score": -9,
                  "body": "Aren't our rates still historically extremely low? They're only high compared to COVID days. Why can't we normalize back to this level? Sure some will feel pain today, but isn't that better than just kicking the can down the road? \n\nWhat you are implying is that the economy can no longer sustain rates above .25% and that is our new normal to hit.. which seems insane to me.",
                  "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6h6zxk/",
                  "created": 1717163825,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6htxy4",
                      "score": 9,
                      "body": "Historically doesn't matter. It's high relative to what the previous boom economy was built on, and that relativity is what gives you the restriction. If it holds and we get through a bust without a cut, sure, we can peg this rate as the new normal for the next boom, but you need to knock over the analysts' house of cards before it will respect it.",
                      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6htxy4/",
                      "created": 1717171959,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l6ha14z",
                      "score": 4,
                      "body": "Current rates? Absolutely not. We were running ZIRP for nearly a decade. 5.25-5.50% is normal.",
                      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6ha14z/",
                      "created": 1717164944,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l6h7m6x",
                      "score": 2,
                      "body": "I'm stating from the perspective of the Fed, which is clearly skewed towards protecting employment over fighting inflation. You could clearly see that mindset shift as far back as Sept/Dec 2022 when they continuously extended the deadline on what year inflation will go back to 2% on their dot plot. It's what I think they will do, not what I think they should do. I think as long as core PCE (not core CPI) year over year stays below 3.0%, they'll maintain this stance of employment over inflation.\n\nI would be careful about comparing historical rates. Ever since 2000 and 2008, the neutral rate (rate neither stimulative nor restrictive) has been slowly shifting down. It likely shifted up after 2020, but where it is is uncertain. But don't compare rates against 1980s and think it should go back to that level. It might probably go back to 1990s or 2000s level.",
                      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6h7m6x/",
                      "created": 1717164055,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l6hf2nd",
                  "score": -3,
                  "body": "I think the \"very sudden/rapid shift\" will be in the political area instead of finance.\n\nThose 30 year fixed 3% rate mortgages may keep stimulating the economy for a decade or two. Growth and earnings for stocks are doing ok, and housing prices and rents are still doing ok even though interest rates are up and probably will go higher with little or no effect on stocks. Companies can easily IPO more shares because there is so much money in the stock market.\n\nSo a social-economic split between owners and renters will continue to drive political actions that will probably cause the sudden/rapid shift in the economy you are talking about. Maybe stocks will be taxed more.  Maybe large wage increases will cause net exports to become more negative or corporate earnings start to decline. It's hard to predict what could come out of a political change. But in almost any case, it seems that rates are going to go up with very little effect on the economy or price of stocks because so many people and companies are insulted from the cost of borrowing.",
                  "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6hf2nd/",
                  "created": 1717166745,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6hih43",
                      "score": 8,
                      "body": "politics will be a big factor if there's a sweep for both Congress + president. If it's divided, it tends to sell off and then rally post-election.\n\nI'm not excited about the prospect of Trump winning presidency. Even if he doesn't have Congress, he has way too much influence with his tweets, too unpredictable, and can just yell out bizarre things, like fire Powell or something. Biden has no spine so if he wins, it's probably a bit better for stocks.\n\nCorporate tax will definitely be a big hit, but seems like both parties will extend the Trump tax cut, and Biden doesn't have the spine to go against the 1%. Trump obviously has no reason to.\n\nI do think people are underestimating how high rates really are though. The shift when people actually get hit with them will be huge, even if it's only a small percentage of Americans. Most American mortgages would double if they ever moved, and corporates would have to pay double their current rates if they ever refinanced debt. A falling domino doesn't require a huge force to topple it over",
                      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6hih43/",
                      "created": 1717167945,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l6h68n1",
              "score": 13,
              "body": "Well, they explain it themselves.\n\nYou can't wait till you're at target to cut, because you will have already gone too far.\n\nYou need to hit your brakes before you get to the stop sign, right?",
              "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6h68n1/",
              "created": 1717163544,
              "depth": 2,
              "replies": [
                {
                  "id": "l6j2gv2",
                  "score": 2,
                  "body": "About hitting the break before getting to the stop sign, it's more of the question now about whether or not to take you foot off the break or press harder on the break.\n\nThey set the throttle too high by doing QE to increase the Fed's balance sheet from about $3.5 trillion to about $8 trillion. And they kept the petal to the metal with zero percent rates for too long all because inflation is only transitory. And, those three percent 30-year mortgages are probably going to keep a foot on the gas petal for about a decade or two.\n\nThey may have to keep rates at 5 or 6 percent for many more years, or do some meaningful QT to get the balance sheet back to about $4 trillion and then lower rates because too much QT would be too damaging. If they have to change rates, they probably will only increase or decrease about 25 basis points maybe only once or twice a year.  Ten years from now, rates may still be at 5.5% and mortgage rates about 7% and maybe inflation still at 3 or 4 percent if they are happy with that much inflation.",
                  "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6j2gv2/",
                  "created": 1717187655,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6jccq4",
                      "score": 4,
                      "body": "Man if inflation is at 3 or 4 percent in ten years people will start eating eachother.\n\nFed is playing it cool by waiting at this level now on the hopes that it sorts out, but I hope they have a \"buck stops here\" moment if we make no progress in 6 months.\n\nAnd yes, it's more about they are on the brakes heading into a red light, but we all know the light goes green eventually and you don't wanna be the only car with no velocity when that happens - get left in the dust.",
                      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6jccq4/",
                      "created": 1717191330,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6nrszj",
                          "score": 3,
                          "body": "When you are left behind, you are abandoned",
                          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6nrszj/",
                          "created": 1717266696,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l6nt0ut",
                              "score": 2,
                              "body": "100%.\n\nWhat this whole thing has taught me is that inflation is targeted at 2% because the rate of people who starve out are not enough to cause uprisings.\n\nWe had some decade of inflation in a year or two, and that's what has so many people way more pissed off than usual (among other things..  but at the end of the day I think financial insecurity drives patience out of the best of us). And we won't have deflation to get us back because that can kill economies (except for some things on their own times, like we saw some durable goods deflation).\n\n\nIt taught me that, by design, the economy leaves people behind, just at a tolerable rate for society. So you gotta take care to not be in that group, because apparently we can't afford those life preservers.",
                              "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6nt0ut/",
                              "created": 1717267148,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l6ntx3j",
                                  "score": 2,
                                  "body": "When power is centralized, wealth is only for the service of that small group of people, in their eyes, money is just a tool with which to control others, the tool is in their hands, so naturally it's in their shape, and sooner or later, this will bring about the collapse of society",
                                  "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6ntx3j/",
                                  "created": 1717267482,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l6kehqn",
                      "score": 3,
                      "body": "I think it's dangerous to assume things will follow the one scenario you have in mind and instead think about all the possible scenarios and their probabilities. Aka expected value type thinking.\n\nThere doesn't seem to be a lot of negativity in the market about staying higher for longer. We saw rate cuts come off the table for this year and yet market goes up anyway.\n\nI think it's not correct to rule out the possibility of a recession in the next 6-12 months and rate cuts. The consumer has nearly burned through their excess savings from the pandemic money helicopter. The consumer is way more important than the Fed balance sheet.",
                      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6kehqn/",
                      "created": 1717207270,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6l8olo",
                          "score": 1,
                          "body": "Currently I plan for anything by allocating investments between real estate, stocks and short bonds. As soon as I see a recession starting to happen, I plan to sell t-bills and buy middle or longer maturity bonds. If the US dollar starts a trend to get stronger, I plan to sell some foreign stocks and buy more domestic S&P 500 stocks.  If trade tariffs become more disruptive, I plan to sell a little more stocks and buy more short term bonds or t-bills because inflation or stagflation will probably get a lot worse.\n\nMy main worry is that owners are making a lot of money the way things are, and the long term renters and poor are getting left further behind to the point of getting priced out of the rental market. Many working poor may start quitting their job(s) and move far away to live in shanty towns.  It seems cruel to invest trillions in AI and not do any incentives for builders to intentionally overbuild so vacancy rates can drive down the price of housing.\n\nThe housing shortage and inflation is a worry because I care about others. Many people I know are priced out and have no retirement savings.  If people here want to be selfish, then think about what happens when the priced-out get together and decide to take some collective political action that probably everyone here at r stocks isn't going to like.\n\nEdit: replace \"dollar starts a trend to decline\" with \"dollar starts a trend to get stronger\"",
                          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6l8olo/",
                          "created": 1717223512,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l6mlbzh",
                              "score": 1,
                              "body": "You took a pretty hard turn there at the end. For what it's worth, I don't disagree with you that housing is a problem. I'm just not sure such a view will be helpful to making money in the stock market..\n\nI try not to let my personal views cloud my judgement about what **will** happen.\n\nAnyways, I'm loading up on TLT now so I guess I'm happy you exist because you will be one of the folks driving up the prices for me :)",
                              "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6mlbzh/",
                              "created": 1717251027,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l6o51nz",
                                  "score": 1,
                                  "body": "I understand your bearish view that a recession could happen and rate would have to be lowered and long bonds would skyrocket in price. That is why most investors should own both stocks and bonds.\n\nBut currently I'm really afraid to buy long bonds because the economy still seems overheated. I keep checking the weekly DOL new unemployment claims almost every week and it seems a cyclical recession isn't started. I've noticed the GDP isn't as high as it was months ago, but I doubt is the Fed can do some serious rate cuts if inflation isn't gone and unemployment isn't skyrocketing and stock earnings are still healthy.  I also worry that trade tariffs and the current decline in net exports may cause inflation or stagflation.\n\nI currently enjoy the t-bill rates and the growth in stocks, and I keep watching when it's time to sell t-bills and buy longer bonds or more dividend stocks if there is a big correction.",
                                  "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6o51nz/",
                                  "created": 1717271738,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l6h6nak",
                  "score": -7,
                  "body": "But, why? Why aren't we happy sustaining a 2% inflation give or take. Target is 2.4% and we are still above.\n\nWhat's bad about low single digit % inflation?\n\nFuck me, I could use some deflation but I know that's BaD fOr tHE EcONomY.",
                  "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6h6nak/",
                  "created": 1717163694,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6h7s1h",
                      "score": 13,
                      "body": "Because the Fed's role is to literally avoid a recession in their dual mandate -- price stability and maximum employment.\n\nA recession would wreck the economy, cause high unemployment, and crash the markets.  Breaking stuff more is not the fix that you think it is.\n\nYou can always tell when someone didn't live through the effects of 2008",
                      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6h7s1h/",
                      "created": 1717164115,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l6htdiq",
                      "score": 1,
                      "body": ">Fuck me, I could use some deflation but I know that's BaD fOr tHE EcONomY.\n\nIf there is deflation you won't have a job. Would you rather that houses/rent come down ~10% and you not have a job or the current situation?",
                      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6htdiq/",
                      "created": 1717171755,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6iy5wq",
                          "score": 3,
                          "body": "Actually only a small percentage of Americans lose their job during recessions. But inflation will come down for everybody. The same symmetrical trade off as today, where a small percentage of unemployed Americans are now employed, at the expense of higher inflation for everyone.",
                          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6iy5wq/",
                          "created": 1717186099,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l6jc88e",
                              "score": -1,
                              "body": "> Actually only a small percentage of Americans lose their job during recessions. \n\nOp talked about deflation, not a recession. One definition of a recession is when the GDP shrinks for 2 consecutive quarters. We had that in 2022 but we didn't have a recession because the unemployment rate stayed high (I guess technically because the people who declare recessions didn't say so but that sounds a bit like 'I won because I was awarded the gold medal'). In 2009 we had a recession but deflation was only at .36% (or -.36% inflation if you prefer). \n\nWhen the person I responded to says 'I could use some deflation' I interpret that as -2% inflation or less (more deflation). Considering how bad it got in 2009 I think that it is reasonable to say that 2% deflation means crazy unemployment.",
                              "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6jc88e/",
                              "created": 1717191282,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l6jey7n",
                                  "score": 3,
                                  "body": "And you talked about jobs, which is a recession (at least it's the biggest criteria for the NBER when they date one). If there's no recession, there's no reason why he'd lose his job just because we have deflation. Even if we have a recession, he'd most likely keep his job.\n\nIn 2015, we had peak -0.2% CPI YoY. Peak CPI YoY deflation in Jul 2009 was -2.1%, while wages continued going up 3% over that timeframe. Unemployment rate only went up 5.7%. 5.7% is a small percentage of Americans losing their job.\n\nLet's compare that to post-COVID. unemployment dropped to 3.4% from an equilibrium of roughly 4-4.5%, a 1% drop. For trade-off, inflation went up from 1.8% to almost 6% (PCE)",
                                  "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6jey7n/",
                                  "created": 1717192332,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l6jf5w3",
                                      "score": -1,
                                      "body": "> And you talked about jobs\n\nI said 'If there is deflation you won't have a job.'",
                                      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6jf5w3/",
                                      "created": 1717192414,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l6jfrbu",
                                          "score": 3,
                                          "body": "and why won't he have a job if there's a (-2%) deflation?",
                                          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6jfrbu/",
                                          "created": 1717192646,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l6i1fxt",
              "score": 1,
              "body": "because lower rate => economic growth, even if it is not the type you might like (eg. selling houses back and forth to each other), why borrow high when you can wait and borrow low",
              "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6i1fxt/",
              "created": 1717174584,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l6he0dz",
          "score": 2,
          "body": "Ok, no rate cuts, but what does that mean? Estimates say we‘re having rate cuts this year, will stocks tank? Will they stay where they are?",
          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6he0dz/",
          "created": 1717166368,
          "depth": 1,
          "replies": [
            {
              "id": "l6hf02o",
              "score": 5,
              "body": "The typical playbook for election year is correction/pullback in the summer, then rally towards fall, then another correction in Sept/Oct and then rally post election.\n\nI think sp500 ending the year at 5400 would be a very optimistic scenario, and post-election rally tends to be 15-20%, so there's a high chance we see sp500 correcting to 4600-4800 before then.\n\nSp500 seems to pay attention to 10 year rate when it goes above 4.5%, so that's the key level. If the fed brings back talk about rate hikes, even if they don't plan on doing it, sp500 doesn't like it either.\n\nObviously the high flyers like AI and big cap tech will correct more than others when sentiments suddenly shift to negative",
              "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6hf02o/",
              "created": 1717166719,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l6nsv65",
              "score": 0,
              "body": "After the interest rate cut, inflation will grow at a high rate again, and it's true that you'll have more money in your hands, but this will be worth even less",
              "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6nsv65/",
              "created": 1717267089,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l6noyxf",
          "score": 1,
          "body": "Where did you find the more precise 0.249% number? i don't see it in the Nick Timiraos link you mentioned.",
          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6noyxf/",
          "created": 1717265662,
          "depth": 1,
          "replies": [
            {
              "id": "l6npgp0",
              "score": 3,
              "body": "https://fred.stlouisfed.org/series/PCEPILFE\n\nDivide April vs March",
              "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6npgp0/",
              "created": 1717265843,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l6h1s0t",
          "score": 0,
          "body": "It seems awfully suspicious that it came in at .249% so they could round down.  I think someone may have done a dirty deed.",
          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6h1s0t/",
          "created": 1717161814,
          "depth": 1,
          "replies": [
            {
              "id": "l6h3lt7",
              "score": 2,
              "body": "the process is done individually for various items so it's unlikely, although since the actual number is so close, the news can spin the narrative in a completely different way. \n\nGoing up an extra 0.01% and rounding up to 0.3% month over month would've made the headline news as \"inflation still heating up\", and going from 0.3% down to 0.2% is a much bigger change on the surface than the actual number.",
              "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6h3lt7/",
              "created": 1717162537,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l6phy1s",
              "score": 1,
              "body": "conspiracy nut has been identified.",
              "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6phy1s/",
              "created": 1717291857,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l6hy8jd",
          "score": 2,
          "body": "Is the 2% target realistic considering our debt/deficit spending driven economy?",
          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6hy8jd/",
          "created": 1717173468,
          "depth": 1,
          "replies": [
            {
              "id": "l6hz8ue",
              "score": 3,
              "body": "if gov spending is out of control, the Fed needs to be even more hawkish to reign it in, sorta a balance and check if you will. Otherwise inflation expectation will get out of control, and 1980 recessions will repeat. It's definitely possible, but what is the fed fund rate needed to achieve that?\n\nThey're making a compromise by extending the time horizon to achieve the 2% inflation target (so not explicitly raising the target, but pseudo raising it by allowing a potential recession/slowdown in the future to bring inflation all the way down). They can only continue doing that while inflation expectation remains low. How long will that continue if inflation continues to be almost 3% for years.",
              "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6hz8ue/",
              "created": 1717173821,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l6gvw4o",
      "score": 2,
      "body": "The key thing to remember is inflation is a rate of change. Inflation is still increasing, just not as fast as the previous year. \n\nWhich is why people still feel like money is tight even though the data shows inflation easing.",
      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6gvw4o/",
      "created": 1717159378,
      "depth": 0,
      "replies": [
        {
          "id": "l6h23sa",
          "score": 29,
          "body": "Ordinary people don't think about the economy's state in terms of inflation, but aggregate prices. So money *is* tight.",
          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6h23sa/",
          "created": 1717161944,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6gyxfh",
          "score": 44,
          "body": "Inflation isn’t increasing. Inflation has been decreasing/flat. You mean price levels are still increasing?",
          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6gyxfh/",
          "created": 1717160671,
          "depth": 1,
          "replies": [
            {
              "id": "l6hdmwr",
              "score": 35,
              "body": "Of course the top rated comment on this thread is a guy “reminding” people of incorrect definitions.\n\nInflation is the rate of price increases. \n\nInflation is *not* increasing, prices are. However, the Fed is not trying to stop prices increases. They want to slow the speed at which they’re increasing, and we’ve kind of stalled around +0.7% over target.",
              "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6hdmwr/",
              "created": 1717166236,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l6h409g",
          "score": 7,
          "body": "people feel money is tight because wages since 2020 still hasn't kept up with inflation compared to its pre-COVID trend. Typically wages outgrew inflation by roughly 1.5%.",
          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6h409g/",
          "created": 1717162692,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6gywl3",
          "score": -7,
          "body": "So we need 0% inflation for a few years",
          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6gywl3/",
          "created": 1717160662,
          "depth": 1,
          "replies": [
            {
              "id": "l6gzrwx",
              "score": 8,
              "body": "Then people would park their money in HYSA instead of stocks and the economy would nosedive faster than you can say “oops”.",
              "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6gzrwx/",
              "created": 1717161019,
              "depth": 2,
              "replies": [
                {
                  "id": "l6gzzi0",
                  "score": 5,
                  "body": "And maybe that’s what we need. Asset prices need to come down.",
                  "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6gzzi0/",
                  "created": 1717161105,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6h07w3",
                      "score": 7,
                      "body": "For sure, but that wouldn’t just bring asset prices down. It would cripple investment.\n\nWe’re talking using a hammer to restart a computer.",
                      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6h07w3/",
                      "created": 1717161197,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6hhyyl",
                          "score": 4,
                          "body": "Yea.. they are missing the part where crippling investment means crippling jobs. Doesn't do any good for prices to come down if everyone is unemployed.",
                          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6hhyyl/",
                          "created": 1717167765,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l6j9jkn",
                          "score": 1,
                          "body": "I mean I’ve hit my computer plenty of times after a blue screen and it worked again",
                          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6j9jkn/",
                          "created": 1717190259,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l6hgwfv",
                  "score": -4,
                  "body": "If they are optimal folks. People that buy Bitcoin will still buy Bitcoin. People that buy beer and scream at the TV will still buy beer and scream at the TV.",
                  "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6hgwfv/",
                  "created": 1717167387,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6i1thy",
                      "score": 1,
                      "body": "I would include big money in “optimal folks”.",
                      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6i1thy/",
                      "created": 1717174714,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l6h2bzk",
              "score": -5,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6h2bzk/",
              "created": 1717162033,
              "depth": 2,
              "replies": [
                {
                  "id": "l6h4t6o",
                  "score": -2,
                  "body": "Raise minimum wage? Nah.",
                  "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6h4t6o/",
                  "created": 1717163002,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6hbs35",
                      "score": -1,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6hbs35/",
                      "created": 1717165571,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6hd8h3",
                          "score": 1,
                          "body": "The right thing to do is not have huge spending when the economy is overheating. Yes Biden screwed us twice, first with the 1 trillion stimulus in 2021 when inflation was heating up and we were past the covid recovery, and the second time with the spending bill in 2022 when we were fighting inflstion. And I'm not even a trump supporter, but just want something else other than these 2",
                          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6hd8h3/",
                          "created": 1717166095,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l6hi2gx",
                              "score": 1,
                              "body": "[deleted]",
                              "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6hi2gx/",
                              "created": 1717167800,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l6hjehd",
                                  "score": 1,
                                  "body": "US debt went from 28trillions to 34 trillions since 2021, and obviously is now on a much steeper/unsustainable slope than pre-COVID. wouldn't exactly call that \"pennies\". \n\nIt's also ironic that you said inflation is the solution to fix the national debt, when obviously inflation played a big part in ballooning that debt over the last 3 years.",
                                  "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6hjehd/",
                                  "created": 1717168275,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l6o4bfq",
      "score": 1,
      "body": "The problem is this number is not reproducible or verifiable. They should release detailed spreadsheet or code that pops this number out instead of putting it in tables and we take it for granted! The key is to start with a verifiable inputs that people can verify easily, like egg prices in their grocery store.",
      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6o4bfq/",
      "created": 1717271469,
      "depth": 0,
      "replies": [
        {
          "id": "l6ocaly",
          "score": 1,
          "body": "I looked at Table 2.4.4U link from the [PCE report](https://www.bea.gov/news/2024/personal-income-and-outlays-april-2024), and had to click \"Modify\" and select \"2024 Q & M\" to be able to see January through April 2024 data.  I've been able to see that the goods and services I tend to spend money on have gone up in the past 12 months through April of 2024. Many things such as housing and insurance and a few others are up about 5% to 11%, much more than the 2.8%. The cable service and phone service are about the same or maybe down 0.2%.  Overall I guess the prices are very accurate for each category.  But I think my cost of living has gone up more than PCE says it has because they don't put as much weight in housing costs as CPI does.\n\nA reason they won't say exactly where they collect the data maybe that they don't want the stores or clinic they collect the data from to change the prices just to manipulate the government data. The BEA would be embarrassed to find that the data they collected wasn't accurate.",
          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6ocaly/",
          "created": 1717274491,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6h62uf",
      "score": 0,
      "body": "Core PCE printed 0.249% and rounded DOWN to 0.2% \n\nImagine if we had 0.1bp more? Narrative would be a monthly print of 0.3% again.",
      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6h62uf/",
      "created": 1717163484,
      "depth": 0,
      "replies": [
        {
          "id": "l6hehn2",
          "score": 10,
          "body": "It works both ways. Core CPI rounded up.",
          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6hehn2/",
          "created": 1717166538,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6iyr0e",
      "score": 1,
      "body": "These federal bean counters make the numbers work the way they are told to work.  ",
      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6iyr0e/",
      "created": 1717186310,
      "depth": 0,
      "replies": [
        {
          "id": "l6o4tze",
          "score": 1,
          "body": "This!",
          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6o4tze/",
          "created": 1717271659,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6jjmpy",
      "score": -1,
      "body": "Reddit slurpin d1ks and drinking soy is moving too slowly.  Can’t seem to delete my account offf this mellinial cricle jerk.",
      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6jjmpy/",
      "created": 1717194189,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6nrfwm",
      "score": 0,
      "body": "It hasn't faded. It's been running forward.",
      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6nrfwm/",
      "created": 1717266563,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6hh6lm",
      "score": -11,
      "body": "CPI is important...no wait, the fed only looks at Core...oh wait thats bad, uh, the Fed has PCE as their \"preferred\"...no wait, its 6 month rolling CPI. Hm, which one is going to look best next month? None of them? Ok, just say we neither see stag nor inflation! That will keep em busy!\n\nEverything consumers would like to buy still at a near breaking point? Tell them they clearly aren't seeing the benefits of our economic policy! Gaslight them!",
      "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6hh6lm/",
      "created": 1717167486,
      "depth": 0,
      "replies": [
        {
          "id": "l6ihxws",
          "score": -1,
          "body": "lol where did the downvote brigade come from? How is this stuff not hilarious? The preferred measurement literally changes every other year! Last fed Meeting Jpow slapped the BLS in the face referring to 3rd party websites over government jobs data. And the market hasn't cared about these numbers anyway. \n\nPCE is pretty much calculated out of CPI and PCI, so the results were kinda known given this comes after those. \n\nI'm liberal as hell but some of the congressmen coming out saying \"the voters simply don't understand how the economy is doing great\" is pretty rude. The folks that are struggling see that as simply not listening. \n\nAre yall sore trying to buy the dip today? Can't have a simple 5% normal retracement?",
          "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6ihxws/",
          "created": 1717180327,
          "depth": 1,
          "replies": [
            {
              "id": "l6j9jgq",
              "score": 1,
              "body": "This is totally on the way you put your post. It just sounds totally sarcastic.\n\nBTW: If this was being treated as a poor inflation report, yields wouldn't have been down. The reason why tech stocks especially got buried initially in the session was totally on other things, most specifically being DELL's earnings report I think (with the Chicago PMI not helping).\n\nSeriously, check the QQQ and TLT pair. It generally has not worked for over 12 months now after it worked perfectly from February 2021-February 2023. The pair that works better is IWM and TLT, and it's starting to not work all that well either.",
              "permalink": "/r/stocks/comments/1d4uk6v/pce_data_inflation_maybe_going_away_too_slowly/l6j9jgq/",
              "created": 1717190258,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}