{
  "title": "Sentiments about CRWD?",
  "score": 36,
  "selftext": "Hello everyone.\n\nCrowdstrike’s Earnings are coming out next week. Since the past 4+ Quarters they have consistently beaten Analyst estimates due to which their price has risen after earnings reports. \n\nConsidering the market volatility at the end of this week, CRWD’s red performance in the past two days but CRWDs mind blowing performance in the past, what do you guys think?\n\nMost firms rate it as a Strong Buy/Overweight which seems quite logical considering its performance and the whole AI Scenario going on. Average price estimates are around $400.14 which is about $92+ on current price. \n\nAnalysts expect itto report adjusted earnings of 89 cents a share, up 56% from a year earlier. Revenue is seen climbing 31% to $905 million.\n\nIs this a good buy before earnings or not?",
  "link_flair_text": "Company Discussion",
  "id": "1d52o6x",
  "num_comments": 35,
  "created_utc": 1717180399,
  "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/",
  "comments": [
    {
      "id": "l6itmhg",
      "score": 16,
      "body": "I know a guy that works there, they're doing well, and I keep it on my watchlist.  It has wild price swings throughout the day +-$12 and it doesn't really reflect the overall market. In the past few months I've made a decent amount playing with the options. \n\nI thought $325 was a steal this morning and then it dropped further, after what happened to Dell I'm hesitant to do anything with it for a while.",
      "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6itmhg/",
      "created": 1717184466,
      "depth": 0,
      "replies": [
        {
          "id": "l6ji4pu",
          "score": 3,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6ji4pu/",
          "created": 1717193588,
          "depth": 1,
          "replies": [
            {
              "id": "l6jom6c",
              "score": 1,
              "body": "You work there?",
              "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6jom6c/",
              "created": 1717196213,
              "depth": 2,
              "replies": [
                {
                  "id": "l6jp2qb",
                  "score": 10,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6jp2qb/",
                  "created": 1717196400,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6k8jy5",
                      "score": 18,
                      "body": "Hey that’s insider trading!!! I’m telling my mom!",
                      "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6k8jy5/",
                      "created": 1717204622,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6mdfus",
                          "score": 6,
                          "body": "Complain to your congressperson",
                          "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6mdfus/",
                          "created": 1717247734,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l6nijij",
                              "score": 3,
                              "body": "> congressperson\n\nThey are loaded too lol",
                              "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6nijij/",
                              "created": 1717263345,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l6njmyx",
                                  "score": 2,
                                  "body": "umm SC?",
                                  "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6njmyx/",
                                  "created": 1717263736,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "l6z97rj",
                              "score": 2,
                              "body": "Congressperson loads up on the stock heavy \n\nAnd then asks for more insider info ;)",
                              "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6z97rj/",
                              "created": 1717453015,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l709slm",
          "score": 1,
          "body": "DELL... and PANW.",
          "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l709slm/",
          "created": 1717467773,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6me1da",
      "score": 9,
      "body": "CRWD, PANW, and GOOGL are the most complete cyber companies. Massive consolidation is ongoing. They’re going to come out of it winners.",
      "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6me1da/",
      "created": 1717247984,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6lra1o",
      "score": 8,
      "body": "When looking at analysts predictions and price targets you can see their past record if you’re using something like TipRanks (or most websites really) - you’ll find that pretty much all of them have atrocious records.\n\nNever trust analysts - they move in herds and in reaction to price like your average Joe - they’ll upgrade at all time highs and downgrade at all time lows. Don’t pay any attention to them.",
      "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6lra1o/",
      "created": 1717236283,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6ijg7s",
      "score": 13,
      "body": "If something is down substantially, people have to look at what the rest of the sector looks like. Software has had a HORRIBLE week, the sector ETF was down 5.5% yesterday. Most of software is going to head lower in sympathy with that kind of a week, it doesn't matter fundamentals.\n\nI own it, am pondering adding a little. View it as a long-term holding, don't really think about it much on a day-to-day basis (and in the decline in the last few days, not really that concerned because I see this more as the sector getting obliterated and not much a fundamental issue - ZS earnings were pretty decent yesterday.)",
      "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6ijg7s/",
      "created": 1717180853,
      "depth": 0,
      "replies": [
        {
          "id": "l6im1dl",
          "score": 2,
          "body": "I agree with you. Why do you see the sector getting obliterated though? And, ZS did rise to $174 but then got crushed again so didn’t earnings report make a positive impact anyways?",
          "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6im1dl/",
          "created": 1717181764,
          "depth": 1,
          "replies": [
            {
              "id": "l6in967",
              "score": 5,
              "body": "> Why do you see the sector getting obliterated though?\n\nBecause you have large names in software getting obliterated to the point where most of software is being sold with it and some of that is going to be indiscriminate selling - things get sold off in sympathy if enough names in that sector get sold hard enough (CRM having one of the worst days in the company's history, MDB had a horrid quarter yesterday, other names sold off substantially after earnings - PATH, VEEV, etc.) and that sometimes can create some opportunities. ZS is still up 7%, which isn't bad when the software etf is down 6.5% or so (which is a very sizable move for a sector ETF) in two days.",
              "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6in967/",
              "created": 1717182192,
              "depth": 2,
              "replies": [
                {
                  "id": "l6jsznr",
                  "score": 3,
                  "body": "Similarly, people might use one company’s report as a clue about similar companies. Last November Walmart [warned](https://www.reuters.com/business/retail-consumer/walmart-lifts-targets-shoppers-pick-low-priced-groceries-holiday-2023-11-16/) of a possibly tepid Christmas shopping season. Kroger, another retailer who hadn’t reported yet, dropped 5% based on Walmart’s news. ",
                  "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6jsznr/",
                  "created": 1717197994,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l6iv3n1",
                  "score": 1,
                  "body": "This can be a good opportunity though as ELF gaining 20% on earnings because other beauty stocks were holding it down",
                  "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6iv3n1/",
                  "created": 1717184996,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l6kl6ck",
      "score": 4,
      "body": "I bought some of CRWD and NET this week when they dipped, the price was a good entry point for me. CRWD has solid financials, NET is getting closer to profitability but with both stocks my logic was that companies will be investing into AI, data centres and networks so they’ll need to have solid infrastructure and cybersecurity. They will need to be maintained now and in the future, both of them are positioned well to take some advantage from it. \n\nI just wasn’t able to add them to my portfolio last year because I had other expenses to cover, so I felt like I missed out when I saw their prices. But now I’ve added them and they take up like 6% of my portfolio.",
      "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6kl6ck/",
      "created": 1717210377,
      "depth": 0,
      "replies": [
        {
          "id": "l6klutq",
          "score": 3,
          "body": "Thanks! So insightful. I’m a 18 year old and just started investing (for short term fast profits) few months ago. I made good money earlier but lost almost all the profit by buying Dell before the earnings call. Now I wanna make a quick buck on CRWD Earnings",
          "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6klutq/",
          "created": 1717210700,
          "depth": 1,
          "replies": [
            {
              "id": "l6kn42e",
              "score": 3,
              "body": "I set a bit of play money aside for some quick change, currently got some in SMCI. With CRWD I’d say be a bit careful, after the recent battering of some tech/ cybersecurity stocks I’m going long. I think the key is their guidance; if they expect higher revenue of growth like 12% then there could a green. They could beat EPS and have positive net income for the quarter but I think the algos care little for that right now.",
              "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6kn42e/",
              "created": 1717211306,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l6klzre",
          "score": 1,
          "body": "I held net for a long time even after the 200+ insanity. Just sold recently before this recent dump. \n\nBut honestly I think I'm going to load up again",
          "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6klzre/",
          "created": 1717210766,
          "depth": 1,
          "replies": [
            {
              "id": "l6kmn92",
              "score": 1,
              "body": "I think it could return close to that in the next 3 years. It’s good market share in and it’s fairly reputable, plus they announced a partnership with CRWD. I just don’t want there to be crazy growth expectations and make others believe it’s the next NVDA or TSLA because it’s not. But being in cybersecurity is a fast-growing industry, technological advancements are so rapid now and we’ll need this cybersecurity.",
              "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6kmn92/",
              "created": 1717211081,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l6nxcaa",
      "score": 5,
      "body": "I'm concerned about the insanely high P/E.",
      "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6nxcaa/",
      "created": 1717268806,
      "depth": 0,
      "replies": [
        {
          "id": "l6qi68z",
          "score": 3,
          "body": "It’s expensive, but they aren’t optimized for earnings, so I’d look at EV to Revenue or Price to Sales as valuation metrics.",
          "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6qi68z/",
          "created": 1717311199,
          "depth": 1,
          "replies": [
            {
              "id": "l6qipdr",
              "score": 3,
              "body": "Could be. My personal sentiment is that people will use earnings to sell it off as they realize how overweight it actually is. But that's just me and I'm a regard.\nStill, I plan to buy some puts ahead of earnings. Seeing the sentiment in here maybe I'll make them leaps lol.",
              "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6qipdr/",
              "created": 1717311576,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l6imo7s",
      "score": 5,
      "body": "I'm holding very long term",
      "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6imo7s/",
      "created": 1717181987,
      "depth": 0,
      "replies": [
        {
          "id": "l6ix5m9",
          "score": 3,
          "body": "Same. It's been a near triple for me. If it sells off after earnings I'll add to it. ",
          "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6ix5m9/",
          "created": 1717185729,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6k6j5r",
      "score": 2,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6k6j5r/",
      "created": 1717203744,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6qcvpq",
      "score": 1,
      "body": "Honestly I don't think it could be too bad. I've gotten bullish on software in the last week or so and have picked up a few. Including a ton of CRM on Thursday.",
      "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l6qcvpq/",
      "created": 1717307635,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l717gwv",
      "score": 1,
      "body": "Their Free Cash Flow Yield sucks a, if their growth have gone down their valuation can’t be justified.",
      "permalink": "/r/stocks/comments/1d52o6x/sentiments_about_crwd/l717gwv/",
      "created": 1717486536,
      "depth": 0,
      "replies": []
    }
  ]
}