{
  "title": "Scotts Miracle-Gro (SMG): What is their edge, and what are their risks?",
  "score": 32,
  "selftext": "According to Gurufocus, SMG is the largest manufacturer of plant food in the US. I’m guessing (and I could absolutely be wrong) that this means the housing market is a big indicator of how well they’re likely to perform, since more homes = more lawns to fertilize.\n\nThat said, it seems like they’ve taken a beating since their COVID surge when everyone was at home and could care for their lawns, so much so that they’ve now lost a decade of gains and are back to where their price was in 2014-15 (they’re just below 70 right now, although their 52W low went as far down as 43.67).\n\nAnyone familiar with the company willing to share some info?",
  "link_flair_text": "Company Discussion",
  "id": "1d5wj1m",
  "num_comments": 33,
  "created_utc": 1717275029,
  "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/",
  "comments": [
    {
      "id": "l6ogfxe",
      "score": 68,
      "body": "Horrible company. Distributor of Roundup and plagued by its liability claims. 300 million pounds of glyphosate dumped on lawns and crops annually. History of EPA pesticide violations. Persecuted their own employees by implementing nicotine testing as a way to preemptively fire them before they became liable for workplace induced illness. Company was so beat down the second generation of the family wanted to sell because they felt the business immoral. Now, true to this unconscionable record, they try to resurrect themselves as of all things a cannabis play.\n\nHate them, hate the mindset, hate the stupid commercials.",
      "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6ogfxe/",
      "created": 1717276013,
      "depth": 0,
      "replies": [
        {
          "id": "l6oiugv",
          "score": 50,
          "body": "Uh ok Debbie downer but how am I supposed to keep my lawn an unnaturally perfect monoculture to show up that bitch Janice across the street? \n\nDidn’t think about that did ya smart guy",
          "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6oiugv/",
          "created": 1717276930,
          "depth": 1,
          "replies": [
            {
              "id": "l6ojn7p",
              "score": 7,
              "body": "I've given up on the battle with my lawn. The damn St Augustine won",
              "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6ojn7p/",
              "created": 1717277242,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l6rzwj6",
              "score": 1,
              "body": "Artificial turf!",
              "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6rzwj6/",
              "created": 1717341956,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l6r01ss",
          "score": 4,
          "body": "[removed]",
          "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6r01ss/",
          "created": 1717324455,
          "depth": 1,
          "replies": [
            {
              "id": "l6rlj3f",
              "score": 1,
              "body": "https://www.cbsnews.com/news/bayer-roundup-legislation-shield-cancer/\n\nWhen the lawsuits started around 2018, Scotts stopped distributing Roundup for Bayer. They issued the obligatory corporate statement regarding their concern for the safety of consumers and now promote their \"new\" non selective weed killing product Ortho GroundClear. Guess what it contains? Watered down glyphosate, plus imazapyr for a longer term residual activity, at get this, twice the price",
              "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6rlj3f/",
              "created": 1717336180,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l6srp5k",
          "score": 3,
          "body": "So you are saying, it's a MIRACLE if they GROW",
          "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6srp5k/",
          "created": 1717352316,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6okf99",
      "score": 8,
      "body": "Hmm I wouldn't think housings market is a good comparison.. In my mind, houses are already there. Whether you are a new home buyer or existing owner, you need to take care of your lawn. So whether home purchases are going up or down shouldn't really matter.",
      "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6okf99/",
      "created": 1717277548,
      "depth": 0,
      "replies": [
        {
          "id": "l6pm3f0",
          "score": 1,
          "body": "Most of my neighbors just let the weeds grow, just keep the grass short and they all look the same.. good for the bees and butterflies that help pollinate my garden. Also allows waps and birds to take care of aphids and other stuff.",
          "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6pm3f0/",
          "created": 1717293751,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6oxa55",
      "score": 27,
      "body": "Pros: none\n\nCons: they literally make poison",
      "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6oxa55/",
      "created": 1717282790,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6pa0qg",
      "score": 5,
      "body": "The surge you saw was more medical marijuana oriented..they built out Hawthorne which is like supplies for that field then the demand straight dried up..very fast..put them in debt ect..they are a bit more normalized now",
      "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6pa0qg/",
      "created": 1717288288,
      "depth": 0,
      "replies": [
        {
          "id": "l6rmt0x",
          "score": 1,
          "body": "The kicker is most weed growers avoid Miracle Gro. It turns the leaves yellow and inhibits flowering",
          "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6rmt0x/",
          "created": 1717336726,
          "depth": 1,
          "replies": [
            {
              "id": "l6uuis0",
              "score": 1,
              "body": "I was referring more toward like lighting and supplies ect.",
              "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6uuis0/",
              "created": 1717382220,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l6pgcdu",
      "score": 3,
      "body": "Me running to sell my shares of SMG after reading these comments like: 🏃🏼‍➡️\n\nAnd in case anyone is wondering, no I didn’t have any real logic in investing in it, just is a company that I heard about through my own work.",
      "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6pgcdu/",
      "created": 1717291123,
      "depth": 0,
      "replies": [
        {
          "id": "l6uunez",
          "score": 3,
          "body": "Don’t..inverse these subs always..only time I lose money is when I listen to them. Srs. Scotts been around longer than I been alive. \n\nCan you name another fertilizer company? I can’t. Bought in at like $40..good dividend payer",
          "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6uunez/",
          "created": 1717382278,
          "depth": 1,
          "replies": [
            {
              "id": "l6wus0m",
              "score": 1,
              "body": "I was more making a joke bc of all the negativity. I only have like $300 invested at like $53 so no huge reason to sell. I’m 24 so I can let the dividend sit for awhile too",
              "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6wus0m/",
              "created": 1717423519,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l6royz1",
          "score": 2,
          "body": "Look, to be fair I may be overly rough in my assessment. To some extent these companies are a necessary evil. I personally don't invest in Scotts because my investment philosophy is to more or less put the bottom line to one side and concentrate on the \"story\" of the company, in particular their leaders and management. It's the reason corporations are obsessed with DEI and ESG today, but mostly that's just lip service. You need to learn to see through the virtual signaling bullshit to the authentic character. I like to invest in interesting people who happen to run a successful company",
          "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6royz1/",
          "created": 1717337636,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6qu73w",
      "score": 3,
      "body": "Unconventional ceo.  Crazy!",
      "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6qu73w/",
      "created": 1717320064,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6r2lfv",
      "score": 3,
      "body": "\"edge?\"\n\nNot a whole lot.\n\nA CEO who says fuck, shit, bullshit or some other similar word on average at least once every conference call? lol\n\nThe decision to get into cannabis (which, so far, has been a disaster):\n\nThat controversial decision was made one day in 2013 in Yakima, Wash., when Hagedorn wandered into a garden center. The store had hardly any Scotts merchandise, but there was a massive row of equipment for hydroponics, a method of growing that allows people to cultivate cannabis (or any other plant, for that matter) indoors, using targeted lighting and liquid solutions spiked with nutrients. Hagedorn asked to see the store owner, and out walked a short guy with wild hair and a lazy eye. He told Hagedorn that everyone called him an idiot when he first started selling hydroponics equipment, but the stuff was flying off the shelves, with an average receipt of $400--straight cash. It was a starkly different scene from what he'd just witnessed at a Home Depot across town, which had plenty of Scotts Miracle-Gro products but no hydroponics equipment. \"Two worlds, same town. **I came back, and I told everyone 'We're doing it,' \" Hagedorn recalls. \"If you don't like it, leave. We're doing it. It's beyond stopping. And we're not getting into pot growing. We're talking dirt, fertilizer, pesticides, growing systems, lights. You know it's a multibillion-dollar business, and we've got no growth in our core. Are you guys stupid?\"**\n\nhttps://www.forbes.com/sites/danalexander/2016/07/06/cannabis-capitalist-scotts-miracle-gro-ceo-bets-big-on-pot-growers/\n\n\"That said, it seems like they’ve taken a beating since their COVID surge when everyone was at home and could care for their lawns, so much so that they’ve now lost a decade of gains and are back to where their price was in 2014-15 (they’re just below 70 right now, although their 52W low went as far down as 43.67).\"\n\nPart of that was the fact that the cannabis division has been a disaster. The bigger issue recently/last year was this: https://www.wsj.com/articles/scotts-miracle-gro-shortage-glut-inventory-fertilizer-11663261193\n\nThey went from a shortage during covid to a glut because they overproduced thinking the demand would continue and it didn't. (\"Scotts ramped up production during the pandemic, then consumers shifted and retailers slashed orders, leaving a pile of inventory. It’s now trying to dig its way out.\")",
      "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6r2lfv/",
      "created": 1717326208,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6ok2dj",
      "score": 10,
      "body": "They are literally killing the planet. They hate their own employees. They are scum of the earth.",
      "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6ok2dj/",
      "created": 1717277408,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6oocnv",
      "score": 3,
      "body": "A couple items that make it unattractive to me - First, they severely over invested in the cannabis industry and I doubt they’ll ever see a positive ROI from those investments/purchases.  Second, the ownership structure of the company.  As I see it, the Hagedorn family has control from a voting perspective and likely always will.  I suppose if you believe in management, it can be seen as a positive, as you know what you’re getting (and will for the foreseeable future).  Just my $.02",
      "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6oocnv/",
      "created": 1717279103,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6op3fb",
      "score": 2,
      "body": "Check out FMC instead.",
      "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6op3fb/",
      "created": 1717279400,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6opvol",
      "score": 2,
      "body": "They used to be a marijuna grow play as they sell fertilizers and equipment that leaf growers buy. only a few states left that have yet to legalize",
      "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6opvol/",
      "created": 1717279723,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6q2too",
      "score": 2,
      "body": "Based off these comments most middle and upper class people will be buying their lawn products like normal and this company will do just fine in the future alongside the clear path to federal legalization of marijuana",
      "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6q2too/",
      "created": 1717301870,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6r0nfi",
      "score": 2,
      "body": "I think they currently own the retail market. I see spend going up on pesticide as more and more homes/neighborhoods are maintained by companies. I think they are appropriately priced for the year. As in, I feel there is a 50/50 shot whether you gain or lose in the year. Any long term baked in pricing would come from strong quarterly earnings. Might be the cheapest you get it for awhile. But it could go down just from business processes and pesticide sentiment leaving. You never know. I think the price reflects the risk of both sides. And I don’t see it leaning strongly either direction",
      "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6r0nfi/",
      "created": 1717324878,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6t800y",
      "score": 2,
      "body": "I've never been very good with submachine guns. I just can't find the optional range. I'm either just far enough away to get picked off by a pulse or HC or I'm too close and get blown away by a shotgun. \n\nOh wait this isn't r/destinythegame",
      "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6t800y/",
      "created": 1717358369,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6ofs0r",
      "score": -4,
      "body": "What in the greenwashing is plant food lol",
      "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6ofs0r/",
      "created": 1717275765,
      "depth": 0,
      "replies": [
        {
          "id": "l6olfkn",
          "score": 11,
          "body": "Never heard of fertilizer?",
          "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6olfkn/",
          "created": 1717277943,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6omm71",
          "score": 3,
          "body": "It’s like how the chicken barons refer to the toxic chicken shit runoff from their farms as “nutrients”",
          "permalink": "/r/stocks/comments/1d5wj1m/scotts_miraclegro_smg_what_is_their_edge_and_what/l6omm71/",
          "created": 1717278412,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}