{
  "title": "I think SBUX is a buy. Are you bullish or bearish on boba?",
  "score": 127,
  "selftext": "Currently, the stock is down 36% from ATH. It's already turned around, though, at a support level of $72, as it did a few times in the past.\n\nIMO, Starbucks is simply an established household name. There may be some competitors in the US and elsewhere, but everywhere I've ever been, Starbucks is immensely popular. The lone fact that so many people are willing to spend $5-6 on a daily cup of coffee makes me optimistic on the brand, given that quality homemade coffee comes in at mere cents per cup.\n\nMy thoughts are that it doesn't have much downside at the moment. It yields a 2.84% dividend, and on another note, they recently announced a boba drink. Personally, I'm bullish on boba after visiting Cambodia.'\n\nEdit: I'm not buying it because of boba (hence the other reasons mentioned) but I do like me some balls in my drink",
  "link_flair_text": "Discussion",
  "id": "1d6d95f",
  "num_comments": 373,
  "created_utc": 1717334687,
  "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/",
  "comments": [
    {
      "id": "l6ri66u",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 3 months ago\n**Total Comments** | 216 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6ri66u/",
      "created": 1717334691,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6s3coy",
      "score": 187,
      "body": "Starbucks is the world's largest operator of free public toilets masquerading as a coffee store.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s3coy/",
      "created": 1717343274,
      "depth": 0,
      "replies": [
        {
          "id": "l6tt62b",
          "score": 28,
          "body": "I do my best shits after a tall Sumatra",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6tt62b/",
          "created": 1717366472,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6rlxge",
      "score": 116,
      "body": "I am a contractor that works on Starbucks. The rate of remodel and new builds has definitely slowed since a couple years ago. Stores are significantly smaller than they were a few years ago, by design. Not as much of a spot to sit and stay. Just get your coffee and go. \n\nI love boba tea, but not bullish on Starbucks. That said they aren't going anywhere either - the amount of people that go walking through a construction zone and past Store Closed signs just to try and get up to the store and ask if they're open when the entire inside is gutted so they can get their frufru coffee is insane",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rlxge/",
      "created": 1717336351,
      "depth": 0,
      "replies": [
        {
          "id": "l6s4kad",
          "score": 29,
          "body": "I’m guessing their change in store size and interior design is part of their growth plan. This may sound crazy but I saw a MCD commercial recently that was filmed circa 1960s and the restaurant reminded me of a Starbucks from 90s/early2000s.  Starbucks will likely continue becoming more corporate, plastic, and simply a mass producer of coffee drinks rather than a sit down establishment of high coffee culture (which it already isn’t) in order to drive shareholder value, just as McDonalds did. Disclosures: I’m long SBUX and a frequent customer.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s4kad/",
          "created": 1717343730,
          "depth": 1,
          "replies": [
            {
              "id": "l6vrz7e",
              "score": 3,
              "body": "“They lowered the square footage of their stores, wah” some solid DD. Can’t imagine why he’s a contractor",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6vrz7e/",
              "created": 1717401988,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l6vpzxf",
              "score": 2,
              "body": "I think you’re right as far as it being their growth plan. Smaller chains & independent shops provide a much better sit-down experience than Starbucks. Now that smaller shops have become ubiquitous in the U.S., Starbucks best bet is to compete on volume and price. Some folks just want a quick good coffee to go. \n\nI just don’t believe Starbucks is really that good. They might have a temporary edge is quick service higher end coffee, but it’s not that hard for a bodega to buy an espresso machine. It’s already common in Europe for little kiosks and bakeries to have them. Once it catches on in the U.S., Starbucks will need to reinvent themselves again. ",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6vpzxf/",
              "created": 1717400510,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l6rmh28",
          "score": 8,
          "body": "Haha that's hilarious. We definitely both agree that the brand isn't going anywhere. We'll have to wait and see if it keeps growing somehow or whether it slowly tapers out like many brands have in the past.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rmh28/",
          "created": 1717336583,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6sn40c",
          "score": 2,
          "body": "People gotta get their fix",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sn40c/",
          "created": 1717350638,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6rwqr5",
          "score": 2,
          "body": "I bought it at the dip because of this… what I see every day. Wife drinks SBUX like 5 times a week and I pick it up once or twice a week. The fucking line is half an hour some days… and this is with people cutting back on discretionary spending.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rwqr5/",
          "created": 1717340728,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6rna2p",
      "score": 185,
      "body": "I just like sucking tiny warm balls :000000",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rna2p/",
      "created": 1717336927,
      "depth": 0,
      "replies": [
        {
          "id": "l6rno94",
          "score": 37,
          "body": "This is what I’m saying",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rno94/",
          "created": 1717337093,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6s75x8",
          "score": 7,
          "body": "They're soft and chewy. I love them too.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s75x8/",
          "created": 1717344711,
          "depth": 1,
          "replies": [
            {
              "id": "l6sy26w",
              "score": 10,
              "body": "I like putting two in my mouth and using my tongue to juggle them around.",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sy26w/",
              "created": 1717354662,
              "depth": 2,
              "replies": [
                {
                  "id": "l6t0tui",
                  "score": 9,
                  "body": "https://preview.redd.it/e7k20l76k74d1.jpeg?width=329&format=pjpg&auto=webp&s=49c4ca6d4351d9c7d1240fa944a6525c3955a13a",
                  "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6t0tui/",
                  "created": 1717355685,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l6t0rsj",
          "score": 7,
          "body": "its june. we're supposed to...\n\nbut no 🌈🐻 shit! thats not allowed year round",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6t0rsj/",
          "created": 1717355663,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6rrqk3",
      "score": 24,
      "body": "TL;dr:  OP went to Cambodia so you should buy SBUX. ",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rrqk3/",
      "created": 1717338754,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6rlf5h",
      "score": 101,
      "body": "I could be wrong as this is totally anecdotal but if Starbucks can get their boba recipe right, this could really lock in some Asian market shares. It seems that the boba market across the US is still maturing and it could translate to higher sales. Often times the well known or good boba shops are only located in areas with higher Asian populations but with Starbucks’s real estate presence, it will make things very convenient to not have to drive/travel all the way to those areas just to get a good boba drink.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rlf5h/",
      "created": 1717336132,
      "depth": 0,
      "replies": [
        {
          "id": "l6s6boe",
          "score": 82,
          "body": "I guess it's all regional dependent. Living in a high Asian population spot it feels really weird that sbux would try to enter a market probably a decade after it's peak when the market seems wildly over saturated and closures have been more of the norm.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s6boe/",
          "created": 1717344393,
          "depth": 1,
          "replies": [
            {
              "id": "l6t1eft",
              "score": 14,
              "body": "exactly.\n\nwhy would i go to bland brittneigh's & beckie's boring boba boutique instead of the local joint....",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6t1eft/",
              "created": 1717355901,
              "depth": 2,
              "replies": [
                {
                  "id": "l6u160u",
                  "score": 12,
                  "body": "The product doesn’t need to please existing boba drinkers, it needs to let the Bryttneigh’s feel like they have multicultural taste. \n\nNone of their matcha items would please any fans of actual matcha, and yet they are tremendously popular. Getting actual matcha requires entering an unfamiliar cultural space which can be an intimidating experience for many avid Starbucks customers. Same with boba. I know many people who have gone into a boba shop, been completely overwhelmed by the number of options and unusual ingredients (ie in North America, aloe goes on your skin), and never went back.\n\nStarbucks’ whole business model is making people feel like they are getting something higher quality and international when it’s actually mass-produced and bland. If they get traction for boba, it will be huge for them.",
                  "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6u160u/",
                  "created": 1717369740,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6u1hed",
                      "score": 5,
                      "body": "\"arigato mr roboto\" after one sip",
                      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6u1hed/",
                      "created": 1717369872,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l6t3agu",
          "score": 8,
          "body": "They'll never get it right. Boba isn't about the boba but the tea and after so many years, sbux still couldn't get their coffee right.\n\nNow some people just want a sugary drink and not picky, but sbux already had multiple sugary drinks to capture that segment.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6t3agu/",
          "created": 1717356613,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6s0suw",
          "score": 20,
          "body": "Well, they're the McDonald's of coffee in that it's shitty and kind of expensive for what it is, but still prints money for the same reasons as McDonald's. They don't need to make good bubble tea to continue the model. They're just betting on the popularity of this product increasing, and just like they don't put good coffee shops out of business, they probably won't put good bubble tea shops out of business.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s0suw/",
          "created": 1717342301,
          "depth": 1,
          "replies": [
            {
              "id": "l6tfs4i",
              "score": 4,
              "body": "Agree it’s crap. And way too expensive. I like Tim Hortons much better and it’s $3 cheaper for the same thing",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6tfs4i/",
              "created": 1717361265,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l6s7p4w",
          "score": 18,
          "body": "I disagree with you here. Non-Asian people don’t drink boba in large quantities. Thats why you don’t see them in non-Asian areas. So you could have a product offering but your clientele wants vanilla ice lattes. Starbucks cannot compete with boba shops. There are just way too many.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s7p4w/",
          "created": 1717344913,
          "depth": 1,
          "replies": [
            {
              "id": "l6sf4t2",
              "score": 8,
              "body": "Disagree. Thr boba stores around me on the east coast nowadays are filled with nonasians. Even the ppl working there aren't Asian. However, I agree witchu that boba market is super saturated. The new hip stores are constantly, and very quickly, overshadowed by the newer, hipper stores.",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sf4t2/",
              "created": 1717347698,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l6sbzty",
              "score": 20,
              "body": ">Non-Asian people don’t drink boba\n\nYet. The American consumer is easy to manipulate and we are a viral marketing campaign about the health benefits of cassava root (tapioca) away from trending-erizing boba. \n>There are just way too many [boba shops]\n\nAgreed, but they aren’t located in malls, airports, or hotels. They’re usually in strip malls and rely on foot traffic for their adjacent storefronts, whereas as Starbucks is often the destination in and of itself.",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sbzty/",
              "created": 1717346533,
              "depth": 2,
              "replies": [
                {
                  "id": "l6tfygf",
                  "score": 2,
                  "body": "Uh depends what city you’re in. Metropolitan cities they absolutely do. The trend hasn’t taken off yet in these sleepy towns",
                  "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6tfygf/",
                  "created": 1717361332,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l6sf69s",
                  "score": 2,
                  "body": "Not exactly true. There is a boba stand in all 3 of the large malls in my metro area. Hell, there is two stand alone milk tea places within 3 miles of my home",
                  "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sf69s/",
                  "created": 1717347713,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6snh51",
                      "score": 2,
                      "body": "Fair enough. My anecdotal info is based on my metro area, where there are 3 Starbucks in the two malls I frequent and a boba spot in only one of them. I can acknowledge that I spoke in an absolute that may not be accurate.",
                      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6snh51/",
                      "created": 1717350771,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l6shxsn",
              "score": 10,
              "body": "Anecdotally. I live in a small suburban-rural town that is so white it’s actually creepy. Literally there might be less than .5% asian population. We have 2 boba shops and they always have cars out front.\n\nYou forget how much all American people love sugary drinks and snacks regardless of race. Boba is like a 2 for 1!\n\nAs for Starbucks offering it. I’m sure it will be something that sells okay, but I doubt this will translate into any significant growth in customers.",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6shxsn/",
              "created": 1717348743,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l6s7cxg",
          "score": 2,
          "body": "I mean they were meeting with 7 leaves back in 2020 to buy them out for like 1b similar to teavana. They decided against it and thought it wouldn’t be a good investment. Wouldn’t be surprised if they open up those talks again",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s7cxg/",
          "created": 1717344784,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6u28tt",
          "score": 2,
          "body": "I don’t know about America but here in Mexico there’s a shit ton of boba everywhere, a gong cha literally just opened 10 minutes from my house and there’s so many more I don’t see starbucks making even a dent there",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6u28tt/",
          "created": 1717370193,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6u3xnu",
          "score": 2,
          "body": "Wait, starbucks has boba? I rarely go to Starbucks, maybe twice a year, and if they had boba, I'd go weekly cus they're everywhere!",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6u3xnu/",
          "created": 1717370906,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6v5vk9",
          "score": 2,
          "body": "boba is around but it hasn’t hit big yet. if it is to ever hit big, that’s a question as well, and also if starbucks is going to win that. they are positioned well to take that market though, they have got to be the best bet. andi. do think boba will pop off here as well. i’m long for lil balls",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6v5vk9/",
          "created": 1717387730,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6rm7lu",
          "score": 5,
          "body": "It would make a huge difference. The boba market in the U.S. is absolutely growing. The vast majority of Gong cha and other boba shops in the US are in major cities. A reason for that could certainly be higher Asian populations in those areas. I think Starbucks needs to act quickly, before Gong cha spreads out into more rural areas. If they do, they can make use of their huge real estate presence, like you said, and command a big share of that market. Americans unfamiliar with boba will be more likely to try it first at a well-known spot like Starbucks than at a place they've never heard of.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rm7lu/",
          "created": 1717336472,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6rkjnc",
      "score": 88,
      "body": "If you think SBUX is a buy, go for BROS. Bros is 30 years old, and only went public in 2021. \n\nThey have been growing their store count by 20% annually since their ipo, and most of the stores are not franchises. \n\nTheir stated goal is 4,000 stores, and they’re currently around 800-850. Huge growth, and did I mention profitable?",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rkjnc/",
      "created": 1717335747,
      "depth": 0,
      "replies": [
        {
          "id": "l6rszm0",
          "score": 21,
          "body": "Good recommendation- Im from Oregon, so I am very familiar with this company and the younger generation prefers Bros > SBUX. \n\nTheir overhead is lower for Bros as they don’t have any brick and mortar shops, which are rather expensive from a leasing perspective. They also just had leadership change and are expanding exponentially across America.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rszm0/",
          "created": 1717339251,
          "depth": 1,
          "replies": [
            {
              "id": "l6rw6o3",
              "score": 7,
              "body": "too bad they are 200pe lmfao",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rw6o3/",
              "created": 1717340512,
              "depth": 2,
              "replies": [
                {
                  "id": "l6s397q",
                  "score": 31,
                  "body": "Quoting current P/E instead of forward P/E for a growth company is pretty regarded. You belong here.",
                  "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s397q/",
                  "created": 1717343238,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6u636r",
                      "score": 6,
                      "body": "Forward PE of 80 isn’t some amazing metric. Starbucks is like 22",
                      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6u636r/",
                      "created": 1717371812,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l6rl77c",
          "score": 25,
          "body": "Interesting, that's definitely an interesting one to look into. I'm from the south, so personally, I've never seen a unit of that store. I'll do some research though.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rl77c/",
          "created": 1717336035,
          "depth": 1,
          "replies": [
            {
              "id": "l6rs2ik",
              "score": 20,
              "body": "I’m in Texas, and I’ve seen Dutch bros popping up left and right throughout the past 2 years.",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rs2ik/",
              "created": 1717338887,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l6ryjx4",
              "score": 21,
              "body": "Dutch bros seemingly swept down the west coast quicker than a wildfire",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6ryjx4/",
              "created": 1717341432,
              "depth": 2,
              "replies": [
                {
                  "id": "l6s4nig",
                  "score": 8,
                  "body": "The only one I've ever seen (also in the south) was 2 buildings over from a Starbucks and was a ghost town. Which tbh is bullish if they can afford to set up next to a competitor and bleed money like that for the hell of it lmao",
                  "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s4nig/",
                  "created": 1717343764,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6sanmg",
                      "score": 7,
                      "body": "There's a bunch near me, and there's always a line of cars.\n\n\nOf course the same is true at the Starbucks around here too. ",
                      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sanmg/",
                      "created": 1717346034,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l6rpea3",
              "score": 17,
              "body": "SBUX was a buy years ago when it was a growth company- compounding stores and margins.   Now they are saturated in most markets and face ever growing competition.  Store growth is done and same store sales are down.    \n\nWhat catalyst is going to push them back into growth mode?  I don’t see one easily or coming soon.  Not saying they will go away- but they could simply stagnate as a company and stock price may go sideways for years- until something happens one way or another.  Either they grow again or slowly die for 20 years as the market changes and replaces them- like Sears.",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rpea3/",
              "created": 1717337808,
              "depth": 2,
              "replies": [
                {
                  "id": "l6rq3u0",
                  "score": 5,
                  "body": "They are heavily investing in China.",
                  "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rq3u0/",
                  "created": 1717338098,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6rubw9",
                      "score": 16,
                      "body": "The average Chinese person drinks 4 cups of coffee a year while the average American drinks 400 cups of coffee a year. \nThe fact that Starbucks is doubling down on China shows me that their management is making poor choices and getting desperate",
                      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rubw9/",
                      "created": 1717339785,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6rwf0i",
                          "score": 10,
                          "body": "I am above average- I drink 4ish cups a day- but make it at home.  I only go to Starbucks when I am traveling- to use the internet.",
                          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rwf0i/",
                          "created": 1717340601,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "l6s340s",
                      "score": 8,
                      "body": "Where it has already been surpassed in store count by Luckin. \n\nStarbucks being an American brand is also a liability in a country that's fast heading back to the days of Mao.",
                      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s340s/",
                      "created": 1717343184,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l6rm7au",
          "score": 9,
          "body": "Agreed I bought some and will buy more. The competition for SBUX is just becoming stronger and there is no real room to expand. BROS is the way to go. Aside from the growth factor their business model also allows for either higher margins or lower prices than SBUX.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rm7au/",
          "created": 1717336468,
          "depth": 1,
          "replies": [
            {
              "id": "l6rvlvj",
              "score": 5,
              "body": "SBUX has plenty of room to expand, just not inside the US. Half of the reason why their stock hasn't been performing well over past couple years is that their China segment isn't doing well. \n\nIF they can figure out how to balance their expansion efforts and prevent same-store sales from dropping, the stock will do well over the long run. The problem is that nobody besides Schultz seems capable of doing that.",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rvlvj/",
              "created": 1717340289,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l6ryt9w",
          "score": 8,
          "body": "Starbucks is good, but Dutch Bros drive through model might make you more money",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6ryt9w/",
          "created": 1717341534,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6rpptc",
          "score": 4,
          "body": "I would wait. There's a pretty clear pattern in the price history of the stock on the Y5 chart. Strong support around $27 and resistance around $37. And from the looks of it... If say it's headed down to the $27 support level in the next month before moving back to Resistance in another month or so.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rpptc/",
          "created": 1717337939,
          "depth": 1,
          "replies": [
            {
              "id": "l6rv9v5",
              "score": 7,
              "body": "This seems reasonable. I'd add that Boersma just sold 1/3 of his stake at $36ish, so he probably expects the same.  https://www.defenseworld.net/2024/06/02/travis-boersma-sells-264798-shares-of-dutch-bros-inc-nysebros-stock.html",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rv9v5/",
              "created": 1717340158,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l6rxc4c",
              "score": 5,
              "body": "Hard bounce at $23, then at $25, then at $27. \n\n$29 is probably a good entry point, but they’re looking to 5x their store count. That’s a double or triple in stock price, minimum.",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rxc4c/",
              "created": 1717340960,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l6rx60l",
          "score": 5,
          "body": "Problem with bros is not franchising tmost of theyr stores..look at McDonald's with 95% franchised stores: rev is stable, way lower operating costs, more profit. EBITDA margin MCD is 3x higher than bros (50% vs 14.7%) . Bros should def take the franchise route",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rx60l/",
          "created": 1717340895,
          "depth": 1,
          "replies": [
            {
              "id": "l6s4up8",
              "score": 5,
              "body": "14% of their stores opened last year were franchised, but you need more brand recognition before you can really explode. It’s coming.",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s4up8/",
              "created": 1717343838,
              "depth": 2,
              "replies": [
                {
                  "id": "l6sdstk",
                  "score": 5,
                  "body": "I see they tripled rev in 3 years,it has potential as soon as they get some recog and go full steam on franchise we prob see a big growth. Thanks for bringing this one up I'm gonna study the er  better (I'm in Europe/Portugal so it's   impossible to see these companies opening stores here before they become huge)",
                  "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sdstk/",
                  "created": 1717347208,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l6s4r3c",
      "score": 11,
      "body": "I stopped going when the bill got to nearly $20 for just my partner and I in the drive through.  There’s an upper limit for how much people will spend on this shit",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s4r3c/",
      "created": 1717343801,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6rv71q",
      "score": 9,
      "body": "SBUX problem is they need China business to grow and the Chinese no longer willing to pay premium price for sbux coffee.  Unlike the US, Starbucks in China is a premium offering, much more expensive than local Chinese cafes and a place where you take your dates to impress her.  With the state of Chinese economy and high youth unemployment rate, who has the money for Starbucks.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rv71q/",
      "created": 1717340127,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6rkjvf",
      "score": 31,
      "body": "I think Starbucks is popular because it attracts all the people who *don't* like coffee. I never see anyone there ordering black coffee. It's more of a pseudo-coffee treat. I do enjoy it one once in a while same as I enjoy a cupcake, but I'm not getting it because I need coffee. I drink black Folgers at home for that.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rkjvf/",
      "created": 1717335750,
      "depth": 0,
      "replies": [
        {
          "id": "l6rlam8",
          "score": 13,
          "body": "True. It attracts people who think that something that is essentially a milkshake is normal coffee. Funnily enough, there are millions of those people, haha",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rlam8/",
          "created": 1717336078,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6rno7p",
          "score": 3,
          "body": "Yeah my Starbucks order is a venti medium roast with cream and I'm the only person I know who gets that from Starbucks.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rno7p/",
          "created": 1717337093,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6rvta2",
          "score": 4,
          "body": "Which implies boba = good to me. Similar sugar content and dessert appeal.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rvta2/",
          "created": 1717340370,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6rn5am",
          "score": 4,
          "body": "Starbucks black coffee is absolute ass. Seriously some of the worst coffee out there. I’ll only resort to their black coffee if I’m out at home, or Walmart is out of Rotella motor oil.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rn5am/",
          "created": 1717336871,
          "depth": 1,
          "replies": [
            {
              "id": "l6sfrjn",
              "score": 4,
              "body": "It’s trash but it’s consistent trash. You can get that same cup of joe “burnt” flavor anywhere in the world essentially.",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sfrjn/",
              "created": 1717347935,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l6rsci6",
              "score": 2,
              "body": "So is the peanut butter in Reese's but it's made to blend well as part of the final product",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rsci6/",
              "created": 1717338997,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l6sd92h",
      "score": 6,
      "body": "Bearish. Activist boycotts are permanent. Boba drinks will sell mainly to weebs. To Asians this sounds like \"Introducing the all new Doritos Locos Latte!\" ",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sd92h/",
      "created": 1717347003,
      "depth": 0,
      "replies": [
        {
          "id": "l6sdiho",
          "score": 2,
          "body": "I disagree about the boycott permanency. I'd be curious to know what percentage of boycotters frequented starbucks in the first place, and what % of total sales were lost. Nonetheless, public boycotts tend to drive those who disagree with the protestors to give additional business to the boycotted store.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sdiho/",
          "created": 1717347100,
          "depth": 1,
          "replies": [
            {
              "id": "l6sdy6t",
              "score": 2,
              "body": "I'll amend what I said to 'a percentage of activist boycotts are permanent.' Starbucks branding was as the trendy hipster drink, now it's locked itself in as Burger King. It will continue to grow, but I'm not jumping out of my undies at the next all new BBQ whopper latte. Growing slowly is the same thing as losing money in Extremistan.",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sdy6t/",
              "created": 1717347262,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l6v2ga0",
          "score": 2,
          "body": "Have to agree.   Am about ready to give up my InBev.   At least it's officially made my potential chopping block.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6v2ga0/",
          "created": 1717385955,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6rzdlu",
      "score": 6,
      "body": "Sbux was a buy when howard was running shit. The new ceo is a regard. \n\nI tried the boba. I found it unpleasant.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rzdlu/",
      "created": 1717341751,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6s3pir",
      "score": 5,
      "body": "Bullish until I found out the local McDonald's sells iced coffee for $1.50.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s3pir/",
      "created": 1717343408,
      "depth": 0,
      "replies": [
        {
          "id": "l6s4sc1",
          "score": 3,
          "body": "Haha I too go to MCD a good bit. But that stuff runs through my digestive system 10x faster than any Starbucks drink lol",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s4sc1/",
          "created": 1717343814,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6rjfs4",
      "score": 19,
      "body": "I don’t really see boba making any difference in the stock price, there’s already places like gong cha why would you get boba at starbucks? My intuition says it’s a buy just because you’re right that they have tons of loyal customers but I will say some locations are very empty sometimes so I could also see it doing bad, I haven’t researched anything though but I lean towards being bullish on it but not enough to invest myself since I don’t really know anything about the stock",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rjfs4/",
      "created": 1717335259,
      "depth": 0,
      "replies": [
        {
          "id": "l6rvlzn",
          "score": 5,
          "body": "How many Gong Cha locations have drive through? In MA, at least, the couple near me are all walk-in only. Possibly different demographic.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rvlzn/",
          "created": 1717340290,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6rn0v6",
          "score": 5,
          "body": "Boba could be a first step in them becoming more innovative",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rn0v6/",
          "created": 1717336820,
          "depth": 1,
          "replies": [
            {
              "id": "l6s5bec",
              "score": 7,
              "body": "Boba is the first step in you becoming more innovative",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s5bec/",
              "created": 1717344011,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l6rm5me",
      "score": 5,
      "body": "When they changed their loyalty program few years ago, the value proposition was lost for people who went to sbux.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rm5me/",
      "created": 1717336449,
      "depth": 0,
      "replies": [
        {
          "id": "l6rx1m8",
          "score": 3,
          "body": "I agree with this 100%. They fucked up with that one.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rx1m8/",
          "created": 1717340848,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6s2iab",
      "score": 4,
      "body": "Disclosures: I’m massively long SBUX. Basis 83. Most of the long positioning was being assigned early on short puts. Was happy to get long there but I was surprised and wasn’t expecting such a punishment after ER last month. I’m almost even in P&Ls and am comfortable with the position currently. What I do worry about, however, is employee satisfaction. From what I can tell, admin *thinks* they treat employees well. They do have good pay and other comp IMO. Baristas start at 18-19$/hour and they have an excellent 401k match that is managed by Fidelity, and all employees have option to purchase SBUX at discount from payroll deduction. That being said, they seem to be unhappy. Every time I’m in a shop they are super friendly, but looking a r/Starbucks they seem to be pretty overwhelmed, understaffed, and stressed. (Some of this has to do with customers being complete assholes).  I think SBUX needs to fix that.  But otherwise I don’t see the drop off in customers and “empty” cafes that other commenters are mentioning. All my local cafes (I commonly patronize three in my city) are pretty busy.  I hope you’re right that various new drink options will spark increased numbers. But I hope it doesn’t lead to attrition of stressed employees.  Edit: I have some BROS in retirement accounts that is a long term hold. And I like that company too, however  personally disagree that you should get long BROS at these prices in place of SBUX. BROS coffee quality is pretty bad IMO, and a PE ratio of ~200 is kind of absurd for a drive through coffee shop. It’s true though that they are growing substantially and they are always busy as well, and I’m sure overhead is way lower than SBUX. It’s not a bad idea but I personally wouldn’t jump ship on SBUX for BROS. Maybe split the difference 🤷",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s2iab/",
      "created": 1717342954,
      "depth": 0,
      "replies": [
        {
          "id": "l6s43f3",
          "score": 4,
          "body": "I'd like to propose an idea to you, which I heard about awhile back. A few years ago, I was deciding a restaurant to go to, and was looking at reviews. I was confused why I couldn't seem to find one with a solidly high rating. So I started thinking, did some research, and realized a general rule of that kind of stuff. Essentially, people who are dissatisfied with something are FAR more likely to post a review or say something on reddit (or elsewhere) than people who are happy. I also learned this when I worked for DoorDash. Maintaining ratings was difficult because I constantly had to remind those who were happy to leave a review, while those who were not would leave one of their own accord. I see what you're saying about dissatisfied employees, based on what you've seen on the Reddit. However, I'd suggest you balance that with the fact that you regularly see workers who appear happy in the store. The appearance doesn't necessarily mean they are, but in the fast food and drink business, I've found that many workers don't bother putting on airs. Anyways, TL;DR: complainers will complain online more often than happy people will say happy things, esp about work. I would be hesitant to say Starbucks employees are generally unhappy, based on social media.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s43f3/",
          "created": 1717343554,
          "depth": 1,
          "replies": [
            {
              "id": "l6s4v56",
              "score": 3,
              "body": "Yeah probably true. Maybe I’ll ask some peeps at my local shop. They know me by now!",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s4v56/",
              "created": 1717343843,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l6sglnb",
      "score": 5,
      "body": "Trash.\n\nToo expensive & their new \"GTFO\" store concept is even more trash.\n\nThe new format they are doing in my area js to rip out ALL the seating & tables, put the baristas behimd a closed off partition, and then have a single pickup spot.\n\nYou order on-lime, walk in, find your drink, and GTFO.\n\nThis full on 180 what these places were supposed to be........\n\nAs far as why the baristas are now hidden out of sight, my guess is that they are preparing to replace them w/ automation.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sglnb/",
      "created": 1717348245,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6s3x0r",
      "score": 3,
      "body": "Starbucks Boba tastes like chemical dogshit and a small costs 8 dollars. I’ll pass, NOBODY will buy it.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s3x0r/",
      "created": 1717343486,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6s4vrt",
      "score": 3,
      "body": "Starbucks is going to create the most overly sweetened dog water boba tea",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s4vrt/",
      "created": 1717343849,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6s72iq",
      "score": 4,
      "body": "I rarely buy anything at starbucks, and when i do its a disappointment price-quality wise. Pass from me",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s72iq/",
      "created": 1717344675,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6sd61i",
      "score": 4,
      "body": "Strictly anecdotal, but I travel a good bit and have noticed much less traffic in Starbucks stores across the country. No way to know, but I think they finally hit the ceiling on what most people are willing to pay for coffee. Pretty much any Grande  with additions is $6-8. It’s pretty ridiculous.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sd61i/",
      "created": 1717346971,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6rrcuo",
      "score": 6,
      "body": "I’m in the GCC Starbucks is on its arse, boycott is definitely still in affect, I’m in Qatar at the moment there’s not a Customer to be seen - every other coffee place is buzzing. Don’t forget AlShaya own around 2,000 units in GCC, already cut over 2k staff, there’s still time for them to fall further.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rrcuo/",
      "created": 1717338602,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6rr372",
      "score": 3,
      "body": "McDonald's tore down a whole store and are replacing it with a new McCoffee place? Starbucks is exactly 1 Big Mac Throw away being directly across a small side street. \n\nPuts on SBUX",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rr372/",
      "created": 1717338493,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6rt483",
      "score": 3,
      "body": "Think there are better growth stories, not the right time where ppl are shelling out 7 bucks for coffee",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rt483/",
      "created": 1717339302,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6ruche",
      "score": 3,
      "body": "Most of the restaurant industry looks reasonably valued right now. Inflation pressure on labor costs is easing, and a lot of the companies have been in a cyclical slump. SBUX is one, and at historical trend support levels.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6ruche/",
      "created": 1717339792,
      "depth": 0,
      "replies": [
        {
          "id": "l6s36ey",
          "score": 3,
          "body": "That's why I bought in recently. Already up substantially.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s36ey/",
          "created": 1717343209,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6s4cec",
      "score": 3,
      "body": "ew. Boba at starbucks sounds disgusting. Might as well go to jack in the box.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s4cec/",
      "created": 1717343648,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6s63tb",
      "score": 3,
      "body": "Lol should probably do some actual research except for just looking at the chart bud.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s63tb/",
      "created": 1717344309,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6sb17k",
      "score": 3,
      "body": "Issue is the current CEO. He doesn't seem to know how to get Starbucks back to its elite level. The previous CEO wrote a fucked up piece on LinkedIn basically telling him how to do his job. It was funny, since he picked this new guy to be the CEO. \n\nIf they shit the bed again this coming quarter, stock will go even lower",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sb17k/",
      "created": 1717346175,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6rmgql",
      "score": 10,
      "body": "As a Starbucks employee, no, it’s not a good buy. Labor cuts are continuing to impact wait times and training standards. Continual price increases are making it less and less accessible.  Union demand is growing across the country. \n\nThere is zero catalyst for starbucks to go up. I do think it’ll turn around, but that’s more because I’m hopeful than confident.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rmgql/",
      "created": 1717336579,
      "depth": 0,
      "replies": [
        {
          "id": "l6slvd1",
          "score": 3,
          "body": "Hell yea! Coming from a worker at a union store! (And organizer. HMU to maybe unionize your store too) haha",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6slvd1/",
          "created": 1717350190,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6rnlab",
          "score": 4,
          "body": "Ahh yes, take stock tips from a peasant. That will definitely lead to success ![img](emote|t5_2th52|4275)",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rnlab/",
          "created": 1717337060,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6ry611",
          "score": 2,
          "body": "They are closing Starbucks around me. Wi",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6ry611/",
          "created": 1717341283,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6rpom2",
      "score": 2,
      "body": "More to go.. down",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rpom2/",
      "created": 1717337926,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6rscyd",
      "score": 2,
      "body": "I had a buy order in at $70 but think it only got down to $72 a few weeks back. I’ve struggled with their PE for a long time from my perspective of high growth potential. They’ve been proving me wrong for a long time but I think we might be at a point in terms of market penetration and competition that moving forward growth will be more difficult.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rscyd/",
      "created": 1717339002,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6ru16l",
      "score": 2,
      "body": "Nah blue bottle taking sbux customers",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6ru16l/",
      "created": 1717339667,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6s0spx",
      "score": 2,
      "body": "Lol",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s0spx/",
      "created": 1717342300,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6s1mhj",
      "score": 2,
      "body": "I think they should gut most of their bakery menu and start over. It is really tired.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s1mhj/",
      "created": 1717342618,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6s3ml4",
      "score": 2,
      "body": "Their coffee tastes old, stale and burnt",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s3ml4/",
      "created": 1717343378,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6sbj4n",
      "score": 2,
      "body": "Better places to invest.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sbj4n/",
      "created": 1717346361,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6sbprh",
      "score": 2,
      "body": "I think SBUX is out of fashion. The people I know typically choose not to go to SBUX for coffee.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sbprh/",
      "created": 1717346430,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6scsid",
      "score": 2,
      "body": "Honestly, I think Starbucks is in deep trouble and Boba is a sad act of desperation.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6scsid/",
      "created": 1717346831,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6seqm4",
      "score": 2,
      "body": "Coffee ain’t good enough",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6seqm4/",
      "created": 1717347553,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6shj5m",
      "score": 2,
      "body": "$13.40 for two medium hot coffees and them asking for a tip which I promptly declined?\n\nYeah, mmm, no, I can’t possibly see how they’ll continue to expand a multiple in such an environment as it is now. I expect less buying at Starbucks and personally only if I get a gift card. \n\nBut good luck to you and hopefully you don’t end up behind a Wendys",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6shj5m/",
      "created": 1717348593,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6skg7c",
      "score": 2,
      "body": "Bearish, there’s a Starbucks and a Dutchbros next to each other in my town that every time I drive pass them dutchbros is always full and Starbucks is empty",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6skg7c/",
      "created": 1717349675,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6ug4v5",
      "score": 2,
      "body": "you think will the cost of food at an all time high people won’t skip their coffee?",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6ug4v5/",
      "created": 1717376005,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6rl6l9",
      "score": 3,
      "body": "Americans outside of major cities want Dunkin more than Starbucks, and within cities Starbucks pricing puts them at hipster coffee shop levels without the same quality. These days in NYC I find a lot more good coffee shops than I find Starbucks, if they could manage to procure and properly roast good beans you'd have more people choosing them, but they're such a massive chain it would be nearly impossible to do at such a large scale.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rl6l9/",
      "created": 1717336028,
      "depth": 0,
      "replies": [
        {
          "id": "l6rlmcl",
          "score": 4,
          "body": "Whether or not Starbucks is people's favorite, a lot of people trust the brand and use it as a go-to. I agree that Dunkin is massive too, as are one-off coffee shops in cities. I do think Starbucks sees continued growth though",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rlmcl/",
          "created": 1717336218,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6rkfsr",
      "score": 5,
      "body": "There’s a boycott going on of Starbucks and Mcdees",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rkfsr/",
      "created": 1717335700,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6s0vyc",
      "score": 1,
      "body": "Very bearish. Only stupid people pay more than a couple bucks for a coffee. And since stupid people are always broke.. Starbucks is fux",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s0vyc/",
      "created": 1717342335,
      "depth": 0,
      "replies": [
        {
          "id": "l6s39rj",
          "score": 8,
          "body": "Why are stupid people broke? Because they spent 50% of their paycheck on SBUX. Bullish.",
          "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s39rj/",
          "created": 1717343244,
          "depth": 1,
          "replies": [
            {
              "id": "l6s3ypv",
              "score": 3,
              "body": "Also valid.",
              "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s3ypv/",
              "created": 1717343505,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l6s0rtr",
      "score": 2,
      "body": "boycott",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s0rtr/",
      "created": 1717342291,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6rjiud",
      "score": 2,
      "body": "Starbucks is the Kleenex of coffee.. thank you for coming to my TED talk..",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rjiud/",
      "created": 1717335297,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6rr1be",
      "score": 1,
      "body": "# \"... but I do like me some balls in my drink.\"",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6rr1be/",
      "created": 1717338472,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6s6quz",
      "score": 1,
      "body": "What is that “eggs”",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s6quz/",
      "created": 1717344552,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6s9bak",
      "score": 1,
      "body": "bubble tea have been around; ten ren, tea station, cha 4 tea, tea bar. \n\nJack in the box and yoshinoya is starting to having bobas now too. It attracts the younger crowd because of profit. Its all water based. \n\nFrom experience i know starbucks have taken over mom and pops donut shop then placing a starbucks at that location(network)",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6s9bak/",
      "created": 1717345525,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6sbwue",
      "score": 1,
      "body": "I think the talk of all the boba shops in majority asian areas is missing that sure there are the big ones in downtown areas like ann arbor where youll see literally 10 cars lines up of all asian american people, but also there are many MORE local shops and small ones, even around areas with -10 asian population because I cant count the amount of 18 year old high school girls going into my local one because they either love the drinks or love the culture.\n\nAlso a lot of these tea shops have been expanding into smoothies and coffee and even dessert (not like boba and coffee isnt a dessert nowadays anyways lol). Starbucks adding more traditional boba drinks will certainly give them sales, but its like getting a breakfast sandwich there. Feels prepackaged (because it is), tastes ok, and youre just getting it because theres no other better option on your way to your class lol (though I do F with their double smoked breakfast sandiwch and bakery items). Edit: Either way starbucks wont die, they have their controversies, they have their bad drinks, lets not talk about their overseas eastern strategy which at worse will stay how it is now lol. Its a company you know will always be there for when you need your 100g of sugar in a 10oz drink.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sbwue/",
      "created": 1717346503,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6sdst2",
      "score": 1,
      "body": "I bought a few weeks ago, but sold to buy WMT. Less dividend yield, but it’s not going anywhere.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sdst2/",
      "created": 1717347207,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6sgij2",
      "score": 1,
      "body": "I’ve traded SBUX on hard sell-offs.  I like the growth prospects of BROS more.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sgij2/",
      "created": 1717348213,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6silk1",
      "score": 1,
      "body": "Putting balls in your mouth, I think OP is…",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6silk1/",
      "created": 1717348991,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6sj0mh",
      "score": 1,
      "body": "they are going after the Asian market",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sj0mh/",
      "created": 1717349146,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6sjn5f",
      "score": 1,
      "body": "I think they need to make a “sugar free” version of all their drinks and they’d pull in a lot of the energy drink market. Sbux is starting to make more canned drinks that are actually in the energy drink section of the stores near me but you don’t get to pretend like they’re healthy because they have a ton of sugar, carbs, and calories whereas the energy drinks use artificial sweeteners.\n(I’m basing this solely off of what I want (do it sbux))",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sjn5f/",
      "created": 1717349379,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6smco1",
      "score": 1,
      "body": "Too much competition in Asia. And with a lot of corporate employees working from home full-time or at least partially, there is no real driver that can improve sales",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6smco1/",
      "created": 1717350362,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6so7n8",
      "score": 1,
      "body": "starbuck boba suck. those are just liquid ball",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6so7n8/",
      "created": 1717351041,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6sqj5u",
      "score": 1,
      "body": ">Active in nofap and pewdiepiesubmissions\n\nFor those reasons I’m out, but I will be rooting for you",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sqj5u/",
      "created": 1717351890,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6sqs97",
      "score": 1,
      "body": "Its v cheap rn.  Many would argue thats for a good reason, im in",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sqs97/",
      "created": 1717351982,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6sqvrw",
      "score": 1,
      "body": "NOPE!   The consumer spoke by cutting back on $5 latest when they went to $6 or $7.\n\nSbux is no longer a convenience middle class luxury item.  It now falls under unnecessary discretionary expense.   People are choosing to make coffee from home now and save $70/week.\n\nYou can't raise prices due to increases commodity costs and wage inflation and expected to keep 100% of your customer base.\n\nWhat SBUX is losing in customer base cannot be recovered by trying to increase margins at the register.\n\nBearish on SBUX for at least 12 months.\n\nEven if interest rates goes down which it won't it won't have any bullish trend for sbux.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6sqvrw/",
      "created": 1717352018,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6srvr6",
      "score": 1,
      "body": "Dutch bros is whooping Starbucks’ ass recently from the looks of it near me. Dutch bros moved in and everyone started going there instead because it’s like $2 cheaper",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6srvr6/",
      "created": 1717352384,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6srz3r",
      "score": 1,
      "body": "I love how everyone is talking coffee when you should look at the prime business: being in the milk business. Coffee is such a huge market already but me thinks that Starbucks is all about the milk/dairy prices.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6srz3r/",
      "created": 1717352418,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6ss30k",
      "score": 1,
      "body": "I think Starbucks stays around and is relevant for a long time, interesting on boba personally hate it but I’m less bullish and think there will be some significant downside still as the middle class consumer is continually pressured. I think if it’s down another 14% or so I’d be more interested.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6ss30k/",
      "created": 1717352458,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6svdjc",
      "score": 1,
      "body": "Long term bearish. No fundamental reason to buy here",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6svdjc/",
      "created": 1717353675,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6svq6j",
      "score": 1,
      "body": "I sold SBUX a few months ago, mainly due to the fact that they are constantly being boycotted for numerous reasons by several different groups several. I made some money on it and am not ready to jump back in yet.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6svq6j/",
      "created": 1717353807,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6svxa7",
      "score": 1,
      "body": "I would buy at that level.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6svxa7/",
      "created": 1717353879,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6swm7d",
      "score": 1,
      "body": "Bearish, it’s a fad, it will fade.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6swm7d/",
      "created": 1717354133,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6szrck",
      "score": 1,
      "body": "The issue with Starbucks stock right now according to Laxman is the wait time for customers.  His revitalize the stock plan is to improve this somehow which I can’t see how.  I’m waiting for laxman to get the boot, get a better ceo in there and get a strategic partner.  The good thing about Starbucks is that they are not franchised.  It’s all corporate stores with corporate partners.  So improving worker efficiency is easier than in the franchise model.  I do own Starbucks and so does Cramer.  Hopefully he whips the board to boot laxman aka slackman",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6szrck/",
      "created": 1717355286,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6t11ft",
      "score": 1,
      "body": "SBUX CEO is stupid as fuck. When they boot him, I will put money again on the company. He managed to angry pro palestinians and pro israel and also tried to sell coffee with olive oil (that shit did not work...)",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6t11ft/",
      "created": 1717355765,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6t1ysw",
      "score": 1,
      "body": "I worry that Starbucks is too reliant on China. They have doubled their footprint there in recent years, and are facing diminishing returns. There is always the risk of Starbucks being targeted by the government as retaliation for tariffs, but the immediate problem is cheaper competition as the Chinese consumer continues to cut back on discretionary spending.\n\nMy guess is that some of the recent downturn in the US and Canada is due to Gaza boycotts (because Howard Schultz is Jewish?), but even if that is temporary, there seems to be softening of demand.\n\nI don't know if bubble tea will move the needle. It seems like the market is saturated.\n\nPosition: 727 shares of SBUX purchased between 2010-2014",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6t1ysw/",
      "created": 1717356112,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6t32gr",
      "score": 1,
      "body": "Puts",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6t32gr/",
      "created": 1717356529,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6t36nk",
      "score": 1,
      "body": "Coffee is overpriced everywhere.. bearish on all coffee places lol…![img](emote|t5_2th52|31226)",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6t36nk/",
      "created": 1717356573,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6t3hcu",
      "score": 1,
      "body": "I was thinking similar as well and may be bullish long term\n\nHowever, how do you feel about dutch bros?\n\nThey are starting to pop up everywhere. Its always busy and I see the stock being relatively new in 2021 when they went public.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6t3hcu/",
      "created": 1717356685,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6t3zto",
      "score": 1,
      "body": "What if people break out of the spell and realize what they can save making better coffee at home?  \n\nWhat if the coffee bean shortage raises their wholesale costs?  \n\nCan they charge more at retail ?\n\nI think they’ve peaked.\n\n\nSELL",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6t3zto/",
      "created": 1717356877,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6t5dmg",
      "score": 1,
      "body": "Dutch Bros is takin over",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6t5dmg/",
      "created": 1717357391,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6t7e08",
      "score": 1,
      "body": "I think one question is what’ll happen w coffee bean prices ? Idk if people want to pay $6-7 for a coffee drink, at least for a while.  \n\nI guess I’d also see what the international expansion plans are. I think they’re getting out paced in China.  But other parts of the world might be fruitful.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6t7e08/",
      "created": 1717358137,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6t9wfr",
      "score": 1,
      "body": "I think their coffee tastes like dirty water and Americans are starting to find out that they can get an expresso, ristretto or cafe o lait for less",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6t9wfr/",
      "created": 1717359078,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6tbcf3",
      "score": 1,
      "body": "In Malaysia, there is a massive boycott movement against Starbucks to the point that the main operator of Starbucks franchise lost USD12 billion. In addition, there are more and more cheaper local alternatives and Starbucks has been pretty resistant to lowering their prices.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6tbcf3/",
      "created": 1717359617,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6teitq",
      "score": 1,
      "body": "yeah SBUX seems really cheap right now",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6teitq/",
      "created": 1717360795,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6tf1da",
      "score": 1,
      "body": "Bob Swan is a nightmare. He buys, I sell",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6tf1da/",
      "created": 1717360987,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6tf1ef",
      "score": 1,
      "body": "Bearish. If the economy slows down people are gonna spend a lot less on stuff like this. \n\nAs far as their boba I’m sure it’s gonna be trasg",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6tf1ef/",
      "created": 1717360988,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6tfiot",
      "score": 1,
      "body": "I hate Starbucks and coffee tastes like garbage. Better find out how many locations they closed and what that means to the bottom line. If you see the line and stock increasing buy it. There’s too much competition coming onboard given the cost of their coffee compared to others.\n\nHave a look at the charts then also make your decision.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6tfiot/",
      "created": 1717361168,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6tg42l",
      "score": 1,
      "body": "Your thesis: bullish on boba\n\ncoolcoolcool \n\nI'm in.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6tg42l/",
      "created": 1717361389,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6tgknb",
      "score": 1,
      "body": "[Starbucks is a bank](https://www.forbes.com/sites/niallmccarthy/2016/08/01/starbucks-holds-more-cash-than-many-banks-infographic/?sh=e7955ed231aa).  Bullish",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6tgknb/",
      "created": 1717361559,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6tkofn",
      "score": 1,
      "body": "SBUX was a buy at 68/70 we ran that up like 2wks ago.... We have an 83 target give or take and over 83 it'll fill the gap.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6tkofn/",
      "created": 1717363121,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6tv0oe",
      "score": 1,
      "body": "I like sbux but holy shit their ceo is a moron. If they replace him the stock will moon.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6tv0oe/",
      "created": 1717367230,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6tv9o1",
      "score": 1,
      "body": "Nah there’s nothing here I feel like it’s dead for the foreseeable future, nothing worth putting money into unless your just super long and get in for the dividend",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6tv9o1/",
      "created": 1717367331,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6tvhf5",
      "score": 1,
      "body": "All these negative comments just trying to push BROs instead is giving me the confidence to wanna double down on my SBUX calls",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6tvhf5/",
      "created": 1717367419,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6twpat",
      "score": 1,
      "body": "$9 for a frappe 🤣",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6twpat/",
      "created": 1717367911,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6u0260",
      "score": 1,
      "body": "There's too much competition in the coffee market. Starbucks is obviously the most popular, but literally anyone can spend 20k to get a commercial espresso machine + grinder + accessories to start their own shop. Most of the time, these small shops are significantly better than sbux",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6u0260/",
      "created": 1717369277,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6u07hw",
      "score": 1,
      "body": "$SBUX is betting its future growth on China market. If this is $SBUX’s long-term strategy, $SBUX is definitely an underperforming stock for the foreseeable future. This sector in China is more competitive than the EV sector.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6u07hw/",
      "created": 1717369339,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6u0wzi",
      "score": 1,
      "body": "Op knows Starbucks has been around for like 50yrs no? It’s not a new concept…",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6u0wzi/",
      "created": 1717369633,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6u36nl",
      "score": 1,
      "body": "I like Starbucks because the chart looks good for some short term options plays. The Boba looks good too.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6u36nl/",
      "created": 1717370587,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6u3q7w",
      "score": 1,
      "body": "\"There may be some competitors in the US and elsewhere...\"  **and yet the stock sucks and is losing money.** So that obviously doesn't matter, does it?  This is why I'm a technical, not fundamental investor. I look at that chart, and I move on. Because I don't like trading on 'hunches' and I really don't like losing money.",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6u3q7w/",
      "created": 1717370816,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6u3y2z",
      "score": 1,
      "body": "I bought it at 73.xx so yes, I agree",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6u3y2z/",
      "created": 1717370911,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6u3zeu",
      "score": 1,
      "body": "Nope",
      "permalink": "/r/wallstreetbets/comments/1d6d95f/i_think_sbux_is_a_buy_are_you_bullish_or_bearish/l6u3zeu/",
      "created": 1717370926,
      "depth": 0,
      "replies": []
    }
  ]
}