{
  "title": "OPEC+ extends deep oil production cuts into 2025",
  "score": 58,
  "selftext": "[removed]",
  "link_flair_text": "Discussion",
  "id": "1d6e8me",
  "num_comments": 28,
  "created_utc": 1717337671,
  "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/",
  "comments": [
    {
      "id": "l6rp2h5",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 19 | **Previous Best DD** | \n**Account Age** | 1 month | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6rp2h5/",
      "created": 1717337675,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6t2f01",
      "score": 26,
      "body": "I have closed all my oil positions, so just spitballing here,\n\n1) Angola left OPEC last December - remains to be seen if a one-off event or significant tension within the group;\n\n2) the US is trying to tap into Guyana oil, positioning it as the third-largest non-OPEC oil supplier and a potential counterbalance.",
      "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6t2f01/",
      "created": 1717356282,
      "depth": 0,
      "replies": [
        {
          "id": "l6ukxc9",
          "score": 2,
          "body": "What’s stopping Guyana from joining OPEC? US must be offering something good in return",
          "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6ukxc9/",
          "created": 1717378044,
          "depth": 1,
          "replies": [
            {
              "id": "l6uzyo6",
              "score": 20,
              "body": "The US is offering protection. Venezuela is a poor nation headed by a greedy idiot with a massive army and they've been 'claiming' those oil fields recently. The USA is the only real nation that can project power there. As far as I'm aware the deals have basically already been penned, but I never looked into it too deeply.",
              "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6uzyo6/",
              "created": 1717384726,
              "depth": 2,
              "replies": [
                {
                  "id": "l6zacmw",
                  "score": 1,
                  "body": "Ah, hopefully we can get that oil flowing. F these opec countries",
                  "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6zacmw/",
                  "created": 1717453436,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l6uu6fx",
      "score": 12,
      "body": "OPEC is becoming irrelevant with their actions to cut.  This is a futile effort on their lart to rise prices.  Any effort to cut is only going to be replaced by more output by American producers. \n\nThe only strategy that has proven to impact oil prices is them electing to over saturate the markets and making it difficult for American producers to operate but they need to do this over several yrs to really have an impact and they can't afford that.",
      "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6uu6fx/",
      "created": 1717382064,
      "depth": 0,
      "replies": [
        {
          "id": "l6wbj1w",
          "score": 6,
          "body": "Yep, they are just transferring market share to American shale oil and the US is already producing more oil than Saudi Arabia.\n\nOPEC used to be mighty like Nvidia in the GPU market. Nowadays they are like AMD Radeon in the GPU market and in the future they can become as irrelevant as Intel ARC GPU.",
          "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6wbj1w/",
          "created": 1717415098,
          "depth": 1,
          "replies": [
            {
              "id": "l6wy0za",
              "score": 1,
              "body": "Nice similies.",
              "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6wy0za/",
              "created": 1717424722,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l6wa7o1",
          "score": 1,
          "body": "Probably why oil is flat after this announcement.",
          "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6wa7o1/",
          "created": 1717414406,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6sg4eq",
      "score": 15,
      "body": ">**should** **cause oil prices to rise again**\n\nWatch the price of WTI drop right back instead lol...once again.\n\nRemember the last few times they made those \"big cuts\", and everyone was like \"WTI at over $100 guaranteed, easy money\". The price briefly rose a little above $80 a barrel, then dipped right back.\n\nThere's a very obvious reason the price has remained steady, and even dropped a little, despite all these \"big output cuts\", but of course, most people aren't willing to dig beyond the headlines.",
      "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6sg4eq/",
      "created": 1717348067,
      "depth": 0,
      "replies": [
        {
          "id": "l6sg7pt",
          "score": 4,
          "body": "Please elaborate",
          "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6sg7pt/",
          "created": 1717348101,
          "depth": 1,
          "replies": [
            {
              "id": "l6shoi5",
              "score": -29,
              "body": "I've already explained this a hundred times. I have made posts even on here. Do a search on my post history with the key word \"oil prices\". It explains it all. Just a week or two after each one of those posts, the price took a big dip. My post explained why the cut in output by millions of barrel by OPEC wasn't gonna see any major rally in prices, and might even more likely see a drop in price.",
              "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6shoi5/",
              "created": 1717348648,
              "depth": 2,
              "replies": [
                {
                  "id": "l6spaov",
                  "score": 24,
                  "body": "[your last post about oil was 2 moths ago.](https://old.reddit.com/r/wallstreetbets/comments/1bimipe/dont_expect_cpi_to_cool_off_any_time_soon_with/) i had to run it though chatgpt, because it was all over the place, i couldn't understand the point you were trying to make. \n\nseems like you were bullish and saying the prices were going to increase\n\n>The post suggests that oil prices are likely to increase due to several factors:\n\n>1. Current WTI crude oil price is around $83.\n2. Disruptions in Russian refineries.\n3. Ongoing Middle East crisis, including Houthis targeting shipping lanes.\n4. High seasonal demand for oil approaching.\n5. Saudi Arabia and OPEC are maintaining lower output to keep prices high.\n6. The electric car revolution is delayed.\n7. The US aims to replenish its oil reserves by the year's end.\n\n>On the other hand, there are some forces that could push oil prices down:\n\n>1. China's recession, leading to lower consumerism and oil demand.\n2. Political pressure on the US President to keep prices down, despite limited options.\n\n>Additionally, the post mentions that a housing market crash could cool off CPI and potentially lead to rate cuts, but this scenario could negatively affect the stock market and isn't the ideal way to achieve a rate cut. Overall, the expectation leans towards rising oil prices.\n\nim failing to see where you explain what you said you explained.",
                  "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6spaov/",
                  "created": 1717351440,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l6srbaf",
                      "score": -3,
                      "body": "That's not the post. What you posted was my post about CPI, and about how murky the picture was, the posts I'm referring to are about just the oil market.\n\nBut to make a long story short, OPEC output cuts are just smoke and mirror.\n\nThere is a discrepancy between the agreed output talks, versus the actual output, versus the actual market effect when it's all said and done.\n\nAnd the agreement is often not in line with the reality.\n\nThat's because apart from Saudi Arabia, many OPEC members are already not putting out their agreed quota. Sometimes by millions of barrels. So when they declare cuts by millions of barrels, it has little to no effect, since those barrels weren't there to begin with. They sometimes aren't even cutting anything.\n\nOn top of that, there's many other factors to take into account. Refineries had very limited output since Covid, so even with higher outputs, it had already a limitation and couldn't keep up with the full quota. Plus the internal problems in members like Nigeria, Libya, etc..\n\nNot to mention many other factors to take into account. Like supply chain, China's economic crisis that has lowered oil demand, seasonality, etc...\n\nSo that's why those headlines about OPEC cutting output can be misleading when taken out of context, and that's why many people get burned. That's not to say that each time there's an output cut, it won't increase the price. It just means that it's pretty far from a guarantee.",
                      "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6srbaf/",
                      "created": 1717352175,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l6sznfd",
                          "score": 5,
                          "body": "i would agree. i also think a lot of people are overlooking the fact that the US is now the #1 producer of oil. any cut by OPEC means more production by US companies to fill the gap.",
                          "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6sznfd/",
                          "created": 1717355246,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l6t2rjp",
                              "score": 0,
                              "body": "Yea the US is the #1 producer, but not exporter.",
                              "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6t2rjp/",
                              "created": 1717356413,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l6up0t6",
                                  "score": 1,
                                  "body": "Believe we are going to get there soon, I believe we already have achieved this for LNG?",
                                  "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6up0t6/",
                                  "created": 1717379802,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "l6sygub",
                          "score": 0,
                          "body": "All that, and it was already priced in. Did anybody really think they would lift the “cuts”?",
                          "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6sygub/",
                          "created": 1717354810,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l6wy8db",
          "score": 1,
          "body": "Prices at the pump are high compared to the price per barrel. We're just being screwed by big oil and opec together.",
          "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6wy8db/",
          "created": 1717424798,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6utmkr",
      "score": 3,
      "body": "I think oil company stock prices will continue to make its way higher, relative to WTI, over time. XOM to $150 in a few years is believable.\n\nI do believe WTI is due to hit $100, but I don't see it happening this year, but next year.\n\nBut big funds short oil stocks to buy those nvidia shares. I don't think we're getting an energy trading cycle unless hurricanes are very bad this year.",
      "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6utmkr/",
      "created": 1717381814,
      "depth": 0,
      "replies": [
        {
          "id": "l6zt8kt",
          "score": 1,
          "body": "[https://www.noaa.gov/news-release/noaa-predicts-above-normal-2024-atlantic-hurricane-season](https://www.noaa.gov/news-release/noaa-predicts-above-normal-2024-atlantic-hurricane-season)\n\n![img](emote|t5_2th52|29637)",
          "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6zt8kt/",
          "created": 1717460883,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6v40ky",
      "score": 4,
      "body": "It's an election year. What else do you need to know? Biden will drain the strategic reserves to their limit if he has to to keep WTI from crossing $80 before November. The Saudis are over their skis as the real cost to maintain their economy is well over that mid 70's break even number that's always floated. It'll go up for sure but not till  Q4 or Q1 at the earliest. Full transparency, I wish I'd realized this about 3 months ago.",
      "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6v40ky/",
      "created": 1717386751,
      "depth": 0,
      "replies": [
        {
          "id": "l6vk24k",
          "score": 3,
          "body": "The DOE has already purchased oil for delivery to the SPR for refilling in June, July, August, September, and October. Contract awards for SPR refill deliveries in November will likely be announced within the next week.\n\nIt's not completely impossible, but at this point it's extremely unlikely that there will be any SPR crude sales this year.",
          "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6vk24k/",
          "created": 1717396261,
          "depth": 1,
          "replies": [
            {
              "id": "l6wykru",
              "score": 0,
              "body": ">it's extremely unlikely that there will be any SPR crude sales this year.\n\nDisagree, SPR crude sales are Uncle Sam's simplest level on prices and there's an election in 5 months. Personally, I'm all for it if we sell high in the Summer and buy low in the Winter.",
              "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6wykru/",
              "created": 1717424921,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l6v90hc",
      "score": 1,
      "body": "I'm bullish on Oil companies, long CVX, XOM, they are gonna tap Argentina for cheap soon enough.",
      "permalink": "/r/wallstreetbets/comments/1d6e8me/opec_extends_deep_oil_production_cuts_into_2025/l6v90hc/",
      "created": 1717389445,
      "depth": 0,
      "replies": []
    }
  ]
}