{
  "title": "The Secular Small Cap Cycle: A Primer",
  "score": 76,
  "selftext": "*Warning: I'm a chart guy. This post has a lot of charts, and its follow-up is in danger of containing even more. Proceed at your own risk.*\n\nSince November the last 7 months have been defined by market cap concentration around a select few winners. The Magnificent 7, the somewhat flippant successor to the “FAANG” moniker and similarly composed of big tech representatives, have dragged the S&P and NASDAQ to repeated all-time highs. Behind a torrent of speculative investment on how far they’ll change our lives with artificial intelligence, killer earnings reports, and safe harbor fears, the Mag 7 have become the fat kid sitting on the other end of the see saw. As of May 31, this group makes up 49.8% of the NASDAQ’s market cap and around 31% of the S&P’s. From December 2022 to December 2023, they’ve made up 71% of the latter index’s return; the other 493 companies have a total of 6% versus the S&P’s 19%. Their performance [since the COVID epidemic is even more staggering](https://imgur.com/U4VPyGt).\n\nKeen students of history know this is neither new nor surprising. The NASDAQ, and particularly big tech companies, have been the best performers in the U.S. stock market for the last 25 years. Concentration has been [a hallmark of the S&P 500 stretching back to the index’s birth](https://paulsenperspectives.substack.com/p/what-does-large-cap-concentration). Just like the early 1980s and the turn of the century, an elite group is sucking all the oxygen out of the room while other sectors languish. And just like those periods their reign of dominance will end, leaving the individual members of the Mag 7 either obsolete or a big fish in an ocean with rapidly growing predators infringing onto their territory.\n\nBut that’s easy to claim. The market cap explosion among that group started around 2018 and has been going on for 6 years. Who’s to say it couldn’t continue indefinitely? When Apple can create an entire ecosystem that locks in their customers, when Amazon can create their own marketplace and curtail any threats within it, why can’t they become permanently entrenched? There have been upheavals in all aspects of the economy since 2000, from the proliferation of computers large and small to the way transnational finance have become seamless via electronic coordination. Under these assumptions, there’s no reason not to invest your hard-earned money into guaranteed success.\n\nHowever, I believe there’s the potential for regime change on the horizon. I’m not talking about a swift quietus taking out the current tech giants, but a slow process of re-normalization to an era before ZIRP and QE set the groundwork for tech to comprehensively outpace the rest of the market. It can be summed up in 4 charts.\n\n[Financial Conditions Impulse on Growth](https://imgur.com/FMCog44)\n\n[S&P 500 and Nasdaq Composite versus S&P Small Cap 600, Russell 2000, and MSCI Emerging Markets (October 2002 to November 2007)](https://imgur.com/a/wvhX6Iw)\n\n[MSCI Hong Kong (a proxy for HSI, which doesn't show up on Y Charts for whatever reason) versus S&P Small Cap 600](https://imgur.com/AQ1LMZn)\n\n[Gold Versus Effective Federal Funds Rate, 2000-2024](https://imgur.com/ux5zNeg)\n\nThis will be a 2-part article. Part 1 is dedicated to explaining what the Financial Conditions Impulse on Growth is, and how its twists and turns are an excellent predictor for the fortunes off the small-cap sector. Part 2 will explore why Chinese indexes have such strong correlation with the S&P 600 and how the very end of the gold vs FFR chart signals a sea change in the commodity landscape.\n\n**Oh No, Another Obscure Fed Chart...**\n\nThe FCI-G was a new Fed index that debuted on June 15, 2023, and it was deliberately created to address some nagging discrepancies their analysts had with other measures of the macroeconomic landscape.\n\n[The Fed - A New Index to Measure U.S. Financial Conditions (federalreserve.gov)](https://www.federalreserve.gov/econres/notes/feds-notes/a-new-index-to-measure-us-financial-conditions-20230630.html)\n\nTo briefly summarize, they found indices like the NFCI or the Bloomberg FCI were often too abstract with the implications of their statistical models or too opaque with regards with how they weighed their variables. The models didn’t translate their findings into straightforward commentary on economic activity or the state of the economy. A secondary issue was how macro models treated economic indicators from a *sub specie aeternitatis* perspective, failing to note that changes in policy and other variables had dispersed impact over time. So they created a new index, which collects seven different components to create a simple representation of how favorable economic conditions are in the United States. Anything above 0 represents a tightening of conditions, and below 0 a loosening: positive values reflect headwinds to GDP growth and negative values imply tailwinds. The 3-year lookback contributes the delayed effects of earlier changes in the model's variables onto the 1-year lookback. The seven components are:\n\n* Federal Funds Rate\n* 10-Year Treasury Yield\n* 30-Year Fixed Mortgage Rate\n* BBB-Rated Corporate Bonds Yield\n* Dow Jones Stock Market Total Return Index (this is not the DJI, this is the DWCF)\n* Zillow Home Price Index\n* Nominal Broad Dollar Index\n\nFor me the technical logic behind the weighing process is fascinating, but tedious for an investor. What matters for you is what it predicts and corroborates with.\n\n**Richard Driehaus' Playhouse**\n\nSince 1990 the FCI-G has had a positive value peak that strongly reversed into negative territory in 4 instances: January 1995, September 2002, February 2009, and February 2016^1. Three of these points came at the end of a recession or crash, paralleling enormous bull runs out of small caps. Depending on which index you select, emerging markets also enjoyed the same radical trajectory. These are the rare instances where small caps/emerging markets outstrip the general indices by significant margins, and their effective timespans vary by quite a bit.\n\nLet’s compare the relative performance indices during those runs. Here are the troughs and peaks of the Hang Seng (HSI), S&P Small Cap 600 (SML), Russell 2000 (RUT), and MSCI Emerging Markets (MSEM) before they consolidated or declined for a three-month period. We will place them alongside the S&P 500 (SPX) and NASDAQ Composite (IXIC) to see if and by how much they outperformed/underperformed the big boys. Due to the frequent lack of synchronicity between the various indexes, I’ve included two different time spans for the S&P and NASDAQ: one specifically contemporaneous to the Hang Seng’s trajectory, the other for the small cap and EM indices.\n\nNote the MSEM’s results should be taken with a large grain of salt. Its composition has changed greatly through time, and the influence of the 7-year cycle on its returns is contingent on geographical exposure. ASEAN made up the vast majority of the EM Asia section before 1995, and the 1997 Asian financial crisis saw a drastic rebalancing in favor of South Korea and Taiwan. Since 2000 it has gained more and more exposure to China, making the overall index more sensitive to swings in the Chinese economy. Between 1991 and today, Latin America’s representation has shrunken from 50% to barely under 10% - the MSEM doesn't reflect its up-and-downs.\n\nAdditionally, HSI doesn't show up on YCharts searches. I used SeekingAlpha for its growth values and dates.\n\n[**First FCI-G Plateau and Drop (January 1995) - Alan Greenspan...increased rates?**](https://imgur.com/TOWztKa)\n\n|**Index**| **Time Period** | **Increase**|\n|-------------|----------------------|-------------------|\n| HSI | 1/9/1995 – 7/27/1997 | 7252.34 → 16379.22 (126%) |\n| SML | 12/12/1994 – 5/4/1998 | 88.14 → 203.09 (130%) |\n| RUT | 12/09/1994 – 4/20/1998 | 235.71 → 490.27 (108%) |\n| MSEM | No correlation | No correlation |\n| SPX | 12/08/1994 – 7/27/1997 | 445.45 → 936.45 (110%) |\n|-------| 12/08/1994 – 4/14/1998 | 45.45 → 1115.75 (150%) |\n| IXIC | 12/09/1994 – 7/27/1997 | 719.05 → 1563.53 (117%) |\n|------| 12/09/1994 – 4/22/1998 | 719.05 → 1917.61 (167%) |\n\nIt would be remiss to not point out the Hang Seng’s rise was smothered by the Asian financial crisis. Yet it recovered quickly from being reset. From 8/10/1998 to 7/17/2000 the HSI went from 7224.69 to 17920.86 (148%), erasing all its losses and then some.\n\n[**Second FCI-G Plateau and Drop (September 2002) – End of The Dot-Com Crash**](https://imgur.com/TOWztKa)\n\n|**Index**| **Time Period** | **Increase**|\n|-------------|----------------------|-------------------|\n| HSI | 4/21/2003 – 10/29/2007 | 8409.1 → 30,468.3 (+262%) |\n| SML | 10/9/2002 – 7/19/2007 | 170.73 → 445.19 (161%) |\n| RUT | 10/02/2002 – 7/13/2007 | 327.09 → 855.79 (162%) |\n| MSEM | 10/11/2002 – 10/29/2007 | 255.98 → 1338.30 (423%) |\n| SPX | 10/02/2002 – 7/19/2007 | 776.76 → 1553.08 (100%) |\n|---| 10/02/2002 – 10/09/2007 | 776.76 → 1565.15 (102%) |\n| IXIC | 10/09/2002 – 10/29/2007 | 1114.11 → 2817.44 (153%) |\n|---| 10/09/2002 – 7/19/2007 | 1114.11 → 2720.04 (144%) |\n\n[**Third FCI-G Plateau and Drop (February 2009) – End of the Great Financial Crisis**](https://imgur.com/96Bnxjm)\n\n|**Index**| **Time Period** | **Increase**|\n|-------------|----------------------|-------------------|\n| HSI | 3/02/2009 – 4/27/2015 |11921.52 → 28133 (236%) |\n| SML | 3/09/2009 – 6/23/2015 | 181.79 → 742.13 (308%) |\n| RUT | 3/09/2009 – 6/23/2015 | 343.26 → 1295.80 (277%) |\n| MSEM | 3/02/2009 – 5/2/2011 | 475.08 → 1206.49 (154%) |\n| SPX | 3/09/2009 – 4/27/2015 |676.53 → 2108.92 (212%) |\n|---| 3/09/2009 – 6/23/2015 | 676.53 → 2124.20 (214%) |\n| IXIC | 3/09/2009 – 4/27/2015 |1268.64 → 5060.25 (299%) |\n|---| 3/09/2009 – 6/23/2015 | 1268.64 → 5160.09 (307%) |\n\n[**Fourth FCI-G Plateau and Drop (February 2016) – China Sell-off, NA + EU Sell-off, Brexit Vote Announcement, Plunging Oil Prices**](https://imgur.com/kafzpVH)\n\n|**Index**| **Time Period** | **Increase**|\n|-------------|----------------------|-------------------|\n| HSI | 1/18/2016 – 1/22/2018 | 19080.51 → 33154.12 (74%) |\n| SML | 2/1/2016 – 8/27/2018 | 605.16 → 1098.36 (81%) |\n| RUT | 2/11/2016 – 8/30/2018 | 953.72 → 1732.35 (82%) |\n| MSEM | 1/21/2016 – 1/26/2018 | 688.52 → 1273.07 (85%) |\n| SPX | 2/11/2016 – 1/26/2018 | 1829.08 → 2872.87 (57%) |\n|---| 2/11/2016 – 8/29/2018 | 1829.08 → 2914.04 (59%) |\n| IXIC | 2/11/2016 – 1/26/2018 | 4266.84 → 7505.77 (76%) |\n|---| 2/11/2016 – 8/31/2018 | 4266.84 → 8109.54 (90%) |\n\nWe can see that the returns range from ho-hum to spectacular. 1995 saw the S&P and NASDAQ beat its competition within the allotted periods except for HSI. Then the former got trounced by all of them, with tech trailing a bit behind RUT and SML. The end of the Great Financial Crisis saw amazing returns out of the first 3 although the NASDAQ bested every index except SML (barely). Similarly, IXIC went neck-to-neck with the smaller groups after the 2015-2016 Chinese crash leaked into other markets creating a chain reaction.\n\n**Unlike Todd Howard's Games, It Just Works**\n\nAt the end of October 2023, the FCI-G indicator peaked, dropped, and has continued to drop until a slight uptick in April. This is reflected in several of the FCI-G's components.\n\n* [The 10-year yield](https://imgur.com/OKAgU0g) broke 5% back on October 19 before wobbling around 4.86-4.89 for the next ten days. On October 31 it stumbled down the stairs to end up at 3.8% before New Year’s. Since then, it’s climbed back to 4.55%, threatening to break out above 4.70% in mid-April. In perfect synchronicity, [the BBB corporate effective yield](https://imgur.com/OKAgU0g) went from 6.66% to 5.24% in the same period before retracing the 10-year’s path higher. Ditto for the [30-year fixed mortgage](https://imgur.com/iADC76Z).  \n* One day later, [the dollar index](https://imgur.com/mGl9YQ7) hit 107 before beginning its slow decline down to 101 by December 27th.\n\nThe catalyst for these downturns was the Fed meeting on November 1, where it was agreed that interest rates needed to stay at 5.25-5.50% for the foreseeable future. Interestingly, in a textbook case of emergent sentiment the market didn't take Powell and co. at their word. They fervently began to price in \\*rate cuts\\*, as many as 6 in 2024, and maintained that rosy outlook until roughly April. As deluded as those expectations might've been, they presaged the decline of all four indicators - three related to the cost of capital, one to the cost of living.\n\nWhat we’ve seen from the smaller indices matches well with history. Since early 2021, [the Russell 2000 had been locked in a consolidation phase that’s left it lagging far behind SPX and NASDAQ](https://imgur.com/X3RYLwg). The end of the 2002 everything bubble shifted it into a lower level where it continued to move sideways. It futilely banged its head against the 2050 resistance line 3 times before shoving past it at the end of October (not a coincidence). Furthermore, RUT’s support levels have currently stabilized above the 50 and 200 SMA – it has significant momentum. The index is now seeking to breach the next resistance level of 2130, its old peak from March 30, 2022.\n\nAnd guess what? [The S&P Small Cap 600 had imitated the exact small cycle and broke out on the same day](https://imgur.com/WJJzdRL). Even the MSEM, as mercurial and underwhelming its reaction has been in the last two cycles, has [mutedly followed suit](https://imgur.com/oHRgUi4).\n\nHopefully I've convinced you that the FCI-G is a meaningful predictor and harbinger of changes in the market. It has unerringly signaled both the base price movement and long-term trajectory of small-cap and EM indices for almost 30 years, and we should expect great returns within these sectors over the next 3-5 years. Yet I'd further argue this is understating the nature of the tailwinds propelling these less-favored stocks. Several macroeconomic trends are lining up to hint that this iteration won't be like 2009, 2016, or 1995. If anything, expect the future to look more like 2002. Why? I'll dive more deeply into the plumbing, so to speak, of the world economy and how the 2010s were a historical outlier in Part 2. In addition, I'll give recommended sector-based actions^2. \n\n^1 COVID was an exogenous event that forced quantitative easing, while the other four were driven by economic trends with some outside impact. \n\n^2 I'm not going to give out names/tickers for any individual stocks that aren't already listed in my portfolio. The reason is simple: the information I've presented is easy to obtain, but doing research to ferret out the companies with maximum potential upside and least market attention is time intensive. People pay me to do this for them. Why should I screw them over by giving it away for free?",
  "link_flair_text": null,
  "id": "1d6ifat",
  "num_comments": 20,
  "created_utc": 1717349264,
  "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/",
  "comments": [
    {
      "id": "l6t6i3o",
      "score": 23,
      "body": "I am reading all this now.  I actually enjoy in depth analysis.  Your effort was not in vain",
      "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/l6t6i3o/",
      "created": 1717357810,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6sy936",
      "score": 13,
      "body": "I think the evidence is all there, what's going to work on the average person though isn't this. It's going to be at least two quarters of small cap out performance and CNBC talking about small caps everyday. Then you'll see the real run begin",
      "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/l6sy936/",
      "created": 1717354732,
      "depth": 0,
      "replies": [
        {
          "id": "l6x4m9o",
          "score": 2,
          "body": "That’s what I’m counting on. Hedge funds and other institutions have limited exposure for obvious reasons, but they'll gradually get in (already doing so for the Russell Reconstitution). By the time retail investors flood in, the window for big gains has already passed.",
          "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/l6x4m9o/",
          "created": 1717427053,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6tviu0",
      "score": 9,
      "body": "OP is into stocks and Jennifer Connelly. A man of culture.",
      "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/l6tviu0/",
      "created": 1717367436,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6uthya",
      "score": 9,
      "body": "I found no misspelling. continue.",
      "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/l6uthya/",
      "created": 1717381757,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6sl41f",
      "score": 14,
      "body": "Who tf has time to read let stand write this goddamn. Good work though I guess, but I’m missing an action. What’s tour conclusion? What should mankind do",
      "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/l6sl41f/",
      "created": 1717349916,
      "depth": 0,
      "replies": [
        {
          "id": "l6spg4u",
          "score": 13,
          "body": "That's what Part 2 is for. Part 1 is to showcase the FCI-G is a reliable predictor of market trends instead of a weak one. If it was the latter, there would be no point in using it to make investing decisions: the values could just be random noise.",
          "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/l6spg4u/",
          "created": 1717351496,
          "depth": 1,
          "replies": [
            {
              "id": "l6tuk47",
              "score": 7,
              "body": "When’s part two?",
              "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/l6tuk47/",
              "created": 1717367043,
              "depth": 2,
              "replies": [
                {
                  "id": "l6wweb7",
                  "score": 5,
                  "body": "3-5 days. Compiling and condensing research from many different missives - believe it or not, I don’t do all this legwork myself - is the biggest hurdle.",
                  "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/l6wweb7/",
                  "created": 1717424127,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l6uektg",
      "score": 4,
      "body": "What is the risk of overfitting here? Data collected today is significantly more robust than data 30 years ago so I don't know how this is being applied retroactively without that consideration.",
      "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/l6uektg/",
      "created": 1717375361,
      "depth": 0,
      "replies": [
        {
          "id": "l6xionw",
          "score": 1,
          "body": "The Fed is using rather broad metrics that naturally incorporate factors (e.g. the mortgage rate has other inputs besides FFR) and reactive to others, so they're avoiding the danger of unseen data being the main drivers. Their weighting criteria is on the page I linked. \n\nImportantly, FCI-G is not used by the Fed as a predictive model either. My observations were made independently.",
          "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/l6xionw/",
          "created": 1717431867,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6smzp1",
      "score": 15,
      "body": "TLDR. No one’s reading all that lol",
      "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/l6smzp1/",
      "created": 1717350595,
      "depth": 0,
      "replies": [
        {
          "id": "l6sy39h",
          "score": 25,
          "body": "Honestly if you guys aren't doing two to four hours a day of research 7 days a week, how in the world do you ever think you're going to outperform buy and hold spy? \n\nIf you don't wake up in the morning thinking about markets, think about them a little more in the middle of the day, then think about them when you're falling asleep, your chances of outperforming are very very small",
          "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/l6sy39h/",
          "created": 1717354672,
          "depth": 1,
          "replies": [
            {
              "id": "l6t98yo",
              "score": 3,
              "body": "Half the people who do the research underperform the market. So why should I? 🙃",
              "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/l6t98yo/",
              "created": 1717358838,
              "depth": 2,
              "replies": [
                {
                  "id": "l6tg2zt",
                  "score": 10,
                  "body": "90 people aren't going to finish in the top 10 on a 100-person marathon either. The reason everyone joins that marathon is to see if they have what it takes and that's the same way the market works. \n\nAbout 10% of people are profitable running active and of those the top few percent are the ones that are really making money. \n\nThe better answer to your question is if you realize that that is not you, buy and hold the index, it's your best path to making money",
                  "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/l6tg2zt/",
                  "created": 1717361378,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l6vbew0",
      "score": 2,
      "body": "It seems that to generate alpha these days, you need to identify larger cyclical and nuanced trends and charting is really the most efficient way to do it. Past performance doesn’t predict future returns but history rhymes.",
      "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/l6vbew0/",
      "created": 1717390814,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7i3f40",
      "score": 1,
      "body": "People just need advice if AVUV will outperform vt vti or qqq",
      "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/l7i3f40/",
      "created": 1717751078,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6ssh27",
      "score": 1,
      "body": "So where is part 2?",
      "permalink": "/r/stocks/comments/1d6ifat/the_secular_small_cap_cycle_a_primer/l6ssh27/",
      "created": 1717352602,
      "depth": 0,
      "replies": []
    }
  ]
}