{
  "title": "Made $2825 in ~8 years in trading stocks and options! Took me ~40 years to MASTER NOTHING! Excited to blow my account up again!",
  "score": 733,
  "selftext": "Seriously though. Don’t gamble what you can’t afford to lose. The best thing 99% of us can do to grow our wealth is figure out wtf you’re good at, get a job doing that, do it well, and grow your income rather than depend on meme stocks and 0DTEs. \n\nBought 87 $526 SPY puts expiring today on the Friday runup. Was down big this morning but held like and idiot and it worked out. ",
  "link_flair_text": "Meme",
  "id": "1d7702q",
  "num_comments": 71,
  "created_utc": 1717427993,
  "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/",
  "url_overridden_by_dest": "https://i.redd.it/521fpfh6jd4d1.jpeg",
  "comments": [
    {
      "id": "l6x7c8d",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 5 months ago\n**Total Comments** | 52 | **Previous Best DD** | \n**Account Age** | 14 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6x7c8d/",
      "created": 1717428000,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6xc89s",
      "score": 180,
      "body": "You could make that in just ONE YEAR working at Wendys.",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6xc89s/",
      "created": 1717429669,
      "depth": 0,
      "replies": [
        {
          "id": "l6xf373",
          "score": 23,
          "body": "It's hard work though",
          "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6xf373/",
          "created": 1717430635,
          "depth": 1,
          "replies": [
            {
              "id": "l6yehj5",
              "score": 13,
              "body": "But it's probably less mentally taxing than trading",
              "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6yehj5/",
              "created": 1717442468,
              "depth": 2,
              "replies": [
                {
                  "id": "l71emp7",
                  "score": 4,
                  "body": "It taxes your throat instead of",
                  "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l71emp7/",
                  "created": 1717491915,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l6xg1vx",
          "score": 26,
          "body": "I make more by the dumpster though.",
          "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6xg1vx/",
          "created": 1717430968,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l6xs5d9",
          "score": 7,
          "body": "or behind Wendy's",
          "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6xs5d9/",
          "created": 1717435053,
          "depth": 1,
          "replies": [
            {
              "id": "l6xwger",
              "score": 7,
              "body": "Overachiever.",
              "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6xwger/",
              "created": 1717436495,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l6x8trd",
      "score": 77,
      "body": "You would have made more money just buying and holding SPY ETF’s than this strategy",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6x8trd/",
      "created": 1717428509,
      "depth": 0,
      "replies": [
        {
          "id": "l6x9fvt",
          "score": 50,
          "body": "Thus why it’s a meme and not a serious post. It’s been a slow iteration of throwing $1000 away every couple of years for the last 8 for memes. Up 163% in the last 3 months with stupidly risky plays based solely on vibes.",
          "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6x9fvt/",
          "created": 1717428721,
          "depth": 1,
          "replies": [
            {
              "id": "l6zl56n",
              "score": 3,
              "body": "Wow wish I had a dick too",
              "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6zl56n/",
              "created": 1717457621,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l746mmy",
              "score": 1,
              "body": "Vibes are your only *real* basis if you're trading memecoins to begin with. They don't follow fundamentals for direction and magnitude, only for entry and exits. Maybe your problem is that you *haven't* been trading off vibes in a purely vibe-driven sector of finance. \n\nI only do a small portion of what I trade in meme stocks/coins, but when I do I do it based off sentiment alone and just use pretty basic wyckoff analysis for entry/exit. Thats really the way to go for meme assets. I'm pretty massively profitable with them, but I'm also pretty sure I'd lose sleep over whether I was or not because if I had a large portion of my accrued wealth stored there (which means emotions would probably come into play and screw up my strategy). I'll take good, consistent gains and peace of mind over great, but inconsistent gains and loss of quality of living any day.",
              "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l746mmy/",
              "created": 1717531921,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l6xcndw",
              "score": -2,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6xcndw/",
              "created": 1717429813,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l6xan0c",
      "score": 18,
      "body": "> The best thing 99% of us can do to grow our wealth is figure out wtf you’re good at, get a job doing that, do it well, and grow your income rather than depend on meme stocks and 0DTEs.\n\nThe best that 99% of us can do is to give the fuck up and lay down flat. But gambling is just more fun.",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6xan0c/",
      "created": 1717429132,
      "depth": 0,
      "replies": [
        {
          "id": "l71cqzv",
          "score": 1,
          "body": "You can buy SPY too. No need to give up on that",
          "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l71cqzv/",
          "created": 1717490503,
          "depth": 1,
          "replies": [
            {
              "id": "l71gj6q",
              "score": 3,
              "body": "You can also buy bubble wrap, fake nobility titles, or ornamental gourds. The simple fact is that plebs aren't supposed to be able to build wealth. This is by design. We can tell ourselves that there are individual actions that we can take that will reliably help us get ahead, and I'm not denying that some options are better than others, but if none of the options are good enough, it simply doesn't matter whether you go with the good or the bad option, the risky or safe option, or simply refuse to play. The outcome is still the same. You're stuck with the grind and being subservient to the owning class and at the mercy of powers that serve them, not you. Any metric of \"getting ahead\" won't change your place in the food chain, unless you decide to go for the high risk, high reward, hare brained schemes, and get obscenely lucky. If you do, then yes, there is a chance. If you don't, then you're putting your working hard into buying yourself an illusory sense of security that can evaporate at any moment, through no fault of your own, by deliberate design to keep you dependent and subservient to your superiors.\n\nI personally say fuck that shit. I'll be proactive and evaporate those efforts myself, and there is only so much cocaine you can buy before it becomes a problem.",
              "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l71gj6q/",
              "created": 1717493350,
              "depth": 2,
              "replies": [
                {
                  "id": "l71p8rs",
                  "score": 2,
                  "body": "Sorry, I'm not buying that. Not 100% unconditionally at least. Then again, I'm not a US resident so my situation is somewhat better than what I assume most people have here in this sub.\n\nI see it more of a \"find the place you belong\" issue, that's where your opportunities lie - and it may be tied to wealth but not solely defined by that. And if your environments are fucked up, then time to risk it and move on. Not easy, and maybe you won't find a less-fucked-up place, but you gotta try.\n\nOf course it's just my world view and everything largely depends on what do you want from life. I don't care that much about not being higher on the food chain, I do things for survival, comfort, and happiness.\n\nIf you focus more on some of these, and less on others, that's fine too. But for me, SPY can buy a small portion of these.\n\nEDIT: and ofc it's all very subjective, even \"opportunity\" means something else for you than for me",
                  "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l71p8rs/",
                  "created": 1717499063,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l71rfb4",
                      "score": 1,
                      "body": "I'm not in the US either, but this applies even harder to them. But to a significant degree, it's the same for the vast majority of people. You might not be risking a medical bankruptcy or being fired on the spot just because your boss is in a bad mood, but there are still things out of your control that can and will fuck you up. Inflation hits and pushes the cost of living up to levels where you can no longer afford even your meager investments, the housing market balloons deflating the value of those investments to where you'll never be able to compete in the market, housing bubble bursts and your loans now exceed the value of your property, market does a 90's Japan and your attempts at wealth creation just evaporate. Over the course of a lifetime, those things can and will happen, and in the best case scenario where they don't, or you manage to mitigate the effects, you're left with a safe retirement, maybe even a few years early, after working your entire life to build actual, tangible wealth for a class of people you will never join.\n\nFuck all of that shit. It's a coping mechanism for the middle class.",
                      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l71rfb4/",
                      "created": 1717500283,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l728cyf",
                          "score": 2,
                          "body": "Honestly, I don't want to argue because many if not most of these are true but personally I insist the system isn't going anywhere and what I see a bigger problem is that people are \"lost\", mentally, with wealth and without wealth alike.\n\nIf you gamble with stocks and options, rather than SPY, because you don't seem the point in it, then I don't mind, your money your decisions.\n\nBut I can't recommend the same for 15.6 million followers here, with an honest heart and clean conscience.",
                          "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l728cyf/",
                          "created": 1717508017,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l74cnbz",
                          "score": 2,
                          "body": "Honestly, I don't really buy this. Its a sound argument, and a lot of the stuff you said is true, but your whole basis is inductive reasoning which leads to a generalization that you don't know is accurate. \n\nYour argument can be summed up as follows:\n\n\"Because I personally have not met anyone who has escaped wage slavery without excessive risk taking means that that must not exist due to the factors I view as oppressive in nature that make it difficult to achieve.\"\n\nI'm living proof this isn't the case. Im less than 30, own my own home and two cars on an acre of land, just purchased my first rental property, and my only debt is my last car which only has $5000 left to pay at a 1.2% interest rate and my new rental property which pays for itself and then some. I even have 2 kids and am the sole income for us. And no, I was not born into wealth nor did I ever have any money fall into my lap. I was born into a lower middle class family, that became borderline impoverished after unexpected medical bills. I've received nothing from inheritance, and the only money I ever got from anyone (without laboring for it) was $1000 from my parents when I moved out and they paid for half of my first car (which I paid them back for when I sold it). I never won the lottery or anything like that. Finances have just always made sense to me. And I've helped several of my friends and family out of wage slavery as well. Investing alone is not the answer. Its a combination of investing, budgeting, and living far below your means. It isn't the most glamorous way to live, and it does involve on giving up on a lot of things like eating out or going to the club, but I'd prefer a home cooked meal and to be at home with a book and my family anyways. \n\nThe point is, it is completely possible to claw your way slowly to the top. I'm under 30 and own a home, 2 vehicles, a rental property, and have 2 kids and a wife I provide for comfortably in one of the most expensive areas of the United States. It IS possible. \n\nThe key is to build credit when you're young, as much as possible, then leverage that credit to get a low interest loan and put it into a safe asset that will outpace your interest rate (real estate usually is good for that, I also like SPY and some crypto, occasionally e bonds depending on the market but rarely). I try to diversify between sectors, as risk mitigation is more important than capital generation and most people don't get that. If you lose 50%, you need to make back 100% to be even). You can then leverage a portion (ideally calculate your expected profit over the duration of the loan and use that as your collateral to prevent overleveraging) those safe assets for an overcollateralized low interest loan which i personally then use as my trading fund, and stick to defined risk strategies only so I don't blow the account. At that point, anything over 10%/year is excess profit you wouldn't get with a passive strategy more than likely. \n\nWhile you're doing all this, budget your finances and stick with that budget. Cut out unnecessary things like going out constantly or getting 1st class tickets. If you drink or smoke, sit down and calculate how much you spend per year on that. Now think about how many years you've been doing it. Now think about the interest on all of that money. Discipline is the key to success. People think it is impossible because it is daunting and it requires things that one may be uncomfortable with such as sacrificing personal excesses, as well as the fact that the system is designed to prevent this. \n\nSorry for the rant, I just hate to see people who have given up insisting that others give up as well. Thats a bit of a sunk cost fallacy, just in reverse. The key isn't just investing, and you won't find it just on reddit. The real way out of the rat race is through personal discipline and forward thinking. The problem is, our meat puppet brains don't like to think ahead, especially when we're talking in terms of percentages and chances like finance. Once you can learn to do that, you can see the way out",
                          "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l74cnbz/",
                          "created": 1717533891,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l7o8lr9",
          "score": 1,
          "body": "Underrated post",
          "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l7o8lr9/",
          "created": 1717853252,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6x7o4s",
      "score": 22,
      "body": "https://preview.redd.it/esbkssmgjd4d1.jpeg?width=1290&format=pjpg&auto=webp&s=d262dbd020ecb010634ae565c7d53583e6f8185e\n\nHere are the actual trades to finish me up. Enjoy your week regards.",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6x7o4s/",
      "created": 1717428112,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6ypeh9",
      "score": 6,
      "body": "Thank you, you make me feel good about my modest gains, Mostly Ares Capital for that safe 15 percent gain, but bought Amd at 107 and meme stock at 14. Lost 3k on keybank the banking panick tho",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6ypeh9/",
      "created": 1717446074,
      "depth": 0,
      "replies": [
        {
          "id": "l6yr0dl",
          "score": 1,
          "body": "Happy to help people feel better about themselves. Whether it’s wins OR losses. \n\nDid throw almost all of the gains back at TSLA puts because Elon’s being ridiculous lately. We’ll see how that goes.",
          "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6yr0dl/",
          "created": 1717446630,
          "depth": 1,
          "replies": [
            {
              "id": "l6yywes",
              "score": 1,
              "body": "So what's the deal with puts and option I just unlocked them on robinhood put 7k over there been doing mist of mine on fidelity.*",
              "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6yywes/",
              "created": 1717449292,
              "depth": 2,
              "replies": [
                {
                  "id": "l6z1xvu",
                  "score": 2,
                  "body": "Dude. Just disregard options for the most part unless you are either \n\nA) a gambling addict\n\nB) farming for karma \n\nC) know something more than the smartest folks on Wall Street with the best compute/algos",
                  "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6z1xvu/",
                  "created": 1717450367,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l71d5a0",
                      "score": 1,
                      "body": "That's what I experience from everyone in this sub too",
                      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l71d5a0/",
                      "created": 1717490799,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l6yyxk2",
                  "score": 1,
                  "body": "https://preview.redd.it/jcukurqjaf4d1.jpeg?width=1078&format=pjpg&auto=webp&s=b83b3b27a77c5bfa3c78577afa4e0242fe949c01",
                  "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6yyxk2/",
                  "created": 1717449304,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l6ybatk",
      "score": 5,
      "body": "Being in the green never hurt. \n\nDon't be dumb and waste it.",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6ybatk/",
      "created": 1717441412,
      "depth": 0,
      "replies": [
        {
          "id": "l6yporf",
          "score": 1,
          "body": "How much in the green should be be over the last year considering the markets gone up 14 percent on its own.",
          "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6yporf/",
          "created": 1717446173,
          "depth": 1,
          "replies": [
            {
              "id": "l6z1noo",
              "score": 0,
              "body": "YTD is 180% as of now.",
              "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6z1noo/",
              "created": 1717450266,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l6xob05",
      "score": 3,
      "body": "You should have added Bernie Sanders meme to this…”I’m once again…”",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6xob05/",
      "created": 1717433761,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6yu25x",
      "score": 3,
      "body": "That's a starting point of about $7300 which, if you put it directly into an S&P 500 fund 8 years ago instead of whatever you did here, would now be worth about $18,000",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6yu25x/",
      "created": 1717447646,
      "depth": 0,
      "replies": [
        {
          "id": "l6yulbq",
          "score": 1,
          "body": "Yes. This has not been pointed out in the post by anyone else at all! Thanks!\n\nAnd also because of the way RH does all-time it shows all contributions happening at the start (threw $3400 in over the last three months and now we’re here)",
          "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6yulbq/",
          "created": 1717447822,
          "depth": 1,
          "replies": [
            {
              "id": "l6z2mlm",
              "score": 1,
              "body": "Really? No one else pointed it out? Surprising.\n\n...wait a minute I'm checking these other comments now. Quite a few of them pointed this out! You lied to me!",
              "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6z2mlm/",
              "created": 1717450613,
              "depth": 2,
              "replies": [
                {
                  "id": "l6z50bx",
                  "score": 1,
                  "body": "All good baby. And yeah I’m an awful investor. Just happy to finally be back in the green and now I can just get back to ETFs.",
                  "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6z50bx/",
                  "created": 1717451467,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l6x9hz2",
      "score": 2,
      "body": "If ones strategy isn't working out . Then one should stop and look at changing strategies. Just saying.",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6x9hz2/",
      "created": 1717428741,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6xre37",
      "score": 2,
      "body": "Lmao",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6xre37/",
      "created": 1717434798,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6xs2ya",
      "score": 2,
      "body": "Should have just bought $SPY shares and held 🤦‍♂️",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6xs2ya/",
      "created": 1717435031,
      "depth": 0,
      "replies": [
        {
          "id": "l6xsv54",
          "score": 3,
          "body": "$3900 of the total thrown in has been over the last three months. So doubt. I’m holding etf’s in my retirement and serious accounts. This is solely for meme gambles.",
          "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6xsv54/",
          "created": 1717435293,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6xw7pd",
      "score": 2,
      "body": "Better than mastering loss",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6xw7pd/",
      "created": 1717436414,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6y1d3c",
      "score": 2,
      "body": "Where's our loss porn to feel better about ourselves",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6y1d3c/",
      "created": 1717438124,
      "depth": 0,
      "replies": [
        {
          "id": "l6y1xt7",
          "score": 5,
          "body": "Sorry no loss porn. This is a realized gain 😭. I’m cashing this account out other than some 6/21 $175 Tesla puts (currently up 25%)",
          "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6y1xt7/",
          "created": 1717438318,
          "depth": 1,
          "replies": [
            {
              "id": "l71d8f2",
              "score": 1,
              "body": "I'm proud of ya, choom.",
              "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l71d8f2/",
              "created": 1717490863,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l6y253z",
      "score": 2,
      "body": "putting money in a stock to watch it go up and down is not trading especially on this chart.",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6y253z/",
      "created": 1717438387,
      "depth": 0,
      "replies": [
        {
          "id": "l6y2oqk",
          "score": 2,
          "body": "If you want me to list every position I’d be happy to. Really I just lost a lot until three months ago when I decided to just start trading on vibes and take some wins when I could.\n\nMostly in the last couple months it’s been:\n\nshort dated SPY puts\nTSLA puts\nBrief period of flirting with RIVN stock and long dated calls\nBack to SPY and TSLA puts\n\nAnd a whole lot of getting lucky.",
          "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6y2oqk/",
          "created": 1717438570,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l6ya0up",
      "score": 2,
      "body": "You probably lost more than that when you factor in taxes",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6ya0up/",
      "created": 1717440991,
      "depth": 0,
      "replies": [
        {
          "id": "l6ydc64",
          "score": 3,
          "body": "This year yes. But when you factor in loss harvesting over the years from being an idiot it all comes out in the wash.",
          "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6ydc64/",
          "created": 1717442089,
          "depth": 1,
          "replies": [
            {
              "id": "l6ye5oi",
              "score": 2,
              "body": "Sure if your CPA was able to deduct 3k of losses each year for the last 40 years. But most people aren't able to do that unless you lost at least 3k the first year and more every other year following lol.\n\nBut for all intents, its about a wash.",
              "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6ye5oi/",
              "created": 1717442361,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l70j5rs",
      "score": 2,
      "body": "ONE OF US!  ONE OF US!![img](emote|t5_2th52|4267)",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l70j5rs/",
      "created": 1717472062,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6xiu6a",
      "score": 2,
      "body": "At least you're not -$30k.  It could have been worse...",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6xiu6a/",
      "created": 1717431920,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6ynlmc",
      "score": 1,
      "body": "*looks in the mirror*\n\nAre you me \nOr\nI am you",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6ynlmc/",
      "created": 1717445483,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6yo422",
      "score": 1,
      "body": "lololz  I love your Socratic attitude... must be why you seem to be in-the-green",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6yo422/",
      "created": 1717445648,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6yo5de",
      "score": 1,
      "body": "Wait you’re making money ??",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6yo5de/",
      "created": 1717445660,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6yvu4h",
      "score": 1,
      "body": "BHAHAHAHAH i feel this big time",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6yvu4h/",
      "created": 1717448237,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6z97an",
      "score": 1,
      "body": "This would be worth close to 30k probs if you just left it in SPY",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6z97an/",
      "created": 1717453010,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l6zov97",
      "score": 1,
      "body": "[removed]",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6zov97/",
      "created": 1717459107,
      "depth": 0,
      "replies": [
        {
          "id": "l6zove7",
          "score": 1,
          "body": "Oh my gourd! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l6zove7/",
          "created": 1717459108,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l711ujo",
      "score": 1,
      "body": "nice gains tho, some people lose everything",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l711ujo/",
      "created": 1717482861,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l714t93",
      "score": 1,
      "body": "I learned a lot about investing in good institutional quality stocks from investors Business Daily (Investors.com). They have a lot of useful tools too.",
      "permalink": "/r/wallstreetbets/comments/1d7702q/made_2825_in_8_years_in_trading_stocks_and/l714t93/",
      "created": 1717484622,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "The post discusses a trading experience and mentions buying SPY puts.",
    "companies": [],
    "tickers": [
      "SPY"
    ],
    "main_ticker": [
      "SPY"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "The user shares their 8-year trading experience and recent success with SPY put options, emphasizing caution when trading.",
    "stock_recommendations": "The user is recommending to sell SPY through put options.",
    "is_recommending_stock_buying_or_selling": true,
    "buy_or_sell": "sell",
    "sentiment_summary": "There is negative sentiment as the author discusses selling SPY through puts and cautions against risky trading.",
    "sentiment": "negative"
  }
}