{
  "title": "FDIC Says 63 Lenders on Brink of Insolvency but doesn't give the names :|",
  "score": 197,
  "selftext": "[https://dailyhodl.com/2024/06/02/517000000000-in-unrealized-losses-hit-us-banking-system-as-fdic-warns-63-lenders-on-brink-of-insolvency/](https://dailyhodl.com/2024/06/02/517000000000-in-unrealized-losses-hit-us-banking-system-as-fdic-warns-63-lenders-on-brink-of-insolvency/)\n\n\n\nUnrealized losses in the US banking system are once again on the rise, according to new numbers from the Federal Deposit Insurance Corporation (FDIC).\n\nIn its Quarterly Banking Profile report, the FDIC [says](https://www.fdic.gov/news/speeches/fdic-quarterly-banking-profile-first-quarter-2024) banks are now saddled with more than half a trillion dollars in paper losses on their balance sheets, due largely to exposure to the residential real estate market.\n\nUnrealized losses represent the difference between the price banks paid for securities and the current market value of those assets.\n\nAlthough banks can hold securities until they mature without marking them to market on their balance sheets, unrealized losses can become an extreme liability when banks need liquidity.\n\n*“Unrealized losses on available-for-sale and held-to-maturity securities increased by $39 billion to $517 billion in the first quarter. Higher unrealized losses on residential mortgage-backed securities, resulting from higher mortgage rates in the first quarter, drove the overall increase. This is the ninth straight quarter of unusually high unrealized losses since the Federal Reserve began to raise interest rates in first quarter 2022.”* \n\nThe FDIC also says that the number of lenders on its Problem Bank List rose last quarter. According to the agency, these banks are on the brink of insolvency due to financial, operational, or managerial weakness or a combination of such issues.\n\n*“The number of banks on the Problem Bank List, those with a CAMELS composite rating of ‘4’ or ‘5’ increased from* ***52 in fourth quarter 2023 to 63 in first quarter 2024****. The number of problem banks represented 1.4% of total banks, which was within the normal range for non-crisis periods of 1% to 2% of all banks.*  ***Total assets held by problem banks increased $15.8 billion to $82.1 billion during the quarter.”*** \n\nWhile the FDIC says that the health of the US banking system is **at no imminent risk**, it warns that persistent inflation, volatile market rates and geopolitical concerns continue to put pressure on the industry.\n\n*“These issues could cause credit quality, earnings, and liquidity challenges for the industry. In addition, deterioration in certain loan portfolios, particularly office properties and credit card loans, continues to warrant monitoring. These issues, together with funding and margin pressures, will remain matters of ongoing supervisory attention by the FDIC.”* ",
  "link_flair_text": "potentially misleading / within normal range",
  "id": "1d7oro1",
  "num_comments": 89,
  "created_utc": 1717475909,
  "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/",
  "comments": [
    {
      "id": "l70rqpy",
      "score": 251,
      "body": "> The number of problem banks represented 1.4% of total banks, which was within the normal range for non-crisis periods of 1% to 2% of all banks.   \n   \nSounds like something is a bit overblown.",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l70rqpy/",
      "created": 1717476614,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l70ss3e",
      "score": 80,
      "body": "Lots of small unlisted banks in the US.  \n\n1.4% of the multi trillion banking sector is basically irrelevant. \n\nPosts like this make me think bank stock shorts are looking to cover.  Time to go long?",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l70ss3e/",
      "created": 1717477212,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l722gff",
      "score": 18,
      "body": "Of course they're not going to name names. That would cause runs on the banks and be totally counter productive.",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l722gff/",
      "created": 1717505592,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l70uatb",
      "score": 24,
      "body": "I see a lot of threads talking about this, but need a better source than dailyhodl. And need names",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l70uatb/",
      "created": 1717478099,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l71mpvo",
      "score": 6,
      "body": "63? Seems like a low number but thank you for your post",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l71mpvo/",
      "created": 1717497552,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l71vwry",
      "score": 4,
      "body": "These are typically debt securities. Most of which can be held for 10 - 25 years without actually realizing anything (gain or loss). Ehhh, I wouldn't put THAT much into this.\n\n HOWEVE the constantnt decline in market value, continuing for 10+ years can be detrimental. \n\nThis, especially if some of those debt securities are nearing maturity within the next 3-4 years.",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l71vwry/",
      "created": 1717502585,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l72a3n1",
      "score": 2,
      "body": "The usual regulator approach will be to draw a ring fence around all activities and heavily monitor, like attending board meetings, etc. These losses are paper only at this point, so panic not merited. Another implication to rapidly rising rates. This will be an easy seizure if that comes about, then merge with a stronger bank over a weekend and open as a new bank on MON. These are typically \"silent\" auctions with a short bid deadline. The subject banks will also be invited to seek a buyer, if OCC decides merited. A \"shotgun\" wedding.....of the financial variety!",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l72a3n1/",
      "created": 1717508693,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l72mvhe",
      "score": 2,
      "body": "Hasn't Jamie Dimon been saying debt is gonna be the problem.",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l72mvhe/",
      "created": 1717513304,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l73ujpd",
      "score": 2,
      "body": "This looks like good news to me:\n\n\"The number of problem banks represented 1.4% of total banks, which was within the normal range for non-crisis periods of 1% to 2% of all banks.\"",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l73ujpd/",
      "created": 1717527920,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l75bmoq",
      "score": 2,
      "body": "So what does this mean for the average consumer?",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l75bmoq/",
      "created": 1717546906,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l71sd9s",
      "score": 1,
      "body": "Quick, pump up Apple and Tesla!",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l71sd9s/",
      "created": 1717500790,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l726to9",
      "score": 1,
      "body": "Sounds like someone knows and will make lots of money",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l726to9/",
      "created": 1717507405,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l74tqvx",
      "score": 1,
      "body": "The whole system is highly leveraged\nEveryone is operating on debt, except the hood",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l74tqvx/",
      "created": 1717539914,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l74yppp",
      "score": 1,
      "body": "If people haven't already figured it out, as seems. To control the  narrative, I've mentioned a lot more going down. How many 5B as in Billions of dollars are we looking at. Wow.",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l74yppp/",
      "created": 1717541806,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l77m87l",
      "score": 1,
      "body": "We can't bail them out twice. America needs a crisis to save the dollar because our leaders do not understand the concept of a balanced budget",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l77m87l/",
      "created": 1717591985,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l78k46h",
      "score": 1,
      "body": "Where is the list of them problem banks ?",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l78k46h/",
      "created": 1717604182,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7954su",
      "score": 1,
      "body": "It would be nice if we could get a list of the banks that are talking about",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l7954su/",
      "created": 1717611227,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7fqfuw",
      "score": 1,
      "body": "Explain to me why there are no names on this list? The reason why is because if they fail people won’t have time to strip their funds out of those banks",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l7fqfuw/",
      "created": 1717709818,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7g2myd",
      "score": 1,
      "body": "As someone who works in banking, I wouldn’t overfocus on unrealized losses; they’re not really an issue unless the bank is in a situation where it may have to realize the loss.  In many cases they’re going to be held-to-maturity securities where the bank has no intent to sell them and has made plans around that.  The entire banking system has over $20 trillion dollars in assets.\n\nIf I were going to look for banks to bet against, I’d be searching for ones that also had a weak capital position and poor liquidity, because those are the situations where they might have to realize losses and might not have the equity to cover it.  Bonus points if they have significant loan exposure to office properties.",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l7g2myd/",
      "created": 1717714410,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7sloz2",
      "score": 1,
      "body": "Is there a list of banks",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l7sloz2/",
      "created": 1717926226,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7w5vmk",
      "score": 1,
      "body": "Is this where the “if you have less than 250k you’re safe” rule comes into play?",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l7w5vmk/",
      "created": 1717979110,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l713sb4",
      "score": 1,
      "body": "so which bank is safe?chasebank?",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l713sb4/",
      "created": 1717483909,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l737m08",
      "score": 0,
      "body": "Context is missing.  \n\nThe 63 banks in trouble aren't holding half a trillion in unrealized losses.  Based on their \"troubled banks'\" COMBINED assets of $83B (compared to a single top-tier bank, which holds >$250B), these are almost universally smaller community banks. \n\nThe fear-mongering aspect of this report takes two relatively unrelated data points and puts them in the same sentence to make it sound like we're on the brink of erasing $500B of value from the market.\n\nWhat they're really saying here is that banks have extended a ton of loans to homebuyers.  When the interest rates went up again last quarter, it makes buying a house less attractive, so (generally speaking), the market price falls a bit.  Makes sense: a $300K house at 5% seems like a better buy than a $300K house at 7%, so people buying homes might want to only pay $285K for that same house now.  That's why unrealized losses spiked in 2022, when we started to raise interest rates to combat inflation.\n\nSince the estimated \"market value\" for the homes dropped in response to higher interest rates, and since the banks hold the title for the home, it counts as an unrealized loss. \"We (PNC Bank), extended a $400K loan to Jack Smith to buy this home, valued at $425K.  Now, with higher interest rates, we'd be lucky to sell that house for $350K if we had to.  So we're sitting on a -$75K liability (350 minus 425).\" (I'm not a banker, so they might count is as a $50K liability based on their investment).  That times thousands of homes is the net unrealized loss.  It won't affect the banks operations as long as Jack keeps paying his mortgage.  Let's say a bunch of people get laid off suddently and can't afford their homes, and the bank seizes ownership of thousands of homes....  Now if the banks try to sell all these homes in a flooded market, prices will plummet, banks lose a ton of money.  \n\nThen the banks (who were libertarian, anti-government and capitalist while things were good), will suddenly turn socialist and beg the government to bail them out because \"our bank failing will decimate the economy so you HAVE to help us!\"  Privatize the gains, socialize the losses.",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l737m08/",
      "created": 1717520259,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l71z4md",
      "score": 0,
      "body": "“It is within our model” FDIC … where have I heard this before???? Don’t worry!!! Be happy lol I mean ofc they say that so no one runs on the banks",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l71z4md/",
      "created": 1717504110,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l74jlof",
      "score": 0,
      "body": "I’m guessing Wells Fargo is on that list- I have an old retirement account with them that has like 9k in it- I cannot get them to roll it into my new retirement account, or a Roth, or take the money out and pay the tax and penalty- I think they just don’t have it",
      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/l74jlof/",
      "created": 1717536240,
      "depth": 0,
      "replies": [
        {
          "id": "lsry905",
          "score": 1,
          "body": "\nyou sound incompetent",
          "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/lsry905/",
          "created": 1729387629,
          "depth": 1,
          "replies": [
            {
              "id": "lssix1s",
              "score": 1,
              "body": "Well sunshine, if I’m incompetent so are the 4 different accountants and retirement account managers who have helped me try to obtain my money and failed. Everyone thought madoff was too famous to fail but total Ponzi scheme.",
              "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/lssix1s/",
              "created": 1729396091,
              "depth": 2,
              "replies": [
                {
                  "id": "lssq1vd",
                  "score": 1,
                  "body": "I guess so.  Wells has problems, in my favor, I think I got $600 for all those fake accounts the branch managers opened, but they have never lost my money.",
                  "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/lssq1vd/",
                  "created": 1729399427,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lsuwej4",
                      "score": 1,
                      "body": "They haven’t lost my money they are holding it hostage. I ask to close the account they tell me checks in the mail and then send letters why they can’t release it- I need to sign a form, they send I sign but then it’s not the right form, they send different one again it’s not correct. I ask mass mutual to help me roll the wells into my mass mutual account- mass mutual tries dealing with them and says “I’ve never experienced this before” we do a 3 way call, escalate up, senior person gets on the call- gets heated hangs up” mass mutual is like I don’t know what else to do, so I get an accountant relative to help- he completes all the paperwork to close the 403b and get my money- well moves it out of 403b into a holding, so at least I’m not being charged a fee- but they never send a check- same process you haven’t signed the right form- they send form again it’s not the right one.- rince repeat for the past 3 years.",
                      "permalink": "/r/stocks/comments/1d7oro1/fdic_says_63_lenders_on_brink_of_insolvency_but/lsuwej4/",
                      "created": 1729439872,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}