{
  "title": "Microsoft confirms mixed reality layoffs, will keep selling HoloLens 2 ",
  "score": 80,
  "selftext": "Microsoft will lay off some employees who work on mixed reality, a spokesperson told CNBC on Monday. Although the cuts will affect the department that contributes to the HoloLens 2 augmented reality headset, Microsoft plans to continue selling the device.\n\nThe reduction comes a year after the software maker said it would make changes to its hardware lineup as part of a round of layoffs that hit 10,000 employees, including some in mixed reality. In the following months, Microsoft discontinued several keyboard models, causing frustration for some dedicated customers.\n\n“Earlier today we announced a restructuring of the Microsoft’s Mixed Reality organization,” the spokesperson said in an email. “We remain fully committed to the Department of Defense’s IVAS program and will continue to deliver cutting edge technology to support our soldiers. In addition, we will continue to invest in W365 to reach the broader Mixed Reality hardware ecosystem. We will continue to sell HoloLens 2 while supporting existing HoloLens 2 customers and partners.”\n\nAltogether, the company is letting go of over 1,000 people, including in mixed reality, a person familiar with the matter said.\n\nMicrosoft has not found great success with the HoloLens since its introduction in 2015. But the U.S. Defense Department gave a contract to the company for a modified HoloLens named the Integrated Visual Augmentation System. Soldiers who used the devices, however, reported dealing with nausea and other conditions, Bloomberg reported. Tests suggested that an updated model looked promising.\n\nSince then, Microsoft and its highly valued technology peers have poured billions into commercializing artificial intelligence. Microsoft has raced to deploy Nvidia graphics processing units so people can use a Copilot chatbot and Microsoft-backed OpenAI’s popular ChatGPT. Premium AI features in Microsoft 365 productivity applications can write memos, draft presentations and summarize meetings.\n\nIn December, Microsoft further reduced investment in augmented reality and virtual reality, which blocks out the surrounding world, when it deprecated Windows Mixed Reality, which included tools for running applications in head-mounted displays.\n\nThe spokesperson said Microsoft will keep selling the HoloLens 2 headset that was released in 2019 but did not indicate that a new model would be coming. Insider reported in 2022 that the company had canceled a third version.\n\nApple brought out its own augmented reality headset, the Vision Pro, in January.\n\nMicrosoft continues to support a feature called Mesh that lets people in headsets participate in three-dimensional Teams video calls with colleagues. At the Microsoft Ignite conference in Seattle in November, CEO Satya Nadella said the company was “reimagining the way employees come together and connect using any device, whether it’s their PC, HoloLens, or Meta Quest.”\n\nSource: https://www.cnbc.com/2024/06/03/microsoft-confirms-mixed-reality-layoffs-will-keep-selling-hololens-2.html",
  "link_flair_text": "Company News",
  "id": "1d7pxgm",
  "num_comments": 21,
  "created_utc": 1717480215,
  "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/",
  "comments": [
    {
      "id": "l70za7w",
      "score": 68,
      "body": "What I don't understand is how the HoloLens can exist for so long with all this research, only to produce pretty minimal sales and use cases... And then people act like Apple invented AR and say that the Apple VisionPro will change everything. Both products are nifty, but either has a realistic market right now.",
      "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l70za7w/",
      "created": 1717481155,
      "depth": 0,
      "replies": [
        {
          "id": "l71hh4q",
          "score": 21,
          "body": "It's one of these gadgets that sounds good on paper but when you actually try and build a use case around it (we have where I work) then you figure out it's more hassle to the end user than it's worth.\n\nIt's massively cool for demos but as soon as you try to work with it for more than 5 minutes you realize that lifting your arms in empty air to control menus and what not is exhausting. There's a reason why resting your hand on a mouse is a really good input method (also far superior than using upright touch screens from a fatigue perspective).\n\nSimple display of information (without any user input) is better done with screens. The number of jobs where you need info (that you don't just remember after doing your job a couple days) while moving around is limited.\n\nIt seems no one so far has figured out the \"killer app\".",
          "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l71hh4q/",
          "created": 1717494048,
          "depth": 1,
          "replies": [
            {
              "id": "l72jz8s",
              "score": 6,
              "body": "Yeah exactly. Spinning around like an asshole with some goggles on to perform something I could do in two seconds on my PC simply isn't appealing.\n\nI've actually tried a HoloLens too, and it's neat for some 3D modeling or getting some perspective, but it's mostly a novelty.",
              "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l72jz8s/",
              "created": 1717512301,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l71b1bz",
          "score": 10,
          "body": "I didn't even know you can buy the thing. The last time I saw it was when it was first announced and then I never saw it mentioned since ",
          "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l71b1bz/",
          "created": 1717489209,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l72j952",
          "score": 8,
          "body": "The just never really made many.  Microsoft hard goods almost never go into wide production.  They make a few sample demand maybe make a few more and see if hype takes off or kind of goes nowhere.  They have always done this.  Sure it is a good way to minimize loss, but it also keeps all Microsoft devices from being big hits.  Zune is probably the best example.  If they simple made more of them it could have been huge, but there weren't enough devices for a mass uptake or the tech...",
          "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l72j952/",
          "created": 1717512044,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l72p38n",
          "score": 4,
          "body": "I’m still yet to think of a good idea that isn’t easier or cheaper via other means or another device.\n\nLike one application is AR vision at a complex work site, maybe like an assembly plant, to find all the parts you need. But is that easier with AR goggles or by just making all the parts easy to find via labeling? One is very expensive to procure and program, the other is just a little time consuming and boring. I’ll choose the simple and cheap and boring solution every time.",
          "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l72p38n/",
          "created": 1717514062,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l73slax",
          "score": 2,
          "body": "Completely agree with you but Apple also has a weird way succeeding and crafting a narrative around why you want their products. If anyone can figure out the use cases, it’s Apple. When the first iPod came out, I thought it was dumb anyone would spend so much money when the market was filled with cheaper mp3 players. When the iPad came about, I thought it was nothing more than a glorified oversized iPod touch. I also thought the AirPods and watch were overpriced silly gadgets that wouldn’t last. I no longer own an iPod but I’ve got everything else.",
          "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l73slax/",
          "created": 1717527281,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l713sjx",
          "score": 1,
          "body": "You're right that neither is ready, but the key differentiator is that Vision Pro is a passthrough device.\n\nPassthrough AR is technologically a decade ahead of seethrough AR. Even if a new 2024 HoloLens was released, it would feel like a 2014 product next to Vision Pro.",
          "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l713sjx/",
          "created": 1717483914,
          "depth": 1,
          "replies": [
            {
              "id": "l73qrsk",
              "score": 2,
              "body": "Agreed and not sure why this was downvoted. AVP and Quest are VR headsets with passthrough. See through AR devices like Magic Leap 2 and HoloLens are an entirely different set of engineering and physics problems to solve and these companies have learned that they can’t buy new physics.",
              "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l73qrsk/",
              "created": 1717526691,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l71odsy",
      "score": 6,
      "body": "I thought the title meant they would be letting people go while wearing VR goggles. That would be so much fun.",
      "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l71odsy/",
      "created": 1717498561,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l70ypg6",
      "score": 9,
      "body": "It's like they didn't learn from Google's failure.",
      "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l70ypg6/",
      "created": 1717480788,
      "depth": 0,
      "replies": [
        {
          "id": "l713pba",
          "score": -7,
          "body": "Google made a smartglasses product, not an AR product. Completely different industries.",
          "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l713pba/",
          "created": 1717483850,
          "depth": 1,
          "replies": [
            {
              "id": "l71d2h9",
              "score": 7,
              "body": "Smart glasses were an AR product, though",
              "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l71d2h9/",
              "created": 1717490742,
              "depth": 2,
              "replies": [
                {
                  "id": "l71qc8l",
                  "score": -2,
                  "body": "Smartglasses are a separate product.\n\nIt's like computers and calculators. They might both calculate, but calculators are for a single purpose and have no other similarity other than calculation.",
                  "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l71qc8l/",
                  "created": 1717499687,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l71d50b",
              "score": 2,
              "body": "Google glass was AR. 😂",
              "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l71d50b/",
              "created": 1717490794,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l76m4a3",
          "score": 0,
          "body": "it was never failure for google, just wasn't big enough to justify the ongoing costs\n\nand i think google will continue pushing on that now that meta announced their platform for xr",
          "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l76m4a3/",
          "created": 1717569678,
          "depth": 1,
          "replies": [
            {
              "id": "l76nqz7",
              "score": 0,
              "body": "  When something costs too much for it's benefits, that's called a failure.  They don't go into projects to lose money.  Trying to sugar coat it doesn't make it any less of a failure.",
              "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l76nqz7/",
              "created": 1717570772,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l71pvz8",
          "score": -4,
          "body": "Google is in the business of stealing user data. People did not trust Google smart glasses and some places even banned them.",
          "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l71pvz8/",
          "created": 1717499434,
          "depth": 1,
          "replies": [
            {
              "id": "l723b8d",
              "score": 9,
              "body": "It wasn't really about the user data. The backlash I remember from it was that people didn't want someone having a camera in their glasses possibly taking pictures without you knowing.",
              "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l723b8d/",
              "created": 1717505953,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l72ce5k",
              "score": 2,
              "body": "That had very little to do with its failure as Microsoft is finding out now",
              "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l72ce5k/",
              "created": 1717509551,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l72h0f4",
      "score": 3,
      "body": "Isn’t this the worst time to be scaling back the HoloLens?  just when VR/AR started taking off. Even better, spin off the division and open source the technology.",
      "permalink": "/r/stocks/comments/1d7pxgm/microsoft_confirms_mixed_reality_layoffs_will/l72h0f4/",
      "created": 1717511239,
      "depth": 0,
      "replies": []
    }
  ]
}