{
  "title": "Google cuts at least 100 jobs across fast-growing cloud unit, sources say",
  "score": 44,
  "selftext": "Alphabet is laying off employees from several teams in Google’s cloud unit, one of its fastest-growing businesses, CNBC has learned.\n\nThe company notified employees last week of the cloud cuts, with roles being eliminated in sales, consulting, “go to market” strategy, operations and engineering, according to internal correspondence viewed by CNBC. At least 100 positions were cut, said people familiar with the matter who asked not to be named because they weren’t authorized to speak about the layoffs.\n\nInsider previously reported some details of the layoffs.\n\nA Google spokesperson told CNBC the cuts are incremental across teams to better align its go to market organization.\n\n“As we’ve shared before, we continue to evolve our business to meet our customers’ priorities and the significant opportunity ahead,” the spokesperson said. “We maintain our commitment to investing in areas that are critical to our business and ensure our long-term success.”\n\nSome of those who lost their jobs had worked on the company’s annual Google Cloud Next that took place mid April, said people familiar with the situation.\n\nGoogle has been conducting ongoing layoffs since early 2023. Employees have since complained about demands that they work on tighter deadlines with fewer resources and diminished opportunities for internal advancement even as the company records record profit.\n\nLast month, Google cut at least 200 employees from its “Core” organization, which included key teams and engineering talent. CEO Sundar Pichai told employees that the company would make fewer layoffs in the second half of 2024.\n\nRevenue in Google Cloud, which houses much of the company’s AI technology, jumped 28% from a year earlier to $9.57 billion in the latest quarter, sailing past estimates. Operating income more than quadrupled to $900 million, showing that Google is finally generating substantial profits after pouring money into the business for years to keep up with Amazon Web Services and Microsoft Azure.\n\nHowever, the cloud unit, led by CEO Thomas Kurian, has been under pressure to continue accelerating growth as competition heats up in AI.\n\nSource: https://www.cnbc.com/2024/06/03/google-cuts-at-least-100-jobs-across-cloud-unit-sources-say.html",
  "link_flair_text": "Company News",
  "id": "1d7pvow",
  "num_comments": 1,
  "created_utc": 1717480033,
  "permalink": "/r/stocks/comments/1d7pvow/google_cuts_at_least_100_jobs_across_fastgrowing/",
  "comments": [
    {
      "id": "l71tdga",
      "score": 22,
      "body": "Last quarter Google made more money than Apple, Microsoft, Amazon, Nvidia, Tesla or Meta.\n\nI think they might have made more than any other public company.\n\nThis should just help improve their profitability.    \n\nThe most important thing is the vision that Google had for what was coming and them executing on the TPUs.\n\nThey just released the sixth generation which was a 5X improvement over the fifth.  Now working on the seventh generation.\n\nThere is going to be an incredible shortage of compute cycles for AI.    Why Nvidia is getting such huge margins.\n\nThose TPUs mean Google can make bigger margins and not have to wait in line at Nvidia.\n\nReally the only one of the big guys that this is true.\n\nIt is surprising that it is only now that Microsoft is going to try to copy Google and do their own TPUs.\n\nBut it will take years to catch up and they really should have had better vision on what was coming.",
      "permalink": "/r/stocks/comments/1d7pvow/google_cuts_at_least_100_jobs_across_fastgrowing/l71tdga/",
      "created": 1717501310,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l712fej",
      "score": -7,
      "body": "Cloud will pump hard second half this year",
      "permalink": "/r/stocks/comments/1d7pvow/google_cuts_at_least_100_jobs_across_fastgrowing/l712fej/",
      "created": 1717483173,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l712frt",
      "score": -7,
      "body": "Cloud will pump hard second half this year",
      "permalink": "/r/stocks/comments/1d7pvow/google_cuts_at_least_100_jobs_across_fastgrowing/l712frt/",
      "created": 1717483173,
      "depth": 0,
      "replies": []
    }
  ]
}