{
  "title": "Paramount leadership team to announce job cuts, streaming JV plans ",
  "score": 19,
  "selftext": "The current leadership of Paramount Global is gearing up to present a plan at the company’s annual shareholder meeting Tuesday in the event a sale of the company doesn’t happen, according to a person familiar with the matter.\n\nCBS CEO George Cheeks, Paramount Media Networks CEO Chris McCarthy, and Paramount Pictures CEO Brian Robbins — collectively the company’s “Office of the CEO” — will present Paramount’s go-forward plan. The trio will lay out strategic priorities, including exploring streaming joint venture opportunities with other media companies, eliminating $500 million in costs, and divesting non-core assets, the person said, who asked not to be named because the details are private.\n\nThe presentation comes at an awkward time. Earlier this week Paramount agreed to the framework of merger terms with a consortium comprised of David Ellison’s Skydance Media and private equity firms RedBird Capital and KKR, CNBC reported Monday. The deal is still awaiting approval of Paramount’s controlling shareholder, Shari Redstone, who owns National Amusements, which owns 77% of class A Paramount shares.\n\nThe plan that Paramount Global shareholders will hear on Tuesday will essentially serve as Redstone’s alternate option if she chooses not to sell.\n\nParamount plans to tell investors they’ve received inbound interest to establish a streaming joint venture that would include the company’s flagship service, Paramount+, which has more than 70 million subscribers but continues to lose money.\n\nRedstone has been supportive of the “Office of the CEO” leadership team that has run the company since former CEO Bob Bakish stepped down in late April.\n\nSource: https://www.cnbc.com/2024/06/04/paramount-annual-meeting-job-cuts-streaming-jv.html",
  "link_flair_text": null,
  "id": "1d7wogo",
  "num_comments": 4,
  "created_utc": 1717506352,
  "permalink": "/r/stocks/comments/1d7wogo/paramount_leadership_team_to_announce_job_cuts/",
  "comments": [
    {
      "id": "l74if91",
      "score": 1,
      "body": "What kind of effect will this have on the $PARAA price? Any reason to buy if you think the deal will go through?",
      "permalink": "/r/stocks/comments/1d7wogo/paramount_leadership_team_to_announce_job_cuts/l74if91/",
      "created": 1717535830,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l74lmow",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1d7wogo/paramount_leadership_team_to_announce_job_cuts/l74lmow/",
      "created": 1717536954,
      "depth": 0,
      "replies": [
        {
          "id": "l75o6pi",
          "score": 2,
          "body": "Lol, terrible idea. A studio without a distribution outlet is already in a precarious position. Worse, studios all beholden to the same distribution outlet with all the pricing and market power? That would be a nightmare for them.\n\nYou may not like it, but they all had to make a move this way. And as a consumer, you wouldn't have liked a world where Netflix was the only player.",
          "permalink": "/r/stocks/comments/1d7wogo/paramount_leadership_team_to_announce_job_cuts/l75o6pi/",
          "created": 1717552062,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l74mhvl",
          "score": 1,
          "body": "These are publicly traded companies. Shareholders will ask where is the growth coming from. And for the media companies it was meant to be from these streaming services.\n\nI completely agree I liked it when every thing was on Netflix. But publicly traded companies that need to show growth in earnings might not like Netflix making so much off their IPs.",
          "permalink": "/r/stocks/comments/1d7wogo/paramount_leadership_team_to_announce_job_cuts/l74mhvl/",
          "created": 1717537262,
          "depth": 1,
          "replies": [
            {
              "id": "l74r8hb",
              "score": -2,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1d7wogo/paramount_leadership_team_to_announce_job_cuts/l74r8hb/",
              "created": 1717538972,
              "depth": 2,
              "replies": [
                {
                  "id": "l74wgpp",
                  "score": 0,
                  "body": "I was just explaining why it happened. That what kinda sucks about discussing certain sectors. There is what the consumer thinks/wants and what the companies want.\n\nThe question that wont get answered is lets say they put everything on Netflix where is the growth of the companies supposed to come from? PARA, DIS, WBD are all tickers with shareholders expecting growth.",
                  "permalink": "/r/stocks/comments/1d7wogo/paramount_leadership_team_to_announce_job_cuts/l74wgpp/",
                  "created": 1717540949,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}