{
  "title": "Best Battery Tech?",
  "score": 22,
  "selftext": "I have a little money I'm interested in throwing into battery makers. For now I'm trying to evaluate what the \"best\" battery development company is. My main criteria is: Out of public stocks, who is working on the highest energy density? (I don't really care about recharge time or cycle life, etc). \n\nI see QuantumScape, Microvast, and Solid Power are all down quite a bit from 2021 highs. I know 2021 was an \"overpriced year\", but I'm wondering if there are any other reasons for them falling. I.e. was there some setback with their R&D? I know Microvast is low on funds, but QuantumScape appears to have a lot of cash available. Microvast is interesting because based on my research they are doing about $100m in revenue, and yet the company's market cap is about $130m. \n\nIs it just these companies have been mismanaged or is there something wrong with them?",
  "link_flair_text": null,
  "id": "1d84765",
  "num_comments": 32,
  "created_utc": 1717525420,
  "permalink": "/r/stocks/comments/1d84765/best_battery_tech/",
  "comments": [
    {
      "id": "l73odie",
      "score": 16,
      "body": "We’re long due for a battery revolution. The issue isn’t producing the energy, but safely harnessing it and storing it",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l73odie/",
      "created": 1717525907,
      "depth": 0,
      "replies": [
        {
          "id": "l73qpn2",
          "score": 8,
          "body": "Everything I read about a new supposed battery tech breakthrough always goes something like this:  \n\n\n\"Revolutionary new technology will allow development of batteries using cheaper and more environmentally friendly materials. However...\"  \n\n\nAnd that however is always something that can't supplant our traditional metal batteries in either long term performance or commercial scalability.",
          "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l73qpn2/",
          "created": 1717526672,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l75kziq",
          "score": 1,
          "body": "We need better energy production also, when oil runs out",
          "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l75kziq/",
          "created": 1717550728,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l788zqj",
      "score": 9,
      "body": "ENVX! The only game in town",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l788zqj/",
      "created": 1717600438,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l78pmay",
      "score": 8,
      "body": "ENVX is your best bet.\n\nI wouldn't touch amprius with a 10 ft pole and QS is years away from scale",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l78pmay/",
      "created": 1717606014,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l73z1y9",
      "score": 13,
      "body": "$ENVX might be what you're looking for",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l73z1y9/",
      "created": 1717529408,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l783ool",
      "score": 5,
      "body": "Have a look at Enovix",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l783ool/",
      "created": 1717598600,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l73thf7",
      "score": 11,
      "body": "Look up Enovix $ENVX",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l73thf7/",
      "created": 1717527572,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l73wpsc",
      "score": 6,
      "body": "It’s hard to imagine any of these companies beating CATL or BYD.\n\nThe challenge isn’t coming up with a new type of battery but being able to manufacture at scale.  This is where every battery start up ultimately fails, or at least so far.\n\nOut of the ones you’ve listed QS is the most promising but it’s not clear they will be able to reach the unit economics required for mainstream markets.\n\nAnd it is not like CATL and BYD are sitting on their hands waiting for some company to beat them, they are constantly improving their own batteries, making it hard for new companies to catch up.",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l73wpsc/",
      "created": 1717528633,
      "depth": 0,
      "replies": [
        {
          "id": "l77n5hf",
          "score": 1,
          "body": "This may sound like BS scenario , but is it plausible?We spend millions and billions to develop new technology and the Chinese students we let into the country just steal it go back to China and mass produce it. What's the incentive to invest in ground breaking tech when it's already being mass produced?",
          "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l77n5hf/",
          "created": 1717592375,
          "depth": 1,
          "replies": [
            {
              "id": "l784rw7",
              "score": 1,
              "body": "I think a lot of new industrial policy in the US is being created to address this.",
              "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l784rw7/",
              "created": 1717598977,
              "depth": 2,
              "replies": [
                {
                  "id": "l78m2ez",
                  "score": 1,
                  "body": "Yeah I hope they follow through and that they build more high tech manufacturing here so we can stop the brinkmanship over Twain. That's frightening \n\nChina will or could cut us off overnight if they took it. Or at least destroy its capacity",
                  "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l78m2ez/",
                  "created": 1717604833,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l775kys",
      "score": 5,
      "body": "There have been so many discussions about battery stocks on here over the last few years - FREY, Panasonic, QS, etc.  All of them have done badly or very badly. People now starting talking about them again in the same excited growth story manner they talked about the theme in 2021. Nobody questioning the *possibility* that maybe - just maybe - this isn't a great business. People still talking about EV names with the same hype mentality that they did on here in 2020/21 too, despite a number of smaller names - smaller names that went public like, 2-3 years ago - either going bankrupt or looking like they're close to.\n\nIf someone wants to devote a *very* small % of their portfolio to a lottery ticket bet on something like this, fine - but people often seem to get way too enamored with stuff like this and it turns into 10% of their portfolio. \n\nDon't be like Cathie, learn the lessons that she still hasn't.\n\n\"He argued that **Ark prioritizes chasing “future ideas” without proper evaluation of traction, valuation, and management credibility.\"**\n\nhttps://www.benzinga.com/analyst-ratings/analyst-color/24/05/38915172/investment-advisor-says-throwing-random-darts-at-tickers-would-beat-arkk-as-cathie-",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l775kys/",
      "created": 1717583564,
      "depth": 0,
      "replies": [
        {
          "id": "lmkfrww",
          "score": 1,
          "body": "Just wanted to say thanks for this, you just talked me out of 'betting' on this.",
          "permalink": "/r/stocks/comments/1d84765/best_battery_tech/lmkfrww/",
          "created": 1726036117,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l73rwgb",
      "score": 4,
      "body": "Battery producers need to scale. \n\nOnly ones that are scaling to achieve any type of economy of scale are the Chinese, Japanese, and Koreans. \n\nHard to invest in any of them without opening up local brokerage account in their country.",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l73rwgb/",
      "created": 1717527056,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l74p91u",
      "score": 3,
      "body": "Amprius",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l74p91u/",
      "created": 1717538242,
      "depth": 0,
      "replies": [
        {
          "id": "l75pas3",
          "score": 2,
          "body": "Also kulr",
          "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l75pas3/",
          "created": 1717552527,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l79hc9f",
          "score": 1,
          "body": "Amprius cycle life is laughable and will never sell a scale to support large growth",
          "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l79hc9f/",
          "created": 1717615301,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l73ukyx",
      "score": 3,
      "body": "Microvast - fucked over investors along with the DOE. Wu didn’t say anything against the racism and got pinned as China, Wu shouldn’t have attended the China program. Within the year they lost the Enlight contract last minute, they lied about Clarksville status. Ton of work left and they weren’t paying contractors (this isn’t China) they laid off US citizens with no proper warning and have a lawsuit coming I think? Euro business seems to grow / same with China, but no communication from Wu, no communication to shareholders. Lots of promises with their NDAs that never came to light. They have a $150M problem, US doesn’t seem to want their business. Some thought they had the USPS deal with Osh, but no CV. They got a lot of $$$$ from SPAC with nothing to show. Fuck Microvast and fuck Wu. Their revenue isn’t trustworthy b/c their auditor is still in China, regardless of the name..that is why their MC is so low. They have no business being in the US because they have little business in the US. \n\nThe lies came to light from a tire shop employee that worked across the street in Clarksville. Dude was on their sub telling them 3 or 4 months before Wu+co said anything to shareholders. Payment issues there and they had issues in Colorado from yet another random person months ahead of Wu telling shareholders, the contractor mentioned they tried getting him to sign a new nda and basically change their agreement. Microvast was trying to abuse IRA creds and they thought they could hide behind signing Vets. Their IP might be worth something, but it’s weird they haven’t sold. Wu divided up the businesses in a funky fashion too.",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l73ukyx/",
      "created": 1717527931,
      "depth": 0,
      "replies": [
        {
          "id": "l78jf8z",
          "score": 2,
          "body": "Nonetheless they are one of the few companies OP listed which actually have revenue.",
          "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l78jf8z/",
          "created": 1717603951,
          "depth": 1,
          "replies": [
            {
              "id": "l78sxwe",
              "score": 1,
              "body": "Yeah lol QS needs to execute/have a product and VW is having its own problems, I don’t know much about solid..but it’s a tough industry. Rules and regulations make it pretty damn hard to compete with other countries, but I’d rather be safe than sorry. \n\nMVSTs plant in China looks super high tech, definitely seems worth 130M (not sarcasm) Wu’s sold a company before, made a penny. This is his dream though, he’s got a great scientist behind the scenes. I just think they missed their chance in the US and therefore their actual worth in our market. Wu fucked up by going to the talent program.",
              "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l78sxwe/",
              "created": 1717607126,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l75adne",
      "score": 1,
      "body": "Not full battery developer, but KULR is a strong play.",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l75adne/",
      "created": 1717546400,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l761o4z",
      "score": 1,
      "body": "Nano One Materials",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l761o4z/",
      "created": 1717558035,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l77tbmp",
      "score": 1,
      "body": "KULR",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l77tbmp/",
      "created": 1717594844,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l75pir0",
      "score": 1,
      "body": "KULR - they focus on battery testing and thermal management.  Contracts with EV manufacturers, NASA, DoD and primes.  Ridiculously undervalued right now, poised to grow via retiring debt and setting up new business line (kulr one)",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l75pir0/",
      "created": 1717552617,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l73yaic",
      "score": 0,
      "body": "US battery tech is a gamble, to say the least. This is because of Chinese EV tariffs making US car makers globally uncompetitive. Here's what I mean and a huge problem with US battery manufacturers: \n\nThere's a reason why there are new massive tariffs on Chinese EVs and it's not because the EVs aren't good, the administration is scared of actual competition hurting US EV development. What this implies is Chinese EVs are extremely successful because if they were actual failures, no tariffs will be needed at all. Tariffs make US EV tech domestically competitive, but not globally competitive. Consequently, this also results in lower overall competition for these US EV makers, making them adapt slowly to EV demand. All this matters for US battery makers because slower US EV adoption = less demand for batteries.\n\nLower demand for US batteries results in slower tech development for these same US battery makers, which could be a boon in the short term but potentially makes them globally not competitive. There are already huge battery tech developments around the world. The reason Chinese EVs are successful also comes on the back of tech by companies like Contemporary Amperex, CATL, a hundred billion dollar Chinese company no one in West knows about, except Elon Musk, whose EV company depend on for its LFP batteries.\n\nThe point is US battery makers are a total gamble. Even though US EVs are an emerging market, there are already large, successful companies in the entire world, basically they are already the blue chip, Microsoft's of the world. Quantumscape, a 0 revenue small cap growth with 1 kind of tech (solid-state Li) and no guarantee of a future (Why is solid-state better than LFP? Does CATL have their own solid-state tech?), is essentially a lottery ticket. There is a huge chance an investment will fall to 0.\n\n> Is it just these companies have been mismanaged or is there something wrong with them?\n\nWhy don't you ask the CEOs of [Ford](https://www.bridgemi.com/business-watch/ford-changes-ev-strategy-proceeds-smaller-michigan-battery-factory), Tesla, and [General motors](https://www.greencarreports.com/news/1142723_gm-seeks-american-catl-ev-battery-deal) why they chose CATL?",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l73yaic/",
      "created": 1717529155,
      "depth": 0,
      "replies": [
        {
          "id": "l75olsx",
          "score": 0,
          "body": "Wow. Excellent point.",
          "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l75olsx/",
          "created": 1717552237,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l73sr7e",
      "score": 0,
      "body": "they all suck because all of them burn money\n\nif you burned a dollar a second, you wouldnt even come close to the amount of cash they burn in a quarter",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l73sr7e/",
      "created": 1717527335,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l73xbt7",
      "score": -4,
      "body": "Batteries...batteries never change. Because chemistry and li+ already being pretty efficient. There's some theoretical stuff but it's quite a ways out.",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l73xbt7/",
      "created": 1717528838,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l75ky2t",
      "score": -2,
      "body": "You'll have to wait a few years I think. \n\nNone of the SSB companies that are publicly traded are any good. QS is a joke, go read their 10Q.",
      "permalink": "/r/stocks/comments/1d84765/best_battery_tech/l75ky2t/",
      "created": 1717550712,
      "depth": 0,
      "replies": []
    }
  ]
}