{
  "title": "RDDT - practical approach?",
  "score": 34,
  "selftext": "How do you folks practically approach considering buying the RDDT stock? \nOn one side, it's a healthy business, adoption and engagement are high and are expected to increase. Deals with Google and OAI that will drive even more users and customers to the platform.\n\nYet, on the other side, RDDT doesn't seem to have a clear path for increasing net revenue. They don't do targeted ads like Meta, no marketplace, and the current monetization drivers seem weak today and in the long term.\n\nSo if stocks are built on expectations people have that future demand will increase, and that it will drive the stock price up - it doesn't seem that optimistic right now, or I'm getting this totally wrong?",
  "link_flair_text": null,
  "id": "1d853m0",
  "num_comments": 64,
  "created_utc": 1717527627,
  "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/",
  "comments": [
    {
      "id": "l75d6c1",
      "score": 13,
      "body": "RDDT will be a 20 billion dollar company by next year. They keep posting +20% qoq user growth and consistent arpu growth, with expenses tapering off at returns to scale. Their data licensing is top notch, and their data is more valuable, structured and tagged than any other social media company. They are already posting 60 million dollar deals regularly and have great partnerships. They have a higher percentage of R&D expense than any other peer in the industry, which looks really good for emerging growth companies. They sit on a pile of cash for acquisitions as well. Ive been modeling social media company financials for a while as a hobby, and rddt has better prospects than any other social, meta included. Practical advice, *read their non gaap metrics.* take a look at their 10q and see for yourself, then compare to Snap and pint. It’s no contest.",
      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l75d6c1/",
      "created": 1717547530,
      "depth": 0,
      "replies": [
        {
          "id": "l760ppj",
          "score": 10,
          "body": "I agree with everything you are saying and think it’s quite unlikely that the share price won’t double in a year\n\nWhat is confusing me is why there is so much doubt",
          "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l760ppj/",
          "created": 1717557581,
          "depth": 1,
          "replies": [
            {
              "id": "l78fbgf",
              "score": 8,
              "body": "Redditors hate reddit, I think it's as simple as that",
              "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l78fbgf/",
              "created": 1717602575,
              "depth": 2,
              "replies": [
                {
                  "id": "l79is1r",
                  "score": 5,
                  "body": "Redditors as a whole love Reddit, in my experience",
                  "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l79is1r/",
                  "created": 1717615781,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lj1nght",
          "score": 1,
          "body": "I think people are ignoring some of the advantages that Reddit has when it comes to data on users. Something special about Reddit compared to other social media sites is that it's anonymous – this might not sound like a good thing, but people are more willing to be honest on this site because it's a lot harder to trace back to the person. Hence, advertisers are more likely to reach users that want something that they might not divulge elsewhere (e.g., Facebook or Instagram).\n\nAs for getting more revenue, I think Reddit should show a lot more ads to users that are not registered. The problem for these ads is that the quality will be quite low since there is less information on the user. However, if users are incentivised to register to see less ads, Reddit could charge much more for targeted advertising to these registered users (with the information being post, voting, and subreddit preferences).",
          "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/lj1nght/",
          "created": 1724163880,
          "depth": 1,
          "replies": [
            {
              "id": "lj23q0b",
              "score": 1,
              "body": "That may be a long term goal, but I don’t know if ad walls meant to incentivize account creation will have a larger likelihood of capturing or turning over international users, especially on a platform that still serves ads to accounts. Reddit needs to focus on user growth to fatten their top line and should avoid capture strategies that risk turning new users away. I agree there needs to be some incentive to making accounts, as Reddit has a ton of unregistered page views.",
              "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/lj23q0b/",
              "created": 1724168998,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l74re8p",
      "score": 10,
      "body": "Honestly with their user base and how active user's are they have potential to do really well.  I just don't have a lot of confidence in spez to figure it out. Anyone who invests though can't blame them.  I use this site all day long, more than any other social media.  Surely they can get this company past snapchat, right? I guess we will see",
      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l74re8p/",
      "created": 1717539030,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l74yz9n",
      "score": 9,
      "body": "I visit this place everyday.  Might as well hold it long term.  It will benefit a lot in teaching AI and ads.  Potential is there.",
      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l74yz9n/",
      "created": 1717541907,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l741855",
      "score": 43,
      "body": "I’m long term, bullish on Reddit. I bought and will continue to buy shares. \n\nOut of all the major social media sites, Reddit is still the outlier. Always has been. It isn’t heavily manipulated by advertisers, yet. It’s mine (and many others) first stop to research new products. Any large purchase I’m considering, Reddit usually makes up my mind. Wait until they learn to manipulate the top post and sell it off to advertises.\n\nThis site is still good. There are so many ways to butcher it, in the name of profit.",
      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l741855/",
      "created": 1717530130,
      "depth": 0,
      "replies": [
        {
          "id": "l746ojd",
          "score": 14,
          "body": "Its market cap is still miniscule compared to the other major social media platforms. Sure it doesn't quite have the same number of users, but even adjusted for that it's a fraction of the value.\n\nHowever, what's stopped me from investing (and from the stock multiplying) is OP's point about no clear guide to profitability, and more importantly not once being profitable in it's 20+ years of operating. All the other social media platforms were profitable in much less time.\n\nThere's definitely more opportunity to monetize, but the path there is unclear and will undoubtedly receive a lot of pushback if it's via visual adverts. I think Reddit will focus more on selling data, given it's specialism of having many niche communities which are often the biggest of their type on the internet. Businesses would probably pay a ton of money to get data for the subreddits relevant to them.\n\nBut again, the monetisation needs to come in thick and heavy to become profitable and really make the stock a multi-bagger, which won't happen anytime soon. So it's sitting on my watchlist for now.",
          "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l746ojd/",
          "created": 1717531939,
          "depth": 1,
          "replies": [
            {
              "id": "l78jlro",
              "score": 8,
              "body": "Where does this “no clear path to profitability” take come from?   \n\nLet’s look at their losses:  2022 net loss: $158M  2023 net loss: $90M  \n\nTheir net loss decreased by 68M YoY. If they do that again in 2024 their net loss is $22M and in 2025 their net loss isn’t a net loss anymore.\n\nWhat’s a more clear path to profitability than continuing to do the exact thing you’re doing?\n\nI’m openminded if you somehow have different numbers, but a lot of these takes seemed based on nothing.",
              "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l78jlro/",
              "created": 1717604011,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l74by70",
              "score": 3,
              "body": "Which other social media platforms and what do they have that Reddit doesn't?",
              "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l74by70/",
              "created": 1717533662,
              "depth": 2,
              "replies": [
                {
                  "id": "l74cm6p",
                  "score": 6,
                  "body": "They are much more effective in delivering relevant ads to users. Facebook is god-tier at this.",
                  "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l74cm6p/",
                  "created": 1717533880,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l74d3on",
                      "score": 2,
                      "body": "Indeed.\n\nAnd can Reddit achieve this and if it does will it retain a significant number of users? OP seems to think so but why after so many years has it still not happened? I'm not buying.",
                      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l74d3on/",
                      "created": 1717534042,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l75407z",
                          "score": 2,
                          "body": "Your comment is the real big question.\n\nI personally bought a chunk of reddit because I believe the worst case scenario is if it drops under 4 billion dollars, another social media company (not meta because of anti trust) will buy it and try their luck at using their ad expertise on reddit data.\n\nWhich basically puts a floor on a risk bet at 50%. The IPO price IMO was a steal and I tried to participate but it failed to locate shares for me.",
                          "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l75407z/",
                          "created": 1717543860,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l7d916p",
                              "score": 1,
                              "body": "I bought in at the pre-IPO.  If I could have afforded to, I would have purchased more, but I have held on to the measly 47 shares I did buy.\n\nThe rest of the money I was considering using for it instead went to a $1000 emergency plumber bill and $1800 to repair wife's car after she drove over a curb.  That's the type of thing an emergency fund is meant for, which is why I didn't risk it on the stock.",
                              "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l7d916p/",
                              "created": 1717679640,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lgt2di4",
                              "score": 1,
                              "body": "Where the fuck are you getting 4b from lmao. That is not a floor. I could actually see someone like META buying it, but nobody has any idea what price they would pay. For all we know, the price META would pay might even be higher.",
                              "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/lgt2di4/",
                              "created": 1722966854,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "l76lc6i",
                          "score": 1,
                          "body": "I say they charge more for the data they sell to train AI. Get that buzz word in the mix. I think there is a lot of money in the shit we just type away for free.",
                          "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l76lc6i/",
                          "created": 1717569158,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l76lu9m",
                              "score": 3,
                              "body": "Well why hasn't it happened yet? That's my concern. I don't disagree that there is a trove on Reddit to be sold, but it is worrying they haven't managed to do so yet.",
                              "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l76lu9m/",
                              "created": 1717569494,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l76nztj",
                                  "score": 2,
                                  "body": "I don’t think Reddit’s management are sales people (or at least not creative sales people). They seem to be more tech/admin types. They need to hire a few true sharks to get their numbers up. I don’t know why they do what they do or when they will feel like changing to a profit driven mindset. I do not own any of its shares because of this. I do think they have great potential and somebody is gonna get rich off them, someday.",
                                  "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l76nztj/",
                                  "created": 1717570942,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "l7j2wbj",
                                  "score": 2,
                                  "body": "Do they have proper and well-commercialized enough APIs built to allow AIML into the fold? I agree this is maybe a great approach for revenue versus another \"me too\" AD delivery machine that will long-term hurt and potentially kill the platform.  But practically, I feel like Reddit is just going to be Twitter 2.0.",
                                  "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l7j2wbj/",
                                  "created": 1717768914,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l76k44j",
                      "score": 1,
                      "body": "I hate how good they are. My GF spends a ton of money on stuff she finds on those adds. Hate it.",
                      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l76k44j/",
                      "created": 1717568366,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l7dc09t",
                  "score": 3,
                  "body": "To flip it around, what does Reddit have that other social media platforms don't?\n\nAnswer:  Highly-engaged users generating higher quality content.  Unlike the Instabooks and Facespaces of the world pumping out endless shitty memes, MLM spam and people spewing out photo albums of their sister's cousin's uncle's ex-college roommate's pet monkey's birthday party, there are defined communities filled with people compelled to continue contributing to for various reasons, not the least being the sunk cost theory.   These users also have a much higher level of interaction with each other, which is an engagement multiplier of several orders of magnitude.  \n\nAll this engagement results in content that Reddit can then turn around and sell for AI training and other purposes.  This is on top of the added potential for targeted ads since users have already segmented themselves into groups more likely to be interested in a particular product or service, as opposed to other social media where they more often just passively join a long list of groups that interest them, sometimes several of the same as there is no impetus to consolidate to a single group/forum for a topic such as what Reddit naturally has.",
                  "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l7dc09t/",
                  "created": 1717680800,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7dcce9",
                      "score": 3,
                      "body": "I get it. \n\nBut why haven't they still not done so after so many years? That is what is making me sceptical.",
                      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l7dcce9/",
                      "created": 1717680934,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l7dewv1",
                          "score": 2,
                          "body": "It took years to work through the process to get to an IPO.  As for selling data, the market for AI training didn't even exist until recently.",
                          "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l7dewv1/",
                          "created": 1717681917,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lkwkzed",
                          "score": 1,
                          "body": "Because they never had to.. They weren't public. They had no need to act as fiduciary in the best interests of public owners/shareholders.",
                          "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/lkwkzed/",
                          "created": 1725144782,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l74canv",
              "score": 2,
              "body": "You sound like my brain when I do too much DD.",
              "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l74canv/",
              "created": 1717533774,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l75f5re",
          "score": 3,
          "body": ">This site is still good. There are so many ways to butcher it, in the name of profit.\n\nVery true. Though I absolutely hope they will fail and we get to keep the (last) good parts of Reddit.",
          "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l75f5re/",
          "created": 1717548332,
          "depth": 1,
          "replies": [
            {
              "id": "l76nb0v",
              "score": 3,
              "body": "It’s like Wikipedia…. We want this awesome thing, but we want it for free.",
              "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l76nb0v/",
              "created": 1717570474,
              "depth": 2,
              "replies": [
                {
                  "id": "l78blrq",
                  "score": 2,
                  "body": "For many, maybe. I donate to Wikipedia regularly. \n\nAlso they can shows ads, like they do. No problem. But I’m afraid of what else they’ll do in their chase for more and more profit.",
                  "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l78blrq/",
                  "created": 1717601329,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l78dvoy",
                      "score": 2,
                      "body": "If you donate to Wikipedia… you are the man and I apologize.",
                      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l78dvoy/",
                      "created": 1717602095,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l7dc7xl",
                  "score": 2,
                  "body": "We get it here for free because we ARE the product.",
                  "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l7dc7xl/",
                  "created": 1717680885,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l76ipdg",
          "score": 2,
          "body": "On other r/‘s I already see advertisers having pinned top posts. They say “promoted” so it’s not deceptive, but they do it. I just scan by them now without even paying attention.",
          "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l76ipdg/",
          "created": 1717567455,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l74sw3v",
          "score": -2,
          "body": "Dude, have you been to resit lately? /s\n\n\n\nReddit is *nothing but advertising*. At least Google and Facebook try to hide it yet reddit is well over 50% bot posts for popular subs, all used to push products and narratives. Drop ship stores for popular items, thinly veiled \"I use X service and it's great. My stock returns thanks to Ys magical TA is wonderful\".\n\n\n\nAnd no, the \"people\" can't downvote ads because it's ridiculously cheap to buy an Indian uovote farm giving your ad a thousand upvotes within minutes. Making sure it hits the frontpage... Next time you feel like waking up, take a look at the post history of most profiles on the frontpage and bigger subs. You'll see *it's a lot of poorly hidden advertising* especially in stocks subreddits.",
          "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l74sw3v/",
          "created": 1717539588,
          "depth": 1,
          "replies": [
            {
              "id": "l74xjsj",
              "score": 4,
              "body": "Im not sure what you're referring to. Want to give an example?\n\nIn the last couple weeks, I used Reddit to research and purchase a TV and a Snowblower. I don't believe I was coxed into my decisions by advertisers. I used r/snowblowers and r/HTBuyingGuides",
              "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l74xjsj/",
              "created": 1717541362,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l74m2r0",
      "score": 8,
      "body": "I use reddit, and enjoy using the platform over and above anyhing Meta et al has to offer. I'm going long.",
      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l74m2r0/",
      "created": 1717537113,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l76df0w",
      "score": 7,
      "body": "There's a bunch of good reasons I think.\n\n1) it's a good AI play. AI needs training data. Reddit has a fuck ton of training data. In many use cases, this will be the premier place to get human written text data. If the AI hype keeps increasing, Reddit is in good position to profit from it, even if its all just hype. \n\n2) Ads on reddit are also just ok. There's tons of rooms for improvement. You can't buy space on specific pages. Targeting is not great. But machine learning and language processing can improve the targeting tremendously and they should have the funds now to recruit the kind of talent they need to implement a better system. Also the state of art and tech stack to implement such a system is improving in their favor.  This should be easy to see in their bottom line, so if you don't see an improvement over time, that's a good sign to sell.\n\n3) I'm actually kind of stupefied that Google hasn't bought reddit yet. They depend so much on reddit for many search cases. With google search quality decreasing, and the need to compete with AI increasing,  they should set a floor on Reddit's price.\n\n4) Elon bought Twitter for 44 billion. Who knows what its worth now, some say 12 billion but, at 8 billion reddit is pretty cheap. And speaking of, Twitter circling the drain is good for reddit. They are their main competitor so what's bad for Elon is good for reddit.",
      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l76df0w/",
      "created": 1717564247,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l74bf8h",
      "score": 11,
      "body": "When it launched I told myself \"I will buy at 42.0 and sell at 69.96\" and my stance hasn't changed.",
      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l74bf8h/",
      "created": 1717533489,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l75bgl9",
      "score": 4,
      "body": "They absolutely do have a clear path to increasing revenue, Their user base. They also just closed two 60 mil deals for data licensing. Targeted ads are a new product they are researching right now, and their q/q ARPU has only been increasing, even with record user growth.",
      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l75bgl9/",
      "created": 1717546837,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l745hcj",
      "score": 10,
      "body": "Every single reddit post is potential for a targeted ad. Sure it’s anonymous but visitors are visiting a very specific subreddit with lots of text that can trigger a targeted ad…. So much potential for ad growth here!",
      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l745hcj/",
      "created": 1717531542,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l76p0m1",
      "score": 3,
      "body": "Go full ham on this shit stock. I already almost doubled my profits. Fuck it.",
      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l76p0m1/",
      "created": 1717571660,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l95u73q",
      "score": 3,
      "body": "This is a $300 stock you can get for 50ish bucks currently. They are putting their ad infra in place now. They just got Double verify. Next they will build out targeted media and retargeting. It’s the 6th most visited website in the world and the crossover / contextual targeting opportunity is unmatched. The stock is a winner",
      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l95u73q/",
      "created": 1718722283,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7587gi",
      "score": 2,
      "body": "You’re correct.",
      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l7587gi/",
      "created": 1717545520,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l745lq0",
      "score": 3,
      "body": "When it comes to ads, I have little hope that reddit is going to be able to change just how atrocious their numbers are, unless they change the site so drastically that tons of users abandon the platform and move onto another site. The ads are barely effective at all for advertisers, and the money rake in for ads per active user is atrociously low compared to the competition.\n\nIMO any growth in revenue, and any profits, are likely to be highly dependent on how much AI companies are willing to pay to access their data to train their AI.\n\nIf you're bullish on it then you should hope that the rates reddit brings in from those AI data deals goes up overtime as much as Google's payments to Apple to be the default search engine have gone up overtime (i.e. from a small amount in the millions annually when it started, to close to $20 billion annually last I heard).",
      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l745lq0/",
      "created": 1717531581,
      "depth": 0,
      "replies": [
        {
          "id": "l75bunv",
          "score": 8,
          "body": "I don’t know why you think their ad numbers are atrocious. That have best in class arpu second only to Facebook. Also, why do you think their revenue growth is dependent on AI? They posted record user growth on their historic worst quarter, and record revenue too.\n\nWhere are you getting your information from?",
          "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l75bunv/",
          "created": 1717546995,
          "depth": 1,
          "replies": [
            {
              "id": "l78maiv",
              "score": 2,
              "body": "IMO a lot of people have never read an earnings report in their lives. \n\nI feel like people just keep repeating things they’ve heard.",
              "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l78maiv/",
              "created": 1717604906,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l75cgtp",
          "score": 1,
          "body": "Reddit already blew their load and sold their data rights to Google for cents.",
          "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l75cgtp/",
          "created": 1717547245,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l74879h",
      "score": 3,
      "body": "> On one side, it's a healthy business\n\n  \nit is...? it's wildly unprofitable lmao",
      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l74879h/",
      "created": 1717532440,
      "depth": 0,
      "replies": [
        {
          "id": "l753tou",
          "score": 5,
          "body": "Why do you say it’s “wildly unprofitable” ?\n\nTaken from their earnings report:\n“Net loss was $575.1 million, as compared to $60.9 million in the prior year. Stock-based compensation expense and related taxes were $595.5 million, as compared to $13.2 million in the prior year, driven by IPO charges”\n\nI’ve used the official app for a few years now and have definitely noticed the influx of ads. They’re throwing everything at the wall to bring in more cash. I wouldn’t put much weight on the Open AI or similar either; typically these deals are only for a couple mil. However, the changes they’ve made recently has done a lot to start printing cash for this company.",
          "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l753tou/",
          "created": 1717543789,
          "depth": 1,
          "replies": [
            {
              "id": "l755758",
              "score": -2,
              "body": "i genuinely cant tell if you're trolling or you can't read an income statement\n\n  \nnet LOSS means they're LOSING money. granted, this is a one time event due to IPO SBC expenses so it's difficult to differentiate between annual SBC/IPO option exercises but atm, their normal margins are around -20%",
              "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l755758/",
              "created": 1717544325,
              "depth": 2,
              "replies": [
                {
                  "id": "l757iq8",
                  "score": 10,
                  "body": "Thanks for putting your ignorance and ridiculous ego out to show for everyone on the internet.\n\nAs you said, a huge chunk of their losses came from IPO and Stock based compensation, which totaled net loss of 595mil. Last year, they lost 12mil. \n\nLast year they lost 12 mil, revenue was 148 mil. This year, the revenue was up by 48% to 243 mil. If growth is good and they stay disciplined with their spending, one should expect positive earnings within the next couple of quarters.",
                  "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l757iq8/",
                  "created": 1717545248,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l756yyd",
                  "score": 4,
                  "body": "They’ll be showing profits in no time, their overhead is microscopic and they’re already making value-adding moves",
                  "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l756yyd/",
                  "created": 1717545026,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l757as5",
                      "score": 3,
                      "body": "again...they've never been profitable...im not sure why you think their overhead is microscopic, have you actually looked at their income statement?\n\nit takes a lot of staff to maintain a website like reddit",
                      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l757as5/",
                      "created": 1717545159,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l75bdys",
                          "score": 2,
                          "body": "A lot of companies aren’t profitable before they go public, and a lot of those take a while before they get there. But actually on an adjusted EBITDA basis they’re already positive. And I misspoke about the overhead - that is the only large expense they have along with infrastructure, they spend next to nothing on CapEx so as they continue to grow they’ll be able to capture all that revenue",
                          "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l75bdys/",
                          "created": 1717546807,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l75del6",
                              "score": 5,
                              "body": ">But actually on an adjusted EBITDA basis they’re already positive \n\nThis is me saying my paycheck isn’t enough to support my cost of living. But if I exclude rent, food, and utilities, it is. Lmao obviously if you just simply exclude large expenses you’ll become profitable\n\nBeing capex light is great but it’s not enough of a differentiator from the many other businesses out there",
                              "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l75del6/",
                              "created": 1717547622,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l75et4l",
                                  "score": 2,
                                  "body": "It’s still a major metric that a lot of companies don’t meet at this stage. And a large portion of the expenses have been IPO preparation as others have pointed out, it’s completely reasonable to exclude those. They’re also extremely different from other socials in that regard lol, they all carry videos and images while Reddit just carries text.\n\nAll this being said, I’m quite happy I got to buy a bunch of shares at $34 and am still buying at $60. But you can miss out over irrational hatred of the platform if that’s what you prefer",
                                  "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l75et4l/",
                                  "created": 1717548189,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lkwlo38",
                          "score": 1,
                          "body": "Because they weren't public, they had no need to act as fiduciary for shareholder values... \n\n  \nA website like reddit doesn't take a lot of staff to maintain, relatively speaking. That's the whole advantage of SaaS/cloud online businesses.... By the time a biotech company gets into phase 1 trials (no where even near product on market) and is still worth nothing with no revenue or sales in sight for at least 10+ years,, the amount of money spent is the same amount that Instagram had to spend to be a multibillion dollar company acquired by Facebook. The margins are extremely low and the cost of revenue is extremely low for online businesses....",
                          "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/lkwlo38/",
                          "created": 1725145044,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l75bziy",
          "score": 2,
          "body": "May I ask why you would lie about something like this?",
          "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l75bziy/",
          "created": 1717547050,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l75ulk9",
      "score": 1,
      "body": "I remember spending some money on Reddit goodies, I wonder why they stopped selling those things?",
      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l75ulk9/",
      "created": 1717554794,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l78ycne",
      "score": 1,
      "body": ">Yet, on the other side, RDDT doesn't seem to have a clear path for increasing net revenue. They don't do targeted ads like Meta, no marketplace, and the current monetization drivers seem weak today and in the long term.\n\nUm....don't they? Just flipping through their S-1, they increased revenue by ~20% when comparing FY'23 to FY'22\n\nTheir (only) 10-Q shows an increase in revenue from ~$164mm in Q1'23 vs ~$243mm Q1'24 (~48% increase Q1 YTD Y-o-Y).\n\nAlso -- not sure where the notion that RDDT \"doesn't have a clear path for increasing net revenue\" considering [all the pages in their filings dedicated to that very point.....](https://imgur.com/a/mTuTQhG)\n\n>So if stocks are built on expectations people have that future demand will increase, and that it will drive the stock price up - it doesn't seem that optimistic right now, or I'm getting this totally wrong?\n\nCounterpoint: The increase in stock price is based on historical revenue growth (which sticks out like a sore thumb.....) and it seems incredibly optimistic.",
      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l78ycne/",
      "created": 1717608961,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9hpsys",
      "score": 1,
      "body": "Imagine if RDDT just threw more ads in comments, over videos… As it is they have virtually no ads compared to other competitors. That is an easy method for growth. \nOn top of that they could allow for a “shop” like on TikTok,Instagram,Facebook… Specifically a lot of memorabilia communities are larger on Reddit than the actual places they sell (WhatNot, Ebay…) This would be an instant massive boost.\nThe slower more safe way would be to just increase engagement. Idk how but maybe through more “shorts” type of content, hosting events like r/place, hosting streams (either like twitch or sporting events), allowing games to be played on reddit, give better rewards for using reddit…\n\nIm in, and just bought more today with the big dip! The valuation is already low imo compared to things like Snapchat and Pinterest",
      "permalink": "/r/stocks/comments/1d853m0/rddt_practical_approach/l9hpsys/",
      "created": 1718904485,
      "depth": 0,
      "replies": []
    }
  ]
}