{
  "title": "SQ a buy at this level? ",
  "score": 70,
  "selftext": "Is now the time to double up on this? \n\nTwo consecutive quarters of stellar growth and profits. \n\nEntering the S&P 500 is expected soon\n\nProfit taking and shorts have taken it from $80 to $64. It’s showing excellent support at this price point. \n\nThe stock had more than double in the last 12 months and was due a consolidation.\n\nSQ owns a supply of BTC and is buying some on a quarterly basis. BTC is running up. This also bodes well for the stock. \n\nIs it time to see it spring back to $400?\n",
  "link_flair_text": null,
  "id": "1d8nht6",
  "num_comments": 61,
  "created_utc": 1717586501,
  "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/",
  "comments": [
    {
      "id": "l77d05t",
      "score": 35,
      "body": "Not to $400, but maybe $100 EOY, because for some reason Wall Street is expecting revenue growth for tech companies to be around 10%+ this year. It can’t rely on the BTC long-term since that’s cyclical, but if it gain decent market share and show continued positive net income in the coming quarters then it should be well-positioned.",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77d05t/",
      "created": 1717587694,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l77cv78",
      "score": 27,
      "body": "I like that they are turning profitable and growing their profitability.  If they can maintain double digit revenue growth will be interesting to see how they progress.  I don't think shorting is causing the price fall though tbh, but probably concerns over long term revenue growth.  One of the reasons they are probably focusing on profit is slow down in growth.  Just a guess though",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77cv78/",
      "created": 1717587626,
      "depth": 0,
      "replies": [
        {
          "id": "l77eos1",
          "score": -38,
          "body": "There was a short attack about the same time as earnings.",
          "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77eos1/",
          "created": 1717588512,
          "depth": 1,
          "replies": [
            {
              "id": "l77p8uf",
              "score": 23,
              "body": "What are you basing this claim off of",
              "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77p8uf/",
              "created": 1717593239,
              "depth": 2,
              "replies": [
                {
                  "id": "l7fjz0l",
                  "score": 1,
                  "body": "They were attacked by a short seller in like q2 of 2023, not this year.",
                  "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l7fjz0l/",
                  "created": 1717707547,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7fkgk2",
                      "score": 1,
                      "body": "What are you basing this off of \n\nAlso why do we use this moronic language “attacked” \n\nShort sellers are #1 good for the overall system and #2 perfectly legal\n\nWhen you phrase it this was its very biased towards a unjustified dislike of shorts",
                      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l7fkgk2/",
                      "created": 1717707712,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l7flpqq",
                          "score": 3,
                          "body": "[deleted]",
                          "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l7flpqq/",
                          "created": 1717708151,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l781xhd",
      "score": 16,
      "body": "I started buying a while back, acb in $70-80 range. It's one of the most interesting technical founder-led companies that's innovating on many different fronts. They have unique moat compared to peers because of successful businesses in both b2c and b2b. Some really talented people work in Block, and their numbers in recent quarters are really really good. Their business is becoming efficient, and they're only getting started on AI. IMO this thing rips to $150s within a couple of years. Somewhat risky because of potential compliance problems (which they're getting investigated for) and any future Hindenburg type stuff. But it's a really interesting company with great potential at good price right now.",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l781xhd/",
      "created": 1717597987,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l78hnxl",
      "score": 11,
      "body": "I like (and have) SQ at this level and its profile has started to change from COVID times. A couple of reasons why I like it:  \n- Headcount has remained mostly flat for this year so operating margins and EBITDA margins have increased significantly.   \n- Its profitable and cash flow positive as well and the valuation is reasonable on a price to adjusted earnings perspective.  \n- Product velocity seems to have increased a bit since not shipping really anything super user facing on the cashapp side in 2021/2022 (e.g. savings + loans)\n\nI have a simple model that I use and I have fair value around $55-$85 so its trading closer to the bottom end of my fair value range. Its also growing gross margin high teens % per year with a bit of margin expansion so I can see it being a 20-25% earnings compounder for the next few years as well.\n\nCouple of risks that I look at:  \n- SQ trades very much in line with interest rate sensitive assets so that's a big ?  \n- Regulatory inquiries may result in fines. I don't have a great sense of what this would net out to but my instinct says not huge but a risk nonetheless  \n- I see the value of BTC long term but not everyone does and SQ has exposure there (although recent IR info suggests minimal investment in BTC overall for SQ)",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l78hnxl/",
      "created": 1717603359,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l79kow5",
      "score": 8,
      "body": "Sq is up there with my largest holdings. Very bullish long term",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l79kow5/",
      "created": 1717616418,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l77ht68",
      "score": 16,
      "body": "A word of caution - Federal prosecutors are investigating SQ for compliance failures.",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77ht68/",
      "created": 1717590007,
      "depth": 0,
      "replies": [
        {
          "id": "l77i836",
          "score": -14,
          "body": "Sources? \n\nThat was the short’s narrative, but there wasn’t even a mention of it in the earnings call.",
          "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77i836/",
          "created": 1717590196,
          "depth": 1,
          "replies": [
            {
              "id": "l77jn5e",
              "score": 7,
              "body": "A quick Google search returned this: https://www.nbcnews.com/business/personal-finance/prosecutors-examining-transactions-block-owner-cash-app-squarc-rcna147181",
              "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77jn5e/",
              "created": 1717590845,
              "depth": 2,
              "replies": [
                {
                  "id": "l77muze",
                  "score": 0,
                  "body": "Seems a little shady….but if true, isn’t that priced in at this point?",
                  "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77muze/",
                  "created": 1717592252,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l77sq68",
                      "score": 10,
                      "body": "The news of investigation should be priced in, but not the outcome of the investigation itself so tread with caution.",
                      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77sq68/",
                      "created": 1717594614,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l77tkfk",
                          "score": -2,
                          "body": "Like I said, it seems shady. “Prosecutors”….from where? \n\nThe last company I invested in after a similar situation was ADM. the reporting of that was totally different.",
                          "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77tkfk/",
                          "created": 1717594937,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l78s62t",
                              "score": 4,
                              "body": "The article I shared with you clearly states that a former employee shared evidence of shady dealings with federal prosecutors from the Southern District of New York. \n\nI get a sense that you are not open to any criticism, however legitimate, against this stock/company. So I will respectfully bow out of this conversation. Good luck to you!",
                              "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l78s62t/",
                              "created": 1717606861,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l78tky0",
                                  "score": 0,
                                  "body": "I’m saying it sounds shady. \n\nThere’s nothing else mentioning it, nothing. No one on the earnings call mentioned it(not even from an analyst). \n\nWhen something of that magnitude hits, there’s usually a corporate response. \n\nI get a feeling this was a nothing burger.",
                                  "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l78tky0/",
                                  "created": 1717607344,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l77pdco",
                      "score": 4,
                      "body": "Too big to fail. Dorsey & peers pay off slap on wrist fees and continue to print 🖨 💰",
                      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77pdco/",
                      "created": 1717593289,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l77l2gy",
      "score": 19,
      "body": "Kathy is it you?",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77l2gy/",
      "created": 1717591485,
      "depth": 0,
      "replies": [
        {
          "id": "l77mw9m",
          "score": 1,
          "body": "No….",
          "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77mw9m/",
          "created": 1717592267,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l77viu4",
          "score": 1,
          "body": "It's Karen. Kathy's right hand.",
          "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77viu4/",
          "created": 1717595678,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l79b3cj",
      "score": 3,
      "body": "I sold when they announced they were buying some streaming music service called Tidal. Seemed reckless and ridiculous. Turned out to be a great decision as that was around it's all time highs.",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l79b3cj/",
      "created": 1717613218,
      "depth": 0,
      "replies": [
        {
          "id": "l79c5px",
          "score": 3,
          "body": "Valid point. I too didn’t get that one.",
          "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l79c5px/",
          "created": 1717613569,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7fksvk",
          "score": 2,
          "body": "That was a dumb move but all told a pretty minor acquisition. I’d be more inteeested in the afterpay acquisition",
          "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l7fksvk/",
          "created": 1717707831,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7cw125",
          "score": 1,
          "body": "Nobodys perfect",
          "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l7cw125/",
          "created": 1717673760,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7910il",
      "score": 5,
      "body": "The financials are solid but the price trend is not. Personally, I’d want to see it show some relative strength before taking a position",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l7910il/",
      "created": 1717609865,
      "depth": 0,
      "replies": [
        {
          "id": "l79cj72",
          "score": 2,
          "body": "I’m waiting on that too. Probably 2 more quarters. But, it could also double as it unfolds.",
          "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l79cj72/",
          "created": 1717613693,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7a21yj",
      "score": 4,
      "body": "I just sold my shares this morning. Their debt is scary.",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l7a21yj/",
      "created": 1717622224,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7ajunp",
      "score": 2,
      "body": "I like it 👍",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l7ajunp/",
      "created": 1717628771,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7b0q9n",
      "score": 2,
      "body": "Thanks for this post. It feels like the right time to buy to me. They also own cash app which is under monetized, and can drive some growth.",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l7b0q9n/",
      "created": 1717635560,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7pvj6w",
      "score": 2,
      "body": "Here’s a good article, I hadn’t seen this….\n\n“Block Slams News Reports of a DOJ Investigation for Compliance Violations\nPeter Lucas  May 2, 2024 Acquiring, Competitive Strategies, Digital Currency, E-Commerce, Mobile Commerce, Point-of-sale, Transaction Processing\n\nBlock Inc. chief executive Jack Dorsey fired back at news reports that the U.S. Department of Justice is investigating the company for alleged compliance lapses at Block’s Square and Cash App units. The reports “lack full context,” Dorsey said during Block’s quarterly earnings call late Thursday.\n\nNews of the investigation surfaced Wednesday and was first reported by NBC News. The DOJ is reportedly looking at whether Block failed to properly assess risks associated with some customers and processed cryptocurrency transactions for terrorists. Justice also is reportedly looking into whether Square processed transactions for countries economically sanctioned by the United States.\n\n\n“In general, these sorts of stories can lack full context,” Dorsey said. “First, we do not believe that there is any new investigation into Block, but rather that these reports relate to the existing inquiry by the DOJ that we’ve previously disclosed.”\n\n\nDorsey: “Our work is to constantly be steps ahead of [criminals’] attacks through better use of technology.”\nDorsey added that, in 2022, Block’s Compliance Emerging Risk team, which investigates threats, conducted “a thorough review” of transactions potentially associated with sanctioned countries.\n\n“We voluntarily reported these to the Office of Foreign Assets Control, we were transparent with them, and we stand by the scope of transactions that were included in the report,” Dorsey said. “OFAC then issued us a No Action Letter in which they determined no further investigation or action was needed at the time. This is how this process is supposed to work and this outcome was not originally included” in news stories.\n\nAddressing fears that Bitcoin could help finance terrorism, Dorsey noted Block uses advanced technologies to identify potential bad actors. These include blockchain analytics from firms that screen transactions in real time. Other measures include restrictive limits for on-chain Bitcoin withdrawals and moves to ensure identity verification for customers engaging with Block’s Bitcoin products. Bitcoin trading constitutes a portion of Block’s business as Dorsey has long advocated for cryptocurrency as a mode of payments.\n\n “Our work is to constantly be steps ahead of [criminals’] attacks through better use of technology,” Dorsey said. “It’s an always-on part of our business, and it always will be.”\n\nLess than 3% of Block’s resources are dedicated to Bitcoin-related projects, and those costs are covered by the profits from Block’s Bitcoin exchange, which is Cash App’s fourth-largest gross profit stream, Dorsey said in a shareholder letter released Thursday.\n\nDorsey noted in the letter that 1.6 million Cash App Card actives have used Cash App’s Bitcoin Round Ups feature to convert spare change from everyday transactions into Bitcoin.\n\nDorsey added that Block is developing a new mining chip, in addition to an entire mining rig system for “further decentralizing both the supply of mining hardware and the distribution of hashrate, the computing power devoted to mining Bitcoin.”\n\nFor the March quarter, Block posted gross profits of $2.09 billion, up 22% from a year earlier. Cash App, Block’s mobile-payment service, posted gross profit of $1.26 billion, up 25% year over year. Square, Block’s point-of-sale payments platform, had gross profit of $820 million, up 19% from a year ago.\n\nProfitability during the quarter was so strong that Block is forecasting gross profits for 2024 to total at least $8.78 billion, which would be a 17% increase from 2023, said Amrita Ahuja, Block’s chief financial officer, who joined Dorsey on the call.\n\nThere were 24 million Cash App Card monthly actives during the first quarter, a 16% increase from a year ago, the company said. Block defines a transacting active as a Cash App account that performs at least one financial transaction using any product or service within Cash App during a specified period.\n\nNew initiatives planned for Cash App during 2024 include rolling out Afterpay, Block’s buy now, pay later offering acquired in 2022, to Cash App cardholders. With 24 million active Afterpay users, Ahuja said the BNPL service represents “a built-in audience” for Cash App. Block has seen “strong attach rates” during testing, she added.\n\nFor his part, Dorsey stressed moves at Square to fix point-of-sale reliability issues that resulted in an outage in September that effectively shut down transactions for an untold number of merchants. The outage was followed by the retirement of the executive running Square and Dorsey’s decision to take over the unit. “With Square, we want to focus on reliability, and make sure we stay up,” Dorsey said.\n\nOne step the company plans to take is to put Square merchants under contract. “It’s something we were against for many years,” Dorsey said. “We took a different take on it.” Contracts allow merchants “to get free hardware,” he said, adding “Contracts give sellers better predictability.””",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l7pvj6w/",
      "created": 1717876231,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la0mmja",
      "score": 2,
      "body": "Lots of calls building up for this next week! Big news coming?",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/la0mmja/",
      "created": 1719212847,
      "depth": 0,
      "replies": [
        {
          "id": "la2v1h1",
          "score": 2,
          "body": "SQ got an upgrade this morning with a price target of $80.",
          "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/la2v1h1/",
          "created": 1719250505,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbw3auz",
      "score": 3,
      "body": "Finally looks better technically. Could easily be $120 by year end and 180-190 within a year. Fundamentals look as solid as they ever have. \nBeing added to the S&P is just a matter of time.\n\nI’m very curious as to how quiet the name has been on stock forums here and on X and Stocktwits. That said, I’m long at $63",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/lbw3auz/",
      "created": 1720272775,
      "depth": 0,
      "replies": [
        {
          "id": "loufs1d",
          "score": 1,
          "body": "Have traded a $58-$68 range a few times. Will be building a long position over the next few weeks. $sq",
          "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/loufs1d/",
          "created": 1727267562,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljnqnwf",
      "score": 2,
      "body": "PB is 2.0\nPE is 51\nRevenue rising.\nBalance sheet is very healthy. \nDo you see any risks?",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/ljnqnwf/",
      "created": 1724473628,
      "depth": 0,
      "replies": [
        {
          "id": "ljq6kkf",
          "score": 1,
          "body": "Competition is the biggest risk. But I see SQ with some advantages in its total offerings.",
          "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/ljq6kkf/",
          "created": 1724517783,
          "depth": 1,
          "replies": [
            {
              "id": "ljqr4wv",
              "score": 2,
              "body": "Yes, I think this company is doing really well financially and will survive for the next 5 yrs. This is a good growth stock, and It's cheap now, so im buying more. If its liabilities exceed assets, then I would be worried.",
              "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/ljqr4wv/",
              "created": 1724524595,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l78ydn6",
      "score": 2,
      "body": "Not yet in my opinion, but pypl  is close on support and gpn directly on that. Others notable like adyen and bill still sinking with the latest making fresh lower data point..",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l78ydn6/",
      "created": 1717608971,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l77yf1b",
      "score": 4,
      "body": "Zero moat. Way too many other ways to send money. There are several competitors for each of SQs business segments. This is a stock that can double within a month, but I personally just don’t want the risk. I see it coming back down significantly before it ever comes back up. I hope you make money but I just think there are other ways to invest in their offerings.",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77yf1b/",
      "created": 1717596739,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l79xs4m",
      "score": 2,
      "body": "My cost basis is 95. I’ve averaged down all I can to get here. 15 shares long.\n\nAlso a Bitcoin bull though so I’m biased.",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l79xs4m/",
      "created": 1717620765,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la2wahv",
      "score": 1,
      "body": "Goldman reiterated its buy rating with an $80 price target.",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/la2wahv/",
      "created": 1719250912,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7948li",
      "score": 1,
      "body": "There are stocks outside of MAG7?",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l7948li/",
      "created": 1717610933,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l77kc44",
      "score": -1,
      "body": "Profit taking? lol",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77kc44/",
      "created": 1717591162,
      "depth": 0,
      "replies": [
        {
          "id": "l77mqms",
          "score": 4,
          "body": "Yes….it had more than doubled in 12 months.",
          "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77mqms/",
          "created": 1717592201,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l77rkfs",
      "score": -9,
      "body": "I personally won't ever buy a company run by Jack Dorsey. I don't like Elon, but he did prove Twitter didn't need 75% of their employees. I just don't have faith Dorsey will maximize shareholder value",
      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77rkfs/",
      "created": 1717594159,
      "depth": 0,
      "replies": [
        {
          "id": "l77s6ad",
          "score": 7,
          "body": "He sold twitter at a premium.",
          "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77s6ad/",
          "created": 1717594399,
          "depth": 1,
          "replies": [
            {
              "id": "l77sfyr",
              "score": 1,
              "body": "So you're expecting Elon to bail out Square too?",
              "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77sfyr/",
              "created": 1717594504,
              "depth": 2,
              "replies": [
                {
                  "id": "l77st9d",
                  "score": 1,
                  "body": "Bail out? \n\nDid you take a look at the profits from the last two quarters? \n\nHe learned a valuable lesson from Elon, especially on the number of employees.",
                  "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77st9d/",
                  "created": 1717594646,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l77telt",
                      "score": 1,
                      "body": "Square has 13,000 employees...\n\n\nThose profits have caused the stock to rise 2% in the past year...\n\n\nYou can buy if you believe, I just don't see it",
                      "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77telt/",
                      "created": 1717594876,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l77sqya",
          "score": 3,
          "body": "In the past five years, Square is down 5% while qqq is up 152%. I don't see him outperforming the benchmark over the next 5 years",
          "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77sqya/",
          "created": 1717594622,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l77wo9d",
          "score": 2,
          "body": "Disagree with this. The company formerly known as Twitter has been in trouble with regulatory agencies like the FTC ever since then, and the platform itself has been plagued with technical issues and much more spam. Having those employees were crucial for keeping the company stable.",
          "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l77wo9d/",
          "created": 1717596105,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l78tb1n",
          "score": 2,
          "body": "Elon proved if you cut 75% of your employees you can also tank revenue and the value of your company by 70% and burn cash hand over fist. Brilliant insight.",
          "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l78tb1n/",
          "created": 1717607250,
          "depth": 1,
          "replies": [
            {
              "id": "l78unga",
              "score": 1,
              "body": "Classic case of correlation and not causation. He bought at a huge premium and then alienated advertisers with his comments.\n\n\nThe firing of employees did not cause the valuation to drop",
              "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l78unga/",
              "created": 1717607705,
              "depth": 2,
              "replies": [
                {
                  "id": "l79baac",
                  "score": 2,
                  "body": "Strong disagree. The complete eradication of content teams, sales teams, ad teams, support teams, etc. absolutely had a direct impact on the decimation of advertising revenue.",
                  "permalink": "/r/stocks/comments/1d8nht6/sq_a_buy_at_this_level/l79baac/",
                  "created": 1717613282,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}