{
  "title": "Dollar Tree is exploring a sale of its Family Dollar brand ",
  "score": 56,
  "selftext": "Dollar Tree announced Wednesday it is considering a sale of its more grocery-focused Family Dollar brand.\n\nThe company had recently shared plans to close almost 1,000 Family Dollar stores in an attempt to revamp the struggling business. The discounter closed more than 500 locations during its fiscal first quarter, it said Wednesday.\n\n“We are already beginning to see progress in this targeted strategy in the streamlined Family Dollar banner,” the company said in a press release. “The unique needs of each banner at this time – transformation at Family Dollar and growth acceleration at Dollar Tree – lead us to the decision to conduct a thorough review of strategic alternatives for the Family Dollar business.”\n\nDollar Tree bought Family Dollar in 2015 for almost $9 billion. The business has been struggling ever since to compete against its major rival, Dollar General.\n\nThe company has not set a deadline or definitive timetable for the sale review process, and is working with JPMorgan and Davis Polk & Wardwell advisors in its review.\n\nShares of Dollar Tree fell about 2% in premarket trading Wednesday.\n\nThe update came alongside Dollar Tree’s fiscal first-quarter earnings report, in which Family Dollar lagged.\n\nSame-store sales for the company’s Dollar Tree brand rose 1.7% while Family Dollar sales climbed only 0.1%. Enterprise sales rose 1%.\n\nRevenue rose to $7.63 billion, up about 4% from $7.32 billion a year earlier.\n\nThe company said it expects sales for the second quarter will range from $7.3 billion to $7.6 billion, with sales growth for the Dollar Tree banner of between 2% and 4% and sales for the Family Dollar segment approximately flat.\n\nHere’s how the discounter did in its first fiscal quarter compared with what Wall Street was anticipating, based on a survey of analysts by LSEG:\n\nEarnings per share: $1.43 cents vs. $1.42 expected\n\nRevenue: $7.63 billion vs. $7.63 billion expected\n\nThe company’s reported net income for the three-month period that ended May 4 was $300.1 million, or $1.38 cents per share, compared with $299 million, or $1.35 per share, a year earlier. Adjusting for one-time items, including the cost of store closures, the company reported earnings of $1.43 per share.\n\nThe company also mentioned that it incurred losses totaling $117 million as of early May, after a tornado destroyed the company’s distribution center in Marietta, Oklahoma on April 28. The facility sustained significant damage, and the inventory in the facility as well as the facility itself are not salvageable, Dollar Tree said in the report.\n\nThe company said it expects the incurred losses to be offset by insurance recoveries.\n\nThe dollar store segment is going through tough times as lower-end consumers pull back in the face of higher costs. Although a shift to cost-cutting efforts sounds like it would have benefitted dollar stores, the discounters are increasingly losing market share to value retailers like Walmart and e-commerce retailers like Temu.\n\nDollar Tree fell short of expectations for holiday-quarter sales in its fourth quarter earnings report, meanwhile its main competitor Dollar General surpassed estimates.\n\nDollar Tree has been in the midst of a broader turnaround effort since current CEO and former Dollar General CEO Richard Dreiling took the helm in early 2023.\n\nShares of the company have pulled back roughly 15% in 2024.\n\nSource: https://www.cnbc.com/2024/06/05/dollar-tree-earnings-family-dollar-sale-process.html",
  "link_flair_text": null,
  "id": "1d8pw4c",
  "num_comments": 5,
  "created_utc": 1717593954,
  "permalink": "/r/stocks/comments/1d8pw4c/dollar_tree_is_exploring_a_sale_of_its_family/",
  "comments": [
    {
      "id": "l77t6s4",
      "score": 34,
      "body": "Dollar Tree made a big mistake buying Family Dollar. They will probably end up losing money on the purchase and sale of this problematic business.",
      "permalink": "/r/stocks/comments/1d8pw4c/dollar_tree_is_exploring_a_sale_of_its_family/l77t6s4/",
      "created": 1717594792,
      "depth": 0,
      "replies": [
        {
          "id": "l799dl7",
          "score": 13,
          "body": "What’s interesting to me is Rick Dreiling wanted to buy Family Dollar (and he’s a former ceo of competitor Dollar General). Dollar Tree outbid him, in 2016 or whenever that was. \n\nIn 2022, he bought enough stock to force a takeover of Dollar Tree and installed himself as CEO in January of 2023. That’s the very short version, other parties were involved. During some of his early remarks he basically said, “betcha wish I’d bought Family Dollar now don’t ya?”\n\nAnd now they are looking at possibly selling FD while DT undergoes dramatic changes. \n\nThe whole situation is messed up. Will DT make the turn to success?  I have my doubts but since I own a decent chunk of the stock (former employee) I sure hope so.",
          "permalink": "/r/stocks/comments/1d8pw4c/dollar_tree_is_exploring_a_sale_of_its_family/l799dl7/",
          "created": 1717612645,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l77ur1l",
      "score": 10,
      "body": "I’ll buy it for $1",
      "permalink": "/r/stocks/comments/1d8pw4c/dollar_tree_is_exploring_a_sale_of_its_family/l77ur1l/",
      "created": 1717595388,
      "depth": 0,
      "replies": [
        {
          "id": "l77vzrk",
          "score": 4,
          "body": "$1.25 now.",
          "permalink": "/r/stocks/comments/1d8pw4c/dollar_tree_is_exploring_a_sale_of_its_family/l77vzrk/",
          "created": 1717595851,
          "depth": 1,
          "replies": [
            {
              "id": "l7d7tea",
              "score": 1,
              "body": "I'll go $1.26",
              "permalink": "/r/stocks/comments/1d8pw4c/dollar_tree_is_exploring_a_sale_of_its_family/l7d7tea/",
              "created": 1717679158,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}