{
  "title": "Cisco trading at its 52-week low",
  "score": 86,
  "selftext": "Right now I'm working on due diligence for the Hewlett Packard-Juniper Networks M&A deal (HPE/JNPR). Two comparables came up that I don't see mentioned enough: Cisco and Ubiquiti Networks.\n\nFirst, Ubiquiti crushes it. The company produces steady revenue and healthy margins. If you talk to your local MSP/IT guy, they know how great Ubiquiti wifi products are. $9b stock. Also, I've noticed a big difference in management after Robert Pera took a larger stake. This is worth revisiting at a later point.\n\nAs for Cisco, I was surprised to see the stock still sliding downward. Today they announced a $1b A.I. fund at Cisco Live in Vegas ($200m already invested). It's neither a big deal nor a serious moneymaker, but Cisco is still a powerhouse stock.\n\nNow the stock P/E ratio is reaching its historical average (\\~15x), the price is looking attractive. Even with the current challenges (Splunk, layoffs etc), I don't see the downtrend lasting for much longer. Maybe 15-20%. Cisco is an excellent M&A shop so I don't see them sitting still during this next cycle either.\n\nLet me know what you think the downsides might be. Or what else I'm missing here.",
  "link_flair_text": "Company Discussion",
  "id": "1d93efl",
  "num_comments": 71,
  "created_utc": 1717628106,
  "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/",
  "comments": [
    {
      "id": "l7asp8d",
      "score": 88,
      "body": "Just a very mature company with surprisingly low growth. It’s not trading at a large enough discount for me to get my desired average return. It’s fine if you’re looking for a steady 6 or 7%, which you’ll likely get through the dividend and share buybacks.",
      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7asp8d/",
      "created": 1717632269,
      "depth": 0,
      "replies": [
        {
          "id": "l7aufpk",
          "score": 17,
          "body": "Agreed. Not swinging for the fences here but it's more reasonably priced than other tech stocks.",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7aufpk/",
          "created": 1717632974,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7gp8f3",
          "score": 2,
          "body": "Did the reputational damage from the Snowden leaks ever go away? I remember that being pretty damaging at the time when it was revealed that CISCO products were infested with NSA backdoors.",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7gp8f3/",
          "created": 1717723437,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7b6bqa",
      "score": 46,
      "body": "Cisco just spent $28 billion to acquire Splunk, which significantly increases their cyber and data analysis capabilities.   If they can successfully apply these to improve their other products and services, the should get a boost.  If, on the other hand, they fail to achieve synergies, it will be yet-another Cisco acquisition that sounded better on paper than it turned out in real life.",
      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7b6bqa/",
      "created": 1717637896,
      "depth": 0,
      "replies": [
        {
          "id": "l7b6sqe",
          "score": 11,
          "body": "I think they'll pull it off. They are better than most at the M&A game.",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7b6sqe/",
          "created": 1717638091,
          "depth": 1,
          "replies": [
            {
              "id": "l7cdsf6",
              "score": 3,
              "body": "Never followed cisco. Which of their m&as were a hit?",
              "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7cdsf6/",
              "created": 1717661807,
              "depth": 2,
              "replies": [
                {
                  "id": "l7cew7x",
                  "score": 3,
                  "body": "They have 100s of small successful deals. Recent winners have been Acacia Communications, ThousandEyes and Meraki.",
                  "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7cew7x/",
                  "created": 1717662630,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7d4fcl",
                      "score": 1,
                      "body": "Meraki isn't all that recent lol",
                      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7d4fcl/",
                      "created": 1717677721,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l7dg8kz",
                          "score": 0,
                          "body": "12 years is recent to me in terms of Cisco's acquisition timeline. the company has been around for 40 years now.",
                          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7dg8kz/",
                          "created": 1717682402,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l7d4bvt",
                  "score": 1,
                  "body": "Cisco might as well be an ETF at this point",
                  "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7d4bvt/",
                  "created": 1717677680,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l7drl7q",
                  "score": 1,
                  "body": "Catalyst, Nexus, like most of their core network infrastructure products they bought.",
                  "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7drl7q/",
                  "created": 1717686367,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l7f7p8u",
              "score": 5,
              "body": "What makes you think so?   \nI have spent all my life in cyber world and have been a customer of Splunk before. I am close friends with buyers of security analytics products and I first hand know that all other alternatives of Splunk are making it more and more difficult to take Splunk seriously. \n\nThe recent \"platformazation\" strategy of PANW (disclaimer- I sold my start-up to them, so I am biased) is starting to make a dent. I hear from niche vendors that it is getting more difficult for their sales team to compete with the offers PANW and CRWD are offering. Note that CRWD acquired Humio (I was fortunate enough to be an investor in them) and in their latest earnings call, the CEO mentioned that they have never seen demand for their product like before. \n\nIn short, Splunk is going to face a hard time competing with other vendors. They will continue to reap rewards from existing customers but I highly encourage you to track net new ARR growth of their Splunk business.",
              "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7f7p8u/",
              "created": 1717703493,
              "depth": 2,
              "replies": [
                {
                  "id": "l7fdnin",
                  "score": 3,
                  "body": "Great points and thanks for sharing your insights. As for PANW and CRWD, both are excellent competitors for network and endpoint security. But neither provide hardware solutions nor do they have Cisco's track record.\n\nCSCO has been doing these types of deals for longer than PANW and CRWD have been around. Combined. In this particular case, I value Cisco's in-house M&A team and hardware solutions.",
                  "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7fdnin/",
                  "created": 1717705435,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7fel5x",
                      "score": 1,
                      "body": "The entire industry is moving away from hardware based solution. The entire market cap of ZScaler is due to the fact that they provide cloud service. PANW is intensely moving customers away from appliance to their cloud service (Prisma Access).  CloudFlare and Microsoft are new entrants in this space and they are both cloud based. Being hardware based is a liability for a company and not an asset. \n\nI am almost begging you to think hard if your thesis is based on the fact that they are hardware based.",
                      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7fel5x/",
                      "created": 1717705742,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l7fg7b1",
                          "score": 1,
                          "body": "My thesis is not entirely hardware-based, but Cisco makes the bulk of its money from other sources besides software. And since you are familiar with the cloud+cyber, you know these services have to run through some physical hardware (routers, networks, switches, etc).",
                          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7fg7b1/",
                          "created": 1717706281,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l7fhvgh",
                              "score": 1,
                              "body": "Those hardware resources are commodity and extremely low margin, and that's the exact reason Cisco started diversifying into the software business - from AppD to OpenDNS to Splunk- these are all software businesses with (then) high margins. And when it comes to Cloud Service Providers like AWS, GCP, Azure etc, they do heck lot of custom hardware engineering- there is no public data available about how much they buy from Cisco but my guess is that those revenues are at low margins. \n\n  \nSoftware is where the big bucks are (high margin ARR business with low to no capex) and that's why you see crazy high valuations for PANW, CRWD,  ZS etc. If a company is making most of the money from non-software business, you can see why it is trading at low PE. \n\n  \nI cannot comment on what is a good price point for CSCO but qualitatively, it is a very high risk stock to own. Don't fall into low PE trap- it is equivalent of how investors are lured into the high yield stocks and realize later on they were better off with index funds.",
                              "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7fhvgh/",
                              "created": 1717706838,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l7drum1",
          "score": 2,
          "body": "I’m at Cisco Live, they already have merging products with Splunk going GA in August.",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7drum1/",
          "created": 1717686455,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7h7fh9",
          "score": 2,
          "body": "They’re combining splunk with thousand eyes and their app analytics solution. It’s about to pop off for them.",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7h7fh9/",
          "created": 1717731231,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnw6wh2",
          "score": 1,
          "body": "They won't though. Usually when Cisco buys products they murder them with  stagnation. This isn't even the first or second logging and analytics company they've bought.",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/lnw6wh2/",
          "created": 1726752520,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7bmauk",
      "score": 9,
      "body": "Their main product line router has become commodity. Nothing exciting in the pipeline.",
      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7bmauk/",
      "created": 1717644947,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7c75pw",
      "score": 5,
      "body": "Arista, Ubiquiti, and others are eating away at Cisco's market share.  The move away from classic VoIP\\telephony and basic routers is hurting Cisco.  It used to be that a Cisco router handled both data and voice for a corporate office, that's why Cisco desk phones were so common despite their cost.  Now, people use Zoom, Teams, or a cloud based phone system that bypasses Cisco completely.  Without that anchor of needing Cisco for VoIP and data, companies can shop around.  Cisco's new category of SD-WAN (fancy cloud based mgmt) routers are hard to work with and not that popular.  Other SD-WAN routers are starting to become preferred.  And then there are switches, Cisco's Catalyst line is still popular, but others have caught up in terms of features and reliability (look at Arista's stock vs Cisco for the past year)",
      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7c75pw/",
      "created": 1717657033,
      "depth": 0,
      "replies": [
        {
          "id": "l7cg0mj",
          "score": 8,
          "body": "> Now, people use Zoom, Teams, or a cloud based phone system that bypasses Cisco completely.\n\nBrother, how do you think people are connecting to zoom, teams and cloud based phone systems?\n\nBlack magic fuckery? It's a router and switches in the corporate office and most of the time it's Cisco. \n\nI believe their VOIP business has been a small portion of the companies financials and always been dwarfed by the router/switch business. \n\nBusinesses are replacing desk phones for soft phones. But desk phones are not going away by any means. Think your customer service counter in any business, I don't think most would deploy a soft phone for this use case. Not to mention teams licenses for calling plans are fucking expensive. Usually need an E5 + Calling plan is roughly $70/month per user. \n\n> Arista, Ubiquiti, and others are eating away at Cisco's market share.\n\nUbiquiti is not taking away ciscos market share in enterprise environments, I'm 100% sure. Cisco is the primary vendor in a lot of businesses still.\n\nI've gotten product overviews for Aristas product line and honestly, everything except their switches are a fucking joke. Their firewalls are rebranded freeware that they charge the Cisco price tag for. \n\n> Cisco's new category of SD-WAN (fancy cloud based mgmt) routers are hard to work with and not that popular. Other SD-WAN routers are starting to become preferred\n\nYes/no. \n\nSD-WAN is a pretty useless bloated marketing term for centralized management and dynamic VPN tunnels. It's expensive and only big companies are using this. It's hardly a main thing that companies are using. \n\nArista is strong in the data center game because of their throughput and advancement to 100G and up switchports. No other vendor has really tried to tackle that market. Maybe extreme networks and a few others.\n\nA little bit apples to oranges comparison. Comparing Arista and Cisco. Cisco has a bigger product line up and more consistency across their products. \n\nYou're completely leaving out Cisco Meraki which dominates medium/small business as well. Arista doesn't have a competing product in that market. HP/Juniper, a little but still expensive. Dell is... A choice... But not ideal. \n\nCisco Umbrella, WebEx, and now the inclusion of splunk are all strong products. There are plenty of bad things to say about Cisco, but I disagree with a majority of your comment.",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7cg0mj/",
          "created": 1717663462,
          "depth": 1,
          "replies": [
            {
              "id": "l7k59ju",
              "score": 2,
              "body": "HP a little bit? Aruba instant on is pretty big for SMB market.\nAnd the Aruba CX switches are amazing for entreprise.\nWhen it comes to WiFi, Aruba beats Cisco by a mile.",
              "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7k59ju/",
              "created": 1717781966,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l7dnl66",
              "score": 1,
              "body": "Excellent response. Thanks for sharing.",
              "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7dnl66/",
              "created": 1717685006,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l7ih6cy",
          "score": 1,
          "body": "SDWAN is much more than just “fancy cloud management”.  If Cisco SDWAN is too hard to work with they have Meraki for the SMB category, but Cisco SDWAN is meant for the larger Enterprise/Service Provider customer so yeah it’s literally meant to have every bell and whistle.",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7ih6cy/",
          "created": 1717759769,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7bgswa",
      "score": 8,
      "body": "Cisco is the textbook definition of a reasonable growth giant. Cisco is great because they basically dominate networking tech and they're needed for the internet to, you know, function and all. If you think they're undervalued, go for it.",
      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7bgswa/",
      "created": 1717642389,
      "depth": 0,
      "replies": [
        {
          "id": "l7cmpyj",
          "score": 2,
          "body": "What growth? On a 10 year or 5 year basis they have grown revenue below the rate of inflation. And that's including all of the acquisitions they make. They don't dominate, they are losing market share almost everywhere and therefore are trying to offset those declines by making acquisitions.",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7cmpyj/",
          "created": 1717668287,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7audxq",
      "score": 25,
      "body": "It’s a shit company that clings on to its glorious past, that’s why. Their hardware used to be great, some of them are still good, but their software is garbage. Missed the cloud train, missed the AI train. They have better competitors in most areas they’re in. Why should it be any valuable?",
      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7audxq/",
      "created": 1717632954,
      "depth": 0,
      "replies": [
        {
          "id": "l7aut2n",
          "score": 9,
          "body": "Why is it valuable? Cisco hardware is everywhere. It is mission critical technology (switches, routers, network etc). During the pandemic, Cisco products had so much priority when secure teleconferencing was a necessity. Also they run the best M&A shop on the street. Consistent winners beyond the usual home runs for decades.",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7aut2n/",
          "created": 1717633126,
          "depth": 1,
          "replies": [
            {
              "id": "l7azdsa",
              "score": 11,
              "body": "Arista is eating Cisco's lunch right now for good reason. Cisco is not geared for innovation. Chuck is not the transformational leader the business needs. It's a dinosaur struggling to be relevant.",
              "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7azdsa/",
              "created": 1717635004,
              "depth": 2,
              "replies": [
                {
                  "id": "l7b1ekc",
                  "score": 6,
                  "body": "ANET is the 2nd/3rd competitor on my list. It's also under the radar and most people aren't familiar with the name. Jayshree Ullal is a fantastic CEO.",
                  "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7b1ekc/",
                  "created": 1717635841,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7c0yzv",
                      "score": 1,
                      "body": "Who are the 1st/2nd competitors on your list?",
                      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7c0yzv/",
                      "created": 1717652974,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l7c27zs",
                          "score": 5,
                          "body": "Linksys and Juniper",
                          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7c27zs/",
                          "created": 1717653764,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l7avjoy",
              "score": 12,
              "body": "It’s not “everywhere” unless you mean the Cisco telephones in your local gym lmao. They’re getting spanked in every technology group they’re in except for routing and switching maybe and that’s all thanks to government contracts. Yes they’re so great in M&A that they fuck up every single piece of software they touch (watch them sink Splunk too).\n\n“Consistent winner” sounds a lot like a hopeless bag-holder. Good luck tho",
              "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7avjoy/",
              "created": 1717633430,
              "depth": 2,
              "replies": [
                {
                  "id": "l7c7gao",
                  "score": 1,
                  "body": "Cisco has a strong hold on government and banking where Cisco is the defined standard.  But they seem to be loosing market share everywhere else.  Cisco and Intel have both managed to make themselves huge, but not in demand at the same time.",
                  "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7c7gao/",
                  "created": 1717657233,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7d4wgi",
                      "score": 3,
                      "body": "I've had local governments request juniper and Palo Alto",
                      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7d4wgi/",
                      "created": 1717677926,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l7b3lhx",
      "score": 17,
      "body": "Juniper is trash. Just ask anyone that works in IT that has to support their hardware. But leadership has been buying it over Cisco because they offered them better pricing and the sales people telling them about how their AI can save them money.",
      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7b3lhx/",
      "created": 1717636755,
      "depth": 0,
      "replies": [
        {
          "id": "l7b5ebx",
          "score": 5,
          "body": "Thanks for the insight.",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7b5ebx/",
          "created": 1717637511,
          "depth": 1,
          "replies": [
            {
              "id": "l7cz0s5",
              "score": 1,
              "body": "Junipers real major issue is support. A lot of the big players major issue seems to be support as of late, that will hurt them long term. When you release a complex enterprise level product and make solving issues that arise difficult for your customers… ",
              "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7cz0s5/",
              "created": 1717675238,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l7d4jic",
          "score": 3,
          "body": "Add someone who works with both, I disagree on juniper being trash",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7d4jic/",
          "created": 1717677771,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7bwf27",
          "score": 6,
          "body": "Their switches are amazing…. We probably run 5k+ of them in our network : ) defo not trash",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7bwf27/",
          "created": 1717650247,
          "depth": 1,
          "replies": [
            {
              "id": "l7d4my9",
              "score": 2,
              "body": "Yeah he's crazy",
              "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7d4my9/",
              "created": 1717677813,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l7bdqm9",
      "score": 3,
      "body": "Cisco will not have explosive growth, but at this price point it's a pretty good entry for some decent future growth",
      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7bdqm9/",
      "created": 1717641044,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7eqytp",
      "score": 3,
      "body": "I've been a long-term holder, first bought in the early 2000s so I've done very well with them.  I've been fortunate to get a bit of growth out of it as well as enjoy the dividends for many years.\n\nDidn't realize they were pretty much at their 52-week low. I've some dividend cash sitting in my brokerage account, I'll be throwing that into CSCO here in a couple minutes, so thanks for the post!\n\nCSCO reminds me of another tech stock I own, IBM, they're both pretty boring, but having some of that isn't so bad.",
      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7eqytp/",
      "created": 1717698017,
      "depth": 0,
      "replies": [
        {
          "id": "l7etp4v",
          "score": 1,
          "body": "That's awesome and good for you. I like IBM but think CSCO has a better margin profile. Also, competitively, Cisco has a niche focus (network infrastructure). While IBM is more broad, making it difficult to value IT consulting against comparables.",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7etp4v/",
          "created": 1717698916,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7at11g",
      "score": 2,
      "body": "nice",
      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7at11g/",
      "created": 1717632402,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7c27r3",
      "score": 2,
      "body": "Pretty safe pick right now",
      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7c27r3/",
      "created": 1717653760,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7da2v1",
      "score": 2,
      "body": "I’m buying more",
      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7da2v1/",
      "created": 1717680051,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7dpuxy",
      "score": 2,
      "body": "If you used Cisco Jabber you wouldn’t be surprised.",
      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7dpuxy/",
      "created": 1717685779,
      "depth": 0,
      "replies": [
        {
          "id": "l7e5isi",
          "score": 2,
          "body": "lol good point",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7e5isi/",
          "created": 1717690979,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7ewj9r",
      "score": 2,
      "body": "I've been buying. The company is diversified enough. I'm not swinging for the fences.\n\nUbiquiti is more in line with NetGear.\n\nCisco is still the brand line technicians know and use for larger enterprises.\n\nThe focus for Cybersecurity has largely been focused on AI/Software and semis but not the underlying security hardware (firewalls/gateways, switches, routing, and APs). These are still crucial for business protection. And a lot of businesses are due for a refresh.\n\nPeople want to call this a boomer stock. Whatever. But we've seen stocks like $IBM make a come back this year.",
      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7ewj9r/",
      "created": 1717699844,
      "depth": 0,
      "replies": [
        {
          "id": "l7fcl1u",
          "score": 1,
          "body": "Good points and I agree with the critical nature of the business. Thanks for sharing.",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7fcl1u/",
          "created": 1717705088,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7bm5cp",
      "score": 3,
      "body": "The Ubiquiti security cameras and recording, while a small part of their overall business, are embarrassingly bad in the security industry.",
      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7bm5cp/",
      "created": 1717644873,
      "depth": 0,
      "replies": [
        {
          "id": "l7dnnkb",
          "score": 1,
          "body": "Yeah I'm aware. Unfortunate because it has potential",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7dnnkb/",
          "created": 1717685029,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7d47e5",
      "score": 1,
      "body": "A Cisco switch costs 20x more than a ubiquiti switch for a reason",
      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7d47e5/",
      "created": 1717677626,
      "depth": 0,
      "replies": [
        {
          "id": "l7dfrv0",
          "score": 1,
          "body": "makes sense why CSCO is worth 20x UI's market cap",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7dfrv0/",
          "created": 1717682233,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7b8kz5",
      "score": -2,
      "body": "Ubiquiti is third world garbage networking equipment. Something tells me you’re not in the space\n\nComparing HPE/Juniper to Cisco/ubiquiti is when you lost all credibility though",
      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7b8kz5/",
      "created": 1717638837,
      "depth": 0,
      "replies": [
        {
          "id": "l7b9i6a",
          "score": 6,
          "body": "LoL I'm not a network engineer but I do know they are not perfect comparables. However they are all categorized as network infrastructure stocks. What are better comparables for you?\n\nAlso both , Cisco and Ubiquiti, offer security cameras (Cisco's Meraki is a big business).",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7b9i6a/",
          "created": 1717639226,
          "depth": 1,
          "replies": [
            {
              "id": "l7ba0z3",
              "score": 6,
              "body": "Ubiquiti is bottom tier enterprise and high end consumer. The best comparable/similar company in my opinion is TP Link (not publicly traded)\n\nSecurity cameras is not a big part of Cisco’s business lol",
              "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7ba0z3/",
              "created": 1717639447,
              "depth": 2,
              "replies": [
                {
                  "id": "l7bnmcz",
                  "score": 7,
                  "body": "From a company perspective I would say there is no real comparison for Ubiquity. Centrally locally managed network infrastructure components (wan, lan, security, access control, telephony) without a subscription at a reasonable price. That is why they are doing well. For the larger homes or small businesses I would go with Ubiquiti.",
                  "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7bnmcz/",
                  "created": 1717645589,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7bo06s",
                      "score": -1,
                      "body": "TP Link omada pro is cloud hosted and has SND components. Very similar",
                      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7bo06s/",
                      "created": 1717645779,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l7bx91y",
                          "score": 2,
                          "body": "[deleted]",
                          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7bx91y/",
                          "created": 1717650733,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l7e883z",
                              "score": 1,
                              "body": "FYI tp link also has a local self hosted controller option",
                              "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7e883z/",
                              "created": 1717691880,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "l7byvl1",
                              "score": 0,
                              "body": "SaaS. You get what you pay for",
                              "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7byvl1/",
                              "created": 1717651701,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l7bwlpp",
          "score": 1,
          "body": "Agreed. MSPs, sure, smb, fine, for a company who’s best router meant for massive companies cant even take a goddamn ip block is embarrassing. Unless they added it recently. In the world of enterprise networking, they are the bottom of the barrel",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7bwlpp/",
          "created": 1717650353,
          "depth": 1,
          "replies": [
            {
              "id": "l7byub5",
              "score": 1,
              "body": "Probably by far too. I actually like some of the low end vendors too like cambium and TP Link. Feel like their good bang for your buck and could run an ent network on, while Ubiquit is just like high end consumer that couldn’t quite find the crossroads to be a viable b2b vendor",
              "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7byub5/",
              "created": 1717651679,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l7c7q6y",
      "score": 0,
      "body": "I was told Cisco was going to explode",
      "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7c7q6y/",
      "created": 1717657419,
      "depth": 0,
      "replies": [
        {
          "id": "l7jszr9",
          "score": 1,
          "body": "By who?",
          "permalink": "/r/stocks/comments/1d93efl/cisco_trading_at_its_52week_low/l7jszr9/",
          "created": 1717777831,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}