{
  "title": "I posted about the market bottoming 15 minutes before the open last Friday. We've rallied 4 days straight since. ",
  "score": 44,
  "selftext": "I posted a detailed DD comment right under the screenshot to explain what I was seeing in the VIX ( fear index ) that led me to believe the market was bottoming. I'll be happy to explain it again if anyone is interested.\n\nJust to be clear, calling the exact bottom to the exact day is nearly impossible. So the fact that Friday was the bottom, there was luck involved there. Usually these signals are accurate to within a few days. Not an exact date.\n\nI used a similar signal to call the April 19th bottom as well. And I was lucky enough to get that one exactly to the day as well.\n\nhttps://preview.redd.it/dmnvjuupru4d1.jpg?width=1046&format=pjpg&auto=webp&s=2e4c21cda6e84e45c21a17d83ae4d559ae4e76b1\n\nRight now the VIX indicates that we still have more upside to go over the upcoming weeks. As the market has already made new highs, yet the VIX has yet to retrace back to its recent lows. As that volatility gets priced out ( the vix drops ) the market tends to float higher.\n\nBut it's likely to get very choppy in the next couple of days. As we have unemployment date coming out Friday. And we've already exceeded the weekly expected move, which was around $433.5 for the $SPY.  \nSo probably a slow day Thursday and a volatile day Friday.",
  "link_flair_text": "Chart",
  "id": "1d96bhr",
  "num_comments": 39,
  "created_utc": 1717636700,
  "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/",
  "comments": [
    {
      "id": "l7b3h2k",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 270 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/qsk34m/woof_woof_this_dog_is_about_bark_up_a_tree_a_big/) [x](https://www.reddit.com/r/wallstreetbets/comments/u446bu/long_amd_my_next_potential_10x_amd_trade/) \n**Account Age** | 8 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7b3h2k/",
      "created": 1717636705,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7b91r6",
      "score": 26,
      "body": "Market will tank last week of this month. Source? Trust me bro. Screen cap this,",
      "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7b91r6/",
      "created": 1717639034,
      "depth": 0,
      "replies": [
        {
          "id": "l7bj5p6",
          "score": 7,
          "body": "Will you sign my jacked tits afterwards?",
          "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7bj5p6/",
          "created": 1717643457,
          "depth": 1,
          "replies": [
            {
              "id": "l7cs27c",
              "score": 3,
              "body": "No, I only sign tits.\n\n\nI somehow read jacked tits as jacket.  My comment doesn't really make sense I guess ",
              "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7cs27c/",
              "created": 1717671615,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l7bbiqv",
      "score": 7,
      "body": "Yes you did, but I had already bought SPY 50 530 calls ex this Fri whe SPY hit 519",
      "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7bbiqv/",
      "created": 1717640090,
      "depth": 0,
      "replies": [
        {
          "id": "l7bbqle",
          "score": 12,
          "body": "That's a 5X trade and worth a good chunk of change now, congrats.",
          "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7bbqle/",
          "created": 1717640183,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7b4k2p",
      "score": 8,
      "body": "I liked your analysis, although that could always be my confirmation bias.\n\nMy reasoning is that as rate cuts become palpable, the money sitting in money market will sweep into stocks like a tide. Difficult to say how much software will benefit, the sector having underperformed YTD, but semis will probably get pushed higher. $AMD might get some love after all.\n\nI am ~100% equities but 0% margins. Blah blah blah, could've/should've/would've, blah blah blah.",
      "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7b4k2p/",
      "created": 1717637160,
      "depth": 0,
      "replies": [
        {
          "id": "l7b4vyw",
          "score": 8,
          "body": "AMD is on my radar. Probably throwing some single dollar bills its way next month. \n\nI think it has one more dip to go before it bottoms. It's been underperforming the rest of semis since the April 19th bottom.\n\nSome interesting findings if you chart $AMD/$SMH on trading view. That ratio chart looks TASTY. But gotta be patient for probably another month or so.",
          "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7b4vyw/",
          "created": 1717637300,
          "depth": 1,
          "replies": [
            {
              "id": "l7b5m2w",
              "score": 1,
              "body": "> I think it has one more dip to go before it bottoms.\n\nAnd that is why I am fighting myself over whether I should exit my $AMD position at a nominal gain and hop onto the $NVDU train short term.\n\nDecisions, decisions.",
              "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7b5m2w/",
              "created": 1717637600,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l7f0qq1",
          "score": 1,
          "body": "Why would money sitting in money market be a boon of equitites? Money market funds pool money by issuing shares and use those to buy liquid assests like cash (bank acceptances and CDs), commercial paper, and short term trrasuries. This means people who invest there have cash, want it to be liquid and relatively risk free, AND see no better oppurtunities in the market....but stocks are up almost 30% y/y and nearly 20% over the last 6 months...\n\nDespite this boom in equities, money market assests have skyrocketed. This is a BAD sign. Because money markets dont offer returns like equities, there should be LESS assets in moneymarket fund balance sheets as investors would see greater potential in the stock market for returns. But that isnt happening. Instead, what we have are increases in money market participation while equities are treading ATHs. \n\nThis tells me investors are keeping their assets liquid in order to wait the coming inevitable repricing of equities. Like a veteran that waits for memorial day to do all their gift shopping, investors are waiting for a fire sale...Only difference is the stock market memorial day sale isnt regularly scheduled.\n\nThoughts?",
          "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7f0qq1/",
          "created": 1717701236,
          "depth": 1,
          "replies": [
            {
              "id": "l7f1e3r",
              "score": 1,
              "body": "Money market becomes less attractive as interest rates come down.\n\n> This tells me investors are keeping their assets liquid in order to wait the coming inevitable repricing of equities\n\nFOMO is helluva drug. You are betting the market on being rational, and I am betting on human nature.\n\nBut don't listen to me. After all, the market can stay irrational longer than you can stay solvent.",
              "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7f1e3r/",
              "created": 1717701448,
              "depth": 2,
              "replies": [
                {
                  "id": "l7f2mlk",
                  "score": 1,
                  "body": "Youre confusing cuases, with all due respect. Interest rates (short terms) come down as a result of FED policy. The FEDs concerns are inflation (price stability) and employment. This means the FED policy is to respond with lower rates as a result of WEAKENING macroeconomic conditions. \n\nWhat I want to know is why you think that lower interest rates, which are a fed response to a problem that already exists (slowing economy) due to their data being backward looking, will result in higher prices for equities when equity price is tied to positive economic outlook for the future?",
                  "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7f2mlk/",
                  "created": 1717701848,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7fjh6u",
                      "score": 1,
                      "body": "Weakening but far from dire straits. Have you been paying attention to the earnings?\n\nHistorically, if you tally **all** rate cut cycles, the average return is about 11%. If you take out the ones that did precede a recession, then it averages to 17% if I recall.",
                      "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7fjh6u/",
                      "created": 1717707378,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l7gf5o0",
                          "score": 1,
                          "body": "Which companies specifically are beating earnings? Technology companies in the AI space mainly. Aside from them? Not so much. As a matter of fact, many discount discretionary retailers are guiding lower despite good earnings. This is because having good earnings one quarter doesnt mean the consumer will be ready to buy products in the next quarter, and lo and behold, discretionary companies like walmart and costco, are guiding lower due to weaker consumer demand. Also, discount retailers like walmart and costco are beating earnings as shoppers look for more affordable prices for things like groceries. This is a recession indicator because it tells us that people who would have otherwise gone to Whole Foods or out to eat are substituting for cheaper options.\n\n Many companies are beating earnings, yet are treading water or dropping. Why is this? Because earnings tell you about the past quarter, not the quarters to come which is what investors want to see.  If you beat earnings, yet guide lower for the year on the earnings call, on paper youre doing well but in reality the CEO is saying \" Hey, we made more net earnings but they will decrease moving forward as economic conditions are softening\". \n\nLook no further than fast food, which is typically bought by lower income earners, completely dropping the ball on earnings. See Mcdonalds, Wendys, BurgerKing, Starbucks, etc. One year ago peole were buying regularly from these stores (not so much burger king they were doing bad regardless) and now suddenly theyre missing earnings. This suggests to me that lower income earners are switching eating out at these places for groceries at walmart and discount stores. Higher earners are cutting back too as we can see with the ludicrously priced starbucks coffees falling out of vogue and the companys subsequent miss on their earnings. \n\nCouple this info with central banks around the world cutting interest rates due to lower aggregate demand GLOBALLY, and you can see why my stance is money in money market funds are not going into stocks when interest rates are lower. Because thats an indicator for macroeconomic problems which make stocks UNattractive.",
                          "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7gf5o0/",
                          "created": 1717719334,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l7heh8f",
                              "score": 1,
                              "body": "And you continue to turn a blind eye to alternative scenarios (which have historical basis), therefore wasting your life compiling walls of text saying nothing I don't already know.\n\ntldr: You believe that high interest rates have overkilled the economy, and the market should reflect that vs. I believe that high interest rates have done its job (52w L in big names across sectors), flawed as it is, and it is time to get things rolling again.\n\nAs closing remark, educate yourself on \"confirmation bias.\" I fully understand that my scenario will not necessary come into fruition, and I don't waste my life proselytizing strangers on the internet. Blind conviction belongs to prophets and fools.",
                              "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7heh8f/",
                              "created": 1717734853,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l7heh95",
                                  "score": 1,
                                  "body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                                  "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7heh95/",
                                  "created": 1717734853,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l7hendm",
                                      "score": 1,
                                      "body": "lolwut?",
                                      "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7hendm/",
                                      "created": 1717734945,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "l7hjbiu",
                                  "score": 1,
                                  "body": "I got something for you. Check WSB in the morning. Youll be mentioned in a discussion post where you can defend yourself publicly with your own facts.",
                                  "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7hjbiu/",
                                  "created": 1717737569,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l7hl2rf",
                                      "score": 1,
                                      "body": "If only you could grasp how little I care about your opinions.\n\nBut at least impotent rage is always amusing.",
                                      "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7hl2rf/",
                                      "created": 1717738614,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l7bloip",
      "score": 2,
      "body": "Interesting read. Thanks!",
      "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7bloip/",
      "created": 1717644647,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7cdx5g",
      "score": 2,
      "body": "Heya CaspeanSea. I misread the market in the early moments of yesterday and ended up with ITM 529 puts for July 05. Would you advise to hold on to them? Thanks in advance for your thoughts ",
      "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7cdx5g/",
      "created": 1717661904,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7cudxw",
      "score": 2,
      "body": "The majority of the crash will happen after the pivot. This talk of lowering rates without a drop of unemployment? No chance. This is not the bottom",
      "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7cudxw/",
      "created": 1717672903,
      "depth": 0,
      "replies": [
        {
          "id": "l7cxqie",
          "score": 6,
          "body": "Narrator’s voice: “it was in fact, the bottom.”  ![img](emote|t5_2th52|27189)",
          "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7cxqie/",
          "created": 1717674618,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7cudyb",
          "score": 1,
          "body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7cudyb/",
          "created": 1717672903,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7e3tex",
      "score": 2,
      "body": "Vix is a calculation. It’s not based on supply and demand. So doing TA on the vix is a good way to out yourself as a regard.",
      "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7e3tex/",
      "created": 1717690419,
      "depth": 0,
      "replies": [
        {
          "id": "l7f2sbh",
          "score": 1,
          "body": "The VIX corresponds directly with demand for puts. The more expensive S&P 500 put premiums get, the higher the VIX gets. Put premiums shoot up when investors are fearful. Which is why it's often dubbed the fear index. You'll be surprised how useful it is to chart market fear.\n\nCNN's fear & greed index is another good one to look at, specifically the put-to-call ratio component. You can pull up a historical chart and look for patterns corresponding with significant market turns ( major bottoms, moments before major crashes etc ). There are a handful of useful signals that you can extrapolate from it.\n\nIn any case, I've charted the VIX for a while and I look for specific things in the VIX that have worked well for me. To each their own. That is all.  \nGood luck",
          "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7f2sbh/",
          "created": 1717701899,
          "depth": 1,
          "replies": [
            {
              "id": "l7f7zu5",
              "score": 3,
              "body": "The VIX represents an urgent demand for puts, specifically, which is the part that's hard to predict. I already use a smoothed p/c ratio to get the general vibe, but range expansion is hard to front-run, just imo.",
              "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7f7zu5/",
              "created": 1717703588,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l7bek6n",
      "score": -9,
      "body": "It rallied today cause of the Canadian rate cut, not cause of your voodoo bullshit.",
      "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7bek6n/",
      "created": 1717641400,
      "depth": 0,
      "replies": [
        {
          "id": "l7bhssq",
          "score": 9,
          "body": "This post has nothing to do with today's rally. It's in reference to the bottom that formed last Friday. The original post was published 15 minutes before the market open last Friday saying that the market was bottoming. And it did in fact end up bottoming Friday.\n\nThe VIX isn't \"voodoo bullshit\" it reflects the psychology of the market, particularly the level of fear or lack-therof by measuring the demand for puts. In a way that's statistically repeatable and sometimes useful for trading. \n\nI also called out April 19th as a likely bottom using the VIX & a couple other tools. Two months ago. It did in fact end up being the bottom at the time.  That's two days out of over 100 trading days year-to-date and it helped me call the exact day the market bottomed, twice.",
          "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7bhssq/",
          "created": 1717642840,
          "depth": 1,
          "replies": [
            {
              "id": "l7e2e1m",
              "score": 2,
              "body": "Dude ur Coinbase DD netted me some nice💸💸💸 in my ira. Wish i would have done the same in my f***ing around account cause spy killed me last friday.",
              "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7e2e1m/",
              "created": 1717689945,
              "depth": 2,
              "replies": [
                {
                  "id": "l7gushc",
                  "score": 3,
                  "body": "Congrats & well earned brother. I'm watching a bunch of other nice setups right now, waiting to pounce.",
                  "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7gushc/",
                  "created": 1717725727,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7h15k9",
                      "score": 3,
                      "body": "Please dont hesitate to post them if you dont mind. I started to follow you back when you posted spy was going to 513. My DD had it going to 517 and then dropping, but i guess i was wrong. Keep them coming bro I dont care what others say you definitely know your stuff.",
                      "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7h15k9/",
                      "created": 1717728370,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l7ki123",
                      "score": 2,
                      "body": "Please keep posting!!",
                      "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7ki123/",
                      "created": 1717786222,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l7bzb94",
              "score": -3,
              "body": "Huh? I never said the VIX was bullshit. You reading prophesies out of the VIX is bullshit. Disappointing that WSB has gotten so dumb they upvote TA garbage, let alone TA on a fucking index.",
              "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7bzb94/",
              "created": 1717651966,
              "depth": 2,
              "replies": [
                {
                  "id": "l7cqxmp",
                  "score": 1,
                  "body": "Just set a reminder. right now you’re arguing with results using an argument that boils down to “I don’t understand what you said so I’m going to insult it.”",
                  "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7cqxmp/",
                  "created": 1717670960,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l7chmw9",
          "score": 3,
          "body": "Imagine not being able to read English. Also, imagine thinking that the markets give a shit about Canada lmao",
          "permalink": "/r/wallstreetbets/comments/1d96bhr/i_posted_about_the_market_bottoming_15_minutes/l7chmw9/",
          "created": 1717664656,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}