{
  "title": "AAPL and WWDC on Monday: Expectations for AI and Stock Price to Hit $200+?",
  "score": 35,
  "selftext": "Hey /stocks community,\n\nAs we all know, Apple's Worldwide Developers Conference (WWDC) is coming up this Monday, and I’m curious to hear your thoughts on what we can expect, especially regarding AI innovations and how this might impact AAPL's stock price.\n\n**A few points to consider:**\n\n**1. AI Announcements:** There’s a lot of buzz about Apple potentially unveiling significant AI advancements. How do you think this could influence AAPL’s stock? Are we expecting major updates to Siri, machine learning capabilities, or new AI-driven features?\n\n**2. Developer Tools:** Apple is known for empowering developers with new tools and APIs during WWDC. How important do you think these updates are for the stock price in the short term?\n\n**3. Financial Impact:** Given Apple’s strong financial position, do you think the market will respond positively to these announcements, pushing the stock higher? Could we realistically see AAPL hitting $200 or more in the near future?\n\nI’d love to hear your predictions and analysis. What are you expecting from WWDC? Do you think Apple’s focus on AI will be a game-changer for its stock price? Let’s discuss!\n\n  \n\\*\\*ChatGPT wrote this for me since Reddit says I make low quality posts.   \nTDLR: WWDC on Monday, will AAPL finally go above 200?",
  "link_flair_text": "Company Discussion",
  "id": "1d9wdst",
  "num_comments": 55,
  "created_utc": 1717716442,
  "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/",
  "comments": [
    {
      "id": "l7gjzes",
      "score": 35,
      "body": "I feel like it usually drops on WWDC, especially because I dont think their vision pro/ipad software updates will be anywhere close to what people want",
      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7gjzes/",
      "created": 1717721311,
      "depth": 0,
      "replies": [
        {
          "id": "l7r9ivw",
          "score": 1,
          "body": "It usually drops right after",
          "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7r9ivw/",
          "created": 1717897347,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l89nb2c",
          "score": 2,
          "body": "This comment aged like milk left on the counter.",
          "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l89nb2c/",
          "created": 1718199303,
          "depth": 1,
          "replies": [
            {
              "id": "l89u9w2",
              "score": 1,
              "body": "I mean it did drop on WWDC day. I’m long Apple with a 400% gain, I’m happy when it does well",
              "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l89u9w2/",
              "created": 1718201891,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l7gvagd",
      "score": 11,
      "body": "Stock tends to go down after product keynotes/WWDC why would anyone think this time is different, whatever they announce tomorrow will start to roll out until October",
      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7gvagd/",
      "created": 1717725938,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7gcml3",
      "score": 13,
      "body": "I put 90% of my net worth (95k) into AAPL July 190 calls in early April and now they are worth around 285k. I'm quite nervous and frankly I have no clue what's going to happen.\n\nThe two major headwinds for Apple have been 1) China sales - which have been rebounding with price cuts and 2) Weak AI offering - which will be addressed Monday. I used to be very optimistic WWDC, but there have been a lot of leaks and I'm not sure what is priced in or how they can still surprise investors. However, AI hype hasn't slowed down (see: Nvidia) so maybe Tim announcing the AI stuff will be enough to send it higher. There is a lot of potential viral stuff that could get headlines, like the OpenAI partnership or even AI emojis, but looking at the current leaks on MacRumors, I'm not freaking out about many of them. \n\nThere isn't usually an immediate post-WWDC bump for the stock, although there is a lot more expectation this year than usual. The stock has been on a tear lately and this could continue to run as hype builds for the iPhone 16 announcement in September. I remember being so disappointed last September when their whole shtick for the 15 was 'ooh it's titanium' - like who gives a hoot about that. I think many are quick to write them off, but the 16 will surprise. Alas, I have July calls so that's out of my time frame LOL.\n\nDisclaimer: I'm stupid enough to go all in on OTM calls (at the time) so don't trust me on anything",
      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7gcml3/",
      "created": 1717718363,
      "depth": 0,
      "replies": [
        {
          "id": "l7gk0oi",
          "score": 34,
          "body": "why dont you sell them now...",
          "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7gk0oi/",
          "created": 1717721325,
          "depth": 1,
          "replies": [
            {
              "id": "l7gojhk",
              "score": 7,
              "body": "I can't sell until 60 days after the purchase date due to my job :-(",
              "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7gojhk/",
              "created": 1717723160,
              "depth": 2,
              "replies": [
                {
                  "id": "l7gpxst",
                  "score": 49,
                  "body": "You out 90% of net worth into monthly calls? WTF",
                  "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7gpxst/",
                  "created": 1717723720,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7gr7t3",
                      "score": 17,
                      "body": "I was experiencing amphetamine withdrawals and was looking for dopamine - I've never used options before!",
                      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7gr7t3/",
                      "created": 1717724245,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l7gwbnv",
                          "score": 55,
                          "body": "You, my friend.. Are in the wrong subreddit. God help you 🙏🏻",
                          "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7gwbnv/",
                          "created": 1717726351,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l7ilasn",
                          "score": 2,
                          "body": "I can help you find a solution to reduce exposure. One of my friends is also restricted because of his job",
                          "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7ilasn/",
                          "created": 1717761779,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l7j4iqk",
                              "score": 1,
                              "body": "Thankfully I'll be able to sell on Monday before WWDC, although I definitely have an itch to hold and see what happens ! But yeah I'll probably sell lol",
                              "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7j4iqk/",
                              "created": 1717769501,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "l7kp352",
                          "score": 2,
                          "body": "R/wallstreetbets is right this way sir",
                          "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7kp352/",
                          "created": 1717788641,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l7hlu0p",
                  "score": 7,
                  "body": "You need to reevaluate your life choices. Gunna get wrecked.",
                  "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7hlu0p/",
                  "created": 1717739065,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l7kp5io",
                  "score": 3,
                  "body": "I mean for $200k maybe just quit your job and sell them anyway",
                  "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7kp5io/",
                  "created": 1717788664,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7kr3he",
                      "score": 1,
                      "body": "I can sell on Monday! I still have the urge to hold though!! Lol I need to stay disciplined",
                      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7kr3he/",
                      "created": 1717789333,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l7krs5t",
                          "score": 2,
                          "body": "I’d recommend you sell at least a solid portion! Keep in mind that time decay will hurt a ton. You’ve already made an incredibly lucky, life changing profit on a crazy risky play. Maybe cash out the majority and keep a chunk just to see how high it goes",
                          "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7krs5t/",
                          "created": 1717789570,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l7kxcsz",
          "score": 4,
          "body": "Hopefully you are right this time, but either way, don't do that again, because if you continue to take such huge risks, you are virtually guaranteed to go bankrupt. This is a link the [\"gambler's ruin paradox,\"](https://en.wikipedia.org/wiki/Gambler%27s_ruin) which is unrelated to the Gambler's fallacy, but it is the most important thing to know about stocks, and especially options. Read it, learn it, love it. If you don't understand it, don't trade options. \n\nLet's say you are great at predicting the future, and every time a coin flips you have a 55% percent chance of calling it right (this is a huge edge). What is your optimal betting strategy for repeated coin flips? You might think that the best strategy is to maximize your winnings per flip, and invest 100% of your assets per flip. That strategy, borne out my math and simulations, will quickly bankrupt you. In fact, it's the worse strategy for long-term income growth. Even if you have a huge edge over the house, the best strategy for this all-or-nothing game is to only bet 10% of your assets per flip. With options, you are playing a similar game. You will actually grow income much faster, on average, if you only bet a small portion of your savings. Over the long term, you should only bet between 2-10% of your total assets on all-or-nothing bets. If you have an edge and can see the future, this will optimize the growth of your wealth. If you don't, this will slow the inevitable decline of your savings towards zero. So, good luck. But don't do that again, ever. Read the wikipedia page and understand how to calculate the payout ratio of your options, and estimate that any edge that you have over much more sophisticated investors is very small. \n\nI am long on AAPL and AAPU though, I jumped in AAPL pre-earnings, expecting a buyback. I bought AAPU 2x a couple of days ago, but I did that with fresh cash that is a small portion of my balance, and AAPU is a lot less risky than margins though you should never hold leveraged assets for anything but very short periods or guaranteed volatility is guaranteed to eat you alive, so I'll be selling AAPU whether it is up or down 20% during WWDC or in couple days after if they really hit it out of the park. A month ago [I was thinking about selling NVDA post earnings to move into apple pre-earnings](https://old.reddit.com/r/stocks/comments/1cmcwmk/apple_announces_new_ipad_air_tablets/l31xvbi/?context=3_) but I'm not doing that, because Apple has predictably rallied in that period while NVDA rallied even more. But I do think there is at least a 55% chance of a good outcome for Apple stock this WWDC. With this bet, I am planning on making it again until apple gets aggressive about integrating and monetizing AI, which they can and will do, eventually, as they control the high small edge device computing. I only don't know the timeline for certain. Tim Cook is an amazing CEO, shepherding Apple through huge gains post Jobs, but he is very conservative. Here are my expectation's for Monday's event which I will be watching with popcorn:\n\n* a bunch of gimmicky AI emojis\n\n* AI photo editing that lags google's Pixel by a few years\n(I expect the stock to start tanking during a series of early fluff announcements that they always love to overhype)\n\n* random new hardware upgrades\n\n* A long delayed Apple server chip produced by TSMC for very fast and energy efficient inference. This will drive Apple's entrance into the cloud. I think this announcement would create a bunch of buzz. \n\n* One last thing: Siri will no longer be dumber than a box of rocks. This will get media play.\n\nAs a consumer, I really don't want them to make me pay for capable on-device AI, as an investor, I can't fault them pulling in huge margins on another subscription service. Their researchers were the first to demonstrate multi-modal AI in a paper, where the AI can read the screen of your device with screenshots, and manipulate the device with voice commands. This was before OpenAI and then google jumped in with similar initiatives and widely-viewed video demos. I would love this, but it creates all kinds of potential issues, so I'm not betting on full voice control of IOS and macs right now. I think they will give developers hooks so developers can use voice control within their app, which is an improvement, but not as cool as telling your phone what to do and having it do it, like the Rabbit R1 was supposed to do but didn't do. Hopefully that will come someday, but the Apple ecosystem is very conservative and very locked down.",
          "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7kxcsz/",
          "created": 1717791499,
          "depth": 1,
          "replies": [
            {
              "id": "l7mxwez",
              "score": 1,
              "body": "What an incredibly thoughtful reply - thank you for taking the time to write it! Yes, my position makes no sense, and not one that can be understood through any logic. I don't believe I am a stock guru and my decision making process was clouded by the amphetamine withdrawal I was going through when I made the play, combined with my predisposition to gamble dangerous amounts of money. In fact, a few years ago I went from 12k -> 40k with sports gambling and only kept the money because I got hooked to reddit instead!\n\nI had a similar (although much more rudimentary) thought as your point about gambler's ruin yesterday. If one is constantly going 'all-in', there is no room for failure. \n\nI'm interested to see how the announcements could impact service revenue too. Does it impact the Google search deal? I would love to know more about the OpenAI contract terms, maybe that will be leaked eventually. \n\nThe AI emoji stuff has a lot of potential to go viral, and same with Siri. Ha ha, I can already imagine the salty tech fans who will post a stupid emoji and say 'We waited months for Apple just to release THIS!?' - and maybe they will have a point. \n\nGood luck with AAPU! I am having so much trouble seeing where we are for AI hype and Apple - on one hand, the stock has really run up the past month and a half and it might be impossible to meet investor expectations, but on the other hand there has been little hype for on device AI stuff which could keep the money flowing into AAPL. It would be disappointing for AAPL to miss hitting an ATH while it's so close...we'll see!",
              "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7mxwez/",
              "created": 1717823314,
              "depth": 2,
              "replies": [
                {
                  "id": "l7n4l22",
                  "score": 2,
                  "body": "Good luck on managing withdrawals, and you might want to consider finding a group if you keep having urges to gamble. If Apple has a subscription, they may charge a margin from anywhere to 20-50% higher than what they pay open AI. I am hoping they will have announce development of their own inference cloud on their own chips. I think that will happen eventually, but I don't know about tomorrow. On the other hand, apple may lock AI out of every phone but the latest generation, even though the others are capable and it's not hard to quantize a neural network to make it smaller. We'll see!",
                  "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7n4l22/",
                  "created": 1717827563,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8dkvh9",
              "score": 1,
              "body": "Hope you made some nice gains with AAPL and AAPU!",
              "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l8dkvh9/",
              "created": 1718250823,
              "depth": 2,
              "replies": [
                {
                  "id": "l8hmko6",
                  "score": 2,
                  "body": "Yep, limited out on AAPU yesterday! Count your lucky stars if things hold and try to stay away from options, try to resist the urge to gamble, and never ever make such a risky bet again. But I'm happy for you! There's a lot to be said for just being long and buying index and sector funds and a few other picks and it will pay off over the long arc of time.",
                  "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l8hmko6/",
                  "created": 1718314557,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l7imlcr",
          "score": 3,
          "body": "Oh man, just read you can't sell for 60 days, IV crush is going to melt those calls next week. I'm selling mine today, buy the rumour and sell the news.",
          "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7imlcr/",
          "created": 1717762387,
          "depth": 1,
          "replies": [
            {
              "id": "l7j3yh1",
              "score": 5,
              "body": "I'll be able to sell Monday before WWDC, thankfully. Hope you made bank!",
              "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7j3yh1/",
              "created": 1717769296,
              "depth": 2,
              "replies": [
                {
                  "id": "l7js1nk",
                  "score": 4,
                  "body": "+ 137%, can't argue with that! Happy to miss out than take the risk, good luck for Monday!",
                  "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7js1nk/",
                  "created": 1717777515,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l7h3hbl",
          "score": 2,
          "body": "I have a decent position in Jan 25 $205 calls doing well bought last month.\nThesis was that Apple is sort of a love/hate cycle and was in a hate cycle. Felt their advancements in inboard neural chip and benefits of on-device AI is not even being talked about. That AI momentum will eventually point to Apple. Plan was to “sell the news day of event.\n\nI expect a pullback but then gradual increase to continue. They truly do have a lead with their M chips, locked down 2nm supply, integration, etc. may bump up to 200 for a bit but I am guessing break through in July.\n\nNow, if they actually surprise me with something at WWDC, I may just hold.\n\nJuat my thoughts. Good luck. I think you will do great.",
          "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7h3hbl/",
          "created": 1717729385,
          "depth": 1,
          "replies": [
            {
              "id": "l7h7uh0",
              "score": 2,
              "body": "Ha ha the love/hate cycle is so true. Thus far Apple has mentioned AI substantially less than other tech giants despite being able to leverage it most effectively for consumers. On-device AI continues to be ignored but hopefully once they showcase some use cases at WWDC the hype will build, both for investors and consumers. \n\nAnd Apple [acquired 32 AI companies in 2023, more than all other tech giants](https://www.cdomagazine.tech/aiml/ai-shopping-spree-apple-leads-charge-with-32-startup-acquisitions-in-2023), on one hand that can be used against them ('See, playing catch-up!') but it can also show their ambition given the variety of companies acquired. At the very least they have acquired some wicked smaht engineers focused on AI. \n\nEarlier this year they purchased a Canadian AI company focused on improving manufacturing - an acquisition that users will not notice but may improve their profit margins as manufacturing costs potentially drop. Now that's using AI to impact the bottom line!\n\nThere is potential for Apple to have a 'ChatGPT moment' - would love to see it but yeah I think January calls are smart as by then sales SHOULD prove Apple's approach to AI is the right one.",
              "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7h7uh0/",
              "created": 1717731435,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l7kp17m",
          "score": 2,
          "body": "Dude sell that shit",
          "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7kp17m/",
          "created": 1717788623,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l88yemo",
          "score": 2,
          "body": "Hope you held congrats",
          "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l88yemo/",
          "created": 1718187191,
          "depth": 1,
          "replies": [
            {
              "id": "l8bw0wp",
              "score": 2,
              "body": "THANK YOU!!! I have to hold as my employer, a brokerage, is maintaining a hold on employees trading the stock, and I've basically been watching the stock 24/7. Hopefully tomorrow it lifts. I'm so nervous, it really could go anywhere and I just wanna get out! \n\nSo far this week my position has gone from 340k->240k->630k->830k!!!",
              "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l8bw0wp/",
              "created": 1718226611,
              "depth": 2,
              "replies": [
                {
                  "id": "l8d9rh6",
                  "score": 2,
                  "body": "Post your update on WSB once you cash out. This is epic\n\nWhen can you sell?",
                  "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l8d9rh6/",
                  "created": 1718245941,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8di5hf",
                      "score": 2,
                      "body": "Heck yeah I'll post it and let you know!\n\nI have no clue when I can sell. All I can do is call each day and they tell me if my request to sell is approved or denied and they can't give me the reason why. I was freaking out about it earlier today, but I've been reading AAPL hopium to convince myself it probably won't go down too much.",
                      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l8di5hf/",
                      "created": 1718249527,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8dieqf",
                          "score": 2,
                          "body": "Yea it probably won’t. I sold my AAPL calls this morning at around 725% gains too. I think it’ll hover around 215 and slowly climb until earnings. Still I’d call everyday and sell ASAP haha",
                          "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l8dieqf/",
                          "created": 1718249650,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8dl1zl",
                              "score": 2,
                              "body": "725% gains! Freaking sweet - nice one! Yeah I've gotten the same pre-clearance operators and I think they want the trade to go through so I stop annoying them lol",
                              "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l8dl1zl/",
                              "created": 1718250912,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l7icsjc",
      "score": 3,
      "body": "What is the tangible value that all this AI hype can factor in? I mean in terms of apple value I only ever hear it correlated with Siri improvements… \n\nIn my experience people on mass really don’t care about any voice assistants, let alone one with the bad rep of Siri",
      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7icsjc/",
      "created": 1717757384,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7j6ppl",
      "score": 3,
      "body": "There are reports out there highlighting what Apple intends to show next week at WWDC. Apple made a deal with OpenAI recently to integrate its features into most of iOS. There is also a rumor it may only run on iPhone 15 Pros and above, but that isn't confirmed. IF that is the case, it could drive some to upgrade phones sooner rather than later, but it's hard to know.\n\n\nI don't expect AAPL to cross $200 on Monday unless the features are more impressive than they sound on paper.",
      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7j6ppl/",
      "created": 1717770279,
      "depth": 0,
      "replies": [
        {
          "id": "l89nd5h",
          "score": 1,
          "body": "This comment aged like milk left on the counter.",
          "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l89nd5h/",
          "created": 1718199325,
          "depth": 1,
          "replies": [
            {
              "id": "l89nkaz",
              "score": 1,
              "body": "In my defense, it didn't cross $200 on Monday",
              "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l89nkaz/",
              "created": 1718199402,
              "depth": 2,
              "replies": [
                {
                  "id": "l89o1sp",
                  "score": 1,
                  "body": "True lol, I’m just kidding by the way. No one ever really knows what will happen. I’ve been holding Apple stock for 15 years and many times it shit the bed for no reason after WWDC or a positive earnings report.",
                  "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l89o1sp/",
                  "created": 1718199590,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l89r70n",
                      "score": 1,
                      "body": "Hey I still have a good bit of Apple I bought 13 years ago. I'm surprised at this move to be honest. I hope the new iOS will drive an iPhone super cycle later this year.",
                      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l89r70n/",
                      "created": 1718200770,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l7k5yzs",
      "score": 2,
      "body": "AAPL announcements are generally met with disappointment and hand wringing in the press. But in general what they announce is actually useful to people, people pay for it, profits rise, and the share price rises. I’m expecting the usual here: a small to moderate drop next week, but a decent gain by year’s end.",
      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7k5yzs/",
      "created": 1717782199,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7k9fnt",
      "score": 2,
      "body": "Considering it's gone up 20% in about 1 month (and bottomed after the AI announcement), seems highly likely whatever they announce is mostly priced in. Apple tends to play catch up on new tech, and their AI announcement sound like a reactive move to jump on the bandwagon, so can't imagine they have a lot of features planned out.  \n\nFurthermore, next week is FOMC and since the market just made new all time high and SP500 very near the 5400 level at 21 forward PE, time for some consolidation/pullback this month.",
      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7k9fnt/",
      "created": 1717783338,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7k9u7e",
      "score": 2,
      "body": "This is how I know we're in a bubble.. Redditors calling for $200 PT for no reason other than it's higher than the current price  :D\n\nLol... Monday will be a fun day",
      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7k9u7e/",
      "created": 1717783472,
      "depth": 0,
      "replies": [
        {
          "id": "l89n8us",
          "score": 0,
          "body": "Aged like milk.",
          "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l89n8us/",
          "created": 1718199279,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7m8fw6",
      "score": 2,
      "body": "I want to be able to actually talk to my iphone and have it understand me\n\nVOICE CONVERSATIONAL FUNCTIONING AI\n\nFor example\n\n“Hey AI SIRI- \nI’m going to 12235 zip code tomorrow morning (400 miles away)\n\nFind me the best sushi restaurant that’s open late and has otoro in xyz zip code \n\nThen find me the best place to get gas cheap.  (Phone already knows what car I drive) I have a half tank right now \n\nFind me a couple ABNB suggestions for tomorrow night \n\nI’ll come home the next day “\n\nAI-SIRI\n5 seconds later \n“ok.  Here’s 3 ABNB and I’ve planned your road trip and booked a reservation at xyz restaurant for 8:30pm. Which ABNB do you prefer?”\n\nThe following day on the way there. \n“Hungry.  Find me the best bbq for lunch not too far off the route “\n\n Etc",
      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7m8fw6/",
      "created": 1717810423,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7n4cgd",
      "score": 1,
      "body": "The AI will be .00005 microns thinner. Incredible innovation!",
      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7n4cgd/",
      "created": 1717827403,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l89n6pn",
      "score": 1,
      "body": "This thread shows exactly why you do NOT take Redditors opinion as the gospel.",
      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l89n6pn/",
      "created": 1718199257,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7i71pp",
      "score": 1,
      "body": "I actually rather think that the announcement to integratw chatgpt in IOs will boost MSFT stocks (a bit) and drive alphabet down.",
      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7i71pp/",
      "created": 1717753693,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7iiygq",
      "score": 1,
      "body": "I wouldn't bet against apple. They own the smartphone market share of pretty much all developed countries.\n\nEven in developing countries where it normally costs 2-6 months salary for a base iPhone and up to a year's salary for a macbook with 16gb ram, they've implemented a 3 year 0% monthly installment payment option to make apple products more affordable to the masses. And so, the younger generation pretty much all line up for iPhones as soon as they start working.",
      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7iiygq/",
      "created": 1717760662,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7h7e0h",
      "score": -6,
      "body": "A hardware company, thats valued as a growth company, but isnt growing. If google wasnt paying them for default search, their services revenue would also suck balls. Everyone who wants an iphone, has one. Unfortunately for them, they made the phones so well people never feel the need to upgrade. Year after year they trickle out copied innovations from Samsung/google, with a multi year lag. Apple crafted their audience to be ignorant of cutting edge technology, and made them accept complacency all in the name of staying in the superior ecosystem. Now apple wonders why theres no “refresh cycle”. Theyve put out the same phone for years and their general fans are idiots. Theres people walking around with iphones that dont even have 120hz refreash rates and theyre perfectly fine with it. Apple went from a cutting edge luxury brand, to a boring utility.  They havent made an industry leading product in years. They cant even make siri functional.",
      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7h7e0h/",
      "created": 1717731210,
      "depth": 0,
      "replies": [
        {
          "id": "l7htbhp",
          "score": -1,
          "body": "This is the correct answer.",
          "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7htbhp/",
          "created": 1717743849,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7hjvwk",
      "score": 0,
      "body": "I don’t think anything they announce on June 10 will meaningfully increase sales.",
      "permalink": "/r/stocks/comments/1d9wdst/aapl_and_wwdc_on_monday_expectations_for_ai_and/l7hjvwk/",
      "created": 1717737905,
      "depth": 0,
      "replies": []
    }
  ]
}