{
  "title": "[deleted by user]",
  "score": 54,
  "selftext": "[removed]",
  "link_flair_text": null,
  "id": "1da9p1n",
  "num_comments": 53,
  "created_utc": 1717764156,
  "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/",
  "comments": [
    {
      "id": "l7lk587",
      "score": 14,
      "body": "We use snowflake at my company and its godsend. You dont wanna wait 2min+ to retrieve some data but snowflake does this in less than few seconds.",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7lk587/",
      "created": 1717800092,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7itfj3",
      "score": 74,
      "body": "unbelievably overpriced\n\n  \nlet's use SNOW's own guidance: 10B in revenue by 2029. Their long term projection is 20% NON-GAAP operating margin. Sounds impressive right?\n\n  \nUntil you realize 50% of their operating margin is SBC. So a 20% NON-GAAP margin is really a -30% margin. And this is a \"best case scenario\" for them. So let's be extremely generous and say they somehow improve their margin to a 1% GAAP margin (essentially boosting their margin by 31% which is completely unrealistic). This would assume in 2029 they're generating 100 million in operating income (so basically ignoring tax). \n\n  \nSo assuming they execute to the highest level, magically improve their profitability to the highest level (which they don't have a track record of), you would be buying a stock for 2029 earnings at a 440 PE as they have a 44B market cap as of today.\n\n  \nUp to you if that's a good buy",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7itfj3/",
      "created": 1717765341,
      "depth": 0,
      "replies": [
        {
          "id": "l7j1mx3",
          "score": 27,
          "body": "The SBC at snowflake is what always kept me out. Never dug deeper then that. It is just so unfriendly to shareholders.",
          "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7j1mx3/",
          "created": 1717768456,
          "depth": 1,
          "replies": [
            {
              "id": "l8ijoad",
              "score": 1,
              "body": "Every big tech company has SBC like this. I'm not saying SNOW is a good buy but it's not unique here.",
              "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l8ijoad/",
              "created": 1718327640,
              "depth": 2,
              "replies": [
                {
                  "id": "l8jdw9q",
                  "score": 1,
                  "body": "Not every big tech. CSU is a prime example. But they are an outlier.",
                  "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l8jdw9q/",
                  "created": 1718341853,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l7rhp9r",
          "score": 6,
          "body": "All of those metrics is pointless as SNOW is a growth company, all that matter is they GROW. \n\nSNOW is trading at strong historical support levels. If nothing catastrophic happens, it should either trade flat for a while or bounce up from here.",
          "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7rhp9r/",
          "created": 1717901076,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7iybu6",
          "score": 21,
          "body": "Whole tech and software seems overpriced if you look it that way",
          "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7iybu6/",
          "created": 1717767243,
          "depth": 1,
          "replies": [
            {
              "id": "l7iysvs",
              "score": 17,
              "body": "SNOW is the biggest offender of SaaS (SBC as a Service) by a very wide margin. When you look at similar competitors, they're doing their best to reduce SG&A SBC to improve profitability while maintaining top line growth. SNOW is reducing top line while decreasing their bottom line.",
              "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7iysvs/",
              "created": 1717767418,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l7j46tf",
          "score": 3,
          "body": "What's your substack?",
          "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7j46tf/",
          "created": 1717769381,
          "depth": 1,
          "replies": [
            {
              "id": "l7j4by7",
              "score": 15,
              "body": "Don't need the money so I'd rather just rant to reddit from time to time",
              "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7j4by7/",
              "created": 1717769433,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l7j8ysy",
          "score": 3,
          "body": "Great analysis! Thank you!",
          "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7j8ysy/",
          "created": 1717771067,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7le7yw",
          "score": 3,
          "body": "I have to ask, if it’s overpriced now, why do you think it got to $237 per share in February? Just hype?",
          "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7le7yw/",
          "created": 1717797725,
          "depth": 1,
          "replies": [
            {
              "id": "l7lqvdz",
              "score": 14,
              "body": "wework on a reverse split adjusted basis was 517 bucks a share. nikola was once 100 bucks a share. zoom was 500 bucks a share.\n\nthe market can remain irrational longer than you can remain solvent.\n\nim not saying snow is fraudulent or in the same category. i just think it's not worth its valuation. clearly, other people thought it was, even more so at a 80B valuation. only time will tell. i'm sure other people have a different thought than I do. i'm just giving my own 2 cents regarding how i come to snowflake intrinsic's valuation using their own numbers, same as I would any company such as Visa or Nvidia",
              "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7lqvdz/",
              "created": 1717802810,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l7qbotf",
          "score": 3,
          "body": "Given all of that, why do you think Buffet continues to own shares?",
          "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7qbotf/",
          "created": 1717882571,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7nordl",
          "score": 5,
          "body": "SNOW is as cheap as CRWD was in 2022/3 and is very similar in terms of TAM and leadership (growth etc). I also think their growth will re accelerate when rates get cut. It's a buy below $150.",
          "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7nordl/",
          "created": 1717842189,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7q1jz3",
          "score": 2,
          "body": "Clarifying question:\n\nAre you scaling up SBC with revenue? This might be a mistake if you think revenue can accelerate without a corresponding increase in headcount, which is often a fair bet with SaaS. You might be dramatically underestimating margin with this.",
          "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7q1jz3/",
          "created": 1717878578,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9zd2vo",
          "score": 1,
          "body": ".. are you increasing sbc along with their projected revenue gains? bc uh that won’t happen.. just wondering.  they’re aiming for 2% dillution, right?",
          "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l9zd2vo/",
          "created": 1719189294,
          "depth": 1,
          "replies": [
            {
              "id": "l9zhyt9",
              "score": 1,
              "body": "lol how did you even find this comment\n\nIdk why this comment even got as much attention as it did but to answer your question, this company relies on their sales team to land large contracts. If you think they won’t ask for compensation for their work, you’re mistaken. If you read their earnings call, the CEO explicitly states they’ve increased their sales rewards to push growth \n\nHowever, I do recognize they have a decent sized DBNRR to expand on the land but nowhere near enough to make up for 3100 bp of operating margin.\n\nAt the end of the day, there’s thousands of stocks out there. Idk why everyone’s so desperate to tell me why one with a quickly decelerating sales growth with a 40B cap is the next big deal but can’t do any math to explain how they’re going to provide shareholder value (using profits, cause revenue is useless). I could be absolutely wrong and it really wouldn’t matter as I don’t have a stake nor do I ever plan to, it doesn’t vibe with me",
              "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l9zhyt9/",
              "created": 1719191401,
              "depth": 2,
              "replies": [
                {
                  "id": "l9zi5za",
                  "score": 1,
                  "body": "lol.  i don’t know.. bored sunday evening looking for snowflake content trying to inform an opinion for myself; i like reading varying perspectives and comments.\n\nits an interesting company bc they focus on fcf and added a 2b buy back but yes are dilluting the shit out of investors at the same time. \n\nthe revenue growth forecasts don’t include new products and they’re releasing a handful. (with ai).  elite NRR and greattt list of customers. \n\ntheir goal was to be 2% dillution…\n\ngauging risk/reward here at these levels. much better than it was $200/share!",
                  "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l9zi5za/",
                  "created": 1719191486,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l7lbxnc",
          "score": -11,
          "body": "Oh noes! SNOW doesn't pay their employees real money, they pay them in shares! I'm a sad wittle investy boi!! :(\n\nOh noes! SNOW pays their employees real money not shares! There's so much overhead! I'm a sad wittle investy boi! :(",
          "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7lbxnc/",
          "created": 1717796838,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7jodms",
      "score": 8,
      "body": "The estimate for **2025** (below) shows pretty good growth if it can keep up with the estimate. Personally, I would not touch it because I think it is way overpriced due to the fact of EPS estimate of 0.99 for 2025 and with a P/E estimate of 133.16 also for 2025. That's terrible in my book but it's up to you.\n\nRevenue Estimate (yearly): $4,299,940,000\n\nRevenue Growth Estimate (yearly): 23.50%\n\nPrice-2-Sales Estimate at Current Stock Price: 10.26\n\nEPS Growth Estimate (yearly): 59.70%\n\n**EPS Estimate (yearly): 0.99**\n\n**P/E Estimate at Current Stock Price: 133.16**\n\n\n\nJust to show you NVDA estimate for 2025 and I don't even want to touch NVDA (probably a mistake):  \n\n\nRevenue Estimate (yearly): $159,550,000,000\n\nRevenue Growth Estimate (yearly): 32.40%\n\nPrice-2-Sales Estimate at Current Stock Price: 18.38\n\nEPS Growth Estimate (yearly): 32.60%\n\nEPS Estimate (yearly): 35.9\n\nP/E Estimate at Current Stock Price: 33.20\n\n  \nI'd rather invest in NVDA than SNOW any day of the week going into 2025.",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7jodms/",
      "created": 1717776292,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7isk5v",
      "score": 25,
      "body": "Despite SNOW itself not being breached (the breaches appear to be from stolen credentials) they’re dragged through the mud every time a new article comes out.",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7isk5v/",
      "created": 1717764982,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7ktuy2",
      "score": 13,
      "body": "The big 3 cloud offerings (AWS, Azure, GCP) didn't have decoupled compute 5 years ago, so Snowflake made a lot of sense as a part of your data stack, but now all 3 offer similar solutions so I'm struggling to see how Snowflake will remain relevant. They need a NEW product that differentiates them from the big 3 in some major way, and I'm not seeing any of that yet.",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7ktuy2/",
      "created": 1717790284,
      "depth": 0,
      "replies": [
        {
          "id": "l7n47qv",
          "score": 3,
          "body": "Fear of vendor lock in has always and will always exist. By your argument, no SaaS infrastructure companies should exist because the cloud vendors have economies of scale",
          "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7n47qv/",
          "created": 1717827317,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7iz1kl",
      "score": 9,
      "body": "I work in the industry and I think Snowflake makes a really great, but really overpriced product. I also think that $44b valuation is too high, but would consider investing if it took another 10% haircut. That said, I don't know much about the company fundamentals and my opinion is primarily based on the product itself vs the industry. As good as Snowflake is, there are a million other tools that can do the same thing in a different way, usually for a lower price. From what I see, Snowflake is not something that people reach for in the market because it's not really unique enough.",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7iz1kl/",
      "created": 1717767506,
      "depth": 0,
      "replies": [
        {
          "id": "l7l8s27",
          "score": 2,
          "body": "Agreed, quite overpriced. Migrating away an over $1MM/yr env at the moment.",
          "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7l8s27/",
          "created": 1717795550,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7j6lmh",
      "score": 13,
      "body": "I've missed out on plenty of boats that in reality should have corrected but didn't. The reality is that SNOW ain't going away because data is the fuel for AI. The stock will stay depressed until the Fed starts cutting rates a bit but your normal valuation metrics are meaningless to large funds that see it as being much bigger in 10 years than it is now. \n\nHorizons matter in this case and you can say the same about most of tech which by traditional valuation metrics would be overvalued.\n\nI've been buying since 180 range and sleeping very easy but I totally understand if it's out of people's risk tolerance or time horizon.",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7j6lmh/",
      "created": 1717770239,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7lfph1",
      "score": 5,
      "body": "I was doing well when it was 235 per share. I was spooked a bit by the initial drop and bought more. Then a week later I decided to cut my future potential loses. So I sold it all. It was admittedly on a feeling andwanting to simplify my portfolio and use that money for more VOO. People smarter than me said snow was overpriced for a while, but idk. I just lost interest.\n\n I don't miss it, adios SNOW.",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7lfph1/",
      "created": 1717798307,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7rnkz2",
      "score": 2,
      "body": "generally, i feel the cyber security market is one where companies cut corners.  They do not invest nearly as much as they should on cybersecurity.  so i generally am staying away from all these players until i see that attitude start to change.  And by that i mean until i see cybersecurity revenues going way up!",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7rnkz2/",
      "created": 1717903929,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7j5v81",
      "score": 3,
      "body": "Snowflake is a giant DB company. It’s like investing in MongoDB",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7j5v81/",
      "created": 1717769979,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7j2r5k",
      "score": 2,
      "body": "Snowflake's product strength and strategic partnerships, including with Google and NVIDIA, are indicative of its resilience and growth potential. While recent customer data breaches may affect market sentiment, it is important to assess whether these incidents reflect broader weaknesses in Snowflake's security measures or are isolated incidents.",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7j2r5k/",
      "created": 1717768861,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7jszu0",
      "score": 2,
      "body": "Arent they deluting the shares quite fast as well?",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7jszu0/",
      "created": 1717777832,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7iql41",
      "score": 1,
      "body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7iql41/",
      "created": 1717764157,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7niuu7",
      "score": 1,
      "body": "I would refuse to touch SNOW only because they have the most annoying pushy sales people",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7niuu7/",
      "created": 1717837807,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7qgakn",
      "score": 1,
      "body": "Buying back in",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7qgakn/",
      "created": 1717884467,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7rq86n",
      "score": 1,
      "body": "Anyone sniffing 7/5 or 7/14 $135 calls?",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7rq86n/",
      "created": 1717905323,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7is7h9",
      "score": 1,
      "body": "It has yet to be determined with any certainty if what may turn out to be the largest cloud breach in history was because of SNOW. \n\nI’m not saying you won’t make money by buying now, but there’s definitely a risk attached.",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7is7h9/",
      "created": 1717764838,
      "depth": 0,
      "replies": [
        {
          "id": "l7iycd5",
          "score": 2,
          "body": "It was NOT. Official statement from SNOW: https://community.snowflake.com/s/question/0D5VI00000Emyl00AB/detecting-and-preventing-unauthorized-user-access\n\nIt was some demo account, from customer with weak security",
          "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7iycd5/",
          "created": 1717767249,
          "depth": 1,
          "replies": [
            {
              "id": "l7j02th",
              "score": -1,
              "body": "I’ll believe it when it’s been verified by someone other than the accused.",
              "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7j02th/",
              "created": 1717767886,
              "depth": 2,
              "replies": [
                {
                  "id": "l7j7krs",
                  "score": 7,
                  "body": "Like Crowdstrike or Mandiant? https://www.thestack.technology/snowflake-crowdstrike-and-mandiant-say-were-clean/",
                  "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7j7krs/",
                  "created": 1717770584,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7jeaww",
                      "score": -5,
                      "body": "That’s helpful, but ideally it would be someone who wasn’t paid by snowflake either. \n\nWhat I really want to hear is WHY IT DID HAPPEN. All these reports tells me who isn’t to blame and  what didn’t cause the breach, but they aren’t telling me why only snowflake accounts are falling.\n\nI keep checking the price everyday because it may be in a great value territory, but it’s in this territory because of perceived uncertainty.  \n\nIf it seems like a good risk to you, go for it.",
                      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7jeaww/",
                      "created": 1717772901,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l7jgpsv",
                          "score": 7,
                          "body": "First - I don’t think classifying it as a breach of Snowflake itself is accurate, it’s a breach of poorly secured customer accounts whose credentials were skimmed elsewhere. This threat actor seemingly identified that there was an opportunity with poorly secured Snowflake accounts, and so they attacked those customers en masse. \n\nUltimately though, if you leave your gym locker unlocked and someone steals your wallet, do you have grounds to blame the gym?\n\nSecond - Crowdstrike and Mandiant both are industry leading incident response companies. The suggestion that they would compromise their reputation by lying/obfuscating would effectively destroy their businesses instantly if it leaked. I highly doubt they would risk that.",
                          "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7jgpsv/",
                          "created": 1717773721,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l7jlox4",
                              "score": 0,
                              "body": "Sounds like an amazing investing opportunity then! \n\nI’m not invested and don’t intend to be until actual answers come out about why this has happened.",
                              "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7jlox4/",
                              "created": 1717775394,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l7k19fu",
          "score": 2,
          "body": "Saying Snowflake is responsible for the breach is like saying Google is responsible for people who have their gmail accounts hacked. It was the end users not using MFA.",
          "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7k19fu/",
          "created": 1717780636,
          "depth": 1,
          "replies": [
            {
              "id": "l7kh3m0",
              "score": 2,
              "body": "1) I never said snowflake was responsible. I’m just saying this is a developing situation that the market is perceiving as uncertainty, and is pricing lower because of the uncertainty. \n\n2) The tool responsible for the breaches is named “rapeflake”.   What is different about the snowflake environment that caused the attackers to target their customer’s specifically?\n\nLike I’ve already said in another comment, I find SNOW at these levels interesting, but I’m not about to catch a falling knife.\n\nI have read that SNOW is planning on changing MFA to be on by default. That will be a good start to help stop the bleeding.",
              "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7kh3m0/",
              "created": 1717785905,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l7mf92d",
      "score": 1,
      "body": "As a cloud engineer I don't understand why any company would use Snowflake if the technical stakeholders had a say in anything. The only way the company is being kept alive is their sales team pitching to business executives without the input of engineers.",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7mf92d/",
      "created": 1717813521,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7jv26t",
      "score": 1,
      "body": "Cold precipitation in Atlanta is not on topic for this sub. ",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7jv26t/",
      "created": 1717778540,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7ki4bz",
      "score": 1,
      "body": "Why would a business want to add another SAAS cloud on top of what they already have? I’d imagine most businesses aren’t multi cloud (and why would they do this unless they acquired other businesses?) \n\nAs someone who works as a software engineer, I think competent management would avoid making their environments more overly complex\n\nThis is a stupid design choice to me. Additionally, AWS, GCP, or Azure cloud providers could come up with a new product themselves that completely voids the need for SNOW.",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7ki4bz/",
      "created": 1717786252,
      "depth": 0,
      "replies": [
        {
          "id": "l7kqsc9",
          "score": 1,
          "body": "there is no need for SNOW in 99.9% of companies. That's my issue with it",
          "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7kqsc9/",
          "created": 1717789226,
          "depth": 1,
          "replies": [
            {
              "id": "l7kujsc",
              "score": 1,
              "body": "Thank you for validating my comment. Yes it seems a bit unnecessary except for companies that foolishly add a second cloud for no good reason, or companies that love making acquisitions. This is not favorable considering acquisitions are not organic growth",
              "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7kujsc/",
              "created": 1717790523,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l7iurs1",
      "score": -5,
      "body": "Why is snow better then aws and azure honestly I’m also seeing more and more companies go back to on prem servers or a hybrid",
      "permalink": "/r/stocks/comments/1da9p1n/deleted_by_user/l7iurs1/",
      "created": 1717765878,
      "depth": 0,
      "replies": []
    }
  ]
}