{
  "title": "[deleted by user]",
  "score": 178,
  "selftext": "[removed]",
  "link_flair_text": null,
  "id": "1dagv97",
  "num_comments": 85,
  "created_utc": 1717782256,
  "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/",
  "comments": [
    {
      "id": "l7k77yi",
      "score": 275,
      "body": "If somebody knocks on your door, tell them you're not home. ",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7k77yi/",
      "created": 1717782610,
      "depth": 0,
      "replies": [
        {
          "id": "l7karqy",
          "score": 48,
          "body": "But what if I am home?\n\nCan I move my door so no one knocks. I think it would be much easier if there just wasn't a door.",
          "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7karqy/",
          "created": 1717783783,
          "depth": 1,
          "replies": [
            {
              "id": "l7kave2",
              "score": 44,
              "body": "Tell them you are related to Nancy Pelosi",
              "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kave2/",
              "created": 1717783817,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l7kevkb",
              "score": 9,
              "body": "march reply yam exultant melodic fragile command glorious school cable",
              "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kevkb/",
              "created": 1717785159,
              "depth": 2,
              "replies": [
                {
                  "id": "l7lafaq",
                  "score": 5,
                  "body": "Dude you're a genius...why are you here?",
                  "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7lafaq/",
                  "created": 1717796192,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l7li6tp",
              "score": 1,
              "body": "No! Then they will just look for the house with no door.",
              "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7li6tp/",
              "created": 1717799305,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l7kxe05",
          "score": 6,
          "body": "\"Dave's not here.\"",
          "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kxe05/",
          "created": 1717791511,
          "depth": 1,
          "replies": [
            {
              "id": "l7l7lws",
              "score": 3,
              "body": "It’s me Dave, I got the stuff.",
              "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7l7lws/",
              "created": 1717795115,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l7kx42z",
          "score": 4,
          "body": "You mean the plastic flap door on top of the dumpster I live in? Behind the Wendy’s?",
          "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kx42z/",
          "created": 1717791414,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7ki8z8",
          "score": 8,
          "body": "They've done studies. 60% of the time, it works every time.",
          "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7ki8z8/",
          "created": 1717786296,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7lab9a",
          "score": 1,
          "body": "![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7lab9a/",
          "created": 1717796143,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7kbb5e",
      "score": 80,
      "body": "This is not an exhaustive list, but here are the reasons Robinhood gives for this sort of thing:\n\n\n1. Identifying yourself as a company controller\n2. Bank transfer reversals\n3. Fraud investigations \n4. Outdated info\n5. Account levies\n\n\nIf your info hasn't changed and you haven't been sued or owe back taxes, the movement of so much money may have triggered an investigation of some sort.  I can't recall what RH's average account balance is, but it's probably much smaller than $40k.\n\n\n\n\nhttps://robinhood.com/us/en/support/articles/account-restrictions",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kbb5e/",
      "created": 1717783963,
      "depth": 0,
      "replies": [
        {
          "id": "l7kbya1",
          "score": 24,
          "body": "I deposited $5000, but withdrew it shortly after it cleared to the same bank account as I needed the funds to pay sudden credit card expenses. That’s the only thing I can think of. That was two weeks ago though that I withdrew and the money was in the account no issue.",
          "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kbya1/",
          "created": 1717784176,
          "depth": 1,
          "replies": [
            {
              "id": "l7kfmc3",
              "score": 58,
              "body": "Yeah that's pretty unusual, and probably looks to RH like potential money laundering, at least enough to give it a closer look. A\n\n\n lot of this stuff is probably driven by watching for pattern breaks, both breaks in your own personal patterns, and breaks in the aggregate pattern of robinhood users as a whole.  Most RH users probably add money slowly and withdraw a lot very quickly.   \n\n\nHow long did you spend between deposit and withdrawal? Is there a chance you withdrew from the \"instant deposit\" amount before your deposit actually cleared?  Or is it possible you did something like deposited $5k invested $1k, and withdrew $5k, so you were actually using more money than you had?  That sort of thing could potentially raise some bad faith flags.",
              "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kfmc3/",
              "created": 1717785408,
              "depth": 2,
              "replies": [
                {
                  "id": "l7kjq7c",
                  "score": -9,
                  "body": "Thinking about it further, I get what they probably flagged.\n\nWon a good bit in poker recently at local casino and deposited several thousand to bank account. Part of those funds were of the $5000 transferred to Robinhood on May 19. Withdrew $5000 on May 30. \n\nI can show W2 for $100k, tax filings that show gambling wins and losses, my own tracker with all wins/losses per session YTD, and gambling history of past month per player’s card of local casino. Just hoping that’s enough for them not to try and keep my funds.\n\nRead a lot of horror stories in past hour by searching Google with similar situations posted on Reddit. Robinhood says to people they cannot prove legitimacy of funds and are just going to keep it.",
                  "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kjq7c/",
                  "created": 1717786800,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7l7wro",
                      "score": 14,
                      "body": "The only way you’re getting that money back is by taking a Robinhood board member hostage. Just wear a ski mask so they can’t identify you and you should be good to go, right as rain by Monday morning",
                      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7l7wro/",
                      "created": 1717795226,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l7lgqlq",
                      "score": 12,
                      "body": "If that happens, contact the CFPB. They advocate on behalf of consumers to financial institutions, and often get things like thod resolved quickly.",
                      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7lgqlq/",
                      "created": 1717798724,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l7miq7w",
                      "score": 2,
                      "body": "It’s not that deep. This isn’t a credit card company doing  a financial review. It’s an algorithm that flagged your activity. It might be locked for a few days, but I’m sure they’ll reach out with the next steps. \n\nIf you satisfy those requests (probably some type of easy verification) and for some unlikely reason they still don’t want to release the funds, a quick CFPB complaint will grease the wheels.\n\nWith banks / financial institutions, it’s just a series of steps and escalations. Your funds are never in danger unless they’re going broke and they’re not insured or you’re being investigated by a 3 letter agency for selling grenade launchers overseas.",
                      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7miq7w/",
                      "created": 1717815183,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l7kgnsr",
              "score": 21,
              "body": "It's very likely a fraud investigation then. I had the same thing happen to me with GoFundMe.\n\n\nI think when transferring a medium amount of money, followed by a large amount to the same account, fraud-detection sees this and activates their cover-my-ass protocol. Which makes sense I guess cause that's how it looks when someone tries to steal your shit. But it's fuckin annoying.\n\n\nTo be clear, this isn't the IRS or whoever. You're not gonna have the feds banging down your door. At most, RH is gonna contact your bank, and then they're both gonna send you some emails asking if you're legit who you say you are. And then they'll wait a few weeks to open their email and you'll be let back in.",
              "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kgnsr/",
              "created": 1717785756,
              "depth": 2,
              "replies": [
                {
                  "id": "l7lawmc",
                  "score": 3,
                  "body": "What do you mean? \"I think when transferring a medium amount of money, followed by a large amount to the same account, fraud-detection sees this and activates their cover-my-ass protocol.\"  You can't keep transferring money out of RH to bank account?  They will flag you?",
                  "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7lawmc/",
                  "created": 1717796396,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7ldgqf",
                      "score": 3,
                      "body": "No this is about from a bank account, to any other (non-bank) account. The bank will flag it as possible fraud.(Maybe i'm using the wrong word. What I mean is: to them, it looks the same as a hacker got into your account and transferred some money as a test, followed by the large amount they actually want.\n\n\nIt's about RH here, but I've had it happen with GoFundMe, and even just sending money to family can trigger it.\n\n\nThere may be more going on behind the scenes in this case though. Since OP's had their RH banned before, it wouldn't suprise me if it triggered something on RH's end too.",
                      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7ldgqf/",
                      "created": 1717797433,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l7lldes",
                          "score": 3,
                          "body": "Ahhhh, you got me paranoid for a sec, cuz I've transferred money back to back from RH to bank account in amounts of $8K-$20K and nothing happened.",
                          "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7lldes/",
                          "created": 1717800585,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l7kirn6",
                  "score": 0,
                  "body": "I hope so, but I’m not having high hopes. They banned me last year from using crypto for gambling. I was fine with it. But I imagine they put me on a high risk category now. I’m reading a lot of posts from past year or two where Robinhood freezes accounts and makes a claim of “legitimacy of funds in question” and says they are keeping everything.\n\nFully prepared to go to CFPB on Tuesday with a complaint. Hope it doesn’t go that far. Disappointed to say the least. Was about to sell put options on HOOD to wheel my way into an investment in them.",
                  "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kirn6/",
                  "created": 1717786473,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l7kstss",
              "score": 8,
              "body": "I know this isn’t a financial advice sub, but if you don’t have a $5k rainy day fund, you really shouldn’t have any money in RH.",
              "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kstss/",
              "created": 1717789930,
              "depth": 2,
              "replies": [
                {
                  "id": "l7ku1r0",
                  "score": 6,
                  "body": "When Robinhood and other brokers has 5.25% interest, there should not be much left in checking accounts. Have a couple thousand in a separate checking account.",
                  "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7ku1r0/",
                  "created": 1717790350,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l7l4lj8",
              "score": 3,
              "body": "I can tell you right now, that's very likely what triggered their review.\n\nPeople don't usually do that with investment accounts. You shouldn't treat it like a checking account. Weird behavior gets flagged \n\nI don't know anything about Robinhood internally but you're just going to have to wait honestly",
              "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7l4lj8/",
              "created": 1717794027,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l7llz4b",
              "score": 3,
              "body": "That could have been seen as money laundering bouncing back and forth like that especially if you made 0 transactions with the deposited money",
              "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7llz4b/",
              "created": 1717800827,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l7lt54h",
              "score": 3,
              "body": "LMAO, that's almost certainly it.  5k is the threshold for AML reporting.\n\n\nI don't know what Robinhood's policies and procedures are, but I imagine if you're not actually money laundering for a cartel or something (and you're doing a shit job of it if you are) then you're almost certainly going to be fine.",
              "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7lt54h/",
              "created": 1717803743,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l7lhaeq",
              "score": 2,
              "body": "Read my reply to your post. This could be more serious than moving money in/out.. imo I would start making sure you’ve got the right explanations for a potential audit.",
              "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7lhaeq/",
              "created": 1717798944,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l7kqf6w",
              "score": 3,
              "body": "Yeah thats like weird laundering behavior.",
              "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kqf6w/",
              "created": 1717789100,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l7k8byp",
      "score": 38,
      "body": "The market makers are coming for you. You're done for my guy, GG",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7k8byp/",
      "created": 1717782977,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7khhu3",
      "score": 24,
      "body": "Two years ago I had this happen. I accidentally transferred money to a bank account I had closed but had forgotten to remove from RH. They locked all my money away for about 3 months. The way I solved it was I reported it to the SEC and FINRA, and about a week later a dude asked me for some evidence of owning that account, and I told him I didn't have any since I had closed it a couple years before, and then two days later my account was unlocked.\n\nRH customer support is useless so dont even bother.",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7khhu3/",
      "created": 1717786039,
      "depth": 0,
      "replies": [
        {
          "id": "l7kifxo",
          "score": 5,
          "body": "Yeah, I’m reading all the stories of people getting their funds frozen.\n\nWill be submitting to CFPB on Tuesday if they freeze my funds too. This is almost all of my savings.",
          "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kifxo/",
          "created": 1717786362,
          "depth": 1,
          "replies": [
            {
              "id": "lk9r1yu",
              "score": 1,
              "body": "Did you ever get this resolved? I feel like I’m going to fucking lose it. I deposited $1,000 and bought bitcoin so I could transfer it I another wallet and of course my stupid account is flagged and they won’t let me WITHDRAW MY OWN MONEY. It’s absolutely batshit crazy. \n\nAnd that’s after I went though like fifteen minutes of various account and ID verifications. ",
              "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/lk9r1yu/",
              "created": 1724807460,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l7kv3bs",
      "score": 10,
      "body": "I worked at a brokerage customer support, them refusing to give you any information suggests there’s a fraud investigation of some kind, most likely you will have to wait it out and see what they tell you. The main reason i quit that job is because I couldn’t stand how shitty we were forced to treat people in this situation. The customer service rep also likely has no clue or very little info on why the account is restricted, it’s handled by a separate black box department. You could be in for a long ride unfortunately",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kv3bs/",
      "created": 1717790710,
      "depth": 0,
      "replies": [
        {
          "id": "l7kvfrh",
          "score": 1,
          "body": "Thanks for the detail! My guess is they think my money is suspicious, rather than fraud. Likely will have to give them evidence of authentic funds and background, which I’ll be ready to do. Just hope they don’t take awhile here.",
          "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kvfrh/",
          "created": 1717790830,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7lbotn",
          "score": 1,
          "body": "Probably similar to banks, I've heard of how Chase will randomly close people's accounts and not give any reason or answer anything.",
          "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7lbotn/",
          "created": 1717796743,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7ke677",
      "score": 11,
      "body": "You've been identified in a Federal probe. Ever slept with a man?",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7ke677/",
      "created": 1717784920,
      "depth": 0,
      "replies": [
        {
          "id": "l7kniaa",
          "score": 8,
          "body": "probably a member of the communist party",
          "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kniaa/",
          "created": 1717788096,
          "depth": 1,
          "replies": [
            {
              "id": "l7lf495",
              "score": 3,
              "body": "Fruit juice drinking, sandal wearing, dirty hippie.",
              "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7lf495/",
              "created": 1717798075,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l7k65ny",
      "score": 6,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 2 weeks ago\n**Total Comments** | 7 | **Previous Best DD** | \n**Account Age** | 1 month | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7k65ny/",
      "created": 1717782261,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7kgxdk",
      "score": 4,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kgxdk/",
      "created": 1717785847,
      "depth": 0,
      "replies": [
        {
          "id": "l7kj3gs",
          "score": 3,
          "body": "Call center guy from somewhere outside of the US called me and told me he cannot escalate me to any supervisor, cannot give me any details on the lock and cannot help in any way. Just have to wait sadly.",
          "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kj3gs/",
          "created": 1717786585,
          "depth": 1,
          "replies": [
            {
              "id": "l7kk7jd",
              "score": 6,
              "body": "I also suffer from anxiety so this is some advice for that portion. I know I'd be freaking out too if I was you. If you know you've done nothing illegal then tell yourself that and it's going to workout to be fine in the end. You'll get your money back eventually just might take some time to be sorted. Try and do something to take your mind off of it for the time being if you've already called everyone you can call. Have a beer and watch a movie. Hope this is somewhat helpful",
              "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kk7jd/",
              "created": 1717786965,
              "depth": 2,
              "replies": [
                {
                  "id": "l7kkeyy",
                  "score": 1,
                  "body": "Thank you, I appreciate your advice",
                  "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kkeyy/",
                  "created": 1717787036,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l7lh0tl",
      "score": 4,
      "body": "Lmao you’re probably under investigation for tax fraud of some sort hombre. I highly doubt you properly reported those crypto transactions properly in the first place.. but even if you did: \n\nThose shady poker crypto sites are not exactly legally operated, and if you were sending crypto DIRECTLY from your poker account to your Robinhood account, it probably got flagged a bunch of times on their side by their risk management. They technically own all crypto assets held on their platform, not you. That’s why the saying is “if you don’t own the key phrase you don’t own the coins”. \n\nSo to them it looks like some regard is transferring money from an offshore wallet associated with illegal activity, then using that money to trade options on their platform. \n\n\nHORRIBLE opsec if you didn’t use at the very least a hard wallet before sending the crypto to their platform.",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7lh0tl/",
      "created": 1717798838,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7lj6f7",
      "score": 3,
      "body": "Ohhhhh U Fuk-ed .. they froze your acct for laundering money !! Expect a FED visit !!",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7lj6f7/",
      "created": 1717799700,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7kuv0o",
      "score": 2,
      "body": "Found the guy who was able to get BRK.A for $200 last week.",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kuv0o/",
      "created": 1717790630,
      "depth": 0,
      "replies": [
        {
          "id": "l7kv6x7",
          "score": 0,
          "body": "I tried submitting a limit order to buy 1 at $190 on that day and it got rejected.",
          "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kv6x7/",
          "created": 1717790744,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7luuey",
      "score": 2,
      "body": "banks are required to report (to the irs) a withdrawal or electronic transfer of 5k or higher.  this is mandated by the rico act, which typically used in money launderng court cases. \n\nin your cases, multiples transfers triggerred mutiples reports to the irs.  \n\nbut to freeze your account w/out divulging details is unacceptable. i would elevated this to the appropriate governing body.",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7luuey/",
      "created": 1717804454,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7luxmw",
      "score": 2,
      "body": "You got flagged by aml. And no, customer support is not allowed to tell you that you got flagged so that's why there won't be any communication from hood until investigation is done.",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7luxmw/",
      "created": 1717804491,
      "depth": 0,
      "replies": [
        {
          "id": "lk9rg0z",
          "score": 1,
          "body": "What the fuck is aml ",
          "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/lk9rg0z/",
          "created": 1724807608,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7lv0ru",
      "score": 2,
      "body": "Proceeds from gambling are a big red flag.",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7lv0ru/",
      "created": 1717804528,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7kqxuf",
      "score": 5,
      "body": "Your fault for using Robbingthehood",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kqxuf/",
      "created": 1717789279,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7l296g",
      "score": 1,
      "body": "Just Hwang up on them!",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7l296g/",
      "created": 1717793210,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7l93dp",
      "score": 1,
      "body": "Just make sure when walking into your house or apartment that if you see plastic sheets on the floor you gtfo",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7l93dp/",
      "created": 1717795667,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7m7zk1",
      "score": 1,
      "body": "Are they trying to limit you because of GameStop ?",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7m7zk1/",
      "created": 1717810214,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7m9csu",
      "score": 1,
      "body": "GameStop was down by 40% near session lows around $28 apiece, but the stock is still in the money for Gill to exercise his call options. He has 120,000 call options against GameStop with a strike price of $20 that expires June 21.\n\nThe notional value, if exercised, would be $240 million worth of stock bought at $20. That means Gill needs to have $240 million to take custody of the stock after exercising the calls,",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7m9csu/",
      "created": 1717810834,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7mboja",
      "score": 1,
      "body": "send nudes",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7mboja/",
      "created": 1717811884,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7mk1x8",
      "score": 1,
      "body": "Just robinhood things",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7mk1x8/",
      "created": 1717815824,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7n4rw5",
      "score": 1,
      "body": "That’s what you get for using shit hood",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7n4rw5/",
      "created": 1717827690,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7kexv3",
      "score": 0,
      "body": "Opening a Robinhood account was a bonehead move.",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kexv3/",
      "created": 1717785180,
      "depth": 0,
      "replies": [
        {
          "id": "l7kix0k",
          "score": -5,
          "body": "$0 option fees can’t be beat. You don’t get significant price execution improvement when you’re only trading a few options here or there.\n\nI wanted to sell covered calls and small spreads ($1-2k max loss).",
          "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kix0k/",
          "created": 1717786523,
          "depth": 1,
          "replies": [
            {
              "id": "l7kletj",
              "score": 3,
              "body": "> $0 option fees can’t be beat.\n\nAre you aware that your Robinhood accounts are restricted due to a recent review between now and June 11th?\n\nTo be less sarcastic: I really feel the $0.65 pain selling my $10 (That's $1,000) covered calls.",
              "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kletj/",
              "created": 1717787378,
              "depth": 2,
              "replies": [
                {
                  "id": "l7ku8l8",
                  "score": -1,
                  "body": "Yes, well aware of that now and will consider alternative brokers if Robinhood is a pain to resolve this.",
                  "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7ku8l8/",
                  "created": 1717790416,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l7l1u1p",
              "score": 0,
              "body": "Robinhood makes their fee using fill order manipulation",
              "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7l1u1p/",
              "created": 1717793062,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l7kirc3",
      "score": 1,
      "body": "Why is the 45k NOT in the 401k? why do you have 45k in Robinhood and not like Charles Schwab?",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kirc3/",
      "created": 1717786470,
      "depth": 0,
      "replies": [
        {
          "id": "l7kk032",
          "score": 2,
          "body": "I want to sell covered calls on my $45k of stock without paying fees. Yeah RH won’t have best spreads but selling 1 option here or there isn’t go to be worth paying $2-$5 broker fees for options elsewhere. The stocks I own are very liquid (TSM) and the option spreads match market.",
          "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kk032/",
          "created": 1717786894,
          "depth": 1,
          "replies": [
            {
              "id": "l7ko3du",
              "score": -2,
              "body": "I mean even then I'd still suggest Charles Schwab with more capabilities than Robinhood and things like this wouldn't happen \n\nIf I could sell covered calls I would lol",
              "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7ko3du/",
              "created": 1717788296,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l7l428q",
      "score": 0,
      "body": "Moral of the story: use a reputable broker",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7l428q/",
      "created": 1717793841,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7liaku",
      "score": 0,
      "body": "Why are you on Robinhood? I don’t get it",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7liaku/",
      "created": 1717799346,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7luam3",
      "score": 0,
      "body": "Imagine still using ROBinhood",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7luam3/",
      "created": 1717804221,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7kn1xy",
      "score": 0,
      "body": "![img](emote|t5_2th52|4267)",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7kn1xy/",
      "created": 1717787939,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7l1hjm",
      "score": 0,
      "body": "You're on their internal list due to the previous issues and they're deciding if they want to keep you as a customer.\n\nI done customer reviews like this previously and they're likely going to request you to offboard to another broker as you have crypto regulatory risk associated with your account and they don't want to have to do the enhanced monitoring on your account.\n\nIf you've been kicked off of a platform before, it's typically not a good idea to try and reopen accounts with that same broker, even if it's on another side....unless you have enough $$$$ (talking 7 figures investable assets).\n\nYou're not missing anything by not using RH.",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7l1hjm/",
      "created": 1717792942,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7letx4",
      "score": 0,
      "body": "This legitimately just happened to me and they closed down my accounts without any reason why, I also need to add that I had several fraudulent transactions on the account that totaled around 1k that they haven’t resolved or responded too",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7letx4/",
      "created": 1717797962,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7l2p5n",
      "score": -2,
      "body": "Robinhood is the absolute worst broker of all time. Switch to Webull or really anything else",
      "permalink": "/r/wallstreetbets/comments/1dagv97/deleted_by_user/l7l2p5n/",
      "created": 1717793364,
      "depth": 0,
      "replies": []
    }
  ]
}