{
  "title": "NVDA and SPY Options YTD",
  "score": 39,
  "selftext": "I transferred in a little less than $5k to start this wild ride. Picked up NVDA options in early January, sold the Friday before the first earnings ($40k profit, cashed out $30k). Went back in with remaining profits and have kept rolling my positions a couple weeks out at time.",
  "link_flair_text": "Gain",
  "id": "1datmeb",
  "num_comments": 8,
  "created_utc": 1717817559,
  "permalink": "/r/wallstreetbets/comments/1datmeb/nvda_and_spy_options_ytd/",
  "url_overridden_by_dest": "https://i.redd.it/6z8tkl7kp95d1.png",
  "comments": [
    {
      "id": "l7mnitz",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 31 | **Previous Best DD** | \n**Account Age** | 10 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1datmeb/nvda_and_spy_options_ytd/l7mnitz/",
      "created": 1717817564,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7osbhm",
      "score": 3,
      "body": "Nice. Get out before the market turns so you dont get wiped. Move some cash to shares instead of long calls.",
      "permalink": "/r/wallstreetbets/comments/1datmeb/nvda_and_spy_options_ytd/l7osbhm/",
      "created": 1717861262,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7mpt98",
      "score": 4,
      "body": "Sorry to ask a stupid question. I'm new at this and not familiar with calls. Regarding the BA call, are you buying a contract that says that \"it will\" go to $390 on that date or \"hope it\" does? \nI don't understand how it works.",
      "permalink": "/r/wallstreetbets/comments/1datmeb/nvda_and_spy_options_ytd/l7mpt98/",
      "created": 1717818752,
      "depth": 0,
      "replies": [
        {
          "id": "l7mq7n9",
          "score": 6,
          "body": "It will hit 390 or least get closer to the number, where I can potentially sell for profit before the contract date expiration.",
          "permalink": "/r/wallstreetbets/comments/1datmeb/nvda_and_spy_options_ytd/l7mq7n9/",
          "created": 1717818964,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7odcvn",
          "score": 7,
          "body": "Here's some basics I've picked up. I'll try to be concise and I might come back to edit for clarity.\n\n\nThere are two basic types of options contracts and it's crucial to understand 1. How they work and 2. How to profit from them.\n\n\n1. __Calls and Puts__\n\n\nCalls\n\n\nA contract is always for 100 shares.\n\n\nA Call is an agreement between the contract holder (you) and the Seller. In it, the Seller gives buyer the option to buy 100 shares of The Company at a price you both agree on - the __Strike Price__ - up until market close on the contract expiration date.\n\n\nThat means you don't have to buy the shares if you don't want to, but the seller has to let them go at the Strike Price if the contract holder decides to __execute__ the contract.\n\n\nIf you have a call option for a $100 strike, it means you can force the seller to sell you 100 shares for $10,000 until close on the expiration date, but you don't have to. The contract can just expire. Also, you don't have to have the $10,000, but we'll get to that later.\n\n\nLet's say you buy a contract for a $1 Strike price. If The Company stock price goes above $1 before the expiration date, it is said to be In The Money (ITM). When it is less than $1, it is Out of The Money (OTM).\n\n\nIf that stock price climbs to 1.05, you have made 5¢ on every share of your contract, 100 shares, so $5.\n\n\nLets say it goes up to $2, that means you have the opportunity to buy $200 worth of stock for $100. This is how a Call becomes profitable.\n\n\nPuts\n\n\nAlso always 100 shares.\n\n\nA put is similar to a Call but instead of the option to buy, this one gives you the option sell, or to force someone else to buy, your 100 shares. No, you don't have to own 100 shares, but we will get to that later.\n\n\nSo, if you buy a Put contract at a $1 strike price and the Stock drops to 50¢, you can force the buyer to pay you $100 for stock worth only $50. This is how a put becomes profitable.\n\n\n2. __Buying and Selling Contracts__\n\n\nBuying\n\n\nYour goal is not to execute the contract. You don't have to execute the contract to make money.\n\n\nMost people trading options want to buy the contract itself and then sell the contract for a profit. You never have to buy or own or sell the stock at all, it's just the option.\n\n\nSo how do you get a contract? You buy it from someone for a price-per-share, the __Premium__. So let's say you bought that $1 strike Call option for a 10¢ premium. Since it's always 100 shares, you paid $10 for the contract.\n\n\nThat $10 has to be factored into the final execution, so you really want the stock price to reach $1.10 just to break even. \n\n\nIt also means if it went to $2 like the above example, you would really make $85, because you paid $100 for the stock and $10 for the contract.\n\n\n\nSelling\n\n\nOk, you bought a contract for $10, and The Company announced a surprise Government contract. The stock price jumps, it isn't even In The Money yet, but the likelihood that it will get there has increased, and so the contract is more valuable.\n\n\nMarket price for your contract has increased from 10¢ to 20¢.\n\n\nYou bought for $10 and you can sell for $20. This is how contracts become profitable.\n\n\nSorry had to cut it short I have to go to work. This is obviously not investment advice.",
          "permalink": "/r/wallstreetbets/comments/1datmeb/nvda_and_spy_options_ytd/l7odcvn/",
          "created": 1717855313,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l89uskc",
      "score": 2,
      "body": "How far out were the expiries?",
      "permalink": "/r/wallstreetbets/comments/1datmeb/nvda_and_spy_options_ytd/l89uskc/",
      "created": 1718202076,
      "depth": 0,
      "replies": []
    }
  ]
}