{
  "title": "DD: VRNA PHARMA - PDUFA ACTION DATE: 06/26 // 199% UPSIDE POTENTIAL",
  "score": 97,
  "selftext": "Disclaimer: I am not a financial advisor. I am not an analyst. I am not trained to pick stocks, nor to teach about the market. I am not a doctor, nor a biopharma expert. I have a B.A in Philosophy from a liberal arts school, and I suffer from permanent brain fog from years of overindulgence at that school. You truly, genuinely should NOT trust a single thing I say without verifying it for yourself first, because I am not the person to listen to on matters regarding stocks, options, or other financial advice. Or any advice, really. \n\n \n\n \n\n*VRNA PHARMA, MY PATH TO FUNDING MY PH.D*\n\n \n\nVRNA Pharma (VRNA) is a clinical-stage biopharmaceutical company that has only ever lost money, has a singular candidate product, and is at -29.56% over 3 months. I stumbled across this stock on TradingView by accident, trying to find a different stock. However, my indicators liked the way it looked, so I did a little more digging, and I ended up opening a position two days ago that is roughly 24.62% of my portfolio. I plan to expand that position in the coming weeks.   \n  \n\n\nHere’s the argument: VRNA is relatively undervalued because of the psychological and statistical risks associated with biopharmaceutical companies.\n\n \n\nI rely on several key points to demonstrate this argument. \n\n \n\n**VRNA’S SINGULAR CANDIDATE PRODUCT, ENSIFENTRINE, IS BASED ON ABOVE-AVERAGE SCIENCE**\n\nEnsifentrine (also known by its development code RPL554) is a novel, dual inhibitor of the enzymes phosphodiesterase 3 (PDE3) and phosphodiesterase 4 (PDE4) that is being proposed as a treatment for COPD. COPD, in layman’s terms, is the long-term inflammation of the blood vessels and airways in your lungs, which makes it significantly harder to breathe or catch your breath- demonstrably affecting a person’s quality of life. It also requires treatment intervention in order to effectively cope long-term. \n\nI will cite the science below this explanation, because I am not qualified to try to even paraphrase it. However, I can explain *why* I believe ensifentrine is well-researched and grounded in good science, as well as properly argue for its efficacy.\n\nI noted above that ensifentrine is a “novel, dual-inhibitor.” This means it is a) new/different from existing treatments and b) it inhibits the action of two enzymes at once. **Enzymes are proteins in your body that act as catalysts to start, stop, slow down, or speed up various biochemical reactions necessary for bodily functions. So, in this context, the PDE3 enzyme is a protein that breaks down a different compound called cAMP (cyclical AMP), which plays a role in relaxing your muscles; so byinhibiting the PDE3 enzyme from being produced, ensifentrine relaxes your airway muscles, because the cAMP there is allowed to do its magic without being broken down by the PDE3. Simultaneously, ensifentrine also inhibits the PDE4 enzyme, which plays a role in your body’s inflammatory response. By inhibiting the PDE4 enzyme, the inflammatory response in a patient’s lungs can be reduced.** \n\n**Ensifentrine is a unique and innovative treatment because it is the only COPD medication that targets two enzymes at once. This allows for patients to more easily and regularly follow through with treatment regimens, as they are not expected to take multiple medications/doses; it presents a pivotal point in respiratory drug development, as the interest in combined medications has grown by roughly 30%  when measured by diagnoses and treatment plans prescribed by doctors; and further, it poses a lucrative opportunity to disrupt a market that has been stagnant for over a decade.** \n\n**As a maintenance treatment for COPD, the drug has an extremely promising clinical trial history. Further, the drug is still in Phase II clinical trials as a combination treatment with LAMA (a treatment that opens up the bronchi, or little airways in your lungs, by relaxing the muscles) and as a treatment for other conditions, like asthma and cystic fibrosis.** \n\n \n\n**Let’s focus for now on ensifentrine as a maintenance treatment for COPD. This means that it is a medication that is used to help a different, primary treatment succeed. The following analysis pertains to the Phase II – III trials of ensifentrine as a maintenance treatment for COPD.**  \n  \n\n\nThe Phase IIa study (NCT03443414) showed significant improvements in lung function (FEV1) across all doses, with the highest efficacy at 3 mg, and a safety profile comparable to placebo. FEV1, or Forced Expiratory Volume in one second, measures how much air a patient can forcefully exhale in one second, indicating lung function. The Phase IIb study (NCT03937479) confirmed the 3 mg dose as optimal, showing significant improvements in FEV1, COPD symptoms, and quality of life, along with a reduction in exacerbation rates. The Phase III ENHANCE trials, ENHANCE-1 and ENHANCE-2, aimed to assess the efficacy and safety of ensifentrine in a large COPD patient population. Both trials were multicenter, randomized, double-blind, parallel-group, and placebo-controlled, conducted across 250 sites in 17 countries. **ENHANCE-1** included 760 patients and showed a statistically significant improvement in FEV1 by 87 ml (P < 0.001) compared to placebo. The trial also reported improvements in COPD symptoms and quality of life, and a 36% reduction in the rate of moderate to severe exacerbations (rate ratio: 0.64; P = 0.050). Time to first exacerbation was significantly increased (hazard ratio: 0.62; P = 0.038), and adverse event rates were similar to placebo, indicating good tolerability. **ENHANCE-2** involved 789 patients and mirrored the design of ENHANCE-1. It demonstrated a significant FEV1 improvement of 94 ml (P < 0.001) over placebo. Although improvements in symptoms and quality of life were not statistically significant in this trial, the exacerbation rate was reduced by a statistically significant 43% (rate ratio: 0.57; P = 0.009), and the time to first exacerbation was extended significantly as well (hazard ratio: 0.58; P = 0.009). Safety profiles were consistent with ENHANCE-1, reinforcing the reliability of ensifentrine as a COPD treatment.\n\nThere are two hiccups in these otherwise very, very promising studies. But before I move into those problems, I want to emphasize just how strong these results are. For a novel mechanism to demonstrate so strongly that it has a definitive effect on the symptomology of a disease that hasn’t seen novel treatment in over a decade is quite impressive. \n\nNow, to the problems. First, a larger-than-average number of people dropped out of the studies. This is almost certainly in part because the studies were conducted throughout the course of the pandemic, which had a disproportionately large adverse effect on COPD and other respiratory patients. Second, and far less damning, the ENHANCE-2 study wasn’t able to demonstrate a statistically significant increase in quality of life (it just barely missed significance). \n\nBoth present their own reasons for ICER and/or the FDA to hesitate on giving ensifentrine high marks. ICER expressed explicit concerns about clinical trial participant dropout rates. However, they have also expressed a “high certainty” that ensifentrine provides a health benefit to the public, probably a large net health benefit, giving it an “incremental B+.” A key event to watch for comes on June 14, when CEPAC (a core entity of ICER) will release a report on the cost-effectiveness and public health benefits of ensifentrine. As of right now, they say ensifentrine will be “cost-effective” vis quality-of-life-years if it is priced between $7,500-$12,700. Perhaps this number will change, allowing it to be priced higher, producing better margins for VRNA. \n\nThe FDA is expected to make a decision on ensifentrine on June 26, 2024 (19 days). It seems incredibly likely that it will be approved – the science is strong, and while the arguments against the studies are **sound**, I do not think are **hefty**.\n\n \n\n**VRNA’S EXECUTIVE BOARD IS STRONG – ITS CLINICAL OPERATIONS MANAGERS HAVE A SOLID TRACK RECORD – SHARED HISTORY, GOALS, AND OUTLOOK AMONGST LEADERSHIP.**\n\n \n\nBefore we get into the science, we can first look at the scientists who are working on ensifentrine.\n\n \n\nA good portion of the executive chiefs, clinical staff, and other high-ranking officials share a common career history, having worked at GlaxoSmithKline (GSK), a different biopharma research company together. “Ensifentrine was co-invented by Sir David Jack, former head of research at GlaxoSmithKline, who made many significant contributions to respiratory medicine including pioneering the development of salbutamol, still one of the most widely prescribed bronchodilators for asthma today, and the first inhaled steroid, beclomethasone. After Sir Jack left GSK, he focused on seeking a single molecule that would combine both bronchodilator and anti-inflammatory activity, leading to the discovery of ensifentrine. Patents on the work were assigned to Vernalis Plc and later acquired by Rhinopharma Ltd. In 2006, Rhinopharma was recapitalized and renamed VRNA Pharma.” \n\n \n\n \n\n**Kathleen Rickard** – Chief Medical Officer at VRNA Pharma. Dr. Rickard is an MD with 3+ decades of respiratory medicine under her belt and has been with VRNA since 2019, overseeing multiple phases of clinical trials. In the past, Dr. Rickard directed clinical trials and regulatory strategies for the respiratory asthma medication NIOX V---, which successfully cleared regulatory hurdles and entered the international market. Further, ”…*Dr Rickard was Vice President Clinical Development and Medical Affairs of GlaxoSmithKline’s Respiratory Medicines Development Centre and, over a period of 15 years, held a number of other leadership positions in clinical development across GlaxoSmithKline’s global respiratory franchise…”*    \n  \n*Supporting Dr. Rickard in global clinical developments is:*  \n  \n\n\n**Nina Church**  – Executive Director of Global Clinical Development. ”Ms. Church brings 30 years of experience of late-stage clinical drug development in respiratory therapeutics, with 25 years at GlaxoSmithKline where she held a series of management positions, including Director, Global Operations COPD. At GlaxoSmithKline, Ms. Church was involved in the development of many respiratory therapeutics including Advair^(®), Anoro^(®), Flovent^(®), Serevent^(®) and Ventolin^(®). She joins from Parion Sciences where she was Executive Director, Clinical Operations.” \n\n \n\n**Nancy Herje** – Senior Director of Clinical Operations. “Ms. Herje has more than 25 years of experience in designing, planning and executing clinical programs for pharmaceutical and medical device companies including trials for the COPD therapeutic Flovent^(®). Prior to joining VRNA Pharma, Nancy was a Senior Clinical Scientist at ExecuPharm and previously held roles at Chimerix, Aerocrine, Inspire and GlaxoSmithKline.” \n\nThe least impressive, and probably least important in my estimation, is the CEO, **David Zaccardelli.** He, as far as I can tell, does not have a long history with the other board members, and does not seem to hold a super impressive record as an executive leader. He does, however, have a Ph.D in biopharmaceuticals and not business, so that may be why. \n\nHowever, what is interesting to note is that Zaccardelli sold around $1.175 million worth of VRNA shares when right before the stock dropped about 50% in a month, in September of 2023. Many other insiders sold large quantities of VRNA at that time as well.\n\nTwo insiders, **Martin** **Edwards** and **David Debsworth** bought a combined 200,000 shares the November, right before the price rallied and recovered, netting them a roughly 110% gain over two months (had they bought at market price- they didn’t, so it was a lot more than 110% gain).  \n  \n\n\nWhat I hope to point out here is that the executive board is a cohesive unit, with a long history of successful projects together. They share similar views, outlooks, and ostensibly goals. They each individually have a strong foundation in the industry, and all have proven track records with respiratory medications. Further, they telegraph relatively clearly when they think shit is about to hit the fan- or perhaps when they’ve struck gold.   \n  \n\n\n \n\n**The Market for COPD Drugs is Lucrative, and Analysts Have a Very Positive Outlook**\n\nCOPD is the sixth leading cause of death in the United States, third leading cause of death in the world, and roughly 6% of the U.S population has a diagnosis- but there are probably many more unreported cases. Further, there have been no novel COPD treatments released in the last decade- they all rely on pre-existing treatments or compounds. However, the ones that have been developed demonstrate that the market niche is active and lucrative. “According to Vantage Market Research, the Global[Asthma and COPD Drugs Market](https://www.vantagemarketresearch.com/industry-report/asthma-and-copd-drugs-market-2464) is estimated to be valued at USD 57.56 Billion by 2032 at an exponential growth of 4.9% in the next eight years.” It is important to note that a majority of that value is in ((asthma *and*COPD treatments) +  exclusively asthma treatments), whereas the value of the exclusively COPD drug market is probably less than half of that value. This is for various reasons; the two main ones are that there are more medications which people with either condition can take than there are medications which only a person with asthma or only a person with COPD can take; and combined treatments, in which patients are administered several different treatments, are finding increased prevalence. Further, there are simply more children/young adults with asthma than there are with COPD. However, this leads me into my next subpoint.\n\nVantage Market Research might even be underestimating the market, as when I checked their insights, they spoke primarily of increased pollution and urbanization, smoking/vaping trends, and aging patterns. I did not see a single mention of COVID (I did not pay for the premium version though). There is growing evidence that being infected with COVID-19, especially if the infection was severe, increases the chances of developing COPD or other chronic adult-onset respiratory conditions. The number of people with this condition is only going to grow with time- whether under the influence of the trends that VMR identified, or COVID, or both. The market, as the callous research would indicate, will grow healthily alongside them. And further, Verna Pharma is currently conducting follow up studies on ensifentrine efficacy for patients affected by long COVID. If approved for COPD, the funding is secured for further R&D and IP development. \n\nAnd finally, my last point is a financial analysis followed by a brief and limited technical analysis.\n\n**VRNA is in a good financial position and nearing the floor which cometh before the ATH**\n\nAs I stated above, VRNA “…has incurred recurring losses and negative cash flows from operations since inception, and has an accumulated deficit of $414.4 million as of March 31, 2024. The Company expects to incur additional losses and negative cash flows from operations until its products potentially gain regulatory approval and reach commercial profitability, if at all.” The company’s operational losses alone totaled roughly $27.2 million dollars. However,  because of frequent equity offerings, “(t)he Company expects that its cash and cash equivalents as of March 31, 2024, will be sufficient to fund its operating expenses and capital expenditure requirements for at least the next 12 months from the date of issuance.” Further, it should be noted that VRNA took on a loan of $400 million in 2023 from Oxford  Finance, LLC in order to continue financing its costly R&D and clinical trials. This loan is collected in batches of $50-100 million dollars over the course of 5 terms.\n\nAnother very interesting term loan facility that VRNA has entered into is with Oaktree Finance. This loan also totals up for an aggregate $400 million, available in “tranches” that become accessible as certain criteria and thresholds are met. Tranche B, worth about $70 million, will be released to VRNA eight business days after ensifentrine receives FDA approval, if it is approved before September 30, 2024. Another $75 million will be released to VRNA if certain sales milestones are met before December 31, 2025. Other tranches will become available later on, as well. In order to finance this loan, Oaktree put a lien on “substantially all” of VRNA’s assets, including its intellectual property. Verna Pharma, in my estimation, sees right now as the make-or-break, pivotal moment for the company. If they can’t secure FDA approval now, the likelihood they receive it before the September 30^(th)deadline for the Tranche B loan to be released is very low, and the company will spiral quickly from there. However, if they secure FDA approval, this funding will be the *engine* of the commercialization phase, allowing for scaling and partnerships.\n\nThe good news here is that, despite its immense debt obligations, there is a floor for VRNA given the company’s available cash on hand. Further, there is strong institutional sentiment that VRNA will succeed – somewhere around 80% of shares are institutionally owned. It has received the necessary funding to continue operating, and as long as it doesn’t miss FDA approval on June 26, it should stay well-funded throughout its commercialization efforts. \n\n**GO DO YOUR OWN RESEARCH.**\n\nLet’s look at the charts. I want to emphasize again, I am new to trading; I am new to technical analysis; I am so new that to even say I am learning is kind of overstating it. \n\nhttps://preview.redd.it/fleqstt5td5d1.png?width=2666&format=png&auto=webp&s=7a1d4df5a48dafe32d545a7a960b9d24400efe97\n\n First, a brief overview. This is a 1 month chart of VRNA. We see a nice bullish falling wedge after a large upswing. You’ll notice a big player(s) swapped 100million shares in July of 2020. I have the VWAP anchored there to demonstrate big fish positioning and to try to sniff out their moves. We see the price respect the middle VWAP band after breaking through on the upswing. Further, we see a valid support get tested three times, and we are now sitting just above it, but have crashed through the middle VWAP band. I smell a breakout. (I know nothing please do your own research and tell me if my technical analysis is bad.\n\n(SEE IMAGE BELOW) \n\n\n\n\n\n\n\nWe are now looking at a bi-weekly chart. I first want to show that the price has properly retraced the swing and is now entering a buy-signal territory. This is confirmed to me by the TrendStrengthIndicators, StochasticMomentum, and RelativeStrengthIndicators indicators flashing reversal. I suspect we pivot back up soon. \n\n  \n  \n\n\nIt is worth noting here that analyst ratings of VRNA are also saying it’s time to buy. Jefferies, H.C. Wainwright, Canaccord Genuity, Truist Financial, BTIG, Piper Sandler, Wedbush have all assigned or re-iterated a strong buy rating- and all of them predict a $30-$36 price point for a 149-199% upside potential.  \n  \n  \n\n\n \n\n**CONCLUSION**\n\n \n\nI have about 24.62% of my portfolio in VRNA right now. (SEE IMAGE BELOW)  I plan to expand this position when I get paid:\n\n-If price crashes to the second gold fib band and holds\n\n-An hour before close on 06/13, the day before CEPAC is set to release their report\n\n-An hour before close on 06/25, the day before PDUFA Action Date (When the FDA will decide if ensifentrine is approved or not\n\n \n\n \n\nI will gradually sell increasing fib bands as the price increases, starting at a +50% gain. \n\n \n\n \n\n \n\n(SEE WORKS CITED BELOW)   \n  \n\n\n \n\n\n\n \n\n \n\n  \nI really hope to get some good feedback. I am very good at receiving feedback and understanding where my analysis has gone wrong – I am very excited to hear what everyone thinks about the play. If this is, somehow, good analysis, I might share other due diligences I have done on stocks I think are good opportunities.",
  "link_flair_text": "DD",
  "id": "1db7xfx",
  "num_comments": 112,
  "created_utc": 1717867307,
  "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/",
  "comments": [
    {
      "id": "l7p8ec8",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 4 weeks ago\n**Total Comments** | 4 | **Previous Best DD** | \n**Account Age** | 8 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7p8ec8/",
      "created": 1717867313,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7pttyi",
      "score": 48,
      "body": "Risking $460? Fuck it I'm all in.",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7pttyi/",
      "created": 1717875570,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7pio0w",
      "score": 18,
      "body": "Please post your position",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7pio0w/",
      "created": 1717871217,
      "depth": 0,
      "replies": [
        {
          "id": "l7pnwhd",
          "score": 10,
          "body": "https://preview.redd.it/wqoniyi4be5d1.png?width=1125&format=png&auto=webp&s=02ddcc1dc6865dff39206389f77124e1160c6d22",
          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7pnwhd/",
          "created": 1717873240,
          "depth": 1,
          "replies": [
            {
              "id": "l7pr3u3",
              "score": 94,
              "body": "Holy shit you typed all that for a $460 position? ",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7pr3u3/",
              "created": 1717874499,
              "depth": 2,
              "replies": [
                {
                  "id": "l7qh6n4",
                  "score": 32,
                  "body": "plus the adderal cost",
                  "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7qh6n4/",
                  "created": 1717884844,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l7r55sb",
                  "score": 13,
                  "body": "Size doesn’t matter, we all gotta start somewhere",
                  "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7r55sb/",
                  "created": 1717895363,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l7pu60r",
                  "score": 26,
                  "body": "gonna be a $1200 position in two months",
                  "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7pu60r/",
                  "created": 1717875702,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7q1zy3",
                      "score": 8,
                      "body": "Did you see info on the side effects? I read through a couple of the pubmed excerpts and they listed there were “nothing significant” which isn’t unusual from this type of study but I could have missed some info. The science seems good, the majority of the board brought one of the most clinically significant inhalers to the market with a major company. But the financials make me queasy. So fuck it might be worth picking up a couple shares while we wait for the fda.",
                      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7q1zy3/",
                      "created": 1717878752,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l7q4nqz",
                          "score": 3,
                          "body": "all the clinical trials showed a safety profile in line with placebo and existing treatment, each time. nothing outside of the ordinary for typical side affects of nebulized inhalers, which from what i understand are typically quite nasty",
                          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7q4nqz/",
                          "created": 1717879785,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lag20j9",
                          "score": 1,
                          "body": "Queesy? Are you on crack? This company is solid AF. Read the financials again.",
                          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/lag20j9/",
                          "created": 1719446194,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "laikfu7",
                              "score": 1,
                              "body": "I did after posting my comment and actually bought 75 in the $13 range. Hopefully today will be a good day since fda approval was yesterday.",
                              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/laikfu7/",
                              "created": 1719493067,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l7r67kz",
                  "score": 8,
                  "body": "Couldn’t even pay me $460 to type this up let alone run the analysis",
                  "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7r67kz/",
                  "created": 1717895838,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l7rfkc2",
                  "score": 2,
                  "body": "![img](emote|t5_2th52|4271)",
                  "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7rfkc2/",
                  "created": 1717900083,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l7qclmf",
              "score": 19,
              "body": "Woah woah we got a whale here! Lets goooo",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7qclmf/",
              "created": 1717882942,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l7pzxa5",
              "score": 16,
              "body": "You gotta be fucking kidding",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7pzxa5/",
              "created": 1717877950,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l7r13ug",
              "score": 1,
              "body": "no shot xD",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7r13ug/",
              "created": 1717893529,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l7prgmb",
      "score": 11,
      "body": "Proud of u",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7prgmb/",
      "created": 1717874639,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7s3rmi",
      "score": 13,
      "body": "Add an A to VRNA and you get \"varna\" - that's \"meth lab\" in Czech. I'm in.",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7s3rmi/",
      "created": 1717913381,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7xlqiw",
      "score": 11,
      "body": "I'm a pulmonologist. Thanks for writing this up - I wasn't aware of this drug.\n\nThere are a few issues I want to address / clarify - some small, some bigger.\n\n>Let’s focus for now on ensifentrine as a maintenance treatment for COPD. This means that it is a medication that is used to help a different, primary treatment succeed.\n\nA maintenance treatment is something that needs to be taken daily to prevent a COPD exacerbation and improve symptoms (in contrast to rescue therapy, used when symptoms get worse). A COPD exacerbation occurs when a pathient has increased shortness of breath, cough, and phlegm. We try to avoid exacerbations because they can cause a patient to end up in the hospital, or even die. \n\n>For a novel mechanism to demonstrate so strongly that it has a definitive effect on the symptomology of a disease that hasn’t seen novel treatment in over a decade is quite impressive. \n\nWhile a dual phosphodiesterase (PDE) inhibitor is a novel therapy, there is already a PDE-4 inhibitor used to treat COPD on the market: **roflumilast**, aka daliresp, or daxas. This drug was initialy approved in 2010 and is now generic.  I can't find exact data but it looks like it did about $150 million in annual sales at its peak. In the studies done in Roflumilast, there was at 15 - 40% reduction in excaerbations. \n\nI will tell you that less than 10% of my COPD patients are on Roflumilast. It causes a lot of GI issues - nauea, acid reflux, bloating; and since the symptom reduction with the drug is pretty minimal, patient's aren't very excited about taking it. \n\nSo to be honest I'm not convinced this drug is going to be a blockbuster. \n\nThe drug that might make a splash in respiratory diseases is called brensocatib.  The parent company, Insmed $INSM, just released the Phase III results and they look very good.  INSM jumped from $22 to $56 on the news. I was planning to buy calls on INSM, but I've got all my capital tied up in NVDA. Kinda kicking myself about it now.\n\nAnyway, happy to answer other questions you might have, and I will try to update this once I have a chance to look more closely at the data.",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7xlqiw/",
      "created": 1718006032,
      "depth": 0,
      "replies": [
        {
          "id": "l7xlqjz",
          "score": 2,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7xlqjz/",
          "created": 1718006032,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7ydjua",
          "score": 1,
          "body": "I worked for the company that promoted Daliresp, you are spot on.    I now work inclinical trials, and insmed was my client at one point.   They have shifted their focus from pulmonary to  rare disease/ gene therapy, which is a big risk. But could pay off if successful.  However, as an organization they a run very poorly and were a nightmare to work with.",
          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7ydjua/",
          "created": 1718023347,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7yxwl3",
          "score": 1,
          "body": "Hi friend, thanks so much for the informative repsonse. I have a few questions, if you don't mind answering when you get a chance. \n\n  \nFirst - obviously every patient is different, and responds differently to every treatment. However, it is my understanding that roflumilast is a tablet, not a nebulized inhaler. Do you think the fact that ensifentrine is a nebulized inhaler treatment could be the reason its safety profile is similar or better than placebos/existing treatment? I have also read that there are nasty side effects associated with nebulized inhalers, ranging from stomach issues to thrush. What do you think about ensifentrine's safety profile, compared to other nebulized inhalers? And a brief follow up to that- what would you say is the most common COPD treatment? \n\nSecond- The case for industrialization increasing the number of cases seems too strong to deny- however, the long term effects of COVID-19 are beyond my skill set. As a pulmonologist, do you think the future numbers of COPD/adult asthma patients will increase to a remarkable/notable degree as a result of COVID-19? \n\n  \nThird - if you don't mind, can you help me understand the impact of CEPAC's report that will come out of June 14? How much sway do they have with the FDA's decision? Further, do you have any reference for gauging how a drug like this might be priced? \n\nThanks so much.",
          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7yxwl3/",
          "created": 1718031279,
          "depth": 1,
          "replies": [
            {
              "id": "l7zalx5",
              "score": 2,
              "body": "Tablet vs neublized:  A nebulized inhaler treatment could be better because its effect will be localized to the lungs. Less of the drug will reach other organs, which will limit side effect.  However nebulized treatments require a nebulizer - it's a machine that generates steam which the patient inhales. This means you'll have to be at home to use your nebulizer, which isn't very convenient.  Most COPD treatments use an inhaler, which you can take anywhere. It looks like ensifentrine has a half life of 10 hours, which means it'll probably be dosed 2x/day. \n\nInhaler side effects: yes, there are side effects, but inhaled drugs are usually better tolerated than oral medications. Thrush usually develops in patients who are taking inhaled steroid medications. Roflumilast & ensifentrine are not steroid medications\n\nCOVID-19: not likely to increase the number of people with COPD. In the US (which is going to be the biggest market for the drug), the greatest risk factor for COPD is smoking. Globally the greatest risk factor is indoor smoke (usually from cooking with wood fires indoors) - but people that develop COPD this way are usually poor, and they aren't going to be able to afford this drug. \n\nAir pollution increases risk for asthma, but the amount of damage to lungs needed to develop COPD is quite extensive. You need to assault your lungs with large amounts of inhaled smoke for many years to develop COPD.  \n\nCEPAC report: I'm not familiar with CEPAC, and only know the basics of the FDA approval process - I'm not involved clinical trials or pharma, so I'm probably not the best person to answer this question, but I'll give it a shot.  It looks like CPAC does important work, helping to determine if a drug is cost-effective or not. But the FDA doesn't make their decisions based on cost-effectiveness, because the cost of a drug will change over time. The FDA approves drug based on safety & efficacy.",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7zalx5/",
              "created": 1718035616,
              "depth": 2,
              "replies": [
                {
                  "id": "l7zbr5r",
                  "score": 2,
                  "body": "Thank you very much for your reply. I am going to chew on this. I am still confident, but having proper counterpositions to consider is super helpful. Very appreciative.",
                  "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7zbr5r/",
                  "created": 1718036007,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l888vl8",
                      "score": 2,
                      "body": "if it gets approved the stock still might rise before people realize the drug isn't that useful\n\nnot financial advice",
                      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l888vl8/",
                      "created": 1718169625,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l888vlm",
                          "score": 1,
                          "body": "PUT YOUR HANDS UP Key_Towel1824!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l888vlm/",
                          "created": 1718169625,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l7q40xj",
      "score": 37,
      "body": "Please also calculate your hourly rate assuming you double your position given the number of hours it took you to find all that info and type it up\n\nThen compare it to the base pay of a Wendy's manager",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7q40xj/",
      "created": 1717879538,
      "depth": 0,
      "replies": [
        {
          "id": "l7qao49",
          "score": 9,
          "body": "And then compound on it the value of a Wendy's handjob",
          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7qao49/",
          "created": 1717882156,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7qwmvb",
      "score": 7,
      "body": "That intro, that many words, I’m in.",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7qwmvb/",
      "created": 1717891536,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7q9jln",
      "score": 6,
      "body": "the dd sound convincing. I'm in",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7q9jln/",
      "created": 1717881705,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7roitv",
      "score": 8,
      "body": "Fucking BioPharm…\n\nI would rather 0DTE spy.  It’s less risky. This shit will be .80 in 6 months.",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7roitv/",
      "created": 1717904424,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7qhl0u",
      "score": 4,
      "body": "I’ll give you a tip, if you save on adderal you might make triple the amount on your bet that is already 150% gain!",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7qhl0u/",
      "created": 1717885014,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7s6yqt",
      "score": 4,
      "body": "Nice DD bro I ll buy 1 share to support.",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7s6yqt/",
      "created": 1717915518,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8hc7cp",
      "score": 4,
      "body": "I was at an investment conference last year that invites big hedge fund managers, long only managers, and strategists to pitch their best idea of the year in a 15 min presentation. \n\nRA Capital (biotech focused fund) pitched Verona and to this day maintains 9.99% ownership of the whole company.\n\nFor what it’s worth…",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l8hc7cp/",
      "created": 1718311041,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9t8g50",
      "score": 3,
      "body": "Thread went Quite!!!! What s happening OP where have you been??? Updates plz",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l9t8g50/",
      "created": 1719088705,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7sm57f",
      "score": 6,
      "body": "I’m in for 1k. I will buy on Monday first thing.\n!Remind me in 2w",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7sm57f/",
      "created": 1717926563,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7qs9us",
      "score": 3,
      "body": "IDK if he metioned that this stock also has a 33.47% short interest float i didn't read all",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7qs9us/",
      "created": 1717889611,
      "depth": 0,
      "replies": [
        {
          "id": "l7qttax",
          "score": 2,
          "body": "can you link this please? I saw an article that said 8% short interest. even if 33.47% short interest, isn’t  that just assumed by the thesis that pharma companies are risky and thus people bet against them too much? or is your bet that big players are shorting and will keep the stock down? i see that as unlikely if given FDA approval. also, see anchored VWAP. aren’t those 100m bought shares a good signal of positive  big player sentiment?",
          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7qttax/",
          "created": 1717890284,
          "depth": 1,
          "replies": [
            {
              "id": "l7rxwoe",
              "score": 6,
              "body": "Bruh, shorting biotech is one of the easiest ways to destroy your account. You may profit 90% of the time, but there will be that one time you wake up to a 5000% loss.",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7rxwoe/",
              "created": 1717909685,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l7r14c0",
              "score": 2,
              "body": "why do you believe what you believe? As in many instances where it seems likely and obvious that a result can happen, often the opposite happens. This isn't hate either I just like questioning why we think the way we do on trades like these.",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7r14c0/",
              "created": 1717893535,
              "depth": 2,
              "replies": [
                {
                  "id": "l7r2232",
                  "score": 3,
                  "body": "no absolutely, valid question. here’s why i believe it’s unlikely the stock will tank after FDA approval, bar something terribly bad happening (like a fire at the lab- they aren’t fire insured lmao) the company has secured the necessary cash via loans to commercialize the drug; they generate revenue by licensing the compound out to china; and further, i believe this drug works and will be effective because of the science. if the science in the trials proves accurate, this drug will be very valuable.",
                  "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7r2232/",
                  "created": 1717893955,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l7s9rzu",
      "score": 3,
      "body": "Nice dd",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7s9rzu/",
      "created": 1717917455,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7yk91k",
      "score": 3,
      "body": "Bought 1500 shares. Wish me luck fellow autists.",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7yk91k/",
      "created": 1718026199,
      "depth": 0,
      "replies": [
        {
          "id": "l7z0ggg",
          "score": 3,
          "body": "Did you really? Based on this?",
          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7z0ggg/",
          "created": 1718032168,
          "depth": 1,
          "replies": [
            {
              "id": "l89qxl8",
              "score": 2,
              "body": "Yoo thank you for the DD broski",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l89qxl8/",
              "created": 1718200674,
              "depth": 2,
              "replies": [
                {
                  "id": "l89sqtk",
                  "score": 3,
                  "body": "No problem! What price did you enter at?",
                  "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l89sqtk/",
                  "created": 1718201340,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8aewej",
                      "score": 2,
                      "body": "12.16",
                      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l8aewej/",
                      "created": 1718209101,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l888bj4",
      "score": 3,
      "body": "https://preview.redd.it/nmr1vq68r26d1.png?width=527&format=png&auto=webp&s=8552b37f470eeaff2c88ed8fed1348bd4ba8bdf0\n\nfull length novel for a 400 dollar bet is crazy, but I went ahead and the call's already up a hundred dollars, kinda wish  I got more calls so I could sell them and leave one for the main gamble",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l888bj4/",
      "created": 1718169296,
      "depth": 0,
      "replies": [
        {
          "id": "l89ucxj",
          "score": 2,
          "body": "Value now?",
          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l89ucxj/",
          "created": 1718201921,
          "depth": 1,
          "replies": [
            {
              "id": "l8b6t8x",
              "score": 2,
              "body": "same as earlier, doesn't matter though, I'm gonna hold through until the fda announcement",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l8b6t8x/",
              "created": 1718218246,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l89y9a0",
      "score": 3,
      "body": "Bought 5k shares at 12.13 thank you brother",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l89y9a0/",
      "created": 1718203291,
      "depth": 0,
      "replies": [
        {
          "id": "l8a058w",
          "score": 3,
          "body": "damn you're printing right now lmfao I cannot express how cool that is - glad we're making money!",
          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l8a058w/",
          "created": 1718203941,
          "depth": 1,
          "replies": [
            {
              "id": "l8bv7g6",
              "score": 2,
              "body": "I bought at $12.48! Was glad to read this post.\n\nAre you still thinking it’s a long play?",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l8bv7g6/",
              "created": 1718226328,
              "depth": 2,
              "replies": [
                {
                  "id": "l8byn04",
                  "score": 1,
                  "body": "very glad some people read this and joined me in the fun! and yeah, it’s still a long play in my eyes, bar FDA denying approval  (I would insta sell and rebuy at the bottom in anticipation of a september approval).\n\nI am honestly kinda of surprised it’s already up this much, and am expecting a correction tomorrow before the CEPAC meeting on friday. if CEPAC goes well, i’m expecting another big rally and then another gradual increase until volatility spikes again before the FDA decision. \n\nmost analysts predict a price target 31-39 by June of 2025. in order to get there, it’ll need to roll out commercially, which is an entire ordeal itself. \n\nI am, however, rethinking my exit strategy, as i’ve lost confidence in the fib retracements being an accurate prediction for the binary events and subsequent price action. i am currently trying to figure out the best way to get out of this without leaving too much money on the table, but also not getting my ass kicked by a crazy one-off, like someone dying early into distribution, or a fire or something (as i mentioned elsewhere, they are not fire insured lmao)",
                  "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l8byn04/",
                  "created": 1718227522,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l7qf45b",
      "score": 2,
      "body": "Do we know the exact hour when they announce approval ,( or failure)? \n\nBecause then put in high leveraged position an hour before that :D",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7qf45b/",
      "created": 1717883978,
      "depth": 0,
      "replies": [
        {
          "id": "l7ryp2d",
          "score": 2,
          "body": "June 26, 2024 is all I could find. Here is the whole statement. \n\n\"The US Food and Drug Administration (FDA) assigned a Prescription Drug User Fee Act (PDUFA) target action date of June 26, 2024 for Verona Pharma's (Nasdaq: VRNA) New Drug Application (NDA) for ensifentrine. Ensifentrine is being developed as a treatment for chronic obstructive pulmonary disease (COPD), and if approved, it could be the first inhaled non-steroidal therapy to combine bronchodilator and anti-inflammatory activities in one molecule. Verona Pharma is also planning to launch ensifentrine in the US in the third quarter of 2024, pending FDA approval.\"",
          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7ryp2d/",
          "created": 1717910168,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7s6s97",
      "score": 2,
      "body": "remind! me 2 weeks",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7s6s97/",
      "created": 1717915398,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7umbzy",
      "score": 2,
      "body": "Ha seen this before.  Seatsra medical I saw the hype i hopped in and out on FDA release day.  Go check the chart its dead now. Itll prob bounce bur alot of folks well down.\n\nI'll have a look again the few days before it likely.  Itll see a fair rise I would guess but options are risky here",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7umbzy/",
      "created": 1717957953,
      "depth": 0,
      "replies": [
        {
          "id": "l7uxhy0",
          "score": 1,
          "body": "Did you read the DD? The drug itself is very promising and the market for COPD/asthma drugs is already present, set to grow because of environmental factors. alongside the fact that these developers have already brought several successful drugs to an international market. why are you skeptical? i am genuinely curious!",
          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7uxhy0/",
          "created": 1717961865,
          "depth": 1,
          "replies": [
            {
              "id": "l7xb945",
              "score": 2,
              "body": "Thats all well and good but you've seen other biopharms before. The product is good, has a use and works.  The issue is for the now that they aren't approved and have made zero sales.  So yes its a long pkay but also risky as in will it get picked up by the boys who *want* it.\n\nSo short term (which is wsb forum let's be honest) it is waiting for a pop at approval but itll soon level out or dip.",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7xb945/",
              "created": 1717998862,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "laf97si",
      "score": 2,
      "body": "Shit got approved but now was a market halt",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/laf97si/",
      "created": 1719435837,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lag3k8j",
      "score": 2,
      "body": "We got approved",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/lag3k8j/",
      "created": 1719446791,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lahis3l",
      "score": 2,
      "body": "A rpund of applause to the OP...i went 25k on this, bought at 15.5 on Monday i hope it will reach 20$ today!!! Next one for me is RCKT!",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/lahis3l/",
      "created": 1719470413,
      "depth": 0,
      "replies": [
        {
          "id": "lajgmmo",
          "score": 1,
          "body": "$20 isn’t likely today though revised target went from $30 to $36",
          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/lajgmmo/",
          "created": 1719504393,
          "depth": 1,
          "replies": [
            {
              "id": "laour9l",
              "score": 1,
              "body": "When do you think it will reach it?",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/laour9l/",
              "created": 1719587362,
              "depth": 2,
              "replies": [
                {
                  "id": "lapcioc",
                  "score": 1,
                  "body": "You’ll need to secure supply, then access (insurance companies), and in the meantime market it to all prescribers. Q2 and Q3 will show big expenditures and some potential projections on expected profits. Q4 and next year will need to beat their projections and that’s likely what will get them to $36. A bit of a long way and along that way there will be a new competitor.",
                  "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/lapcioc/",
                  "created": 1719593271,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "laplzkc",
      "score": 2,
      "body": "4 week old account pumping a squeeze that is down lol",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/laplzkc/",
      "created": 1719596418,
      "depth": 0,
      "replies": [
        {
          "id": "lbg1qx9",
          "score": 4,
          "body": "if you bought when I recommended, you’re up big right now:) i hope you had fun missing out<3",
          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/lbg1qx9/",
          "created": 1720016170,
          "depth": 1,
          "replies": [
            {
              "id": "lbg3qy8",
              "score": 2,
              "body": "I did buy",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/lbg3qy8/",
              "created": 1720016871,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lapm6dn",
          "score": 2,
          "body": "posting my update later today lol did you even read the DD?",
          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/lapm6dn/",
          "created": 1719596479,
          "depth": 1,
          "replies": [
            {
              "id": "lcrj9e9",
              "score": 2,
              "body": "I've got $33k in this thing right now. The upcoming earnings call better be good.",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/lcrj9e9/",
              "created": 1720745667,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l7ts0wl",
      "score": 1,
      "body": " Remind Me in 2 weeks",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7ts0wl/",
      "created": 1717947239,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7vk2zh",
      "score": 1,
      "body": "remind! me 2 weeks",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7vk2zh/",
      "created": 1717970119,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7zb2e2",
      "score": 1,
      "body": "Hmmmm.... do they have profits from other stuff or is their only hope ? I was thinking about doing 2x CSP on 10 but if their whole company would rely on that being FDA approved, it could end badly",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7zb2e2/",
      "created": 1718035772,
      "depth": 0,
      "replies": [
        {
          "id": "l7zcspx",
          "score": 1,
          "body": "Ensifentrine is their only candidate product at the moment. The team has brought several other successful resp. medications to the international market under a different biopharma company (GlaxoSmithKline (GSK)). The company bet its entire future on this FDA approval date (see the loan facility section). They didn't have to do this- they had enough cash on hand to wait a year and play it safe. But they got the cash for commercialization sooner rather than later because they are very confident that it will be approved (as are outside, independent analysts (see the discussion on CEPAC's B+ rating).",
          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7zcspx/",
          "created": 1718036359,
          "depth": 1,
          "replies": [
            {
              "id": "l7zfhx0",
              "score": 1,
              "body": "My experience so far with FDA is that it's more random than it should be really. Saw products that supposedly had no side effects and it helped at least to supplement a treatment being cancelled while a carcinogens were approved. I know it's  biotech, either you make 10x gains or lose it all, maybe I will just get a few shares instead of options this time around",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7zfhx0/",
              "created": 1718037271,
              "depth": 2,
              "replies": [
                {
                  "id": "l7zh8yp",
                  "score": 2,
                  "body": "Option market is far too illiquid, otherwise I would be buying calls. However, I think there is plenty of upside to be had in terms of shares.",
                  "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7zh8yp/",
                  "created": 1718037861,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8ch2r9",
      "score": 1,
      "body": "In this 3750 shares. Lets ride",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l8ch2r9/",
      "created": 1718234441,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8fl24y",
      "score": 1,
      "body": "Ive been watching this as well, was able to scoop up some July 19 15 call options.. watching them print over the last 2 days.\n\nwill sell post FDA, not interested in waiting for a buy out or for it to be shorted into oblivion.",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l8fl24y/",
      "created": 1718289989,
      "depth": 0,
      "replies": [
        {
          "id": "l8fsfr5",
          "score": 2,
          "body": "How'd you stumble upon the stock?",
          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l8fsfr5/",
          "created": 1718292488,
          "depth": 1,
          "replies": [
            {
              "id": "l8gt157",
              "score": 2,
              "body": "A business journal for NC. Covering the history of the company and upcoming FDA decision. \nWatched it trade down/ sideways and decided it was attractive enough. \nIve been waiting for a post on VRNA! Constantly searching Reddit for confirmation bias lol\n\nGlad it pulled back some.. insane volume so far today!\n\nEnjoyed your DD, Very well done.",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l8gt157/",
              "created": 1718304702,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ldnzrz6",
              "score": 1,
              "body": "ABSOLUTELY TONNING IT NOW",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/ldnzrz6/",
              "created": 1721247769,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lafft76",
          "score": 2,
          "body": "Popped once they made the announcement. Congrats \nTomorrow will be nice",
          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/lafft76/",
          "created": 1719438047,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8goyf4",
      "score": 1,
      "body": "OP what do you think will happen this evening then in anticipation for  CEPAC report?",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l8goyf4/",
      "created": 1718303326,
      "depth": 0,
      "replies": [
        {
          "id": "l8gsdwt",
          "score": 1,
          "body": "Since writing this, I have begun to wonder how much of a role it will actually play. My gut instinct is still that good news (they maintain positive opinions and perchance even say it will be more cost-effective than previously thought) could be a substantive enough reason for hesitant buyers/existing players to expand positions, especially big fish. However, *vis* the pulmonologist with great insights below, it seems like ICER/CEPAC - while internally important to the drug creation process in general- does not have a large effect on the FDA approval decision making process itself, which is the critical  moment we are all betting on. \n\n  \n\n\nI think it's very possible this upward increase is simply part of the initial build up that explode on the 26th when FDA action comes, and we are likely to continue seeing swings like we did today of around 10%, although I bet the price generally trends  upwards towards the 26th.  However, my gut instinct is that tomorrow's news will indeed impact the price- it seems like a great point to either double down or re-evaluate the initial thesis before the FDA decision. \n\n  \nThis is my first pharma play, and probably my first really thought-out trade, so I truly have no  idea. i think I can look at the charts, read the news, and try to piece it together- but unfortunately, I am just not skilled enough to have a real idea of the meaning of tomorrow's meeting. But, for me, the plan is to hold until FDA decision, if FDA decision is good, I ride initial wave, sell enough to cover cost basis and then some, and then watch the commercialization process play out and hope it really does hit 30-36 bucks by June. \n\nI am still re-evaluating my exit strategy - I have a bad habit of leaving money on the table.",
          "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l8gsdwt/",
          "created": 1718304492,
          "depth": 1,
          "replies": [
            {
              "id": "l8gu8t3",
              "score": 1,
              "body": "Ive just seen before once FDa approved a big sell off afgter a big run up, as whilst its good news theres still no money being made yet and alot of it is \"hype\".  Produyct seems good and will definitely be good for alot of people so definitely a commercial benefit to it.",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l8gu8t3/",
              "created": 1718305101,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9fsp68",
              "score": 1,
              "body": "How ya feeling now? Feels stabilised out.  You think that growth was retail hopping on or bigger investors in anticipation for the 25th release?",
              "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l9fsp68/",
              "created": 1718876068,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9qmkaj",
      "score": 1,
      "body": "Going in with 30k worth of vrna stock...i was looking at this stock before seeing this post, I have also bought some sarepta this week at 115 stock went up to 170 on approval day...it is possible that if appro ed verona might get to 25-30 by next Friday...all is possibikities, it can also tank to 5....if you cannot afford loosing the money dont go in",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l9qmkaj/",
      "created": 1719046322,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldju5j7",
      "score": 1,
      "body": "Am I dreaming or is the short float 50%",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/ldju5j7/",
      "created": 1721183310,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7p8dt5",
      "score": 0,
      "body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7p8dt5/",
      "created": 1717867307,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7r66ss",
      "score": 0,
      "body": "Nope.",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7r66ss/",
      "created": 1717895828,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7qmlp0",
      "score": -17,
      "body": "Yo ban this guy",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/l7qmlp0/",
      "created": 1717887167,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqbpi4y",
      "score": 1,
      "body": "Just wanted to say thank you OP! By any chance do you have any new advice? 😂",
      "permalink": "/r/wallstreetbets/comments/1db7xfx/dd_vrna_pharma_pdufa_action_date_0626_199_upside/lqbpi4y/",
      "created": 1728060262,
      "depth": 0,
      "replies": []
    }
  ]
}