{
  "title": "CMCSA Annual Meeting Question: Missed My Share Purchase Deadline – Now It’s Free for All!",
  "score": 20,
  "selftext": "Dear Reddit:\n\n\n\nI have a question I want to ask at the Comcast (CMCSA) 2024 Annual Meeting of Shareholders, but I became aware of this question as a result of subscribing Comcast Business service for my home office, far too late to ask it at the upcoming meeting.  I purchased my one share on May 30th, but it had to be in my name as of April 1st for me to have the right to ask this question myself at the meeting.\n\n\n\nI think, if you read on, you will find the question I want to ask with my one share rather juicy, and quite well developed.  It’s a shame I will be unable to ask it, but, it occurred to me, why not ask Reddit?  Surely someone will see what I see and ask away.\n\n\n\nI didn’t plan this.  I didn’t set out to be a gadfly.  I just ran into it.  As a customer.  This would have been my first gadfly, but, also, I just want this question asked.  I asked a few friends who might appreciate what I’m trying to do, but no one had a share to sign over proxy on.\n\n\n\nMy only regret is, to make that possible, I have to post this before the meeting, which will give them time to prepare.  This would have been my first gadfly, and I’m giving advance notice to the Board, simply to get the question asked, because I happened on this as a customer.\n\n\n\nSo, reddit, you want to ask my good one for me?\n\n\n\n\n\nHere’s the story, the question, and the supporting documentation is linked below it, all sources cited:\n\n\n\nI very recently signed up Comcast Business for my home office.  See, I needed a static IP address.  And, residential service doesn’t offer that.  So, I was willing and prepared to double my bill for that block of IPs.\n\n\n\nBut, there was a wrinkle.  I had to take two services I didn’t want – Connection Pro, and WiFi Pro – as part of the promotional package.  The list price for these totals $44.90 per month ($14.95 WiFi Pro, $29.95 Connection Pro).  But, that’s okay, because they’re provided free of charge.\n\n\n\nI made it clear my needs did not include storefront / public place WiFi / large office building WiFi, and said that Connection Pro might be interesting, but needed details on how it works.  I was told there’s a 30 day satisfaction guarantee if the Connection Pro didn’t work out.\n\n\n\nTurns out it can’t be used with Static IPs, and that is literally all I subscribed this service for.\n\n\n\nNow, I had tried to refuse these services when I signed up.  I said, they’re free?  Fine, why don’t you give me the same package without them, but at the same price, then I don’t have to store your gear, or carry insurance on it, or have liability for its safekeeping, and I don’t have services Provisioned in my name no one’s using, like an LTE IMSI tied to my name.\n\n\n\nThey couldn’t do it.  So, I called up threatening to cancel, and asking them to pull them off to save my business.  Still can’t do it.\n\n\n\nI can either double my price, to an over-market absurdity, or I can take the services, and store the equipment.  They said a lot of folks are just not using them.  From the sound of it, they get a lot of pushback on this, and they have standard ways of explaining the bulk nature of the offering.  It’s like Costco.\n\n\n\nExcept one thing didn’t make sense.  This isn’t revenue.  The services are free for the duration of the contract.  And, I can cancel them before I start to get charged, as long as I do it on contract expiry day, and as long as I maintain their equipment safely for them.  If I do not return the equipment, it’s $150 per device, for a total of $300.\n\n\n\nThis got me thinking….  That’s a lot of money for equipment to generate no revenue, not even realistic future revenue, being paid for on every single new account, clearly over the marketplace’s objections.\n\n\n\nNot only did this strike me as absurd, but I can tell (subjectively) they get pushback on it a lot.\n\n\n\nNow, if we just go by the no-return fee, that’s $300 of equipment, on $207 per month revenue (1.25 GB, high end service, excluding static ips, but otherwise inclusive of any equipment fees).\n\n\n\nThat’s the 1.45 months of the shareholder’s revenue down the toilet in equipment expenditures, to, again, not actually increase actual cash in the door, as customers are being forced to take this stuff for free even when they don’t want it.\n\n\n\nI was unable to source the actual cost of the hardware or MSRP, so the most reliable figures I have are Comcast’s replacement price.  I did ask ChatGPT for an estimate, and two bounds, given varying discounts to that estimate.  Those bands are included in the supporting spreadsheet, and you can replace those numbers with any values you have, if you have better data, to see the ROI figures.  Again, the figures I base this analysis on are the Comcast provided replacement charges.\n\n\n\nThe ROI is 6.68 months on just the list price for the two services, today, which is basically almost never actually billed to a customer.  ($44.90, as detailed above, is the revenue figure there.)\n\n\n\nHow do the shareholders benefit from buying all this gear no one wants and forcing it upon literally every account?\n\n\n\nThis led me to a wicked speculation, and a question I do not know the answer to.  In three parts.\n\n\n\nAre these bundled services used to establish any financial metrics that the Board relies upon for financial reporting purposes? If so, could you clarify how these metrics are calculated and their impact on reported figures?\n\n\n\nIs there a possibility that these promotional items and services are factored into executive compensation packages? Specifically, are performance metrics that influence executive bonuses or incentives linked to the inclusion of these services?\n\n\n\nTo what extent do either of these two sets of metrics factor in revenue excluding term-limited promotional pricing, which this model would fall under?\n\n\n\n-----------------\n\n\n\nSo, reddit, I have to ask, as this is my first time, and I’m basically just a pissed off customer, do I have a live one here?\n\n\n\nI’ve never gadflied before, but I would like to see the termination of this practice.\n\n\n\nI am told the directive comes from the Marketing silo, and no one has the authority to do anything about it anywhere else in the company.\n\n\n\nI believe the Board should be asked this question, because I simply do not see how this reflects the fiduciary interests of shareholders.\n\n\n\nMy evidence can be found at the following links:\n\n\n\nSpreadsheet: https://docs.google.com/spreadsheets/d/1fJGBPc-XGnIS9SH3Abm1ozmpyaDUss\\_AnRpVh3HXukQ/view\n\n\n\nSource for revenue figures: https://youtu.be/KJ4LyuqM\\_fI\n\nSource for cost figures: https://youtu.be/yJMJyTUBpJM?t=655s\n\n\n\nAll this information is based on figures communicated directly to me in my capacity as a Comcast customer by Comcast itself.\n\n\n\nAgain, really just a customer with a home office who’s really annoyed.\n\n\n\nBut, I think there is a valid shareholder concern here, and I encourage someone to ask these questions at the meeting.  I didn’t find out in time.\n\n\n\nIf you get an answer, I still have two weeks to decide if I want to keep my service.\n\n\n\nSincerely Thanks,\n\nAubrey Ellen Shomo\n\n\n\nFinancial Disclosure: I own one share of Comcast, CMCSA, purchased for $38.78 on May 30, 2024 at 2:57 PM ET.  I have a financial interest in a non-publicly-traded Comcast competitor.  I do this analysis, and ask this question, as an individual Comcast Business Customer, paid from my own pocket, and speak only for myself.  I am not representing my employer, and my statements reflect my personal views and experiences only.  Check my work.",
  "link_flair_text": "DD",
  "id": "1dbswl4",
  "num_comments": 13,
  "created_utc": 1717937098,
  "permalink": "/r/wallstreetbets/comments/1dbswl4/cmcsa_annual_meeting_question_missed_my_share/",
  "comments": [
    {
      "id": "l7t3e8b",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 10 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dbswl4/cmcsa_annual_meeting_question_missed_my_share/l7t3e8b/",
      "created": 1717937102,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7t43zf",
      "score": 20,
      "body": "Ask them if they're gonna leverage AI to make Xfinity subscription even more humanly impossible to cancel",
      "permalink": "/r/wallstreetbets/comments/1dbswl4/cmcsa_annual_meeting_question_missed_my_share/l7t43zf/",
      "created": 1717937453,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7tn6d9",
      "score": 10,
      "body": "Too many words.",
      "permalink": "/r/wallstreetbets/comments/1dbswl4/cmcsa_annual_meeting_question_missed_my_share/l7tn6d9/",
      "created": 1717945453,
      "depth": 0,
      "replies": [
        {
          "id": "l7z6zgx",
          "score": 3,
          "body": "i asked chatGPT to summarize and it told me to fuck off",
          "permalink": "/r/wallstreetbets/comments/1dbswl4/cmcsa_annual_meeting_question_missed_my_share/l7z6zgx/",
          "created": 1718034398,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7tb841",
      "score": 6,
      "body": ">If I do not return the equipment, it’s $150 per device, for a total of $300.\n\nIt doesn't cost them anywhere near that much.  Cheaper by a factor of 3-5 or more.\n\n\n>How do the shareholders benefit from buying all this gear no one wants and forcing it upon literally every account?\n\nSome people don't return it and default into the service.  Perhaps many or most.\n\n\n>Are these bundled services used to establish any financial metrics that the Board relies upon for financial reporting purposes? \n\nProbably, at least as potential revenue as trial periods expire\n\n\n>do I have a live one here?\n\nNo.",
      "permalink": "/r/wallstreetbets/comments/1dbswl4/cmcsa_annual_meeting_question_missed_my_share/l7tb841/",
      "created": 1717940707,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7trfps",
      "score": 4,
      "body": "Man I hate Comcast with a passion. If I had the money of a hedge fund I would be making it my sole goal in life to short their stock into the ground.",
      "permalink": "/r/wallstreetbets/comments/1dbswl4/cmcsa_annual_meeting_question_missed_my_share/l7trfps/",
      "created": 1717947025,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7tgi47",
      "score": 2,
      "body": "Anyone can ask anything during meetings and anyone can get into meetings, I think you should get in there and ask it yourself.",
      "permalink": "/r/wallstreetbets/comments/1dbswl4/cmcsa_annual_meeting_question_missed_my_share/l7tgi47/",
      "created": 1717942889,
      "depth": 0,
      "replies": [
        {
          "id": "l7wmya4",
          "score": 1,
          "body": "[https://materials.proxyvote.com/Approved/20030N/20240401/NPS\\_571540/images/Comcast\\_Corporation-Proxy2024.pdf](https://materials.proxyvote.com/Approved/20030N/20240401/NPS_571540/images/Comcast_Corporation-Proxy2024.pdf)\n\nPer the notice of meeting, the meeting is online-only.  There's nowhere to fly, look nice, and accidentally end up in front of a mic before they can throw you out, preventing them from doing so.\n\nThe meeting is only in this virtual location: [https://east-comcast.onlineshareholdermeeting.com/vsm/web?pvskey=CMCSA2024](https://east-comcast.onlineshareholdermeeting.com/vsm/web?pvskey=CMCSA2024)\n\nIt says:\n\n> COMCAST CORPORATION is hosting a Virtual Shareholder Meeting on Monday, June 10, 2024 at 09:00 AM, Eastern Time, and the shareholders of record will be able to vote and ask questions online during the meeting. If you would like to attend the virtual meeting and have your control number, please log in 15 minutes prior to the start of the meeting.\n\nI don't have a control number.  I don't think I can crash it without violating at least CFAA and probably it'd be even harder and take some kind of hacking.\n\nI can't get in.  I need a proxy.",
          "permalink": "/r/wallstreetbets/comments/1dbswl4/cmcsa_annual_meeting_question_missed_my_share/l7wmya4/",
          "created": 1717986218,
          "depth": 1,
          "replies": [
            {
              "id": "l7wnjb5",
              "score": 2,
              "body": "I know it says that, but I’ve sat in on multiple shareholder meetings and to get in it never requires u to put in a control number or prove your a shareholder. And to ask questions u just usually hit a number when they ask for questions at the end and get in a queue. Comcast I guess might be different, but you should still try.",
              "permalink": "/r/wallstreetbets/comments/1dbswl4/cmcsa_annual_meeting_question_missed_my_share/l7wnjb5/",
              "created": 1717986461,
              "depth": 2,
              "replies": [
                {
                  "id": "l7woppo",
                  "score": 1,
                  "body": "Well if I can just hit a button, then sure.  I'll definitely give it a try.  I am, after all, a shareholder.",
                  "permalink": "/r/wallstreetbets/comments/1dbswl4/cmcsa_annual_meeting_question_missed_my_share/l7woppo/",
                  "created": 1717986941,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7woy8r",
                      "score": 1,
                      "body": "I have faith in you, and if it works out tell em they need to step up their game when it comes to peacock.",
                      "permalink": "/r/wallstreetbets/comments/1dbswl4/cmcsa_annual_meeting_question_missed_my_share/l7woy8r/",
                      "created": 1717987042,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l7uivro",
      "score": 1,
      "body": "Idk why people hate Comcast so much, I’ve been a customer for 20 years and never had a complaint.",
      "permalink": "/r/wallstreetbets/comments/1dbswl4/cmcsa_annual_meeting_question_missed_my_share/l7uivro/",
      "created": 1717956741,
      "depth": 0,
      "replies": []
    }
  ]
}