{
  "title": "With decline in smartphone sales, how is AAPL poised to tackle this?",
  "score": 263,
  "selftext": "We are seeing [decline](https://www.npr.org/2024/05/03/1248865513/apple-quarterly-decline-iphone-sales) in smartphone sales year over year. I expect sales to rise somewhat this year with AI featured iphones but phones are becoming more like PCs with lengthy replacement cycles and less people interested in buying the latest version. Can Apple's appstore and other services revenues would be enough to offset the declining sales year over year? What could the market look like in 5-10 years. \n\nWe are depending on future Apple Vision pro being slimmer and and more affordable but even then unless it's literally rayban glasses sized and it has an interface which is faster than phones, it can never have mass popularity. With so much of their fortune tied in iphone sales, it's not hard to imagine that Apple could trade sideways for many years to come. (until they make the next big thing maybe?)",
  "link_flair_text": "Company Discussion",
  "id": "1dc50zo",
  "num_comments": 154,
  "created_utc": 1717969139,
  "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/",
  "comments": [
    {
      "id": "l7vjdg0",
      "score": 332,
      "body": "It’s services.  \n\nRight. Now it’s somewhere around 20 percent of revenues but the gross margins are 70 plus percent. As all the kids who grew up in the apple ecosystem become adults, services revenue is going to keep growing even as device revenues slow.  And those are some tasty margins. \n\nMy kids don’t even think to carry a credit card around, they just assume everything will take Apple Pay.\n\nThey are just getting started in tv offerings.  \n\nOn the other hand they are so big it’s hard to move the needle.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vjdg0/",
      "created": 1717969840,
      "depth": 0,
      "replies": [
        {
          "id": "l7wcqu2",
          "score": 10,
          "body": "I like to hike.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wcqu2/",
          "created": 1717981974,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7w3fl9",
          "score": 14,
          "body": "Majority of services revenue is google TAC which is no guarantee to continue pending lawsuits with the DOJ",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7w3fl9/",
          "created": 1717978082,
          "depth": 1,
          "replies": [
            {
              "id": "l7wdekr",
              "score": 15,
              "body": "According to one article, if you take out the estimated google payments completely, the services margins go down to about 49 percent. \n\n49 percent margins are still pretty great, but not Xanadu. \n\nhttps://finance.yahoo.com/news/apples-85-billion-services-business-121500208.html",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wdekr/",
              "created": 1717982241,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l7vmg4u",
          "score": 64,
          "body": "And developers and  companies are fighting back against that huge cut that they have to pay on the App Store. The service model isn’t gonna work so well eventually.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vmg4u/",
          "created": 1717971065,
          "depth": 1,
          "replies": [
            {
              "id": "l7w37ox",
              "score": 39,
              "body": "You think but look at the PC marketplace and steam. Sometimes it gets too difficult when you make ease a boon",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7w37ox/",
              "created": 1717977990,
              "depth": 2,
              "replies": [
                {
                  "id": "l7w6mfb",
                  "score": 21,
                  "body": "Steam has less competition - nothing else on PC comes close and consoles are not direct comparables\n\nOn the other hand, Apple competes directly against Android, which has a stronger market share pretty much everywhere outside of the US - which incidentally is where all the demographic growth over the next few decades will come from",
                  "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7w6mfb/",
                  "created": 1717979417,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7x6sd7",
                      "score": 15,
                      "body": "Steam has plenty of competition, they just all suck ass because they're nowhere near as user friendly and easy to use. Epic is the closest comparison, but it's still trash.",
                      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7x6sd7/",
                      "created": 1717996128,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l7ypzbp",
                          "score": 2,
                          "body": "\"Steam has tons of competition. They're just so bad that they don't actually compete\" lol",
                          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7ypzbp/",
                          "created": 1718028418,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l7yrcpx",
                              "score": 8,
                              "body": "Hey man, I said tons of competition, not tons of *good* competition ",
                              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7yrcpx/",
                              "created": 1718028928,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l7xi9vx",
                      "score": 7,
                      "body": "Steam has competition - the consoles. You need to switch hardware to use Android, so that comparison is only fair",
                      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7xi9vx/",
                      "created": 1718003550,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l7xrynk",
                          "score": 3,
                          "body": "Not exactly, there I‘d say there is more „console loyalty“ between PC, Xbox,… than brand loyalty between Apple and Android.",
                          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7xrynk/",
                          "created": 1718010698,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l7xutis",
                          "score": 3,
                          "body": "Nobody bought the new consoles. At least compared to the old ones. Worst generational progression rate for new consoles in my entire life. PC is growing and will widen the gap soon, consoles are a thing of the past for most actual gamers now.",
                          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7xutis/",
                          "created": 1718012810,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l80zild",
                              "score": 3,
                              "body": "Finally, the PC master race will take its rightful place as imperator of the console wars!",
                              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l80zild/",
                              "created": 1718056113,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "l81q3bd",
                              "score": 1,
                              "body": "Nintendo Switch on the way to beat PS2 sales record...you're saying? PS5 and XBOX don't do so well though.",
                              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l81q3bd/",
                              "created": 1718066637,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l82zox7",
                                  "score": 0,
                                  "body": "First of all, switch is a handheld, not a console. Not a real competitor to PC. Still 20 million short of ps2, and we were talking about competition with steam, which nintendo does not do in any way. They are entirely separate markets. Plus games like palworld on steam have already outsold the latest pokemon games. Nintendos grip on the market is weakening too",
                                  "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l82zox7/",
                                  "created": 1718089452,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l834o9s",
                                      "score": 0,
                                      "body": "Wrong. Switch is BOTH a console and handheld. I play my Switch mostly in console mode. 20 million is small number. Switch can easily reach that in another year or 2, And they are not separate markets, there are way too many crossovers. palword? Never heard of it. Lol. Consoles is certainly not a thing of the past. In fact, moving foward, with the crazy prices of CPU and GPUs going ever higher due to AI demand, consoles might be the only place you can play games in the future without asking for a house loan.",
                                      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l834o9s/",
                                      "created": 1718093068,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l8474yw",
                                          "score": 1,
                                          "body": "Switch is not an actual comparison to a PC. There are almost no games available on both platforms. They are entirely separate. And house loans to build a PC? Lmao. The reason PC has gotten so popular is for a only a couple hundred extra over a console you can have more than double or triple the power, and can even get hardware that's future-proofed for MUCH longer than console. The new consoles have sold horribly due to this. All my friends bought PCs instead of the current Gen consoles. And the stats prove that's part of a wider scale movement.",
                                          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l8474yw/",
                                          "created": 1718114246,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l7xp2tq",
                      "score": 5,
                      "body": "This, Steam came in early. But competition exists. Epic, GoG, literally every dev trying to break free with their own launcher to end up falling back into line with Steam. Steam just has great customer service, sales, and a pretty easy to use UI",
                      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7xp2tq/",
                      "created": 1718008518,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l7wwuvq",
                      "score": 1,
                      "body": "As Apple’s services business grows the pressures for more acquisition will lead them to making more Android apps, the competition on those fronts isn’t necessarily Android so much as it is YouTube (and Spotify, and Netflix, etc) and to compete they’ll need to be cross-platform",
                      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wwuvq/",
                      "created": 1717990711,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l7wl9bv",
          "score": 2,
          "body": "Even their cloud service has become essential for me since all the photos get backed up; I don't even use a mac per se but I have 2TB of data.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wl9bv/",
          "created": 1717985516,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7y3l35",
          "score": 3,
          "body": "What's odd to me is people (particularly younger people) swear by iPhone and won't even look at Android devices...\n\nThen load GMail, Waze/Google Maps, Chrome and Google Drive on their iPhone. The only native apps they seem to use is for payment and music.\n\nSo, most iPhones still generate revenue for Alphabet. I don't think the reverse is the same?",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7y3l35/",
          "created": 1718018367,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7wh0bn",
          "score": 3,
          "body": "Roughly 40% of all Apple hardware sold is booked as “services” due to amortization of value, even if it’s actually a hardware sale in the first place. \n\nSuffice to say, they need to keep selling more iPhones to get service revenue to keep growing as fast.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wh0bn/",
          "created": 1717983763,
          "depth": 1,
          "replies": [
            {
              "id": "l7x8vsi",
              "score": 1,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7x8vsi/",
              "created": 1717997392,
              "depth": 2,
              "replies": [
                {
                  "id": "l7xs05g",
                  "score": 1,
                  "body": "Company 10k",
                  "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7xs05g/",
                  "created": 1718010729,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l7yc5u4",
                  "score": 1,
                  "body": "The 10k",
                  "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7yc5u4/",
                  "created": 1718022708,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l7wy87i",
          "score": 0,
          "body": "Apple ecosystem is in trouble tho, the DOJ in the US, the DMA in Europe... There are lot of incertitude around how they can keep going with those services as a 100% closed system.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wy87i/",
          "created": 1717991408,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7x6092",
          "score": 0,
          "body": "The problem is their only decent service is music. Everything else sucks. They news is a joke, fitness is ehh, Apple TV only has 1-2\nGood movies or shows, what else. Oh yeah iCloud storage scam is always a money maker. Apple Arcade? Not bad but the offering inside is ehh.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7x6092/",
          "created": 1717995670,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7vskb5",
          "score": -18,
          "body": "Apple isn't a service company, they rely on third parties to offer services on their platforms (all apps) and the few ones they do offer are from bad (iTunes) to worse (Apple TV) and not getting one single customer outside loyal Apple fans.\n\n\n\nTheir main problem, however, is that the new generation doesn't find tech \"scary and difficult\". Kids grow up with smartphones, tablets, laptops and hence are born and raised on a *Windows* environment and this *Android* comes natural because they want *freedom of choice*. Apple is still strong amongst the 50+ crowd, women especially, but world wide they're losing hard to Android.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vskb5/",
          "created": 1717973539,
          "depth": 1,
          "replies": [
            {
              "id": "l7vsvw6",
              "score": 21,
              "body": "Worldwide android wins because android is sold on really really cheap devices. It’s also on nice ones, but the volumes worldwide are from cheap devices.  \n\nAnd the youth in the developed world is on iPhone by a large margin.",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vsvw6/",
              "created": 1717973669,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l7vzi28",
              "score": 11,
              "body": "9/10 US teens have iPhones. You are woefully misinformed",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vzi28/",
              "created": 1717976430,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l7wi49q",
              "score": 5,
              "body": "Apple is always either first or barely second in the premium smartphone market. \n\nThe size of the premium smartphone market corresponds very directly to the general economy of a country. \n\nThat correlation shows that people generally are buying the most phone they can afford. When they can afford both Apple and Android phones, they largely choose Apple. The reason Android has a higher market share is (for the vast majority of people) down to cost. Most people don’t care about the freedom of choice. \n\nJust see how quickly Apple is growing in India now that customers don’t need to pay foreign import taxes. \n\nAlso your comment on demographics is very wrong. Most American teens , and teens across affluent countries prefer Apple. In the US, it’s something approaching 90% of teens.",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wi49q/",
              "created": 1717984219,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l7vxvce",
              "score": 2,
              "body": "So much of what you said is just simply wrong.\n\n>19.10.2023 — 87% of US teenagers owned an iPhone, 88% would buy again, a new survey shows  \nhttps://www.phonearena.com/news/us-teenagers-love-the-iphone_id151471\n\n>23.02.2024 — Apple's iPhone revenue in India rose 42% YoY in 2023 to $8.7B  \nhttps://timesofindia.indiatimes.com/gadgets-news/move-over-europe-india-is-apples-brightest-new-iphone-star/amp_articleshow/107944056.cms\n\n\nThere are enough [Android users](https://www.reddit.com/r/AppleMusic/comments/1ay6kln/will_society_accept_me_if_i_use_apple_music_on_my/) that enjoy Apple Music and their most important most sticky subscriptions service is their iCloud plan.",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vxvce/",
              "created": 1717975745,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l7w3f34",
              "score": 2,
              "body": "You don’t think youmg people covet apple products?",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7w3f34/",
              "created": 1717978076,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l7vt3kb",
              "score": -2,
              "body": "Jeez, fanboy much?",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vt3kb/",
              "created": 1717973755,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l7vpbvm",
          "score": -26,
          "body": "So because your kids use apple pay it's all good? Solid analysis.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vpbvm/",
          "created": 1717972230,
          "depth": 1,
          "replies": [
            {
              "id": "l7vrulh",
              "score": 16,
              "body": "No, it's all good because 87% of American teens have an iPhone. As that group ages, it will become increasingly easier for Apple to sell its services to Americans.",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vrulh/",
              "created": 1717973252,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l7vqd7v",
              "score": 22,
              "body": "Why ignore everything else he said? His kids were an example of one of like 6 things mentioned",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vqd7v/",
              "created": 1717972654,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l7vuttc",
              "score": -14,
              "body": "[removed]",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vuttc/",
              "created": 1717974472,
              "depth": 2,
              "replies": [
                {
                  "id": "l7wbecx",
                  "score": 1,
                  "body": "87% of all American teens have iPhones",
                  "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wbecx/",
                  "created": 1717981408,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l7vkqnr",
      "score": 55,
      "body": "First of all, Apple has an insane revenue regardless of their decline in iPhone sales. There are still other services and products that Apple is able to innovate and earn well with. Their headphones alone changed the industry and pushed bluetooth more into the forefront of what people expected. While Vision Pro was an initial flop, it reminds me of when Apple released the iPad a few years ago and the reception was really lukewarm. No one understood the point of an oversized iPod Touch. The most common point raised about it was \"well it can't really do anything\" and yet years later tablets and the iPad are both essential products in modern society. \n\nApple is lucky to have such amazing financials in general, it means that the stock would have no issue shifting from a growth stock to paying a dividend off it's stellar numbers. Especially considering that year over year they will have to replace iPhones even if the cycles become longer per consumer. iPhones are basically generational branding at this point. The blue text icon alone changes the way people perceive each other, it is ingrained in our minds to look for that now and it keeps people in iPhones. \n\nBeyond that, remember that Apple and iPhone are the MINORITY still when it comes to the smartphone market. The rest of the world is predominantly Android, especially in emerging countries. As new countries gain a stronger foothold with consumer dollars, their consumers will want to eventually adopt iPhones and Apple products. Apple still has markets to penetrate with it's products when the timing is right. \n\nSo there is still market for Apple to pick up on, they have strong products in different non-competing areas of technology, and they have a rabid fanbase that passes their own love for Apple products into the next generation of users they raise. The Vision Pro is still a very impressive piece of technology even if it was a failure after launching. \n\nHOWEVER, if Apple wants to maintain it's dominant status, the guys at the top need to really be thinking long term strategy here. Apple has done this in the past with their products. While they took a recent loss with the Vision Pro, expect that they are investing to make it a better product because the idea is still a good one on paper. \n\nWith that said, I sold out of my Apple positions earlier this year. While I like the growth it got me in the past, I don't believe that the guys at the top are thinking correctly for long term growth. It feels like there has been a trend in tech to find one person that innovates and then hop on it to increase short term evaluations. Apple used to be the company that innovated first. They did so with the iPod, the iPhone, the iPad. They attempted to do so with the Vision Pro even though Meta has been quietly humming along in the space. They probably thought they could do with the Vision Pro what they did with AirPods where they could apply \"Apple\" to a good idea and make it even better. I think they still have a shot with it, but I also think that to get there it would take years of planning and calculation and I don't buy into the leadership at Apple today being fully capable of doing that which is why I sold out of them. If you believe that the leadership at the top of Apple does have a plan with their product roadmap and recognizes their ability to execute on the right type of wearable technology for the future then by all means purchase their stock. If you like the insane revenue numbers that Apple puts up every year and believe that they would safely transition to a dividend stock, by all means pick them up.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vkqnr/",
      "created": 1717970380,
      "depth": 0,
      "replies": [
        {
          "id": "l7wdgsx",
          "score": 15,
          "body": "I like to hike.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wdgsx/",
          "created": 1717982267,
          "depth": 1,
          "replies": [
            {
              "id": "l7zffj5",
              "score": 1,
              "body": "I was historically long in Apple but sold when their revenue growth stalled. I've been back in since just before last earnings and I took a small stake in AAPU, which I'll sell pretty soon, because the longer you hold leveraged assets, the more money you lose. \n\nI think one last thing today will be a better Suri. I really want them to announce their own energy efficient server LLM Asics for inference, one of the many many completely unconfirmed rumors out there. \n\nI am ambivalent about the fact that Apple may restrict some or all of their new AI offerings to this year's iPhone, because it's easy to quantize an LLM for less accuracy given a smaller and slower NPU. If so, what has Apple been doing putting NPUs in every phone? But, what irks me as a consumer is probably better for the stock as an investor.",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7zffj5/",
              "created": 1718037249,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l7w1ig7",
          "score": 18,
          "body": "I am extremely bullish on the Vision Pro. Over time, the device should get smaller, faster, more immersive, a have cheaper models available. I think the company that gets advanced haptic tech working the best will have a huge advantage. I hope their leadership realizes this.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7w1ig7/",
          "created": 1717977275,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7w70lc",
          "score": 9,
          "body": "I don’t remember the iPad being received in a lukewarm manner. It was an instant hit upon release.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7w70lc/",
          "created": 1717979581,
          "depth": 1,
          "replies": [
            {
              "id": "l7wo7d9",
              "score": 15,
              "body": "They are right, most people I know thought it was dumb when it came out.",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wo7d9/",
              "created": 1717986727,
              "depth": 2,
              "replies": [
                {
                  "id": "l7xcubb",
                  "score": 2,
                  "body": "Anecdotally, my group of people also had this reaction. Especially the “it’s just an oversized iPod touch”\n\nBut as the software around them improved, there actually was a huge use-case for small form factor laptops that did hunting and pecking really well.  If you want to write a novel or do some solid excel, get a real laptop. \n\nAt least that was the attitude I remember from the era.\n\nI really wonder if the Vision Pro will find its place as a predominantly solo device.  Everyone can watch YouTube on an iPad on a coffee table. But not every player can afford $3500 to join in the AR fun",
                  "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7xcubb/",
                  "created": 1717999889,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l7wzckj",
                  "score": 1,
                  "body": "It was the original IPhone that people thought was dumb I got one for my g/f now wife one and could not stop hearing how dumb it was till she started using hers.\nThe iPad was a instant success",
                  "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wzckj/",
                  "created": 1717991987,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7x6gi0",
                      "score": 4,
                      "body": "I'm just telling you what I experienced, you can't prove that wrong to me lol",
                      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7x6gi0/",
                      "created": 1717995936,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l7wtpx9",
          "score": 5,
          "body": "Bluetooth headphones were around before apple came out with them. 50 cent had a pair that came out years before and they were dope.\n\nIn fact, apple is known for being slow at innovating. They just don’t miss and that’s what makes them successful. For example they come out with 1 new phone a year. Huawei, a Chinese mobile phone manufacturer, comes out with a new phone every 3 months.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wtpx9/",
          "created": 1717989191,
          "depth": 1,
          "replies": [
            {
              "id": "l7x4qb6",
              "score": 2,
              "body": "This goes for the watch and tags equally. 3 product classes they completely usurped within a few years.\n\nThey'll absolutely do the same with the Vision Pro when they release a product for the mainstream consumer. You can argue about the volume of that market eventually, but Apple ending up owning it is completely certain.",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7x4qb6/",
              "created": 1717994935,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l7y2cv0",
              "score": 2,
              "body": "that wasn't the point around mentioning bluetooth headphones in my post.",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7y2cv0/",
              "created": 1718017667,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l7vwke7",
      "score": 17,
      "body": "No need to tackle this, people still need new phones every 4-5 years.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vwke7/",
      "created": 1717975200,
      "depth": 0,
      "replies": [
        {
          "id": "l7zhs2b",
          "score": 2,
          "body": "Yeah, right. I think that although sales are down, demand is not, it’s just that the cycle is long.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7zhs2b/",
          "created": 1718038038,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7y5f9x",
          "score": -8,
          "body": "They won’t be apple",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7y5f9x/",
          "created": 1718019368,
          "depth": 1,
          "replies": [
            {
              "id": "l7yntrz",
              "score": 6,
              "body": "Everything I've seen over the last few years has shown that iPhones are slowly gaining more marketshare over Android in most places. The youth generation in the US leans way more heavily towards iPhones than the older generation for example. Even in countries where the iPhone is way less popular it's been gaining in market share to.",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7yntrz/",
              "created": 1718027607,
              "depth": 2,
              "replies": [
                {
                  "id": "l7zkzw0",
                  "score": 0,
                  "body": "Is that why iphone has been losing worldwide marketshare for 5 quarters in a row?",
                  "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7zkzw0/",
                  "created": 1718039109,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l7x6du9",
      "score": 7,
      "body": "This is the perfect time for an even better SE phone line. I know tons of people holding off on phones because of the high prices. ",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7x6du9/",
      "created": 1717995892,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7vm6k7",
      "score": 17,
      "body": "They need to have attachments build into their phone. I can't even connect my pocketpussy 9000 into my new iphone 15.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vm6k7/",
      "created": 1717970956,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7vspz9",
      "score": 16,
      "body": "Gotta buy more apple when Reddit said it’s over it always pumps been in apple for years love it. Innovation will continue earnings will continue to do well.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vspz9/",
      "created": 1717973603,
      "depth": 0,
      "replies": [
        {
          "id": "l7ypwr2",
          "score": 3,
          "body": "I sold my APPL shares at market open. You're welcome.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7ypwr2/",
          "created": 1718028390,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7w1vgi",
      "score": 3,
      "body": "See my comment about features but my guess is the next “innovation” is probably just a rebranded and rehashed “Siri” that phones home using APIs to Apple servers running NVidia chips using GPT to give answers. There will be an initial boon in sales but as the luster wears off sales will level out. The issue is that we’ve proven time and time again that we don’t like talking to our electronic devices. It’s not a social norm either. People will still be drawn to the initial gimmick but it won’t last. \n\nI think the other issue is phones cost thousands of dollars now. My wife’s 6 year old iPhone is running perfectly fine even with modern apps. I don’t think either of us will replace our devices anytime soon.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7w1vgi/",
      "created": 1717977428,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7wxi51",
      "score": 3,
      "body": "The next big thing is going to be AI and Apple will nail it. As AI grows in popularity & use, people will need to be more connected than ever and they will do that through their phone. If future products come out consumers will be loyal to Apple and their ecosystem.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wxi51/",
      "created": 1717991039,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7vsld6",
      "score": 18,
      "body": "Rule number 1.  DONT BET AGAINST APPLE. Rule #2. SEE RULE #1",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vsld6/",
      "created": 1717973550,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7vk1k1",
      "score": 26,
      "body": "I’m bearish on Apple’s consumer product growth. The Vision Pro is going the way of the 3D TV, Xbox Kinect and the HD DVD. The Apple Car didn’t pan out.\n\nIt seems like Apple grabbed up all of the low hanging fruit in the consumer electronic space with phones, earphones and watches and they’re looking for the next technology to perfect but nothing is there.\n\nThey’re falling behind in AI, and just overall not pioneering in any significant space right now. AI is growing so fast that I’m not sure Apple’s signature move of being the “better 2nd” is going to work in that space.\n\nWithout a new avenue to grow into their business is going to stagnate like Intel, IBM, or Coca Cola.\n\nI just don’t see anything that makes me excited to invest in Apple. They’re out of ideas and their $100B stock buyback kind of proves that. Their services may grow but do solid services justify a 3T market cap? I don’t think so.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vk1k1/",
      "created": 1717970104,
      "depth": 0,
      "replies": [
        {
          "id": "l7w7d40",
          "score": 8,
          "body": "> They’re out of ideas and their $100B stock buyback kind of proves that.\n\nLol, you do know Apple always been buying back shares, right? I would be worried if they didn’t.\n\n- $75 billion in 2019\n- $50 billion in 2020\n- $90 billion in 2021\n- $90 billion in 2022\n- $90 billion in 2023",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7w7d40/",
          "created": 1717979728,
          "depth": 1,
          "replies": [
            {
              "id": "l7w8zae",
              "score": 4,
              "body": "Doubling buy-backs to $90B during a period of zero percent interest rates, when it was dirt cheap to borrow and invest capex for growth, is not a bullish signal to me.",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7w8zae/",
              "created": 1717980397,
              "depth": 2,
              "replies": [
                {
                  "id": "l7w9o0m",
                  "score": 9,
                  "body": "https://www.statista.com/statistics/273006/apple-expenses-for-research-and-development/#:~:text=Apple%20Inc.,billion%20from%20its%202022%20total.\n\nThey’re not skimping on R&D spend as well. I’m just saying, the 100B buy back is not out of the ordinary for Apple.",
                  "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7w9o0m/",
                  "created": 1717980689,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l7vwq7i",
          "score": 5,
          "body": "Same.  My portfolio was heavy in aapl and I rebalanced this year.  I have some calls sitting for wwdc but honestly probably going to cash it in and not exercise.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vwq7i/",
          "created": 1717975269,
          "depth": 1,
          "replies": [
            {
              "id": "l7yxkr3",
              "score": 2,
              "body": "Similar story for me, I trimmed probably close to 40% of my AAPL holdings and put it into other things.\n\nI don't want to completely exit the position, but at the same time I can't deny that Apple is trading too rich right now despite it having very little growth for the last 3 years, and having no real catalysts for increasing that growth in the near future (I sold before the Vision Pro was even out because I never had any faith that it would be a success).",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7yxkr3/",
              "created": 1718031165,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l7vl8hp",
          "score": 8,
          "body": "This was always going to happen. I’m not sure why people are surprised.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vl8hp/",
          "created": 1717970576,
          "depth": 1,
          "replies": [
            {
              "id": "l7vm0t6",
              "score": -2,
              "body": "And yet people have just kept piling their money in this stock. The next 5 years for Apple have the potential to look garbage compared to the last 10 if things keep moving like they are.",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vm0t6/",
              "created": 1717970891,
              "depth": 2,
              "replies": [
                {
                  "id": "l7vmlti",
                  "score": 6,
                  "body": "You mean piling money into the S&P 500.",
                  "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vmlti/",
                  "created": 1717971128,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l7we0kg",
          "score": 2,
          "body": "I like to hike.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7we0kg/",
          "created": 1717982496,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7yxrwp",
          "score": 2,
          "body": "Think this is too harsh.  They are still the premium consumer Electronic brand, and they have rich culture in corporate consumers.  \n\nVision Pro should be treated as is first gen product.  I think VR/AR is just a space Consumer Electronics is never going to fill in any time soon.  Price is too expensive.  They went away from the minimal design with VP, and I think that is why it is failing.  Something along the lines of Meta/Rayband glasses was the right call.  \n\nThey are still #1 in Phones and wearables.\n\nThey have money printing store and moving in payment systems.  \n\nThey have a great moat and consumer loyalty.  \n\nLets be real the Apple Car was a Fun R/D that they were hoping to get more tech.  But Auto Space is not consumer space, and Apple is right to stay away.  \n\nThere's still plenty of room in Consumer Electronics for Apple to grow, but they figured out the real money is Apps.  And only Google is really competing there, and Apple is still #1.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7yxrwp/",
          "created": 1718031234,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7vw039",
          "score": 5,
          "body": "casually saying “they’re out of ideas” is wild. they have consistently come out with products that defined generations - who saw the ipod or the iphone coming? \n\nI’m not an Apple fanboy or anything, but I’m sure they’ve got some pretty cool ideas in R&D.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vw039/",
          "created": 1717974962,
          "depth": 1,
          "replies": [
            {
              "id": "l7w4lff",
              "score": 7,
              "body": "iPod: 22 Years ago. \n\niPad: 14 Years ago.\n\niWatch: 9 Years ago.",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7w4lff/",
              "created": 1717978574,
              "depth": 2,
              "replies": [
                {
                  "id": "l7w7f7c",
                  "score": 6,
                  "body": "So? Apple Pay was a game changer and a huge money maker for them. The App store pretty much created an open source marketplace for developers. The Macbook Air was really sexy when it first came out compared to clunky ass PC laptops. All my graphic designer friends swear by the ipad pro.",
                  "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7w7f7c/",
                  "created": 1717979754,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l7we3ty",
                  "score": -2,
                  "body": "I like to hike.",
                  "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7we3ty/",
                  "created": 1717982534,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l7wxbaw",
          "score": 1,
          "body": "A few thjng they are researching on its kind of interesting is attaching more sensors to things like the watch and AirPods like glucose monitor, blood pressure etc - if any of these pan out it. Even real time blood monitor has now just pass fda to be able to sell otc coming this summer so in theory the watch can even just sell the watch with something like this.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wxbaw/",
          "created": 1717990942,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7yqf5d",
          "score": 1,
          "body": "Imagine holding APPL from one year ago. You're only up by 6% compared to other tech stocks. \n\nI feel like APPL is a good stock to trade at support and resistance levels. When it hits support levels, buy. When it hits resistance levels, sell. Repeat.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7yqf5d/",
          "created": 1718028581,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7x2az5",
          "score": 1,
          "body": "So, are you short the stock or?  Seem pretty confident that it's a loser so if you're not short, how come and of you are, what's your cost basis on the short position?",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7x2az5/",
          "created": 1717993574,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7wd985",
      "score": 2,
      "body": "If smartphone  sales are declining what are they being replaced with?",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wd985/",
      "created": 1717982180,
      "depth": 0,
      "replies": [
        {
          "id": "l7y15i2",
          "score": 6,
          "body": "Phones are not really progressing like they used to. There is very little reason to get the latest phone, when phones from a few generations ago aren't that much worse.\n\nSo instead of upgrading their phone every 2 years like they used to, people are now keeping their phones for longer.\n\nIt's sort of like what happened with PCs. People used to upgrade PCs every 2 years, now its more like every 5-6 years.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7y15i2/",
          "created": 1718016958,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7wdq97",
      "score": 2,
      "body": "iPhone sales have been declining for years. How have they handled it so far?",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wdq97/",
      "created": 1717982377,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7wgcmu",
      "score": 2,
      "body": "something with AI",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wgcmu/",
      "created": 1717983490,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7ww6f5",
      "score": 2,
      "body": "As long as there continues to be people with too much money, Apple will figure out a way to take it off their hands.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7ww6f5/",
      "created": 1717990373,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7xrfgu",
      "score": 2,
      "body": "there nothing really new i went from a 12 pro to a 15 pro and nothing really new from my point of view im just paying another 1000 bucks for what",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7xrfgu/",
      "created": 1718010296,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7zfpmi",
      "score": 2,
      "body": "Don't expect any groundbreaking hardware to affect profits. Smartphones are already sufficiently \"smart\" for most peoples needs, and the public has reacted without much enthusiasm for most of the last several smartphone iterations because they don't add anything groundbreaking and are just getting further overengineered ar this point. VR doesn't slap with the public and never has. I see apple primarily towing the line for the forseeable future",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7zfpmi/",
      "created": 1718037345,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7vyslp",
      "score": 3,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vyslp/",
      "created": 1717976130,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7wdg7v",
      "score": 4,
      "body": "AI is basically bloatware… It won’t drive any new sales, maybe even drop sales somewhat because it may come with an incremental price hike for each phone. It’s still 5-10 years out from actually doing anything revolutionary or truly intriguing and useful to get the average citizen interested in any product utilizing AI.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wdg7v/",
      "created": 1717982260,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7w3219",
      "score": 2,
      "body": "As long as kids think Androids are \"ghetto\" and iPhones are the luxury brand, I will forever remain bullish on Apple.\n\nThat being said Apple knows the party is \"over\" in terms of relying on revenue from people buying new iphones every year the beefier hardware isn't worth it just to access instagram and youtube 1 nanosecond faster. Same goes for the laptop and ipad line up.\n\nSo you seen a counter shift in their strategy, they're going all in on services and TV shows to get consumers to keep paying the almighty apple money consistently.\n\nThe only \"bear\" aspect I see is Apple completely missing the AI boat and having to come over and suck on MSFT's ChatGPT just to have some AI aspect on their products.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7w3219/",
      "created": 1717977923,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7vnmf6",
      "score": 1,
      "body": "Stock buy backs, duh!",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vnmf6/",
      "created": 1717971537,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7vqgo9",
      "score": 1,
      "body": "How about lower the price?",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vqgo9/",
      "created": 1717972692,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7wex39",
      "score": 1,
      "body": "Half the searches that were going to google will now go to Siri/chargpt.  If apple can properly monetize ads overlayed in these responses this could be a gold mine for them",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wex39/",
      "created": 1717982876,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7wiwvi",
      "score": 1,
      "body": "It's about time they bring back SD Card slots...",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wiwvi/",
      "created": 1717984546,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7wu9fp",
      "score": 1,
      "body": "By sayin AI 50 times on stage and actually pretty solid chips you can buy for 15 k",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wu9fp/",
      "created": 1717989447,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7wv3bf",
      "score": 1,
      "body": "Sales will rise over the next several years with AI innovations to the iPhone.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wv3bf/",
      "created": 1717989846,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7x1zck",
      "score": 1,
      "body": "Anybody shorting it?  That's who I want to hear from.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7x1zck/",
      "created": 1717993397,
      "depth": 0,
      "replies": [
        {
          "id": "l7xn60c",
          "score": 1,
          "body": "If growth less than S&P then sell but not short.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7xn60c/",
          "created": 1718007087,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7xjk8l",
      "score": 1,
      "body": "Yeah maybe people just dont need 17 new phones every year 🤷🤸",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7xjk8l/",
      "created": 1718004462,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7yepvr",
      "score": 1,
      "body": "Well they’ve just been giving us the same phone for like a thousand years",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7yepvr/",
      "created": 1718023872,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7ywu3z",
      "score": 1,
      "body": "AI \n\nIf they hype it enough and say it enough it solves all problems. \n\nOr publish their own ai chips to sell to meta, X and co",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7ywu3z/",
      "created": 1718030908,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7zb5wv",
      "score": 1,
      "body": "Apple profit margins are stupid high simply.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7zb5wv/",
      "created": 1718035805,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7zs0as",
      "score": 1,
      "body": "It’s a seasonal decline. People now depend on phones more than ever",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7zs0as/",
      "created": 1718041451,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7zsvvk",
      "score": 1,
      "body": "Lots of stock buy backs",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7zsvvk/",
      "created": 1718041736,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7zy57l",
      "score": 1,
      "body": "Apple is a bank.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7zy57l/",
      "created": 1718043468,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l80167n",
      "score": 1,
      "body": "Don't forget about one of their other strong products- the iStockBuyback",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l80167n/",
      "created": 1718044473,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l80mvj5",
      "score": 1,
      "body": "Services.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l80mvj5/",
      "created": 1718051708,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l81ltte",
      "score": 1,
      "body": "Ask PayPal how AAPL can grow  …",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l81ltte/",
      "created": 1718064882,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l820ktf",
      "score": 1,
      "body": "Make cheaper phones. I can’t believe one is more expensive than a high end laptop",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l820ktf/",
      "created": 1718070995,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l84cf1j",
      "score": 1,
      "body": "Apple Intelligence requires iPhone 15 *Pro* and up. That thing gives them at least $999 in revenue each phone they sell. There you go",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l84cf1j/",
      "created": 1718116167,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7vjscb",
      "score": 1,
      "body": "I don’t see apple vision going anywhere fast but especially apple pay will dominate and has bi potential",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vjscb/",
      "created": 1717970003,
      "depth": 0,
      "replies": [
        {
          "id": "l7vkhlh",
          "score": -2,
          "body": "Those dumbass headsets were a pipe dream. In my opinion, they've already failed. Hard. No one wants those.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vkhlh/",
          "created": 1717970280,
          "depth": 1,
          "replies": [
            {
              "id": "l7vuz02",
              "score": 2,
              "body": "Have you actually tried them? There are applications for them, I wear them daily. Also saw a patent for their new glasses. The rumored Vision Pro pictures from like 2020 were almost identical to the real product so the glasses will most likely look identical",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vuz02/",
              "created": 1717974531,
              "depth": 2,
              "replies": [
                {
                  "id": "l7vwo7r",
                  "score": 2,
                  "body": "I have. I bought one for my son. But after it started collecting dust the first week, I returned it. I also played around with it, and found it like a dumbed down, hard to use computer. Every task on it, was much more difficult than my desktop. Plus it gave me a headache and sore eyes real quick.",
                  "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vwo7r/",
                  "created": 1717975246,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7yrxuu",
                      "score": 1,
                      "body": "FYI, no one wanted the first 5 generations of Apple computers because they were dumbed down, hard to use, were more difficult to use than pen and paper, and they collected dust. Then they evolved.\n\nAnd things like headaches / eyestrain will be solved in future models too.",
                      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7yrxuu/",
                      "created": 1718029144,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l7yzcrm",
                  "score": 1,
                  "body": "What kind of applications do you use them for? The only legitimate application I've ever heard for VR headsets and glasses are:\n\n* Video games\n\n* Certain graphical design jobs (like building out curved green screens for actors to film in front of, which became more important during COVID lockdowns).\n\nOutside of those 2 cases I've yet to hear anything else that they can do that you can't do just as well if not better on a laptop or a smartphone. I really scratch my head at how Apple and Facebook insist that people will use VR headsets for office work.\n\nI've never used a VR headset, and as someone who's gotten very dizzy just watching streamers playing VR video games I'll never use one period.",
                  "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7yzcrm/",
                  "created": 1718031783,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7zruu2",
                      "score": 1,
                      "body": "Corporate training and employee onboarding. As adoption grows, imagine store employees applying for a job, and while background check is processed, they have the option to get paid to do onboarding walkthroughs from home so that once paperwork is good to go, they are too. So no more being thrown to the wolves day one.\n\nAlso gov tech, imagine parking enforcement using these instead, whole process could be faster. \n\nAdmin stuff also\n\nGames could be huge but this is Apple we’re talking about, they don’t care.",
                      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7zruu2/",
                      "created": 1718041402,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l808vr6",
                          "score": 1,
                          "body": "> Corporate training and employee onboarding. As adoption grows, imagine store employees applying for a job, and while background check is processed, they have the option to get paid to do onboarding walkthroughs from home so that once paperwork is good to go, they are too. So no more being thrown to the wolves day one.\n\nSo in other words it's just a once and done thing for the most part? Or a once a year or so thing for annual training? That doesn't sound like a very lucrative market IMO.\n\nAlso IMO most of this training would probably work just as well in video format, or with someone in person conducting the training, and it would almost certainly be cheaper given the expense of making and keeping the training program up to date on the VR set. That said in certain cases, like say practicing a complex surgery with no lives being put at risk, I can see the point of it for training, but in the cases where it does make sense over a video or in person training it still seems small and like a niche market to me.\n\n> Also gov tech, imagine parking enforcement using these instead, whole process could be faster. \n\nCareful, you're starting to get into dystopian territory that Apple would probably rather not have their brand be associated with. What if for example a facial recognition app built into the Vision Pro were to wrongly tell some trigger happy police officers that someone is a dangerous criminal, resulting in them shooting and killing an innocent person wrongly facial IDed as a criminal? There's already been a bunch of negative headlines about police in China using VR glasses with facial recognition, so it's not like no one has ever thought of using AR for something like this before.",
                          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l808vr6/",
                          "created": 1718047035,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l822jmv",
                              "score": 1,
                              "body": "For the training you are thinking wayyyyy too narrow. My use case was specifically dominos and fast food. For dominos it has a lot of applications in which it’s simply better than video. It’s easy to dismiss it in favor of video unless you actually have some domain expertise. For example, you will know the store layout via a fully immersive experience, you will be able to train and learn different types of menus and how to build them. You can monitor the store and general business activity flow I. Realtime and a lot more. VR/AR will show you incoming orders in realtime so you don’t have to keep looking up to see what you need to make the order. It speeds up the service which becomes important during rush. It’s not one and done. \n\nAs for the gov tech, I nearly got funded for an application similar to this back in 2016. With the Apple Vision Pro, I actually think I can do it better. One investor joked about how he could see this working but he didn’t want neighbors turning against neighbors (anyone could report violations but a city official would make the final determination and issue the ticket and the reporter gets a cut), and I joked, ya but think about how much cash you will make. I could 5-10x the amount of parking and traffic tickets local governments issued annually. So city xyz issues 330,000 tickets, I could increase it to 1.5-3m annually. It took awhile but when the gov officials finally understood what I was selling, you could see it on the face, especially the money part. It’s as if I could generate cash out of thin air, on the backs of citizens who bitch about taxes. This would not be a tax so they should have nothing to bitch about lol",
                              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l822jmv/",
                              "created": 1718071808,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l7vmdes",
      "score": 1,
      "body": "They’re not lol",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vmdes/",
      "created": 1717971035,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7w02p0",
      "score": 1,
      "body": "AI POWERED, AND marketed it so that the old phone don't have enough processing power to use the generative AI, boom, instant billions.and billions in revenue for next couple years.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7w02p0/",
      "created": 1717976670,
      "depth": 0,
      "replies": [
        {
          "id": "l7w1idc",
          "score": 5,
          "body": "There will be an initial bump in sales, but it’s just going to be a rehashed Siri. There won’t be a massive boon long term just an initial one. I think it’s pretty clear that people have shown they don’t really want to talk to their phone. It’s an uncanny valley effect and I very rarely in my time working in tech see people using voice commands for products.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7w1idc/",
          "created": 1717977274,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7w2rz2",
      "score": 1,
      "body": "Why does every phone from any company need to be better? It just sounds like junk and gimmicks adds every version. Also who actually talks on a phone?? hahahaha",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7w2rz2/",
      "created": 1717977806,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7x6tt9",
      "score": 1,
      "body": "Keep making the same phone until everyone is sick of it then release something \"new\" and \"ground breaking\" that the rest of the world have been using for the last 5-10 years.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7x6tt9/",
      "created": 1717996153,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7vv9nk",
      "score": -1,
      "body": "All Apple needs to do is make their own search engine and Google will be obsolete. Desktop search is not nearly as big as mobile.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vv9nk/",
      "created": 1717974655,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7vqgb7",
      "score": -3,
      "body": "Maybe fucking innovate and update their archaic software.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vqgb7/",
      "created": 1717972688,
      "depth": 0,
      "replies": [
        {
          "id": "l7w2li7",
          "score": 1,
          "body": "If it aint broke dont fix it",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7w2li7/",
          "created": 1717977732,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7vxjv7",
      "score": 0,
      "body": "Apple needs to stop milking the cash cow over and over and year after year, by using the same and well known formula with just a few addional tweaks that nobody really values, and start inovating seriously to regain its competitiveness, cause right now it seems to be just living from its past successes, similarly to what happened to another well known mobile brand, Nokia (had Nokia back in the day, had 3 BB's and Iphone after and since day 1, but recently moved to Android).",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vxjv7/",
      "created": 1717975615,
      "depth": 0,
      "replies": [
        {
          "id": "l7wgqc3",
          "score": 3,
          "body": "This has been said since iphone 6. ",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wgqc3/",
          "created": 1717983648,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7wxl0f",
      "score": 0,
      "body": "I'm an Android guy but I think the iPhone will take over the US market. It's already like 60% and the surveys of teenagers show that eight or nine out of 10 want an iPhone because of iMessage and FaceTime. I don't think many of those will switch to Android as they get older. And I think once the market share is say 75 or 80% it will accelerate because some apps will just stop being developed on Android. IPhone users are already more profitable and juicy for them per user, so this will make the decision even easier to drop Android.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7wxl0f/",
      "created": 1717991079,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7x8855",
      "score": 0,
      "body": "Planned obsolete.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7x8855/",
      "created": 1717996994,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7vqr28",
      "score": -5,
      "body": "They could make great software again if they wanted but I guess they don’t. User Interface, functionality, customisation and compatibility have been lacking for years on every OS Apple offers.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vqr28/",
      "created": 1717972809,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7vna5x",
      "score": -2,
      "body": "Apple revenue has been declining already. Stock goes up",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vna5x/",
      "created": 1717971400,
      "depth": 0,
      "replies": [
        {
          "id": "l7y3ehr",
          "score": 1,
          "body": "+6% YTD",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7y3ehr/",
          "created": 1718018264,
          "depth": 1,
          "replies": [
            {
              "id": "l7ziga8",
              "score": 0,
              "body": "https://finance.yahoo.com/quote/AAPL/financials/\n\nI see revenue down YoY for the full year and last quarter? Is yahoo finance incorrect?\n\nStock is near ATH and as you note, up ytd",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7ziga8/",
              "created": 1718038261,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l7vjy6u",
      "score": -14,
      "body": "Apple is a fad. People will wise up eventually as lower cost alternatives continue to emerge.",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vjy6u/",
      "created": 1717970068,
      "depth": 0,
      "replies": [
        {
          "id": "l7vkoyq",
          "score": 12,
          "body": "What do you call a fad that has been going on for several decades?",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vkoyq/",
          "created": 1717970361,
          "depth": 1,
          "replies": [
            {
              "id": "l7yv97e",
              "score": 0,
              "body": "I worked in IT for many decades. Apple was the whiz kid product in the 80s but followed a proprietary marketing of their vision of computing. It lost market and sales except for a small cult they had. \n\nBy the 2000s when the IPhone was released, they finally had a product that caught up to their proprietary computing mantra and people bought it. It was derivative of a number of products and patents in the industry, but I'll give them credit, they did it first. The cult of Apple grew and a few more consumer products grew. \n\nNow almost 20 years later, they lead in the segment with the most expensive product. But by now there are many equivalent or superior products with a lesser price, and the proprietary iPhone will eventually phase out to industry generic but superior products, just as the Mac/Lisa/Apple computers are a minor part of the computing market today. They are already behind in the AI curve, their end of life may be in sight. \n\nSorry to be this way if you're a disciple...I just never drank the Kool aid. BTW, in a world where people worship the BMW, Audi and Mercedes, I find my Honda to be an economical and comfortable way to travel.",
              "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7yv97e/",
              "created": 1718030346,
              "depth": 2,
              "replies": [
                {
                  "id": "l7ywqkr",
                  "score": 2,
                  "body": "There are many phones with similar or better specs, but no one makes a better phone than Apple. \n\n\nI've been in IT for decades too, if you don't understand why Apple is the top consumer electronics brand or think it's a fad, then you haven't been paying attention.",
                  "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7ywqkr/",
                  "created": 1718030873,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l84u1ko",
                      "score": 1,
                      "body": "I get it...I just don't drink kool-aid",
                      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l84u1ko/",
                      "created": 1718122149,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l7vkara",
          "score": 10,
          "body": "I don't know man. I am not an Apple fan boy by any means. But the iPhone to me is a flawless device.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vkara/",
          "created": 1717970204,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l7vju31",
      "score": -7,
      "body": "They are going to make a car",
      "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vju31/",
      "created": 1717970022,
      "depth": 0,
      "replies": [
        {
          "id": "l7vkv8b",
          "score": 3,
          "body": "I’m an apple bull but they aren’t going to make a car. \n\nhttps://www.npr.org/2024/02/27/1234315814/apple-cancels-electric-car\n\nNow, integrated AI devices, consumer priced AR, silicon improvements, and iPhone refreshes with services will define the industry.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7vkv8b/",
          "created": 1717970431,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l7w56pa",
          "score": 1,
          "body": "They dropped the car idea, which was a good thing.",
          "permalink": "/r/stocks/comments/1dc50zo/with_decline_in_smartphone_sales_how_is_aapl/l7w56pa/",
          "created": 1717978825,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}