{
  "title": "$TSLA - Elon's pay package - When will shareholders get to know the results of the vote ? 13 June ? ",
  "score": 25,
  "selftext": "I have not participated in shareholder voting or shareholder meetings/conferences/calls before for a company. So, was wondering about this and tried to find some information and have a question specific to results.\n\nThis is from the official voting page - [https://www.votetesla.com/faq/general-faq/](https://www.votetesla.com/faq/general-faq/)\n\nFrom what I have read so far, it appears the result will be declared in the Annual shareholder meeting on 13-jun. Is that correct interpretation ?\n\nIf this is not correct, do you know when will shareholders get to know about the result ? Will there also be a call/web-conference that one can attend to know the results as they are declared?\n\n------------------------------------------\n\nEdit (10 June) : This is from investor dot com ---->\n\n \"Musk posted to X Saturday that around \"90% of retail shareholders\" who have voted thus far support awarding him his pay package and reincorporating Tesla in Texas. Tesla has been incorporated in Delaware since 2003.\". I checked Elon's feed on twitter but don't see where he mentioned it, maybe it's in the comments.\n\n\"Retail, or individual investors, currently own around 40% of Tesla shares. Institutional investors hold a much-larger share of Tesla stock than they did in 2018. Vanguard voted against the Musk pay package in 2018, while BlackRock and many others supported it.\"\n\n\"The Tesla chief was writing on Saturday in response to news that Norway's sovereign wealth fund, which manages around $1.7 trillion in assets, has voted against Musk's 2018 pay deal. This is the latest institutional investor that has decided not to support measure ahead of Thursday's meeting.\" \n\n\"Norges Bank Investment Management owns nearly 1% of TSLA shares\"\n\n\"In 2018, the Tesla board won approval for Musk's 2018 pay package with 73% of the vote.\"\n\n",
  "link_flair_text": "Company Question",
  "id": "1dc7b2p",
  "num_comments": 6,
  "created_utc": 1717975328,
  "permalink": "/r/stocks/comments/1dc7b2p/tsla_elons_pay_package_when_will_shareholders_get/",
  "comments": [
    {
      "id": "l7w0eba",
      "score": 70,
      "body": "He will start crying on Twitter as the first person to know!",
      "permalink": "/r/stocks/comments/1dc7b2p/tsla_elons_pay_package_when_will_shareholders_get/l7w0eba/",
      "created": 1717976805,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7xvxr2",
      "score": 9,
      "body": "Results will be shared in the meeting.",
      "permalink": "/r/stocks/comments/1dc7b2p/tsla_elons_pay_package_when_will_shareholders_get/l7xvxr2/",
      "created": 1718013586,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7x9khn",
      "score": 21,
      "body": "Do your part and vote against his pay package, kick his brother and Murdoch out of the board. I don't want people who are invested into spacex to be part of Tesla's board.",
      "permalink": "/r/stocks/comments/1dc7b2p/tsla_elons_pay_package_when_will_shareholders_get/l7x9khn/",
      "created": 1717997810,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7yrgvh",
      "score": 2,
      "body": "Thank you for sharing, good to have a date in mind to be able to watch the stock and be ready to sell before it tanks. This will be a rollercoaster.",
      "permalink": "/r/stocks/comments/1dc7b2p/tsla_elons_pay_package_when_will_shareholders_get/l7yrgvh/",
      "created": 1718028971,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8740l7",
      "score": 1,
      "body": "TSLA will have four business day from the annual meeting to file the meeting results 8-K with the SEC.",
      "permalink": "/r/stocks/comments/1dc7b2p/tsla_elons_pay_package_when_will_shareholders_get/l8740l7/",
      "created": 1718150687,
      "depth": 0,
      "replies": []
    }
  ]
}