{
  "title": "Elliott takes $1.9 billion stake in Southwest, seeks to oust CEO and chair ",
  "score": 321,
  "selftext": "Activist hedge fund Elliott Management has amassed a $1.9 billion stake in Southwest Airlines and plans to push for leadership changes at the airline that has lagged big rivals.\n\nElliott is seeking to replace Southwest CEO Bob Jordan and chair Gary Kelly, the activist said in a letter Monday. Elliott believes that Southwest has fallen from a “best-in-class” airline to one of the biggest laggards, according to a presentation detailing its case for change.\n\nThe size of Elliott’s stake makes the activist one of Southwest’s largest shareholders, according to FactSet.\n\nShares of Southwest were up roughly 7% in premarket trading Monday. The company had a market capitalization of $16.6 billion as of Friday’s close.\n\nElliott said it spoke with numerous former Southwest employees during an 18-month research period, according to a presentation. The activist also said it spoke with shareholders and surveyed more than 2,000 flyers to understand why consumers chose Southwest over other airlines, according to that same presentation.\n\nSouthwest has struggled with delays at Boeing of new 737 Max planes, the newest models of the plane which the carrier exclusively flies, as well as shifting travel demand patterns after the pandemic.\n\nThe airline’s leaders are now looking for new ways to drum up revenue to better compete with rivals that offer travelers more perks and products.\n\nJordan, who replaced Kelly as CEO in February 2022 after decades with the airline, told CNBC in April that the carrier is considering ditching its single class of airplane seating and longtime boarding method.\n\nThe airline also faced a reckoning from a holiday meltdown at the end of 2022 that cost it more than $1 billion and forced the airline long known for good customer service to win over the flying public and make quick fixes to its internal staff scheduling software.\n\nSouthwest shares are down by more than 50% from three years ago when travel demand, led by domestic trips, was starting to come back. In contrast, Delta Air Lines shares are up around 10% over that period and United Airlines are down about 7%.\n\nElliott’s campaigns at other companies have likewise centered on a change in leadership. Elliott’s second campaign at Crown Castle in 2022 and settlement agreement with automotive parts supplier Sensata earlier this year are just two instances.\n\nIn just the last few months, the activist has taken a $2.5 billion stake in semiconductor firm Texas Instruments, a $2 billion stake in Japanese conglomerate SoftBank and a $1 billion stake in mining concern Anglo American. \n\nSource: https://www.cnbc.com/2024/06/10/southwest-luv-activist-elliott-stake.html",
  "link_flair_text": null,
  "id": "1dclnv1",
  "num_comments": 49,
  "created_utc": 1718026530,
  "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/",
  "comments": [
    {
      "id": "l7z5vci",
      "score": 370,
      "body": "there goes your free checked bags",
      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l7z5vci/",
      "created": 1718034024,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l81fv6e",
      "score": 48,
      "body": "I love Southwest. Not a good sign for the SW consumer like me",
      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l81fv6e/",
      "created": 1718062456,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7ywy53",
      "score": 229,
      "body": "Yeah, why can’t Southwest be more like American Airlines? Cancel flights and fuck em, profits, amirite?",
      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l7ywy53/",
      "created": 1718030948,
      "depth": 0,
      "replies": [
        {
          "id": "l7zgqsv",
          "score": 95,
          "body": "U.S. airlines with the fewest cancellations in 2023:\n\n1. Allegiant Air (0.68% of flights canceled)\n\n2. Alaska Airlines (0.74%)\n\n3. Southwest Airlines (1%)\n\n4. American Airlines (1.17%)\n\n5. Delta Air Lines (1.22%)\n\nYou could've picked many other airlines to compare to.  American Airlines was not the best option, being only slightly worse than Southwest.\n\n1. Frontier Airlines (2.13% of flights canceled)\n\n2. JetBlue (2.1%)\n\n3. United Airlines (1.7%)\n\n4. Spirit Airlines (1.7%)\n\n5. Hawaiian Airlines (1.3%)\n\nhttps://www.frommers.com/blogs/passportable/blog_posts/most-reliable-airlines-the-u-s-carriers-with-fewest-cancellations-and-delays\n\nPer the same source, American has the 3rd best on time performance, while Southwest has the 6th worst (although 6th worst is only slightly worse than 3rd best, interestingly enough).  Goes to show how few airlines we have left.",
          "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l7zgqsv/",
          "created": 1718037693,
          "depth": 1,
          "replies": [
            {
              "id": "l802mqe",
              "score": 26,
              "body": "After what happened in December 2022, I wouldn’t be surprised if Southwest did as much as they could to not have any flight cancellations.",
              "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l802mqe/",
              "created": 1718044951,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l81cdkh",
              "score": 10,
              "body": "This is because if they cancel a flight they have to give you a refund, so they pull tricks to technically not cancel the flight. What they do instead, is delay the flight until the next available time slot (even if it's the next fucking day) so it is not technically a \"cancelled flight\". Source: has happened to me basically every fucking AA flight through DFW, have had multiple 10hr + \"delays\".\n\nFuck AA",
              "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l81cdkh/",
              "created": 1718061058,
              "depth": 2,
              "replies": [
                {
                  "id": "l81h0lp",
                  "score": 7,
                  "body": "It does count as delayed though. So it’s gonna slot into one of those two figures.",
                  "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l81h0lp/",
                  "created": 1718062924,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l7zhsw2",
              "score": -68,
              "body": "You seem pretty out of touch. American Airlines is getting trounced on social media right now because of their poor customer service and excessive cancellations, which is what I was referring to.",
              "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l7zhsw2/",
              "created": 1718038046,
              "depth": 2,
              "replies": [
                {
                  "id": "l7zjf6y",
                  "score": 60,
                  "body": "Your response to comprehensive statistics is to call them \"pretty out of touch\" for not being consistent with social media sentiment?",
                  "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l7zjf6y/",
                  "created": 1718038583,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l81mg82",
                      "score": 1,
                      "body": "Yrah...mob with pitchforks/keyboards is not the same as factual statistics",
                      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l81mg82/",
                      "created": 1718065138,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l7zobyk",
                  "score": 15,
                  "body": "Amazing another person who thinks social media is real factual data. Ugh",
                  "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l7zobyk/",
                  "created": 1718040229,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l7zj3ir",
                  "score": 19,
                  "body": "I've been in business long enough to know that social media often doesn't paint a true picture. \n\nSo here are some statistics from the first quarter of 2024:\n\nFor canceled flights in the first three months of 2024, Alaska led the 10 major carriers with 4.5% of all of its flights canceled, followed by United (3%), Frontier (1.8%), JetBlue (1.5%), Southwest (1.5%), American (1.4%), Spirit (1.3%), Hawaiian (1.1%), Allegiant (1%) and Delta (0.8%).\n\nhttps://www.bizjournals.com/chicago/news/2024/06/03/airlines-on-time-cancellations-baggage-handling.html\n\nOh look, Southwest is worse than American.\n\nSounds like I am not \"out of touch\".",
                  "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l7zj3ir/",
                  "created": 1718038476,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l7zklu4",
                      "score": -11,
                      "body": "I think what they're referring to is that currently American airlines has multiple active lawsuits against them. One of them is in regards to a flight attendant taking unsolicited and indecent photos of minors when they use the lavatory (disgusting asf). The second one is when flight attendants kicked off every black person on the plane and then delayed it for 2 hours or something. Then had them reboard. \n\nStory 1:\n\nhttps://www.justice.gov/usao-ma/pr/american-airlines-flight-attendant-arrested-filming-minors-aircraft-lavatory\n\nStory 2:\n\nhttps://www.usatoday.com/story/news/nation/2024/05/31/american-airlines-racial-discrimination-lawsuit/73911335007/\n\nThen there's the average user complaints as well. But if I had to bet American airlines management knows they're too big to fail so they're shitty on purpose.",
                      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l7zklu4/",
                      "created": 1718038976,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l7zjif3",
                      "score": -12,
                      "body": "[removed]",
                      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l7zjif3/",
                      "created": 1718038613,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l8137sc",
                  "score": 5,
                  "body": "\"my Facebook feed said so! The actual facts don't matter!\" headass",
                  "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l8137sc/",
                  "created": 1718057491,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l80ldkz",
      "score": 15,
      "body": "The major storm that brought Southwest to its knees in 2022 was also called Elliott.",
      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l80ldkz/",
      "created": 1718051209,
      "depth": 0,
      "replies": [
        {
          "id": "l86t7ra",
          "score": 2,
          "body": "It was a sign or an omen ",
          "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l86t7ra/",
          "created": 1718146306,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l81ug19",
      "score": 15,
      "body": "God I love activist funds. Gotta love a once good company being drained of everything all so that a guy named Conner can get a bonus, all so he can afford his 4th divorce.",
      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l81ug19/",
      "created": 1718068418,
      "depth": 0,
      "replies": [
        {
          "id": "l86txns",
          "score": 2,
          "body": "Southwest stock price is back to where it was in 2014. It’s time to start making some changes ",
          "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l86txns/",
          "created": 1718146589,
          "depth": 1,
          "replies": [
            {
              "id": "l87zucv",
              "score": 3,
              "body": "True, but if you think Elliott is gonna make any positive changes, you're dead wrong. A firm like Elliott is gonna come in, cut costs, raise prices, increase dividends and buybacks, and cash out before the company begins its decline. Activist funds, 98% of the time, have no idea how to actually improve a company, so they just do the same old MBA playsheet that drains the company. There's a reason a company like Disney didn't want Peltz on the board; it's because they, like many others, knew that Peltz wasn't gonna come out with some innovative idea, he was gonna drain the company for all its worth, then ditch it.",
              "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l87zucv/",
              "created": 1718164773,
              "depth": 2,
              "replies": [
                {
                  "id": "l89hfdi",
                  "score": 2,
                  "body": "I largely agree with your sentiment. The only real exceptions are the classic worth more dead than alive scenario and its variants. ",
                  "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l89hfdi/",
                  "created": 1718196967,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l7zeeg9",
      "score": 71,
      "body": "I can totally agree with this. Southwest is talking about moving to assigned seating so that they can upsell like other airlines. All I could think was that they've totally lost the plot. \n\nNot to mention their extremely outdated tech -- widely known as the worst in the industry -- has been causing more delays and cancelations than it should. \n\nFurthermore, I found that their integration with Google flights was another example of them bucking their identity. Once upon a time people were so fanatical about Southwest that they could draw people to their own site. Today, they're resigned to the sameness of everyone else.\n\nI've taken Southwest multiple times. More and more it feels like another low coat airline. Once upon a time it was am exceptionally pleasant experience, today its an unpleasant one that is better than Spirit, sure, but worse than American or United.",
      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l7zeeg9/",
      "created": 1718036901,
      "depth": 0,
      "replies": [
        {
          "id": "l7zw7id",
          "score": 47,
          "body": "\"More and more it feels like another low coat airline\"\n\n\nI've never got the sense they are trying to be an upscale airline and I know what I'm getting when I book through them.\n\n\nI love flying southwest because of the flexibility (free cancelations), cost, and free checked bags.\n\n\nHaving said all that, I agree that they are not maximizing shareholder value",
          "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l7zw7id/",
          "created": 1718042821,
          "depth": 1,
          "replies": [
            {
              "id": "l81a6xh",
              "score": 11,
              "body": "I love Southwest, and I also don't know what more these guys can do to make shareholders happy. They have either [the most or 2nd most profitable margins of the major US airlines](https://www.macrotrends.net/stocks/stock-comparison?s=ebitda-margin&axis=single&comp=LUV:AAL:DAL:JBLU) for over 10 years now, [low levels of debt](https://www.macrotrends.net/stocks/stock-comparison?s=debt-equity-ratio&axis=single&comp=LUV:AAL:DAL:JBLU), and have a > 2x market cap of AAL (who have *negative* equity).",
              "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l81a6xh/",
              "created": 1718060195,
              "depth": 2,
              "replies": [
                {
                  "id": "l826b3m",
                  "score": 3,
                  "body": "I mean checked bag fees and seat selection fees would very likely increase the stock price in my opinion ",
                  "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l826b3m/",
                  "created": 1718073394,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8kjvjp",
                      "score": 1,
                      "body": "Which would immediately eliminate me as a customer",
                      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l8kjvjp/",
                      "created": 1718368006,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l86ub01",
                  "score": 1,
                  "body": "They could start with getting that stock price up. Instead they have a lost decade situation ",
                  "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l86ub01/",
                  "created": 1718146737,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l81gngk",
          "score": 11,
          "body": "If you think Elliot is going to take a stake this big and innovate the company, you're sadly mistaken.  Look at what's happening to Goodyear.",
          "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l81gngk/",
          "created": 1718062777,
          "depth": 1,
          "replies": [
            {
              "id": "l826sah",
              "score": 1,
              "body": "Well the company is already declining",
              "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l826sah/",
              "created": 1718073599,
              "depth": 2,
              "replies": [
                {
                  "id": "l82apxv",
                  "score": 3,
                  "body": "When has private equity helped? Elliot is arguably one of the worst activist hedge funds there is at husking companies out.   Southwest will be worse than Frontier if they have their way.",
                  "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l82apxv/",
                  "created": 1718075304,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l80ldr5",
          "score": 10,
          "body": "I would disagree.  I fly A LOT.  Like cross countries trips every other week a lot.  Southwest seats are significantly more comfortable.  I tend to fly American for first class upgrades though.  Southwest is so much more pleasant of an experience.  Their employees are much friendlier.  American 95% of employees feel like they're just there for the paycheck.  Southwest is so much warmer.  They should include a first class and only let A listers in or paid people though in my opinion.  I would fly them much more.  I will say I have had significantly more delays on Southwest than American.  American in the last 6 months has been on point.  I've had 1 delayed flight in about 30 trips and the delay was 1.5 hours.  Southwest is pretty much always delayed at least 15 minutes.  I assume this is due to lack of planes due to Boeing, but who knows.",
          "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l80ldr5/",
          "created": 1718051211,
          "depth": 1,
          "replies": [
            {
              "id": "l86uqzc",
              "score": 1,
              "body": "As a customer I don’t mind Southwest. But as a stock it is a dog ",
              "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l86uqzc/",
              "created": 1718146917,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l7zfi1t",
          "score": 2,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l7zfi1t/",
          "created": 1718037273,
          "depth": 1,
          "replies": [
            {
              "id": "l7zokbi",
              "score": 40,
              "body": "> Vacation flyers will rebuke you (with no evidence)\n\nBecause they're paying their own bills.\n\n> business flyers know you're right\n\nBecause they aren't paying their own bills.\n\nWhen cost doesn't matter, there's absolutely no reason to fly Southwest. It likely matters for most passengers.",
              "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l7zokbi/",
              "created": 1718040305,
              "depth": 2,
              "replies": [
                {
                  "id": "l80ocap",
                  "score": 5,
                  "body": "i love southwest for around the US. gets me where i need to go and dont usually have issues",
                  "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l80ocap/",
                  "created": 1718052201,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l80avll",
                  "score": 4,
                  "body": "Ding ding ding",
                  "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l80avll/",
                  "created": 1718047707,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l82fgzc",
              "score": 1,
              "body": "As a business flyer, traveling nearly every week for the past 10 years, my two favorites are delta and southwest. Which one I pick primarily depends on the destination and routing that week. The only time I actively choose to avoid southwest are longer trips, such as east coast to west, purely due to lack of power outlets (which the delayed planes were rumored to have on board)\n\nCompanion pass is a big incentive to fly them for the schmucks like myself that don’t get to spend their company card and on family vacations. In fact, Southwest is the only reward system I like. And being able to easily reserve the 2 seats for my wife and kid is great, especially if you don’t have to worry about paying $200 for the privilege to do so",
              "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l82fgzc/",
              "created": 1718077547,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l81t2tx",
      "score": 6,
      "body": "Puts on SW? Wife and I prefer them over everyone else. Felt they were the last good flight company. Not anymore!",
      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l81t2tx/",
      "created": 1718067851,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l7z3mdu",
      "score": 16,
      "body": "He could buy spirit airlines for cheaper then that lol",
      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l7z3mdu/",
      "created": 1718033258,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l80r4a2",
      "score": 7,
      "body": " Bro…. I read this as Elon takes… whew",
      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l80r4a2/",
      "created": 1718053138,
      "depth": 0,
      "replies": [
        {
          "id": "l81hujx",
          "score": 9,
          "body": "Xouthwest!",
          "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l81hujx/",
          "created": 1718063261,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l83yg2j",
      "score": 3,
      "body": "Bad news: There will be a lot of change\nGood news: There is no amount of change they implement that will make them worse than American Airlines.",
      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l83yg2j/",
      "created": 1718110778,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l81sfol",
      "score": 2,
      "body": "This might signal the end for Southwest.\n\nI used to fly with them exclusively, but the quality of travel has depreciated to the point where it's now an inconvenience.",
      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l81sfol/",
      "created": 1718067582,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l82yh2m",
      "score": 2,
      "body": "My wife and I won’t fly with southwest anymore because the last three times we flew with them it really messed up a travel plans with delays and cancellations, really surprised by how not bad spirit is outside of fees for literally everything",
      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l82yh2m/",
      "created": 1718088618,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l81871s",
      "score": 1,
      "body": "Someone take over Air Canada.",
      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l81871s/",
      "created": 1718059416,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8cj3az",
      "score": 1,
      "body": "Glad I’m not invested in Elliot here.",
      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l8cj3az/",
      "created": 1718235225,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l80y4tm",
      "score": -1,
      "body": "Good luck getting anyone to fly on a Boing.",
      "permalink": "/r/stocks/comments/1dclnv1/elliott_takes_19_billion_stake_in_southwest_seeks/l80y4tm/",
      "created": 1718055615,
      "depth": 0,
      "replies": []
    }
  ]
}