{
  "title": "Underestimating AAPL",
  "score": 296,
  "selftext": "I'm not at surprised at the knee-jerk small sell-off is happening after the Apple Intelligence announcement.  \n\nHowever, I think Cook et co nailed it.  They are  bringing AI to day to day activities, to the masses.\n\nApple makes AI capabilities available and  attractive a way that Microsoft, google, and fail to do so as well.   I think it's going to add a lot of Apple over the next couple years, especially as they continue to add features.  Smart to make privacy a priority from the beginning. \n\nAs it will take a while to implement, and apple is under DOJ scrutiny, and people underestimate apple, it'll be a while til it's reflected in share price, but  this implementation I think will pay off long term.  \n\nUntil then, some buying opportunities, I'd wager.",
  "link_flair_text": "Company Discussion",
  "id": "1dct1uw",
  "num_comments": 207,
  "created_utc": 1718045016,
  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/",
  "comments": [
    {
      "id": "l80q8x5",
      "score": 199,
      "body": "I wouldn't read too much into it, OP. There's a small sell-off virtually every time they announce new products.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80q8x5/",
      "created": 1718052843,
      "depth": 0,
      "replies": [
        {
          "id": "l813z14",
          "score": 46,
          "body": "Agreed. And we reached levels not seen since... last week.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l813z14/",
          "created": 1718057781,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l84ocl9",
          "score": 7,
          "body": "I was told there would be a sell-off after WWDC every year. I sold all my shares yesterday morning so therefore the stock is up even more now.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84ocl9/",
          "created": 1718120259,
          "depth": 1,
          "replies": [
            {
              "id": "l84srvp",
              "score": 7,
              "body": "Apple is not the stock to trade. You buy and hold it.",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84srvp/",
              "created": 1718121725,
              "depth": 2,
              "replies": [
                {
                  "id": "l84wv1t",
                  "score": -2,
                  "body": "Buying at support levels and selling at resistance levels have worked quite well for the past year, if you look at the graph. It works until it breaks out of resistance level.",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84wv1t/",
                  "created": 1718123084,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l84ujii",
              "score": 3,
              "body": "LOL",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84ujii/",
              "created": 1718122316,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l84hl8r",
          "score": 1,
          "body": "ooof",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84hl8r/",
          "created": 1718117970,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l81j8qx",
          "score": -40,
          "body": "Nah, OP is in full panic mode trying to pretend like Apple somehow made AI mainstream.\n\n\n\nApple has lost their touch. Their last sucessful product was a pair or in ears and since thees been nothing. Their attempt at AI is both late and weak. No wonder Apple is losing customers hard all over the world (US as the lone exception, because \"tech is scary\" for people 50+)",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81j8qx/",
          "created": 1718063824,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l80gnjc",
      "score": 138,
      "body": "I wonder if I will finally be able to search my email in a reliable manner.  Or if Apple will stop creating 5 contacts for the same person in 3 different address books.  I won't hold my breath.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80gnjc/",
      "created": 1718049644,
      "depth": 0,
      "replies": [
        {
          "id": "l81ayv3",
          "score": 16,
          "body": "The worst",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81ayv3/",
          "created": 1718060499,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l80ugz6",
      "score": 71,
      "body": "Apple is one of the most valuable companies on the planet, I don't think anyone sane is underestimating them, even if there's some skepticism over their current direction with AI.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80ugz6/",
      "created": 1718054305,
      "depth": 0,
      "replies": [
        {
          "id": "l81ljpz",
          "score": -9,
          "body": "Skepticism? They quelled that today",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81ljpz/",
          "created": 1718064766,
          "depth": 1,
          "replies": [
            {
              "id": "l89lp0b",
              "score": 2,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l89lp0b/",
              "created": 1718198681,
              "depth": 2,
              "replies": [
                {
                  "id": "l8cbwvh",
                  "score": 1,
                  "body": "I don’t think you know what quell means.",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l8cbwvh/",
                  "created": 1718232438,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l820epo",
              "score": -6,
              "body": "Not really. They basically admitted that they don't have a competitive LLM, by the fact that they are relying on ChatGPT for the most advanced queries.\n\nApple is woefully behind.\n\nHaving to approve each time your query to ChatGPT is also an amazing user experience. /s",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l820epo/",
              "created": 1718070923,
              "depth": 2,
              "replies": [
                {
                  "id": "l828f9r",
                  "score": -3,
                  "body": "their AI can do things ChatGPT can only dream of. Search your messages, use Apple Maps, look at your calendar and interact with it, etc....",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l828f9r/",
                  "created": 1718074295,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l828vli",
                      "score": 4,
                      "body": "They are using SLMs. Small models. These are very primitive models, they are just specialized for those tasks you outlined. ChatGPT is much more sophisticated. Almost anyone can make an SLM at this point.\n\nAsk your self, why would Apple use ChatGPT if their models were better? Stop being a fanboy and think rationally.\n\nAlso what about iPhone 15 not being able to use this service? Didn't that phone come out like 8 months ago. This is a disaster.",
                      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l828vli/",
                      "created": 1718074489,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l82aw03",
                          "score": 2,
                          "body": "where did I say that their models are better than ChatGPT?\n\nI said: they have access to data that ChatGPT won't have access to\n\nChatGPT can be a super human intelligence but if it doesn't know what you wrote to your mom yesterday it can't tell you anything about it",
                          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l82aw03/",
                          "created": 1718075377,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l82c32i",
                              "score": -5,
                              "body": "What is the point of this conversation?",
                              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l82c32i/",
                              "created": 1718075917,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l82vbke",
                                  "score": 6,
                                  "body": "Pretty simple, Apple can offer a personalized version of GPT based on what you do on your phone and other Apple devices.  That's pretty unique to Apple.  Although this isn't a significant AI leap or program, and it uses primitive models, it's still a large jump for the normal Apple user, which is the majority of Americans.  Kinda a big deal.",
                                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l82vbke/",
                                  "created": 1718086519,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l83ppwj",
                                      "score": -1,
                                      "body": "Not sure how relevant that is with the fact that Apple is woefully behind in AI. Though.\n\nThey sprinkled some SLMs throughout the app ecosystem but you still have to use ChatGPT for anything more advanced.\n\nLike how am I wrong for stating the obvious. Apple got caught with their pants down. They had no AI strategy they are just starting now.",
                                      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l83ppwj/",
                                      "created": 1718106736,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "l82zpqm",
                                  "score": 1,
                                  "body": "[removed]",
                                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l82zpqm/",
                                  "created": 1718089467,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l83pdm5",
                                      "score": 0,
                                      "body": "By stating how obviously behind Apple is. The only large infrastructure company with no LLM of their own?\n\nYou seem to be a fanboy who's scared of the truth.",
                                      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l83pdm5/",
                                      "created": 1718106566,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l81qb9z",
              "score": -9,
              "body": "Yeah, they are so innovative.  Nobody could have guessed chat gpt comes to iphone!",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81qb9z/",
              "created": 1718066724,
              "depth": 2,
              "replies": [
                {
                  "id": "l81ym1i",
                  "score": 4,
                  "body": "The fact you stay up on leaks has no bearing on the impact what they showed today will have",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81ym1i/",
                  "created": 1718070177,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8058wt",
      "score": 22,
      "body": "It does seem very well integrated into the entire ecosystem and apps. And I think in the near future, you‘ll be able to choose whatever AI model you want to go hand in hand with Apple Intelligence so that‘s a big plus as well. It also helps them catch up, because their own model while light weight and competent enough, is not on the level of Chatgpt yet. Some privacy focus is also great to hear about. The stock market didn‘t like it, but I‘m very excited for it and what‘s ahead.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l8058wt/",
      "created": 1718045817,
      "depth": 0,
      "replies": [
        {
          "id": "l83nml3",
          "score": 1,
          "body": "It’s because it doesn’t make them anyone money it’s just a slight improvement to the UX.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l83nml3/",
          "created": 1718105676,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l80icc2",
      "score": 12,
      "body": "I think so too, iPhone 16 generation should get a big release later this year too.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80icc2/",
      "created": 1718050207,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l812pco",
      "score": 40,
      "body": "I think gating the AI features to only iPhone 15 and newer is a great move. Lots of sentiment over the past year have been not upgrading their iphone unless there are significant changes. Well here it is and a sizable number of iphone users who are still on iphone 10-14 are going to buy iphone 16.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l812pco/",
      "created": 1718057296,
      "depth": 0,
      "replies": [
        {
          "id": "l81tjka",
          "score": 9,
          "body": "Reading the Apple Intelligence page,\n\n>\"Apple Intelligence will be available on iPhone 15 Pro, iPhone 15 Pro Max, and iPad and Mac with M1 and later, with Siri and device language set to U.S. English.\"\n\nFor Apple Intelligence, it needs IPhone 15 Pro.  \nIphone 15, 15plus or older models won't run Apple intelligence.  \nAs I understand it from reading the page, the OpenAI Chatgpt integration is free and will be available on all phones with ios18 ( the doc is not very clear about it, so I can be wrong).\n\n>\"Privacy protections are built in for users who access ChatGPT — their IP addresses are obscured, and OpenAI won’t store requests. ChatGPT’s data-use policies apply for users who choose to connect their account.ChatGPT will come to iOS 18, iPadOS 18, and macOS Sequoia later this year, powered by GPT-4o.\"",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81tjka/",
          "created": 1718068043,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l84ea7o",
          "score": 3,
          "body": "Yup. Obviously I am just one person, but I was going to keep my 13 pro max as long as I could. I will most likely upgrade now. Is it annoying? Sure, I suppose. Did they get me to upgrade my phone? Yes. So smart business decision imo",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84ea7o/",
          "created": 1718116829,
          "depth": 1,
          "replies": [
            {
              "id": "l84y4t3",
              "score": 1,
              "body": "Do you feel that AI features are that significant to you? \n\nI’m still rocking an 11PM, keeping it until I really think it’s too sluggish for me to use. I’ve survived without the new AI features they’re going to have this long. I think I’ll be ok with out.",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84y4t3/",
              "created": 1718123506,
              "depth": 2,
              "replies": [
                {
                  "id": "l89mwto",
                  "score": 1,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l89mwto/",
                  "created": 1718199151,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8a1cv4",
                      "score": 1,
                      "body": "Yeah absolutely. To each their own. I used to be crazy about having the latest phone but I’ve gotten to a point where I know my use and for me personally my 11PM can do exactly what a 15PM needs to do for me. \n\nI do agree that the AI looks pretty cool and I’m looking forward to having an iPhone with that at some post on the future",
                      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l8a1cv4/",
                      "created": 1718204354,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l86qx9q",
          "score": 1,
          "body": "Wish it was on the iPhone 15 I just bought. But tbh I don’t see myself using it much on the phone, more so the mac",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l86qx9q/",
          "created": 1718145412,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l87t90w",
          "score": 1,
          "body": "Not just the iPhone 15 but you need the flagship model to use the AI features - Pro/Pro Max\n\n\n\n\nI’m interested to find out if the non-pro 16 will have the capabilities",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l87t90w/",
          "created": 1718161672,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l805kjw",
      "score": 30,
      "body": "Did anybody catch if the new Siri is rolling out on all recent phones, or just this year's line up? On one slide, they just showed one of the A chips.\n\nEdit: Apple is only making AI available on 15 pro (this year's top model) and later. So, on the downside, my 14 pro max won't have it, with only 6 GB of RAM. Of course, Apple could quantize their model to run on 6 GB of RAM, but they opted not to. So, driving upgrades is their AI monetization model, which is bad for me as a consumer but fine as an investor. I'm going to continue to hold Apple, and hold AAPU only for another couple days (which is a very modest position). Hoping for no whammies with the Fed meeting, though no one is expecting a cut right now.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l805kjw/",
      "created": 1718045925,
      "depth": 0,
      "replies": [
        {
          "id": "l8066rs",
          "score": 17,
          "body": "I don't think we know yet, but it'd be smarter for Apple to make it work with the last few generations of phones, if possible.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l8066rs/",
          "created": 1718046129,
          "depth": 1,
          "replies": [
            {
              "id": "l807ekf",
              "score": 26,
              "body": "Pretty sure only 15 pro and newer, seems like a scheme to get people to upgrade to a newer phone for AI features",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l807ekf/",
              "created": 1718046541,
              "depth": 2,
              "replies": [
                {
                  "id": "l80z4mc",
                  "score": 15,
                  "body": "I believe a lot of the AI processing occurs on-device for privacy reasons. Obviously that’s a convenient reason to tell people they have to upgrade, but it’s a compelling argument. ",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80z4mc/",
                  "created": 1718055973,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l80zcw1",
                  "score": 9,
                  "body": "I think once there's widespread consumer reviews of how it actually functions on their new phones, that will create the buying pressure to upgrade old phones that has stagnated for apple the past few years.\n\nThe past few years there's been basically just small-medium spec improvements without any real need for it (cool the processor is faster but my iphone 12/13 is doing 95% of my use cases just fine). I'd argue this is the first time in ~4 years that there's a step forward in iphone functionality that is meaningfully large to get people to upgrade. \n\nAll comes down to the gap between the presentation's demos and actual usability.",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80zcw1/",
                  "created": 1718056056,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l816q2q",
                      "score": 3,
                      "body": "Apple might have one of the strongest track records of delivering usability from demos iRL (given some time) and making it cool in the process. iPads, iWatches, and iPods are ubiquitous and trend-setting, but they have taken years to catch on. If they can pull this off and improve the UX on the Vision Pro in the next few years, I think Apple could usher in the next generation of computing with implications I'm not quite sure we are ready for at all.",
                      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l816q2q/",
                      "created": 1718058841,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l80u9rg",
                  "score": 2,
                  "body": "the problem is they've broken a lot of trust by leaving siri as a pile of shit for so long while promising over and over to make it better.\n\nnot a chance I'm dropping money on yet another promise that siri will stop sucking.",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80u9rg/",
                  "created": 1718054233,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l812ek5",
                      "score": 3,
                      "body": "You don’t understand the Apple’s customer base then.",
                      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l812ek5/",
                      "created": 1718057182,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l81i4vr",
                          "score": 4,
                          "body": "I am the Apple customer base.  All of my devices are Apple.\n\nGo check out /r/Apple.  I’m not the only one done with Siri.",
                          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81i4vr/",
                          "created": 1718063378,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8403zo",
                              "score": 2,
                              "body": "Yup, Siri is an idiot in dire need of an AI boost.",
                              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l8403zo/",
                              "created": 1718111473,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l81z8oy",
                  "score": 1,
                  "body": "> seems like a scheme to get people to upgrade to a newer phone for AI features\n\nThis is going to back fire, at least in some regards imo. I'm not buying a new phone just for what I find is mostly gimmicky AI. I can't be the only one who thinks this or even close to it.\n\nIf anything, this makes me just want to hold onto my 13 Pro even longer.",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81z8oy/",
                  "created": 1718070442,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l81dhh9",
              "score": 1,
              "body": "I think they want people to buy new phones not give them AI on the old phones so they aren't as likely to buy a new one.",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81dhh9/",
              "created": 1718061501,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8083np",
              "score": 1,
              "body": "Yeah. But, I'm holding a modest leveraged position now and I'm wondering how much of the selloff is the Street worrying about Apple's short-term path towards monetizing AI. It looks like a ChatGPT4o subscription is integrated for free. It looks like they're not adding AI as a service, so restricting devices is one way to encourage delayed upgrades to juice revenue.\n\nI do think that it's safe to buy-and-hold Apple shares for the long term, and I have a modest position there too, because it will hold up better in a market correction than chip stocks. Software stocks have a crazy valuation right now with only modest revenue/earnings growth, at best. So, at least part of the market is really stretched.",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l8083np/",
              "created": 1718046775,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l80yeid",
          "score": 1,
          "body": "Only the 15 pro and 15 pro max will have it. Not sure if the non-pro 16 will have it.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80yeid/",
          "created": 1718055713,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l828m3w",
          "score": 1,
          "body": "> Apple could quantize their model\n\nand have a model that doesn't perform as well as they want to...\n\nthey don't want to become a laughing stock, like with Siri, again",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l828m3w/",
          "created": 1718074375,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l87tqwk",
          "score": 1,
          "body": "Most of us upgrade our phones after 2-5 years anyway so people will eventually switch. I already bought a 15 pro last year after using an 2nd gen SE for 3.5 years, so it’s just a nice bonus feature. The usb-c port was the bigger deal for me.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l87tqwk/",
          "created": 1718161899,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l80c5ky",
          "score": 1,
          "body": "I think a few \n\nhttps://www.reddit.com/r/apple/s/mpyptn2U9y",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80c5ky/",
          "created": 1718048134,
          "depth": 1,
          "replies": [
            {
              "id": "l80ultq",
              "score": 3,
              "body": "For Ai specific features the list is a lot shorter \n\nhttps://www.macworld.com/article/2360280/ai-apple-intelligence-features-iphone-ipad-mac-hardware-requirements.html",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80ultq/",
              "created": 1718054352,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l813k85",
      "score": 6,
      "body": "I’m conflicted for sure. On one hand I think Apple understands its core revenue well and how to both keep users and investors happy. Some of the features seemed targeted at keeping the Apple ecosystem special and walled off from android. That blue/green text message thing, while kind of dumb when you think about it, was definitely a big deal for keeping Apple users around.\n\nOn the other hand I’m not seeing any big differentiators, any huge value-adds that change the current iPhone revenue. Is any of this going to drive more device purchases? Probably not. Apple has been ramping their service offerings up for a while to drive more revenue. But their primary is still in device sales. Without that new consumer product innovation in the last few years (Vision notwithstanding) I feel like Apple might be peaking for a few years.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l813k85/",
      "created": 1718057622,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l807vai",
      "score": 77,
      "body": "Your post could have otherwise be written as \"I have an iPhone and think it's the best, so I'll buy more stock based on them saying something something AI\"",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l807vai/",
      "created": 1718046697,
      "depth": 0,
      "replies": [
        {
          "id": "l8198ae",
          "score": 20,
          "body": "It's obvious OP has an iPhone if he actually thinks Google isn't already doing this with Assistant on Android. All of these fancy photo editing features like magic erasers that Google advertises for their pixel phones are literally AI doing everyday tasks",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l8198ae/",
          "created": 1718059821,
          "depth": 1,
          "replies": [
            {
              "id": "l81b97q",
              "score": -4,
              "body": "I have a Pixel. My first one, it's more janky than samsungs but the camera options are pretty rad. Does in 2 seconds what used to take me a bit to do in photoshop. pretty cool",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81b97q/",
              "created": 1718060614,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l81b1gn",
          "score": 9,
          "body": "To be fair.  This is the main reason to have bought apple in the past 20 years and has been shown to be a successful reason.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81b1gn/",
          "created": 1718060528,
          "depth": 1,
          "replies": [
            {
              "id": "l81bo0c",
              "score": 3,
              "body": "yup, they got branding nailed down. phone sales declining though, the overpriced goggles failed, they bailed on cars. it seems they are really searching for relevancy",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81bo0c/",
              "created": 1718060777,
              "depth": 2,
              "replies": [
                {
                  "id": "l81c75p",
                  "score": -2,
                  "body": "I have owned apple stock for 20 years now (stupidly sold some of it long time ago sadly).\n\nI don't think they need to search for relevancy.  They are relevant.  They are the montblanc of tech.  The LV of tech.  Luxury standing right at the unaffordable line.\n\nUntil people stop being apple fanboys, I won't sell.",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81c75p/",
                  "created": 1718060988,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l81dgbl",
                      "score": 2,
                      "body": "I agree with you on half of that, yup. I think the company is searching for a new product which is better term than relevance. I do agree with you though, they can coast on their brand. I don't think you'll ever get rid of fanboys. People can't just switch phone or computer brands once you're institutionalized. \n\nI'd make fun of apple users for how dumbed down the instruments are, but when I got an iPhone for work it was like learning everything all over again for the features. Never liked Apple as a PC guy, but they have a great user experience which entrenches users to stay with them. \n\nSales declining in China, but there are a couple generations of Westerners I don't ever see switching.",
                      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81dgbl/",
                      "created": 1718061488,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l80r5bg",
          "score": 0,
          "body": "Don't forget that op prolly bought apple stock at 195 and now wants us to get in.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80r5bg/",
          "created": 1718053148,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l82966e",
          "score": 1,
          "body": "\"I'm already an Apple fanboi and shareholder, heavily biased, stopping by fishing for confirmation from the peanut gallery.\"",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l82966e/",
          "created": 1718074617,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l80fmg9",
          "score": -3,
          "body": "😆",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80fmg9/",
          "created": 1718049300,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l812aiu",
      "score": 9,
      "body": "I love what I saw. Will we see crazy growth like before? Maybe not, but this continues to be  strong company who delivers high quality products to the consumer and I think it’s a great stock to hold for a while still.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l812aiu/",
      "created": 1718057139,
      "depth": 0,
      "replies": [
        {
          "id": "l820c4w",
          "score": -7,
          "body": "Too bad company the company is historically overvalued",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l820c4w/",
          "created": 1718070894,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l81fq4x",
      "score": 4,
      "body": "Seems like it’s been a soft aapl all year, no?  I’m long but SPY is outperforming all year.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81fq4x/",
      "created": 1718062399,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l83ks3z",
      "score": 5,
      "body": "Ah yes the good ol *1% drop sell off*",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l83ks3z/",
      "created": 1718104146,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l84h1p8",
      "score": 4,
      "body": "It would appear things have reversed slightly  :)",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84h1p8/",
      "created": 1718117784,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l80xz3r",
      "score": 8,
      "body": "That’s interesting. You look at Google, at Amazon, Microsoft, they’re all heavily into AI for the enterprise, the cloud, server space. AI for business processes, algorithms etc. which makes sense. They don’t make their money from the consumer. \n\nAnd here’s Apple. A consumer facing company. Makes sense all their AI endeavors will be in the consumer space. Is there even another major player in the race? Might take a while before something more substantial than a beta release comes out, but Apple might actually be first in for once.\n\nIf they can pull it off.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80xz3r/",
      "created": 1718055559,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l809t4k",
      "score": 32,
      "body": "I still haven't heard how Apple makes money from AI. I'm waiting.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l809t4k/",
      "created": 1718047347,
      "depth": 0,
      "replies": [
        {
          "id": "l80dvy1",
          "score": 78,
          "body": "Gives people a reason to purchase an upgrade",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80dvy1/",
          "created": 1718048717,
          "depth": 1,
          "replies": [
            {
              "id": "l817p9j",
              "score": 2,
              "body": "That's a short term plan that's only gonna take them so far in a mature industry",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l817p9j/",
              "created": 1718059223,
              "depth": 2,
              "replies": [
                {
                  "id": "l86n9g5",
                  "score": 1,
                  "body": "selling 1 billion iphones per 900usd each sounds like good enough plan for short term..",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l86n9g5/",
                  "created": 1718144025,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l81a56k",
                  "score": -2,
                  "body": "That’s the point, this’ll buy them a few more years to find something else to drive sales. As it were the main concern with apple was lack of innovation now they “innovated” again so more iPhones will be bought due to hype.",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81a56k/",
                  "created": 1718060176,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l80b9rq",
          "score": 58,
          "body": "Same way they always do; they sell millions and millions of new devices capable of handling the new processor-intensive capabilities.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80b9rq/",
          "created": 1718047837,
          "depth": 1,
          "replies": [
            {
              "id": "l8176po",
              "score": -2,
              "body": "local AI ? their competitors might offer better cloud-based versions cheaper",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l8176po/",
              "created": 1718059021,
              "depth": 2,
              "replies": [
                {
                  "id": "l8188sz",
                  "score": 5,
                  "body": "Yes, for Apple’s AI both the requests and the AI responses remain on the device.  One of Apple’s key selling points is privacy, and this is central to that. It may be that customers don’t care that much; we’ll see.  \n\nChatGPT will also be available at the system level at no charge, so those willing to sacrifice privacy for the familiarity of ChatGPT will have that option.",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l8188sz/",
                  "created": 1718059436,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l82ov2w",
                      "score": -1,
                      "body": "Users care, but not that much for privacy. The key thing is, AI is inherently centralizing and needs to be offloaded to the cloud to be smart (i.e. time-saving) enough. Running AI models (even small) on device is very energy consuming, so i think eventually phones will become dumb terminals to our cloud-based AI persona. Apps are mostly not going to be needed, because a generative AI is basically writing an app every time it responds.",
                      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l82ov2w/",
                      "created": 1718082537,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l80e5gk",
          "score": 23,
          "body": "Apple Intelligence features will only be available on iPhone 15 Pro and higher models. And my guess is they will use the AI excuse to increase the base price of the new iPhone.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80e5gk/",
          "created": 1718048806,
          "depth": 1,
          "replies": [
            {
              "id": "l80x3hr",
              "score": 23,
              "body": "I honestly don't think the average consumer wants AI in their everyday life nearly as much as the investing world seems to think that they do.",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80x3hr/",
              "created": 1718055239,
              "depth": 2,
              "replies": [
                {
                  "id": "l813lmk",
                  "score": 6,
                  "body": "they might not at first.. and then they will start getting message responses from friends with custom generated images and emoji specific to the conversation. They'll want to participate, but can't without upgrading. We saw this with green bubbles. It works.",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l813lmk/",
                  "created": 1718057637,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l830cnz",
                  "score": 1,
                  "body": "A lot of people thought they did not need the Internet… or smartphones… or cloud storage. But here we are. Once you get used to better features, there’s no going back.",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l830cnz/",
                  "created": 1718089912,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l84resz",
                      "score": 0,
                      "body": "Also a lot of people didn't think they needed 3DTVs, smart glasses, or the metaverse. And they were right.",
                      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84resz/",
                      "created": 1718121278,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8556xt",
                          "score": 1,
                          "body": "False equivalency, dude.",
                          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l8556xt/",
                          "created": 1718125835,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l81288r",
              "score": 5,
              "body": "Similar shtick to Microsoft's Co-Pilot**+** on the new Qualcomm-powered Win 11 devices.  A new feature driving adoption of a new generation of hardware.  Tale as old as time.\n\nLet's be clear: this is just keeping up with the pack in mobile, person-facing AI.  It's not positioning them in any way to ride the AI wave - it just keeps them from being drowned by it.",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81288r/",
              "created": 1718057115,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l80j2cr",
          "score": 16,
          "body": "I am also waiting for every other company to tell me how they're going to make money from AI.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80j2cr/",
          "created": 1718050447,
          "depth": 1,
          "replies": [
            {
              "id": "l81462u",
              "score": 8,
              "body": "My company pays for thousands of developers to have access to github copilot. And once office copilot is out in general use, it will create a pretty decent moat that keeps us from using other office products. Not having AI in your software pretty soon will be like shipping your software on CD. No one is going to want that shit.",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81462u/",
              "created": 1718057856,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l80y3r6",
              "score": 7,
              "body": "The best AI applications are business to business. It can solve certain problems really well. Direct to consumer where everyone expects tech for free (by being the product) these days, I don't see how it gets monetized effectively.",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80y3r6/",
              "created": 1718055605,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l80le9y",
              "score": 4,
              "body": "By pumping their stock",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80le9y/",
              "created": 1718051216,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l80pksn",
          "score": 5,
          "body": "Sell phones primarily. Secondarily look for services that you can charge monthly for. I could definitely see a “unlocked advanced ai” added to their iCloud service bundle next year.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80pksn/",
          "created": 1718052619,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l80yoyj",
          "score": 3,
          "body": "People pay money for AI features",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80yoyj/",
          "created": 1718055816,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l815z25",
          "score": 3,
          "body": "Sometimes making money is just *not losing money* to provide a feature that everyone expects just so you can keep selling products to them.\n\nIgnoring privacy concerns, doing everything cloud side is more expensive and so far users do not pay enough to even cover the operating costs.\n\nOn-device generative AI is the most efficient way to deploy it.  There is more compute power in Apple devices owned by its ~1 billion users than in all the data centers of the world.  Each device also contains all of the user's data, so doing things (training, inferencing) on-device has an operating cost to Apple of $0.\n\nApple has been leveraging its customer-owned \"fleet\" of compute power for a long time, for example all Photos analytics are done on a user's devices with results synchronized securely between them.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l815z25/",
          "created": 1718058547,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l80zful",
          "score": 1,
          "body": "Apple devices have a large number of apps and services that are developed and maintained by Apple for free for their users. It seems pretty obvious why.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80zful/",
          "created": 1718056085,
          "depth": 1,
          "replies": [
            {
              "id": "l8159jg",
              "score": -1,
              "body": "Ok, I would really like to know how free apps/services developed by Apple translates into money.  Sounds like they are spending money and not making any money back. Unless their offerings are so much better than google that it convinces people to dump Android for good, I just don't see it happening. If these phones cost $1500+ I could see it having the reverse effect where people who are more budget conscious start ditching Apple or hold onto their old iPhones because they are priced out of the market for new iPhones.",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l8159jg/",
              "created": 1718058277,
              "depth": 2,
              "replies": [
                {
                  "id": "l817oof",
                  "score": 4,
                  "body": "iMessage is a great example. It’s been around for free for over a decade and received regular free updates. It’s been a draw towards the iPhone and an example of their walled garden / ecosystem. They’ve spent a considerable amount of money on iMessage because it makes the iPhone (and the Apple ecosystem) a better value proposition.\n\nOther great examples include FaceTime and Find My. ",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l817oof/",
                  "created": 1718059216,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l818nrl",
                      "score": 1,
                      "body": "If Google offers the same services on Android it's going to be a wash. It could even hurt Apple if their strategy of on device AI processing inflates the cost of iPhones and makes their AI worse than Google who is going with a cloud AI first strategy.",
                      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l818nrl/",
                      "created": 1718059597,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l819nta",
                          "score": 2,
                          "body": "Google can’t currently offer comparable user experiences with other free services like iMessage, Find My, or on-device AI for a variety of reasons.\n\nRegarding on-device, I suspect the use of AI will be pretty conservative. Smaller models are “good enough” for simple use cases, and nothing in the keynote today indicated they’d be turning Siri into a chat bot like Claude or ChatGPT. \n\nRunning the big models in the cloud is also very expensive. Running things on device would mean big cost savings for Apple. \n\nThe whole AI race is still pretty early though, so it’s certainly possible Apple will end up screwed here.",
                          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l819nta/",
                          "created": 1718059987,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l84sq42",
          "score": 1,
          "body": "Ai will only work on iPhone 15 pro and newer\n\nI’m sure that will sell a few phones",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84sq42/",
          "created": 1718121708,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l80mjqk",
          "score": 2,
          "body": "1. Put the most advanced ai features in new phones only\n2. Charge too much for those phones\n3. Advertise them\n4. Profit\n\n\nIt's the same thing they've always done. I will never buy an apple product but I love their stock.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80mjqk/",
          "created": 1718051598,
          "depth": 1,
          "replies": [
            {
              "id": "l80w94t",
              "score": 1,
              "body": "weren't you surprised new phone wasn't announced with AI",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80w94t/",
              "created": 1718054935,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l80p8jf",
      "score": 2,
      "body": "This happens after every Apple keynote.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80p8jf/",
      "created": 1718052505,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l81s2o0",
      "score": 2,
      "body": "We have this exact thread every time a multibillion dollar tech company does anything. 💤",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81s2o0/",
      "created": 1718067433,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l81thyv",
      "score": 2,
      "body": "I underestimated Apple for a decade. It won’t happen again",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81thyv/",
      "created": 1718068025,
      "depth": 0,
      "replies": [
        {
          "id": "l85fdkb",
          "score": 3,
          "body": "Up 1600% in the last decade !",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l85fdkb/",
          "created": 1718129179,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l81yfgu",
      "score": 2,
      "body": "Stock down a measly 1.9%, OP: “sell off”, “knee jerk reaction “it’s you who have knee jerk reaction. Prepare to be in a hard time if you are gonna make a post every time a stock is down 2% lol",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81yfgu/",
      "created": 1718070102,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l84oaec",
      "score": 2,
      "body": "Meanwhile, APPL +6%",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84oaec/",
      "created": 1718120239,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l872ace",
      "score": 2,
      "body": "I hope they get to $400 again and do a stock split",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l872ace/",
      "created": 1718149959,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8191f1",
      "score": 4,
      "body": "I'm guessing OP doesn't have an Android phone if he thinks Google doesn't bring AI into everyday tasks.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l8191f1/",
      "created": 1718059747,
      "depth": 0,
      "replies": [
        {
          "id": "l81humo",
          "score": 2,
          "body": "or Windows.\n\nCo-pilot is getting it's own key on new windows computers.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81humo/",
          "created": 1718063262,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l80rqwd",
      "score": 2,
      "body": "I use an iPhone and have had Apple stock in the past...todays \"Ai\" announcement from them was pretty meh imo. \n\nThe only thing that honestly wowed me was the math scripting",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80rqwd/",
      "created": 1718053352,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l81m0fh",
      "score": 1,
      "body": "Ai integration doesn't really do much. How does this actually make Apple money? Are they gonna make people pay for it? Or is it gonna only be included with Apple one?",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81m0fh/",
      "created": 1718064958,
      "depth": 0,
      "replies": [
        {
          "id": "l83bv1g",
          "score": 3,
          "body": "Apple is still a major hw company - thy make money by convincing people that their hw is the best with the best ecosystem. Iphone sales will go up with the 16 as many people actually see a purpose of upgrading.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l83bv1g/",
          "created": 1718098397,
          "depth": 1,
          "replies": [
            {
              "id": "l84xlxi",
              "score": 1,
              "body": "It can go up, but there's no way it will go up enough to justify the current valuation. P/E of 30 means massive growth over the coming years.",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84xlxi/",
              "created": 1718123332,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l82oahn",
          "score": 2,
          "body": "As most of it is on device they will not need additional servers. So they will not lose money. Just like most of their other software today.\n\nOne of the current limitations of running a model is ram. So Apple can increase ram every year to be able to run new and improved models. \n\nRunning on device will also degrade battery faster so now you also have lazy consumers buying new iterations instead of replacing the battery. \n\nSo to summarize: you will need better hardware to run AI. ",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l82oahn/",
          "created": 1718082208,
          "depth": 1,
          "replies": [
            {
              "id": "l82uazd",
              "score": 1,
              "body": "If it is run on system, it can only be run on phones with neural engines built in, as these LLMs are power consuming machines. You wouldn't get anything close to GPT level, more likely to be close to a good chatbot. Running natively has massive limitations, even on pretty good devices. \n\nYou're also disregarding the absolutely massive R&D expenses that go into LLM development. That alone would be billions of dollars.",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l82uazd/",
              "created": 1718085862,
              "depth": 2,
              "replies": [
                {
                  "id": "l82wl7p",
                  "score": 1,
                  "body": "Yes agreed the capabilities will not be comparable to a big >70B parameter LLM. However the model can improve if the hardware improves.  But even if you get a bigger model some tasks on device are better suited for smaller models which have lower latency for inference. Asking a 70B model for a simple action may take orders of magnitude longer than asking a 13B parameter model to perform the same action. It all depends on what you want to achieve. I don't think Apple Intelligence is striving to be an LLM in the limit.",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l82wl7p/",
                  "created": 1718087353,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l822r1q",
      "score": 1,
      "body": "I'm AI with the braids",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l822r1q/",
      "created": 1718071894,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l83df3s",
      "score": 1,
      "body": "ultimate spying on a phone with processing power to beat the competition; i’d be hesitant of privacy and deep knowledge that it’ll have about my work and personal life",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l83df3s/",
      "created": 1718099506,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l84nu93",
      "score": 1,
      "body": "I’m way more excited about the apps and games they will make with this.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84nu93/",
      "created": 1718120091,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l85ik1v",
      "score": 1,
      "body": "Wow, this thread is not censored by the moderators. I posted opinions on Disney and the moderators took it down. I think the moderators pick and choose what they think is in a legitimate opinion or not crap thread.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l85ik1v/",
      "created": 1718130233,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8il1vb",
      "score": 1,
      "body": "Nice call, OP. Not only this, but it also validates a bunch of use cases for AI — and by that measure, some of the spending going on for servers, chips, and equipment.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l8il1vb/",
      "created": 1718328226,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lctu8uc",
      "score": 1,
      "body": "It's really crazy how a shitty AI update pushed them up to nearly 3.5T",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/lctu8uc/",
      "created": 1720789058,
      "depth": 0,
      "replies": [
        {
          "id": "lctvfhk",
          "score": 1,
          "body": "You say shitty, I say potentially transformative.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/lctvfhk/",
          "created": 1720789530,
          "depth": 1,
          "replies": [
            {
              "id": "lcum5lc",
              "score": 1,
              "body": "I'm not a *spits in disgust* investor, so I wouldn't know\n\nI'm just a software developer who finds the \"AI\" craze hilarious and depressing simultaneously\n\nBut yeah a text and image generator in iOS is really gonna be \"transformative\" lmfao",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/lcum5lc/",
              "created": 1720798778,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l808t1a",
      "score": 1,
      "body": "I’m one year into the AI surge. Absolutely nothing in my life has changed except I click return more often when writing texts.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l808t1a/",
      "created": 1718047009,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l80oca0",
      "score": 1,
      "body": "Elon Musk just said that he's banning Apple devices at all of his companies if OpenAI is integrated into IOS.\n\nhttps://x.com/elonmusk/status/1800265431078551973",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80oca0/",
      "created": 1718052201,
      "depth": 0,
      "replies": [
        {
          "id": "l80xrez",
          "score": 21,
          "body": "I like to hike.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80xrez/",
          "created": 1718055482,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l80p57k",
          "score": 7,
          "body": "I'm sure they'll let you disable that feature via MDM, at least for corporate provided cell phones.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80p57k/",
          "created": 1718052473,
          "depth": 1,
          "replies": [
            {
              "id": "l8134dm",
              "score": 2,
              "body": "Apple's getting better at playing in the corporate world, esp. in regulated industries.\n\nPrivacy is critical, but they need to cross that threshold where they realize corporate-issued phones for medical, govt., banking, etc. are not personal devices and need to be both feature-constrained and monitored.",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l8134dm/",
              "created": 1718057455,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l80yoad",
              "score": 1,
              "body": "Exactly.",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80yoad/",
              "created": 1718055809,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l812t5r",
          "score": 7,
          "body": "Meanwhile, he's capitulated to handing over essentially unlimited PII driver data to the Chinese gov't in return for concessions on Tesla sales within the country.  How long before we find out that deal secretly includes non-Chinese driver data?\n\nHuman garbage.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l812t5r/",
          "created": 1718057336,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l812dev",
      "score": 1,
      "body": "> They are bringing AI to day to day activities, to the masses.\n\nI loved the display where siri lights up the entire phone, because it highlights that AI really obsoletes apps. Without apps how will apple make money? Frankly most apps can work with a featurephone if they are integrated with AI. Apple should focus on media consumption, which is what gives premium value to their devices. AI will eat their own lunch.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l812dev/",
      "created": 1718057169,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8261n4",
      "score": 1,
      "body": "Watched the event and it is very under-whelming. It seems Apple last  lost the mojo",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l8261n4/",
      "created": 1718073281,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l84sknn",
      "score": 1,
      "body": "Hope you bought the dip",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84sknn/",
      "created": 1718121657,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l804agd",
      "score": 0,
      "body": "I am fully invested in Ai , specifically OpenAi. what does this mean for microsofts investment in openAi?",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l804agd/",
      "created": 1718045501,
      "depth": 0,
      "replies": [
        {
          "id": "l805r9e",
          "score": 2,
          "body": "Regardless of what they are thinking, I can't help think of this good for OpenAI and Microsoft in general. A rising tide and all that.  Black and white walling off in a growing space is less useful than a chaotic well-meaning competitive-free for all.  \n\nIt's also probably pretty good for NVDA.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l805r9e/",
          "created": 1718045986,
          "depth": 1,
          "replies": [
            {
              "id": "l81kr61",
              "score": 2,
              "body": "Let's face it; at this point just about everything is pretty good for NVDA",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81kr61/",
              "created": 1718064440,
              "depth": 2,
              "replies": [
                {
                  "id": "l829h8t",
                  "score": 1,
                  "body": "except apple doesn't use nvda",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l829h8t/",
                  "created": 1718074749,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l80mrdq",
              "score": 1,
              "body": "nutty practice psychotic physical puzzled vanish command dependent dam versed\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80mrdq/",
              "created": 1718051670,
              "depth": 2,
              "replies": [
                {
                  "id": "l814r84",
                  "score": 1,
                  "body": "they weren't really clear on the server portion. Most calls are local, but they do offload some to their own cloud, and offer integration with OpenAI. They never said what their cloud server run on, and they don't control the OpenAI servers.",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l814r84/",
                  "created": 1718058082,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l82wbzj",
                      "score": 2,
                      "body": "“ChatGPT, seamlessly integrated.\nWith ChatGPT from OpenAI integrated into Siri and Writing Tools, you get even more expertise when it might be helpful for you — no need to jump between tools. Siri can tap into ChatGPT for certain requests, including questions about photos or documents. And with Compose in Writing Tools, you can create and illustrate original content from scratch.\nYou control when ChatGPT is used and will be asked before any of your information is shared. Anyone can access ChatGPT for free, without creating an account. ChatGPT subscribers can connect accounts to access paid features within these experiences.”  https://www.apple.com/apple-intelligence/\n\nHow is this not a huge win for MSFT.  Only way it’s not is if Apple relies less and less on ChatGPT in the future.  But right now it sounds like a lot of stuff will be router there",
                      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l82wbzj/",
                      "created": 1718087181,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l83w1pl",
                          "score": 1,
                          "body": "Watch the video.  Almost none of your requests will go to ChatGPT. That integration is basically a fall back for general knowledge queries, not for personal assistant requests. \n\nPlus it can be replaced by any other AI that wants to integrate.",
                          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l83w1pl/",
                          "created": 1718109738,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l84iw7k",
                              "score": 1,
                              "body": "Searching for knowledge is something people have used Google for this is still a very big deal",
                              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84iw7k/",
                              "created": 1718118418,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l84jfl1",
                                  "score": 1,
                                  "body": "Chargpt is doing the writing and anything really hard. I have tried to ask Siri all kind of questions and realized it doesn’t really know anything this is going to be amazing just like ChatGPT is.",
                                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84jfl1/",
                                  "created": 1718118608,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l84qpo4",
                                      "score": 1,
                                      "body": "Apple Intelligence is going to handle the writing (text generation). Apple Intelligence is not the same as Siri.. although they will be integrated.",
                                      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84qpo4/",
                                      "created": 1718121046,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l84rkik",
                                          "score": 1,
                                          "body": "How did Apple develop this do you think it will be any good compared to ChatGPT to me that’s kind of disappointing as I doubt it will be as good",
                                          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84rkik/",
                                          "created": 1718121331,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l809687",
              "score": 1,
              "body": "Why would it be good for NVDA?\n\nI think most of Apple Intelligence is on Apple hardware. We will see how much functionality is based on ChatGPT",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l809687/",
              "created": 1718047134,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l808gpv",
      "score": -6,
      "body": "I don’t like AI period. Too much for nothing or are we getting lazy?",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l808gpv/",
      "created": 1718046896,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l81behk",
      "score": 0,
      "body": "Finder is still finder.  Which is a deal breaker.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81behk/",
      "created": 1718060672,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l81qf5g",
      "score": 0,
      "body": "I hope so. Over the last few months Apple became my biggest position",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81qf5g/",
      "created": 1718066767,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l80o6p0",
      "score": -7,
      "body": "Let us be honest here. Apple hasnt made a ground breaking device ever. They always make a smoother and attractive looking device with much much limited functionality under the guise of security.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80o6p0/",
      "created": 1718052149,
      "depth": 0,
      "replies": [
        {
          "id": "l80z67m",
          "score": 1,
          "body": "That’s okay. I don’t care as long as they’re making money.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80z67m/",
          "created": 1718055988,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l804vfp",
      "score": -11,
      "body": "AI… Bringing something no one asked for or cared about. No revenue path much less a profit path for AI. Currently is weak and slow and consistently incorrect in the few things it can do. This is extremely bearish… Maybe in another 5 - 10 years it’ll mature into something actually useful and that the general populace wants to have. But in the right here and right now. This is a massive L.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l804vfp/",
      "created": 1718045693,
      "depth": 0,
      "replies": [
        {
          "id": "l805wlg",
          "score": 8,
          "body": "Are you kidding? Everyone wants Siri to work better.  This lets Siri work better, which everyone is asking for.  Massive W because Apple is looking at this from a solution based space rather that the here you go tools that do cool things, it's more let's make the phone do what it does much better to start off with.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l805wlg/",
          "created": 1718046035,
          "depth": 1,
          "replies": [
            {
              "id": "l80cf5j",
              "score": -3,
              "body": "->2% on the day with probably another -5 - -10% by EoW. I think the general sentiment agreed with you/s \n\nThat’s it? Siri regurgitating information found on the internet a little faster and some more slight nuance? That’s your golden goose egg?  Again practical & productive features that the general populace would view as “must-have” is years away. No revenue, much less profit. Bearish News.",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80cf5j/",
              "created": 1718048223,
              "depth": 2,
              "replies": [
                {
                  "id": "l844bxu",
                  "score": 1,
                  "body": "How's that share price prediction going? LMAO.",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l844bxu/",
                  "created": 1718113172,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l849rxt",
                      "score": 0,
                      "body": "Apple up on a partnership with Affirm to further increase the already dramatically increasing household debt values… That shows that demand is even worse than originally thought. That some people are going to take on loans to buy an Apple product. I guess not terrible for Apple in the short term, but extremely bearish news for the market/economy as a whole which will still affect Apple.",
                      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l849rxt/",
                      "created": 1718115223,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l84ak09",
                          "score": 0,
                          "body": "Straight copium - you don't understand what really drives markets.\n\nEnjoy lagging the index.",
                          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l84ak09/",
                          "created": 1718115505,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l89vfi4",
                  "score": 1,
                  "body": "This gets funnier every day.",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l89vfi4/",
                  "created": 1718202302,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8aqmo4",
                      "score": 0,
                      "body": "Indeed. Let’s see how it goes. Even the most optimistic of people know that a 10% increase in Apple is outrageous.",
                      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l8aqmo4/",
                      "created": 1718212959,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8b7mt1",
                          "score": 1,
                          "body": "No - we thought it at 170 was outrageous.\n\n\nYour poor portfolio :(",
                          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l8b7mt1/",
                          "created": 1718218514,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "la3t23y",
                              "score": 0,
                              "body": "Damn your portfolio must be in the dumper 😂😂 Can’t wait to see that -75% loss post soon.",
                              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/la3t23y/",
                              "created": 1719261729,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "la3uc6o",
                                  "score": 1,
                                  "body": "If only your logic made any sense? I'm rolling in it bud 🤣",
                                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/la3uc6o/",
                                  "created": 1719262154,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "lc6xy4n",
                                  "score": 1,
                                  "body": "![gif](emote|free_emotes_pack|joy)![gif](emote|free_emotes_pack|joy)![gif](emote|free_emotes_pack|joy)",
                                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/lc6xy4n/",
                                  "created": 1720447088,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l80kewr",
                  "score": -2,
                  "body": "[Shows what you know, lol.](https://www.reddit.com/r/wallstreetbets/s/6ZzI0EkIp7)\n\nI wouldn't trust you to predict the future cash flows of a banana peel.",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80kewr/",
                  "created": 1718050892,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l808mtb",
          "score": -4,
          "body": "haha, oh wow dude. you should spend 20 minutes on the internet learning about AI and where it's at. 10 years? LMFAO. Ironically two different AI models give us roughly 30% chance of avoiding the existential threat of AI in the next 20 years at our current trajectory.",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l808mtb/",
          "created": 1718046953,
          "depth": 1,
          "replies": [
            {
              "id": "l80bqx9",
              "score": -1,
              "body": "You’re watching a little too much Terminator. 😂😂",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80bqx9/",
              "created": 1718047998,
              "depth": 2,
              "replies": [
                {
                  "id": "l80c1v3",
                  "score": 0,
                  "body": "I've watched countless hours of the leading AI and engineering experts talk about it. Suggest you start with at least a Sesame Street intro course to AI before making your bold predictions.",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80c1v3/",
                  "created": 1718048100,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l80iqbe",
      "score": -5,
      "body": "AAPL: \ngrowth = negative \nP/E ratio = 30\n\nGOOG:\ngrowth ≈ 15%\nPE ratio = 27\n\nHow is it underestimated？",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80iqbe/",
      "created": 1718050336,
      "depth": 0,
      "replies": [
        {
          "id": "l80jgtg",
          "score": 7,
          "body": "Do you not know what is P/E ratio?",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80jgtg/",
          "created": 1718050580,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l80jous",
          "score": 4,
          "body": "their growth is not on a negative trend, why do people keep repeating this",
          "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80jous/",
          "created": 1718050653,
          "depth": 1,
          "replies": [
            {
              "id": "l80wzqy",
              "score": 3,
              "body": "Most people on reddit couldn't spot a trend if the first three numbers were one, two, three.",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80wzqy/",
              "created": 1718055201,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l80x3rd",
              "score": 0,
              "body": "Because it is, peak in revenue back in 2022.   [https://www.macrotrends.net/stocks/charts/AAPL/apple/revenue](https://www.macrotrends.net/stocks/charts/AAPL/apple/revenue)",
              "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80x3rd/",
              "created": 1718055242,
              "depth": 2,
              "replies": [
                {
                  "id": "l80yipd",
                  "score": 1,
                  "body": "They had a massive revenue spike during the pandemic. This is so obviously not long term decline.",
                  "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80yipd/",
                  "created": 1718055754,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l814qbv",
                      "score": 0,
                      "body": "correct but this is Apple, not zoom, so expectations are high.  So having a 2 year decline is hard to stomach",
                      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l814qbv/",
                      "created": 1718058072,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l80vzh1",
      "score": -1,
      "body": "I guess I am the outlier based on talking heads on TV, I found apple announcement a hoe hum moment.  Putting AI in siri.  Siri sucks now, probably the worst product in apple's portfolio.  I personally have never used vision pro, heard good and bad.  But I missed how this makes apple more money,  new phone not ready yet.  Maybe it was my expectation that new phone with AI was coming out.  I think AAPL heading back to 175 range for a couple more quarters",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l80vzh1/",
      "created": 1718054839,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l811dbp",
      "score": -1,
      "body": "Direct user-interfacing AI on a personal device is such a small part of the overall AI market, it's unlikely to have a significant impact on Apple's bottom line, other than keeping them competitive.\n\nBetter on-device AI isn't going to sell more devices for Apple.  It's already an expected part of the user experience, so offering it is essential, yes, but it's not a *differentiator*.\n\nThis announcement really is no more substantial than Apple's Maps app when the market was already dominated by Google, or their voice control (Siri) when it was already a standard offering on other platforms.  \"Me too\" in no way makes them a leader in the AI growth market.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l811dbp/",
      "created": 1718056791,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l81dnl1",
      "score": -1,
      "body": "It's easy to underestimate Apple's performance because of their incredible ability to retain market share with their cult-like following. It's hard to underestimate their products because they're overpriced trash, but don't let that distract you from the fact that they know how to milk money from their customer base. That said, they're still pretty high right now, the tech sector is very inflated.",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l81dnl1/",
      "created": 1718061568,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l83esss",
      "score": -1,
      "body": "Its probably because the news were out dated , everything they showcased is already out years now, the fact that apple is also doing it is what keeps the stock so high, but dont expect some jump simply because they said “look we will do it too”",
      "permalink": "/r/stocks/comments/1dct1uw/underestimating_aapl/l83esss/",
      "created": 1718100448,
      "depth": 0,
      "replies": []
    }
  ]
}