{
  "title": "Perion (Ticker symbol: PERI), having a value that the market has not priced in yet. Part 1",
  "score": 25,
  "selftext": "I don't blindly follow \"buy the dip mania\" because there are reasons why the dip is happening. Perion dipped around 30% today because it **updates guidance that completely missed the expectations and prior forecasts**. However, what if I tell you that this is a rare mispriced opportunity that many of the market participants **1. either missed the points, 2. understood the situation but didn't go over the numbers?**\n\n\n\nLets quickly run through the company 20F (10K equivalent but for foreign companies)\n\n  \n1. Perion's business mainly focuses on digital advertising with it's revenue from the segment of Display Advertising and Search Advertising which contains the subsegments like CTV, Retail market media, DOOH (Digital out-of-home) and so on.  *NGL it sounds likes a mid business model with a relatively weak moat and limited future imagination when I first read this.*\n\n  \n2. Revenue steadily increases for the last couple of years until 2024.\n\n* **Display Advertising:**\n   * 2022: $360,690\n   * 2023: $398,244\n   * **Increase:** 10.41%\n* **Search Advertising:**\n   * 2022: $279,566\n   * 2023: $344,911\n   * **Increase:** 23.37%\n* **Total Revenue:**\n   * 2022: $640,256\n   * 2023: $743,155\n   * **Increase:** 16.07%\n\nNow comes the disastrous number in their guidance: \n\n* Perion cut its second-quarter revenue guidance to $106 million – $108 million (vs. consensus $120.035 million) from $118 million – $122 million. \n   *  FY24 revenue forecast from $590 million – $610 million to $490 million – $510 million (vs. the consensus of $601.005 million)\n* The company also slashed its second-quarter adjusted EBITDA outlook to $6.5 million – $7.5 million (from $10 million – $12 million).\n   * Adjusted EBITDA to $48 million – $52 million from $78 million – $82 million earlier.\n\nEverything looks terrible right? A very mid business model and terrible recent guidance discourage most of the investors out there and, to be honest, a drop in share price is very justified, but what if I tell you that the numbers after the drop does make sense?\n\n  \nLets examine some important metrics their three statements\n\n1. **Market cap currently sits at 401 million dollars** \n\n2. **Net asset as of Q1 2024 is around 734 million dollars**\n\nHUH? WAIT THAT DOESN'T MAKE SENSE. Okay from the prior experience, they could have intangible assets in their book which is pretty deceiving so let's take those out:\n\n3. **Net tangible book value (which is net asset - intangible asset) as of Q1 2024 is around** 402 **million dollars**\n\n  \n**Net tangible book value > Market Cap ??? Huh?**\n\nOkay, the market has to already factor in future loss or even bankruptcy, but remember the earlier guidance number shows that their adj EBITDA is positive 50 million in the midpoint? so it doesn't make sense at all.\n\n  \nWith a good tracker record of earnings double beat, I doubt the management would overestimate the already miserable current year outlook. We can say its guidance will probably be the actual case with a good confidence. \n\n  \nSome of you intelligent accountant out there might say: \"Okay but Adjusted EBITDA doesn't mean a GAAP or even Non GAAP profit, SBC could still destroy shareholder value\". *This is true, but notice how we can compare and see a similar case to this with their FY 2021, where the revenue is around 478 million and EBITDA is 55 million? With higher labor and overall cost (credit to inflation),* ***Actual FY 2024 profitability might be worse than FY 2021 but here the thing: I will look into more details and make a three-statement model with DCF model to see if all of my thesis is accurate.***\n\n  \nTLDR: Unless the business is really on its way to bankruptcy, this is a massive mispriced opportunity given that 1. the company is profitable, 2. they also have their own adoption and investment in AI, 3.Tangible book > market cap. They don't have to grow, they don't even need to maintain their current situation as long as the business is still alive, this investment is profitable.\n\n  \nPostions: shares with leap calls. Part 2 or even 3 might come out depending on my time schedule and how well this post goes.\n\n  \n",
  "link_flair_text": "DD",
  "id": "1dcu4en",
  "num_comments": 21,
  "created_utc": 1718047546,
  "permalink": "/r/wallstreetbets/comments/1dcu4en/perion_ticker_symbol_peri_having_a_value_that_the/",
  "comments": [
    {
      "id": "l80aepb",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 3 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dcu4en/perion_ticker_symbol_peri_having_a_value_that_the/l80aepb/",
      "created": 1718047550,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l81n3aa",
      "score": 3,
      "body": "Great write up! I’m checking it out tonight. Looking forward to your valuation modeling.",
      "permalink": "/r/wallstreetbets/comments/1dcu4en/perion_ticker_symbol_peri_having_a_value_that_the/l81n3aa/",
      "created": 1718065402,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l80hmyu",
      "score": 2,
      "body": "What about that dead relationship with Bing? Isn t Monica upset?",
      "permalink": "/r/wallstreetbets/comments/1dcu4en/perion_ticker_symbol_peri_having_a_value_that_the/l80hmyu/",
      "created": 1718049971,
      "depth": 0,
      "replies": [
        {
          "id": "l80jd6e",
          "score": 3,
          "body": "As I mentioned in the post this is absolutely bad news but stock market is forward looking. Their business went from heavily focused and tied to bing to right now after this disaster, only 5% or less related to bing which gives two implications: 1. this dead relationship priced in from the massive massive drop this year 2. Without one customer constitute a major part of their revenue, they are more diversified with their current offerings.",
          "permalink": "/r/wallstreetbets/comments/1dcu4en/perion_ticker_symbol_peri_having_a_value_that_the/l80jd6e/",
          "created": 1718050547,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l81edsg",
      "score": 2,
      "body": "thanks for the write up. thought it was just another dead adspace company but jeez, their operating cash flow is positive and their current assets less liabilities alone justifies their market cap. crazy",
      "permalink": "/r/wallstreetbets/comments/1dcu4en/perion_ticker_symbol_peri_having_a_value_that_the/l81edsg/",
      "created": 1718061857,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l82ekq3",
      "score": 2,
      "body": "Eh, I've tried their mineral water. It was alright",
      "permalink": "/r/wallstreetbets/comments/1dcu4en/perion_ticker_symbol_peri_having_a_value_that_the/l82ekq3/",
      "created": 1718077105,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l80hokz",
      "score": 1,
      "body": "What strike price are you eyeing on the leaps?",
      "permalink": "/r/wallstreetbets/comments/1dcu4en/perion_ticker_symbol_peri_having_a_value_that_the/l80hokz/",
      "created": 1718049986,
      "depth": 0,
      "replies": [
        {
          "id": "l80i8yd",
          "score": 2,
          "body": "Me personally, 7.5 and 10, (possibly 12.5 but I don’t have position for that yet). Not  financially advice tho",
          "permalink": "/r/wallstreetbets/comments/1dcu4en/perion_ticker_symbol_peri_having_a_value_that_the/l80i8yd/",
          "created": 1718050175,
          "depth": 1,
          "replies": [
            {
              "id": "l8lg2fv",
              "score": 1,
              "body": "Prices not doing well",
              "permalink": "/r/wallstreetbets/comments/1dcu4en/perion_ticker_symbol_peri_having_a_value_that_the/l8lg2fv/",
              "created": 1718379974,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l81n55v",
      "score": 1,
      "body": "Did you choose 25 or 26 LEAPS?",
      "permalink": "/r/wallstreetbets/comments/1dcu4en/perion_ticker_symbol_peri_having_a_value_that_the/l81n55v/",
      "created": 1718065424,
      "depth": 0,
      "replies": [
        {
          "id": "l81nllu",
          "score": 2,
          "body": "The majority is 26, a small amount in 25",
          "permalink": "/r/wallstreetbets/comments/1dcu4en/perion_ticker_symbol_peri_having_a_value_that_the/l81nllu/",
          "created": 1718065614,
          "depth": 1,
          "replies": [
            {
              "id": "l82lqgq",
              "score": 1,
              "body": "It’s definitely interesting. Thanks for this!",
              "permalink": "/r/wallstreetbets/comments/1dcu4en/perion_ticker_symbol_peri_having_a_value_that_the/l82lqgq/",
              "created": 1718080785,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8212sn",
      "score": 1,
      "body": "These Israel stocks have been beating me up",
      "permalink": "/r/wallstreetbets/comments/1dcu4en/perion_ticker_symbol_peri_having_a_value_that_the/l8212sn/",
      "created": 1718071199,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8fbk7b",
      "score": 1,
      "body": "I started a small tracking position. I’m not very diversified, and agree this may be a good ballast/value opportunity, though my DD is ongoing.",
      "permalink": "/r/wallstreetbets/comments/1dcu4en/perion_ticker_symbol_peri_having_a_value_that_the/l8fbk7b/",
      "created": 1718286592,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l81yafj",
      "score": 1,
      "body": "Book value doesn't always mean that the market cap should be at least the same value as that, case in point: Spirit and WBD.",
      "permalink": "/r/wallstreetbets/comments/1dcu4en/perion_ticker_symbol_peri_having_a_value_that_the/l81yafj/",
      "created": 1718070045,
      "depth": 0,
      "replies": [
        {
          "id": "l826zft",
          "score": 1,
          "body": "There is a huge difference between book value and tangible book value where WBD has billions of good will and intangibles so WBD has massive negative tangible book value. \n\nIn the case of spirit, the structure of their asset is largely different from the case of PERI because most of their assets consists of mostly PP&E. We all know that airline PP&E are heavily discounted AND another reason spirit’s tangible book > market cap belong to their huge operating loss quarter over quarter along with imminent debt due. \n\nPeri net tangible book > market and it’s profitable so that’s not the only point that backs up the valuation.",
          "permalink": "/r/wallstreetbets/comments/1dcu4en/perion_ticker_symbol_peri_having_a_value_that_the/l826zft/",
          "created": 1718073685,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l832emy",
      "score": -1,
      "body": "Pumping a fraudulent company. It’s going to go to <$5.",
      "permalink": "/r/wallstreetbets/comments/1dcu4en/perion_ticker_symbol_peri_having_a_value_that_the/l832emy/",
      "created": 1718091393,
      "depth": 0,
      "replies": []
    }
  ]
}