{
  "title": "The Regard case for WBD. Hear me out.",
  "score": 41,
  "selftext": "I’m a full regard so I love garbage. WBD is such garbage stock. But there’s real treasure in the trash sometimes. Like some old lady buying a Picasso print at the thrift store for five bucks. Why is WBD treasure in the trash?\n\nOkay so the entertainment business has been trash for a while now. Covid killed theaters, streaming is a trash business and is consolidating, the tech bros are going to ruin the movie business just like they ruin everything else. So the WBD stock is way down. A trash stock in a trash industry.\n\nBut what I like is the IP. It’s fucking WARNER BROS! It’s fucking HBO! It’s Harry Potter, Lord of the Rings, Batman, ~~TMNT~~, Dune, The Matrix, Game of Thrones, The Sopranos, Barbie! These are iconic and beloved titles that will have huge value for the foreseeable future. Every time there’s a new streaming service, new video format, new theme park, new video game, new fucking slot machines, new anything, this IP will get monetized the fuck out it.  They own Police Academy which I know you love because you are in this sub like me.\n\nAnd yes Zazlav is an asshole. It’s just what this dumb industry needs. An asshole BUSINESSMAN. Unemotional, cunning, cutthroat. Will break your heart by killing some superhero nerd fest for the sweet tax breaks. And he’s paying down debt like a beast. People in Hollywood hate him with a passion and that’s how you know he’s good.\n\nSo what’s the upshot? Well the intrinsic FCF value is $27. Current share price around 8?  For a ratio of .3. Historically, that is at the absolute low end. It’s been as high at 1.5 in the last ten years. \n\nDo I really understand any of that? Clearly not. Maybe all of this is bullshit. What am I a quant? I’m betting on the company being in a cyclical slump because of covid and strikes, with huge potential because of the IP and the leader not afraid to be a huge prick. Also the the historic median Price-to-Intrinsic-Value-Projected-FCF is .69 - which is good enough for me.\n\nThis motherfucker is beaten down and once it pays off the merger debt and the streaming consolidation settles, this dog will hunt. We’re talking at least $18 in the next twelve months. And the bear case is around $7. Huge upside, minimal downside. \n\nI know this is a gambling sub, but even in a casino you wanna find the roulette wheel with just one green and not those sucker ones with three. \n\nTL;DR - Huge IP value, ruthless asshole CEO, entertainment biz is shit right now but WB is iconic and will bounce back bigly. \n\nThis is clearly not financial advise. I’m a dumbass creative and not some Wall Street douche. Tell me why I am wrong.",
  "link_flair_text": "Discussion",
  "id": "1dd6fy1",
  "num_comments": 36,
  "created_utc": 1718083132,
  "permalink": "/r/wallstreetbets/comments/1dd6fy1/the_regard_case_for_wbd_hear_me_out/",
  "comments": []
}