{
  "title": "Logitech (LOGI) DCF Analysis",
  "score": 22,
  "selftext": "# Introduction:\n\nThe gaming industry has taken off in recent years, with an estimated market worth of USD 250 Billion ([SOURCE](https://www.precedenceresearch.com/video-game-market#:~:text=The%20global%20video%20game%20market,forecast%20period%202024%20to%202033.)). The company that helps power a significant chunk of the industry with peripherals is LOGI, from Keyboards to Headsets LOGI has a product for the entire spectrum of gaming needs. LOGI is held in high regard for the strong quality and longevity of its products, this strong reputation allows LOGI to come out ahead of its competitors in an oligopolistic market. On top of their bet on gaming, LOGI has also invested significantly into products for working. With their well-known gadgets for video conferencing, the brand of LOGI has expanded into multiple categories while still maintaining the high standards of LOGI.\n\n\n\n# Market:\n\n***Gaming***\n\nModern video game development has become an expensive and risky endeavor. The inflating quality of “AAA” game titles, places pressure on firms to throw even more money at trying to improve game quality and on marketing the game. However, despite the best efforts of the developers the game may ultimately not take off due to the ever-increasing pool of games that are coming out. This has led developers and investors to be more risk-averse, preferring to invest behind “safe” titles such as Call of Duty with a massive fan base. Or, developers decide to shift over to a new model that is less risky, the Live Service game. Live services allow developers to implement micro-transactions and earn a stable cash flow through the sale of in-game items.  However, a bright spot for the gaming industry is that many of the current popular games can run on older versions of graphic cards that are cheaper. Gamers in developed markets pursue the newest graphics card, flooding the market with older versions of graphics cards and hence reducing the price of older graphics cards. All of this increases the affordability of gaming, granting gamers in developing markets the chance to participate in popular games and increasing the TAM. ([SOURCE](https://www.digitaltrends.com/computing/gpu-price-tracking/#:~:text=Older%20graphics%20card%20prices%20are,3070%20Ti%2C%20are%20fairly%20reasonable.))\n\n***China***\n\nHowever, in China, there are massive crackdowns on gaming for minors ([SOURCE](https://apnews.com/article/gaming-business-children-00db669defcc8e0ca1fc2dc54120a0b8)), with strict regulations restricting minor’s access to video games to 1 hour per day and needing facial recognition to register an account. The gaming market in China may slow down in the coming years as youths are less likely to develop a habit for gaming, which they will carry on into their later life. But, as of now the Chinese market is still mainly dominated by older players with the average age of gamers in China being 35 ([SOURCE](https://www.china-briefing.com/news/chinas-gaming-industry-trends-and-regulatory-outlook-2024/#:~:text=The%20gaming%20sector%20in%20China,(CAGR)%20of%207.63%20percent.)). On top of that, China’s National Press and Publication Administration (NPPA) has to approve game titles, offering them licenses before they can be released on the Chinese app store limiting the exposure of Chinese consumers to the gaming market.\n\n***Remote Working***\n\nThe pandemic has forced firms and employees alike to adapt to home-based work, with employees scrambling to get the necessary hardware and employers acquiring the necessary software to maintain levels of productivity. This has led to the global economy being well-shaped to support work from home. According to McKinsey, about 20% of the workforce for advanced economies can maintain their office-based levels of productivity with 3-5 days of remote work ([SOURCE](https://www.mckinsey.de/~/media/mckinsey/locations/europe%20and%20middle%20east/deutschland/news/presse/2021/2021-02-18%20-%20mgi%20future%20of%20work%20after%20covid-19/mgi_the%20future%20of%20work%20after%20covid-19_report_feb%202021.pdf)).  There is a large labor shortage of skilled labor ([SOURCE](https://www.mckinsey.com/industries/education/our-insights/demand-for-online-education-is-growing-are-providers-ready)), which means that the job market is more candidate-driven, with “65% of the American workforce currently working remotely or in a hybrid work environment want to continue to do so” ([SOURCE](https://scmtalent.com/why-remote-working-will-die/)), this means that the trend of remote work will continue.  On top of remote working, LOGI could potentially benefit from classrooms  shifting online, “Turns out that kids using our headsets have more peace and quiet and actually read 40% more books in class than before.” - 2023 Q4 10-K.\n\n\n\n# Investment Thesis:\n\n***Shifting Consumer Habits***\n\nAs hybrid work arrangement becomes the norm around the world, more consumers are setting up their homes to accommodate this arrangement better. The shift towards hybrid work also means that busy working adults who previously did not have time to play video games now have more time to do so. This would greatly increase the demand for LOGI’s products as the company tailors its products to fit the needs of this large group of consumers. On top of that, the introduction of cloud game streaming such as GeForce Now, will reduce the large hurdle of lower quality hardware that less wealthy gamers face when attempting to play video games, this will massively increase the TAM for LOGI.\n\n***Strong Consumer Sentiments***\n\nGiven that gaming peripherals and other hardware are highly technical which is confusing to the average consumer and the products are only slightly differentiated, most people rely on online reviews to make their decision on which brand of hardware to purchase. “93% of whom believe that these online reviews help them to improve the accuracy of purchase decisions” ([SOURCE](https://www.frontiersin.org/journals/psychology/articles/10.3389/fpsyg.2022.865702/full)). According to management, LOGI is the market leader in terms of market share in multiple categories such as “Gaming”, “Keyboards and Combos”, “Pointing Devices”, and “Video Conferences”. This demonstrates the high quality and strong sentiments of consumers regarding LOGI’s products, which leads to a strong preference for LOGI's products over a competitor's.\n\n***Large Switching Cost***\n\nLOGI has adopted the ecosystem business model popularized by many leading tech companies, integrating this approach into their products. LOGI offers a wide range of products from mice to headsets to webcams, these products are tied together by LOGI’s proprietary software the Logitech G Hub. Logitech G Hub allows consumers to customize their hardware and curates a unique experience that may not be found in other brands. The trust in LOGI’s brand is also strong amongst existing customers, which may increase the reluctance to defect to a competitor’s brand.\n\n\n\n# Revenue:\n\n***Overall***\n\nWhen forecasting revenue, I split revenue into Gaming and Non-Gaming segments. As LOGI is known for its gaming peripherals I classified “Gaming”, “Keyboards and Combos”, and “Headsets” under the Gaming segment. The rest is classified under the Non-Gaming segment. I believe that historically LOGI’s revenue has been falling due to poor macro-environment and tight labor market affecting a firm’s willingness to expand and hire. This has led to a lesser need for computer peripherals, ultimately I believe that the market will require 4 years to return to pre-covid normal.\n\n***Gaming***\n\nLooking at the total number of video game users ([SOURCE](https://www.statista.com/statistics/748044/number-video-gamers-world/)) and the total world population ([SOURCE](https://www.statista.com/statistics/262618/forecast-about-the-development-of-the-world-population/#:~:text=World%20population%20-%20forecast%20about%20the%20development%202022-2100&text=Before%202025%2C%20the%20world%27s%20total,rates%20are%20expected%20to%20decrease.)). The best-selling games are on the PC ([SOURCE](https://www.forbesindia.com/article/explainers/best-selling-video-games-world/90635/1)). These games require a mixture of Headphones, Keyboards, Mouse, and Gaming peripherals, making it highly lucrative for LOGI to target this market as it can cross-sell multiple of its products to the same customer.\n\nWhen forecasting Logitech Users, to be conservative I assumed that Logitech would be able to defend its market share given that LOGI is still well-perceived by consumers and firms. So I forecasted LOGI to grow at a % of the historic average.\n\nWhen forecasting Revenue/User, I believe that a few factors will contribute to Revenue/User growth. Firstly, an increase in exposure of the average consumers to video games especially given the extent of marketing most developers do. Secondly, an increase in the affordability of video games, given the advancement of cloud game streaming and older versions of powerful graphic cards which become cheaper. Lastly, given that gaming peripherals are only slightly differentiated consumer sentiments such as online reviews play a large role in a consumer’s purchasing decision. \n\n***Non-Gaming***\n\nLooking at the total number of computer households ([SOURCE](https://www.statista.com/forecasts/1146269/computer-households-in-the-world)), which is defined as the total number of households that possess at least 1 computer. The current internet penetration rate globally is 66.2% ([SOURCE](https://datareportal.com/reports/digital-2024-deep-dive-the-state-of-internet-adoption#:~:text=The%20latest%20country%2Dlevel%20data,now%20sits%20at%2066.2%20percent.)), I believe that the internet penetration rate will only increase as governments globally recognize the importance of the internet and individual consumers recognize the value of the internet. \n\nWhen forecasting the number of computer households and Logitech users, to remain conservative I forecasted it as a % of historic averages tapering downwards.\n\nWhen forecasting Revenue/Household, given that most computer peripherals when used only for working can last a significantly longer time than when used for gaming. I forecasted Revenue/Households to grow at a slower rate over time.\n\n\n\n# Cost:\n\n***COGS***\n\nLOGI will offer more promotions and cut into gross margins to defend/grow market share. “The long-term model, 39% to 44%, makes perfect sense…I wouldn't encourage you to go to the high end of the model permanently because competition can be fierce, and we will defend our turf.” - 2023 Q4 10-K.\n\nWhen forecasting COGS, I assumed that LOGI would remain in the middle of their expected margins.\n\n***Marketing***\n\nWhen forecasting Marketing, given that the computer peripherals market is not heavily differentiated. I assumed that LOGI has to maintain its historic marketing spend to remain relevant and continue attracting consumers.\n\n***R&D***\n\nWhen forecasting Marketing, given that the computer peripherals market is not heavily differentiated. I assumed that LOGI in the short run would spend a greater sum to realize their AI-integrated products, however over time I assumed that R&D could taper downwards. \n\n***G&A***\n\nRegarding the total headcount of LOGI from ([SOURCE](https://stockanalysis.com/stocks/logi/employees/)). When forecasting the number of employees, I assumed that LOGI would begin ramping up hiring only when the poor macro-environment and tight labor market are resolved. \n\nWhen forecasting Cost/Employee, opting for less granularity I forecasted it as a % of historic averages.\n\n***Others***\n\nWhen forecasting others, opting for less granularity I forecasted it as a % of historic averages.\n\n\n\n# Sanity Check:\n\nIn FY24, as a % of the total world population 31.8% of the population were video game users. At the end of my forecast, I assumed that number would increase to 34.76%. I believe that this number is realistic given the large shift in consumer habits, the continuously improving quality of video games, and the affordability of video games due to cloud game streaming and stronger older versions of graphic cards.\n\nIn FY23, management stated that they held 30% of the market share, at the end of my forecast I assumed that the % market share would remain constant at about 30.27%. I believe that this number is conservative given the positive consumer sentiment around LOGI’s products and the significant barriers to entry into the gaming peripheral market.\n\n\n\n# WACC:\n\n10Y T-Bond Yield (1M Avg) = 4.43%  \nBeta ([SOURCE](https://finance.yahoo.com/quote/LOGI/)) = 0.56  \nStable Market ERP ([SOURCE](https://pages.stern.nyu.edu/~adamodar/New_Home_Page/datafile/ctryprem.html)) = 4.60%  \nCOE = 7.01%  \n\n\nLogitech does not have a bond rating and has never issued bonds, so I’m unable to solve for a synthetic rating or book value interest.  \n\n\nStock Price (5D Avg) = $100.71  \nShares O/S = 153.44M  \nMarket Value of Equity = 15452.94M  \n%Equity = 100%  \n%WACC = 7.01%\n\n\n\n# Conclusion:\n\nUltimately in my base case, I value LOGI at $90.80 per share, I believe that LOGI is more or less correctly priced given how diluted the gaming market is. This level of dilution has led to large risks amongst the existing firms trying to differentiate themselves. I believe that the only way for LOGI to progress forward or have large growth in their stock price is for them to be able to identify an even stronger USP in the future to stand out amongst only slightly differentiated products. \n\n  \nBase Case: \\[[INSERT](https://imgur.com/a/BcZU3Cz)\\]  \nWorst Case: \\[[INSERT](https://imgur.com/a/oc2TAZk)\\]  \nBest Case: \\[[INSERT](https://imgur.com/a/HrHZM6b)\\]  \nRevenue Model: \\[[INSERT](https://imgur.com/a/uybDOOX)\\]  \nCost Model: \\[[INSERT](https://imgur.com/a/K9tjNx3)\\]  \nChange in NWC Schedule: \\[[INSERT](https://imgur.com/a/b8rH7lS)\\]  \nSanity Check: \\[[INSERT](https://imgur.com/a/yDkEpvp)\\]\n\n",
  "link_flair_text": "Company Analysis",
  "id": "1ddfmz0",
  "num_comments": 0,
  "created_utc": 1718116482,
  "permalink": "/r/stocks/comments/1ddfmz0/logitech_logi_dcf_analysis/",
  "comments": []
}