{
  "title": "Warner Bros. Discovery strikes 10-year French Open U.S. broadcast deal ",
  "score": 34,
  "selftext": "Warner Bros. Discovery’s TNT Sports will be the new exclusive U.S. broadcaster of the French Open, also known as Roland-Garros, beginning in 2025, the company announced Tuesday.\n\nThe entertainment company signed a 10-year contract with the French Tennis Federation for an average of about $65 million per year, according to a person familiar with the matter.\n\nThe deal is set to make Warner Bros. Discovery the largest global broadcast partner to the Grand Slam tournament, which hosted 675,000 spectators this year. Warner Bros. Discovery-owned Eurosport has been broadcasting the French Open to 55 countries outside the U.S. since 1989, according to a press release.\n\n“Roland-Garros perfectly aligns with our global sports strategy and our commitment to adding premium live sports content to our TNT Sports portfolio. We look forward to serving fans with a best-in-class content experience and providing them with direct access to more live Roland-Garros coverage than ever before,” TNT Sports Chairman and CEO Luis Silberwasser said in the release.\n\nPer the agreement, the matches will be broadcast live on TNT, TBS and TruTV, including simulcasts on the company’s streaming platform Max.\n\nBefore this deal, the tournament was broadcast in the U.S. by Comcast’s NBC and streaming service Peacock and the Tennis Channel through a sublicensing deal.\n\nTNT Sports announced it will have an on-site presence, including studio and announcing teams from multiple positions inside the Roland Garros Stadium in Paris, with further details on coverage to be announced in the coming months.\n\nThe news comes as Warner Bros. Discovery is launching a joint sports streaming service called Venu with Disney’s ESPN and Fox. Venu is set to launch this fall and will include TNT, TBS and TruTV in its offering of channels.\n\nAdding the French Open is more evidence that the company wants to add live sports if the price makes sense for the investment. In the past three years, TNT Sports has acquired rights for the National Hockey League, NASCAR, U.S. Soccer, the College Football Playoffs (through a sublicensing deal with ESPN), and now the French Open.\n\nMeanwhile, Warner Bros. Discovery is still in negotiations with the NBA to extend its partnership to broadcast live games. While NBCUniversal has made an offer for the package of games TNT Sports has been carrying, Warner Bros. Discovery is focusing on a different package of games, CNBC previously reported.\n\nWith the hangover from the Hollywood writers’ strike and cost-cutting measures across the industry, including at Warner Bros. Discovery, media giants have been leaning heavily on sports as a way to bring in bigger audiences and more advertising dollars.\n\nSource: https://www.cnbc.com/2024/06/11/warner-bros-discovery-french-open-us-broadcast-deal.html",
  "link_flair_text": null,
  "id": "1ddm652",
  "num_comments": 6,
  "created_utc": 1718132618,
  "permalink": "/r/stocks/comments/1ddm652/warner_bros_discovery_strikes_10year_french_open/",
  "comments": [
    {
      "id": "l880h9c",
      "score": 9,
      "body": "Good, fuck nbc and peacock and their shitty French Open schedule. Same day, you had to switch between 3 different channels at random hours to watch tennis in the US.",
      "permalink": "/r/stocks/comments/1ddm652/warner_bros_discovery_strikes_10year_french_open/l880h9c/",
      "created": 1718165083,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87xxlf",
      "score": 5,
      "body": "Ive made wrong calls before but this one I just do not see. Yes they have massive debt but have been crushing earnings, paying it off ahead of schedule, and making strategic moves consistently.",
      "permalink": "/r/stocks/comments/1ddm652/warner_bros_discovery_strikes_10year_french_open/l87xxlf/",
      "created": 1718163858,
      "depth": 0,
      "replies": [
        {
          "id": "l887h9m",
          "score": 6,
          "body": "WBD feels like one of those stocks when it is near 52 weeks lows it gets trashed and not many people want to admit they own. But if it ever goes to a 52 week high suddenly you see people on forums pop out that they were always long and were buying during the 52 week low.",
          "permalink": "/r/stocks/comments/1ddm652/warner_bros_discovery_strikes_10year_french_open/l887h9m/",
          "created": 1718168809,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l86v6bw",
      "score": -9,
      "body": "Is Warner Brothers even gonna be a thing in 5 years? Talk about a shit show of a company. ",
      "permalink": "/r/stocks/comments/1ddm652/warner_bros_discovery_strikes_10year_french_open/l86v6bw/",
      "created": 1718147091,
      "depth": 0,
      "replies": [
        {
          "id": "l88r2bq",
          "score": 9,
          "body": "It has a free cash flow yield of $6 billion dollars a year, does that sound like a company going out of business. Come on now",
          "permalink": "/r/stocks/comments/1ddm652/warner_bros_discovery_strikes_10year_french_open/l88r2bq/",
          "created": 1718181990,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l87e6qo",
          "score": 3,
          "body": "alien documentaries on discovery channel, \"1000th season\" of deadliest catch...",
          "permalink": "/r/stocks/comments/1ddm652/warner_bros_discovery_strikes_10year_french_open/l87e6qo/",
          "created": 1718155061,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}