{
  "title": "[deleted by user]",
  "score": 1340,
  "selftext": "[removed]",
  "link_flair_text": null,
  "id": "1ddm4ky",
  "num_comments": 196,
  "created_utc": 1718132514,
  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/",
  "comments": [
    {
      "id": "l85w64u",
      "score": 660,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l85w64u/",
      "created": 1718134750,
      "depth": 0,
      "replies": [
        {
          "id": "l85xpso",
          "score": 283,
          "body": "Finance Department: What more cuts can we make so we save more money from these loss in sales???",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l85xpso/",
          "created": 1718135263,
          "depth": 1,
          "replies": [
            {
              "id": "l8709zg",
              "score": 68,
              "body": "Let’s hire more bean counters. Maybe give McKinsey a call",
              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8709zg/",
              "created": 1718149131,
              "depth": 2,
              "replies": [
                {
                  "id": "l871q47",
                  "score": 18,
                  "body": "I’d bet my BA portfolio that MBB will sooner or later be brought to the spotlight and not in a nice way in this saga. Capable of anything, Accountable for nothing",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l871q47/",
                  "created": 1718149724,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8789gu",
                  "score": 4,
                  "body": "As a bean counter I assure you, we are amongst the first to go because we start asking questions first haha.\n\n“Last year we spent $2,000,000 on bolts. This year we spent $2. Do we have too much inventory?  Yes?  How? We just don’t use them???”",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8789gu/",
                  "created": 1718152499,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l87ag7b",
              "score": 3,
              "body": "Risk management: our risk is going down substantially with every 737 we don’t sell. Stock should moon!",
              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87ag7b/",
              "created": 1718153445,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8782qd",
              "score": 2,
              "body": "Hire more sales /s",
              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8782qd/",
              "created": 1718152418,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l860ihq",
          "score": 59,
          "body": "why does a big company like Boeing has to learn it now? \n\nit’s self-evident that you don‘t do it",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l860ihq/",
          "created": 1718136193,
          "depth": 1,
          "replies": [
            {
              "id": "l8651qc",
              "score": 76,
              "body": "The lie that gets told is that the engineers are being too conservative. The second lie that gets told is they can run leaner without sacrificing quality. ",
              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8651qc/",
              "created": 1718137686,
              "depth": 2,
              "replies": [
                {
                  "id": "l86dnh4",
                  "score": 37,
                  "body": "Yes, engineers being too conservative is most definitely a lie. Engineers care about the product and they also care about innovation. Innovation is all engineering. And innovation requires risk. The difference is that the engineers prefer to spend more money on quality control and R&D while the finance bros would prefer to take it as profit so they can brag about the margins and receive personal benefits from the big daddy shareholders.",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86dnh4/",
                  "created": 1718140578,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l875hyd",
                      "score": 13,
                      "body": "people who cut quality for money need to get punished. I'm tired of this enshittification timeline",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l875hyd/",
                      "created": 1718151312,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l87cw54",
                      "score": 2,
                      "body": "Yet with this happening they aren’t able to brag about margins when sales are declining. So, are you saying that the finance department of Boeing has a desire to maximize profit but is so incompetent they ended up doing the opposite?",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87cw54/",
                      "created": 1718154511,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l87erdr",
                          "score": 2,
                          "body": "That'a quite literally exactly what happened with Boeing. In their hunt to maximize profits they focused on minimizing cost, which ended up ruining the business.",
                          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87erdr/",
                          "created": 1718155303,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l89gqlj",
                              "score": 2,
                              "body": "They had 20 years of outsized returns. Shareholders and management are laughing all the way to the bank.",
                              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l89gqlj/",
                              "created": 1718196681,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l89gl9t",
                      "score": 2,
                      "body": "> big daddy shareholders\n\nA firm’s sole responsibility is to produce value for shareholders. 20 years of cuts did produce superior returns for Boeing shareholders. Literally, this entire saga is an exercise of a firm doing exactly what they are designed to do under capitalism.\n\nKeep in mind I’m very open to changing this paradigm but I keep seeing things implying companies are supposed to be run differently. They aren’t. This is a firm operating *correctly* under capitalism.",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l89gl9t/",
                      "created": 1718196620,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8i22k6",
                          "score": 1,
                          "body": "Maybe you are misunderstanding what we're saying, but what people here, including me, are doing is criticizing the paradigm you identified. It's not that we thought capitalism would do better, is that we are simply frustrated that the engineers were neglected and Boeing was ruined as a result. We're saying that we want a paradigm that isn't as focused on short-term profits because it hurts society.\n\nI also think people aren't necessarily implying one thing or another about how it's *supposed* to run. Rather, they are implying how things *should* run. There is a key difference.",
                          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8i22k6/",
                          "created": 1718320415,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8mdu7r",
                              "score": 1,
                              "body": "But what’s short-term profits? These design and management issues took 20 years to manifest. Boeing was a darling stock until 2018/2019. This started happening in the 90’s.\n\nAgain, the structures incentivized this. Boeing is not unique. Unless we change the structures then the MBA will beat out the engineer. There are plenty of people here who think this bad management will inspire other companies to improve, they won’t. And engineers won’t be listened to until years after the deaths and the company is folded.",
                              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8mdu7r/",
                              "created": 1718391407,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l86xgur",
              "score": 29,
              "body": "Disclaimer: I work in an oil refinery, not aerospace\n\nIt is absolutely not self evident. It SHOULD be, but it’s not. At least not to everyone.\n\nAnecdotal evidence: One of the high-speed pumps kept tearing up its gearbox. It’s a known problem with this gearbox. The upgraded gear box solves the problem. The upgraded gearbox was ~$85,000. The same, defective design was $20,000. The company bought the old design. The reason? By the time the gearbox gets torn up again, that will be a different quarter’s maintenance budget. Never mind the inherent risk of a pump tearing itself apart, the risk to operators shutting down and decontaminating the equipment, and the risk of maintenance swapping the gearbox. \n\nWe saved $65,000 this quarter. Go us!",
              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86xgur/",
              "created": 1718148005,
              "depth": 2,
              "replies": [
                {
                  "id": "l87beaq",
                  "score": 6,
                  "body": "What a perfect example of engineers yet again being dismissed by corporate. Thanks for sharing that.",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87beaq/",
                  "created": 1718153863,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l86d3qg",
              "score": 32,
              "body": "Finance bros aren't too familiar with common sense a lot of the time. It's rather telling that a lot of the most successful companies with revolutionary business-models are often run by engineers.. The truth of the matter is that finance bros are taught to increase profits. It's a warning sign when the engineers are getting phased out by the people with business and finance educations.",
              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86d3qg/",
              "created": 1718140390,
              "depth": 2,
              "replies": [
                {
                  "id": "l86k04z",
                  "score": 28,
                  "body": "Not just increase profits, increase SHORT TERM profits at the expense of all else, even long term profits. They care about getting the biggest bonus for the next quarter or year, they don’t care much beyond that.",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86k04z/",
                  "created": 1718142822,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l87270w",
                      "score": 8,
                      "body": "No shit, they can get the massive bonus and if it goes to shit they can just leave and get hired somewhere else, it’s called the agency problem",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87270w/",
                      "created": 1718149920,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8776vu",
                          "score": 3,
                          "body": "Even better. They get their golden parachute via severance. Then, they can just leave and get hired somewhere else.",
                          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8776vu/",
                          "created": 1718152032,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l877bu7",
                              "score": 3,
                              "body": "And I’m sure their severance is massive",
                              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l877bu7/",
                              "created": 1718152093,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l877sf1",
                      "score": 4,
                      "body": "Which is ironically what people with business and finance education should be good at, reducing the costs **without** negatively affecting long term profits.\n\nFinding the fat which is true useless fat and cutting it off. \n\nApparently Boeing engineers made better business people, then management does...",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l877sf1/",
                      "created": 1718152292,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l87a37v",
                          "score": 3,
                          "body": "You can teach an engineer business, but you can't teach a businessman engineering.",
                          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87a37v/",
                          "created": 1718153290,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "l87do9q",
                      "score": 2,
                      "body": "Not at all, they are taught to maximize value, even jf one strategy involves profits that are further out. So I think the problem is with Boeing specifically as your statement of short term profits is not taught at all, I’m not sure where you got the idea.",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87do9q/",
                      "created": 1718154843,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8aj4eu",
                          "score": 1,
                          "body": "I got the idea from real life experience. I have worked with these people my whole career and all they care about is short term gains",
                          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8aj4eu/",
                          "created": 1718210496,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "l878qbk",
                      "score": 1,
                      "body": "I feel like it’s a personality thing as well.  Engineers are conservative and think ahead, and tend to have good finances personally.  \n\nFinance people ironically often have terrible personal finances - so focused on short term spending and leverage they go bankrupt immediately if they lose their job.",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l878qbk/",
                      "created": 1718152701,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l87ahgl",
                          "score": 3,
                          "body": "Mighty fine sweeping generalizations you got there",
                          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87ahgl/",
                          "created": 1718153461,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l86o23d",
                  "score": 17,
                  "body": "I like how the finance team is a boogie man.\n\nThe reality is that these decisions are made by executives to please both the board of directors and their shareholders. If finance is involved it's to update a projection for a PowerPoint presentation based on inputs given to them. Lol\n\nEngineers who are significantly better paid then the finance team members likely have more pull in the day to day operations. \n\nSource: previously a \"finance bro\". Never took down a company",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86o23d/",
                  "created": 1718144323,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l86rpj7",
                      "score": 11,
                      "body": "I understand what you're saying, but the criticism lies in the background and goals of these executives. This is a case where engineers didn't have more pull.\n\nBecause it wasn't the engineers who wanted to reduce R&D, remove quality control, and move the business side of the HQ away from the manufacturing hub in WA. These weren't decisions made by executives with a background in engineering.\n\nThe point isn't so much that the financial team is a boogie man, rather it's the fact that the executives had been drawn from a pool of finance and business graduates, who neglected the plight of the engineers.  \n\"finance bros\" have their time and place, but consider Boeing a cautionary tale of what happens when engineers are in fact dismissed in a business that must rely on the quality of engineering.",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86rpj7/",
                      "created": 1718145715,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l873wwi",
                          "score": 5,
                          "body": "The CEO who over saw the merger with McDonell Douglas and moved the hq from Washington was in fact an engineer.\n\nhttps://en.m.wikipedia.org/wiki/Philip_M._Condit\n\nNow I'm not saying engineers are bad, that would be a dumb argument.  What I'm saying is CEOs sometimes make awful decisions, like the former engineer turned CEO of Boeing, who was not affiliated with finance in any way.",
                          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l873wwi/",
                          "created": 1718150643,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l87815n",
                              "score": 7,
                              "body": "The CEO who first decided to make large cuts to spending in R&D and that decided to “upgrade” the 737 to the 737 Max instead of a proper redesign was a Harvard Business school graduate and the first non-engineer CEO of Boeing. That was the real death blow against Boeing, not the merger with McDonnell Douglas or HQ move alone.\n\nAlso it’s been pretty extensively covered by plenty of people more well read into it than either of us that Boeing was put in its current situation by a cultural takeover of the company by MD’s heavily finance driven/cost cutting culture. Sorry but the bean counter brigade absolutely deserves to be the boogeyman in this story. There is a difference between average joe finance team members and the kind of person who is making these types of decisions though. But they are still in the financial department of the company.",
                              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87815n/",
                              "created": 1718152398,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l87aoer",
                                  "score": 1,
                                  "body": "very well put. You are 100% correct.",
                                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87aoer/",
                                  "created": 1718153543,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "l87xb50",
                                  "score": 1,
                                  "body": "I was simply replying to the guy who stated that an CEO with Engineering background wouldnt move the company from Washington.  That was factually incorrect \n\nBad Leadership ruins company, those bad leaders can come from all types of backgrounds. That was my point. \n\nAlso, the Harvard MBA CEO did not have a background in finance. just throwing that out there as the prior comments were about Finance bros without common sense ruining companies.",
                                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87xb50/",
                                  "created": 1718163561,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "l8796pn",
                              "score": 3,
                              "body": "The problem is not “non engineers running companies.” The problem is rewarding CEOs with bonuses based on stock price. Haven’t quite hit that share price target? Stock buyback, don’t reinvest in the company! Shareholders only care about number-go-up. The whole system is broken and the greed it inspires exists in more than 1 college major.",
                              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8796pn/",
                              "created": 1718152896,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l879jcd",
                                  "score": 1,
                                  "body": "100% agree with that",
                                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l879jcd/",
                                  "created": 1718153050,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l87ah5c",
                                      "score": 2,
                                      "body": "Hopefully the people in this thread don’t find out I’m the evil “finance bro” making PowerPoints and spreadsheets for the board meetings.",
                                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87ah5c/",
                                      "created": 1718153457,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "l87pbiv",
                                  "score": 1,
                                  "body": "But the engineer-oriented executive would have still made better decisions had he also been encouraged with bonuses based on stock price. You can teach an engineer business, but you can't teach a businessman engineering.\n\nMBA's know that cutting costs is a good way to get sweet big profit margins. But in this case, they didn't understand the importance of keeping the product of good quality. It was sheer incompetence due to them choosing not to take advice from the engineering department in the company. Boeing has been ruined and so many people have lost their lives because the MBA's refused to listen to the engineers.\n\nAlthough I still agree that stock price-based compensation is not good for society in general.",
                                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87pbiv/",
                                  "created": 1718159878,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l87vq4v",
                                      "score": 3,
                                      "body": "I just think that’s kind of reductive. Embraer’s CEO is a MBA but doesn’t seem to be getting much flak. The previous CEO at Airbus was not an engineer either. Most of Boeing’s issues go back to decisions made by Condit(moving HQ away from manufacturing) and Stonecipher(started outsourcing), 2 non-MBAs with engineering backgrounds. That led to them bringing in McNerney, an MBA, to help control costs, which ended in the mess we are seeing now. It’s a series of compounding bad decisions made by people with and without MBAs. \n\nObviously I won’t defend what’s going on at Boeing because it’s a poorly run company that has resulted in people losing their lives. I just find these types of threads on Reddit to be frustrating because they always want to identify a single boogieman when it’s a more complex issue.",
                                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87vq4v/",
                                      "created": 1718162814,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l886kh2",
                                          "score": 2,
                                          "body": "You raise a good point. But I also think it's kind of reductive to blame it on rewarding CEOs with bonuses based on stock price.\n\nI'm definitely not saying that someone with an MBA is unable to run a business such as Boeing. I'm saying shit hits the fan when they stop listening to the engineers. And presumably, the successful non-engineering CEOs of other businesses such as Airbus are in fact listening to the engineers within the company.\n\nYeah, the problems can be traced back to Condit, due to the merger with McDouglass. What's important to note though is that the problem with this merger was the fact that the corporate culture of McDouglass took over. This culture was anti-engineering to its core and was solely short-term profit-seeking. So Boeing was a well-respected company that performed well when the engineers had more say ( despite rewarding CEOs with bonuses based on stock price ) until the corporate culture changed. Blaming it now on rewarding CEOs with bonuses based on stock price seems to me inaccurate.",
                                          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l886kh2/",
                                          "created": 1718168289,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "l878nwe",
                              "score": 2,
                              "body": "Interesting! Thanks for letting me know. Then I definitely retract the statement about who moved the HQ from WA. And Condit shares the blame.\n\n  \nBut it's known that it was the executives from McDonell Douglas under specifically Harry Stonecipher, a man that has been quoted as calling the engineers in Boeing \"arrogant\", that took control over Boeing as a whole and transformed the culture from engineering-oriented to profit margin-oriented.\n\nLater, it was union busting James McNerny  that truly ruined Boeing. He stopped encouraging new models to be produced, and instead rushed upgrades to the 737 MAX (and he made sure to convince everyone that pilots need not be retrained with the upgrades to the engines, resulting in fatal crashes) and shifted much of the production to cheaper plants outside WA that had known flaws in the production line.  \nEngineers were constantly overridden when they showed concerns under his management, and instead, all decision-making was based on reducing costs.",
                              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l878nwe/",
                              "created": 1718152673,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l87sszu",
                                  "score": 1,
                                  "body": "\"Stonecipher was born in Robbins, Tennessee.[3]\n\nIn 1958, he graduated with a Bachelor of Science degree in physics at the Tennessee Polytechnic Institute. In May 2002, Stonecipher received an Honorary Doctorate Degree of Science from Washington University in St. Louis. [1]\"\n\nhttps://en.m.wikipedia.org/wiki/Harry_Stonecipher\n\nJames mcnerny does have a business related degree, not specifically finance though. He started his career as a brand manager \n\nhttps://en.m.wikipedia.org/wiki/James_McNerney\n\n\nA handful of Boeing CEOs, whom potentially led to the downfall of Boeing, all from a diverse background! (None finance related though)",
                                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87sszu/",
                                  "created": 1718161469,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l87zxlp",
                                      "score": 2,
                                      "body": "  \nAn MBA is most definitely a finance-related degree, let's not be dishonest. Also, please see my first comment that mentions \"business and finance degrees\". And I was talking about \"business and finance graduates\" in my second comment to you as well.   \n   \nAnd I'm not sure what you're trying to say by not acknowledging anything I wrote? I understand your point that Stonecipher doesn't strictly have a bachelor's in finance or whatever, but Stonecipher having a physics degree isn't really defeating the essence of the argument either, which is that engineers were ignored and their power phased out while financial decisions such as cutting costs were deemed preferable. The decisions that ruined Boeing were strictly corporate decisions. The engineers didn't have any pull. The complete destruction of its reputation was under someone with an MBA, but ultimately that detail is unimportant. It's more important to know that the cost-cutting measures were against the will of the engineers, and had the engineers been listened to, Boeing would still be the respected company it once was.",
                                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87zxlp/",
                                      "created": 1718164814,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l8825ig",
                                          "score": 1,
                                          "body": "Your first comment was about finance bros lacking common sense and how that ruined Boeing so their leadership team not having a finance background is very much relevant.\n\nAlso, finance is a subset of business. While a finance degree is a business degree, not all business degrees are finance degrees. So an MBA in business doesn't mean the person has a finance background.",
                                          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8825ig/",
                                          "created": 1718165925,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l8725zn",
                  "score": 2,
                  "body": "Another casualty to them MBAs unfortunately.",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8725zn/",
                  "created": 1718149908,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l87d8ig",
                  "score": 1,
                  "body": "They are taught to increase profits, except this situation leads to lower profits, so they did the opposite. Most people in finance can correlate increased r&d spend with value creation which is also taught",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87d8ig/",
                  "created": 1718154657,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l87elr0",
                  "score": 1,
                  "body": "Same in pharmaceuticals! Outsourcing and cut QC then wonder why there hundreds of drug recalled and causing massive shortages! But profit up a penny to nickel a share",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87elr0/",
                  "created": 1718155237,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l87fs64",
                      "score": 1,
                      "body": "The financialization of the industries has been detrimental to society. No right to repair, regulations are avoided, Executives have golden parachutes and there are no consequences to catastrophic failures.",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87fs64/",
                      "created": 1718155737,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l86m30w",
              "score": 3,
              "body": "Stupid is as stupid does",
              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86m30w/",
              "created": 1718143587,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l86khkw",
          "score": 9,
          "body": "Also killing employees is usually a no no",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86khkw/",
          "created": 1718142999,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l86pz35",
          "score": 3,
          "body": "I really hope the CEO got compensated well enough to make those cuts. ",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86pz35/",
          "created": 1718145046,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l86zw72",
          "score": 3,
          "body": "Doesn’t matter. The stock holders who voted for and embraced the short sighted net profit increase have long cashed out. Now the bag holders are holding and they get to enjoy a hollowed out, rotted company.\n\nAverage holding time is less than 11 months for stocks, so guess what timeframe profits are prioritized for.",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86zw72/",
          "created": 1718148979,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l87117b",
          "score": 1,
          "body": "Ok ignore said warnings",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87117b/",
          "created": 1718149437,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l87afz4",
          "score": 1,
          "body": "Elon is that you?",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87afz4/",
          "created": 1718153443,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l87bxda",
          "score": 1,
          "body": "They should fully change into a hitman agency since that branch at least puts some results.",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87bxda/",
          "created": 1718154095,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l87d1tn",
          "score": 1,
          "body": "I work with a company that services machines for the companies that make parts for Boeing. They actually closed one building down since it wasn’t economically viable anymore. So are they not ordering enough parts that those machines aren’t needing maintenance as much or those machines are working way better now? ",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87d1tn/",
          "created": 1718154578,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l87do59",
          "score": 1,
          "body": "Problem is the guys that were responsible for the cuts got their bonuses and walked away years ago. The new crop hasn't learned that and will make the same greedy moves.",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87do59/",
          "created": 1718154842,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l86xz5h",
          "score": 1,
          "body": "They were more or less adding new systems but pretending it was the old system to avoid pilot training.  American \"quality\" doesn't help much either.  We have been in a bit of a nosedive for a while.  Companies taking over large portions of what was government jobs.  Cheapest bidders, substandard workmanship.  It's all the norm. How can we build it faster and cheaper.",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86xz5h/",
          "created": 1718148206,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l86kbit",
          "score": 0,
          "body": "You underestimate just how stupid people with business and art degrees can be.",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86kbit/",
          "created": 1718142938,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l873i5m",
          "score": 0,
          "body": "Or why you don’t let whistleblowers live to see the light of day",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l873i5m/",
          "created": 1718150469,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l87710h",
          "score": 0,
          "body": "You might want to delete this! Jk haha i think they stopped killing people haah",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87710h/",
          "created": 1718151962,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l85vp2e",
      "score": 508,
      "body": "Fully deserved",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l85vp2e/",
      "created": 1718134594,
      "depth": 0,
      "replies": [
        {
          "id": "l87k2s7",
          "score": 113,
          "body": "maybe killing 2 sources is even more famed than the news of the parts",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87k2s7/",
          "created": 1718157579,
          "depth": 1,
          "replies": [
            {
              "id": "l88c1ok",
              "score": 32,
              "body": "As someone who has and knows many people who work in aerospace and various associated and relevant areas.\n\nI think it is far more likely that the CIA (or other alphabet soup agency) was the perpetrator if it was malicious and not just the wildest coincidence of all time.\n\nPeople forget that beyond being a major corporation and employer, Boeing is a massive strategic asset for the US.\n\nMaintaining both the physical manufacturing infrastructure and knowledge base to produce aircraft at scale is critical to Defense/National Security.\n\nIt would be like a whistleblower coming forward with something that might lose us Pearl, Diega Garcia or Guam. An enormous disaster for the United States ability to project power and wage war.\n\nOther places might nationalize such an important asset, but that would be socialism, so if the government needs to kill two guys or bail them out, we will.\n\nEdit: Typo",
              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l88c1ok/",
              "created": 1718171541,
              "depth": 2,
              "replies": [
                {
                  "id": "l88kek7",
                  "score": 51,
                  "body": "By that logic, the CIA should off the CEOs and install someone competent.",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l88kek7/",
                  "created": 1718177089,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l88lj4c",
                      "score": 18,
                      "body": "In the CIA's history of declassified documents, they off ~~CEOs~~ political leaders who are disobedient, not incompetent.",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l88lj4c/",
                      "created": 1718177903,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l891hs9",
                          "score": 10,
                          "body": "An incompetent puppet is better than a disobedient leader",
                          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l891hs9/",
                          "created": 1718189136,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "l88lgy0",
                      "score": 4,
                      "body": "Not a bad idea!",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l88lgy0/",
                      "created": 1718177858,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l89mrge",
                      "score": 1,
                      "body": "They have already announced the CEO, Dave Calhoun, is leaving later this year.",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l89mrge/",
                      "created": 1718199093,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l88i8in",
                  "score": 11,
                  "body": "This does not make sense, whistle blowers need to appear so that the bad apples can be rooted out of Boeing. There is no favor to national interest or even company interest maintaining executives who disregard quality and safety in the name of profit.",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l88i8in/",
                  "created": 1718175586,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l89bovk",
                      "score": 3,
                      "body": "Yeah it’s a really stupid conspiracy theory. These whistleblowers wouldn’t have bankrupted Boeing or even made a lot of difference. \nThere is absolutely no reason at all why the CIA would get involved. It’s so dumb.",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l89bovk/",
                      "created": 1718194456,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l88l3ka",
                      "score": 0,
                      "body": "**Reposting because automod flagged the abbreviation for Unmanned Aerial Vehicles.**\n\nWho said anything about making the company better?\n\nOf course it makes no sense if you try to think about it using logic and optimism.\n\nBut it makes a ton of sense when you think of it as a MIC circle jerk.\n\nWhistleblowers go away, Boeing survives and continues making profits for executives and shareholders, those entities contribute to political campaigns. Then those politicians award government contracts to Boeing.\n\nThey continue to make money, and politicians stay in office, with the only caveat being if we get into a massive conflict we tell them all of those civilian airlines they are making are now Poseidons and Globemasters, and Eagles, and Pegasuses (Pegasai?) and Osprey and Apaches and Hornets and Chinooks and Sea Knights and Wedgetails and half a dozen various **Unmanned Aerial Vehicles** and UCAVs they are producing or developing, plus all the parts and support for these platforms.\n\nThat’s just aircraft too, we need JDAMs and SDBs and Harpoons and AGM-84s to hit targets with.\n\nPlus we will need new spy and comms satellites which they do, and oh we can launch them with United Launch Alliance (that’s 50:50 Boeing::Lockheed but close enough).\n\nAnd they get paid for ALLLLLL of it.",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l88l3ka/",
                      "created": 1718177587,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l88ssba",
                  "score": 1,
                  "body": "can be / possibly.....but even its CIA the bad look still goes to Boeing ,Boeing could be ripping hair on why the CIA do it so fucking blunt and ugly more than us",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l88ssba/",
                  "created": 1718183291,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l89iwb3",
                      "score": 1,
                      "body": "Im not so sure it would have been the CIA.  Boeing hires a LOT of ex military and I would not be at all surprised if they hired ex spooks too, why wouldn't they?  This means they could easily have a few trusted people capable of doing their own dirty work.",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l89iwb3/",
                      "created": 1718197574,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l88bgmd",
              "score": 3,
              "body": "I thought one of them was sick",
              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l88bgmd/",
              "created": 1718171180,
              "depth": 2,
              "replies": [
                {
                  "id": "l88uug1",
                  "score": 5,
                  "body": "Don't let the truth ruin a good story",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l88uug1/",
                  "created": 1718184796,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l85xrlp",
      "score": 201,
      "body": "Wall Street Journal article today,, \n\nAll the experienced help left / retired,, they have been hiring thousands of new employees from all kinds of backgrounds and the problems are evident. \n\nIt literally takes years to train people in this industry.. \n\nThey didn't deal with the issue up front and now they are paying the price. \n\nThe issues will be resolved in coming years, and if you buy there stock on the low, it will turn around.\n\nBut this will be a long wait",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l85xrlp/",
      "created": 1718135279,
      "depth": 0,
      "replies": [
        {
          "id": "l875l0a",
          "score": 84,
          "body": "Not just aircraft manufacturing....most other industries also. We are seeing the repercussions of inadequate training and staffing from mid eighties onwards. It will become an epidemic as the older experienced engineering staff retire in the next 5-10 years.",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l875l0a/",
          "created": 1718151349,
          "depth": 1,
          "replies": [
            {
              "id": "l87cxzc",
              "score": 91,
              "body": "As a Millennial in the engineering and manufacturing field... they off shored our jobs. Paid us less, profited, SHOULD SUFFER THE CONSEQUENCES, and asked us to pick up the slack with nobody of experience that can use a spreadsheet.\n\nI want a liveable wage with all the important and critical designs that make the company millions. I don't think they will learn from this...  The profiters are already on their yatch, the engineers are retired, and they created the wasteland.",
              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87cxzc/",
              "created": 1718154532,
              "depth": 2,
              "replies": [
                {
                  "id": "l87vwq0",
                  "score": 21,
                  "body": "Yeah, they did the damage, and they wanna shift the blame to strawman/bogeyman, like immigrants or China.",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87vwq0/",
                  "created": 1718162900,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l89jbzx",
              "score": 5,
              "body": "We are seeing that at my work as well.  We have had 2 guys with 30+ years experience retire and two more are set to retire in less than 2 years and they have not even attempted to train replacements.  They just move people into those positions and they are LOST.",
              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l89jbzx/",
              "created": 1718197749,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l870j86",
          "score": 20,
          "body": "Moving production from Seattle to Virginia to save money?",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l870j86/",
          "created": 1718149235,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8835ly",
          "score": 1,
          "body": "Boeing is dead! They either change their name or dissolve.",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8835ly/",
          "created": 1718166442,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l861kbn",
      "score": 147,
      "body": "Don't worry, they saved some money by paying workers less",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l861kbn/",
      "created": 1718136540,
      "depth": 0,
      "replies": [
        {
          "id": "l881e06",
          "score": 24,
          "body": "\"Sorry Dave, we had to cut your paycheck by 20%, because management says they need to buyback more shares\"",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l881e06/",
          "created": 1718165537,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l88livi",
          "score": 3,
          "body": "Pay less, fewer hours for training and checking competency.. but hey they satisfied the shareholders for the quarter.",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l88livi/",
          "created": 1718177898,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8a670a",
          "score": 1,
          "body": "The people that are paid to build and run their quality systems make a fuck ton more than you or I. The ability to ship hundreds of millions of dollars of scrap that kills people is far above the entry level floor worker.",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8a670a/",
          "created": 1718206036,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l86lxns",
      "score": 44,
      "body": "That Boeing CEO took like a business strategy for quality at WalMart and applied it to building advanced commercial jets.\n\n“Why won’t anyone buy my Walmart jets?”",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86lxns/",
      "created": 1718143531,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l871lfq",
      "score": 22,
      "body": "Number of people surprised: 0",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l871lfq/",
      "created": 1718149669,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l85utf8",
      "score": 87,
      "body": "Honestly, F Boeing. What a horrible corrupted greedy company.\nYes, I absolutely think they did some shady shit with the whistleblowers. I hope some other companies come out as competitors and drain them out.",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l85utf8/",
      "created": 1718134300,
      "depth": 0,
      "replies": [
        {
          "id": "l87aw1o",
          "score": 6,
          "body": "Agreed. Fuck Boeing.  They are literally killing their whistle-blowers and endangering the passengers that fly on their planes.",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87aw1o/",
          "created": 1718153637,
          "depth": 1,
          "replies": [
            {
              "id": "l88e1ho",
              "score": 5,
              "body": "Also killing their passengers, let's not forget the *two* 737 Max crashes which were entirely Boeing's fault",
              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l88e1ho/",
              "created": 1718172814,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l87asdk",
          "score": 0,
          "body": "You think Boeing is giving people MRSA?",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87asdk/",
          "created": 1718153591,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l861i5y",
      "score": 196,
      "body": "A lot of you only read the headline. \n\n>Boeing still has a backlog of 5,600 orders.\n\nAssuming Boeings production rates doubled with no new orders, this still puts the backlog into the 2030s. This is a non-story.",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l861i5y/",
      "created": 1718136521,
      "depth": 0,
      "replies": [
        {
          "id": "l86d758",
          "score": 53,
          "body": "Yea but no orders today will impact the future no matter what, airbus getting much higher demand is not a non-story. Sure Boeing has a huge backlog but if they keep going this route they’re in trouble ",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86d758/",
          "created": 1718140423,
          "depth": 1,
          "replies": [
            {
              "id": "l86dluj",
              "score": -32,
              "body": "Airbus netted 27 new orders in the same time period. The difference between 27 and zero orders when it comes to Boeing and Airbus is a rounding error.\n\nThis has just been a slow couple of months for the industry when it comes to orders.",
              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86dluj/",
              "created": 1718140562,
              "depth": 2,
              "replies": [
                {
                  "id": "l86f1mw",
                  "score": 27,
                  "body": "I mean Boeing having so few orders and airbus having a sudden increase is still alarming and definitely worth a report. It’s a potential trend that isn’t too surprising given recent events and I’m sure Boeing is worried ",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86f1mw/",
                  "created": 1718141059,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l87qykz",
                      "score": 3,
                      "body": "How many other times did they go consecutive months without sales? Curious if this is a cherry picked statistic",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87qykz/",
                      "created": 1718160624,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l86qzev",
                  "score": 15,
                  "body": "List price of a 737 max is a hundred mil. http://www.axonaviation.com/commercial-aircraft/aircraft-data/aircraft-pricing\n\nThat’s 2.7 billion dollars not including the service costs where a lot of the money is. That’s definitely more than a rounding error.",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86qzev/",
                  "created": 1718145435,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8755h9",
                      "score": -15,
                      "body": "That is 15 days production (just 737) for Boeing at peak capacity. It is a rounding error.",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8755h9/",
                      "created": 1718151166,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l86akdn",
          "score": 73,
          "body": "I wouldn’t say it’s a non story. I wonder how many of those back ordered planes are under contract. I’d wager a lot of buyers would be backing out if they could.",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86akdn/",
          "created": 1718139521,
          "depth": 1,
          "replies": [
            {
              "id": "l86h6g4",
              "score": 45,
              "body": "Lol all of the back ordered planes are under contract that’s how it works",
              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86h6g4/",
              "created": 1718141811,
              "depth": 2,
              "replies": [
                {
                  "id": "l87emeu",
                  "score": 8,
                  "body": "Not all contracts are firm orders. In other words, customers can back out of the ones designated as options (typically they make up a subset of a bigger order). Firm orders also will have some clauses that allow them to terminate under certain circumstances.\n\nTo be clear, half of their backlog isn’t going to disappear or anything. Non-firm orders are not the majority of the backlog by any stretch. Just pointing out that not all orders are guaranteed sales.",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87emeu/",
                  "created": 1718155245,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l86nokl",
                  "score": 30,
                  "body": "To be fair, some of the backlog can easily be cancelled. They aren't all firm orders.",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86nokl/",
                  "created": 1718144181,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l86u3by",
                      "score": 3,
                      "body": "Lol they are all firm orders and cannot be cancelled easily. How can you possibly think that is the case",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86u3by/",
                      "created": 1718146651,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l86y376",
                          "score": 17,
                          "body": "Also, Boeing is massively behind on contracted delivery dates. United is threatening to cancel 737max 10 orders.",
                          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86y376/",
                          "created": 1718148250,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l87cbq3",
                              "score": 7,
                              "body": "And turn them into Max 9s lol",
                              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87cbq3/",
                              "created": 1718154269,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "l86v657",
                          "score": 9,
                          "body": "So the reported backlog doesn't include any airline options?",
                          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86v657/",
                          "created": 1718147089,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l86vsyr",
                              "score": -14,
                              "body": "Options to not deliver a plane?",
                              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86vsyr/",
                              "created": 1718147345,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l86wmhw",
                                  "score": 11,
                                  "body": "Nevermind.",
                                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86wmhw/",
                                  "created": 1718147672,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l876l63",
                                      "score": 9,
                                      "body": "The best way to avoid arguments with someone whose out of their depth.",
                                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l876l63/",
                                      "created": 1718151774,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l870enz",
                  "score": 3,
                  "body": "So? That's the money already accounted for, new orders new money, no orders no new money. That's how it works",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l870enz/",
                  "created": 1718149183,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l87d76j",
                  "score": 2,
                  "body": "How easily enforced is a contract that obligates you to buy a faulty product. I’m sure some high paid lawyers are trying to sort this out right now in regards to those contracts.",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87d76j/",
                  "created": 1718154642,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l86njfg",
              "score": 7,
              "body": "And buy what? Airbus has a massive backlog too.",
              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86njfg/",
              "created": 1718144128,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l870h4h",
          "score": 8,
          "body": "I work in an industry that reports backlog. It can be a bit of a fluffed bs metric.",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l870h4h/",
          "created": 1718149211,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l86dll8",
          "score": 5,
          "body": "And Airbus has a backlog of 8598 orders which at current rates means they'll have them built in 2036.",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86dll8/",
          "created": 1718140560,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l872ara",
          "score": 1,
          "body": "They have no growth, the all important metric for their precious stock that got them into this mess in the first place.\n\nI can think of no greater symbol of their failure than watching it tumble.",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l872ara/",
          "created": 1718149964,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l86pkyd",
      "score": 8,
      "body": "So have they fired the board of directors and the CEO yet?",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86pkyd/",
      "created": 1718144893,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8644te",
      "score": 13,
      "body": "Who wants to buy a plane where they nosedive towards the ground and the doors fall off. If it was a Ford Mustang or something there’d be no end of memes",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8644te/",
      "created": 1718137384,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l86b782",
      "score": 11,
      "body": "Jets fall from sky…check \n\n\nEmployee indicates there is a known issue that was covered up…check\n\n\nEmployee found dead of suspicious activity…check \n\n\nAnother found dead…check\n\n\nSales falter as business confidence in company deteriorates…check\n\n\nStock price drops as public confidence in company ability to make safe products…check\n\n\nCEO receives incentives to slash safety programs…check\n\n\nQuality control budget eliminated…check",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86b782/",
      "created": 1718139735,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l86f08v",
      "score": 5,
      "body": "![img](avatar_exp|83592530|fire)",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86f08v/",
      "created": 1718141046,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l877swz",
      "score": 6,
      "body": "How is 737 Max even still in conversation?",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l877swz/",
      "created": 1718152298,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l88feh8",
      "score": 3,
      "body": "Trash talk without technical will make you a poor investor, Boeing is a big company with so much cash and government backing, people  trashed meta stock at 88 dollars is 497 dollars today, they trashed Nvidia at 200 dollars it went to 1200 dollars before split.",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l88feh8/",
      "created": 1718173696,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l863sga",
      "score": 3,
      "body": "Oh no there still 5600 orders of the lead time for a air plane is 6 weeks everyone will be only getting boeing planes",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l863sga/",
      "created": 1718137270,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l86e798",
      "score": 4,
      "body": "It are taking way too long to assassinate the whistleblowers..",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86e798/",
      "created": 1718140768,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l85uxsi",
      "score": 4,
      "body": "☠️",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l85uxsi/",
      "created": 1718134342,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l85x5zy",
      "score": 2,
      "body": "Good",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l85x5zy/",
      "created": 1718135082,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l874j7l",
      "score": 3,
      "body": "Oh you mean the company that clearly just murdered people and we’re all just pretending it didn’t happen? Accountability has become a myth in modern business",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l874j7l/",
      "created": 1718150907,
      "depth": 0,
      "replies": [
        {
          "id": "l87k7cc",
          "score": 2,
          "body": "They didn’t murder anyone, if you actually look into it the whistleblower deaths are easily explainable. Companies might be greedy but they don’t go around killing people in cold blood, except in movies.",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87k7cc/",
          "created": 1718157633,
          "depth": 1,
          "replies": [
            {
              "id": "l880kwe",
              "score": 3,
              "body": "IDK if they do or don't, but if they do, it's sloppy to do it after the guy already gave a bunch of testimony.",
              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l880kwe/",
              "created": 1718165133,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l87noiz",
          "score": 2,
          "body": "Boeing is a shit company that's done some shit things, but they didn't murder anyone. Saying that kind of shit puts you alongside the flat earthers and Qanon weirdos.",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87noiz/",
          "created": 1718159149,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l86366z",
      "score": 1,
      "body": "Wonder if how Boeing has been managed will be studied one day like the ford pinto scandal.",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86366z/",
      "created": 1718137066,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l864rlx",
      "score": 1,
      "body": "And this will have a better impact to future quality than any government fine will have. They can get their shit together or go bankrupt. ",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l864rlx/",
      "created": 1718137594,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l86er4j",
      "score": 1,
      "body": "But why??",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86er4j/",
      "created": 1718140959,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l86gdex",
      "score": 1,
      "body": "the institutional knowledge is retiring",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86gdex/",
      "created": 1718141522,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l86jvsk",
      "score": 1,
      "body": "And yet it’s still 12+% above its lows",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86jvsk/",
      "created": 1718142778,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l86neoq",
      "score": 1,
      "body": "Why would somebody buy plane that fall appart?",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86neoq/",
      "created": 1718144080,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l86pnyo",
      "score": 1,
      "body": "CEO deserves another raise",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86pnyo/",
      "created": 1718144927,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l86qdl7",
      "score": 1,
      "body": "Fuck… Boeing….  Truly this company should go under for what they did but the gov will prop the bitch up and we will continue to have zombie garbage companies with no risk or consequences",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86qdl7/",
      "created": 1718145201,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l86uztt",
      "score": 1,
      "body": "Boeing about to suicide some sales managers next",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86uztt/",
      "created": 1718147017,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l86whg5",
      "score": 1,
      "body": "Start a gofundme. I’ve got some spare bolts. Can a billion dollar company catch a break?",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86whg5/",
      "created": 1718147614,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l86yx1c",
      "score": 1,
      "body": "Are they still 50* behind in orders?",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86yx1c/",
      "created": 1718148580,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l872s5t",
      "score": 1,
      "body": "only unscrupulous airlines continues to fly boeing... come on. how cheap did u get them planes?",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l872s5t/",
      "created": 1718150165,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87389e",
      "score": 1,
      "body": "They just closed on sale of 30 MAX, geez",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87389e/",
      "created": 1718150352,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l873knl",
      "score": 1,
      "body": "Here comes the government bailouts",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l873knl/",
      "created": 1718150498,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8751dj",
      "score": 1,
      "body": "Well, hopefully they won't cut on the important parts...\n\nAlso, hope the people who know stuff stay alive.\n\nI don't know anything Boeing, just saying.",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8751dj/",
      "created": 1718151119,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l875e86",
      "score": 1,
      "body": "Good. Fuck em. Go make some more bombs to drop in the Middle East while ignoring basic maintenance and ethics for passenger planes.",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l875e86/",
      "created": 1718151268,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8787l8",
      "score": 1,
      "body": "Why does this article not give me a baseline for how may 737 Max sales there were before the controversy? The data it provides is literally useless without that info.",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8787l8/",
      "created": 1718152477,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l879ply",
      "score": 1,
      "body": "Close the company",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l879ply/",
      "created": 1718153127,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l879x0k",
      "score": 1,
      "body": "And zero mention of the whistleblowers suddenly dying, great.",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l879x0k/",
      "created": 1718153215,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87aqty",
      "score": 1,
      "body": "Another round of layoff coming",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87aqty/",
      "created": 1718153572,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87b4gw",
      "score": 1,
      "body": "They should try murdering less employees next.",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87b4gw/",
      "created": 1718153742,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87bdxh",
      "score": 1,
      "body": "Still not worth buying",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87bdxh/",
      "created": 1718153858,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87d3za",
      "score": 1,
      "body": "I’m actually headed to the Everett factory for a tour with my daughter in a few days. Will  they have actual planes they are building in the factory? This could be a nightmare.",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87d3za/",
      "created": 1718154604,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87l014",
      "score": 1,
      "body": "\"You made a time machine......outa a DREAMLINER?????\"\n\n- Back to the Future 2049",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87l014/",
      "created": 1718157976,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87mq49",
      "score": 1,
      "body": "If they could have outsourced airplane production to China they would have done already! They take in shit load of tax payer money through military and aerospace  contracts and have no accountability!",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87mq49/",
      "created": 1718158726,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87nftv",
      "score": 1,
      "body": "no one wants to fly on one of those things, people who have been atheists their entire lives will start praying\n\nit's hard to ask people to pay for the experience of dying from something so predictable",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87nftv/",
      "created": 1718159044,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87pc0z",
      "score": 1,
      "body": "Gee I wonder why",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87pc0z/",
      "created": 1718159884,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87zk3o",
      "score": 1,
      "body": "How come they have no orders? That’s a true mystery",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87zk3o/",
      "created": 1718164636,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8819h4",
      "score": 1,
      "body": "Well, usually airlines don't order planes that people are genuinely scared to fly on. Just a thought.",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8819h4/",
      "created": 1718165475,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l882lyn",
      "score": 1,
      "body": "Good as it should be",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l882lyn/",
      "created": 1718166160,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l88c02o",
      "score": 1,
      "body": "How’s that “maximizing shareholder value” workin out. /s",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l88c02o/",
      "created": 1718171514,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l88drp5",
      "score": 1,
      "body": "Understandable, since they are in the business of killing people now. /s",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l88drp5/",
      "created": 1718172637,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l88gygc",
      "score": 1,
      "body": "Must suck to be a salesperson at Boeing being paid off commission /s",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l88gygc/",
      "created": 1718174724,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l88k6hs",
      "score": 1,
      "body": "A lot of damage was done by the Jack Welch school of management, its adherents completely ran GE and Boeing into the ground and walked away scot-free as multi-millionaires.",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l88k6hs/",
      "created": 1718176929,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l895ewa",
      "score": 1,
      "body": "2 billions deal is in process.\n\nhttps://www.bloomberg.com/news/articles/2024-06-10/boeing-set-to-land-2-billion-737-max-order-from-israel-s-el-al",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l895ewa/",
      "created": 1718191349,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l896e2g",
      "score": 1,
      "body": "Not a shocker",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l896e2g/",
      "created": 1718191867,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l89dxco",
      "score": 1,
      "body": "Does the article state which model the 27 orders were for? I’m assuming 320Neo.\n\nEdit: also [12 of those orders were cancelled.](https://abcnews.go.com/Business/wireStory/boeing-sales-tumble-company-gets-orders-737-max-111021215)",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l89dxco/",
      "created": 1718195467,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l89ic7g",
      "score": 1,
      "body": "Gonna have to do a little redesign and rename the aircraft, the 737 Max name is tarnished.",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l89ic7g/",
      "created": 1718197346,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l89jga7",
      "score": 1,
      "body": "man im so glad i got out after 2 years of holding. Everyone said too big to fail. America's company, wont fail. Well.........it ain't going nowhere for a while, that's for sure.",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l89jga7/",
      "created": 1718197797,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l89u2q1",
      "score": 1,
      "body": "Doesn’t help they are killing off their whistleblowers either.  I’m sure that doesn’t play well with buyers.",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l89u2q1/",
      "created": 1718201820,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l85y4ai",
      "score": 2,
      "body": "Doesn’t matter Corporate America will pump the share price.",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l85y4ai/",
      "created": 1718135397,
      "depth": 0,
      "replies": [
        {
          "id": "l87nx2v",
          "score": 3,
          "body": "It's down ~29% YTD. What are you on about?",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87nx2v/",
          "created": 1718159254,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8633q4",
      "score": 1,
      "body": "CEO walks with millions",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l8633q4/",
      "created": 1718137042,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l866572",
      "score": 1,
      "body": "Why in the name of all that is holy did they go all-in on the 737...a design that's been around since the 60s. Pilots have been asking for something that replaces the 757 market for decades, and the 737 max isn't it. C'mon Boeing, innovate!!",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l866572/",
      "created": 1718138050,
      "depth": 0,
      "replies": [
        {
          "id": "l86v5bf",
          "score": 3,
          "body": "Pilots are not the customer. The 737 max isn't the same 737 when it launched. Keeping similarities isn't a bad tbing but the issue is to their QA.",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l86v5bf/",
          "created": 1718147080,
          "depth": 1,
          "replies": [
            {
              "id": "l880ujk",
              "score": 0,
              "body": "The 737 Max has a bunch of issues beyond quality control.  It has significant design compromises that make the plane less safe.  All because Boeing wanted to use bigger and more fuel efficient engines without designing a taller plane.  Because that would mean \"expensive and unnecessary permitting\".",
              "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l880ujk/",
              "created": 1718165265,
              "depth": 2,
              "replies": [
                {
                  "id": "l882gvp",
                  "score": 1,
                  "body": "The issue was that they put 1 fucking sensor. If they put 2 or 3, then the chance of those crashes are non existent.",
                  "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l882gvp/",
                  "created": 1718166087,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l884pur",
                      "score": 0,
                      "body": "Not real surprised they cheaped-out, since the whole program is a cheap-out.",
                      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l884pur/",
                      "created": 1718167269,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l866cjv",
      "score": 1,
      "body": "Boeing is a joke from the top down. Engineers need to be running the place not Wall Street loser ceos. Buffet should buy this company and fix it!",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l866cjv/",
      "created": 1718138117,
      "depth": 0,
      "replies": [
        {
          "id": "l87b23p",
          "score": 1,
          "body": "Boeing’s CEO at the time of the MAX crashes was Dennis Muilenburg, an engineer. Just having an engineer on top isn’t enough.",
          "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87b23p/",
          "created": 1718153712,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l866lga",
      "score": 1,
      "body": "Does Boeing have any tie to BSG Boston Consulting Group?",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l866lga/",
      "created": 1718138198,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87ar5i",
      "score": 1,
      "body": "DEI can make people feel special until the special is way too special",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l87ar5i/",
      "created": 1718153576,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l85x2ct",
      "score": 0,
      "body": "Why the stock isn’t priced in, shit gotta be the lowest",
      "permalink": "/r/stocks/comments/1ddm4ky/deleted_by_user/l85x2ct/",
      "created": 1718135047,
      "depth": 0,
      "replies": []
    }
  ]
}