{
  "title": "I'm completely lost.",
  "score": 28,
  "selftext": "[removed]",
  "link_flair_text": "Advice",
  "id": "1dds7tf",
  "num_comments": 46,
  "created_utc": 1718147995,
  "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/",
  "comments": [
    {
      "id": "l87jczm",
      "score": 1,
      "body": "Sorry -- we removed your message on /r/stocks because you are asking for the type of information we try to address in our wiki: https://www.reddit.com/r/stocks/wiki/index\n\nGeneric posts like \"how do I get started with stocks,\" \"how do I find a broker,\" \"where can I learn more about investing,\" \"I have $XXX to invest, what should I do,\" etc. are removed because they are low-effort and asked on a daily basis in /r/stocks.\n\nThings you can do:\n\n1. Read the wiki which has tons of information, including reputable learning resources, broker information, and links to useful reddit posts (including old posts similar to yours)\n\n2. Search the subreddit history for similar information",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87jczm/",
      "created": 1718157271,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l86yqvv",
      "score": 93,
      "body": "VOO",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l86yqvv/",
      "created": 1718148513,
      "depth": 0,
      "replies": [
        {
          "id": "l874z9d",
          "score": 19,
          "body": "Set up an automatic investment into something like VOO and forget about it. That’s all OP needs to do.",
          "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l874z9d/",
          "created": 1718151094,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l86zzea",
      "score": 18,
      "body": "Buy VOo or SPY or VTI. Basically buy ETFs. An etf is like a share of something that holds a bunch of shares in companies. Think of it as like a s and p 500 stock or a tech stock, etc. Some brokers let you do fracture shares... so if SPY is 535 is the price for 1 share you can throw 50 at it and own a fraction of it.\n\nIf your worried don't markets do go down but always end up going up.",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l86zzea/",
      "created": 1718149015,
      "depth": 0,
      "replies": [
        {
          "id": "l87iv3r",
          "score": 2,
          "body": "Thanks for sharing the definition of etf, well explained.",
          "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87iv3r/",
          "created": 1718157059,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l871tor",
      "score": 25,
      "body": "Find yourself, brother.",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l871tor/",
      "created": 1718149765,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l86z3u4",
      "score": 27,
      "body": "ETF, if you're not sure of how to start.",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l86z3u4/",
      "created": 1718148658,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8751ra",
      "score": 21,
      "body": "Do you have an emergency fund?  At least 6 months?  If not, I’d focus on that.",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l8751ra/",
      "created": 1718151123,
      "depth": 0,
      "replies": [
        {
          "id": "l877equ",
          "score": 6,
          "body": "Yes I agree - left over for stocks should mean you already have this.",
          "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l877equ/",
          "created": 1718152128,
          "depth": 1,
          "replies": [
            {
              "id": "l87duk8",
              "score": 5,
              "body": "If he's saving $20 to $50 every two weeks, he likely doesn't have an emergency fund.",
              "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87duk8/",
              "created": 1718154917,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l878b9b",
          "score": 6,
          "body": "Disagree. Let your investments be your emergency funds for the time being. Saving easily accessible money can be hard. Start learning how to invest. Build those habits and start seeing the benefits. You'll be far more motivated to build an emergency fund after that.",
          "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l878b9b/",
          "created": 1718152520,
          "depth": 1,
          "replies": [
            {
              "id": "l87ayup",
              "score": 9,
              "body": "What do you mean by that? Seems risky to hold emergency money in the market… what if the whole market crashes right before you need a crucial car repair or something",
              "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87ayup/",
              "created": 1718153672,
              "depth": 2,
              "replies": [
                {
                  "id": "l87ic7g",
                  "score": 0,
                  "body": "What if he dips into his reserve to go on a vacation? Or to go boozing for a weekend?\n\nPut his money where its working so its more incentive to keep it there.\n\nJmho",
                  "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87ic7g/",
                  "created": 1718156836,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l88b0uo",
                      "score": 1,
                      "body": "This makes no sense lol",
                      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l88b0uo/",
                      "created": 1718170910,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l88bba1",
                          "score": 1,
                          "body": "Does to me.... theres no way i could have the willpower to save thousands of easily accessible dollars when i was in my early 20s. If you could, more power to you.",
                          "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l88bba1/",
                          "created": 1718171089,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l87ccsn",
              "score": 3,
              "body": "This is irresponsible. Your emergency fund should be a set amount of money you can always depend on in an EMERGENCY, not a variable amount of money that fluctuates with the market. If you can’t even save up a couple months worth of expenses in liquid cash, you aren’t in a financial position to be investing in the stock market outside of your retirement account.",
              "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87ccsn/",
              "created": 1718154282,
              "depth": 2,
              "replies": [
                {
                  "id": "l87hsl2",
                  "score": 1,
                  "body": "The guy is clearing an extra 20-50 a month. What emergency is he going to prep for? \n\nLet him have the opportunity to see what his money can do when it works for him.",
                  "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87hsl2/",
                  "created": 1718156600,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l87jgrm",
                      "score": 1,
                      "body": "Ok, best case scenario the guy invests $600 a year in the market. Realistically, that’s pretty negligible in the grand scheme of investing. But that $600 could actually make the difference between an emergency being an annoyance or a life altering problem if you wouldn’t otherwise have it. OP could get screwed over if that $600 becomes $400, but you really needed the $600 you had in the first place. That isn’t a risk you should be taking with your financial safety net.",
                      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87jgrm/",
                      "created": 1718157316,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l87rp59",
                          "score": 2,
                          "body": "I understamd what you're saying. But from my perspective, asking someone to have a first step be a smart, responsible emergency fund is a tall order because there's no positive reinforcement.\n\nIm just trying to be realistic.",
                          "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87rp59/",
                          "created": 1718160958,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l878flq",
      "score": 3,
      "body": "As others have said… start with VOO or another s&p 500 index fund and chill. Don’t gotta rush things! As you learn, then maybe you can start to venture out in other funds.",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l878flq/",
      "created": 1718152573,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87cc5e",
      "score": 3,
      "body": "I see there as a few paths that are attractive for people in the accumulation phase. \n\n100% low cost equity ETF (common choices are VOO, VTI, VT just choose 1)\n\n85% low cost equity ETF, 10% long term treasuries (VGLT, TLT, EDV), 5% gold (GLDM).  This historically smoothes out volatility with no major impact on returns.  Need to rebalance.\n\n100% NTSX.  Leveraged ETF thst gives you 90% stocks, 60% bonds.  Growth plus diversification.",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87cc5e/",
      "created": 1718154274,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l870z5a",
      "score": 5,
      "body": "Stocks can be scary, but you’re on the right track. Start small with $20-$50 every two weeks. Use robo-advisors like Betterment or Wealthfront, and consider ETFs like VOO ( low management fee) to diversify. Automate your investments, learn the basics from Investopedia, and don’t stress over daily market changes. Spread your investments to lower risk and think long-term. \n\nStarting is the hardest part.",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l870z5a/",
      "created": 1718149414,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87b7oo",
      "score": 2,
      "body": "Buy the bluechips. Look up the S&P 500 by market cap and select a few top companies. The big techs have made many of us a lot of money and in general, you can’t go wrong with the biggest and best companies in the world. M1 allows you to make a “pie” of your favorite companies and add money each week/month etc buying fractional shares.",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87b7oo/",
      "created": 1718153782,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87hq8j",
      "score": 2,
      "body": "Voo and chill",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87hq8j/",
      "created": 1718156573,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l878xt6",
      "score": 2,
      "body": "As the others have said, start with a broad fund. \n\n* Big US companies: VOO, IVV, SPLG, FXAIX\n* US companies of all sizes: VTI, ITOT, SPTM, FSKAX\n* Foreign companies: VTIAX, EFA, FSPSX\n* There are also [target date funds](https://investor.vanguard.com/investment-products/mutual-funds/target-retirement-funds) that contain a bit of everything and reallocate as your goal date approaches\n\nBuying a stock is buying a stake in a business, so it is kind of a [serious decision](https://www.morningstar.com/stocks/even-warren-buffett-thinks-stock-picking-is-hard). If you’re not sure or don’t want to put in the time assessing individual companies, a fund is an easy way to spread your bets around. \n\nYou'll actually do better that way than the average stock-picking investor, because most of us are [terrible](https://www.thestreet.com/opinion/stock-picking-is-a-fools-errand-11522723) at assessing a company’s prospects and fair value. Instead we buy on hype or chase *[yesterday’s](https://www.bmo.com/mybmoretirement/pdf/resource-library/09-325-023_BHBMI431_Chasing_performance_7-11.pdf)* hot companies and industries. ",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l878xt6/",
      "created": 1718152792,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87amf3",
      "score": 1,
      "body": "Robinhood allows you to buy fractional shares of stocks.",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87amf3/",
      "created": 1718153520,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87atez",
      "score": 1,
      "body": "FYI Investing https://docs.google.com/document/d/1PPR2jaieJo8OwWHaM72EGnoBXq8MZjJipVhlVu-GCvE/edit?usp=drivesdk",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87atez/",
      "created": 1718153604,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87au0s",
      "score": 1,
      "body": "voo or splg.",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87au0s/",
      "created": 1718153612,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87bhkp",
      "score": 1,
      "body": "SPY is always a decent one",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87bhkp/",
      "created": 1718153904,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87d1tc",
      "score": 1,
      "body": "There are plenty of ways to invest. Most will inevitably involve buying low cost etfs. I would start there.\n\nAlso before you think about picking individual stocks. do yourself a favor. You probably got many years until retirement. Figure out that number and then look back in the past that far at the market. Tell me which stocks from then would you have picked then and held until now. For example if you got 40 years until retirement go look at the 1985 stock market top 100 companies. Most of them are going to be ones you have never heard of and are probably still around. I say this because the further you are from retirement the more likely your single stock picks are going fail over that long time period. \n\nNow with that out of the way basic investing in etfs for at least a few decades is likely the smart move. You can look up various strategies but most will have some exposure to the sp500. With the money you are talking about you can probably just do the sp500 for 10-15 years and if you decide later you want something else just stop contribute to that other thing then. The bulk of your saving is likely still in front of you by another 20 years or more. So for now avoid trying to pick the perfect stuff. Go with the low expense etfs. If you want more dividends pick a dividend etf. If you want global pick a global etf. If you want more tech get something like QQQ, but if you just want to keep it really simple get an sp500 etf and move on.",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87d1tc/",
      "created": 1718154578,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87eta8",
      "score": 1,
      "body": "Either put it in a voo style etf or Save your money and wait for a big correction or crash then pump it into a blue chip that has been decimated. There will be some blood as more banks fail especially if we have any sort of meaningful downturn to exacerbate the CRE market",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87eta8/",
      "created": 1718155326,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87gfdf",
      "score": 1,
      "body": "You could start a coke habit.",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87gfdf/",
      "created": 1718156014,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87h3uh",
      "score": 1,
      "body": "Do you have a brokerage account yet?",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87h3uh/",
      "created": 1718156305,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87lh8j",
      "score": 1,
      "body": "A lot of advice here is very good. But you say you are 'lost'. I believe you are referring to the multitude of terms that are overloading your brain. While you are thinking of investing, the first thing is to choose a brokerage firm that best suits your small contributions. Then, go to [Investopedia.com](https://investopedia.com) and look up the definitions of stocks, bonds, mutual funds, and ETF. Later, you can expand your knowledge with ETN, CEF, BDC, REIT, Preferreds, baby bonds, etc. Once you are armed with that knowledge, you can branch out.\n\nJust remember: ETFs and mutual funds or similar \"basket of stocks\" will almost contain the cream of the crop as well as the ordinary and not so devine. Thus, its growth or dividends will be averaged. As you learn more and earn more, you can expand into the realm of individual, top quality stocks to improve your chances of growth/dividends with lower risk. The future is yours. Just be wise with your hard earned money, not foolish.",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87lh8j/",
      "created": 1718158181,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l872ndw",
      "score": 1,
      "body": "Start with paper trades. Even find some folks who can help you daily as well.",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l872ndw/",
      "created": 1718150110,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l878tjl",
      "score": 1,
      "body": "My recommendations for starters in order from lower to higher risk:\n\nSCHD - Dividend ETF of US companies. Provides lower volatility and passive income from dividends.\n\nVOO - Index fund of the S&P 500 (top 500 US companies). Every portfolio needs it and even professional traders on Wall Street struggle to outperform it on a yearly basis. \n\nQQQ - ETF that tracks the tech-heavy NASDAQ and has more potential for growth than the others, but also higher downside risk.",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l878tjl/",
      "created": 1718152741,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87babf",
      "score": 1,
      "body": "Definitely apply for an options account and go all in on GME calls. You will be a millionaire before the end of the month.",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87babf/",
      "created": 1718153814,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l877t8j",
      "score": 0,
      "body": "Beware of Internet strangers throwing random tickers at you.\n\nDo your own research.",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l877t8j/",
      "created": 1718152302,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87bkmk",
      "score": 0,
      "body": "Use that extra cash on hookers and drugs until u figure it out",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87bkmk/",
      "created": 1718153941,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l87iwct",
      "score": 0,
      "body": "Not financial advice but I'd buy GameStop",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87iwct/",
      "created": 1718157074,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l879bji",
      "score": -2,
      "body": "Everyone saying VOO or SPY. But I recommend SPXL, TQQQ. These 3x leveraged ETFs are risky in the short term, but if you wait long enough, you can easily double your return. ",
      "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l879bji/",
      "created": 1718152955,
      "depth": 0,
      "replies": [
        {
          "id": "l87lwee",
          "score": 1,
          "body": "Why the downvote",
          "permalink": "/r/stocks/comments/1dds7tf/im_completely_lost/l87lwee/",
          "created": 1718158365,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}