{
  "title": "EU to impose multibillion-euro tariffs on Chinese electric cars / ",
  "score": 395,
  "selftext": "",
  "link_flair_text": "News",
  "id": "1de07al",
  "num_comments": 227,
  "created_utc": 1718174681,
  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/",
  "url_overridden_by_dest": "https://www.ft.com/content/0545ed62-c4b9-4e8a-80fa-c9f808e18385",
  "comments": [
    {
      "id": "l88gwdh",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 147 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88gwdh/",
      "created": 1718174684,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l88qbwm",
      "score": 204,
      "body": "This is why Elon was so desperate to increase production in Germany a few months ago. Dude could see this from 10 miles away",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88qbwm/",
      "created": 1718181440,
      "depth": 0,
      "replies": [
        {
          "id": "l89gawt",
          "score": 35,
          "body": "Doesn't it that the locals in Germany aren't too keen on having Tesla factory there after all the halts and protests?",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89gawt/",
          "created": 1718196497,
          "depth": 1,
          "replies": [
            {
              "id": "l89iicr",
              "score": 80,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89iicr/",
              "created": 1718197417,
              "depth": 2,
              "replies": [
                {
                  "id": "l89mmvc",
                  "score": 36,
                  "body": "I get a kick out of the fact that the forest they're trying to protect is going to be cut down eventually anyway as it's a plantation for paper production. And the water consumption is reportedly coming in much lower than originally calculated because production waste water can be treated on site and reused. They are really \"Capitalism bad!! Spaceship man bad!!\" protestors cosplaying as environmentalists",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89mmvc/",
                  "created": 1718199045,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8ap4jw",
                      "score": 7,
                      "body": "The funniest thing is that there is an active lignite coal mine next to the factory and forest that is completely ignored",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8ap4jw/",
                      "created": 1718212471,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8ez6o5",
                          "score": 2,
                          "body": "I mean.. Germans are the one who shut down nuclear plants to fall back on coal when they needed more energy.",
                          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8ez6o5/",
                          "created": 1718281481,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l8apivh",
                          "score": 1,
                          "body": "I think it might have the wrong owner and a protest wouldn't make great headlines in the media because you cannot mention that one guy",
                          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8apivh/",
                          "created": 1718212602,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "l8dv4ql",
                      "score": 1,
                      "body": "Germans have been idiots for a while, but they are generally friendly and the beer is good",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8dv4ql/",
                      "created": 1718256390,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l8a1kzw",
                      "score": -3,
                      "body": "Tesla and Elon are famous for worker rights abuse, just look at what happened in Sweden and the protests/strikes.\n\nThey should instead invest in domestic electric car production, via Renault, VAG, etc. but they kind of shit the bed with neoliberal capitalist short term profit over cost and innovation, so I don’t really care if Chinese cars take their lunch. \n\nImport Chinese electric cars and if Europe can’t compete, then fuck em. China innovated and Europe/America stagnated, they scream in favor of capitalism then cry to mommy when they get outplayed.",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8a1kzw/",
                      "created": 1718204432,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l8adt99",
                      "score": -3,
                      "body": "Wrong. It shut down due to the mysterious injuries of the workers they get every day thus not complying with regulations. But I guess I'm responding to a Russian propaganda bot.",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8adt99/",
                      "created": 1718208730,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8af686",
                          "score": 6,
                          "body": "That's really not why it shut down. The last shut down was a sabotage attack on a power line. But also yes, I am probably the worst Russian propaganda bot to ever exist because that certainly is part of the topic at hand here. I usually give Putin a reacharound in the evening. Care to find out more?",
                          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8af686/",
                          "created": 1718209191,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l89jc6f",
                  "score": 28,
                  "body": "They complained about destroying the forest. A forest that was man made. They complain about water usage, but they don't get that way about their home grown car companies. They complain about electricity usage to a company that can install its own brand of solar panels and install battery backup both for their site and the surrounding communities to ensure grid stability.  These aren't real environmentalists. These are nationalists and we all know how violent Germany's nationalists gets when they organize.",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89jc6f/",
                  "created": 1718197751,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8bmlmq",
                      "score": 1,
                      "body": "Buahahahahaha.   Omg that is great!  Well done",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8bmlmq/",
                      "created": 1718223461,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l89tfev",
                  "score": 6,
                  "body": "These activists pissed me off so much. They don't actually care about environment, else they would actually researched and be informed of what's actually best for environment. Instead they only care about feeling righteous while remaining ignorant.\n\nGreedy corporation at least follow profit so they are negotiable through incentives. These unwavering morons only follow their feelings regardless of facts, and still somehow believe they are the heroes.",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89tfev/",
                  "created": 1718201587,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l89uj5i",
                      "score": 8,
                      "body": "It's ridiculous, and EU regulations have listened.\n\nEU regulator: \"thou should go renewable energies, like solar\"\n\nPpl: \"ok, solar panel needs silver, may I mine silver?\"\n\nEU regulator: \"nope, bad for environment\"\n\nPpl: \"but.. uh..what?\"\n\nEU regulator: \"nope\"",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89uj5i/",
                      "created": 1718201983,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l8c3i2r",
                  "score": 2,
                  "body": "I wished Germans had a brain and protested like this when they phased out nuclear power for coal. As a German myself I think these people have no fucking clue.",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8c3i2r/",
                  "created": 1718229254,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l89v55h",
                  "score": 1,
                  "body": "How is sticking with the status quo of ICE vehicles better for the environment? \n\nI’m an environmentalist and can’t stand “activists” like this. Technological stagnation and degrowth won’t help the environment…quite the opposite in fact.",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89v55h/",
                  "created": 1718202200,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8946oe",
      "score": 56,
      "body": "Electric cars seem more like appliances tbh. Fewer moving parts, no major differences in performance. Essentially for the average driver, all an EV comes down to is the same electric skateboard with a different cabin on top. The tariffs seem like a pretty crude tool to buy the western manufacturers more time to become competitive.\n\nThe situation feels similar to the music industry end of the CD era. Massively overpriced CDs being sold while digital music and streaming was inevitable. Entry level cars often cost people’s entire yearly salary or above. It doesn’t seem sustainable.",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8946oe/",
      "created": 1718190686,
      "depth": 0,
      "replies": [
        {
          "id": "l8axmy2",
          "score": 7,
          "body": "Euro manufacturers are gearing up for under 25K Euro entry level cars, the first is out since a month and something ago and it has a decently sized (44 kwh usable) LFP battery and is a fully featured hatchback. Euro manufacturers need a couple of years to get the ball fully rolling but it’s happening.\n\nThe performance - while it’s easier than ever to make a high performance car engine wise, there’s a huge gulf between a Citroen C3 and a Taycan and there are a lot of differences in driving dynamics and handling between cars of different types.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8axmy2/",
          "created": 1718215243,
          "depth": 1,
          "replies": [
            {
              "id": "l8b0vho",
              "score": 3,
              "body": "A 25k euro car that can drive on the motorway, so say can do 70-80mph comfortably and have an ok range will meet a lot of needs. For a lot of people most of your journeys are very short, but you need to capability of going far and at motorway speeds. I hope we see more of these cars soon! I think once we meet the tipping point of take up the charging network will develop in tandem.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8b0vho/",
              "created": 1718216303,
              "depth": 2,
              "replies": [
                {
                  "id": "l8b23t5",
                  "score": 1,
                  "body": "This type of car is perfect for the city and surroundings bug is a pain to drive on the highways because you need to charge too often for anyone’s taste.\n\nLong distance travel can be done, sure; I have a Peugeot e208 with a 45kwh battery and since my van broke down, we went from Split, Croatia to Bilbao over a day and a half of driving and charging with three kids onboard and luggage for a month, but it was quite an adventure and not for everyone, especially with the disjointed state of European fast charging networks.",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8b23t5/",
                  "created": 1718216703,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8b4zwg",
                      "score": 3,
                      "body": "Yeah not ideal. I regularly do a 350 mile journey in the UK. I can do it easily with one tank in my petrol SUV. If a basic bitch EV can start doing it then I’d be all over it.",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8b4zwg/",
                      "created": 1718217653,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8dvsnw",
                          "score": 1,
                          "body": "Yeah, that’s why we have a diesel passage van in addition to the EV, seats up to 8 and a ton of stuff, drives almost like a car, spends something like 10l per 100km, and takes the same road and parking space as a bigger SUV. Ideal family car for a larger family, but like all modern diesel engines, the engine can get expensive to maintain.\n\nThe small EV gets driven a lot more daily, though, racked up 42000 km in less than two years. I expect by the end of the decade the range and charging networks will be fine for long trips even in a basic EV.",
                          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8dvsnw/",
                          "created": 1718256792,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l8b5705",
          "score": 1,
          "body": "The biggest problem is the batteries. That’s not solved as of right now. It’s too unreliable and people hate unreliability in the West",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8b5705/",
          "created": 1718217717,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l89g3ry",
          "score": -11,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89g3ry/",
          "created": 1718196414,
          "depth": 1,
          "replies": [
            {
              "id": "l89mp90",
              "score": 13,
              "body": "Supercharger network is open to all brands since a few months",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89mp90/",
              "created": 1718199070,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l89rl9w",
              "score": 7,
              "body": "The non-supercharger networks are significantly larger in Europe than the Tesla supercharger network is actually. It is almost more difficult to charge your Tesla at Tesla superchargers only than it is to charge at other fast charging networks (such as IONITY, Fastned, Allego, Shell to name a few).",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89rl9w/",
              "created": 1718200917,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l89iy6q",
          "score": -10,
          "body": "detail hobbies price mighty hard-to-find chase fretful swim late scandalous",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89iy6q/",
          "created": 1718197595,
          "depth": 1,
          "replies": [
            {
              "id": "l89jqlh",
              "score": 11,
              "body": "Yeah but the western auto makers def have the ear of their respective governments and they’re currently addicted to selling very expensive cars on finance. The last thing they want is competition at half the price. There doesn’t need to be only one factor at play.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89jqlh/",
              "created": 1718197912,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l89k9of",
              "score": 2,
              "body": "The west doesn’t want to cut their profits in half. Over priced cars with auto loans are a massive money maker for the west. China will expose them for being too greedy.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89k9of/",
              "created": 1718198123,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8902o3",
      "score": 34,
      "body": "“Brussels is pushing ahead with Chinese electric vehicle tariffs of up to 38 per cent, brushing aside German government warnings that the move risks starting a costly trade war with Beijing.”\n\nThat’s is an interesting take for Germany because they have a huge car manufacturing industry (quick google) that’s 5% of the GDP of Germany. Twice that of France and also employs up to a million people. \n\nIn my opinion it’s a good move to make the market for EV’s more competitive and bring/add jobs to the EU instead of only the end products. \n\nBYD, for example, has affordable EV’s that feel luxurious (personal impression). If they could be assembled/made in the EU because the import tariffs are too high to be competitive could be a positive move. More jobs in the EU but also affordable cars, which in theory should compel traditional car companies to follow suit. \n\nAlso the thing with EV’s is that the whole industry of (ICE)car parts/garages will implode. Less maintenance and less parts. Manufacturing in the EU could in theory help relieve that (in time) shrinking industry.",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8902o3/",
      "created": 1718188265,
      "depth": 0,
      "replies": [
        {
          "id": "l89de85",
          "score": 18,
          "body": "They are already building an EU assembly plant in Hungary. They will just sell it as European while China will tax actual EU products.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89de85/",
          "created": 1718195228,
          "depth": 1,
          "replies": [
            {
              "id": "l89g1a3",
              "score": 3,
              "body": "That's the idea",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89g1a3/",
              "created": 1718196385,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l898gw3",
          "score": 12,
          "body": "AFAIK companies like BYD bring their own supply chain vendors, so their actual contribution to European industry is marginal. I could be wrong but if this is true then it's worrying.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l898gw3/",
          "created": 1718192916,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l89lswp",
          "score": 3,
          "body": "it's because germany exports a shit ton of cars to china",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89lswp/",
          "created": 1718198724,
          "depth": 1,
          "replies": [
            {
              "id": "l8bm7u6",
              "score": 1,
              "body": "This is the real reason. Germany would sooner hand over some EU market share than lose their Chinese car market. VWs largest market is China.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8bm7u6/",
              "created": 1718223337,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l89vt0k",
          "score": 7,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89vt0k/",
          "created": 1718202435,
          "depth": 1,
          "replies": [
            {
              "id": "l8k1bn3",
              "score": 1,
              "body": "I should have explained it more because you misinterpret my comment. Also, I sincerely hope you don’t go about life trying your best to insult people. Taking that path will only lead to more negativity. \n\nLet me try again;\nIn my opinion it makes sense to put in tariffs if that means that production will move from China to the EU. Otherwise it’s just protecting the EU EV market which isn’t competitive for many reasons. The latter will probably lead to more expenses for costumers and less EV’s on the road. \n\nIF the tariffs are too high it could lead to moving production to the EU. If the production stays in China then the competitiveness of BYD in my example will go down or disappear.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8k1bn3/",
              "created": 1718357588,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l89fl65",
          "score": 15,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89fl65/",
          "created": 1718196192,
          "depth": 1,
          "replies": [
            {
              "id": "l89i9f8",
              "score": 4,
              "body": "> But it proves that the EU doesn't care about the environment, and this was always about money and not about lowering emissiond as quickly as possible.\n\nThats a teenager \"world is black or white\" take. In case you are wondering, every decision has many factors playing into it, environmental protection is one of them, but not the only one.\n\nThis very well explains why there are people who literally burn the plastic off of cables on a garbage dump. Its not because they dont care for the environment, its because they dont like to starve themselves or their families.\n\nVoters care for the environment, but only up to a personal threshhold. Just check what people are voting and its much easier to understand.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89i9f8/",
              "created": 1718197314,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l89jezc",
              "score": 0,
              "body": "Its not about money either, this has always been an attempt to stop depending on Russian oil, and now Russian allies",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89jezc/",
              "created": 1718197782,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l89w8j8",
      "score": 11,
      "body": "Sure, because that mid-tier BMW is totally worth €80K…\n\nApparently, capitalism is good only if it does not harm your home-grown corporations.\n\nWhat an assortment of fuc*ing hypocrites",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89w8j8/",
      "created": 1718202588,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l88lfqe",
      "score": 76,
      "body": "Damn how good are these Chinese EVs?\n\nWestern countries doing all they can to stop the free market",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88lfqe/",
      "created": 1718177834,
      "depth": 0,
      "replies": [
        {
          "id": "l89ajzk",
          "score": 46,
          "body": "It would decimate the auto industry as people would catch on real quick that they have been throwing money away propping up and buying overpriced western vehicles. Our automakers won't even attempt to build a comparable vehicle. Those in power want us stuck upside down in 5-9 year auto loans on vehicles that lose 10% of their value the first time you touch the steering wheel",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89ajzk/",
          "created": 1718193922,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8984ln",
          "score": 31,
          "body": "Really good. I'm in China right now and every fifth car is an EV. Design, features, range, affordability - blows away the western competition. While the west was stagnating on auto innovation, the Chinese were going all-in. Even the uber-rich Chinese are buying domestic luxury EV brands. \n\nLess than 10 years ago the only EVs on the road were buses and maybe a taxi fleet here and there.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8984ln/",
          "created": 1718192749,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l88zquq",
          "score": 19,
          "body": "I’ve had the chance to ride in a few BYD cars (using grab, Asian version of Uber) and they’re really good. EU is right to be worried.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88zquq/",
          "created": 1718188057,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l88nuv2",
          "score": 26,
          "body": "[https://youtu.be/g4iM1J_HdHE?si=PE11LXmoUDUDFVtY](https://youtu.be/g4iM1J_HdHE?si=PE11LXmoUDUDFVtY)\n\nAnd a $100k Porsche Taycan doesn’t even have that level of infotainment system, not even close.\n\nThey just keep copying to a point that they can make it better than the original.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88nuv2/",
          "created": 1718179603,
          "depth": 1,
          "replies": [
            {
              "id": "l890au7",
              "score": 22,
              "body": "That's exactly what the Germans did with British products. A tale as old as time. Made in Germany was even a warning label back in the day lol.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l890au7/",
              "created": 1718188409,
              "depth": 2,
              "replies": [
                {
                  "id": "l897djt",
                  "score": 8,
                  "body": "Then Japan, and then South Korea. And I wonder who's next after China? India? Mexico? Although Mexico doesn't have the copying phase, it is getting investment directly from OEM manufacturers.",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l897djt/",
                  "created": 1718192375,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8a220c",
                      "score": 6,
                      "body": "I’m Mexican, there are probably differences between Mexico and China that will not make that possible.\n\nMexico government and companies are more than happy to stick with low skill manufacturing jobs. Little development is being done here and I feel that there is no push to develop or even copy technology.\n\nWe are mostly used as a cheap manufacturing entry point to the US thanks to the NAFTA.",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8a220c/",
                      "created": 1718204595,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l89ukxg",
                      "score": 5,
                      "body": "Demographically, Mexico is the next China.  Factories take young workers.",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89ukxg/",
                      "created": 1718202001,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l88slse",
              "score": -16,
              "body": "If the car is anything like chinese deluxe products its gonna look great but its gonna fall apart and incur bigger costs down the road. There is a reason why its so cheap. Lets see these chinese cars reach 10 years of usage or 250000+ km.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88slse/",
              "created": 1718183155,
              "depth": 2,
              "replies": [
                {
                  "id": "l88u7p5",
                  "score": 18,
                  "body": "i would not be surprised if they last longer than a cybertruck",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88u7p5/",
                  "created": 1718184337,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l88vdnv",
                      "score": 5,
                      "body": "Honestly tesla is also not good show of quality. I meant more like standard eu brands, japanese, korean and chevy maybe.",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88vdnv/",
                      "created": 1718185175,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l896vyp",
                      "score": 1,
                      "body": "Tesla definitely isnt a standard for quality control what are you talking about?",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l896vyp/",
                      "created": 1718192125,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l890ug5",
                  "score": 8,
                  "body": "It's so cheap because the Chinese were/are investing a shitload in battery tech in the early 2000s. They reap the benefits these days. \nThey have the best battery tech in the world.\n\nit's not as if the same investment opportunities were not provided to western based nations and in particular the Germans. Our leaders fucked up there, plain and simple and they know it.",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l890ug5/",
                  "created": 1718188746,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l89bf5n",
                      "score": 2,
                      "body": "They do and that’s why they introduced tariffs so west can catch up :)",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89bf5n/",
                      "created": 1718194332,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l88ur7r",
                  "score": 3,
                  "body": "And so do BMW, Audi, Alfa Romeo, Buick, and so on. But the difference is, they aren't even cheap to start with.",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88ur7r/",
                  "created": 1718184731,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l88vl8c",
                      "score": 4,
                      "body": "My 21 y old Alfa Romeo is a few thousand km away from 300 k. Like 298 or sth. It's stellar in reliabilty, despite the shitty sentiment that keeps getting attached to them, most likely due to a TV show from the 2000s. It's been WAY better than the 2000 Golf that we also have in our family. Unlike the Golf, it doesn't leak every fluid every couple years, the door locks stay in the doors, it doesn't need it's PCV cleaned every 10k kms. I know car market lives only of off stereotypes at this point. I will never buy a German car again.",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88vl8c/",
                      "created": 1718185325,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l89in01",
                  "score": 1,
                  "body": "I have a friend who is driving a Chinese EV with the company 曹操出行。he has 400000 kms on the odometer,  he told me he had zero problem with this car. The EV is produced by Chery group.",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89in01/",
                  "created": 1718197470,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l88tl64",
          "score": 28,
          "body": "It's not that they're good, it's that they're subsidized heavily by the government from all aspects. From upstream all the way to downstream subsidized by government. So at the end of the day the government ends up paying for the a large % of the car itself. And EU/USA can't compete with that if they're not also offering the same subsidies.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88tl64/",
          "created": 1718183880,
          "depth": 1,
          "replies": [
            {
              "id": "l89c6cn",
              "score": 8,
              "body": "They are subsidized, but you also can't deny the fact that they are great and feels great. BYD have the feel and interior luxury package as a 300k sports car for much much less while having decent performance.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89c6cn/",
              "created": 1718194678,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l891jhx",
              "score": 36,
              "body": "Western cars are also heavily subsidized by our governments even more than the Chinese car in some cases. We just spend our money less efficiently. \n\nIt comes down to their superior battery facilities and tech. They got us beat there because our politicians were sucking oil lobby dick.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l891jhx/",
              "created": 1718189164,
              "depth": 2,
              "replies": [
                {
                  "id": "l897z1f",
                  "score": 1,
                  "body": "It comes down to subsidies and an authoritarian government. \n\nThey make shit wages but hey we love companies who mistreat employees. \n\nhttps://carnewschina.com/2024/05/20/strike-at-byd-factory-in-wuxi-workers-seek-fair-treatment/\n\nThe job postings for the BYD factory in Wuxi in the past two months indicated a basic wage of 2,490 yuan (345 USD), which coincides with the minimum wage in Jiangsu province. Stable overtime hours are necessary to earn a monthly income of 5,000 to 6,500 yuan (690 to 897 USD) advertised by intermediaries.",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l897z1f/",
                  "created": 1718192671,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8a4o7r",
                      "score": 6,
                      "body": "But these are standard China wage levels. It's their advantage over the West which they're trying to exploit. How can you blame them for that?",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8a4o7r/",
                      "created": 1718205498,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l8cwbxt",
                      "score": 1,
                      "body": "its not like they were buying thing in USA prives there..",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8cwbxt/",
                      "created": 1718240522,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l89lghj",
                  "score": 1,
                  "body": "ancient agonizing jar wide chop dog disagreeable rainstorm grandfather include",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89lghj/",
                  "created": 1718198588,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l89c8wy",
              "score": 10,
              "body": "You clearly have no idea what cars are being sold in China and the technology they have. The hybrid system the fuel efficiency the range and infotainment. Typical example of reading about subsidies online and thinking that’s the only reason",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89c8wy/",
              "created": 1718194710,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l88w4vm",
              "score": 7,
              "body": "Alfa Romeo was a bit like that in the past AFAIK and they lost money on every Alfa 75 sold. Later bought by Fiat. So I wonder how will a similar process turn out in the future.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88w4vm/",
              "created": 1718185696,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l890oh0",
              "score": 3,
              "body": "Don't be a delusional fool who believes everything is being told.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l890oh0/",
              "created": 1718188646,
              "depth": 2,
              "replies": [
                {
                  "id": "l890skn",
                  "score": 3,
                  "body": "Are you able to provide your research to disprove it?",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l890skn/",
                  "created": 1718188715,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8917wk",
                      "score": 2,
                      "body": "They sell them cheaper in china?And How in the world did they still in business if every car they produced loses profit?(byd reached top 4 car brand in the world btw)",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8917wk/",
                      "created": 1718188971,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l898261",
                          "score": 0,
                          "body": "Subsidies and shit wages.",
                          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l898261/",
                          "created": 1718192715,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l89d2fk",
                              "score": 4,
                              "body": "So Chinese gov throw subsidies until byd is top 4?Why not just go for top 1?",
                              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89d2fk/",
                              "created": 1718195080,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l88wtom",
          "score": 9,
          "body": ">Western countries doing all they can to stop the free market\n\nWell, the Chinese cars are subsidized by their government. So they can be shipped with way lower cost than they would need to prise them. \n\nObviously free market companys can't compete with those market manipulation.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88wtom/",
          "created": 1718186132,
          "depth": 1,
          "replies": [
            {
              "id": "l893soj",
              "score": 35,
              "body": "No difference from Boeing, Lockheed Martin or Monsanto. Even GM gets subsidized.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l893soj/",
              "created": 1718190472,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l898g8f",
              "score": 18,
              "body": "How is Tesla any different? Major government investment and tax breaks, in addition to federal and state consumer discounts.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l898g8f/",
              "created": 1718192908,
              "depth": 2,
              "replies": [
                {
                  "id": "l898odm",
                  "score": -5,
                  "body": "> tax breaks, in addition to federal and state consumer discounts.\n\nYeah, but when sold in the own country. \n\nChina even subsidises every single vehicle which is exported. Not just their own people in their own country.",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l898odm/",
                  "created": 1718193018,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l89v37g",
                      "score": 6,
                      "body": "Tesla made massive amounts of their early money from Norway subsidizing EVs (which Tesla had some of the only ones at the time) to a ridiculous amount.",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89v37g/",
                      "created": 1718202181,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l890rdv",
              "score": -1,
              "body": "Yep, it's part of Xi's Make-China-Great-Again 2025 (aka, Made-In-China 2025).\n\nYou are effectively competing against the whole country.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l890rdv/",
              "created": 1718188695,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l89xibe",
          "score": 1,
          "body": "same as how the Japanese car took over the westen market. For too long western companies are selling overpriced car with little innovation.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89xibe/",
          "created": 1718203033,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l890oqs",
          "score": 1,
          "body": "I believe they’re suggesting they’re not operating in a free market as the Chinese government runs the companies at a massive loss. Eventually European & US car makers go broke & you’re reliant on China would be the argument I guess…I’m not sure if it’s true or made up though.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l890oqs/",
          "created": 1718188651,
          "depth": 1,
          "replies": [
            {
              "id": "l8942yz",
              "score": 20,
              "body": "Every time GM has goes broke, the US taxpayers keep it afloat. Certainly a free market.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8942yz/",
              "created": 1718190628,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l89v9ed",
              "score": 5,
              "body": "So wait, if they're running at a loss, who is paying for that loss?  The Chinese government?\n\nSo you're telling me the Chinese government is willing to pay to give Americans and Europeans cars, and that's a bad thing?",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89v9ed/",
              "created": 1718202241,
              "depth": 2,
              "replies": [
                {
                  "id": "l8af6un",
                  "score": 3,
                  "body": "Imagine thinking they’d let a company run at a loss instead of putting money into the competing Chinese car company that doesn’t run at a loss. These people are delusional. US could bankrupt China by buying their EVs.",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8af6un/",
                  "created": 1718209196,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8b3ooh",
                  "score": 3,
                  "body": "If it leads to dependance on a strategic resource: Yes.\n\nWhy does the US subsidize the crap out of agriculture despite the fact dozens of countries can grow crops on cheaper land, with cheaper labor?\n\nBecause if you go to war, you damn sure want to be able to continue to eat, which is harder to do if you were importing 20% of your food from a now hostile nation, or that nation isn't hostile, but its shipping lanes are being blockaded or raided. \n\nHaving the US fleet of cars dependant on China for maintenance and replenishment would put the US in a strategically vulnerable position with their no 1 geopolitical rival.",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8b3ooh/",
                  "created": 1718217221,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8c9b72",
                      "score": 1,
                      "body": "Huh, maybe the US would then be better off spending money on electric car production instead of bases ringing China?",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8c9b72/",
                      "created": 1718231435,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l8at8rl",
                  "score": 1,
                  "body": "Yes, it's is called price dumping. In the short run it is good for the consumers, but once the competition is driven out of business and they have the market for themselves they will reap the gains with massively inflated prices.",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8at8rl/",
                  "created": 1718213813,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8c9fox",
                      "score": 1,
                      "body": "Where US companies, protected by tarriffs, would never just pocket that money as additional profit?",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8c9fox/",
                      "created": 1718231483,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l88xocd",
      "score": 44,
      "body": "What is their goal / plan? Because VW, BMW and Mercedes have absolutely crap EV vehicles and have given up. ",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88xocd/",
      "created": 1718186701,
      "depth": 0,
      "replies": [
        {
          "id": "l898c20",
          "score": 7,
          "body": "To protect EU market. Supposedly.\n\nTo my understanding leaders are afraid Chinese products can hurt the market. Not just the dumping, but also the fact they bring their own vendors and supply chain anyways, so like zero integration into the European economy and/or infrastructure.\n\nIt's arguable they can't protect the EU this way, but it's for sure they have a valid reason, considering above facts. As if Chinese companies want to sell, take the money, and move on, without any meaningful cooperation. Essentially to cut down on EU market like locusts.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l898c20/",
          "created": 1718192851,
          "depth": 1,
          "replies": [
            {
              "id": "l8brmul",
              "score": 1,
              "body": "Until China puts tariffs on European cars that account for like 30% of their market.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8brmul/",
              "created": 1718225134,
              "depth": 2,
              "replies": [
                {
                  "id": "l8g2ttv",
                  "score": 1,
                  "body": "We're yet to see how the EU would react to that too. They rarely seem to bend over",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8g2ttv/",
                  "created": 1718295942,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l88ytm7",
          "score": 7,
          "body": "Toyota, Nissan and Kia",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88ytm7/",
          "created": 1718187464,
          "depth": 1,
          "replies": [
            {
              "id": "l89coaf",
              "score": 16,
              "body": ">Toyota\n\n![img](emote|t5_2th52|4271)\n\nThey have *1* EV car with completely shitty range. They bet their whole port on Hydrogen and lost. Now they're playing catch up.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89coaf/",
              "created": 1718194905,
              "depth": 2,
              "replies": [
                {
                  "id": "l89e12n",
                  "score": 6,
                  "body": "They've mainly focused on hybrids but these are poplar in my country at least. What model are you referring to out of curiosity?",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89e12n/",
                  "created": 1718195512,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l89f8yk",
                      "score": 4,
                      "body": "Bz4x",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89f8yk/",
                      "created": 1718196046,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l89jnib",
                  "score": 3,
                  "body": "slimy wine plucky money sharp point label one friendly march",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89jnib/",
                  "created": 1718197878,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l89szpv",
                  "score": 1,
                  "body": "They have 2 cars. Same drivetrain. Bz4x/Solterra",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89szpv/",
                  "created": 1718201429,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8982r5",
          "score": 7,
          "body": "What is the issue with bmw evs? I have an i4 e40 and like it so far.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8982r5/",
          "created": 1718192723,
          "depth": 1,
          "replies": [
            {
              "id": "l899jzf",
              "score": 8,
              "body": "Bmw cost 60k chinese ev cost 10k\n90% of population can afford chinese cars, 10% can afford german or japanese",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l899jzf/",
              "created": 1718193441,
              "depth": 2,
              "replies": [
                {
                  "id": "l89gh89",
                  "score": 11,
                  "body": "Chinese EVs on the European market cost like € 40k to € 60k, not € 10k. And that's without the new import tariffs",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89gh89/",
                  "created": 1718196572,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l89vaxi",
                      "score": 3,
                      "body": "If I ran a Chinese EV company I would take the hit to maintain the price.",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89vaxi/",
                      "created": 1718202256,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l89fqb9",
                  "score": 6,
                  "body": "Those are apples and oranges",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89fqb9/",
                  "created": 1718196255,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l896ozh",
          "score": 11,
          "body": "VW doesnt have crap vehicles and definitely hasn‘t given up. But yeah they’re far behind. The goal is obviously to counter chinese subsidies",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l896ozh/",
          "created": 1718192025,
          "depth": 1,
          "replies": [
            {
              "id": "l89a6eq",
              "score": 15,
              "body": "VW is a crap fest these days, especially for the premium you pay. Asian cars is where it's at",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89a6eq/",
              "created": 1718193740,
              "depth": 2,
              "replies": [
                {
                  "id": "l89asx6",
                  "score": 6,
                  "body": "VW makes most of its revenue in Europe where they most definitely aren’t a premium car maker. Quite the opposite actually, it‘s considered a budget german car maker",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89asx6/",
                  "created": 1718194040,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8a1lkk",
                      "score": 4,
                      "body": "budget? Did you see what their cars cost nowadays? Their UX is terrible, software bugs chasing themselves, they currently don't have a single drive train that lasts more than 70000km, their EVs... let's not even start there. \nI tested a few Asian cars since I was in the market for a new car and they're light-years ahead of VW. ",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8a1lkk/",
                      "created": 1718204437,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l89dlea",
              "score": -2,
              "body": "There are no subsidies, EVs are just that much cheaper to build than ICE.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89dlea/",
              "created": 1718195318,
              "depth": 2,
              "replies": [
                {
                  "id": "l89drgq",
                  "score": 1,
                  "body": "https://reason.com/2024/04/29/china-is-doubling-down-on-electric-vehicle-subsidies/",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89drgq/",
                  "created": 1718195394,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l89bq3j",
          "score": 2,
          "body": "The i4 is one of the best evs out there. You're full of caca",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89bq3j/",
          "created": 1718194472,
          "depth": 1,
          "replies": [
            {
              "id": "l89jss4",
              "score": 1,
              "body": "i4??? Don't make me laugh",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89jss4/",
              "created": 1718197936,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8974t9",
          "score": 3,
          "body": "Their goal is to not allow communist China corner the EV market. \n\nThe country who is working on invading Taiwan that will drag many EU countries into the conflict.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8974t9/",
          "created": 1718192252,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l89lrf6",
          "score": 2,
          "body": "You’re just making stuff up..? They are not giving up on EVs at all lol",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89lrf6/",
          "created": 1718198708,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l89vf9q",
          "score": 1,
          "body": "Giga Berlin baby LFG",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89vf9q/",
          "created": 1718202299,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l88tqo3",
      "score": 28,
      "body": "What I really feel about the issue of Chinese EVs being brought en masse into Europe and North America is this; on the face value of everything, it looks like the EU, US have suddenly turned against their free market ideals of buying and selling, as the levies being imposed here are to fundamentally kill the idea of having Chinese cars on their roads before it can even take hold. What is being done here is potentially so extreme that people will look at the price of a BYD Dolphin or Xpeng 7 and think ‘fuck it, better off buying an ICE vehicle instead’. \n\nIt’s funny in a sense that all of these same EU and US leaders endorsing this kind of levy or tariff are the same ones shouting for people to drive greener cars, imposing hefty fines or surcharges for people who are holding onto their old diesels and petrols. Their problem now is that the ONLY country at the moment which can adequately supply the quantity of EVs needed to meet their climate targets is China. And it’s not just an EV thing, most other ‘green’ technologies like Lithium batteries and solar are 95%+ made in China, which then puts a lot of pressure on themselves to achieve their net Zero/decarbonisation goals. Whether Vietnam, Southeast Asia will be able to meet the demand for Eco-friendly technologies is yet to be seen in the face of rapid decoupling between China and the west. \n\nBut despite all this, trade with China is not entirely within the realm of ‘free trade’ as we like to think. At the end of the day, the Chinese government is an authoritarian, dictatorship body which has extensive or even exclusive control over what their domestic industries produce. Potentially, what the EU and US is trying to pre-empt here is the practice of market flooding, where the Chinese government sanctioned practice of unloading such a massive quantity of cheap product into the market results in domestic vehicle producers (Opel, Ford, Citroen etc) not being able to compete with the sheer number of cheap alternatives, causing their demise and tens of thousands of workers to go out of jobs. Then, in such a scenario it can be argued that China itself does not abide by the principles of free market trade, where the state gives unfair assistance to beat competition which is not afforded such a luxury.",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88tqo3/",
      "created": 1718183992,
      "depth": 0,
      "replies": [
        {
          "id": "l88tqok",
          "score": 7,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88tqok/",
          "created": 1718183992,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l89crx7",
      "score": 10,
      "body": "Ultra competitiveness, the only time capitalism would claim its single bonus point of innovation through competition. Yay!\n\nAnd instead, the consumer will be buggered so western companies can have high prices garbage.",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89crx7/",
      "created": 1718194950,
      "depth": 0,
      "replies": [
        {
          "id": "l89j8pc",
          "score": 9,
          "body": "bear repeat like humor literate meeting puzzled squalid ink amusing",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89j8pc/",
          "created": 1718197713,
          "depth": 1,
          "replies": [
            {
              "id": "l8ce2t2",
              "score": 1,
              "body": "Oh yea, because cheap solar panels and cheap car's are so bad for the consumer...",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8ce2t2/",
              "created": 1718233266,
              "depth": 2,
              "replies": [
                {
                  "id": "l8cr3oj",
                  "score": 1,
                  "body": "offer attraction rude shy whistle hateful ink wistful wrong sink",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8cr3oj/",
                  "created": 1718238432,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l89jdc9",
              "score": -1,
              "body": "Sure",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89jdc9/",
              "created": 1718197764,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l88gywj",
      "score": 7,
      "body": "RIP BYD NIO , LIauto ... ?",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88gywj/",
      "created": 1718174732,
      "depth": 0,
      "replies": [
        {
          "id": "l88hc83",
          "score": 13,
          "body": "TSLA",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88hc83/",
          "created": 1718174981,
          "depth": 1,
          "replies": [
            {
              "id": "l88skho",
              "score": 21,
              "body": "For Tesla it is a double whammy. Europe is one of the main destination for Teslas made in China. So amidst a price war they are now forced to produce more in europe, which is more expensive, while their production facilities in China are now getting cornered to compete more with BYD etc. on their home turf in China.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88skho/",
              "created": 1718183127,
              "depth": 2,
              "replies": [
                {
                  "id": "l891cy8",
                  "score": -5,
                  "body": "Teslas sold in Europe are made in Germany",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l891cy8/",
                  "created": 1718189055,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l891tgn",
                      "score": 16,
                      "body": "No, not exclusively. Teslas produced in China are exported to Europe too.",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l891tgn/",
                      "created": 1718189328,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l89exod",
                          "score": 1,
                          "body": "It’s still a massive reach to say this is bearish news for Tesla.\n\nTesla being a major EV manufacturer with already the constructed major factory to build in Europe, unlike China Based EVs, is a massive advantage over competition in the European market.",
                          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89exod/",
                          "created": 1718195911,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l89kren",
                              "score": 1,
                              "body": "It is not. About half of the Teslas made in China are exported. IF Teslas from China are hit with a tarif that means:\n\nFor Tesla in China that the existing production capacity can not nearly be fully utilized, especially since Tesla is slowly losing ground in China.\n\nFor Tesla in Europe, that the more expensive to produce european made Teslas cannot be diluted with the cheaper to produce chinese Teslas which right now lowers the average production cost of Teslas sold in europe. Without this Tesla faces decreasing margins in europe or a price hike with reduced demand.\n\nThat being said, if the tariffs are not applied on Teslas made in China, which is still up to debate, that would be very good for Tesla.",
                              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89kren/",
                              "created": 1718198316,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l89na0s",
                                  "score": 2,
                                  "body": "Tesla doesn’t necessarily have to face decreasing margins in Europe.\n\nWe shall see just how much this tariff raises BYD prices in EU, cannot be the same percentage wise compared to Tesla. And the consumer picking Tesla when comparing the two increases (BYD would be no doubt much larger percentage wise) is very feasible.\n\nThe vast majority of the time your competitor is hit way harder, it’s good for you.\n\nTesla is poised for a much better pivot than BYD in Europe with their already established infrastructure.\n\nI just think that outweighs the possible negatives you brought up, which very likely will exist to a degree.",
                                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89na0s/",
                                  "created": 1718199292,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l89na1d",
                                      "score": 3,
                                      "body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89na1d/",
                                      "created": 1718199292,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l89nn6z",
                                          "score": 1,
                                          "body": "Always ![img](emote|t5_2th52|4271)",
                                          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89nn6z/",
                                          "created": 1718199432,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l89hrs2",
                      "score": 1,
                      "body": "Only the Y Tesla if I remember correctly",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89hrs2/",
                      "created": 1718197111,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l89fxgm",
          "score": 3,
          "body": "EU market is only a fraction of their total sales. Also they are so far ahead that it's like even after factoring in the duties, Chinese PHEV/EVs will still be cheaper than the EU equivalent.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89fxgm/",
          "created": 1718196340,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8972o5",
      "score": 6,
      "body": "Jobs more important than the climate",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8972o5/",
      "created": 1718192222,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l89jxrg",
      "score": 2,
      "body": "What's stopping China from assembling the cars in the cheaper market that has free trade agreements?",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89jxrg/",
      "created": 1718197991,
      "depth": 0,
      "replies": [
        {
          "id": "l8b7atc",
          "score": 3,
          "body": "China taking the loss on EVs isn't as bad if they are being produced in China. Because you are paying Chinese citizens and buying chinese parts to manufacture the vehicles, so maybe at the end of the day you lose $2000 on the vehicle (from a government perspective) you have still funnelled $15,000 into the Chinese economy, and setup infrastructure and all in china to utilize going forward. \n\nNot to mention the ramp up cost, it will take years to get a new factory built, and all that money invested is going towards that county's economy rather than your own. \n\nChina's goal isn't just to make tons of EVs for the hell of it, it is to dominate the market while employing chinese citizens and developing chinese industry and infrastructure.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8b7atc/",
          "created": 1718218405,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8ad6wa",
      "score": 2,
      "body": "This means European car manufacturers will produce affordable EVs that can compete with Chinese EVs?",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8ad6wa/",
      "created": 1718208505,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l88pn2k",
      "score": 6,
      "body": "\"free markets\" for me but not for thee",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88pn2k/",
      "created": 1718180930,
      "depth": 0,
      "replies": [
        {
          "id": "l88rdck",
          "score": 32,
          "body": "Lmao, the chinese are crying that they won't have unfettered access to the EU market while locking down their own economy far more tightly than even these tariffs.\n\nGo away bot.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88rdck/",
          "created": 1718182218,
          "depth": 1,
          "replies": [
            {
              "id": "l88vjyu",
              "score": 10,
              "body": "And you forgot about the outrageous amount of government subsidies.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88vjyu/",
              "created": 1718185301,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l88wd6e",
              "score": -9,
              "body": ">unfettered access to the EU market\n\nLike Huawei?\n\n>locking down their own economy far more tightly\n\nhttps://en.wikipedia.org/wiki/Automotive_industry_in_China#Ending_joint_venture_restriction\n\nHow many European brands are there in China vs how many Chinese brands are there in Europe?",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88wd6e/",
              "created": 1718185841,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l88sr05",
          "score": 6,
          "body": "Since when was the EU about free markets.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88sr05/",
          "created": 1718183264,
          "depth": 1,
          "replies": [
            {
              "id": "l88wvsp",
              "score": 13,
              "body": "Free market is between the EU members. Last I checked China is not an EU member.",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88wvsp/",
              "created": 1718186170,
              "depth": 2,
              "replies": [
                {
                  "id": "l890c8n",
                  "score": 3,
                  "body": "Precisely.",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l890c8n/",
                  "created": 1718188433,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l899h1x",
          "score": -4,
          "body": "Free market sometimes turns out to be very expensive on other aspects.\n\nSupporting the Chinese regime would turn out to be very expensive, culturally speaking, for the democratic world.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l899h1x/",
          "created": 1718193401,
          "depth": 1,
          "replies": [
            {
              "id": "l8apnk7",
              "score": 2,
              "body": "the West has no qualms about supporting dictators in the Middle East and overthrowing other democracies though",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8apnk7/",
              "created": 1718212645,
              "depth": 2,
              "replies": [
                {
                  "id": "l8g2bwu",
                  "score": 1,
                  "body": "Because that doesn't endanger their own citizens ans businesses. But that's just natural, they want to defend themselves tho, nobody gives an honest fuck about Africa and the Middle East and don't see why you do either.\n\nMaybe you don't live in the West?",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8g2bwu/",
                  "created": 1718295777,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l89kjzf",
      "score": 2,
      "body": "Like someone cares about EVs in the west",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89kjzf/",
      "created": 1718198234,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l893tzf",
      "score": 1,
      "body": "The US has also increased tariffs as well. Canada may consider this too since they just recently announced EV partnership with Honda and WV to produce cars in Canada. It’s meant to keep jobs within NA.",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l893tzf/",
      "created": 1718190491,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l89peet",
      "score": 1,
      "body": "Maybe they could just compete with them…guess not.",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89peet/",
      "created": 1718200104,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l89x9i9",
      "score": 1,
      "body": "So basically cost more for consumers…",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89x9i9/",
      "created": 1718202949,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8avhl0",
      "score": 1,
      "body": "Short BMW and VW, the retaliation is gonna be biblical",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8avhl0/",
      "created": 1718214546,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ec0hj",
      "score": 1,
      "body": "Look, guys, I think the real question for many invested in Euro auto stocks (BMWYY, MBGYY etc) now is this; how bad will the Chinese retaliation be to all of this if the legislation goes ahead to be enacted? \n\nAfter the announcement yesterday, most of the EU states such as Italy were cheering this on, partly because of Giorgia Meloni’s stance towards communism and China and also because of the fact that Italian auto really doesn’t have much of a stake in the Chinese market, so Fiat doesn’t see much to lose in this case, but more to gain with their electric 500, Ducato and Doblo series, all made in Europe. \n\nHowever, what you notice is that German automakers and Chancellor Sholtz have been far less optimistic about what’s about to happen. The reason here is simple, in 2022, BMW group sold 820,000+ vehicles in China, in raw numbers, that’s the second largest market for BMW after their domestic market. For Mercedes Benz, that number came in at 737,000+ vehicles sold the same year, which in raw numbers is actually higher than what they sold in Germany that year. \n\nAlready, German auto makers in China have come under considerable market pressure because of Chinese domestic vehicle price points from BYD, SAIC, Xpeng to name a few. For example, it has been reported that for the new BMW i3, Chinese dealers were offering customers more than half price off retail if they paid in cash, offering the car at 120,000 to 180,000 RMB (US$16,547 to $24,821) to interested parties. \n\nSo already, BMW and German auto in China is already operating on less-than-ideal margins due to pressures within the Chinese market, and now with the EU attempting to deal a death blow to Chinese auto being sold in Europe, it is unlikely that China will take this blow lying down. China knows that at this point, Germany is their best lobbyist for their financial interest in Europe, because quite frankly, they have too much to lose from a retaliatory attack. And what German auto has to lose in China extends far beyond just car sales. No, for any foreign automaker to sell their cars in China, they have to enter joint venture partnership with a local Chinese company. In BMW’s case, this partner is Brilliance auto, and in Mercedes case, it is BAIC motor. What is at stake now is German auto losing a lot of manufacturing assets in the country if things hit the fan, given the Chinese government’s tendency to forcefully ‘requisition’ things belonging to foreign companies in times of political tension. \n\n\n\n\nSources: \n\nhttps://www.statista.com/statistics/267252/key-automobile-markets-of-bmw-group/#:~:text=Chinese%20customers%20bought%20almost%20826%2C300,up%20by%20motorists%20in%20Germany.&text=BMW%20sales%20in%20the%20United,overall%20greater%20than%20in%202020.\n\nhttps://www.reuters.com/business/autos-transportation/mercedes-benz-shows-off-electric-line-up-beijing-autoshow-not-giving-up-2024-04-25/#:~:text=Pointing%20to%20Mercedes's%20sales%20in,its%20%22most%20significant%20market%22.\n\nhttps://cnevpost.com/2023/03/09/bmw-dealers-offer-discounts-of-up-to-usd-14360-for-i3/",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8ec0hj/",
      "created": 1718267845,
      "depth": 0,
      "replies": [
        {
          "id": "l8ec0i6",
          "score": 1,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8ec0i6/",
          "created": 1718267845,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l88z1xe",
      "score": -6,
      "body": "The faster the EU and US decouple from China, the better. No reason why EVs made in North America or Europe can’t be competitive.",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l88z1xe/",
      "created": 1718187613,
      "depth": 0,
      "replies": [
        {
          "id": "l89ll4k",
          "score": 9,
          "body": "You do realize that your two statements here contradict themselves, right?",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89ll4k/",
          "created": 1718198639,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8apqef",
          "score": 2,
          "body": "> No reason why EVs made in North America or Europe can’t be competitive\n\nget back to us when Tesla reduces its pricing to 20k usd",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8apqef/",
          "created": 1718212671,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l898u62",
          "score": 4,
          "body": "Can someone explain why you’re being downvoted? I don’t have an opinion, I’m just trying to understand why people disagree with you.",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l898u62/",
          "created": 1718193096,
          "depth": 1,
          "replies": [
            {
              "id": "l8apydt",
              "score": 5,
              "body": "cause NA/EU EVs are overpriced 60k shit that gouge consumers\n\nand also exposes the hypocritical \"environmentalist\" bullshit of NA/EU governments who are now cutting off consumers' access to a viable, cleaner energy car they can actually afford",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8apydt/",
              "created": 1718212743,
              "depth": 2,
              "replies": [
                {
                  "id": "l8b9ifa",
                  "score": 1,
                  "body": "[deleted]",
                  "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8b9ifa/",
                  "created": 1718219135,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8bhjog",
                      "score": 1,
                      "body": "though their EVs are still uncompetitive with domestic ICE vehicles, so that's why they might try to ban existing ICEs as well, though that will probably trigger a riot they can't handle",
                      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8bhjog/",
                      "created": 1718221796,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l8995xd",
              "score": 1,
              "body": "They’re probably China bots that hate America. 🇺🇸",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8995xd/",
              "created": 1718193254,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l89cbzy",
              "score": -5,
              "body": "Chinese/russian/iranian bots",
              "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89cbzy/",
              "created": 1718194749,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l89l8u0",
      "score": 1,
      "body": "Tesla bagholders breathing a sigh of relief.",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89l8u0/",
      "created": 1718198506,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l89unrh",
      "score": 1,
      "body": "Racist/xenophobic Westerners being bigots again. Europe’s auto industry is geared toward high-end offerings and China’s EVs offer a great low-cost alternative. \n\nPeople need to get over this fear of China. It isn’t some monster, and there’s no need why you have to compete against them. Trade freely, work together, reduce the chance of war in the future.",
      "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l89unrh/",
      "created": 1718202029,
      "depth": 0,
      "replies": [
        {
          "id": "l8a5a9j",
          "score": 1,
          "body": "trade freely**",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8a5a9j/",
          "created": 1718205716,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8aqddc",
          "score": 1,
          "body": "at the very least, everyone has something to tell the Westeners to shut up with every time they try to act sanctimonious at an international climate meeting",
          "permalink": "/r/wallstreetbets/comments/1de07al/eu_to_impose_multibillioneuro_tariffs_on_chinese/l8aqddc/",
          "created": 1718212876,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}