{
  "title": "Federal funds rate target range maintained at 5.25% to 5.5%.",
  "score": 97,
  "selftext": "[removed]",
  "link_flair_text": "potentially misleading / AI made stuff up",
  "id": "1ded55u",
  "num_comments": 30,
  "created_utc": 1718215382,
  "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/",
  "comments": [
    {
      "id": "l8bpwka",
      "score": 1,
      "body": "You asked AI to summarize 4 paragraphs, 300 words?  And the AI gave you back 137 words, reduction of 54%... [everyone might as well read the original.](https://www.federalreserve.gov/newsevents/pressreleases/monetary20240612a.htm)\n\nAlso they're not concerned with inflation, AI made that up!  They said they're \"highly attentive to inflation risks\".  On top of that, they only said good things about inflation if you read it.",
      "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8bpwka/",
      "created": 1718224561,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ayav0",
      "score": 93,
      "body": "Only forecasting 1 cut this year instead of 2. Market seems just with with that.\n\nEdit: Fine. Just fine with that. :)",
      "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8ayav0/",
      "created": 1718215460,
      "depth": 0,
      "replies": [
        {
          "id": "l8b93r2",
          "score": 22,
          "body": "> Market seems just with with that.\n\nI know this is a typo and I’m not trying to be mean at all, I just think it’s incredibly appropriate how it sounds like you’re saying “market could be going up or it could be going down” so business as usual :P",
          "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8b93r2/",
          "created": 1718218999,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8bahzp",
          "score": 7,
          "body": "I'm also just with that.",
          "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8bahzp/",
          "created": 1718219464,
          "depth": 1,
          "replies": [
            {
              "id": "l8be9ou",
              "score": 2,
              "body": "lol, thanks. Fixed.",
              "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8be9ou/",
              "created": 1718220714,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8b3yg3",
          "score": -5,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8b3yg3/",
          "created": 1718217311,
          "depth": 1,
          "replies": [
            {
              "id": "l8b47dx",
              "score": 1,
              "body": "https://finance.yahoo.com/news/federal-reserve-holds-interest-rates-steady-lowers-forecast-to-1-rate-cut-in-2024-180617337.html\n\n> Federal Reserve holds interest rates steady, lowers forecast to 1 rate cut in 2024\n\nhttps://www.cnbc.com/2024/06/12/fed-meeting-today-on-interest-rate.html\n\n> The Federal Reserve on Wednesday kept its key interest rate unchanged and signaled that just one cut is expected before the end of the year.",
              "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8b47dx/",
              "created": 1718217392,
              "depth": 2,
              "replies": [
                {
                  "id": "l8b4lpe",
                  "score": -2,
                  "body": "https://www.federalreserve.gov/monetarypolicy/files/fomcprojtabl20240612.pdf\n\nshows 8 members expecting 2 cuts, 7 members expecting 1 cut and 4 members expecting no cuts. So I guess the average is 1 cut, but 2 cuts might still be on the table",
                  "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8b4lpe/",
                  "created": 1718217523,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8b93q3",
                      "score": 1,
                      "body": "New math, 8 expecting 2 cuts is more than 11 expecting 1 cut or less.",
                      "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8b93q3/",
                      "created": 1718218998,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8b12ff",
      "score": 47,
      "body": "2 rate cuts seemed rather optimistic to begin with.",
      "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8b12ff/",
      "created": 1718216365,
      "depth": 0,
      "replies": [
        {
          "id": "l8b6q2m",
          "score": 31,
          "body": "I still think 1 is optimistic. I don't see them doing any cuts unless inflation gets down very close to 2% and it's barely budged for several months now.",
          "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8b6q2m/",
          "created": 1718218218,
          "depth": 1,
          "replies": [
            {
              "id": "l8bg1gm",
              "score": 15,
              "body": "They have literally said that if you wait to cut rates when you hit the 2% target then you would be too late. \n\nI think that some people have the '2% target' in their head as '2% maximum'.",
              "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8bg1gm/",
              "created": 1718221304,
              "depth": 2,
              "replies": [
                {
                  "id": "l8bpu31",
                  "score": 3,
                  "body": "rates is not that restrictive. Fed's already writing down neutral rate of around 3.5% for a 2% inflation. So if core PCE inflation is almost 3% right now, neutral rate should be 4.5%. So at 5.5%, the Fed is BARELY restrictive. No surprise the labor market is so strong. And as we saw in Dec 2023, if Powell just utter the word \"rate cut\", the market will ease like never before, so they better be damn sure they're very close to target before they even cut, cause that's a point of no return.",
                  "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8bpu31/",
                  "created": 1718224537,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8bhnsx",
              "score": 1,
              "body": "They’re doing the whole “promise a rate cut so the market doesn’t overreact but when the time comes we all say that the data doesn’t support any cuts” play.   \n\nThey should’ve never promised any cuts, even heading back to last December.  \n\nThey should’ve just said “we will follow the data” and nothing else.",
              "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8bhnsx/",
              "created": 1718221834,
              "depth": 2,
              "replies": [
                {
                  "id": "l8bi9qj",
                  "score": 3,
                  "body": "they dont promisse anything, they do forecast but they definitely say \"we will follow the data” every time. forecasts proved useless every time, not sure why everybody is so attached to them.",
                  "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8bi9qj/",
                  "created": 1718222035,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8bkmrq",
                      "score": 0,
                      "body": "All forecasts are wrong, but some are occasionally useful.",
                      "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8bkmrq/",
                      "created": 1718222814,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l8bpwu4",
          "score": 1,
          "body": "Ppl were hoping for 3 at the beginning of the year",
          "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8bpwu4/",
          "created": 1718224563,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8b7oyg",
      "score": 29,
      "body": "I think time is running out for them to cut before the election. So the cut will likely be at the very end of the year. \n\nPeople have their opinions but I believe the Fed is truly non-political. Their biggest thing is they don’t want any perception of them being seen as political. Imagine if they cut rates in September, all the republicans are going to say Powell is in bed with the democrats.  Conversely, if the Fed raised rates all the democrats would say the Fed is making Biden look bad. So the best course is the keep everything the same til the election is over. (Unless inflation randomly skyrockets for two prints or plummets for two prints)",
      "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8b7oyg/",
      "created": 1718218534,
      "depth": 0,
      "replies": [
        {
          "id": "l8bqd0m",
          "score": 1,
          "body": "yeah apparently to get 2.6% core PCE YoY in 2024, core PCE MoM has to come in at 0.16% every month for the rest of the year. We basically have the case where if inflation comes in \"good\", core PCE is annualizing to 2-2.5% (so barely in target), and if it comes in bad, it annualizes to 3.5-4.5%. Still seems like way too much inflation risk.",
          "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8bqd0m/",
          "created": 1718224712,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8bidkz",
      "score": 2,
      "body": "I don't know if this is the place to ask it but here goes: Does the Fed see a miss of the 2% target to be equal if it is above or below and does the Fed use an additive miss or a multiplicative miss to judge this?\n\n2nd question extrapolation: Does missing the 2% rate by 1 point (so 3% inflation) mean: we are off by 1 point (an additive metric) or are we experiencing 33% more inflation than we should be (a multiplicative metric)?\n\n1st question extrapolation: If the metric is additive then is 3% just as bad as 1%? If the multiplicative metric is 4% just s bad as 2%?\n\nOr, converse to all of the above, there is a more complex accounting that tries to determine the effect of inflation (excessive or lack there of) on the economy. \n\nIf to high and too low are both equally bad and the metric is additive then 5% inflation is just as bad as 1% deflation. I think that 1% deflation is basically guaranteed recession time. But if the metric is multiplicative then .2% inflation is just as bad as 20% inflation, probably also incorrect.",
      "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8bidkz/",
      "created": 1718222069,
      "depth": 0,
      "replies": [
        {
          "id": "l8bqmka",
          "score": 2,
          "body": "Fed Kashkari used multiplicative miss before when core PCE was 4%, he said it was almost like they're missing their target by 100%. Furthermore, he said that when asked low income groups, the group that fares the worst in recession, they said they'd rather have recession than high inflation because at least if they get laid off, they can ask their family for help, while high inflation affects all of their support sources.",
          "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8bqmka/",
          "created": 1718224800,
          "depth": 1,
          "replies": [
            {
              "id": "l8buk6j",
              "score": 1,
              "body": "Multiplicative makes fundamentally more sense than additive to me but then super low inflation looks really bad. But I guess that super low inflation is really uncommon over a long term. \n\n>they'd (very low income people) rather have recession than high inflation because at least if they get laid off, they can ask their family for help, while high inflation affects all of their support sources.\n\nI don't know if this is an intentional 'voters are dumb sometimes, don't take all things they say at full truth' kinda thing. The fantasy that higher unemployment rates would not 'affect all of their support sources' is just plain stupidity. If there is a recession and high unemployment then more people than just you are getting laid off.",
              "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8buk6j/",
              "created": 1718226109,
              "depth": 2,
              "replies": [
                {
                  "id": "l8bw29n",
                  "score": 1,
                  "body": "you're not gonna get deflation unless if you come across 2008 level recession, which is one of the worst. There're big inflation components that won't deflate even in recession, keeping it positive, things tied to your wages for example.\n\nUnemployment only rises by 2-5% during a recession. That's still a very small fraction of the population. Inflation affects everyone. It's not guaranteed all your friends will get fired in a recession. You can also save rainy day money to prep for recession. You can't work more than 2 jobs during high inflation. So one scenario is really bad but at least there're ways to mitigate it. The other there's really nothing you can do, and for lower income there aren't a lot of discretionary expenses they can cut.",
                  "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8bw29n/",
                  "created": 1718226625,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8c07nt",
                      "score": 1,
                      "body": "First, I don't think that one necessarily needs to be unemployed to feel financial stress during a recession. Decreased hours, decreased promotions, decreased bonuses, etc. all play into it. If there is a recession and 10% of the workforce gets laid off then the other 90% isn't just totally unaffected. \n\nSecond, during the recent bout of inflation wages also grew at similar, over longer time periods, rates. Wage growth in the US is in the 4%. The idea that 'there was inflation and now I need a second job' when you didn't have a second job before is just not really realistic from a math standpoint.",
                      "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8c07nt/",
                      "created": 1718228081,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8caba3",
                          "score": 1,
                          "body": "none of that is guaranteed to affect you. Inflation is. You don't need a promotion when inflation is 0. Actually, having no promotion is definitely better than having a promotion that doesn't keep up with inflation. Go look below and see wages always went up during recessions, even when we had 2009 deflation. \n\n[https://fred.stlouisfed.org/series/AHETPI](https://fred.stlouisfed.org/series/AHETPI)\n\n\n\nWages hasn't really kept up with inflation since pre-COVID. Furthermore, most of the wage gains came from the lower class, and the middle class lacked the most in wage gains.",
                          "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8caba3/",
                          "created": 1718231823,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8b4822",
      "score": 2,
      "body": "Another nothing burger it’s the same shit over and over",
      "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8b4822/",
      "created": 1718217399,
      "depth": 0,
      "replies": [
        {
          "id": "l8b6ovd",
          "score": 7,
          "body": "We got more concrete evidence that we're getting closer to a rate cut *and* solid guidance at how many rate cuts to expect.\n\nThat's pretty substantial info.",
          "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8b6ovd/",
          "created": 1718218207,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8bkzg9",
          "score": 0,
          "body": "yeah, inflation ain't changing so the Fed ain't changing",
          "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8bkzg9/",
          "created": 1718222929,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8b6xb1",
      "score": 1,
      "body": "EE CONTINUED TO BUY ZE DEEP",
      "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8b6xb1/",
      "created": 1718218282,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8b94qy",
      "score": 0,
      "body": "I'm starting to think that Andy Constan on X may have a point to be honest, just may need to add Apple to Nvidia. \n\n\nOnly thing standing in the way of another decent dip on the S&P at the very least is the Nasdaq being positively insane, if you somehow get rid of that, that dip will occur because higher for longer won't allow for rotation to occur.",
      "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8b94qy/",
      "created": 1718219008,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8blohs",
      "score": -1,
      "body": "Raise rates to get to 2%",
      "permalink": "/r/stocks/comments/1ded55u/federal_funds_rate_target_range_maintained_at_525/l8blohs/",
      "created": 1718223159,
      "depth": 0,
      "replies": []
    }
  ]
}