{
  "title": "At what point financially would you swap growth stocks for dividends?",
  "score": 39,
  "selftext": "If I put around 10k in schd it would be around 114 a month (if I did my math right). That seems really good but I’m not sure if that’s enough to be putting it in say qqq for a few years. My original idea was every month put money in qqq and at some high number in the future dump in a dividend paying etf but now I’m not sure if the dividend payout sooner would be better. Long story short at what amount does dividend best growth if ever?",
  "link_flair_text": "Advice Request",
  "id": "1depohk",
  "num_comments": 54,
  "created_utc": 1718250129,
  "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/",
  "comments": [
    {
      "id": "l8dprgn",
      "score": 192,
      "body": "Narrator: “he did not, In fact, do his math right”\n\nSCHD has a dividend yield around 3.5%. That’s $350 a year or $29 a month in dividends.",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8dprgn/",
      "created": 1718253344,
      "depth": 0,
      "replies": [
        {
          "id": "l8f08v0",
          "score": 12,
          "body": "Thanks for this I thought it was way too high😂",
          "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8f08v0/",
          "created": 1718281962,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8dln7t",
      "score": 107,
      "body": "Never. Total return is what matters. Look at SCHD total return vs SPY total return (both with dividends reinvested) and you’ll see.\n\nThere’s no use in chasing a dividend specifically,",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8dln7t/",
      "created": 1718251203,
      "depth": 0,
      "replies": [
        {
          "id": "l8dr9xs",
          "score": 20,
          "body": "Exactly. If you need funds, sell a small portion of the portfolio. It feels less satisfying than a dividend, but is better in terms of taxation and in terms of total returns.",
          "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8dr9xs/",
          "created": 1718254170,
          "depth": 1,
          "replies": [
            {
              "id": "l8dv4tm",
              "score": 9,
              "body": "Depending where you live, I live somewhere where the first X amount of divs is tax free so a small allocation once you've made it wouldn't be bad to get more monthly income",
              "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8dv4tm/",
              "created": 1718256391,
              "depth": 2,
              "replies": [
                {
                  "id": "l8dyz74",
                  "score": 7,
                  "body": "Oh that’s awesome, didn’t know some places were like that.",
                  "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8dyz74/",
                  "created": 1718258764,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8e197n",
                  "score": 3,
                  "body": "Is this really specifically for dividends? We have the same in Germany but it applies to all capital gains which includes gains from stock sales.",
                  "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8e197n/",
                  "created": 1718260242,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8e4bww",
                      "score": 5,
                      "body": "Yes we have different rules for capital gains, but this one I refer to is the first 50k of divs is tax free",
                      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8e4bww/",
                      "created": 1718262305,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l8f7ftg",
              "score": 1,
              "body": "> It feels less satisfying than a dividend \n\n\n Speak for yourself. To me it feels way more satisfying than a dividend once I found out that total return is all that matters.\n\n\nI can't understand all the dividend investors who have their priorities backwards ",
              "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8f7ftg/",
              "created": 1718284983,
              "depth": 2,
              "replies": [
                {
                  "id": "l8j05y2",
                  "score": 1,
                  "body": "Yes you’re right objectively, but something in our lizard brain just treats dividends like free money. My $250 payout from VOO every few months feels way better than those days where I make 10x that.",
                  "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8j05y2/",
                  "created": 1718334750,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8kvk5u",
          "score": 1,
          "body": "Worth $12M age 51 here, you are missing volatility. Yes, VOO gives better total return over long haul, but you can also have sustained 20-30% down periods. Dividends ETFs are less volatile (more boring) \n\nIf you need to access the capital then, you’ve lost your total return. You need to balance your allocation against your near, medium, and long term need to access capital taking into account volatility, unless your want to use more exotic instruments like asset lines for capital needs",
          "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8kvk5u/",
          "created": 1718372809,
          "depth": 1,
          "replies": [
            {
              "id": "l8m739l",
              "score": 2,
              "body": "SCHD is not less volatile than the S&P, it’s significantly more because it’s only high paying div stocks and is concentrated to 50 ish companies.",
              "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8m739l/",
              "created": 1718389103,
              "depth": 2,
              "replies": [
                {
                  "id": "l8n78cs",
                  "score": 0,
                  "body": "It’s less volatile because the companies it holds are not growth companies, they are boring stable dividend payers—chevron, Verizon etc.",
                  "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8n78cs/",
                  "created": 1718401718,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8ng37z",
                      "score": 3,
                      "body": "No. You’re saying this but this is not an opinion. It is measured. The volatility of SCHD is higher than the S&P. Again that’s because it’s more concentrated with only 50 stocks and generally if you’re seeking high dividends primarily (without additional filters for example for debt load and earnings growth) you’re going to end up with no growth, weaker companies.\n\n“The current volatility for SPDR S&P 500 ETF (SPY) is 2.54%, while Schwab US Dividend Equity ETF (SCHD) has a volatility of 3.26%. This indicates that SPY experiences smaller price fluctuations and is considered to be less risky than SCHD based on this measure. The chart below showcases a comparison of their rolling one-month volatility”\n\nhttps://portfolioslab.com/tools/stock-comparison/SPY/SCHD#",
                      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8ng37z/",
                      "created": 1718405308,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8nk38d",
                          "score": 0,
                          "body": "Good answer— should have chosen my language better, more about drawdown—the max drawdown on SCHD is 33% vs 55% with SPY",
                          "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8nk38d/",
                          "created": 1718407000,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l8e6tls",
          "score": -4,
          "body": "This is a pretty silly way of thinking about things.\n\nHistorical performance aside, future expected outperformance of growth stocks is a function of beta. You can get as much beta as you want with a levered portfolio of just about any asset.\n\nThe game isn’t about finding the thing with the highest expected nominal unlevered return.",
          "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8e6tls/",
          "created": 1718264056,
          "depth": 1,
          "replies": [
            {
              "id": "l8exhcx",
              "score": 8,
              "body": "I’m not sure what sort of nonsense I just read. \n\nSCHD and almost all dividend focused ETFs historically underperform the market and are less tax efficient. With the S&P or a total market you still get dividends but you get everything else too. The beta of the S&P is 1, it’s the literal baseline, so no, buying the S&P isn’t chasing beta. And if you only bought growth stocks (just like only small caps or only dividend stocks) you’d have massive sequence of returns risk during sectoral shifts. \n\nIf “the game” isn’t about total return, what is it about?",
              "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8exhcx/",
              "created": 1718280695,
              "depth": 2,
              "replies": [
                {
                  "id": "l8fxpm8",
                  "score": 5,
                  "body": "You’re missing the point.\n \nOf course over a long period a dividend focused fund that invests in relatively fewer growth stocks underperforms the broader market on a $1 to $1 basis. But the reason it does so is because it has a lower level of risk for each $1 invested.\n\nQQQ outperforms the S&P on a $1 to $1 basis historically and on an expected basis, so is it strictly superior to the S&P 500? Of course not. It outperforms because it has a higher level of dollar weighted risk.\n\nYou get to decide how much beta you want in a portfolio, and you can do so by combining levered assets of basically any type you want. There are definitely micro and macro reasons why in certain market conditions you’d expect SCHD to outperform a broad market fund on a risk weighted basis, and even if the expectation is that it would underperform on a dollar weighted basis, portfolios can be delevered and levered to the heart’s content. \n\nNone of this is about SCHD, though. The comment was about the silliness of picking between diversified funds based on historical or expected performance on a dollar weighted basis, when the delta between the performance of those funds is mostly a function of how much market risk those funds are bearing at any given moment.\n\nIndividual investors aren’t limited to picking how much market risk they want to bear based on what the underlying funds are bearing.\n\nThe choice isn’t between $1 of growth stocks and $1 of SCHD. It can be between $1 of growth stocks and $1.4 dollars of levered SCHD (or whatever the appropriate ratio is to get to an equivalent degree of risk), and there are plenty of good reasons (even if circumstance limited and not applicable in all weather) where an investor would consider that appropriate.\n\nTreasuries obviously have a lower expected return than the S&P 500. Why do they still get inflows? How can a competitive market bear this sort of divergence in expected return if the thing we care about is unlevered expected returns on $1 invested? It’s because that isn’t the relevant metric we care about. It’s not about finding the thing with the highest expected return. It’s about risk-weighted return, because any asset or combination of assets can then be levered up to whatever level of risk the investor wants.",
                  "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8fxpm8/",
                  "created": 1718294232,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8fztu7",
                      "score": 2,
                      "body": "“But the reason it does so…”\n\nYou’re missing my point. OP is both NOT de-risking, is NOT going to outperform the S&P500.\n\nSCHD, the subject of the post, is a concentrated fund that has higher volatility than the overall index and underperforms it. Anything that invests in a concentrated group of high dividend stocks is investing in higher risk companies with low growth prospects.\n\nI think you’re overthinking this. The goal of investing is to get the best total return while balancing your risk. Buying a fund that only invests in a few dozen high dividend payers does neither.",
                      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8fztu7/",
                      "created": 1718294938,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l8on2x1",
          "score": 0,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8on2x1/",
          "created": 1718425238,
          "depth": 1,
          "replies": [
            {
              "id": "l8pwpjj",
              "score": 2,
              "body": "I’m not anti-dividend. But there’s no reason to chase them specifically as the goal is total return. I’m also a bit anti-SCHD specifically as I think there are better dividend funds. SCHD underperforms the S&P pretty badly. \n\nI mean in just the past 5 years to OP’s “where to put 10k question” in SCHD total return would have him with $14,566 and the S&P would be $18,800. Now do a decade, or two, or three…. OUCH",
              "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8pwpjj/",
              "created": 1718456182,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8e9u69",
          "score": -3,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8e9u69/",
          "created": 1718266244,
          "depth": 1,
          "replies": [
            {
              "id": "l8evvpu",
              "score": 2,
              "body": "Of course. But NVDA is a 20/20 hindsight thing. It’s pretty well documented that active stock pickers rarely beat the S&P, and at the very least there’s little use in buying other ETFs/indexes such as SCHD.\n\nI’m not knocking stock picking at all. I’ve owned NVDA and a few mag 7 stocks for almost a decade. Their outperformance helped juice total returns. But I mostly pick stocks because it’s fun and an attempt to take on most risk to get more return.",
              "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8evvpu/",
              "created": 1718279924,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8dmglu",
      "score": 18,
      "body": "If you don’t need the income why would you sacrifice the upside ? Just to be different ?",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8dmglu/",
      "created": 1718251611,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8fvpsn",
      "score": 6,
      "body": "Never. I own both for long term. Build a growth portfolio and a dividend portfolio so you are well diversified and do well in any market",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8fvpsn/",
      "created": 1718293579,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8dlepb",
      "score": 20,
      "body": "SCHD doesn't even match the performance of VTI. Let alone VOO.",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8dlepb/",
      "created": 1718251085,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8e0l9r",
      "score": 6,
      "body": "When I’m close to retirement",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8e0l9r/",
      "created": 1718259805,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ehm7m",
      "score": 9,
      "body": "Too many people elevating the importance of dividends too much/chasing yield. Also, why does it have to be one or the other? You can have some high quality dividend stocks (where you buy them because they are good companies that happen to have a dividend, not simply because the yield is high) and aggressive growth stocks in the same portfolio. Feels like everyone seems to think that they have to be one or the other entirely.",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8ehm7m/",
      "created": 1718271637,
      "depth": 0,
      "replies": [
        {
          "id": "l8gj8o4",
          "score": 1,
          "body": "If one does have more funds to just invest in anything one wants, yes Dividends and Growth together exist in the same place. To want dividends to be paid out is like to have income for expenses. Depending on the places one lives, the dividends can pay out all the expenses, but if not, then it is not as efficient as funding in Growth rather than Dividends.",
          "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8gj8o4/",
          "created": 1718301363,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8dqi2e",
      "score": 3,
      "body": "I pick companies that make good FCF for investors. Whether it pays a dividend or not doesn't matter, as long as it generates cash for me.",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8dqi2e/",
      "created": 1718253747,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8fne1v",
      "score": 2,
      "body": "74 % of your total returns over the course of a lifetime, will come from dividends…\n\nSo, there is no set transitioning from growth to dividends..\n\nUnderstand your trading / investing personality & act accordingly.",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8fne1v/",
      "created": 1718290785,
      "depth": 0,
      "replies": [
        {
          "id": "l8fuq2l",
          "score": 1,
          "body": "So do you think it’s better to invest in high dividend paying etf on a continual basis as opposed to growth when your young?",
          "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8fuq2l/",
          "created": 1718293251,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8j4o1s",
          "score": 1,
          "body": "100% comes from free cash flow ;)",
          "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8j4o1s/",
          "created": 1718336917,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8dlj4s",
      "score": 3,
      "body": "That depends on your time horizon. If you're 20, put 10% or less toward SCHD (or an equivalent). If your 60, out 90% or more in SCHD (or an equivalent)",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8dlj4s/",
      "created": 1718251147,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8eyw2j",
      "score": 2,
      "body": "I've inherited 130k from my dad. Immediately Im gonna take 30k and buy SCHD in IRA with it. \n\nThe rest ill give thought, maybe buy a tbill while I mull it over. \n\nI want to preserve the 30k in something he would like to see me investing in. \n\nIll probably VOO the rest, like 80% and do some fun investments, some IBIT, few individual stocks. The SCHD will be interesting to watch over 20 years as far as growth and dividend reinvestment.",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8eyw2j/",
      "created": 1718281347,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8dwppb",
      "score": 1,
      "body": "Where I am It's 33% on gains (with a small annual tax credit) and 52% on Dividends or rent (it's just added to your other incomes such as employment)",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8dwppb/",
      "created": 1718257354,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8eo153",
      "score": 1,
      "body": "Both ETFs carry stocks that flourish in different economic environments. They're not exactly yin and yang... You'd need AVUV instead of SCHD to be exact opposites... But close enough. \n\nGrowth stocks will do better than value in recessions. Value will do better than growth when discount rates rise. \n\nDo with that what you will.",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8eo153/",
      "created": 1718275796,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8f6z88",
      "score": 1,
      "body": "When I'm 90 years old",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8f6z88/",
      "created": 1718284798,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8f7t8w",
      "score": 1,
      "body": "Dividend stocks and bonds are for post retirement, in my opinion.",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8f7t8w/",
      "created": 1718285130,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8fkm9b",
      "score": 1,
      "body": "When my income drops substantially, I would be more comfortable owning higher dividend stocks. Right now I lean heavily towards growth stocks. \n\nDividends are nice to have in retirement because it’s basically cash flow. But it’s essentially forcing you to take taxable income that you might not need.",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8fkm9b/",
      "created": 1718289837,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8fuoua",
      "score": 1,
      "body": "In a retirement scenario none of these answers are very good to be honest if you're Canadian. Taking 55,000 in Eligible dividends annually in Canada is a sweet spot currently. At $55,000 of eligible dividends, you pay zero tax, at $55,000 in capital gains you would pay up to 6.5% in tax, province pending. Baring all other income sources are zero of course.\n\nNow you need to determine what rate of return you sacrificed by investing into dividend stocks to yield that 55K and take into consideration the realized tax difference if you were to compare taking that 55K in dividend income vs 55K in realized capital gains.\n\nI am almost personally always a pro VUN, VOO person but that's because I have other flows of income that my income is never going to be around that 55K mark. It will always be above and once you start to stray from it, the pendulum swings back and tax burden becomes very similar to if you realized taxable capital gains.\n\nYou can't just blanket say xyz is better, you need to put effort into calculating your individual scenario.",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8fuoua/",
      "created": 1718293239,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8glr0d",
      "score": 1,
      "body": "A monthly contribution from 2022 to 2024 to VTI is up by 23%. A one time contribution in 2022, and just hold for 2 years of SCHD is up by 5.47%, added the 3.5% annual dividend yield. that's about 13% up. There is a 10% difference even though the VTI contribution is monthly. A one time contribution to VTI 2 years ago, will be up by 26%. So Growth is definitely worth more than dividend in the long term.",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8glr0d/",
      "created": 1718302198,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8hjndn",
      "score": 1,
      "body": "Not a bad idea to have growth and those dividend checks.",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8hjndn/",
      "created": 1718313530,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8hlj7r",
      "score": 1,
      "body": "It wouldn’t be 114 a month, more like 32 a month. 10k invested at 3.83% yield is $383 annual dividends. Divided by 12 months is like 32.",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8hlj7r/",
      "created": 1718314191,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8idy1j",
      "score": 1,
      "body": "If you use your dividend then yes",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8idy1j/",
      "created": 1718325249,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ipp6y",
      "score": 1,
      "body": "Id prob buy treasuries before I ever did that",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8ipp6y/",
      "created": 1718330178,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8qpjml",
      "score": 1,
      "body": "1-2% above the equities market rate of return.",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8qpjml/",
      "created": 1718469316,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8f2w73",
      "score": 1,
      "body": "I think I would want to be closer to retirement and have about $10 or $15 million USD on hand. That would be an annual income of 3~4 hundred thousand, while making it so that you didn't need to withdraw any of the principal. Not having to withdraw principal, I see as the main purpose of a dividend portfolio.",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8f2w73/",
      "created": 1718283113,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8fhxqc",
      "score": 1,
      "body": "Dividends are just forced sales. On ex div date share price drops by amount of div. \n\nNo reason one is better early on vs retirement. That’s a myth. ",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8fhxqc/",
      "created": 1718288902,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8e71l1",
      "score": 1,
      "body": "Umm first thing to do before thinking of dividend investing is to understand why a dividend yield means mathematically.",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8e71l1/",
      "created": 1718264218,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8fekps",
      "score": 1,
      "body": "Dividends don't matter, earnings do. Paying the earnings as dividends or spending it on buybacks or reinvesting it, that's all just shuffling money from one pocket to another. The important part is earning the money to begin with.",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8fekps/",
      "created": 1718287701,
      "depth": 0,
      "replies": [
        {
          "id": "l8ferok",
          "score": 1,
          "body": "Do you mean like me making money or the company?",
          "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8ferok/",
          "created": 1718287771,
          "depth": 1,
          "replies": [
            {
              "id": "l8fxlro",
              "score": 1,
              "body": "As a stockholder, company earnings are your earnings, the only question is in what manner do you prefer to cash out. If a company pays out a dividend, the company value, the stock value immediately drops by the amount of that payment, because of course it does, the money was removed from the company. In terms of value, a dividend is basically equivalent to you simply selling some of your stock. Cashing out is cashing out, one way or another.",
              "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8fxlro/",
              "created": 1718294197,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8g6xnp",
      "score": 1,
      "body": "I use covered call ETFs for monthly cash flow in my retirement. I put enough in QYLD/JEPI to cover my recurring expenses with some wiggle room.\n\nBasically current lifestyle is on autopay from dividends and any bonus fun stuff gets paid for out of growth portfolio. \n\nHighest possible returns, no, but damn it's good low stress passive income",
      "permalink": "/r/stocks/comments/1depohk/at_what_point_financially_would_you_swap_growth/l8g6xnp/",
      "created": 1718297301,
      "depth": 0,
      "replies": []
    }
  ]
}