{
  "title": "DNUT YOLO DD INSIDE UPDATE",
  "score": 70,
  "selftext": "Hello regards. Im here again. And I still have a massive raging DD for a big juicy DNUT. I've increased my shares to 3000+ and still have my calls. But that's not why I'm here.\n\nIm here because I saw a couple small negative things toward DNUT cycling around this shitscape. And like a white knighted cuck to his onlyfans gf, I came swinging in to the rescue. So now I feel like I need to share and defuse these regarded ass steamy fud piles and remind everyone of why Im balls deep in DNUT\n\nFirst off, to the blasphemous cunt who thought because he had a bad DNUT at a GAS STATION gave him the right to say \"DNUT bad DNUT quality bad, no buy\", then ya know what, good for you, you're exactly where you belong you ape. You'll watch this shit launch up, and everyday it goes up, you'll wonder \"Gee golly fuck maybe I should have bought\". You'll wonder about it for days as you start itching to buy. Maybe you'll even see your girlfriends been dm'ing other dudes. By then you'll finally buy at 15$. Then it'll go down 4% and you'll sell it. Then it'll go back up. This cycle will repeat and eventually you'll push your girl right out of your little tiny wet paper hands. So save yourself the pain. Accept that we both know even a day old box of Krispy Kreme taunts most our fat asses from across the pastry section at a gas station.\n\nThis leads to my next point\n\nOzempic. Are you fuckin kidding me? To anyone who fell victim to this bullshit fud and sold into the market makers, I'm sorry your regarded ass got burnt. But once we actually sit there, and let our monkey brains fire a couple neurons, we come to realize, we're in America. The fattest fucking country in the world. You really think this dumb ass skinny queen fad will last? Yeah. Exactly. And hey you, YEAH YOU WITH THE OZEMPIC IN YOUR FUCKING HAND, listen up you lost ass cunt. Put the Ozempic down. Those donuts on the shelf have your fucking number and you know you'll always go back for a nice, hot, melty, airy, glazed DNUT. So put the pen down pardner'. Don't shoot. And to the fellas in the far back with your propeller caps on, ya know, the ones with puts or shorts open, stop letting yourself get glazed from your girlfriends boyfriend. Show her your worth something and get her back. Long DNUT (Not financial advice, Relationship advice).\n\nOh and to the guy in the original post who said \"Ha yeah, the next day we'll be like, where'd DNUT guy go?\". I'm right here, 12K up, you sly cunt. Tell your mom hi.\n\nFud stomped. Now to those who don't know the original post. Here's a quicky.\n\n570 Calls Exp 6/21-8/16, 2400 Shares (increased to 3000, DCA'ing constantly)\n\nPast 1-2 weeks DNUT raised from hold to buy at many firms (JP Morgan, Truist, etc,) Firms also increasing positions and price targets.\n\nDNUT earnings report showed a 10% revenue surprise Q1 in US sales and a 30% surprise in international sales. \n\nKrispy Kreme added nearly 500 access points in Q1 bringing it to 13,000 access points globally. McDonald's successful initial launch of 200 locations selling Krispy Kreme led to the official launch of this partnership which will nearly DOUBLE the amount of current access points. This will add an additional 300-500M in annual revenue (20-30% bump). Krispy Kreme has raised its goal of 75,000 access points to 100,000. \n\nRevenue has been a straight line up since 2010. Going from 300M in 2010 to 1.7B now. The IPO launched at 17$ in 2021, revenue for the year of 2020 was 1.1 Billion. The IPO valued the company at about 2.7 billion. Which was 2.25x~ annual revenue.\n\nIf the IPO launched today with the same ratio DNUT would be 39$. \n\nMany technical indicators showing a clear bullish edge. Very likely 13.52-15.68 is quickly reached. \n\nYou're telling me we belong at the bottom of this stocks price range right now? After all this growth?\n\nDNUT $50.\n\nEnjoy the morning you filthy animals.",
  "link_flair_text": "YOLO",
  "id": "1devidh",
  "num_comments": 29,
  "created_utc": 1718273562,
  "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/",
  "url_overridden_by_dest": "https://i.redd.it/pokjf2qhdb6d1.jpeg",
  "comments": [
    {
      "id": "l8ekgco",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 5 | **First Seen In WSB** | 6 years ago\n**Total Comments** | 40 | **Previous Best DD** | \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/l8ekgco/",
      "created": 1718273566,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ep9h3",
      "score": 22,
      "body": "Bought DNUT shares early last week and I'm already up double digit percentages. The bottom was obvious to anyone paying attention. A broker upgrade also helped give a boost to the shares recently, and it still has more room to run. Happy to hold until $14 then I'll re-evaluate.",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/l8ep9h3/",
      "created": 1718276510,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8enalz",
      "score": 9,
      "body": "I m in from the last DD dude.",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/l8enalz/",
      "created": 1718275356,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8encws",
      "score": 9,
      "body": "I feel triggered due to the ozempic comment.. gonna go eat my weight in donuts",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/l8encws/",
      "created": 1718275394,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8fmlb7",
      "score": 7,
      "body": "Could run through a wall after reading this HELL YEAH",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/l8fmlb7/",
      "created": 1718290515,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8erq3a",
      "score": 5,
      "body": "I'm right there with you! I'm so deep in DNUT that I'm practically a human glaze machine. To the naysayers judging Krispy Kreme based on gas station donuts, that's like judging a five-star restaurant based on a microwave dinner.\n\nAnd Ozempic? Please, this is America – where our idea of fitness is fitting more donuts into our mouths. So, put that pen down, pardner, and embrace the sugary goodness. Let's ride this glazed rocket to the moon together. DNUT to $50, baby! \n\nKeep those propeller hats spinning and don't forget to tell your mom I said hi too. ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/l8erq3a/",
      "created": 1718277849,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8gvbz5",
      "score": 6,
      "body": "I don't know anything about Ozempic or the weight loss shots, but I did watch the south park special on it and doesn't it actually suppress your appetite?\n\nI've seen so many comments that are like, oh because Americans are fat we can just take ozempic and eat donuts and cheeseburgers all day.\n\nBut isn't that not how it works?",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/l8gvbz5/",
      "created": 1718305464,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ezmu9",
      "score": 4,
      "body": "I bought in around 10.5. In it as well 🍩",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/l8ezmu9/",
      "created": 1718281685,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8euv12",
      "score": 3,
      "body": "consider aloof wistful smile chubby tan psychotic wild sloppy pathetic",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/l8euv12/",
      "created": 1718279430,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8frgn7",
      "score": 3,
      "body": "You had me at \"hello regards\". So in",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/l8frgn7/",
      "created": 1718292165,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8g226j",
      "score": 3,
      "body": "I bought in 2000 shares for this after last DD:) ",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/l8g226j/",
      "created": 1718295687,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ga47c",
      "score": 3,
      "body": "i just bout a $10 Put for 5 dollars haha lets see where it goes from there XD",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/l8ga47c/",
      "created": 1718298350,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8h2r81",
      "score": 3,
      "body": "Bought 400 shares let’s go gamers!!! 🦅",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/l8h2r81/",
      "created": 1718307928,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8hcsg2",
      "score": 3,
      "body": "what a disgusting day for ya'll",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/l8hcsg2/",
      "created": 1718311231,
      "depth": 0,
      "replies": []
    },
    {
      "id": "len2dz8",
      "score": 3,
      "body": "u/GethD4d where you at my brother! How did you make out with the July calls? I'm loaded up on Aug 16 12.5C hoping things pan out.",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/len2dz8/",
      "created": 1721784352,
      "depth": 0,
      "replies": [
        {
          "id": "leo2u4i",
          "score": 4,
          "body": "Well well. Hello brother. You too are on the last line I see. Thankfully I see hope on the technicals. I didn't want a second bottom but knew it was very possible.\n\nWell let's start with the June calls. I broke even and rolled them into July calls, which i rolled maybe a quarter of into August calls. The rest of the July calls expired worthless. Which was a nice Toyota Camry worth..\n\nOn the bright side, my DNUT shares are up a hot 4%.. But I'm overall down around 10K~ or 20% of my overall DNUT position.\n\nAlas, I've become a sophisticated cunty trader now. Warren buffet if you will. Nyess.. A shareholder... 5K shares. Things are alot less fun on this side..\n\nSo In the spirit of glazing a nice yeasty hole, I might feel cute, fuck around, and sell 1K shares for 300 or so 12.5 September calls.\n\nThis earnings call Is going to be very, very, interesting.. \n\nGodspeed regard.",
          "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/leo2u4i/",
          "created": 1721801303,
          "depth": 1,
          "replies": [
            {
              "id": "lep4gga",
              "score": 2,
              "body": "Figured it was a choppy month for you. I'm still a believer in the technicals, and we should see strong revenue reporting continue this quarter. May the DNUT gods bless us indeed!",
              "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/lep4gga/",
              "created": 1721823903,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8emf2m",
      "score": 1,
      "body": "I would never touch them...I hope it works out for you.",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/l8emf2m/",
      "created": 1718274819,
      "depth": 0,
      "replies": [
        {
          "id": "lbzgl64",
          "score": 1,
          "body": "why not?",
          "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/lbzgl64/",
          "created": 1720318874,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8ewlfr",
      "score": 1,
      "body": "Hell yeah",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/l8ewlfr/",
      "created": 1718280269,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8h0jv2",
      "score": 1,
      "body": "In.",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/l8h0jv2/",
      "created": 1718307195,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l97aauh",
      "score": 1,
      "body": "Yo with the recent pullback, do you think it is still a buy or will you double down, what do you think?",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/l97aauh/",
      "created": 1718739576,
      "depth": 0,
      "replies": [
        {
          "id": "lbzgn1s",
          "score": 1,
          "body": "im obviously not OP but I bought more... getting ready for earnings...",
          "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/lbzgn1s/",
          "created": 1720318898,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbzgqo3",
      "score": 1,
      "body": "need an update on this OP, I still trust u tho...",
      "permalink": "/r/wallstreetbets/comments/1devidh/dnut_yolo_dd_inside_update/lbzgqo3/",
      "created": 1720318942,
      "depth": 0,
      "replies": []
    }
  ]
}