{
  "title": "AI trade reminds me of the telecom bubble at the turn of the century.",
  "score": 1123,
  "selftext": "Just wanted to share a few thoughts I have related to the current state of the AI buildout and get your feedback.\n\nThe AI buildout reminds me a lot of the late 90s and early 00s when there was a race to build out large telecommunications networks to provide the bandwidth to support all of the new activity that would take place on the rapidly rising technology. \n\nCompanies like Cisco and Lucent went parabolic as a large number of embedded providers (AT&T, Verizon, Comcast, etc) and new entrants (Qwest, Level 3, Global Crossings, etc) received large amounts of capital to build out new IP networks.\n\nThe problem was that the investment in network infrastructure greatly outpaced people’s ability to monetize it.  It took nearly two decades to absorb the network capacity glut and there were only a couple winners when it was all said and done, with a ton of companies absorbed and destroyed in its wake.  Cisco still hasn’t reached its all time high over two decades later and Lucent and other equipment providers lost a ton of value and were absorbed as demand for their products declined sharply.  And the winners of the internet buildout were not the companies being touted during the dotcom bubble.\n\nI feel like we’re in the early stages of a similar cycle.  NVDA is like the telco equipment providers with the added benefit of not having any real competition and there are so many companies rapidly deploying their chips to make sure they get in on the AI game.  I think NVDA will continue to soar until the buildout is complete.  Large companies like Microsoft, Google, and Apple are racing to build capacity just like the telecommunications service providers back in the day and there are a bunch of new entrants fighting for mindshare.  Unfortunately no one has really figured out how to monetize the technology yet.\n\nMy prediction is that the AI trade over the next two years will looks like the culmination of the telecommunications bubble.  Huge ramp over the next two years as companies race to build out capabilities, followed by a rapid decline as companies fail to figure out how to monetize the investment.  NVDA will stick around but after it reaches its ATH it will struggle like Cisco did after the capacity glut is reached and the folks that actually figure out how to monetize AI will be different than a lot of the companies that are being bet on now.\n\nTLDR, u think we’re in the beginning of a bubble due to rapid capacity buildout, followed by a crash when the industry can’t monetize the technology fast enough to pay back the investment, and then steady growth as the technology matures and new entrants rise on new and unforeseen AI applications.\n\nWhat do you all think?",
  "link_flair_text": "Discussion",
  "id": "1dezbsu",
  "num_comments": 650,
  "created_utc": 1718286200,
  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/",
  "comments": [
    {
      "id": "l8fajnw",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 4 months ago\n**Total Comments** | 109 | **Previous Best DD** | \n**Account Age** | 5 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fajnw/",
      "created": 1718286205,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ge0pg",
      "score": 440,
      "body": "They'll just ask the AI they create how to monetize it and bada bing bada boom",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8ge0pg/",
      "created": 1718299643,
      "depth": 0,
      "replies": [
        {
          "id": "l8gf5em",
          "score": 54,
          "body": "Ha!",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gf5em/",
          "created": 1718300018,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8hjgly",
          "score": 8,
          "body": "Don’t break the matrix man. Damn!",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hjgly/",
          "created": 1718313464,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8jiyui",
          "score": 5,
          "body": "When you realize Reddit sells data to improve AI and WSB is already scanned for market sentiment ![img](emote|t5_2th52|4275)",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8jiyui/",
          "created": 1718344887,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8hivzz",
          "score": 4,
          "body": "Got em ",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hivzz/",
          "created": 1718313266,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8jzsj6",
          "score": 5,
          "body": "Given it will be trained on reddit data.. now its answer is going to be to ask the AI.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8jzsj6/",
          "created": 1718356482,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8hua1x",
          "score": 10,
          "body": "No but actually",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hua1x/",
          "created": 1718317385,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8ix16e",
          "score": 2,
          "body": "Yada yada yada and we’re all rich",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8ix16e/",
          "created": 1718333334,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8fvetq",
      "score": 620,
      "body": "I like your high effort post. Take my low effort upvote.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fvetq/",
      "created": 1718293477,
      "depth": 0,
      "replies": [
        {
          "id": "l8gm8fr",
          "score": 83,
          "body": "I tap up arrow when taking a dump",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gm8fr/",
          "created": 1718302359,
          "depth": 1,
          "replies": [
            {
              "id": "l8hyx4m",
              "score": 8,
              "body": "I take an arrow when being up",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hyx4m/",
              "created": 1718319184,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8hhf17",
          "score": 5,
          "body": "This also sums up my thoughts. I'll upvote ya",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hhf17/",
          "created": 1718312762,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8hi0so",
          "score": 3,
          "body": "I up-arrowed  also",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hi0so/",
          "created": 1718312969,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8j8s8b",
          "score": 2,
          "body": "Why did my comment get so many upvotes?",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8j8s8b/",
          "created": 1718339021,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8ghg57",
      "score": 132,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8ghg57/",
      "created": 1718300775,
      "depth": 0,
      "replies": [
        {
          "id": "l8gi6c9",
          "score": 41,
          "body": "I like to say that history doesn’t repeat but it does rhyme.  We shouldn’t ignore it, but you’re right to keep it in the proper context.  That’s why I used telco vs dotcom as my example, I think it is a better analog for what we’re seeing now.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gi6c9/",
          "created": 1718301014,
          "depth": 1,
          "replies": [
            {
              "id": "l8gnflz",
              "score": 13,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gnflz/",
              "created": 1718302769,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8hb911",
              "score": 2,
              "body": "If you are interested in this general theme, I suggest checking out the book Engines that Move Markets. It provides a detailed history of overinvestment in new technologies ultimately leading to poor returns, going from canals to railroads to modern day tech. ",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hb911/",
              "created": 1718310729,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8fzs7a",
      "score": 220,
      "body": "If all y'all youngsters want a nice laugh, go seek out the documentary \"startup.com\"\n\nFrom 2001, it documents the idiocy and fanaticism of the telecom bubble and is a fascinating watch.\n\nHere, i did the heavy lifting for you: https://youtu.be/cP4PGjnZwJE?si=Pg92pojdEgU3zc6g",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fzs7a/",
      "created": 1718294923,
      "depth": 0,
      "replies": [
        {
          "id": "l8g1ws7",
          "score": 88,
          "body": "This.  Lots of folks here haven’t lived through a market crash and only know this very long bull market.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g1ws7/",
          "created": 1718295637,
          "depth": 1,
          "replies": [
            {
              "id": "l8g5r6k",
              "score": 70,
              "body": "To be fair, we also have the most consolidated market in...almost a century, maybe? Doesn't feel like things behave the same way when you have \"too big to fail\" companies stomping on everything, knowing that any big fuckup will just get bailed out.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g5r6k/",
              "created": 1718296914,
              "depth": 2,
              "replies": [
                {
                  "id": "l8h8qph",
                  "score": 20,
                  "body": "GE/GM, Ford, IBM, Xerox, Kodak, all innovating giants that got overthrown and died pretty swiftly.",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8h8qph/",
                  "created": 1718309912,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8hf2dp",
                      "score": 20,
                      "body": ">GE/GM\n\nThey are still around - GM only starting to do better because it doesn't put out shit.\n\n>Ford\n\nSurvived 2008 what on earth are you talking about? Pays a pretty decent dividend.\n\n>IBM\n\nThey just snatch up companies to pad the balance sheet. This company sucks to work for and to own.\n\n>Xerox\n\nAnother good dividend but yeah, what do they make? Paper? Who cares.\n\n\n>Kodak\n\nThey just didn't evolve. They had digital cameras but they were stuck in the film game. No true innovation came out of that.\n\n\nNot really seeing the connection. You just threw out companies most of which are still around.",
                      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hf2dp/",
                      "created": 1718311978,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8ho0su",
                          "score": 15,
                          "body": "Obviously they all survived, but they're a shell of what they were before. The point is that companies we would've thought \"too big to fail\" in the past *did* fail -- at some point they didn't get bailed out, and now they're a fraction of the market share and growth they used to have. \n\n> GE/GM They are still around - GM only starting to do better because it doesn't put out shit.\n\nNot really. Most of GE has been sold off to other companies that just use the name. \"GE\" appliances are actually just Haier. Now real GE is just jet engines, electrical systems, and healthcare -- not bad, but still a shell of the past, considering they basically invented every electric appliance. Probably nothing you've seen that says \"GE\" on it was  made by GE. \n\n> IBM They just snatch up companies to pad the balance sheet. \n\nIBM was a giant in early PC days. Now they don't even make PCs -- they sold that division to Lenovo. They're still growing but their influence in the modern consumer market is negligible. \n\n> Ford Survived 2008 what on earth are you talking about? Pays a pretty decent dividend.\n\n\"Survived 2008\" doesn't mean it's what it used to be. Don't really feel like I need to explain why Ford today is smaller than Ford of the past\n\n> Xerox what do they make? Paper? Who cares.\n\nAre you 15? lmao Palo Alto was a *massive* innovator in early tech. They literally invented the fucking PC. Mice, keyboards, ethernet, laser printers, and were in general a massive influence in early networking development. Now they're such a husk of the past that people like you think they make paper\n\nThe same will happen to Apple, Facebook, Google, etc in time which have all been around for less time than these former giants. Not saying \"get out now!!\" but this consolidated \"too big to fail\" vibe just comes from being young and not having seen it all before.",
                          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8ho0su/",
                          "created": 1718315065,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8hs74s",
                              "score": 4,
                              "body": "GE is the 71st largest publicly traded company in the world. They had $68 billion revenue last year and are profitable in the billions. They also got a massive bailout in 08 and were one of the largest lenders in the world at the time.",
                              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hs74s/",
                              "created": 1718316594,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l8id0p3",
                                  "score": 4,
                                  "body": "Sure, when you are a half trillion dollar company in the 2000's it will take some time to shrink, down to 170 billion market cap now.\n\nThat was hardly the only time they were one of the biggest companies in the world, but I wouldn't bet money on a company that shrank that much over two decades",
                                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8id0p3/",
                                  "created": 1718324866,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "l8k74qb",
                          "score": 2,
                          "body": "[deleted]",
                          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8k74qb/",
                          "created": 1718361445,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8k74qo",
                              "score": 2,
                              "body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8k74qo/",
                              "created": 1718361445,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l8gho63",
              "score": 22,
              "body": "Exactly. I’m old enough to remember the late ‘90s crash (my dad lost so much investing in telecom startups back then) and the ‘08 crash (I was in college just knowing my career path would be much more challenging after I graduated). \n\nYoung investors need to know the history. It can happen again. \n\nThis sub likes to joke about “bers being fkd” but bears are always right…it’s just a matter of when.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gho63/",
              "created": 1718300849,
              "depth": 2,
              "replies": [
                {
                  "id": "l8gi6au",
                  "score": 64,
                  "body": "Bulls always right…. it’s just a matter of when.",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gi6au/",
                  "created": 1718301014,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8h4ldq",
                      "score": 4,
                      "body": "Ehh not really true. They do not all go up. They all eventually go down.",
                      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8h4ldq/",
                      "created": 1718308536,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l8gif5n",
                      "score": 8,
                      "body": "You’re not wrong, lol. Bulls/bears for the market are like yin/yang in one Eastern philosophy…both present, just in different ways and at different times.",
                      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gif5n/",
                      "created": 1718301094,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8glbxm",
                          "score": 31,
                          "body": "The difference is bears lose way way more money than bulls.",
                          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8glbxm/",
                          "created": 1718302060,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l8gm7uw",
                          "score": 7,
                          "body": "So you're saying there's a bull in every bear and a bear in every bull?",
                          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gm7uw/",
                          "created": 1718302354,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8gsjs6",
                              "score": 3,
                              "body": "lol pretty much.",
                              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gsjs6/",
                              "created": 1718304545,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l8h3ajh",
                  "score": 12,
                  "body": "I'm likely a similar age to you with similar experiences (in college during the '08 crash). What I remember is my dad being my grandfather's unofficial investment advisor around that time and trying to keep him in relatively safe investments (he was nearing retirement). My uncle, however, was making a killing on dot com investments and actually taking out bank loans to invest. My uncle eventually convinced my grandfather to invest in risky stocks, maybe 6 months before the crash. Needless to say, things went badly for the both of them (although my grandfather was able to retire at 81 and is still in his own home at 94!). Was a crazy time and definitely makes me a bit skittish about the current market.",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8h3ajh/",
                  "created": 1718308107,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8h8sn1",
                      "score": 17,
                      "body": "I mean, some good advice might be to not take out bank loans to invest in the stock market.",
                      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8h8sn1/",
                      "created": 1718309931,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8h9fxu",
                          "score": 10,
                          "body": "Haha, I agree wholeheartedly! Also, don't invest on margin (essentially same thing as taking a loan) or buy options ('the casino is now open 24 hours' according to Warren Buffet, said about the introduction of options and after hours trading in retail brokerage accounts). Just stick with broad market ETFs, DCA, invest money you can afford to not touch for at least 10 years, don't pull out after a downturn, and you'll likely be fine.",
                          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8h9fxu/",
                          "created": 1718310141,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "l8h6qgt",
                      "score": 5,
                      "body": "Wow, that’s awful! I’m glad your grandfather turned out to be okay, but what an irrational thing for your uncle to suggest for someone so close to retirement age. \n\nI hope stories like this aren’t as common with this bubble but some people never learn.",
                      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8h6qgt/",
                      "created": 1718309248,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l8h7u6d",
              "score": 3,
              "body": "Pretty sure everyone wqa alive for 2020 crash. Even if it did have a v shaped recovery",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8h7u6d/",
              "created": 1718309613,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8fi7y8",
      "score": 262,
      "body": "Cisco had a pe of 200 near its peak.  Nvda is around 75 right now. \n\n\nAmd and arm fit your thesis better. ",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fi7y8/",
      "created": 1718289002,
      "depth": 0,
      "replies": [
        {
          "id": "l8gshvp",
          "score": 57,
          "body": "PE ratio isn’t everything though. OP has a point and I think at a level we are all aware of it. \n\nOn top of that, the Nvidia bull run is not done lol, so lots of time to catch up to that 200 PE before it inevitably crashes",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gshvp/",
          "created": 1718304528,
          "depth": 1,
          "replies": [
            {
              "id": "l8h8vbr",
              "score": 21,
              "body": "Yesterday, NVDA had the highest confidence level our models ever printed out, at 93% - that's in training, backtesting, and validation - across all stocks in the S&P 500, ever.\n\nToday, the model's confidence has fallen to... 88.8% - still the highest current stock in the S&P 500, outpacing even Enphase Energy, which has been #2 or #1 for months now.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8h8vbr/",
              "created": 1718309954,
              "depth": 2,
              "replies": [
                {
                  "id": "l8hsl5f",
                  "score": 6,
                  "body": "Is enphase energy a good buy>?",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hsl5f/",
                  "created": 1718316743,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8iqwro",
                      "score": 7,
                      "body": "Look at its chart.  The stock was worth $400 and now crashed to $100, which is when it hit #1 on the model's confidence list.  Its confidence hasn't declined; nVidia just surpassed it.\n\nWe're about one to two years away from the price of electricity doubling or tripling due to every available power source being put to use training superintelligences.  I also put money into NRG today and I'm investigating raw land in Pennsylvania as well.  NRG is #4 on the model's list.\n\nThe model doesn't \"think\" about fundamentals like that, but it can see that big institutions are buying these energy companies.  Look out for companies that already have huge power contracts that can be repurposed for training and inference, like the aluminum smelters mentioned in that AI researcher's paper.  There will be massive deals to buy companies that have huge infrastructure making other products just to shut them down and redirect the power to the datacenters.\n\nRight now, GPUs are the limiting resource.  Soon electricity will be.  nVidia is going to continue to grow, but the market is forward-looking.  There's six months left in the chip boom and then the energy boom will start; the smart people are buying up energy contracts now.",
                      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8iqwro/",
                      "created": 1718330682,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8j424v",
                          "score": 2,
                          "body": ">We're about one to two years away from the price of electricity doubling or tripling\n\nWhere are you getting this one from?",
                          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8j424v/",
                          "created": 1718336614,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8jajuo",
                              "score": 2,
                              "body": "Electricity has been increasing in my state for awhile, but it is mostly due to green energy infrastructure. The problem with his thesis is the US is doing lots of green energy build outs that will offset a lot of that demand he thinks will happen. The only real outcome is that the demand will not allow the US to decommission its older fossil energy plants.\n\nI think energy prices will increase, but it will not lead to greater profits for energy companies unless they don’t touch green energy and they decide to cash-cow out - which due to regional monopoly laws, likely will not be allowed. Most of the cost increases will be due to recouping infrastructure costs, never hitting the bottom line significantly.",
                              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8jajuo/",
                              "created": 1718339979,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l8hgge2",
                  "score": 3,
                  "body": "That sounds potentially confidential as fuck, but any chance you'd be willing to share some model training techniques openly or privately?  \n\n\nI've been working on a model personally out of personal hobbyist interest and would benefit from and love to hear anything from architecture to training data to preferred gpu LED color.  \n\n\n \nThe place I last left off I was stuck on reversion to mean issues, using approximately 100 parameters and 20 years of data on almost every stock in the sp500 at daily accuracy. I was additionally using options data to derive sentiment, but couldn't get the thing to stop averaging, just to give an reference for my skill level(or lack there of)",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hgge2/",
                  "created": 1718312438,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8ipwu9",
                      "score": 2,
                      "body": "Unfortunately not.\n\nThere are major flaws in almost every machine learing research paper published in the academic literature.  I can't talk about how the models were trained without pointing out the errors.\n\nHowever, one thing I can say is that while the models are amazing, it is actually very easy to make a huge amount of money without them.  Simply look for what people are saying and do the opposite.\n\nBitcoin is a prime example.  I don't know if there is still a record of this somewhere, but on June 16, 2022, the front page of CNN had a featured article \"Cryptocurrency bubble crashes down.\"  One hour after the article was posted was the exact cycle low of $16,000.  The same exact thing happened in November 2013 as well, just at the top of the bubble.\n\nnVidia will slow down (not stop) when there is a front page New York Times article about how the singularity has arrived.  By that time, none of us will have jobs, though.  This is not a \"dot com bubble\" like the last one; it will just be a slowdown in the 30% GDP gains we'll be seeing in the 2030s.\n\nBy the way, another prime example (which the model hasn't yet caught onto fully but confidence is starting to rise on) is Pfizer.  The number of articles calling for the end of that company is ridiculous.  It's the most oversold stock in the S&P 500.",
                      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8ipwu9/",
                      "created": 1718330266,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l8g0lo9",
          "score": 65,
          "body": "Now do p/s ratio.\n\nSurely they can’t keep these crazy margins forever.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g0lo9/",
          "created": 1718295199,
          "depth": 1,
          "replies": [
            {
              "id": "l8g8cz9",
              "score": 43,
              "body": "shhh don't tell them.\n\nNvidia fanbois in the replies,",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g8cz9/",
              "created": 1718297769,
              "depth": 2,
              "replies": [
                {
                  "id": "l8hozm3",
                  "score": 5,
                  "body": "Can one not just set a stop loss like 5% under the current price and keep pumping it?",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hozm3/",
                  "created": 1718315411,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8hw7pj",
                      "score": 6,
                      "body": "It's fell 5% and then recovered multiple times already",
                      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hw7pj/",
                      "created": 1718318136,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l8i8o4p",
                      "score": 3,
                      "body": "You can do a trailing stop but more like 20% you'll lose a bit but at this point if you've been in a while you wouldn't lose most of your earnings. It's basically the advice of a book called price is primary",
                      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8i8o4p/",
                      "created": 1718323054,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l8ge4ol",
              "score": 24,
              "body": "safe chop different spotted trees advise pause decide deer public",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8ge4ol/",
              "created": 1718299680,
              "depth": 2,
              "replies": [
                {
                  "id": "l8gz484",
                  "score": 10,
                  "body": "Apple literally said nah, we can run it on laptop CPUs cheaper.",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gz484/",
                  "created": 1718306718,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8hdxy7",
                      "score": 9,
                      "body": "They aren't training models on laptop CPUs. They're just running cloud software.",
                      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hdxy7/",
                      "created": 1718311608,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l8gz4oq",
                  "score": 2,
                  "body": "OP point is exactly that demand for AI GPU won’t persist",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gz4oq/",
                  "created": 1718306722,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8fipvd",
          "score": 38,
          "body": "NVDA could easily hit a PE in the several hundred if it keeps going up like that.  I don’t think it’s peaked and I think it will peak a lot higher than it is today.  I’m just saying be cautious because the capacity build out is way ahead of monetization at this point.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fipvd/",
          "created": 1718289176,
          "depth": 1,
          "replies": [
            {
              "id": "l8fxg1z",
              "score": 23,
              "body": "Yeah, if it doubles again it’s gonna be 150 PE. Btw it’s gonna be a 6tn company.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fxg1z/",
              "created": 1718294145,
              "depth": 2,
              "replies": [
                {
                  "id": "l8g4qrh",
                  "score": 12,
                  "body": "Ah but what if it doubles AGAIN mr smart guy",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g4qrh/",
                  "created": 1718296582,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8fl00k",
              "score": 47,
              "body": "Assuming the expected revenue growth over the next few quarters, PE in the several hundred means market cap deep into the double digit trillions. Maybe 10-15% of the S&P by weight.\n\n\nWhen you're talking about a hypercap of unprecedented proportions like that, you have to ask novel questions about where all that capital is coming from. Maybe every other sector falls out of style combined with a global tailwind from a decreasing interest rate environment sucking capital away from fixed income. It's not like a 1B company where it can 10x overnight with no significant effect on the larger market.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fl00k/",
              "created": 1718289970,
              "depth": 2,
              "replies": [
                {
                  "id": "l8g3rj0",
                  "score": 38,
                  "body": "It's like everyone forgot semiconductors are cyclical.  Everyone is in a massive upgrade cycle because Ai!!!!\n\n\nExpecting Nvidia revenue to ramp into infinite goes against long established trends.",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g3rj0/",
                  "created": 1718296253,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8fxkfp",
                  "score": 14,
                  "body": "The rest of the sp500 will just go up too. It’s already trailing the pace it should be on compared to inflation. Sp has a lot of room to move which would keep Nvda from hitting too high a weighting. \n\nWhenever someone uses the argument that a stock can’t go higher because it would be too big compared to the rest of the market they always conveniently forget that the rest of the market always goes up and isn’t just stagnant or needs to go down to fund something that’s going up. ",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fxkfp/",
                  "created": 1718294185,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8ft75y",
              "score": 4,
              "body": "Are contemporary investments made with the same conception of industry bubbles?  I think this is the third or fourth turn for some investors that are experienced with these bursts and less keen to repeat them.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8ft75y/",
              "created": 1718292744,
              "depth": 2,
              "replies": [
                {
                  "id": "l8ftn62",
                  "score": 14,
                  "body": "Maybe, but you can read some of the responses below.  There is a lot of “this time is different” and “no way this is a bubble right now”. I think a large portion of commentators weren’t really around for the telco bubble but I work in the industry and started my career during the boom times.",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8ftn62/",
                  "created": 1718292891,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8fzq6c",
                      "score": 4,
                      "body": "I think it's loud young people saying that.  People that weren't around then will be bag holding now for sure but I just think the cyclical nature has accelerated and that might make it more obvious to the experienced.",
                      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fzq6c/",
                      "created": 1718294904,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8g0kns",
                          "score": 3,
                          "body": "I’m just trying to be a voice of caution so folks don’t learn a painful and expensive lesson.",
                          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g0kns/",
                          "created": 1718295189,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l8gasb3",
              "score": 4,
              "body": "If you wait for complete monetization, you would have missed all the upside and just get in when the ride is about to end. ( although, other rides may begin!)",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gasb3/",
              "created": 1718298576,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8j1641",
              "score": 2,
              "body": "i have been saying this for months. it's like ppl really turn off their mind when they hit euphoria !",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8j1641/",
              "created": 1718335220,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8fuef0",
      "score": 37,
      "body": "This is always the case with all investment in individual stocks \n\nBenjamin graham talks about it in the intelligent investor\n\nEven if you can identify a sector that will outpace the growth of the general market picking the individual winners within that sector is very hard\n\nHe examples computer companies. Everyone could see computers were going to be big but picking IBM over all the others is difficult thing to do \n\nAnd now look at IBM compared to like apple \n\nAir travel is another example. People would have said air travel was going to boom but it was bogged down with all kinds of issues and was a big failure as an investment in the 50s or 60s can’t remember which decade \n\nSo yeah picking individual stocks long term is very hard. Nothing new",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fuef0/",
      "created": 1718293144,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ghmtr",
      "score": 12,
      "body": "There was also the \"big data\" bubble from about 2010-2019 when companies thought their \"algos\" running targeted marketing would keep them from going broke. It's a cycle of hype that goes on forever.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8ghmtr/",
      "created": 1718300836,
      "depth": 0,
      "replies": [
        {
          "id": "l8gi9de",
          "score": 4,
          "body": "Good call out!",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gi9de/",
          "created": 1718301041,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8fyfxc",
      "score": 68,
      "body": ">The problem was that the investment in network infrastructure greatly outpaced people’s ability to monetize it.\n\nyes. this is the correct take on NVIDIA. most valuable company in the world but where are the countless 10b-100b+ companies with AI products that are printing money?",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fyfxc/",
      "created": 1718294473,
      "depth": 0,
      "replies": [
        {
          "id": "l8g1ueh",
          "score": 29,
          "body": "I’m gonna guess there ain’t any.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g1ueh/",
          "created": 1718295615,
          "depth": 1,
          "replies": [
            {
              "id": "l8gkdsx",
              "score": 33,
              "body": "You are correct because AI is actually trash tech right now. Chatgpt consistently give me the wrong information for even simple tasks.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gkdsx/",
              "created": 1718301742,
              "depth": 2,
              "replies": [
                {
                  "id": "l8hi6g7",
                  "score": 12,
                  "body": "You're just not using it right. I have used it to make my dumbass writing sound better and more professional in a couple of seconds. I have dropped a HTML table that is read only and can't get a proper export of the data into it and asked it to convert that HTML table into a regular table I can copy and paste from. I've had it write a regex expression for a excel spreadsheet I needed to work as a string builder. \n\n\nMaybe you are just not in a position to use it or maybe you are just not thinking of ways you can use it so your literally thinking inside your own box. \n\n\nIt greatly improves efficiency/output when used right.",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hi6g7/",
                  "created": 1718313022,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8ipxrk",
                      "score": 4,
                      "body": "kind of an aside to your actual point but the idea to use it for RegEx is so good. Everyone hates regex",
                      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8ipxrk/",
                      "created": 1718330276,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l8h4ozt",
                  "score": 4,
                  "body": "ChatGPT is great for some things and terrible for others. For creative writing type tasks, template creation (including writing code), and similar it works great and is a real time saver. For factual information, it will just make shit up half the time and can't be trusted.",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8h4ozt/",
                  "created": 1718308569,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8hhh2h",
                      "score": 4,
                      "body": "This is 100% percent correct. I have asked it to create legal documents, it just makes stuff up. If you want to see something hilarious, ask it to write a resume for someone that you know well. It will say all kinds of wild stuff. It is of dubious value for technical writing.",
                      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hhh2h/",
                      "created": 1718312782,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l8h02h8",
                  "score": 6,
                  "body": "ChatGPT is actually mostly a toy, automation seems far more interesting. It seems these things are crazy good for robotics.",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8h02h8/",
                  "created": 1718307035,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8iqr8s",
                  "score": 2,
                  "body": "If you think AI is trash tech right now you clearly know nothing about AI.",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8iqr8s/",
                  "created": 1718330617,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8gmla7",
                  "score": 2,
                  "body": "Right now they are but give it a year and it will be vastly evolved",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gmla7/",
                  "created": 1718302479,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8hee1a",
          "score": 7,
          "body": "Im not sure; they either dont exist or you dont know about them. This AI stuff is being used on consumers not by them. e.g. targetted marketing, etc.\n\n  \nSide note, its why Im bullish on META. They are an AI leader, because they monetize it",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hee1a/",
          "created": 1718311755,
          "depth": 1,
          "replies": [
            {
              "id": "l8hyjwm",
              "score": 2,
              "body": "a.i is being used by meta to make sure I keep watching big breasted ladies on my feed lol",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hyjwm/",
              "created": 1718319043,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8fxxzc",
      "score": 35,
      "body": "Yeah, I've been saying the same thing for a while now and all I get is 'this time it's different' but also from people who tell me that Musk knows what he's doing and I started to question that a while ago.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fxxzc/",
      "created": 1718294309,
      "depth": 0,
      "replies": [
        {
          "id": "l8g1a9l",
          "score": 13,
          "body": "“Musk knows what he’s doing” - hilarious.\n\nHe’s knows what he’s doing as far as pumping the stock goes.  As far as “FSD”, well, I mean….",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g1a9l/",
          "created": 1718295427,
          "depth": 1,
          "replies": [
            {
              "id": "l8g1kh1",
              "score": 5,
              "body": "Oh mate this was from a somewhat reputable guy 'musk is a coder he understands' yeah you're trusting him after the twitter/x fiasco - really?",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g1kh1/",
              "created": 1718295522,
              "depth": 2,
              "replies": [
                {
                  "id": "l8g2fxl",
                  "score": 2,
                  "body": "Wow, talk about pure stupidity - tough to wrap my head around that much stupid.",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g2fxl/",
                  "created": 1718295814,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8g8dlk",
      "score": 8,
      "body": "I am in the tech space, and AI will take a while to monetize for sure. Right now, anything that is real is unreliable. Most other things are less sophisticated software marketed as AI.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g8dlk/",
      "created": 1718297775,
      "depth": 0,
      "replies": [
        {
          "id": "l8g90e7",
          "score": 4,
          "body": "This is what is driving my hypothesis.  The capacity build out is way ahead of the revenue right now and many who are building it out will fail and many that we don’t yet know will figure it out and will be the next generation of companies that drive the market forward.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g90e7/",
          "created": 1718297982,
          "depth": 1,
          "replies": [
            {
              "id": "l8gcdnx",
              "score": 7,
              "body": "For sure. The problem is that it's so hard to figure out who will come out ahead. Like, back in the day, I would've never guessed that AOL and Yahoo would have ended up where they did. Also, I thought Netscape would've lasted. I would've never guessed Amazon and Google would be trillion dollar companies.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gcdnx/",
              "created": 1718299106,
              "depth": 2,
              "replies": [
                {
                  "id": "l8gcwxu",
                  "score": 3,
                  "body": "We’re speaking the same language lol",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gcwxu/",
                  "created": 1718299280,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8go9jl",
      "score": 7,
      "body": "Shovels are always overbought during a gold rush",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8go9jl/",
      "created": 1718303067,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8heqow",
      "score": 8,
      "body": "I think that you are mostly right. The issue with investing based on a no-lose story, is that you convince yourself you can't lose, and that no price is worth selling at. That's when they fuck you. This ultimately becomes a diversification issue, because people are making their entire retirement portfolio centered around the semiconductor industry. The famously very cyclical, I repeat, *very* cyclical, semiconductor industry. There's a reason it's cyclical: buildout does not need to constantly happen, it's bad capex. I'm sure Nvidia and its shareholders are very excited about their plans to charge in a subscription-like manner, but even if NVDA doesn't care about good vs bad capex, there are still people at big corporations who are paid a lot of money to decide what good capex ACTUALLY is, and they have every right and incentive to choose the cheaper option, when that inevitably presents itself.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8heqow/",
      "created": 1718311871,
      "depth": 0,
      "replies": [
        {
          "id": "l8hi7qx",
          "score": 3,
          "body": "Great post!",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hi7qx/",
          "created": 1718313035,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8gl5m3",
      "score": 8,
      "body": "Oh my god \nWhen I read turn of the century and realized that was 2000 and not 1900 I felt really really really old \n🤦🏻‍♂️",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gl5m3/",
      "created": 1718302002,
      "depth": 0,
      "replies": [
        {
          "id": "l8i4ti2",
          "score": 2,
          "body": "Do you have colour pictures of that dot com thing?",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8i4ti2/",
          "created": 1718321501,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8grz5m",
      "score": 8,
      "body": "Thank God someone has brought this up, I have always been wondering... wheres the money going to come from?",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8grz5m/",
      "created": 1718304357,
      "depth": 0,
      "replies": [
        {
          "id": "l8guemh",
          "score": 2,
          "body": "That’s the thing… we don’t know yet.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8guemh/",
          "created": 1718305154,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8g2rug",
      "score": 12,
      "body": "I remember you couldn’t find a single analyst with a sell rating on Cisco at $50/sh.  Not a one.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g2rug/",
      "created": 1718295924,
      "depth": 0,
      "replies": [
        {
          "id": "l8g2xa2",
          "score": 5,
          "body": "Exactly.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g2xa2/",
          "created": 1718295974,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8fgc2w",
      "score": 70,
      "body": "Except top tech, financial, retail companies are already implementing numerous use cases on top of LLMs and asking for more.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fgc2w/",
      "created": 1718288335,
      "depth": 0,
      "replies": [
        {
          "id": "l8fko6q",
          "score": 34,
          "body": "Maybe ai will fix the refrigerator doors at walgreens ![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fko6q/",
          "created": 1718289856,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8fqmml",
          "score": 8,
          "body": "Very few of these use cases being monetized effectively",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fqmml/",
          "created": 1718291887,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8fly1z",
          "score": 71,
          "body": "They all claim they are, I work in tech at a leadership level, its not nearly as impressive as AI bears want it to be. Its not transformative like the smart phone was. Its not a bad tool but I have my doubts about its current incarnation. No one knows how much something like ChatGPT needs to cost to be profitable, my guess based on the equipment and talent needed to train models is going to be alot. That price tag is going to put off a lot on the consumer side since its applications are limited. On the enterprise side you might see some adoption, right up until some one gets hacked due to shity AI code that not one bothered reviewing. AI right now is like big data before it, a solution in search of a problem.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fly1z/",
          "created": 1718290293,
          "depth": 1,
          "replies": [
            {
              "id": "l8fo294",
              "score": 34,
              "body": "The AI we have now is the worst it will ever be.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fo294/",
              "created": 1718291017,
              "depth": 2,
              "replies": [
                {
                  "id": "l8fovyx",
                  "score": 33,
                  "body": "I always hear that but to be clear, my chatGPT results have gotten progressively worse over these past few months due to the nature of how these things work lol",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fovyx/",
                  "created": 1718291300,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8fpnib",
                      "score": 32,
                      "body": "Hmm mine are getting better. gpt-4o and I wrote this this little top down game in less than 8 hours. I manually edited less than 1% of the code. The wizards dialog tree is generated by gpt every time you start the game. Just a toy, but it impressed me.\n\nhttps://preview.redd.it/hpl25050vc6d1.png?width=1597&format=png&auto=webp&s=c0cc7097984b58c0ed23a59f11933819ec08c2e1",
                      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fpnib/",
                      "created": 1718291560,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8g51hc",
                          "score": 13,
                          "body": "Drop a link brah I wanna cyber bully the wizard",
                          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g51hc/",
                          "created": 1718296681,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8g98vu",
                              "score": 7,
                              "body": "Sure, [here ya go](https://github.com/itsreallyreallytrue/barnyardchaos). You're gonna need to comment line 484 and have a openai api key in your env if you want fresh dialog each time, otherwise it defaults. Yes the wizard moon walks.",
                              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g98vu/",
                              "created": 1718298060,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "l8fptzz",
                          "score": 3,
                          "body": "Yeah but these graphics look like shit /s",
                          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fptzz/",
                          "created": 1718291621,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8frwix",
                              "score": 12,
                              "body": "Bbbbut I have blood splats and a day night cycle. Pathing, Animals attacking each other, full animations, collision detection...\n\nhttps://preview.redd.it/6mmhv6n7xc6d1.png?width=1599&format=png&auto=webp&s=f11d165f135d4aa6bc3c3200397639e897921df7",
                              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8frwix/",
                              "created": 1718292310,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "l8fv195",
                              "score": 7,
                              "body": "it is pretty shit, but the ability to make this with almost no coding experience is pretty insane tbh",
                              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fv195/",
                              "created": 1718293352,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l8fvfcl",
                                  "score": 14,
                                  "body": "Thing is I have 25 years of coding experience. I did need to prompt it system by system. But honestly what amazed me is that most of the time it was a one shot prompt. I asked it at one point to scale everything up by 2x and it literally just worked, all the collision detection and pathing and tile drawing code just magically got updated.",
                                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fvfcl/",
                                  "created": 1718293482,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l8haxnx",
                                      "score": 3,
                                      "body": "I will admit in the hands of a competent coder it is a genuinely  helpful tool. In the hands of a junior coder its a cherry bomb and a pair of matches.",
                                      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8haxnx/",
                                      "created": 1718310626,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l8gg7nr",
                      "score": 3,
                      "body": "I don't agree with that comment its already worse then when it started and some of the top guys in the planet in tech like Tim are already saying they don't know if the Hallucination problem is even solvable. My guess is all of its big promises are left undelivered and it improves a lot of smaller things considerably, which is true of pretty much every big tech promise the last 5 or 6 years. They hit the wall.",
                      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gg7nr/",
                      "created": 1718300369,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l8fptdy",
                      "score": 4,
                      "body": "Talk to it like it's a piece of shit. \n\n  \nNot joking.",
                      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fptdy/",
                      "created": 1718291615,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l8fqa0j",
                  "score": 11,
                  "body": "Who’s to say the best it will ever be will be significantly better though? \n\nPeople familiar with the technology (actual scientists, not the CEO of OpenAI) don’t see any major breakthroughs on the horizon to add reasoning or scalable memory. Use cases of the current tech will expand, but the tech itself may not significantly improve anytime soon.",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fqa0j/",
                  "created": 1718291771,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8gfv0t",
              "score": 5,
              "body": "I think to be honest with you that its going to be too expensive to be profitable, It will be cheaper to just have a foreign barely paid slave do it remotely. This is actually already happening with a lot of cloud services companies loved them when they were cheaper but now its getting to the point where rolling your own on prem again is so much cheaper its not worth it anymore. Microsofts Energy bill had to go up like 30% or something I saw over this already and it will get even worse.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gfv0t/",
              "created": 1718300256,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8g3xik",
              "score": 8,
              "body": "You might be a great source to pose this to:\n\nI think (and this is just my hypothesis/theory), companies are panicking, scrambling even, to find ways to save money. Given our high inflation of previous years and interest rates being currently high, debt is expensive for companies. The days of easy borrowing, and hi-flinging tech is over. Full time Tech jobs are now scarce and there is a creeping \"white collar\" recession. Companies are desperately looking for ways to cut corners.\n\nAnd so you see companies hastily implementing the LLM chatbots to terrible effects, like Air Canada which actually had to rollback because their chatbot did something truly dumb (can't remember what it was exactly but it gave the customer something free unintentionally). And many just jump on the bandwagon and say \"AI\" 238429384234 times in company presentations because they want that investment money.\n\nLLMs are for sure great, they're quite useful, but they're somewhat being used as a desperate measure here. It still makes far too many small mistakes (due to its black box nature) that in the grand scheme of enterprise architecture which funnels petabytes of data from millions if not billions of worldwide customers, can become very costly if mistakes arise, unless overseen carefully by humans.\n\nMy company (F250) for instance just lost a ton of market cap because we implemented AI that hasn't yet borne fruit. Weak guidance. I hope things turn around in the future otherwise this will end up being a Dot Com bust of AI.\n\nWould you agree?",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g3xik/",
              "created": 1718296309,
              "depth": 2,
              "replies": [
                {
                  "id": "l8gct64",
                  "score": 5,
                  "body": "The Air Canada bot misinformed the customer about a policy, which the customer then relied on and ended up not able to get a refund they were expecting based on what the bot had told them.",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gct64/",
                  "created": 1718299245,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8gh916",
                  "score": 3,
                  "body": "I don't think its creeping bro I think we are well into white collar job apocalypse. Although that is just a minor change from your very correct point.",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gh916/",
                  "created": 1718300710,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8ha6og",
                  "score": 2,
                  "body": "Your right on the saving money but its not to \"save\" money its to push up Ebita. Most markets are fully saturated and are requiring increasingly larger investments to pull more revenue out of.  I manage a a few million in vendor spend a year, every single one this year and last has raised prices between 5-10% other than ironically amazon though amazon does have other methods to make you spend more. Right now its much easier to increase ebita by raising prices or reducing costs.   \n\n\nThis is piled on by a shrinking ad business on the internet as the average consumer has going almost completely add blind due sites being plastered with adds along with chaning user behavior making it harder to add target. \n\nYeah its rock and hard place on AI right now. Either you find a way to add \"AI\" to your product or your going to look behind the time to clients and other companies. VC only seems to be interested in AI so that's where all the startups are heading. I had a contract with a zoom competitor that had some interesting ideas and they have strait up abandoned the service to chase AI VC money. \n\nLLM are an interesting tool and I do use them in my job from time to time but I don't think they are quite where the need to be. The code they write looks right but has bugs and at times concerning security issues. The documents they produce sounds good but have very little actionable content.   \n\n\nAI is interesting because its able to wow the average person but people who know how it works at a technical level are less impressed. I also have very strong doubts that when openAI starts to charge what it actually costs to be profitable if many people will be wiling to pay. \n\nThey are more or less giving chatGPT away for free and its still having issues providing value.",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8ha6og/",
                  "created": 1718310382,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8gyju1",
              "score": 2,
              "body": "Content generation is a huge use case. Consultants being able to describe slides and have them generated instantly is a massive win (and they don’t have to hire level 1 consultants to do the work for them anymore). \n\nSimilar, I saw McKinsey is training an internal AI on their old case data. Imagine the ultimate consultant who knows what worked and didn’t on all previous similar cases. On every project. And trained to not give away specifics of previous cases that would violate privacy. Massive skill up level.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gyju1/",
              "created": 1718306529,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8fm5d3",
          "score": 4,
          "body": "Do you have a source regarding financial and LLMs? Machine learning sure they are doing it since more than a decade. From what I see companies struggle to move past the novelty demo effect and have reliable systems in production (which is not surprising given than Transformer based LLMs are fundamentally unreliable), and they killer use case are still chatbots but nothing beyond.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fm5d3/",
          "created": 1718290363,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8ggsvl",
      "score": 4,
      "body": "Wall Street will punish companies that remain rational and do not participate in the ai bubble, such as the former Google and Apple. Seeing the decline in stock prices, they had to buy nvda chips in large quantities to cater to investors, but they would not bring them matching profits. This makes nvda's performance look like it doesn't have a big bubble. This is the current market situation. In the future, ai will be applied in vertical subdivisions, such as medicine or industrial manufacturing, but it is far from the prospect of boasting.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8ggsvl/",
      "created": 1718300563,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8gww7b",
      "score": 3,
      "body": "In my highly regarded opinion, the .dot bomb crash was nothing like the AI revolution of today. Back then everyone was hiring in tech, whether you had skills or not. You could just toss out lingo and acronyms and you were hired. Plus there was all the vaporware and pipe dreams that VCs threw money at in hopes of striking it rich. It seems to me (still well regarded in my esteemed circles), today's AI revolution has practical applications across the board; defense, consumer, B2B, research etc....\n\nEdit: because of the implications....",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gww7b/",
      "created": 1718305979,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8gj0iy",
      "score": 7,
      "body": "Yeah but telegraph is the future of communication",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gj0iy/",
      "created": 1718301290,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ggorj",
      "score": 10,
      "body": "A lot of the hype has been generated by large language models and the belief that they will be able to replace employees in all kinds of sectors. Whilst they have some uses, the limitations are becoming clearer and clearer and inevitably the hype will die down. LLMs can sound exactly like your doctor but I very strongly doubt (as someone who has been trying to implement them) that they will ever form many useful products. They simply are not capable of the reasoning required to perform real tasks with any reliable accuracy. \n\nThe one useful counter example I have found is language learning apps, because sounding like a real person is all that’s required. But they will not be replacing your doctor.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8ggorj/",
      "created": 1718300526,
      "depth": 0,
      "replies": [
        {
          "id": "l8hbi57",
          "score": 6,
          "body": "But a doctor with them is way better than one without, a programmer with one is similar and so on. Why are people always wanting to replace instead of just working with it?",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hbi57/",
          "created": 1718310813,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8hl50n",
          "score": 2,
          "body": "I did my uni paper on AI in legal because ‘AI is going to replace lawyers’. Only a median of 13% of the total billable hours are actually replaceable by AI. The overhyping of AI is real lol.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hl50n/",
          "created": 1718314052,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8fx19e",
      "score": 3,
      "body": "I think one more year of bull market, and I'll be ready to put my retirement fund to pasture in \"safe\" investments. C'mon NVDA, AVGO, LLY!!!",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fx19e/",
      "created": 1718294010,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8g6pg1",
      "score": 3,
      "body": "Part of the telecom bubble was manufacturer doing financing. So the companies building networks did really pay for the equipment.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g6pg1/",
      "created": 1718297226,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8gmzea",
      "score": 3,
      "body": "So you buying leap puts?",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gmzea/",
      "created": 1718302612,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8h5qlk",
      "score": 3,
      "body": "I lived through the dot.com bubble and I definitely get a Deja Vu vibe.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8h5qlk/",
      "created": 1718308917,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8h6j5b",
      "score": 3,
      "body": "Maybe it’s just me, but I’m more concerned with the valuation of equities across the board. The market feels largely overpriced compared with P/E ratios ranging from brick and mortar retail to innovation sectors that includes Ai *but isn’t exclusive to ai.* I want to know what happens when the euphoria of returning rate cuts gets eclipsed by fears of declining consumer purchasing power and snowballing debt defaults. I really need to do research on it though and haven’t paid much attention to P/E ratios on more traditional American companies. I feel like looking at price trends on standard debt companies like Visa and Mastercard could be useful as well.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8h6j5b/",
      "created": 1718309182,
      "depth": 0,
      "replies": [
        {
          "id": "l8h78rf",
          "score": 2,
          "body": "I agree with you and think the valuations of Eli Lilly and Novo Nordesk are way too high.  And don’t get me started on the HIMS run after announcing they’re going to provide semaglutides.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8h78rf/",
          "created": 1718309417,
          "depth": 1,
          "replies": [
            {
              "id": "l8h7xny",
              "score": 2,
              "body": "No doubt. My suspicion is that equities in general are overpriced going into any specific example of a bubble (whether it’s the housing market, dotcom, tulips, whatever). It’s just that one sector tends to absorb most of the inflows. When spare cash for equities dries up in general the most prominent sector gets remembered and also causes the most systemic damage during the pop.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8h7xny/",
              "created": 1718309645,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8jj1bv",
          "score": 2,
          "body": "I agree too but I think there are too many people feeling this way for us to be near the top. Not enough market euphoria in the mainstream so there are still plenty of people left to FOMO into the market.\n\nWaiting on a new class of young millionaires being profiled on mainstream media to signal that things are topping.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8jj1bv/",
          "created": 1718344930,
          "depth": 1,
          "replies": [
            {
              "id": "l8jjaga",
              "score": 2,
              "body": "Yes. I think there is still a lot of upside left as well but it’s just speculation. I’m paying attention to NVDA’s P/E ratio that is currently 73 compared to Cisco’s topped out P/E ratio of 200 in the DOTCom bubble as an exit sign. That and the general NASDAQ P/E.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8jjaga/",
              "created": 1718345090,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8iyw6n",
      "score": 3,
      "body": "It will be a race to make the \"Killer App\" to utilize the AI capabilities. This will determine if the hype has legs. If it does, then it will zoom for much longer. If not, it will die quickly. Then it will become a utility. Just like compute went from data centers to the cloud - compute, storage, network became commoditized. They will make AI capabilities a commodity and sell it in \"shares\". Right now, people are racing to market and building their own. This will last about 2-3 years.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8iyw6n/",
      "created": 1718334168,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8frmgb",
      "score": 6,
      "body": "Demand for efficient yet powerful compute will continue to go up. There are too many important use-cases for the hardware.\n\nTry to look at how nvidia maintained their dGPU business over the past 30 years instead of comparing apples to oranges.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8frmgb/",
      "created": 1718292217,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8fy0jx",
      "score": 5,
      "body": "Your post pretty much sums up my thoughts perfectly. Everyone is saying \"this time it's different\"",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fy0jx/",
      "created": 1718294332,
      "depth": 0,
      "replies": [
        {
          "id": "l8fy6yh",
          "score": 2,
          "body": "Those are very dangerous words lol",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fy6yh/",
          "created": 1718294391,
          "depth": 1,
          "replies": [
            {
              "id": "l8fyxoz",
              "score": 11,
              "body": "I honestly think AI (at least the LLMs) are even less useful/transformative than the internet is. So far it's been nothing but a giant black hole of money of capex for the big tech giant players that can actually afford. And what you get in the end is a glorified hallucinating chatbot. This is not AGI. Maybe when we have actual general intelligence, this time will be different, but we're still so far away from that.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fyxoz/",
              "created": 1718294639,
              "depth": 2,
              "replies": [
                {
                  "id": "l8fztxn",
                  "score": 2,
                  "body": "thank god we are.",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fztxn/",
                  "created": 1718294939,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8g36z1",
      "score": 6,
      "body": "You only have to look at the PE history of Amazon to realize that in rare cases, companies can grow into their earnings and justify their ever decreasing multiple",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g36z1/",
      "created": 1718296064,
      "depth": 0,
      "replies": [
        {
          "id": "l8g3xfd",
          "score": 2,
          "body": "Agree, but if the PE gets really frothy I’m cashing out.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g3xfd/",
          "created": 1718296308,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8fbpgf",
      "score": 14,
      "body": "No. ![img](emote|t5_2th52|4640)",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fbpgf/",
      "created": 1718286646,
      "depth": 0,
      "replies": [
        {
          "id": "l8fnfqr",
          "score": 27,
          "body": "Thanks for the thoughtful and well reasoned response",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fnfqr/",
          "created": 1718290801,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8frn6e",
      "score": 10,
      "body": "another one… Apple figured out how to monetise it. They will sell milions of new iphones due to AI being available only on  iphone 15 pro. They don’t care about AI, they treat it as a marketing tool for iphone sales.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8frn6e/",
      "created": 1718292225,
      "depth": 0,
      "replies": [
        {
          "id": "l8gapis",
          "score": 12,
          "body": "So your example of AI monetization is that Apple, the company that sells 400$ wheels for their PC, is using \"AI\" as a market tool for their already extremely succesfull phone?\n\nYou are just agreeing with him honestly.\n\nIm sure a lot of companies in 2000 \"monetized\" internet tech by just using it as a marketing slogan that didn't actually deliver much value. That is his point.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gapis/",
          "created": 1718298550,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8g7ywj",
      "score": 4,
      "body": "During the last five years, PE ratio has been the worst indicator of whether it’s stock is going to go up or not. In fact it’s almost been inverse. Just look at the best gainers that we’ve had, look at their PE over time. PEG ratio is almost always a better measure",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g7ywj/",
      "created": 1718297640,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8h0vu3",
      "score": 4,
      "body": "But in this case there is no build out to complete. More compute will continue to translate directly into offering more capabilities to consumers, which will drive higher revenue for those companies. And the AI-enhanced services that provide a competitive advantage in money-making activities will be easily monetized. Compute is a new commodity. And NVDA will continue to sell the best shovels to mine it, probably until the next quantum leap (pun intended) in consumer chip technology.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8h0vu3/",
      "created": 1718307306,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8hj840",
      "score": 5,
      "body": "There literally is no such thing as AI, so it’s way worse.  At least the internet was real and provided real efficiency gains. AI is only promising to do this but so far has not delivered on anythibg other than deepfake michael jordan commercials.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hj840/",
      "created": 1718313383,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8gcuiu",
      "score": 6,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gcuiu/",
      "created": 1718299258,
      "depth": 0,
      "replies": [
        {
          "id": "l8haojv",
          "score": 5,
          "body": "Amazon lost 90% of its value at one point.  Don’t forget that and don’t assume you’ll have the stones to keep holding a stock while it crashes like that.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8haojv/",
          "created": 1718310543,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8fl2fp",
      "score": 13,
      "body": "Cannot simply compare telecommunications with AI just like that. Two essentially different scientific fields.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fl2fp/",
      "created": 1718289992,
      "depth": 0,
      "replies": [
        {
          "id": "l8fno9z",
          "score": 14,
          "body": "I’m talking about macroeconomic conditions not the technology.  I’m using telco as an analog, I know the technologies are different.  It’s just my hypothesis, I think we’re 3-5 years away from seeing if it’s correct.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fno9z/",
          "created": 1718290882,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8gga83",
      "score": 2,
      "body": "Can’t believe you missed a chance to say “turn of the millennium”",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gga83/",
      "created": 1718300392,
      "depth": 0,
      "replies": [
        {
          "id": "l8ggkzx",
          "score": 2,
          "body": "Damn… you’re totally right!",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8ggkzx/",
          "created": 1718300492,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8gk0p3",
      "score": 2,
      "body": "The future is now old man",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gk0p3/",
      "created": 1718301620,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8gl6yt",
      "score": 2,
      "body": "You definitely make a valid point. All the militaries of the world are figuring out how to best implement AI systems. From employee-less McDonald’s to automated customer service it is yet to be determined just how thoroughly AI tech that is rapidly evolving will be used. It already looks like AI will eliminate many jobs which could have its own effect on the economy. The world as we know it is changing fast. I know Amazon, Walmart want to use drones to deliver to peoples backyard and the main company is zipline which will go public soon. 2 years let’s go!",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gl6yt/",
      "created": 1718302014,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8h7lvh",
      "score": 2,
      "body": "RemindMe! 2 years",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8h7lvh/",
      "created": 1718309536,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8h9v31",
      "score": 2,
      "body": "Room to 5x before 9x crash.  Get onboard.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8h9v31/",
      "created": 1718310279,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8hosne",
      "score": 2,
      "body": "No no no, this time it’s different.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8hosne/",
      "created": 1718315341,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8i2k97",
      "score": 2,
      "body": "Couldn’t agree more. But this is definitely not a WSB post because it doesn’t mention 0DTE even once",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8i2k97/",
      "created": 1718320609,
      "depth": 0,
      "replies": [
        {
          "id": "l8i2qne",
          "score": 2,
          "body": "Ha!  Best comment so far!  I actually loled at that one.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8i2qne/",
          "created": 1718320677,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8iu37n",
      "score": 2,
      "body": "It’ll take around 2 years for the pop? That’s good enough for me. I’ll keep buying calls until then",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8iu37n/",
      "created": 1718332040,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8gw427",
      "score": 5,
      "body": "I am an AI engineer and there is over hype. There is small groups of good talent and most companies will end up spending so much on GPUs and other resources that will just end up as sunken costs.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gw427/",
      "created": 1718305724,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8gfvcv",
      "score": 3,
      "body": "Just say you missed the boom",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gfvcv/",
      "created": 1718300258,
      "depth": 0,
      "replies": [
        {
          "id": "l8ggh4y",
          "score": 6,
          "body": "Bought 660 NVDA shares at $27 and I’m still holding.  I didn’t miss it at all.  I have a position stake in MSFT.  I think I’m well positioned, just throwing out some words of caution.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8ggh4y/",
          "created": 1718300456,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8fc1q6",
      "score": 6,
      "body": "Ask yourself this questions:\n\nDoes the telecom companies you mentioned pull a similar profit and margin as NVDA?\n\nDoes any of the telecom companies have the same moat and tech advantage NVDA has against its competitor?\n\nAre we even at the point where computing power supply is far in excess over demand?\n\nIf you think it is just the beginning, then there is still room to grow before the bubble pop. Will you put some disposable cash to ride the upside?\n\nWhy do you think AI have not been monetized at the moment? General public have not been exposed to it extensively, but many global companies worldwide already started to use them (personal anecdote from where I work and from the client I work with). Also, AI is a misnomer in thos case since it is not true AI\n\nPersonally, the only concern bout NVDA that I think is legit is if their margin and growth sustainable 1-3 years from now",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fc1q6/",
      "created": 1718286772,
      "depth": 0,
      "replies": [
        {
          "id": "l8fihb5",
          "score": 14,
          "body": "The telco equipment providers absolutely had the margins that NVDA did and people thought it would grow forever just like NVDA.  Y’all are using hindsight bias here at the time everyone thought of Cisco just like NVDA.  If there is a glut of capacity it will take a long time to fill it up and NVDA will go down as the growth stops.  Go look at Cisco’s chart from ‘95 on and you’ll see why I mean.  The most dangerous words in investing are “this time it’s different”",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fihb5/",
          "created": 1718289093,
          "depth": 1,
          "replies": [
            {
              "id": "l8fl806",
              "score": 4,
              "body": "“Stonks go up forever “",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fl806/",
              "created": 1718290045,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8frbvx",
              "score": 3,
              "body": "You’re correct but investors participating in a bubble don’t see they are in a bubble. \n\nAI will absolutely keep getting better and will probably be as disruptive as the internet. \n\nPricing in a straight line up to get there though is foolish. \n\nWe will see a slump in compute/hardware/datacenter spend and growth at some point. There are rumours in the tech industry that model training progress has slowed significantly. AI architecture progress is tough to predict but more work will be required to get to end products that are better than LLMs.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8frbvx/",
              "created": 1718292121,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8fpil7",
          "score": 6,
          "body": ">Personally, the only concern bout NVDA that I think is legit is if their margin and growth sustainable 1-3 years from now\n\n\nMaybe 1-3 years but not much longer. If we had some kind of competitive economy where NVDA had hundreds of small customers, all of them would buy on the open market at market prices.\n\n\nBut we don't have that - we have half a dozen hypercap companies that dominate the IT and infrastructure landscape. They used to be dependent on Intel which *never* had the gross margins of recent NVDA. Fast forward some years, AMD picked up some share in an easy market, but AWS rearchitected their datacenters to use ARM at a time when literally every PC and server ran Intel-compatible software, bought Annapurna Labs and took chip design in house. Oracle maybe doesn't have that level of scale but they have a major investment in Ampere (founded by ex-Intel employees). MSFT built their own ARM CPU. I don't follow the China market closely but I can only assume that they are permanently cutting out Intel and AMD from their infrastructure because of US sourcing.\n\n\nSo that is the level of work they have demonstrated they will go through over time when their supplier was taking 60-70% gross margin vs NVDA's rumored ~90%. And the AI accelerator market is far bigger than CPUs were. NVDA had a great moat for a 10B TAM, when it's a 500B+ TAM that moat may as well be non-existent. NVDA uses the same supply chain and design tools as all of their competitors. They have made smart business decisions to have the right products at the right time in the right quantities, and everyone else is now racing to catch up.\n\n\nBut let's assume the magic is the key people within NVDA. When NVDA has 100M+ market cap for every single employee, including the marketing, HR, and accounting people, wouldn't some of those key people who make NVDA untouchable think they could create more value on the outside by taking a casual 50B of VC money?\n\n\nA smart and efficient market would have all of this priced in, but I'm more inclined to think that the market is going to be stupid on this and hold on too late. So fuck it NVDA 300 minimum by 2027 and only 1 year after NVDA starts bleeding market share and margins will the market give up on them.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fpil7/",
          "created": 1718291514,
          "depth": 1,
          "replies": [
            {
              "id": "l8frw19",
              "score": 2,
              "body": "I agree that competition will catch up in spec in long term. Though, I had some convo with a client in datacenter and they mentioned that once NVDA is entrenched, it is hard for the datacenter to switch to other provider due to effort, cost, transitioning issue and associated risks for the person in charge. The bigger question for them is how often they would need to upgrade their hardware.\n\nStill, at the current condition, I am comfortable with parking my investment with NVDA for a year or so.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8frw19/",
              "created": 1718292305,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8fgjl4",
      "score": 9,
      "body": "It's same but not. \n\nI think the age of robotics is here. Picture every job in existence from McDs frier to specialist surgeon being replaced by an Android, and any professional services like software development-teacher being replaced by Ai. I don't think there will ever be a glut or an oversupply of chips, even if you do a conservative 1 robot for every 100 people just in the US, shit tonne of market potential",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fgjl4/",
      "created": 1718288410,
      "depth": 0,
      "replies": [
        {
          "id": "l8fkzt0",
          "score": 31,
          "body": "Americans will fondly remember the days of indian customer support ![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fkzt0/",
          "created": 1718289967,
          "depth": 1,
          "replies": [
            {
              "id": "l8gg7h8",
              "score": 3,
              "body": "Yeah and now they are all the engineers and IT.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gg7h8/",
              "created": 1718300368,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8fixg3",
          "score": 19,
          "body": "Robotics is so very far from replacing all of that and LLMs / Generative AI are not the type of AI that help with that.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fixg3/",
          "created": 1718289250,
          "depth": 1,
          "replies": [
            {
              "id": "l8ggc7o",
              "score": 2,
              "body": "Anthropic may have a word about that.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8ggc7o/",
              "created": 1718300411,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8fhpnr",
          "score": 8,
          "body": "Having to buy billions of dollars of robots is going to really cut into profits. Sure they’ll be cheaper than humans eventually, but the immediate cost will be higher and we all know CEOs want lower immediate costs for their bonuses. They don’t care what profits look like in 5-10 years, except maybe Costco.",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fhpnr/",
          "created": 1718288823,
          "depth": 1,
          "replies": [
            {
              "id": "l8fxbzs",
              "score": 2,
              "body": "I think once the robots are up and going the pure constant efficient work will really add up. Like the initial robots will be expensive, but like won't having more efficient robots make creating the next ones that much faster and cheaper? Then those robots are also simultaneously doing efficient work and effectively generating wealth very quickly and like scalable?\n\nI don't know but it seems like if we actually get to that point its going to get crazy fast, the full scaling might take a while. But the implications, reactions and changes will probably be felt quickly. The end of this decade is about to be lit.",
              "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fxbzs/",
              "created": 1718294108,
              "depth": 2,
              "replies": [
                {
                  "id": "l8g236v",
                  "score": 3,
                  "body": "I agree. Who is going to take the leap though? Hertz got killed for trying out EVs, granted I think they half assed it for publicity. Even if MCD buys one $50k burger flipping robot for every single 42k stores, that’s $2bil. Not even calculating for maintenance on the robot.",
                  "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g236v/",
                  "created": 1718295696,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8fykf2",
      "score": 3,
      "body": "OMG, I've seen so many decent analysts rip the Cisco comparison to shreds. People are still on this? I love apples with my oranges. Yum yum.",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fykf2/",
      "created": 1718294515,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8g5fqm",
      "score": 3,
      "body": "Wow I’ve never heard this take before",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8g5fqm/",
      "created": 1718296811,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8gkl0q",
      "score": 2,
      "body": "More calls, I am gonna squeeze all you whiners",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gkl0q/",
      "created": 1718301809,
      "depth": 0,
      "replies": [
        {
          "id": "l8gkzua",
          "score": 6,
          "body": "These are my current positions in MSFT and NVDA.  Do I look like a bear or a whiner to you?\n\nhttps://preview.redd.it/duxr1x4wpd6d1.jpeg?width=3715&format=pjpg&auto=webp&s=65dce7bd74395d078a7dbe53bb2c48462c169864",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8gkzua/",
          "created": 1718301948,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8fy9sj",
      "score": 2,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fy9sj/",
      "created": 1718294416,
      "depth": 0,
      "replies": [
        {
          "id": "l8fyfm4",
          "score": 3,
          "body": "Not everyone.  Have you read through all the posts below?",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fyfm4/",
          "created": 1718294470,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8fzqal",
          "score": 2,
          "body": "tied to a broader bubble. buckle up. NVDA isn't a bubble, nor are a lot of the tech gains that are increasing prices based on revenue. AI will most certainly change the world, but there are some frothy gains out there tied to just saying \"AI\"",
          "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fzqal/",
          "created": 1718294905,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8fsevu",
      "score": 1,
      "body": "Are you trading on this thesis?",
      "permalink": "/r/wallstreetbets/comments/1dezbsu/ai_trade_reminds_me_of_the_telecom_bubble_at_the/l8fsevu/",
      "created": 1718292480,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "The AI buildout parallels the telecom bubble, with rapid investment exceeding monetization potential, especially for companies like NVDA.",
    "companies": [
      "Cisco",
      "Lucent",
      "AT&T",
      "Verizon",
      "Comcast",
      "Qwest",
      "Level 3",
      "Global Crossing",
      "Microsoft",
      "Google",
      "Apple"
    ],
    "tickers": [
      "CSCO",
      "T",
      "VZ",
      "CMCSA",
      "MSFT",
      "GOOGL",
      "AAPL",
      "NVDA"
    ],
    "main_ticker": [
      "NVDA"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "The author believes the current AI buildout resembles the telecommunications bubble, predicting a rapid rise followed by a crash due to lack of monetization.",
    "stock_recommendations": "The user is recommending to sell or avoid NVDA stock after it reaches its all-time high.",
    "is_recommending_stock_buying_or_selling": true,
    "buy_or_sell": "sell",
    "sentiment_summary": "There is negative sentiment because the author compares the AI industry to the telecom bubble, predicting a crash post-buildout, suggesting caution regarding NVDA stock.",
    "sentiment": "negative"
  }
}