{
  "title": "Is technical analysis hero or villain? What about automation?",
  "score": 47,
  "selftext": "Many traders makes their decision impulsively, wouldn't you agree? On the other hand are those who know how to use technical analysis and rely on data to help him make the right decision based on his understanding of market sentiment.\n\n**What is Technical Analysis?** Technical analysis studies price changes based on market activity. It helps predict price movements by examining supply and demand levels on charts and tracking investor sentiment.\n\n**Three Pillars of Technical Analysis:**\n\n1. Price Reflects Everything: All factors affecting price—psychological, economic, or political—are reflected in the market. Thus, predictions focus on the price chart.\n2. Price Movements Follow Trends: While individual price changes can be random, they can form trends over time. Trends can be upward or downward, indicating the market's direction.\n3. History Repeats Itself: Historical data analysis helps predict future price changes, as market behavior patterns tend to recur.\n\n**Automated Technical Analysis**: Automated technical analysis uses algorithms and software to analyze trading data and predict market movements. These systems can process large volumes of data quickly, identify trends and patterns, and execute trades without human intervention. This automation enhances decision-making efficiency and reduces the emotional biases that often affect investors.\n\n**Common automation tools include:**\n\n**Algorithmic Indicator Search Platforms**: With use of predefined rules based on technical indicators to execute search automatically.\n\nhttps://preview.redd.it/5ffztb1pic6d1.png?width=1280&format=png&auto=webp&s=ccf0af7ea6fc6cd20a82c3b41940b503cc1dcf81\n\n**Machine Learning Model**s: These models use historical data to learn and improve their predictive capabilities. Machine learning algorithms can identify complex patterns and correlations that are not easily visible through traditional analysis\n\nhttps://preview.redd.it/b32rr5qpic6d1.png?width=1280&format=png&auto=webp&s=156d954c322b6d77ed7057f07493057d41032a41\n\n**Backtesting Software**: Allows traders to test their strategies against historical data to see how they would have performed in the past.\n\nSo, this long read is supposed to explain technical analysis, but it, like automation tools essentially supports your analysis with a simple data feed from which you draw your own conclusions.",
  "link_flair_text": "Industry Question",
  "id": "1dezu8q",
  "num_comments": 20,
  "created_utc": 1718287569,
  "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/",
  "comments": [
    {
      "id": "l8g4guf",
      "score": 8,
      "body": "Technical analysis seems to me to help predominantly with trade execution. If someone needs to place an order that may move the market then that’s when the utility of traders and their technical analysis seems to be largest but I imagine this is becoming more and more automated.",
      "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/l8g4guf/",
      "created": 1718296489,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8gackz",
      "score": 33,
      "body": "Save yourself some time and energy and just go to a tarot card reader for financial decisions. \n\nAt least that avenue hasn't been exploited to the fullest extent possible by firms with much more resources than you. \n\nAt the end of the day, any information you can possibly use to reliably make money has already been overused to the point of being, once again, useless.",
      "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/l8gackz/",
      "created": 1718298429,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8hwemf",
      "score": 4,
      "body": "Not sure what your post is asking?  I guess it depends.   The best investor in the world, Warren Buffett has said \" technical analysis is \"astrology for investors\" and the \"dumbest reason in the world to buy a stock\".  But at the same time you have many hedge funds which use quantitative analysis including trading systems and they seem to be making a lot of money.   I frankly don't know of any very successful investor who has made big money from technical analysis but then I am no expert.",
      "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/l8hwemf/",
      "created": 1718318210,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8fmhgj",
      "score": 15,
      "body": "It’s just a part of your toolbox, it can give you insight into things but it’s not a guarantee",
      "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/l8fmhgj/",
      "created": 1718290479,
      "depth": 0,
      "replies": [
        {
          "id": "l8g8w2n",
          "score": 6,
          "body": "> It’s just a part of your toolbox\n\n100% this.\n\nIf you're planning to take a *big-to-you* position in any individual company, you learn the market they play in, their people, the supply chains, the geopolitical risks, etc.\n\nTechnical analysis is one vector of information for you to consider.  The penny stock bargain bin is full of companies that looked great on paper.",
          "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/l8g8w2n/",
          "created": 1718297943,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8hgjgh",
          "score": 1,
          "body": "Even SPY/VOO goes up and down and Bond (IEF,TLT) values goes up and down! \n\nIs there any guarantee with any stocks, ETFs, bonds or any kind of investments?",
          "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/l8hgjgh/",
          "created": 1718312466,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8g76xx",
      "score": 10,
      "body": "TA is for crayon eaters",
      "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/l8g76xx/",
      "created": 1718297386,
      "depth": 0,
      "replies": [
        {
          "id": "l8yrwgf",
          "score": 1,
          "body": "True",
          "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/l8yrwgf/",
          "created": 1718604971,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8fraej",
      "score": 7,
      "body": "Even professional actively managed funds don't tend to outperform the market in the long run",
      "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/l8fraej/",
      "created": 1718292107,
      "depth": 0,
      "replies": [
        {
          "id": "l8g9w6o",
          "score": 8,
          "body": "And there's a selection bias in the media for reporting this, too:  big returns make great headlines and generate clicks.  The losers don't get the air time.\n\nThe perfect example is ARK:  They were *every* headline for a while while they were raking in the dough.  Then suddenly you don't hear boo and realize they've lost ~76% of their managed assets in the last few years.  And yet people are *still* quoting their guidance - in this sub of all places!",
          "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/l8g9w6o/",
          "created": 1718298275,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8i9lv5",
      "score": 2,
      "body": "Technical analysis uses mathematical probability. When a pattern appears, there is a high probability that it will rise or fall later. Then you should take corresponding actions and do a good job in position management. However, this is more suitable for short-term trading or day trading, not suitable for long-term holding.",
      "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/l8i9lv5/",
      "created": 1718323442,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8im5et",
      "score": 1,
      "body": "I watch some youtube day trader.  I think they do use technicle analysis.  But base on what they are saying, they pretty much use every analysis possible.  They look at fundamental too, volume, news, everything.  They probably have like 10 criteria and technical analysis to find entry and sale is only one of it.",
      "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/l8im5et/",
      "created": 1718328697,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8lm2jz",
      "score": 1,
      "body": "its a tool that shouldnt be over looked.",
      "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/l8lm2jz/",
      "created": 1718382001,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vjrjf",
      "score": 1,
      "body": "Number 2) can be reconciled with 1) only if the past is a reasonable predictor of the future. Number 3) requires that relevant patterns can be found from the data available.\n\nI’m very sceptical and as far as I know academic studies showed that technical analysis is useless.",
      "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/l8vjrjf/",
      "created": 1718554264,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8iaw97",
      "score": 1,
      "body": "Technical analysis is a villain - it ate my dog",
      "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/l8iaw97/",
      "created": 1718323980,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8fn44b",
      "score": -11,
      "body": "Technical analysis works, but in fact it is difficult to explain between traders, as only professionals can use and interpret it correctly",
      "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/l8fn44b/",
      "created": 1718290691,
      "depth": 0,
      "replies": [
        {
          "id": "l8g9z9q",
          "score": 6,
          "body": "Lol - sounds like Feng Shui.  It's not.",
          "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/l8g9z9q/",
          "created": 1718298304,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8g754c",
          "score": 11,
          "body": "And Astrology can only be interpreted by sages and seers. Only psychics can use it correctly.",
          "permalink": "/r/stocks/comments/1dezu8q/is_technical_analysis_hero_or_villain_what_about/l8g754c/",
          "created": 1718297370,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}