{
  "title": "Someone Forgot to Tell Qualcomm They Don't Design Their Own Chips - ARM Does",
  "score": 216,
  "selftext": "",
  "link_flair_text": "News",
  "id": "1df1v7w",
  "num_comments": 101,
  "created_utc": 1718292837,
  "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/",
  "url_overridden_by_dest": "https://www.xda-developers.com/arm-says-it-wants-all-snapdragon-x-elite-laptops-destroyed/",
  "comments": [
    {
      "id": "l8ftihf",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 8 months ago\n**Total Comments** | 2588 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8ftihf/",
      "created": 1718292847,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8hx6al",
      "score": 65,
      "body": "Qualcomm is a legal firm with an engineering department.  Pretty sure they are down to fight this one.\n\nFunny thing is what happens if ARM wins.  The idea that ARM allows AAPL to use the ISA to design cores but wouldn't allow QCOM to do so would immediately open up the FRAND (Fair, Reasonable, and Non-discriminatory) question about the entire instruction set IP.\n\nThis case ends with a large payment from QCOM to ARM.",
      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8hx6al/",
      "created": 1718318506,
      "depth": 0,
      "replies": [
        {
          "id": "l8i2tpl",
          "score": 24,
          "body": "This case ends with lawyers making a bunch of money and eventual settlement with no money exchanged.\n\nARM has to make it look like they’re trying for their shareholders but they can’t fuck over their 5G biz.",
          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8i2tpl/",
          "created": 1718320707,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8h46xn",
      "score": 34,
      "body": "Qualcomm is the end game for all patents. Dont like it? No 5G for you",
      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8h46xn/",
      "created": 1718308404,
      "depth": 0,
      "replies": [
        {
          "id": "l8h54bw",
          "score": -20,
          "body": "Oh noooo, if only we had other ways to transmit data quickly wirelessly!",
          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8h54bw/",
          "created": 1718308711,
          "depth": 1,
          "replies": [
            {
              "id": "l8h6q1s",
              "score": 33,
              "body": "Qualcomm has the patents on that too.\n\nSeriously if it’s wireless Qualcomm has the essential patent - doesn’t mater what it is.",
              "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8h6q1s/",
              "created": 1718309244,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8i00wy",
              "score": 17,
              "body": "Haha - Apple spent billions buying the Intel modem business for 5G. Even they are yet to figure out a way to be as good as the Qualcomm designs. \n\n5 years later, Apple is still using Qualcomm while still investing loads of money to try work it out.",
              "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8i00wy/",
              "created": 1718319613,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8i96ip",
              "score": 8,
              "body": "You want to invent 6G? You definitely cannot get around some of the 4G/5G patents! Qualcomm will get you covered.",
              "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8i96ip/",
              "created": 1718323265,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8ftmnq",
      "score": 81,
      "body": "ARM said they want all Snapdragon laptops destroyed - DAMN lol",
      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8ftmnq/",
      "created": 1718292886,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8gdmme",
      "score": 66,
      "body": "Qualcomm is a much bigger patent troll than ARM.\n\nIt’s guaranteed that ARM is using Qualcomm IP.\n\nThis thing is going to settle - if it doesn’t ARM is going to end up getting slapped around really hard.",
      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8gdmme/",
      "created": 1718299515,
      "depth": 0,
      "replies": [
        {
          "id": "l8gsbq4",
          "score": -30,
          "body": "Arm has all the patents. WTF do you think they are using ARM for. If they could do it on their own they would. Can you imagine Nvidia OEM's saying fuck you nvidia thanks for the design?",
          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8gsbq4/",
          "created": 1718304473,
          "depth": 1,
          "replies": [
            {
              "id": "l8h5tnu",
              "score": 46,
              "body": "ARM has the copyright on the ARM instruction set. The US has already said that instruction sets are basically un-copyrightable (Intel vs AMD) so they’re already on shaky ground.\n\nQualcomm has essentially all the patents for mobile technologies plus plenty of others (they have 263k patents).\n\nThe entire ARM 5G portfolio depends on Qualcomm patents.\n\nThis thing settles or Qualcomm bends ARM over.",
              "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8h5tnu/",
              "created": 1718308945,
              "depth": 2,
              "replies": [
                {
                  "id": "l8hkbc2",
                  "score": -26,
                  "body": "What are you talking about. We are not talking about copyrights we are talking about licensing and patents. You're entire copyright explanation is a half-baked half-truth. \n\nYes the US decided that ISA's aren't copyrightable but they sure the hell are licenseable and patentable. \n\nNot only that but the dispute while not winnable in terms of copyright's did nothing about the disputes and agreements in place regarding licensing to USE intel's technology. AMD won their countersuit/anit-trust case because Intel was doing shady practices to cut AMD out. The concession was instead of paying royalties for the patent and $1.25 Billion they agreed to cut out the royalties. Again, nothing to do with the ISA being copyrightable. \n\n263k patents is a troll level of patents if you ask me. Who the hell keeps track of 263k patents? \n\nRegardless, I don't care if they have 1 billion patents. If my patent is broader, original based or of a different aspect of the chip to mobile architecture then my patent is still valid. Our licensing agreements are still valid. They can't just skip out of them and act like they're not there. \n\nARM isn't going to get bent over if they are violating an agreement. Do you think ARM is just a bunch of morons and are complaining over nothing?",
                  "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8hkbc2/",
                  "created": 1718313760,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8hlwh6",
                      "score": 28,
                      "body": "You definitely belong here.",
                      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8hlwh6/",
                      "created": 1718314321,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8hm8ga",
                          "score": -19,
                          "body": "I'm not downvoting man lol. You're responses are pretty good. I was surprised by the your research and or knowledge of that. You have to admit my response is fair is it not?",
                          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8hm8ga/",
                          "created": 1718314437,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8hmq4e",
                              "score": 10,
                              "body": "No, it’s bagholder copium.\n\nThe only thing that Qualcomm has licensed in the ISA. That’s the only thing Qualcomm cares about. ARM is claiming that license didn’t follow the purchase which would have to be a very specific clause in the contract that specifically made it non-transferable since transferability of contracts is assumed.\n\nOn the other hand ARM hasn’t done jack shit in terms of growing their business value in the last 15 years dumping a shitload of money into IoT while being passed up by folks making their own cores in enterprise and mobile.\n\nWhile ARM is suing around something barely copyright able, based on what would have to be highly unusual contract terms, against a company with a patent portfolio that would cripple ARM if they were to revoke licenses.\n\nThis gets settled - ARM is unhappy with people making ARM processors that aren’t based on their IP so they’re losing out on a shitload of money their stockholders are getting pissed about.\n\nIt’s going to be real fun if they try suing Apple too.",
                              "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8hmq4e/",
                              "created": 1718314611,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l8i2gvr",
                                  "score": 0,
                                  "body": "You seem to know to know a lot of very specific knowledge around this. But come on you have to admit ARM is the SoC and that is where their concern would lay right? \n\nFor Apple I am not on ARM's side here but wish ARM could win that one. The part I am with Apple is the fact is an agreement is an agreement. However, does that agreement include all new IP and updated/newer technologies? That's the part I'm unclear on and would hope ARM would win that because it is their IP. \n\nAlso, to your point. I think ARM has to be careful here because otherwise these \"disputes\" will be an opportunity for RISC-V to make headway. Although if it was worth anything QCOM would have probably transitioned over so there is something in the core of ARM that they want. \n\nBut again, ARM is providing the opportunity for a player to make a business of of their backs. If ARM was direct competing it would lessen other's using their business. But look at what Microsoft had to do with the Surface line because of how shitty OEM's where doing in the PC market. Apple was just crushing them. Perhaps ARM should start direct competing and go for the Nvidia model completely.",
                                  "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8i2gvr/",
                                  "created": 1718320571,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l8i3ii2",
                                      "score": 8,
                                      "body": "No ARM isn’t doing shit in this case. Qualcomm and Nuvia both licensed the ISA - THATS IT. \n\nSeriously they licensed the rights to basically a 200 page PDF.\n\nARM is suing because they don’t want people making non-cortex processors since they want people to buy the cortex RTL from them. Having people just license the ISA and then release dramatically better cores not only hurts their bottom line but also hurts their image as the place to get IP.",
                                      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8i3ii2/",
                                      "created": 1718320980,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l8hn5jz",
              "score": 6,
              "body": "Man you seem confused. ARM sells IP, Nvidia sells chips (manufactured by tsmc).",
              "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8hn5jz/",
              "created": 1718314761,
              "depth": 2,
              "replies": [
                {
                  "id": "l8hp606",
                  "score": -5,
                  "body": "Are you sure you're not confused? I said Nvidia's OEM's. Have you ever heard of MSI, Gigabyte, or ASUS. They are licensing and standardizing the GPU specification just the same as ARM is doing. \n\nWhat you jumped to was thinking that all that Nvidia does is manufacture high-end AI chips. Perhaps you forgot about their OG business model.",
                  "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8hp606/",
                  "created": 1718315475,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8hqnbi",
                      "score": 12,
                      "body": "You really don’t understand anything you’re talking about.\n\nTSMC manufactures the chips on contract with nvidia, nvidia sells them to their customers.\n\nSure you might have a slight argument if you were to say that TSMC just turned around and started mass selling the chips themselves - but that ignores a shitload of factors and it’s not an apples to apples comparison. Qualcomm isn’t using a chip design from ARM - they’re just using the ISA.",
                      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8hqnbi/",
                      "created": 1718316014,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8htowa",
                          "score": -15,
                          "body": "Does MSI make Nvidia GPU's? Yes or no?\n\nHere's help\n\nhttps://preview.redd.it/aizs19t9ze6d1.jpeg?width=679&format=pjpg&auto=webp&s=c0288acf4de465608739138dc61a62fca25c4507",
                          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8htowa/",
                          "created": 1718317159,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8htqb2",
                              "score": 11,
                              "body": "They do not.",
                              "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8htqb2/",
                              "created": 1718317174,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l8huetc",
                                  "score": -13,
                                  "body": "What? lol \n\nThey make the GPU. I think you simply mean they are using Nvidia GPU chips.",
                                  "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8huetc/",
                                  "created": 1718317436,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l8huxu4",
                                      "score": 13,
                                      "body": "MSI makes the graphics card. They do not make the GPU (graphics processing unit) which makes the card work. You are wrong.",
                                      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8huxu4/",
                                      "created": 1718317639,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l8hweeu",
                                          "score": -10,
                                          "body": "No, you are wrong or misunderstanding what I am saying. MSI does make the GPU using Nvidia GPU chips. The only thing provided by Nvidia in an Nvidia MSI GPU is the GPU CHIP. Nothing else, such as any other chips or memory or cooling or shit all else is provided by Nvidia. Well, other than the specifications and certifications.",
                                          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8hweeu/",
                                          "created": 1718318208,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "l8j67rn",
                                      "score": 1,
                                      "body": "MSI and alike are like car manufacturers that don’t make their own engines lol",
                                      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8j67rn/",
                                      "created": 1718337685,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l8j7ekl",
                                          "score": -1,
                                          "body": "That is dumb. Dell makes laptops but don't make intel or and chips. What's your point",
                                          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8j7ekl/",
                                          "created": 1718338300,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "l8hvicf",
                              "score": 8,
                              "body": "Oof you're real deep in confidently incorrect here. Msi very specifically does not make the gpu chipset. Nvidia doesn't either. Nvidia designs it, tsmc makes it and board partners like msi use a design layout from Nvidia with their own msi flavor packet sprinkled on to create the finished product.",
                              "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8hvicf/",
                              "created": 1718317858,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l8hwsw4",
                                  "score": -1,
                                  "body": "I know for a fact that when people buy an OEM GPU they realize that there is a component inside that is Nvidia. Hence the Geforce RTX name. Anyone who's taken one of these things apart knows damn well that the ONLY THING INSIDE that is NVidia is the GPU CHIP. That's it.  A GPU is not only the GPU CHIP. Am I the only one understanding this?",
                                  "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8hwsw4/",
                                  "created": 1718318363,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l8hxnhm",
                                      "score": 10,
                                      "body": "No a gpu very specifically is the chipset. Everything else is ancillary. Gpu (the thing designed by nvidia but specifically not made by them) is what does the work that is the specific part that is a gpu. The rest of the graphics card is things like ram, power regulation, interfacing and cooling. You're conflating graphics card ( the finished product) with gpu (the chipset designed by nvidia)",
                                      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8hxnhm/",
                                      "created": 1718318691,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l8hzuy6",
                                          "score": -3,
                                          "body": "You know what I mean. Your statement is fair but you know people use gpu phrasing interchangeably. More to the point, Nvidia releases a GPU(graphics card) as a reference design or founders edition. Most people overwhelmingly purchase the OEM card for the \"ancillary\" parts of the graphics card.  tomato tomato",
                                          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8hzuy6/",
                                          "created": 1718319549,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "l8jl9p2",
                                      "score": 2,
                                      "body": "Well, the rest of the *Graphics Card* is interchangeable standard components and a cooler. Anyone can solder that together, nobody cares.\n\nThe GPU these OEMs get is a rectangular piece of silicone with some soldering points on the bottom. \nThey don't know what's inside and how to make it.\nWith out it, the rest does nothing. There is nobody else wo can supply them this chip. \nThere is also nobody who could manufacture it except TSMC and maybe Intel in the future, even if they knew how.\n\nThey are in no better position to copy those chips than you or I.",
                                      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8jl9p2/",
                                      "created": 1718346351,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l8kr1hw",
                                          "score": 1,
                                          "body": "You have no clue wtf you're talking about.\n\nOEM and IP\n\nOne of the other ways that Nvidia makes money is through licensing its intellectual property (IP) to other companies. Although this is not a mainstream revenue stream for the tech giant, it still  represents a significant portion of the company’s earnings.\n\nRemember that Nvidia is a top tech company. This means that its IP is highly sought after by companies in various industries, including gaming, data centers, automotive, and more. By licensing its IP, Nvidia generates revenue without manufacturing and selling its own products.\n\nRoyalty payments and cross-licensing agreements bring the tech giant an estimated $66 million per quarter. PC and notebook OEMs such as Dell and Toshiba pay Nvidia for the company’s GPUs.  \n\nBTW way Xbox is included here too",
                                          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8kr1hw/",
                                          "created": 1718371057,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l8ijh30",
                      "score": 4,
                      "body": "They are not licensing gpu's lol, they buy it form Nvidia and put it. Wth op, you don't even have basic knowledge do belong even in wsb",
                      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8ijh30/",
                      "created": 1718327555,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8ipjro",
                          "score": 0,
                          "body": "The do pay a license and royalty. Look it up",
                          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8ipjro/",
                          "created": 1718330118,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "l8jmqg9",
                      "score": 2,
                      "body": "No precisely not.\nIf you go to Nvidia you get a rectangular pice of silicone and some instructions what to connect to each pin to, for the chip to do its magic. You don't know how they do it.\n\nIf you go to ARM, they tell you *exactly* how to do it, and even help you customize it to your needs.",
                      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8jmqg9/",
                      "created": 1718347309,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8kpz4b",
                          "score": 0,
                          "body": "Lol you think Nvidia doesn't provide support and customization. Have you seen there presentations. I work with nvidia chips it's more than instructions it's an entire stack. Including the sdk and software.",
                          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8kpz4b/",
                          "created": 1718370626,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8kr7zr",
                              "score": 2,
                              "body": "Yea for USING it.\nGood luck dissecting a die with >200 Billion transistors in 3nm and reverse engineering it.\n\nThe sdk and reference board designs will not help you in any way.\n\nYou'd need am elctron microscope and probably more time than feasible and still you'd have the problem that nobody would manufacture that for you.",
                              "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8kr7zr/",
                              "created": 1718371129,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l8ks3zj",
                                  "score": -1,
                                  "body": "Nobody is saying that wtf are you talking about? It's an SoC everything is controllable through clock rates and sdk adjustments down to the memory. You have no clue wtf you're saying",
                                  "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8ks3zj/",
                                  "created": 1718371481,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l8kujrh",
                                      "score": 1,
                                      "body": "You are saying this: \"Can you imagine Nvidia OEM's saying fuck you nvidia thanks for the design?\"  \nExcept they dont ever get the design for the GPU, just for the boards so, great, now they make boards without Nividia-GPU and without any function. \n\nArm is different. You want a CPU, Arm license you the plans to build one or use just the cores and customize to your needs- like Apple did for their M-Series (or NVidia for *Grace*).   \nThey dont sell you the Silicone, but the IP to make it yourself. \n\nNividia does not do this.   \nYes they license \\*some\\* ip or have patent sharing agreements but not plans to their GPU as a whole.",
                                      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8kujrh/",
                                      "created": 1718372427,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l8lu97o",
                                          "score": 1,
                                          "body": "It's very closely related. Arm's cortex IP is pretty much all you need to get started and that IP while yes the OEM's in Arm's case is manufacturing the chip themselves it is similar to Nvidia in effect. (I have this main component so now I can build this thing over here). The main point I was simply making is that nobody would sit there and mess around with Nvidia in any capacity. I get your point but it is still a valid point that I am making. Why is Arm being punished for letting you own and create the chipset you want with the thanks of licensing disputes by an OEM that is crossing the line. I like QCOM don't get me wrong I am just responding to the original commentor's comment there is nothing ARM can do because they don't make the chip.\n\nAlso, and this is a tiny fractional example is that Xbox uses a completely customized Nvidia GPU chip. If others wanted to do it they could I just don't know what kings ransom they would have to pay Nvidia to do it. Clearly, Xbox did.",
                                          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8lu97o/",
                                          "created": 1718384750,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l8jucs9",
                      "score": 1,
                      "body": "[deleted]",
                      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8jucs9/",
                      "created": 1718352556,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8kpjwt",
                          "score": -1,
                          "body": "Son, I know more than your mama knows about your tiny wee and your bad breath",
                          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8kpjwt/",
                          "created": 1718370453,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l8jw48v",
          "score": 0,
          "body": "What you are saying is Qualcomm own the IP and ARM pretend to license out to everyone else. I don't think you understand how the industry works.",
          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8jw48v/",
          "created": 1718353827,
          "depth": 1,
          "replies": [
            {
              "id": "l8kjrp0",
              "score": 2,
              "body": "Funny enough since you couldn’t figure out what I was saying it’s pretty obvious you don’t.\n\nQualcomm licenses an instruction set from ARM. ARM also licenses implementations to people. Qualcomm has 263k patents spanning everything in mobile. Not only does ARM have an entire 5g product line (you can’t touch 5g without licensing Qualcomm patents) but the chances that their core implementations don’t step on a Qualcomm patent is pretty small as well.",
              "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8kjrp0/",
              "created": 1718367958,
              "depth": 2,
              "replies": [
                {
                  "id": "l8l3lus",
                  "score": 0,
                  "body": "Except they bought a company expecting their agreements to be transferred with it. That is the part you clearly couldn't figure out.",
                  "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8l3lus/",
                  "created": 1718375723,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8l6h06",
                      "score": 2,
                      "body": "You need to retake contract law.",
                      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8l6h06/",
                      "created": 1718376717,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8ldwt3",
                          "score": 0,
                          "body": "I don't need to re-take anything. That is how ARM operates.",
                          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8ldwt3/",
                          "created": 1718379245,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8gp3ss",
      "score": 7,
      "body": "Then calls on QCom or may be Arm?",
      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8gp3ss/",
      "created": 1718303382,
      "depth": 0,
      "replies": [
        {
          "id": "l8he6ef",
          "score": 2,
          "body": "or go long on both of them like me",
          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8he6ef/",
          "created": 1718311685,
          "depth": 1,
          "replies": [
            {
              "id": "l8il5ao",
              "score": 1,
              "body": "What, so this settles and one of them drops a little and the other fucking tanks.\n\nNice hedge brother 😎",
              "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8il5ao/",
              "created": 1718328267,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8ig69u",
      "score": 7,
      "body": "Qcom is arm’s top customer by revenue",
      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8ig69u/",
      "created": 1718326177,
      "depth": 0,
      "replies": [
        {
          "id": "l8il82r",
          "score": 5,
          "body": "It’ll be a fun don’t fuck with the golden ~~goose~~ five hundred pound gorilla lesson.",
          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8il82r/",
          "created": 1718328299,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8hdmqk",
      "score": 9,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8hdmqk/",
      "created": 1718311508,
      "depth": 0,
      "replies": [
        {
          "id": "l8hpnni",
          "score": 13,
          "body": "If the contract doesn’t have terms saying it’s a non-transferable contract then it’s just bullshit and ARM is trying to change contract and tax law.\n\nContracts that an entity have, by precedent, are assumed by the new owner.",
          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8hpnni/",
          "created": 1718315653,
          "depth": 1,
          "replies": [
            {
              "id": "l8i0dwq",
              "score": 9,
              "body": "Yep, this is what no one seems to understand. The fight by the lawyers will be “when is it actually being considered transferred”. \n\nBuying a company with the contract doesn’t actually transfer the contract. But nuvia selling off the contract itself to another company would be trying to transfer it. \n\nThose two points I’m betting is the real argument here.",
              "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8i0dwq/",
              "created": 1718319753,
              "depth": 2,
              "replies": [
                {
                  "id": "l8i1yln",
                  "score": 6,
                  "body": "Depends on what you mean by transferred.\n\nThe contract by default stays with the entity that entered into the contract so when that entity is purchased the owner now assumes the contract - so the contract would have to have terms that specifically terminated on certain conditions such as the entity ownership changing.\n\nARM trying to argue that whatever was developed by Nuvia under the contract couldn’t be transferred with the company is really sketchy without a lot of very specific language in it.\n\nTo me it looks like ARM getting butthurt about people with better processors than them. Suing those people because they have better shit is a straight up Intel type move.",
                  "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8i1yln/",
                  "created": 1718320370,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8iyu9e",
              "score": 1,
              "body": "So, it does not have the term \"non-transferable\"?",
              "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8iyu9e/",
              "created": 1718334145,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8hwf90",
          "score": 11,
          "body": "You have it the wrong way. QCOM acquires Nuvia, who had ALA with ARM which a much higher royalty rate because they were designing server chips and they are much smaller than a QCOM and can get slapped around by ARM. \n\nQCOM acquires them. QCOM already has a ALA with ARM for their mobile chips with a lower royalty to ARM. QCOM then asserts they will pay royalties under their existing ALA because it covers their chips and they are pivoting Nuvia tech from server to mobile.\n\nNow we are seeing the fruits of the acquisition with the imminent release of the new mobile chips. Frankly, I don’t see why QCOM should pay a higher royalty to ARM under the Nuvia agreement given these aren’t server chips, more of the same from QCOM, just expanding into what type of device they are in.",
          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8hwf90/",
          "created": 1718318217,
          "depth": 1,
          "replies": [
            {
              "id": "l8i118e",
              "score": 1,
              "body": "does it not depend on what chip it actually is and what the agreement with QCOM was?",
              "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8i118e/",
              "created": 1718320006,
              "depth": 2,
              "replies": [
                {
                  "id": "l8i20fp",
                  "score": 7,
                  "body": "That’s the argument, innit? \n\nQualcomm says no, it doesn’t matter because they already had an ALA that also covered server chips (remember, they briefly tried to enter the market before killing the effort) and, upon acquiring Nuvia, Nuvia essentially became Qualcomm so it’s all the same. \n\nARM says it does matter and they can’t use the technology Nuvia developed under their ALA pre-acquisition in their Snapdragon chips. \n\nAll I’ll say is that Qualcomm is one of the best, if not the best, companies at navigating IP rights, licenses, etc. Heck, they beat Apple…",
                  "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8i20fp/",
                  "created": 1718320391,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8i2pg3",
                      "score": -1,
                      "body": "Mossimo beat Apple. lol so...",
                      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8i2pg3/",
                      "created": 1718320667,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8i32fu",
                          "score": 11,
                          "body": "I know you’re being blasè but those two aren’t even in the same universe of litigation. Apple was essentially trying to kill Qualcomm by invalidating its most important patents.",
                          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8i32fu/",
                          "created": 1718320803,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8i40e5",
                              "score": -1,
                              "body": "Why does everybody dislike QCOM? Patent trolling gone wild. Interesting anyways. I hope they can just settle and resolve. Good for everyone",
                              "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8i40e5/",
                              "created": 1718321177,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l8i4c4n",
                                  "score": 8,
                                  "body": "Eh, that’s a common sentiment but a bit unfair. It’s not like they aren’t actually developing the technologies. They definitely are and pouring a ton into R&D. But then they have a stranglehold on the patents and aggressively license them. Other companies hate Qualcomm because they’re forced to use them. But as we’ve seen with Apple’s modem efforts for the iPhone, turns out it’s not easy to replicate what Qualcomm does. But in fairness to your point, they are super aggressive in enforcing their rights.",
                                  "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8i4c4n/",
                                  "created": 1718321307,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l8mecfe",
                                      "score": 1,
                                      "body": "Bosch operates the same business model and it leads to some stupid market inefficiencies (such as licensing be so exorbitantly high that there are several models of vehicles that have a Bosch controller that does absolutely nothing because it’s cheaper for the company who wants to use a specific sensor that Bosch patented in the application than to license the patent).\n\nMy issues with Qualcomm is that due to the expense of licensing specific items it’s almost impossible to develop optimized applications they aren’t interested in - for example ultra low power and highly integrated IoT. Most of the companies I’ve known in the space don’t care about the royalty but simply don’t have the ability to make the $100k or more one time fee so they have to dangle a tiny controller off the side of a gigantic modem rather than simply running their tiny app in the modem.",
                                      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8mecfe/",
                                      "created": 1718391579,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l8ijnc6",
          "score": 2,
          "body": "You have it wrong, arm extracted higher revenue if nuvia ever made it to servers. They don't like that Qualcomm is using Qualcomm license but using server cores without paying server license money",
          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8ijnc6/",
          "created": 1718327629,
          "depth": 1,
          "replies": [
            {
              "id": "l8kkcfr",
              "score": 2,
              "body": "Qualcomm’s older license covers all markets as they were also going to make a foray into enterprise but opted out as it wasn’t going well.",
              "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8kkcfr/",
              "created": 1718368217,
              "depth": 2,
              "replies": [
                {
                  "id": "l8l3l77",
                  "score": 1,
                  "body": "Yup exactly, this is just pure extortion from. ARM  for speaking against Nvidia merger",
                  "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8l3l77/",
                  "created": 1718375716,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8jwoui",
          "score": 0,
          "body": "No, you are not. ARM license to a specific company only. If said company is taken over the agreement can't be transferred.",
          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8jwoui/",
          "created": 1718354240,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8kc3yy",
      "score": 2,
      "body": "My AAPL calls like this.",
      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8kc3yy/",
      "created": 1718364251,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8jwknf",
      "score": 2,
      "body": "ARM are the ones that design the base and then license that out to everyone. NDVA, APPL, INTC, SMSN, AMD and, obviously, QCOM. All licensing ARM IP\n\nWhen they license ARM IP that agreement is between those two specific companies only. Nothing is transferable.",
      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8jwknf/",
      "created": 1718354156,
      "depth": 0,
      "replies": [
        {
          "id": "l8ks992",
          "score": 2,
          "body": "I agree what's your point",
          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8ks992/",
          "created": 1718371539,
          "depth": 1,
          "replies": [
            {
              "id": "l8l32vo",
              "score": 1,
              "body": "If you agree you should know what the point is. I wasn't arguing against you. I read some of the comments and decided a lot of people on here don't understand what goes on in licensing IP",
              "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8l32vo/",
              "created": 1718375536,
              "depth": 2,
              "replies": [
                {
                  "id": "l8l9kmv",
                  "score": 3,
                  "body": "Change of ownership of an entity doesn’t invalidate the contract that entity has unless there is very specific terms in the contract saying that change of ownership invalidates the contract.\n\nThe later would be highly unusual - a company founded as a startup with venture capital where the entire point is to be able to exit having a clause that terminates the product line if the company has a change of ownership event would have caused their lawyer to go apeshit.",
                  "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8l9kmv/",
                  "created": 1718377778,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8l95ur",
          "score": 2,
          "body": "There are two options - license the ISA (a 200ish page PDF) or license a core.\n\nApple, Qualcomm, etc license the ISA and design the cores themselves. The Supreme Court has all but invalidated copyrights on ISAs with their x86 ruling regarding Intel and AMD so if this case goes far enough you might see ARM’s ISA royalties disappear entirely.\n\nARM doesn’t like that Apple and Qualcomm are making better cores than they are. It puts a pall over their entire business of licensing developed cores to companies.",
          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/l8l95ur/",
          "created": 1718377637,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ltbjlrr",
      "score": 0,
      "body": "You appear to be mistaken. Qualcomm designs their own chips, they license the ISA from arm but do not use the off the shelf designs from arm. In fact you should read the article you linked. Arm wants Qualcomm to destroy Qualcomm designed chips. That would be a pretty ridiculous demand if Qualcomm did not have their own designs, wouldn't it?",
      "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/ltbjlrr/",
      "created": 1729679803,
      "depth": 0,
      "replies": [
        {
          "id": "ltc30rd",
          "score": 1,
          "body": "No they don't. Or it wouldn't be ARM",
          "permalink": "/r/wallstreetbets/comments/1df1v7w/someone_forgot_to_tell_qualcomm_they_dont_design/ltc30rd/",
          "created": 1729688633,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}