{
  "title": "Are NVIDIA employees likely to be millionaires now if they joined five or more years ago?",
  "score": 714,
  "selftext": "I’m trying to figure out the current value of NVIDIA stock options that were granted 5 years ago.\n\nAssuming someone joined NVIDIA and was given stock options worth $36,000 at that time (pretty standard of a sales person)..\n\nAnd considering all the stock splits that have occurred since then, including the most recent 10-for-1 split in 2024..\n\nHow much would those options be worth at today’s stock price?\n",
  "link_flair_text": null,
  "id": "1dfkwor",
  "num_comments": 350,
  "created_utc": 1718348992,
  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/",
  "comments": [
    {
      "id": "l8kxzhu",
      "score": 258,
      "body": "Got a friend that joined nvidia 6 years ago. Can verify he’s a millionaire easily along with most other engineers in the company that joined at that point. Easily multi millionaires.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kxzhu/",
      "created": 1718373707,
      "depth": 0,
      "replies": [
        {
          "id": "l8n2zjd",
          "score": 57,
          "body": "What's to stop all of them from quitting now that they are millionaires and can just live an easy life?  Thus completely tanking lots of their different departments from those wanting to retire and live their best life early.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8n2zjd/",
          "created": 1718400100,
          "depth": 1,
          "replies": [
            {
              "id": "l8n3las",
              "score": 136,
              "body": "Different threads I've read say the culture there is awesome. If you like what you do and are being compensated really well for it, why leave?",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8n3las/",
              "created": 1718400329,
              "depth": 2,
              "replies": [
                {
                  "id": "l8s03uz",
                  "score": 5,
                  "body": "Yea who wants to retire anyway",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8s03uz/",
                  "created": 1718487713,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8n46s2",
              "score": 51,
              "body": "A lot of them are FIRE guys but as others have said the culture is great but the hours are long. He said that he joined there was incentive to work 14 hour weeks but it’s a bit harder when you’re a multi millionaire before 30.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8n46s2/",
              "created": 1718400554,
              "depth": 2,
              "replies": [
                {
                  "id": "l8nzlgz",
                  "score": 22,
                  "body": "14 hour weeks? or days?",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8nzlgz/",
                  "created": 1718413779,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8nzznk",
                      "score": 19,
                      "body": "Days, my bad",
                      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8nzznk/",
                      "created": 1718413950,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l8qe8zp",
                      "score": 7,
                      "body": "That's all the hours they can get out of them now that they're multi-millionaires.",
                      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8qe8zp/",
                      "created": 1718464523,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l8n5c57",
              "score": 18,
              "body": "A lot of people who work engineering jobs enjoy the work, it keeps their minds busy. The rest enjoy making even more money.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8n5c57/",
              "created": 1718400993,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8oaz3t",
              "score": 15,
              "body": "Because they've piled on new RSU's on top of the ones that have already been cashed out. Most companies give out RSU's each year so they might have additional millions tied up in the next several years that they want to vest but they have to keep working otherwise they lose the grants. It's called golden handcuffs.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8oaz3t/",
              "created": 1718418894,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8uduv8",
              "score": 3,
              "body": "Because you don’t get to work at a company like nvidia with a mindset like that.  Imagine if everyone with an ounce of success just stopped and left people like you to take over?",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8uduv8/",
              "created": 1718534627,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8nvqvn",
              "score": 15,
              "body": "A million is not a lot in Silicon Valley. 3 million will maybe get you a crack house so I’m sure they’re all still working until they have 100 million. ",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8nvqvn/",
              "created": 1718412067,
              "depth": 2,
              "replies": [
                {
                  "id": "l8qh0eb",
                  "score": 16,
                  "body": "This is an exaggeration- $1 million is enough to buy a very basic house cash. $3 million you can actually get a very nice home in the Bay Area cash.",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8qh0eb/",
                  "created": 1718465718,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8rujsq",
              "score": 3,
              "body": "There’re are many reasons engineers will stay longer but let’s assume people did start leaving the most logical outcome is that the best engineers from competitors will fight to join Nvidia to get their turn on the gravy train. It’ll be the competitors that end up losing their best talent to Nvidia.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8rujsq/",
              "created": 1718485495,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l96sqqz",
              "score": 3,
              "body": "If you’re youngish and pulling hundreds of thousands at a job you like why quit. I want to retire early but if I was making that amount I’d stay on for a bit. There’s a big difference between 1-2 million and 5-10 million.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l96sqqz/",
              "created": 1718733762,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8jyfpe",
      "score": 1357,
      "body": "Simple calculation. If you were granted $100k in RSU 5 years ago, you would have got about 2700 stocks (or 27000 post split).\n\n27000 \\* 130 (today's price) = 3.5m. So yes, everybody who joined 5 years ago and kept their stock is a multi-millionnaire. Also, let's not forget that you receive more RSUs every year.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8jyfpe/",
      "created": 1718355498,
      "depth": 0,
      "replies": [
        {
          "id": "l8kun3e",
          "score": 508,
          "body": "Common financial advice is to sell stock from your company as soon as it vests, and put it into something else like an index, to limit risk. \n\nCurious how many Nvidia employees do that.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kun3e/",
          "created": 1718372462,
          "depth": 1,
          "replies": [
            {
              "id": "l8kwkvg",
              "score": 245,
              "body": "Probably a lot. I’ve been on a rocket ship and a lot sold right away and lived with massive amounts of regret.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kwkvg/",
              "created": 1718373190,
              "depth": 2,
              "replies": [
                {
                  "id": "l8o7ve7",
                  "score": 18,
                  "body": "This is entirely hindsight perspective. If you have stocks whether employee RSU or anything in ANY company, that's your asset. If \"you believed in it\" you could've bought it being in ANY company at all.\n\nInstead of NVDA, if you joined a crashing company, selling immediately upon vesting and invest it elsewhere - hell maybe even used that to buy NVDA instead - you would've looked like a genius. \n\nAt the end of the day, NVDA employee should not be subject to any more regrets than ANY investors who didn't all in and sell a bunch of other stocks to buy into NVDA instead. There's literally no practical difference.\n\nSome people also mistake tax implications. You pay INCOME tax regardless how much your RSU has changed from grant to vest, and those becomes post-tax money (stock). Your cost basis of the stocks is at the time of stock vesting, not grant price. So selling immediately (0 gains 0 tax) and investing elsewhere OR keep it in the company, assuming they make the same amount of gains afterwards create NO tax differences.",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8o7ve7/",
                  "created": 1718417473,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8ljipo",
                  "score": 67,
                  "body": "This is why I just sell partial holdings if I still have faith in the company. Like a rocket ship, but with staging. Still allows my portfolio to outperform the market on average. For example, I sold 10% of my NVDA after the split, and sold 20% of my BROS after it hit $40",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8ljipo/",
                  "created": 1718381141,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8m714x",
                      "score": 14,
                      "body": "And potentially underperform btw",
                      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8m714x/",
                      "created": 1718389083,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8m799j",
                          "score": 9,
                          "body": "And potentially underperform, yes",
                          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8m799j/",
                          "created": 1718389160,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8run99",
                              "score": 3,
                              "body": "It's smart to do it that way. NVDA's beta is only as low as it is because the company is contributing so heavily to overall market gains right now - but that doesn't mean it isn't an incredibly volatile security.",
                              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8run99/",
                              "created": 1718485532,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l8rvljp",
                                  "score": 2,
                                  "body": "Right. I'm in it for the long run, and I really don't see individual stocks as my main investment vehicle. I'm still 60% index funds, and 10% cash. The stocks mainly contribute to further index fund contributions.",
                                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8rvljp/",
                                  "created": 1718485907,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l8n7re6",
                      "score": 10,
                      "body": "I did that and my company stock is down 50%.",
                      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8n7re6/",
                      "created": 1718401924,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l8lm6i9",
                      "score": 9,
                      "body": "Smart. Wishing I would have done that with CELH now but still like it long term.",
                      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lm6i9/",
                      "created": 1718382039,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8lp7y6",
                          "score": 5,
                          "body": "It's also a method that stops working as well when you get to a higher tax bracket, but at that point, you may as well just sit in index funds.",
                          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lp7y6/",
                          "created": 1718383064,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l8l8h3y",
              "score": 49,
              "body": "I hedge by cashing out half of it every vesting period and leaving the other half in.  I’m not in tech, but our stock has grown and I like not having all my eggs in one basket.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8l8h3y/",
              "created": 1718377402,
              "depth": 2,
              "replies": [
                {
                  "id": "l8mb12k",
                  "score": 4,
                  "body": "50% is still a massive position fwiw. I would consider that still \"all eggs in one basket\" tbh",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8mb12k/",
                  "created": 1718390444,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8mj6p4",
                      "score": 26,
                      "body": "Sounds more like \"half of eggs in one basket\"",
                      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8mj6p4/",
                      "created": 1718393260,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l8mrcjw",
                      "score": 8,
                      "body": "50% of your portfolio would be a massive position but we also don’t know if this person has significant holdings outside of what they get from RSUs in their compensation. Lots of employees at these successful companies are also making a shitload of cash compensation and investing and saving that wisely so it’s possible that leaving 50% of your RSU compensation in company stock is not going to be 50% of your portfolio but it also is very possible that the growth of that stock outpaces any other investments you made in your portfolio so it ends up being 50% or even higher over time of your portfolio.\n\nI had extreme FOMO and was holding a ton of crypto at one point to where it was 75% of my portfolio and not very smart. It nosedived and I sold while I was still up a good amount but nowhere near the top. If I had held that same amount of crypto I sold for ~$40k it would be worth about $500k. I definitely regret not balancing out my portfolio when it was worth $180k and also regret balancing out my portfolio and eventually closing my position when it was worth $40k lol. The real answer is pretty much no matter what you can have regrets so be safe but also might as well keep some chips on the magic carpet ride if you can afford to and you are young. As long as you are ready to lose everything you have invested (for crypto) or in the case of a tech company like NVIDIA you probably don’t need to be ready to lose everything at a moments notice but be ready to have your holdings go down 50-75% and not be kicking yourself too much or having trouble affording rent or food",
                      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8mrcjw/",
                      "created": 1718396053,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l8lqqoe",
              "score": 19,
              "body": "They sell it when it vests because they're still exposed through all of their unvested shares. As the price kept climbing, they were getting refreshed grants and still had unvested portions of earlier grants. Even selling on vest you still retain a lot of exposure.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lqqoe/",
              "created": 1718383570,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8lw5sn",
              "score": 9,
              "body": "Yeah it's actually more risk than just owning an individual stock, it's also your source of income, which is a double whammy.  If the stock plunges you're also more likely to lose your job",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lw5sn/",
              "created": 1718385390,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8nplzm",
              "score": 5,
              "body": "That’s what I’ve done since I got a job with an ESP. Toss that shit immediately and take my 15% “bonus” and put it right into FXAIX. But it’s weird how many of my coworkers are just stockpiling shares of JUST our company. And we have been starved for work and had lay offs since I’ve started. There’s definitely gotta be some NVDA employees who have been waiting for this shit.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8nplzm/",
              "created": 1718409364,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8l2dzp",
              "score": 10,
              "body": "Surely a lower portion... sales people gotta know everyone wants the chips and theres a giant backlog",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8l2dzp/",
              "created": 1718375294,
              "depth": 2,
              "replies": [
                {
                  "id": "l8lfj0a",
                  "score": 8,
                  "body": "You would be surprised. Yes a lot are millionaires right now but the number that sold when it dropped to $130 or whatever is way higher than you would think.",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lfj0a/",
                  "created": 1718379792,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8myplt",
              "score": 2,
              "body": "I ignored that advice for every company I worked at and it worked out well for me, well enough that I retired around 40.\n\nIt helped that I maxed out my 401k/IRAs from when I got my first job. Those accounts are my safe retirement, holding company stock was a gamble I was willing to take. Even if my company stock went to zero, I'd still be able to retire comfortably at 62 with my regular retirement accounts. I also lived well below my means so even with the 401k, IRAs, and company stock, I was still investing a significant amount of post-tax money into investments.\n\nThere are two companies where I still have the stock and still sell some of it occasionally to fund my lifestyle. And there are two companies I worked for where the stock ended up being worthless.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8myplt/",
              "created": 1718398568,
              "depth": 2,
              "replies": [
                {
                  "id": "l8n4mj6",
                  "score": 3,
                  "body": "most of the public companies I have worked at have not been worth it over holding SPY",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8n4mj6/",
                  "created": 1718400720,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8lhf0w",
              "score": 2,
              "body": "So for me setting it to sell is a pain in the ass. So even if they wanted to there is a good chance some employees didnt manage to sell all of it.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lhf0w/",
              "created": 1718380427,
              "depth": 2,
              "replies": [
                {
                  "id": "l8lxgua",
                  "score": 2,
                  "body": "Not sure what your company is, but mine uses Merrill and is easy to trade. \n\nI normally retain a certain amount of company shares which have vested.",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lxgua/",
                  "created": 1718385832,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8lyg48",
                      "score": 2,
                      "body": "The problem is not that. \n\n\nRsu get deposited in US brokers and I'm in Europe. The process of making a cross Atlantic wire transfer is like a 1890 north pole expedition.",
                      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lyg48/",
                      "created": 1718386158,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l8kr6op",
          "score": 57,
          "body": "They would have withheld ~50% of the shares for taxes. So still multimillionaire but at closer to 2m",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kr6op/",
          "created": 1718371115,
          "depth": 1,
          "replies": [
            {
              "id": "l8kvkle",
              "score": 23,
              "body": "Most companies only withold at 22%, but realistically you’re right - with federal and state taxes at that scale, they probably paid anywhere from upper 30s - 40s ETR. OR the are sitting on very very large unrealized capital gains, which may help the burden a bit if they’ve just held after vest.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kvkle/",
              "created": 1718372814,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8le8ja",
              "score": 7,
              "body": "This is the truth. Vested shares are treated as income each year so NVDA employees have had massive tax bills the last couple of years. Shares are sold automatically to cover the taxes but it typically doesn’t cover the full bill.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8le8ja/",
              "created": 1718379356,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8l5m9o",
          "score": 3,
          "body": "Was $100k in RSUs typical for a new hire at NVDA? No idea.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8l5m9o/",
          "created": 1718376426,
          "depth": 1,
          "replies": [
            {
              "id": "l8l6sus",
              "score": 3,
              "body": "Don't work for nVidia, so I don't know. But it depends on your level. Principal/Architects can get more than that when joining.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8l6sus/",
              "created": 1718376828,
              "depth": 2,
              "replies": [
                {
                  "id": "l8ldkrc",
                  "score": 7,
                  "body": "OP in his question assumes $36,000 in RSUs. Based on that, the employee's RSUs would now be worth \\~$1.3 million - IF (big if) they didn't sell any along the way.",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8ldkrc/",
                  "created": 1718379130,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8kd4db",
          "score": 52,
          "body": "And no engineer is getting only 100k in RSU. Most engineers or anyone with a technical skill set was getting $250k plus in RSU with their new hire grants.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kd4db/",
          "created": 1718364778,
          "depth": 1,
          "replies": [
            {
              "id": "l8kjuai",
              "score": 170,
              "body": "NVIDIA has historically given very low stock grants compared to the likes of google/facebook, so even $100k is an overestimate for the average engineer. Check levels.fyi if you're curious.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kjuai/",
              "created": 1718367991,
              "depth": 2,
              "replies": [
                {
                  "id": "l8l6gcg",
                  "score": 16,
                  "body": "They do have a great employee stock purchase program though. Anyone who used that was also buying in at a 15% discount.",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8l6gcg/",
                  "created": 1718376710,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8loi94",
                      "score": 5,
                      "body": "Most all employee stock purchase programs are the same. 15% is a normal discount. Most people just dump the stock right away and pocket the difference.",
                      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8loi94/",
                      "created": 1718382822,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l8l662z",
                  "score": 5,
                  "body": "They have ESPP lookback though",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8l662z/",
                  "created": 1718376613,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8ltalw",
                  "score": 4,
                  "body": "Can confirm. Know someone that works there. The stock grants weren’t great.",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8ltalw/",
                  "created": 1718384423,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8lcm2b",
          "score": 10,
          "body": "$100k in RSUs is mostly for people higher up, not most employees.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lcm2b/",
          "created": 1718378805,
          "depth": 1,
          "replies": [
            {
              "id": "l8m7ivu",
              "score": 8,
              "body": "That's not true. Levels.fyi.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8m7ivu/",
              "created": 1718389252,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8ldttr",
          "score": 2,
          "body": "They are probably also getting paid pretty well, contributing to their 401Ks and saving on their own.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8ldttr/",
          "created": 1718379217,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8m1p7z",
          "score": 2,
          "body": "You're not counting the stocks that are sold on vest to offset taxes",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8m1p7z/",
          "created": 1718387260,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8mag7m",
          "score": 2,
          "body": "An intern who worked at with me at my company joined Nvidia right in 2018. She living it up.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8mag7m/",
          "created": 1718390245,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8nhdby",
          "score": 2,
          "body": "You receive more RSU’s if you are in an Employee Stock Purchase Plan(ESPP), but it’s not like you’re given 100k in stock every year. \n\nMaybe a startup that’s using funny money? If you are im at the wrong tech company. They gave me 40k in RSU’s but if I want more I gotta sign up for a percentage taken out my check up.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8nhdby/",
          "created": 1718405842,
          "depth": 1,
          "replies": [
            {
              "id": "l8okzx0",
              "score": 3,
              "body": "levels.fyi gives some insights on how much you company pays, including RSU.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8okzx0/",
              "created": 1718424020,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8jr038",
      "score": 298,
      "body": "Yes they are millionaires by now.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8jr038/",
      "created": 1718350175,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8jt24y",
      "score": 323,
      "body": "Yes that's actually one of the problems for them because their employees are already rich and don't need to work anymore.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8jt24y/",
      "created": 1718351624,
      "depth": 0,
      "replies": [
        {
          "id": "l8jykfp",
          "score": 179,
          "body": "You can always be more rich.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8jykfp/",
          "created": 1718355593,
          "depth": 1,
          "replies": [
            {
              "id": "l8k9ezk",
              "score": 59,
              "body": "Always a bigger boat",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8k9ezk/",
              "created": 1718362784,
              "depth": 2,
              "replies": [
                {
                  "id": "l8k9on0",
                  "score": 51,
                  "body": "Yup. A couple million at 30 seems like a lot but it’s not when you factor in health insurance if u fully retire, kids, a millionaire lifestyle.   That 400k lake house is already about a 4th of your money.",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8k9on0/",
                  "created": 1718362937,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8kbf5n",
                      "score": 78,
                      "body": "Where can you get a 400k lake house anymore? Budget $1 million nowadays.",
                      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kbf5n/",
                      "created": 1718363889,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8ki3rk",
                          "score": 35,
                          "body": "Right that is a laughably small number for a lake house.",
                          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8ki3rk/",
                          "created": 1718367194,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l8n66ea",
                          "score": 8,
                          "body": "Redditors seem to forget that there is life outside of big cities, and there are thousands and thousands of habitable lakes. $400k goes a very long way even in semi-rural America.",
                          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8n66ea/",
                          "created": 1718401313,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l8kf9is",
                          "score": 13,
                          "body": "Location location location.",
                          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kf9is/",
                          "created": 1718365842,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l8l9zy5",
                          "score": 2,
                          "body": "There’s a lake house? I’m just looking for a house lol",
                          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8l9zy5/",
                          "created": 1718377924,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "l8miqbj",
                      "score": 6,
                      "body": "The trick to actually building generational wealth in this kind of scenario is to avoid lifestyle creep. Just live as you normally would, and let your stock portfolio compound for decades.",
                      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8miqbj/",
                      "created": 1718393100,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l8lbvwz",
                      "score": 3,
                      "body": "Eh, if you invest it right you could probably live comfortably for the rest of your life.  At a 7% YoY return, you are looking at $140,000 per year.  Of course, market volatility could upend this, but long term it's doable.  Let say you put half in High Yield Savings Accounts, and half in the stock market to hedge; if your HYA gets 5% interest, you essentially make $50k per year on that.  \n\n\nI personally could retire off of that without issue.",
                      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lbvwz/",
                      "created": 1718378561,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l8kayqu",
                      "score": 7,
                      "body": "Health Insurance is only a problem in the US, if u take your couple million to Europe you can retire",
                      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kayqu/",
                      "created": 1718363643,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l8kllgx",
                      "score": 3,
                      "body": "Where can you buy a 400k lake house?",
                      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kllgx/",
                      "created": 1718368773,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8kr5tv",
                          "score": 9,
                          "body": "Minnesota has a lot at that price, especially around Lake Superior. Just don’t look at the weather they get in that area during the winter… or even in the spring/fall. You have like a 2 month window to actually enjoy it - assuming it isn’t raining during that window.",
                          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kr5tv/",
                          "created": 1718371105,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8lung5",
                              "score": 2,
                              "body": "Are you looking at 1 bedroom shacks on a lake in MN for $400k?",
                              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lung5/",
                              "created": 1718384884,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "l8kracb",
                          "score": 8,
                          "body": "Pretty sure u can buy Alabama with 400k.",
                          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kracb/",
                          "created": 1718371155,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l8kqamc",
                          "score": 2,
                          "body": "Costa Rica.",
                          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kqamc/",
                          "created": 1718370756,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l8khydf",
          "score": 25,
          "body": " Counterpoint: everyone is interested in applying to work for them now",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8khydf/",
          "created": 1718367123,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8l47k4",
          "score": 26,
          "body": "Nvidian here. To answer the original question: yes. But I also like my job, huge impact on the next decade. Early 30s and doubt I would retire early and start getting bored.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8l47k4/",
          "created": 1718375936,
          "depth": 1,
          "replies": [
            {
              "id": "l8l6szf",
              "score": 5,
              "body": "Do you ever feel anxious thinking the AI hype may come down and the stock will crash? Do you have a number you are willing to cash some of the stock out?",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8l6szf/",
              "created": 1718376829,
              "depth": 2,
              "replies": [
                {
                  "id": "l8l8kqp",
                  "score": 19,
                  "body": "Personally no; I’m just here to learn and grow. I previously worked at another FANG company so have a semi golden parachute. I have time on my side and no big expenses. I’m happy to be part of the mission. \n\nIt’s been right place right time for me, also a lot of luck and hard work.",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8l8kqp/",
                  "created": 1718377436,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8kfcuf",
          "score": 53,
          "body": "Recently watched a video that went into detail about this. Here are a few things I remember off the top of my head.\n\n•\t⁠Most people in these positions are experts in their field, super motivated and disciplined, strive to get better and better. So yes, now they're multimillionaires but they're not the type of people to just quit and retire in their 30s or 40s. If they leave, they're likely quitting to start something new or join another start up.\n\n•\t⁠Most of these tech companies are in expensive ass areas. NVIDIA for example is in the bay area which can fetch a few million dollars for a basic house. Maybe their stock options turned into $5 mil and then they buy a nice house for $4 mil, bought a new car, etc. Seems crazy for the average person in Ohio but I can see them running through it quickly after high taxes in California. \n\n•\t⁠Lifestyle inflation along with their personal networks. Sure you made $10 million, but that's a small fish in the big pond of silicon valley. Your coworker has $15 million. Your ex coworker at Google has $20 million. Your new neighbor in your multi million dollar neighborhood has $50 million and is your boss. Maybe you could move to Ohio and retire at 35 but if you're in that kind of situation to begin with I'm sure you're just even more motivated to keep working.\n\n•\t⁠These people also just like their jobs. You're not working at an insurance company making phone calls all day. You're working for THEE fastest growing company and making history. You have a great CEO and their company is built very well where you don't deal with 100 levels of management and if you have any seniority you're only a few levels away from talking/working with the CEO. I think he has like 50 direct reports or something like that (this is why they're so profitable and run so well). That's got to be an exciting work environment even if it's high demand.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kfcuf/",
          "created": 1718365887,
          "depth": 1,
          "replies": [
            {
              "id": "l8lae1t",
              "score": 5,
              "body": "Forgetting about the Tax man..... they are going to take a significant chunk of that money depending on long term vs short term + alternative minimum tax at that large of an income.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lae1t/",
              "created": 1718378057,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8kq8ky",
              "score": 21,
              "body": "I'm sorry but if you have 10 million dollars you can retire anywhere in the world and be more than comfortable. Yes, even bay area. That's 400k per year at a 4% withdraw rate.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kq8ky/",
              "created": 1718370733,
              "depth": 2,
              "replies": [
                {
                  "id": "l8kx6za",
                  "score": 18,
                  "body": "None of those points said you can’t retire on $10 million.",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kx6za/",
                  "created": 1718373416,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8lf78v",
          "score": 1,
          "body": "Not many employees have left either. You would assume that there would be a fair amount of retirements but that hasn’t been the case.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lf78v/",
          "created": 1718379680,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8k1zth",
      "score": 56,
      "body": "Espp alone would have made them Rich",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8k1zth/",
      "created": 1718358062,
      "depth": 0,
      "replies": [
        {
          "id": "l8kzxhn",
          "score": 29,
          "body": "And they get to buy with a two year look back. So they can still buy stock at the price two years ago.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kzxhn/",
          "created": 1718374413,
          "depth": 1,
          "replies": [
            {
              "id": "l8mlcux",
              "score": 15,
              "body": "It’s not a look back, rather the price is locked for 2 years. Ie buying at 2024 prices up to 2026. Still very very good for anyone who joined 2 years ago!",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8mlcux/",
              "created": 1718394018,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8l2dfn",
          "score": 8,
          "body": "IRS puts a 25k limit on it. It’s at 10x since 2022 right now, so max gain is about $225k.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8l2dfn/",
          "created": 1718375288,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8jpuja",
      "score": 219,
      "body": "Splits don't affect the stock's value\n\nYou would simply look at the percentage change since 5Y ago, which is 3480%. 36k * 34.8 = 1.25M",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8jpuja/",
      "created": 1718349385,
      "depth": 0,
      "replies": [
        {
          "id": "l8lfgag",
          "score": 13,
          "body": "Yes and no.\n\nThey don't change the intrinsic business value immediately, but they enormously improve liquidity and ability of small purchases hitting the ask to move the overall value up % wise.\n\nThere are also very important feedback loops where market prices actually begin to influence genuine fundamentals.  They did do a shelf offering for $10B last year which did seem very generous at the time (obviously same shares would raise even more today).\n\nHigh stock prices allows you raise debt more cheaply, to attract the best talent, gives you positive press, strengthens your brand, trust from strategic partners as well and sometimes even helps further cement your dominance or lead.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lfgag/",
          "created": 1718379766,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8kqf0r",
      "score": 61,
      "body": "a family friend has been working there, maybe for 20 years at this point? Anyway, he’s kind of an important senior guy, not a grunt developer, if you know what I mean. And, almost two years ago if not more, he sold some of his shares and bought a 17M house on the hills in the bay area for CASH.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kqf0r/",
      "created": 1718370805,
      "depth": 0,
      "replies": [
        {
          "id": "l8mq9o5",
          "score": 6,
          "body": "Wow.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8mq9o5/",
          "created": 1718395683,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8l9ba1",
      "score": 22,
      "body": "All I can say is, a friend of mine who works for Nvidia, and has been there for nearly 6 years recently bought a big estate home in Saratoga (one of the expensive areas within the Bay Area), and the rumor has it that it was a cash buy. He is a mid to senior level engineer. \nWell, for that matter, another friend of mine did the same in 2022, working for Tesla for 5-6 years. \nBay area is funny.\n\nPS: Even in 2016-17, the joining RSUs in both Nvidia and Tesla were around 300-400k for mid level engineering.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8l9ba1/",
      "created": 1718377689,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8m94ge",
      "score": 16,
      "body": "former Nvidia employee here. Yes.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8m94ge/",
      "created": 1718389795,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8jqbvr",
      "score": 116,
      "body": "Yes, nvidia struggles to keep their employees since most of them are rich because of the stocks. \n\nBut not because of stock splits, those don't affect total value at all",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8jqbvr/",
      "created": 1718349715,
      "depth": 0,
      "replies": [
        {
          "id": "l8k1cbp",
          "score": 50,
          "body": "And the other side of this as a tech employee is being hesitant to join a company at ATH stock grant prices. If you join when it’s inflated and then it goes and stays down for the next N years, you basically get underpaid by a huge percent.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8k1cbp/",
          "created": 1718357603,
          "depth": 1,
          "replies": [
            {
              "id": "l8ny8vy",
              "score": 2,
              "body": "This happened to me.  None of my options were ever worth a penny when they vested.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8ny8vy/",
              "created": 1718413180,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8jt3eb",
          "score": 16,
          "body": "I, too, would quit and enjoy my early retirement.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8jt3eb/",
          "created": 1718351648,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8jxfqe",
          "score": 8,
          "body": "Are there reports on that?",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8jxfqe/",
          "created": 1718354779,
          "depth": 1,
          "replies": [
            {
              "id": "l8jymqm",
              "score": 15,
              "body": "Yes any actual evidence of this or just internet bs?",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8jymqm/",
              "created": 1718355638,
              "depth": 2,
              "replies": [
                {
                  "id": "l8kpekd",
                  "score": 11,
                  "body": "It's one clickbait bs article from one of those sites like BusinessInsider now everyone on reddit is referencing it like its gospel lol, every tech company deals with appreciating stock and it's effects on employee morale, but to think there's as significant impact because of it is dumb",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kpekd/",
                  "created": 1718370391,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8lflc3",
          "score": 2,
          "body": "I don’t think this is true. Because the company typically refreshes RSU grants each year most employees have large sums of unvested shares. I think employees are sticking around to let more shares vest each quarter.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lflc3/",
          "created": 1718379814,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8kwugu",
          "score": 1,
          "body": "Source? I have heard a different story?",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kwugu/",
          "created": 1718373288,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8m5m97",
      "score": 11,
      "body": "I probably bought around 2k for 4 years straight. Sat in line waiting on a graphics card I couldn’t get ended up giving up my hope of building a gaming pc but still decided to buy intro he stock. Thought if people like me are dumb enough to wait in a line at 6am just to be told no it must be a good company",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8m5m97/",
      "created": 1718388598,
      "depth": 0,
      "replies": [
        {
          "id": "l8md53i",
          "score": 3,
          "body": "Smart. Very smart.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8md53i/",
          "created": 1718391170,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8k1513",
      "score": 62,
      "body": "Nvidian here. You forgot to consider ESPP 😄\n\nI always wonder what's the point of these posts?",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8k1513/",
      "created": 1718357456,
      "depth": 0,
      "replies": [
        {
          "id": "l8kbbt5",
          "score": 9,
          "body": "How do you like your job? Seems like a cool one to have!",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kbbt5/",
          "created": 1718363839,
          "depth": 1,
          "replies": [
            {
              "id": "l8kczw6",
              "score": 35,
              "body": "I have heard complaints from many people. Consider the stock is going high, management is going to take all the employees for granted. They would expect employees would work for 12 hours/day. Not to mention about focal part, your manager is going to look at your unvested RSUs for next year and probably be like \"oh well, this person already have lot for the next year so even if I give peanuts he is not going to leave the team\". You need to see other side of the grass.",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kczw6/",
              "created": 1718364714,
              "depth": 2,
              "replies": [
                {
                  "id": "l8kddux",
                  "score": 18,
                  "body": "Wow, yeah. Never even consider how the stock price might influence management’s actions. Hopefully they realize that without the employees the stock price would not be as high as it is today.",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kddux/",
                  "created": 1718364911,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8m1myt",
                      "score": 8,
                      "body": "I was just talking to a colleague about this yesterday, the more tied up you are with golden handcuffs the more management can outright shit on you and there's nothing you can do (HR won't care, and best case you get moved somewhere else in the company and those leaders are now weary of you going to HR on them).\n\nIf you get a really scummy VP above you (more and more common these days), they will happily lean on you hard (as mentioned above 12 hour days), knowing that you can't complain because that puts you on the top of their 'redundant' list and the first opportunity for RIF's you can say goodbye to those unvested options as you are walked out the door.",
                      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8m1myt/",
                      "created": 1718387239,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l8k2i4u",
          "score": 5,
          "body": "I envy you so much, I would cut my arm and leg off for a job at nvidia lol. Funnily enough felt the same years ago as well, so not due to stock price - I just want to build something that matters 😄",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8k2i4u/",
          "created": 1718358418,
          "depth": 1,
          "replies": [
            {
              "id": "l8k9351",
              "score": 14,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8k9351/",
              "created": 1718362597,
              "depth": 2,
              "replies": [
                {
                  "id": "l8ka86t",
                  "score": 10,
                  "body": "Yes it is pure luck. Funny thing, before joining Nvidia I was in the startup and while joining that startup I declined Nvidia offer. This startup which was one of the hottest startup in valley, had almost 80 percent porched from the Google and after going IPO everyone cursed that they should not have joined it.\n\nNow I could go on and crib that I shouldn't have declined Nvidia at that time.",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8ka86t/",
                  "created": 1718363241,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8m8dm1",
                      "score": 2,
                      "body": "What was the startup?",
                      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8m8dm1/",
                      "created": 1718389541,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l8k9m0j",
              "score": 3,
              "body": "Well it depends on your definition. Would you say the same thing for any other company or else why do you feel so special about Nvidia?",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8k9m0j/",
              "created": 1718362895,
              "depth": 2,
              "replies": [
                {
                  "id": "l8kbl4s",
                  "score": 7,
                  "body": "Parallel computing in general is an area of interest for me. Unfortunately I am stuck in this frontend hell, where lack of experience in other fields means only jobs I can find are still in frontend field.\n\nIn short, as soon as I used CUDA I was star struck, so to speak. Still haven't felt the same satisfaction I've felt when I was able to get k-means to work on CUDA instead of on CPU, imagine if I could contribute to the tech itself.",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kbl4s/",
                  "created": 1718363977,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8kd2vt",
      "score": 23,
      "body": "Idk man most people sell their stocks as they come in. Better to diversify.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kd2vt/",
      "created": 1718364756,
      "depth": 0,
      "replies": [
        {
          "id": "l8ld88j",
          "score": 6,
          "body": "Yeah. Not many people hold for five years.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8ld88j/",
          "created": 1718379012,
          "depth": 1,
          "replies": [
            {
              "id": "l8m5fq9",
              "score": 9,
              "body": "Ironically lazy people do. Today, laziness pays off. Hopefully they’re not too lazy to sell now though",
              "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8m5fq9/",
              "created": 1718388536,
              "depth": 2,
              "replies": [
                {
                  "id": "l8mpqm6",
                  "score": 6,
                  "body": "People forget that in 2021 crypto crashed and sent nvidia down more than 50%. Not many people held past that.",
                  "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8mpqm6/",
                  "created": 1718395505,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8lbi8r",
      "score": 11,
      "body": "Only if they didn't sell any of their RSUs, which most people do.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lbi8r/",
      "created": 1718378435,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8jvdh7",
      "score": 40,
      "body": "Imagine thinking they only got $36k it’s more like 150-200k and probably worth 5-10m by now",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8jvdh7/",
      "created": 1718353293,
      "depth": 0,
      "replies": [
        {
          "id": "l8kbghh",
          "score": 22,
          "body": "Typical salesperson probably didnt get 200k.",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kbghh/",
          "created": 1718363909,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8mrazu",
      "score": 8,
      "body": "My wife was offered a job back in 2016 but declined to stay home with our kids.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8mrazu/",
      "created": 1718396037,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mio6j",
      "score": 6,
      "body": "Another point to consider is the ESPP. 15% of the salary with a 15% discount AND a 2 year lookback discount is insane. Even now, Nvidia employees can get Nvidia stock for around 130$ just by putting 15% into the ESPP. A mid level engineer at Nvidia makes 100k in stock and 200k in base(using levels.fyi). If you put 15% in, you'd get 30,000 in shares at a 15% discount at their 2022 low, meaning you would get a buy price of 9.55. That would mean you'd end up with 3141 shares, which, in todays value, would give you 414,219, and this still something you can do NOW. That's literally more money than the actual salary you get paid.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8mio6j/",
      "created": 1718393080,
      "depth": 0,
      "replies": [
        {
          "id": "l8s7owx",
          "score": 3,
          "body": "No true, IRS limits ESPP contributions to 25k per year before the 15% discount. Same limit for every company...",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8s7owx/",
          "created": 1718490882,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8mlk0c",
      "score": 6,
      "body": "my uncle is no employee but he had a shiet ton invested from years ago. according to my dad he made at least $10million alone. so yes those longer term employees are probably stacked.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8mlk0c/",
      "created": 1718394087,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8n3gjh",
      "score": 6,
      "body": "My mum's friends bf is a senior account executive for Nvidia in the UK and works in securing contracts for them. Excluding stock payments he earned £210,000 ($266,000) in salary and bonuses and thinks he'll earn almost double that for this year. Most bonus payments in the UK at public companies come in stock payments because of the tax advantages it gives so he's almost certainly now a millionaire",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8n3gjh/",
      "created": 1718400279,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kq61g",
      "score": 11,
      "body": "I read somewhere that an estimated 1/3 of their employee is worth over 10 mil.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kq61g/",
      "created": 1718370704,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8l09yt",
      "score": 10,
      "body": "Yes, every single person I know is a millionaire at Nvidia. My uncle started 3 years ago at a senior level - multi millionaire.\n\nI have a friend who started in January. He’s damn near close to one.\n\n\nNothing gets better than our Californian economy baby ☺️",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8l09yt/",
      "created": 1718374540,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8n57cy",
      "score": 10,
      "body": "It’s so funny - NVIDIA was like a mid tier company at best in the valley for the longest time. Unless you really enjoyed working on GPUs other software engineers and whatnot that ended up there were not the best. \n\nI have a family friend who’s been working at NVIDIA for 20+ years. Cheapest guy I know who shared an apartment with his friends after his wife and kid moved back to their home country so she can go to med school. This is the kind of guy who’d spend weeks looking for a $10 discount on a vacuum cleaner.\n\nThat guy recently bought a $3m house in the Bay Area so my friends and I joke he must be worth like a $100m at this point if he’s willing to shell out $3m.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8n57cy/",
      "created": 1718400942,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8k0fg5",
      "score": 8,
      "body": "my colleague’s friend been working for 18 years there. millionaire now. he is still working there for passion",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8k0fg5/",
      "created": 1718356943,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kznn1",
      "score": 4,
      "body": "They are surrounded by people that are richer.\nThe competition and motivation grows because the employees see the giant piles of cash everywhere\nNvidia is a juiced up machine right now",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kznn1/",
      "created": 1718374315,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8n7ali",
      "score": 4,
      "body": "If I held on to it I would have 1 million in Nvidia right now. But I sold 3 years ago",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8n7ali/",
      "created": 1718401743,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ob3bq",
      "score": 6,
      "body": "Joined at the end of 2019, senior software engineer. Maxed out ESPP, never sold a share, it's sitting around \\~5 mill today.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8ob3bq/",
      "created": 1718418948,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8m9m62",
      "score": 3,
      "body": "Nvidia is so big that only millionaires work there.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8m9m62/",
      "created": 1718389960,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8n9x5s",
      "score": 3,
      "body": "An old roommate of mine did a small amount of work (intern or contractor or something for 6 months but they gave him stocks) for nvidia back in like 2007.  In 2012 they were worth $12k.  Just did the math and if he is still holding them they’re worth almost $5.3MM.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8n9x5s/",
      "created": 1718402778,
      "depth": 0,
      "replies": [
        {
          "id": "l8ovi9z",
          "score": 2,
          "body": "would bet he's not holding those",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8ovi9z/",
          "created": 1718430600,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8nj6bw",
      "score": 3,
      "body": "An old timer I met at the bar got stock options working at home depot and is a millionaire so I’m sure there is plenty of millionaires at invidia",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8nj6bw/",
      "created": 1718406606,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ke1xe",
      "score": 10,
      "body": "A junior engineer who joined 5 years ago is likely receiving more than $1 mil per year from his stocks package. So yes, many times over a millionaire. Being a single millionaire isn’t much in today’s money but being multimillionaire still is, though.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8ke1xe/",
      "created": 1718365248,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8lf21o",
      "score": 3,
      "body": "I would imagine if you're one of the top hottest tech companies to work for and you knew your $3/share stock 5 years ago today was gonna 10x sometime within 5 years you would be smart enough to pay out enough RSU shares to be barely worth it but not to the point you have entire swaths of your engineering teams retiring early because they just became millionaires within 2 years. \n\nNow the OG NVDA people who were in it 10+ years are definitely millionaires.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lf21o/",
      "created": 1718379632,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kp7d5",
      "score": 2,
      "body": "Depends on if they held them, lots of people sell as soon as their shares vest.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kp7d5/",
      "created": 1718370306,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8m1bpi",
      "score": 2,
      "body": "I know a girl who has been there for over a decade and never sold a single share. She is rich.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8m1bpi/",
      "created": 1718387134,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mvv9p",
      "score": 2,
      "body": "Stock splits don't increase wealth",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8mvv9p/",
      "created": 1718397592,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8off21",
      "score": 2,
      "body": "im new to stocks. i invest in voo and have 8 shares of IWF. Im really new to this but i also have 3 shares of Apple and just bought Nvidia. Is this bad and will my individual stocks effect mutual funds?",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8off21/",
      "created": 1718421015,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kiqsl",
      "score": 4,
      "body": "Yes, my dad would be one but he sold almost 100k of nvidia stock in 2019..",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kiqsl/",
      "created": 1718367492,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kp3ap",
      "score": 3,
      "body": "There was an E-Mail from Huang saying that the discipline of most employees dropped as lots of them wants to reduce hours. So yeah most of them are rich.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kp3ap/",
      "created": 1718370259,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8l74ah",
      "score": 3,
      "body": "The guy I know who worked at Nvidia since 1999 pays cash for everything: cars, houses, boats...",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8l74ah/",
      "created": 1718376937,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8lr9j1",
      "score": 3,
      "body": "They actually deserve it tbh.\nIt’s the most fair way of payment, monetarily rewarding your employees based on the growth of your company. I wish that was more common in Europe.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lr9j1/",
      "created": 1718383746,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kahk4",
      "score": 4,
      "body": "I'm dying to work for them.  Keep getting rejected without even a phone screen.  Two rejections in my inbox this AM!",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kahk4/",
      "created": 1718363387,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8lcmnn",
      "score": 2,
      "body": "This was an issue last year that started to make headlines. BLUF: Employees started to realize they were millionaires and then started getting lazy/complacent. \n\n[https://www.techradar.com/pro/nvidia-appears-to-have-a-major-problem-with-wealthy-middle-managers-who-do-barely-any-work-and-new-starters-arent-happy](https://www.techradar.com/pro/nvidia-appears-to-have-a-major-problem-with-wealthy-middle-managers-who-do-barely-any-work-and-new-starters-arent-happy)",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lcmnn/",
      "created": 1718378811,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8lmbmo",
      "score": 2,
      "body": "There was actually an article a few months back that said NVDA’s productivity was going down cause everyone who worked there was now a millionaire and didn’t have to worry about money as much so they did less work. 😂",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lmbmo/",
      "created": 1718382086,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8jttfz",
      "score": 2,
      "body": "yes. most tech companies give $100-400k signing bonus depending on new grad vs industry vet. then you get refreshers in that range as well depending on your level.\n\nwhy do you think saratoga median house price is $5 mil and los gatos is 4 mil? Santa clara overall is what 3 mil and houses have 80-90 people on day 1 open house on a sat and have 20-30 offers by wednesday.\n\nevery month, there's new tech ppl getting rich here from a start up or big company going up.\n\nCali is the world's 5th biggest economy as a stand alone state, then within the bay area, you have some of the worlds most profitable companies, lots of rich ppl here. millionaire isn't considered rich in the bay area. i know lots of millionaires who rent here with roommates\n\nday care costs like $30-40k a year for reference.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8jttfz/",
      "created": 1718352168,
      "depth": 0,
      "replies": [
        {
          "id": "l8kdsc2",
          "score": 3,
          "body": "Confirmed.  I owned a house in Saratoga. Fantastic area.  Visited Los Gatos almost every day, while looking at the Lamborghini dealership lol. \n\nSomeone knocked on my door asking to rent my house for 13k a month while I was living there!",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kdsc2/",
          "created": 1718365114,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8kya69",
      "score": 1,
      "body": "Yes ",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8kya69/",
      "created": 1718373815,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8lk78k",
      "score": 1,
      "body": "If they sell.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8lk78k/",
      "created": 1718381370,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8m4a5i",
      "score": 1,
      "body": "Most people don’t keep their stocks though.  People who are granted RSUs are told to sell right away, that’s the common wisdom.  Nobody had a crystal ball to look ahead 5 years at the growth.\n\nSo the odds of those multimillionaires existing is very low.  This is not a rampant problem,",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8m4a5i/",
      "created": 1718388136,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mdow7",
      "score": 1,
      "body": "I know of somebody who joined in 2000. I’m curious how well they are doing at this point",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8mdow7/",
      "created": 1718391357,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8meht5",
      "score": 1,
      "body": "Why does the split matter? Just look at appreciation.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8meht5/",
      "created": 1718391630,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ms1pd",
      "score": 1,
      "body": "Employees 5 years or more have been fully vested and have sold a large chunk of those grants. They do get new grants and probably kept a lot so they are still solid probably still millionaires. I think the employees who got hired right before the nvidia rip 2021 -early 2023 may be in the best position. Also  NVidia probably has an employee stock purchase program that they are making a killing on.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8ms1pd/",
      "created": 1718396290,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mv9f7",
      "score": 1,
      "body": "I hope they are. I started a new job 5 years ago with a company that gives RSUs. I sold my first distribution but have kept the rest and they are down 50%. 🫤",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8mv9f7/",
      "created": 1718397382,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mvmb5",
      "score": 1,
      "body": "Multi-millionaire. In 5 years it appreciated more than 3000%.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8mvmb5/",
      "created": 1718397506,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ncdif",
      "score": 1,
      "body": "I don't know but I wish I would of bought more",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8ncdif/",
      "created": 1718403772,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8nxaaz",
      "score": 1,
      "body": "Yes, and it's actually one of the problems they have in terms of productivity. Their CEO spoke about this recently. When all your talent becomes quite wealthy the motivation isn't quite there anymore. \n\nGreat problem to have I suppose.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8nxaaz/",
      "created": 1718412754,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8o9ybq",
      "score": 1,
      "body": "What’s the point?",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8o9ybq/",
      "created": 1718418424,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8oag4f",
      "score": 1,
      "body": "Nvidia employees probably start at $400K salaries, and live in neighborhoods where a pretty plain 2200sq ft house costs $3M.  So you think you scored big landing that sweet entry level job with Nvidia but you will need $600K in cold hard cash just for a down payment if you ever wanna own a home.  You cant compare these Cali tech salaries to normal towns.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8oag4f/",
      "created": 1718418649,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8odsyg",
      "score": 1,
      "body": "They don’t get stock option",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8odsyg/",
      "created": 1718420217,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ok4xw",
      "score": 1,
      "body": "Oh absolutely, one of my best friends has been at one of the integrated businesses, KLAC, he started in 2016, net worth way over a million now and he just started a regular job in maintenance. Like the teams of guys that keep those machines up for the wafer control. I'm sure it's even more insane at Nvidia since it has been the best performer but that entire sector, ASML, KLAC, Nvidia, then TSM would be the slow one but all these guys are linked and everyone who's working there that has had the ability to purchase stock, especially in a discount, just do the math, I'm honestly surprised they retain the talent they do. When you're 30 years old and you have over a million dollars. You start wondering why you're working so much I would think",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8ok4xw/",
      "created": 1718423536,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8op3qk",
      "score": 1,
      "body": "Yes i know a couple",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8op3qk/",
      "created": 1718426470,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8q929n",
      "score": 1,
      "body": "I think on an average a principal engineer in nvidia who has joined maybe 3-4 years ago is easily sitting on $10m of stock compensation (includes rsu and espp)",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8q929n/",
      "created": 1718462227,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8qd4f1",
      "score": 1,
      "body": "Probably, my uncle works at Zoom and he hit the jackpot during Covid",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8qd4f1/",
      "created": 1718464029,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8qi7v4",
      "score": 1,
      "body": "They’re valued at over 100 million each given NVIDIA’s market cap, so I hope they get 1% of that.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8qi7v4/",
      "created": 1718466233,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8rxcm4",
      "score": 1,
      "body": "Hypothetically how much would you Nvidia stock have to be to \n\nA) Sell it all\n\nB) Retire\n\nIt would be difficult not to sell at $3.5 million for me.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8rxcm4/",
      "created": 1718486600,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8rz1om",
      "score": 1,
      "body": "If it is like other tech companies, the employees receive RSUs for employee stocks. But they are awarded over 4 years which is typical. And each time they are awarded the taxes must be paid in cash or by selling shares… a lot of shares. Depending on position and awards, they would probably be millionaires if they HODL what they did receive!",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8rz1om/",
      "created": 1718487284,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8sa2wc",
      "score": 1,
      "body": "What are your all thoughts on leveraged options like NVDL? Buying call options specifically. If the general thought is NVIDIA will keep cruising upwards. Why not buy call options ATM on 2x leverage options instead of actual NVIDIA stock or options?",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8sa2wc/",
      "created": 1718491911,
      "depth": 0,
      "replies": [
        {
          "id": "l8skzar",
          "score": 2,
          "body": "How much up can it go? Its valuations is to high",
          "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8skzar/",
          "created": 1718496690,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8sz2gw",
      "score": 1,
      "body": "I was granted 3,500 RSUs at Tesla in 2010 when I started with the company, they granted over a 4yr period… I was 24 years old in 2014  and sold them all at $68 a share like a Fuc7ing Dumbass… \n\nWhen the roller coaster 🎢 started circa 2020 I was doing the math and physical cried when I realized what I’d done… \n\nSo yea, most of these 3-5yr Nvidia employees are millionaires… hopefully the early employees didn’t do what my dumbass did.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8sz2gw/",
      "created": 1718503104,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8trapo",
      "score": 1,
      "body": "You need to control your expenses to be a millionaire. Earnings alone won’t cut it.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8trapo/",
      "created": 1718518239,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8z1b0t",
      "score": 1,
      "body": "People who joined Nvidia for a long time already making banks before this AI bubble.\n\nMoney is mostly not a concern for them, for some or maybe most, they just love their job and to be a part of something big.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l8z1b0t/",
      "created": 1718611769,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l95ecl9",
      "score": 1,
      "body": "I thought the definition of millionaire is $1M income per year.",
      "permalink": "/r/stocks/comments/1dfkwor/are_nvidia_employees_likely_to_be_millionaires/l95ecl9/",
      "created": 1718716354,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "The post discusses the potential value of NVIDIA stock options granted five years ago.",
    "companies": [
      "NVIDIA"
    ],
    "tickers": [
      "NVDA"
    ],
    "main_ticker": [
      "NVDA"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "The user is analyzing the potential current value of NVIDIA stock options granted five years ago after stock splits.",
    "stock_recommendations": "The user is not recommending buying or selling any stocks.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": null,
    "sentiment_summary": "The post does not express a positive or negative sentiment specifically about buying or selling NVIDIA stock.",
    "sentiment": "neutral"
  }
}