{
  "title": "You don't understand AI hype",
  "score": 1664,
  "selftext": "I have been a lurker on WSB for some time *(ignore the account age)*, despite my lack of activity, and I’ve noticed a recent uptick in posts discussing AI hype and how it’s surely a bubble ready to pop. This is obviously due in large part to the recent NVDA explosion, but there’s more to consider.\n\nWhile you guys spend most of your time focused on the money and investments side of AI, I spend my time focused on the technology itself – and the beliefs that seem to emanate from it.\n\nLet’s look at NVDA. Right now, NVDA is making its mark on the world almost entirely due to its ability to produce and supply cutting edge GPUs for companies looking to fashion larger and larger clusters and have more compute than any reasonable person could possibly fathom. Surely, this ends at some point, right? Surely, the people in charge realize that they’ve built large enough GPU clusters *(never mind the hundreds of billions recently committed to building the largest datacenters on the planet by the likes of Google and Microsoft)* and Jensen stops getting orders. Surely, this ends.\n\nA lot of people have been comparing AI hype to the dot com bubble of the early 2000s, which seems to be a fair comparison on a surface level. However, this misses something so fundamentally different about AI today that it almost entirely invalidates it.\n\nWhether you think AI is real or a scam or a stochastic parrot or whatever, the people in charge *(Sam Altman, Elon Musk, Bill Gates, Sundar Pichai, Tim Cook, etc)* believe 100% that this is one of the final pieces of technology mankind will ever create. They believe that the first company that creates AGI *(artificial general intelligence – typically defined as an AI that can do any task as well as the average person)* will be the first company to create ASI *(artificial superintelligence – typically defined as an AI that is smarter than every single living human being put together)* and will end up deciding the future. And they believe this is going to happen in ten to fifteen years.\n\nIf this seems silly to you, I don’t blame you. Technology typically doesn’t move especially fast or change too much over short amounts of time. It’s not like a refrigerator purchased today is a wildly different beast than one purchased fifty years ago. Sure, it might be more efficient and have more room, but fundamentally it’s the same technology.\n\nThis is how life has been ever since the industrial revolution: a new technology is invented, distributed, and then refined over the next 50 years until it basically asymptotes.\n\nThat is not what is happening with AI, and it isn’t what is going to happen in the future. Progress is being made at a blistering rate. People who aren't constantly paying attention to every single development and published paper have no idea what's going on. They just wake up one day and go \"Oh wow look at that, AI can just make videos and music out of nowhere. This must be something that was developed overnight and is a magical thing that can only happen once or twice in my life. Any discussion about further development is silly and just hype!\"\n\nWhether you like it, believe it, or even choose to acknowledge it, AI isn’t in a hype bubble this time. It’s easy enough to look back at the last half-century and see AI’s previous bubble bursts, but those were due in large part to the technology itself being substandard. It’s hard to make ASI when your supercomputer has less computing power than the first iPhone in 2007. This is why today’s companies are pouring what seems like an unreasonable and unjustifiable amount of money into buying GPUs – and why they will continue to. Everyone has realized that compute is all you need.\n\nWhether or not this ends up making “god in a box” isn’t especially important. What is important is that the companies trying to do it aren’t going to stop anytime soon. The risk/reward on trying to build the final thing mankind will ever build is so astronomically skewed that it’s hardly even a consideration. The reward for success is so vast that it makes the cost of failure *(a few hundred billion dollars)* seem insignificant.\n\nI’m not trying to sell you on NVDA or MSFT or anything like that, I’m just trying to let you know what’s actually going on. You can’t sit there and say “I looked on the internet and saw a tech bubble from before I was born, that must mean this is the same thing!” because that makes you wrong. You fundamentally misunderstand what’s happening in tech right now if you think this is going to follow conventional patterns. This is a once in a lifetime event, and it might very well succeed.",
  "link_flair_text": "Discussion",
  "id": "1dfm87l",
  "num_comments": 1045,
  "created_utc": 1718354826,
  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/",
  "comments": [
    {
      "id": "l8jxid0",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8jxid0/",
      "created": 1718354830,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8k4fit",
      "score": 2185,
      "body": "I agree with the technical premise of this, but it’s still a bubble. \nDotcom bubble wasn’t wrong because the internet wasn’t a big deal, it happened because investors believed every company making a website and an online sales platform could grow infinitely. \n\nSo when this people are saying this is a bubble its not about AI not being a big deal its that every company is slapping AI into their product for marketing and investment purposes and people seem to respond with pouring money on them. \n\nNvidia is coming out of this on top because if you want to try and sell your self as a AI pioneer there is only one game in town to build it on.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k4fit/",
      "created": 1718359717,
      "depth": 0,
      "replies": [
        {
          "id": "l8k89jm",
          "score": 264,
          "body": "I wholeheartedly agree with what you said. \n\nI would add though that I think the \"bubble\" misunderstanding cuts both ways. Some people who agree that it's a bubble also seem to think the AI concept as a whole is a bubble, rather than just the shitty companies slapping \"AI\" on their shitty products.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k89jm/",
          "created": 1718362125,
          "depth": 1,
          "replies": [
            {
              "id": "l8kx2nr",
              "score": 100,
              "body": "AI as tech is the NOT the bubble.\n\nOverhype making \"AI\" seem like it's more than it actually is is what's creating a *speculative bubble.\"\n\nLike the infamous historical tulip example.\n\nThe tulip speculative bubble burst.\n\nBut tulips are still awesome and still a commodity.\n\nTulips didn't go extinct when the bubble burst. Just the hype that created the speculative bubble is what died.\n\nBubble burst =/= tech dying.\n\nFFs the btc bubble has burst more than once, and BTC is not going anywhere.",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kx2nr/",
              "created": 1718373371,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8k96qm",
              "score": 45,
              "body": "Exactly, I think  they should be referred to separately like tech hype and investment bubble.",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k96qm/",
              "created": 1718362654,
              "depth": 2,
              "replies": [
                {
                  "id": "l8l1mz8",
                  "score": 24,
                  "body": "Just because there are a lot of new pets.com stories in the making doesn't mean there aren't a few Amazons and Googles in the making, too.",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8l1mz8/",
                  "created": 1718375026,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8m857q",
                      "score": 9,
                      "body": "This is exactly correct. The hard part is figuring out which companies will be the ones to survive. You might as well be at the Roulette table.",
                      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8m857q/",
                      "created": 1718389463,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l8kq0zl",
              "score": 4,
              "body": "Yes this! The internet took off but not every company at the time could make a website build their business in a better way at the time mainly due to the building blocks not being in place. Invest in the companies that will be the building blocks that AI will stand on, the Googles of the AI world.",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kq0zl/",
              "created": 1718370647,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8pwzxg",
              "score": 3,
              "body": "Agree. For example, see tickers: MDB, BASE, AI",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8pwzxg/",
              "created": 1718456328,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8k5kno",
          "score": 205,
          "body": "This^. Bubble ≠ fake progress. Just overstated progress with extreme expectations",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k5kno/",
          "created": 1718360460,
          "depth": 1,
          "replies": [
            {
              "id": "l8kslt8",
              "score": 28,
              "body": "I forgot what the company was but recently a company unveiled their demo of the first AI software developer.  Basically, they input requirements and the AI wrote the software.  The demo was ripped apart as being mostly fake/curated.",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kslt8/",
              "created": 1718371673,
              "depth": 2,
              "replies": [
                {
                  "id": "l8kwint",
                  "score": 22,
                  "body": "Devin was the product and Cognition Labs is the company",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kwint/",
                  "created": 1718373167,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8lrqe9",
                  "score": 12,
                  "body": "I think the fact that there are so many overhypes like Rabbit for example (similar to crypto) makes this a bubble.\n\nThe big models are real and good, but they’re also crazy expensive meaning the profitability here is questionable.\n\nNot to even mention the legal issues. People are training on all sorts of data they shouldn’t. OpenAI is really bad about this. Notice they always say that they train on Reddit data, but they’re basically lying by omission by neglecting to mention all the scraped data they’re using that they don’t have permission for.",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8lrqe9/",
                  "created": 1718383903,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8kwjtx",
              "score": 66,
              "body": "Agreed.\n\nAI isn't very I yet.\n\nCalling it AI is disingenuous and inaccurate. And it scares dumb people that only know what AI is from movies like Terminator.\n\nCalling it something like \"virtual intelligence\"(term from Mass Effect for lower tier AI's that are limited) is a better and more accurate path. AGI as a distinction sucks. \n\nIn science, there's been a trend to overhype stuff to the public to make it seem more sci fi and \"cool.\" I feel like that's a huge reason why scientists aren't calling out the misuse of the term AI. They think it helps get people interested in science. Reality is it skews perceptions of what things actually are. And potentially creates distrust in science and scientists.\n\nCurrently, they're still predictive algorithms. Very clever and well flanged. But still not anything actually close to real AI.\n\nReal AI makes its own decisions. Has its own thoughts. Can synthesize something new from existing info. It can't presume, assume, deduce, or induce(as in inductive logic). Current so-called \"AI\" doesn't do any of that.\n\nWhat we have is a very advanced software that predicts the next logical thing based on training and parameters. And that cab dobalot of useful and crazy stuff. We take for granted how pattern based our thinking and a lot of reality is.\n\nCurrent AI matches and predicts patterns very very well(but still fucks up a lot too.) IQ testing is mostly pattern matching. But intelligence in humans is about a lot more than pattern matching abilities.\n\nCurrent \"AI\" can't invent or create. \n\nIt can only recycle what already exists.",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kwjtx/",
              "created": 1718373179,
              "depth": 2,
              "replies": [
                {
                  "id": "l8m0cdq",
                  "score": 7,
                  "body": "It can reveal connections not previously known, however.",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8m0cdq/",
                  "created": 1718386802,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8nhnnk",
                      "score": 6,
                      "body": "So like, it can show you new ways to look at the data, but it can’t “create” data.  As in, it’s only deducing probable connections of the information that we already have, not creating actual new information. That’s the big difference?",
                      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8nhnnk/",
                      "created": 1718405963,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8ohzhc",
                          "score": 8,
                          "body": "If we feed enough data of 1+1=3, then AI will say 1+1=3.",
                          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8ohzhc/",
                          "created": 1718422357,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "l8m0nd6",
                      "score": 5,
                      "body": "Fair enough, but that's still pattern matching, not synthesis.",
                      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8m0nd6/",
                      "created": 1718386905,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l8nezky",
                  "score": 11,
                  "body": "Personally I would like to rebrand ai to \"big linear algebra\"",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8nezky/",
                  "created": 1718404850,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8lkwzz",
              "score": 6,
              "body": "Lot of chatter these days from some leaders in the field that LLM progress has plateaued (or at least improvements are no longer exponential) and that LLMs have actually stifled progress toward AGI because they are a dead end. The energy directed toward cutting edge research is instead directed toward LLM commercialization.",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8lkwzz/",
              "created": 1718381610,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8kdv5s",
          "score": 25,
          "body": "Exactly. Bubbles become systemic problems when companies use lots of credit and their investments don’t deliver expected returns.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kdv5s/",
          "created": 1718365155,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8klj7y",
          "score": 23,
          "body": "Sure there's a bubble, but not all of it. The biggest companies in the world emerged from the dotcom boom. The dotcom bust just killed the phony ones.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8klj7y/",
          "created": 1718368746,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8kjj0d",
          "score": 55,
          "body": "And even if you’re looking at the Dot com bubble- the companies that you would have known to be the big players at the time— not Pets.com but Microsoft, IBM, ARM, Apple, etc, not only survived by massively thrived in the aftermath. When you zoom out long enough it becomes a different picture. \n\nThe equivalent would be random AI startups like Humane, Jasper, Synthesia, that got huge attention and funding earlier on, but have largely peaked now.\n\nWe’re not seeing a massive “buy anything that says they do AI” rush right now. We’re seeing mostly blue chips making very large and concentrated pushes for long term technology. Apple, Microsoft, Google, Amazon, Meta, etc. They’re not likely to vanish from a stock market crash.\n\nApple is a really good example to watch. Unlike Google or Meta, Apple has always been painfully slow to adopt, and super conservative with new products until they’re really sure. For them to be adopt AI this deeply across nearly all their platforms is a much bigger commitment than I think most people realize.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kjj0d/",
          "created": 1718367849,
          "depth": 1,
          "replies": [
            {
              "id": "l8kn8rv",
              "score": 16,
              "body": "Check out what happened to Cisco during the dot com bubble, their stock price has still not recovered.",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kn8rv/",
              "created": 1718369483,
              "depth": 2,
              "replies": [
                {
                  "id": "l8ksf9n",
                  "score": 19,
                  "body": "Yes, I agree that Cisco is a good example of what what not to do. It was insanely overpriced at its peak and its P/E was at 201 in march 2000, and price-to-free cash flow was 176x. No matter how you cut it, it was insanely overvalued. \n\nActually, Cisco reminds me a lot of TSLA at its peak, especially when its P/E was nearly 1400.",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8ksf9n/",
                  "created": 1718371603,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8kszp5",
                      "score": 19,
                      "body": "Yep, what is interesting this time around is that NVDA is reasonably priced by the usual metrics (forward PE) but the numbers are getting so large that there is a (seemingly) a limit to how much further they can go.\n\nIts fascinating to be in the middle of something like the current AI boom, with the benefit of hindsight everything seems so obvious but when you are in the middle its really hard to make accurate predictions.",
                      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kszp5/",
                      "created": 1718371822,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8l256v",
                          "score": 23,
                          "body": "Exactly. The stock price is pretty reasonable even based on CURRENT profit margins, unlike the way that TSLA and Cisco were based on future profit. \n\nWill TSLA really release a robot that will do everything from household chores to tutoring your kids in the next 5 years and take Tesla to $25 trillion, like Elon said yesterday? Maybe, but that’s a BIG FUCKING IF. \n\nNVDA is making those sales today, and I don’t see them slowing down, certainly not this year.",
                          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8l256v/",
                          "created": 1718375207,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8ls4m6",
                              "score": 8,
                              "body": "I don’t know. A lot of Nvidia sales are to companies burning cash with questionable revenue capabilities.\n\nI’m still not convinced current sales levels are actually sustainable until an end product people will pay huge money for exists. And once it does I suspect only one or two players will survive which will also naturally contract the market.",
                              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8ls4m6/",
                              "created": 1718384034,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l8l4sxv",
          "score": 7,
          "body": "Exactly this. With the dot-com bubble, Microsoft and Google remained, but a lot of small fishes died. That's the point of the bubble.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8l4sxv/",
          "created": 1718376144,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8kulrv",
          "score": 20,
          "body": "Indeed. The dotcom bubble didn't end the internet.\n\nThe AI bubble can pop without AI dead ending.\n\nThe AI *hype* bubble will pop.\n\nBut AI as tech will continue forward.\n\nThe pop will be caused by people realizing that so-called \"AI\" isn't very I. People will catch on that \"AI\" has a long way to go still to meet the current hype and sci-fi level expectations. \n\nThe tech itself will continue.\n\nBut the speculative bubble will not.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kulrv/",
          "created": 1718372448,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8l1c00",
          "score": 21,
          "body": "Exactly. This is what OP is fundamentally wrong. The technology itself will like prevail and impact us, but it can do so, even if AI stocks plummet like internet stocks did in the year 2000. \n\nAlso, OP gives me \"this time it's different vibes\" which in turn is a bubble redflag.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8l1c00/",
          "created": 1718374917,
          "depth": 1,
          "replies": [
            {
              "id": "l8l7t5i",
              "score": 4,
              "body": "\"Everyone has realized that compute is all you need.\" - It was right when i read this that I was sure OP is a complete fucking regard.",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8l7t5i/",
              "created": 1718377173,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8ksb1u",
          "score": 22,
          "body": "Its the gold rush and Nvidia is selling the shovels.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8ksb1u/",
          "created": 1718371557,
          "depth": 1,
          "replies": [
            {
              "id": "l8kzj36",
              "score": 21,
              "body": "It's the internet rush and Cisco is selling modems",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kzj36/",
              "created": 1718374270,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8l9g3p",
          "score": 10,
          "body": "It's still a bubble because one of two things has to happen:  \n  \nA. Someone achieves singularity, and by OPs own logic this transforms the industry and probably puts the one company to achieve it first on top.  Most likely your investments in other companies are relatively tanked.  \n  \nB. Progress slows.  Some limitation is reached and the industry stabilizes, and the market has to adjust accordingly.  \n  \nThe bubble is just a lottery.  Most likely a few huge winners and everyone else loses big.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8l9g3p/",
          "created": 1718377734,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8kn3qz",
          "score": 8,
          "body": "And it wasn't just the companies that falsely linked themselves to the internet that were overvalued at that time.\n\nLook at Cisco, during the dotcom bubble the stock got way overvalued based on the promise of the internet.    Cisco certainly hasn't gone away but the demand for their products and competition brought the stock price back down to earth and it still has never gotten back to its ATH from 2000.\n\nSeems like a pretty good analog for what could happen to NVDA - eventually the market will start to get saturated and the chip orders will slow and competition from other players will erode the fantastic margins that they currently have.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kn3qz/",
          "created": 1718369424,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8kw3i8",
          "score": 3,
          "body": "Would a gold rush be a more apt comparison? I think some of these contenders will strike gold (AGI) but many many more will only have dirt to show for their efforts.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kw3i8/",
          "created": 1718373011,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8ksg1y",
          "score": 6,
          "body": "The bubbles if we want to call them that are insane hype funding phases that do produce breakout companies that change the world",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8ksg1y/",
          "created": 1718371612,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8kzoie",
      "score": 110,
      "body": "I don’t usually post in r/wallstreetbets but enjoy reading the theses here. This one here is my cup of tea.\n\nI work in AI and ML since 2010, and have moved from Academia and Research to the Financial and Investment industries were my role predominantly is innovating processes using AI. \n\nThere are a few things I’ve noticed which should give a strong hint as to what might unfold short to medium term.\n\n1. Most of the clients are extremely reluctant to adopt Generative AI, citing legislation, liability, client privacy and so on. Jobs and tasks which take hours can be done in second but they chose not to. Out of 11 possible projects this year only 2 went through!\n\n2. A few other clients have started dipping their toes in LLM use, but vastly prefer off the shelf models instead of using custom ones. Companies like NVDA, MSFT, AMZN, digital ocean, Anthropic, Mistral, etc are the ones who will reap the immediate benefits from PaaS revenue when ML engineers use their APIs. \n\n3. GPUs are in extreme demand, instances which are needed have waiting queues and so on. I had to reserve with AWS an extortionate amount to keep a very large instance available. Whether that’s artificially inflated or not, I don’t know. However I have the suspicion that GPUs won’t be what will keep driving AI forward in the long term. Medium to short term, absolutely yes.\n\nNow, IMHO an AGI is not yet within grasp. It might be fairly soon when quantum computing becomes mainstream. Search and find who develops that technology, that would be my bet into who will achieve it, and who will mostly reap the benefits.\n\nFurthermore whereas Transformer based models have revolutionised the industry (and am I glad they did!) I doubt they are close to an AGI. But they did form the cornerstone and got everyone excited in AI. If you asked me five years ago if I ever though we’d see AGI in our lifetimes, back when deep learning was in its infancy I would have said probably not. Now I’m starting to change my mind.\n\nThe repercussions of long term AI (after the bubble bursts and the wind settles) are as you explained profound, not just to the markets but the human society as a whole. What’s interesting is that there are now moves to limit and control AI development from various different stakeholders; Governments and Legislators, those who own the Data (aka Financial Times, Reddit, etc) and of course Ethics committees. I’d be surprised if OpenAI and other similar companies get free reign to develop and do as they please in the near future anyway.\n\nSo the long term to AI/AGI isn’t just paved by technological progress, but by market, governmental and user adoption. Currently what I’m seeing is that industries which stand to benefit greatly from it, are very hesitant to adopt it.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kzoie/",
      "created": 1718374324,
      "depth": 0,
      "replies": [
        {
          "id": "l8mmueu",
          "score": 10,
          "body": "GET THIS COMMENT TO THE TOP",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8mmueu/",
          "created": 1718394522,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8otlgn",
          "score": 9,
          "body": "Yeah yeah yeah just tell me who to invest my life savings in",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8otlgn/",
          "created": 1718429358,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8k12gh",
      "score": 355,
      "body": "https://preview.redd.it/bw33fqlsai6d1.jpeg?width=558&format=pjpg&auto=webp&s=030dead03f3ce81ca631eed7d1834f7f91ebfb23",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k12gh/",
      "created": 1718357404,
      "depth": 0,
      "replies": [
        {
          "id": "l8l8zw6",
          "score": 57,
          "body": "AI mfs when the Butlerian Jihad begins",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8l8zw6/",
          "created": 1718377580,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8kso95",
          "score": 27,
          "body": "![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kso95/",
          "created": 1718371700,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8k8gn2",
      "score": 73,
      "body": "GPT can’t even count the number of r’s in strawberry",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k8gn2/",
      "created": 1718362239,
      "depth": 0,
      "replies": [
        {
          "id": "l8kcurh",
          "score": 41,
          "body": "I was curious to check the claim.\n\ngpt-3.5-turbo says 2\n\ngpt-4-turbo says 3\n\nllama2 (8 b) says 5\n\nllama3 (8 b) says 2",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kcurh/",
          "created": 1718364640,
          "depth": 1,
          "replies": [
            {
              "id": "l8kmau4",
              "score": 49,
              "body": "Ok but what’s the correct answer?",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kmau4/",
              "created": 1718369078,
              "depth": 2,
              "replies": [
                {
                  "id": "l8kqdsx",
                  "score": 9,
                  "body": "Question intself (I quoted part of the comment \"count the number of r’s in strawberry\") is ambiguous. LLM have to decide if we're talking about letters or sounds. But even then gpt3.5 says that there are 3 sounds of \"r\" in the strawberry. I also played with the format of the prompt and results depend on exact wording of the prompt.\n\n> Ok but what’s the correct answer?\n\nI don't know",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kqdsx/",
                  "created": 1718370791,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8lrwnm",
                      "score": 6,
                      "body": ">  But even then gpt3.5 says that there are 3 sounds of \"r\" in the strawberry. \n\nObviously GPT3.5 has the Goofy accent",
                      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8lrwnm/",
                      "created": 1718383960,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l8mvp69",
                      "score": 5,
                      "body": "Who ever was asked \"how many r's in strawberry\" and decided to count the sounds?",
                      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8mvp69/",
                      "created": 1718397533,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8jywli",
      "score": 239,
      "body": "Surely",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8jywli/",
      "created": 1718355840,
      "depth": 0,
      "replies": [
        {
          "id": "l8k5n0m",
          "score": 388,
          "body": "„This time it‘s different!“\n\n-Guy who changed „NFT & Crypto Expert“ to „AI Visionary“ on his LinkedIn two weeks ago",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k5n0m/",
          "created": 1718360501,
          "depth": 1,
          "replies": [
            {
              "id": "l8k8nki",
              "score": 28,
              "body": "What's next for our NFT expert?  Sky-Net enthusiast?",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k8nki/",
              "created": 1718362352,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8k9urw",
              "score": 30,
              "body": "Comments like these make me think the \"AI is a hype\" crowd is definitely wrong because I was never on the crypto hype train and especially NFTs just seem like a complete scam. AI on the other hand is an actual useful technology that is still in its infancy. And if you want to compare the hype around Nvidia to the dot com bubble go ahead but don't forget that while many of those internet companies had little to no value, the Internet itself - the actual technology - is now an integral part of life.",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k9urw/",
              "created": 1718363031,
              "depth": 2,
              "replies": [
                {
                  "id": "l8kdaq4",
                  "score": 47,
                  "body": ">don't forget that while many of those internet companies had little to no value, the Internet itself - the actual technology - is now an integral part of life.\n\n\nYou literally just agreed with most people who think this is a bubble.\n\n\nYes internet was a real big deal\n\n\nCisco, the shovel seller then, is yet to reach its peak hype valuation 25 years later.",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kdaq4/",
                  "created": 1718364867,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8kncud",
                      "score": 13,
                      "body": "And if you bought Amazon, Apple or Microsoft  at the height of the bubble it’d be a great investment.",
                      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kncud/",
                      "created": 1718369532,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8l037h",
                          "score": 21,
                          "body": "Microsoft took 15 years to reach 2000s bubble valuation lmao.\n\n\nThen it 8x since 2015.  \n\n\nApple plumeted 75%.\n\n\nJust because some companies didnt fail and recovered from the bubble it doesnt mean it was a good decision to invest in them just before it popped.\n\n\nDo you not feel pathetic using such dishonest arguments?",
                          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8l037h/",
                          "created": 1718374471,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8losyw",
                              "score": 11,
                              "body": "Just stop. The regards here are totally deluded and will not listen to logic.",
                              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8losyw/",
                              "created": 1718382923,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l8keytg",
                  "score": 52,
                  "body": "There's no way this is different than the dot com run.\n\nThe *exact* same thing is happening.  Let me point out some things that happened in dot com:\n\n-People saying \"this is different you don't understand\"\n\n-\"It's a revolution\"\n\n-People call you stupid if you say bubble\n\n-Lots of people say bubble\n\n-Lots of people say not a bubble \"it's the real deal\"\n\n-A growing number of people think a crash may be coming\n\n-anyone and everyone are tripping over themselves to get \"the investment of their lifetime\"\n\n-People are selling entire portfolios to concentrate it in one thing\n\n-people are aggressively buying shares with absolutely no regard for reasonable price - a bunch of idiots slap the ask every day\n\n-hearing about one company every single day and how it's the only thing you should own\n\n-other companies quick to use buzzwords to get investors involved\n\n-People aware it's a bubble but want to \"ride it anyways.\"\n\n-people cry and shit their pants if you say a certain stock will go down\n\n-S&P becomes heavily concentrated into one sector\n\nFor anyone that thinks this is different, I wish I could time-travel you back in front of a television in the late 90s, as some \"experts\" argue how you'd be stupid not to put all of your life savings in to CISCO and the internet.\n\nEDIT:.oh I almost forgot... a certain company with an eerily similar PE to NVDA lol",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8keytg/",
                  "created": 1718365697,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8lgk1y",
                      "score": 19,
                      "body": "This is spot on. \n\n\"you can lead a horse to water, but can't force it to drink\"\n\nThe dot com bubble was people seeing the possibility of what the Internet is now in 2024 but pushing todays valuations in the early 1990s. The crash was the realization that the projected valuation didn't reflect what was actually valued. \n\nExact thing is happening today with AI. Everyone is investing in the valuation of AI in 2050, not what it's worth today. \n\nThe right time to invest is after the AI crash. Find the companies that can financially stay around and wait for that nest egg to grow.",
                      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8lgk1y/",
                      "created": 1718380138,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l8lst7q",
                  "score": 3,
                  "body": "Look at some of the scammy stuff like rabbit that came out.\n\nLiterally same people who pulled crypto scams. It screams bubble. The tech is there and does cool stuff. The problem is what it does is nowhere near as cool as what the big boys are claiming. We are far from anything like a general intelligence.",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8lst7q/",
                  "created": 1718384262,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8mvd9c",
                  "score": 3,
                  "body": "It's useful for writing spam emails that get past filters. It's useful for making video game art worthless. That's all.",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8mvd9c/",
                  "created": 1718397419,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8nf613",
                  "score": 3,
                  "body": "The point of the AI bubble and the dot come bubble isn’t that the technology isn’t useful. It’s that the valuations of the companies are out of whack. So investing in them is not a good long term strategy. Everyone knows the internet is integral to day to day life. But it was a financial bubble and people who went all in on internet companies could post loss porn that would have you jizzing before you had finished looking at the graph.",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8nf613/",
                  "created": 1718404924,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8k71ug",
          "score": 8,
          "body": "Perchance",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k71ug/",
          "created": 1718361395,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8k4o9s",
      "score": 283,
      "body": "Did you just escape from r/singularity? We gotta lock you up again if your episodes are coming back.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k4o9s/",
      "created": 1718359879,
      "depth": 0,
      "replies": [
        {
          "id": "l8kddgq",
          "score": 21,
          "body": "Sorry OP's from my basement. I need to catch this hype weasel before it slips out of my hand, that slippery little excitable fucker, don't mind him",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kddgq/",
          "created": 1718364906,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8k1vzx",
      "score": 274,
      "body": "AI interest itself moves in waves. \n\nhttps://en.m.wikipedia.org/wiki/AI_winter\n\nWe are definitely in heavy growth mode right now and will probably remain in it for the next year or so.\n\nBut the challenges will start when big companies who’ve invested lots of money start to seek a return on their investment and struggle to do so. After that happens, the funding and research will dry up.\n\nI witnessed the same sort of cycle with “big data” at various Fortune 500 companies. ",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k1vzx/",
      "created": 1718357989,
      "depth": 0,
      "replies": [
        {
          "id": "l8k3x0t",
          "score": 104,
          "body": "You’re spot on, the big data bubble eventually popped too. It’s was just the latest scam. Then it was blockchain, then it was Web 3.0, etc.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k3x0t/",
          "created": 1718359376,
          "depth": 1,
          "replies": [
            {
              "id": "l8kk11a",
              "score": 17,
              "body": "What's web 3.0?",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kk11a/",
              "created": 1718368075,
              "depth": 2,
              "replies": [
                {
                  "id": "l8knzfq",
                  "score": 25,
                  "body": "Web 3.0 = Blockchain+Decentralization+Token-based Economy\n\nIn layman terms, people who tell you Web 3.0 is the future can fuck you thrice, as opposed to Web 2.0 where you only get fucked twice\n\nBut jokes aside, Web3's goals are a farce because it'll inevitably revert back to Web 2.0. People keep talking about decentralization and shit but end of the day market determines the demand and price. Btc didn't reach the current valuation from regards trading each other, it came from banks and big money pumping it and regards setting their ask higher and higher while even bigger regards fomo and decide to pay the ask premium. Decentralization is impossible because they aren't mutually exclusive, both crypto and dollar can exist and valuate each other. So the end result is Web 3.0 being nothing but a buzzword.",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8knzfq/",
                  "created": 1718369795,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8kldyx",
                  "score": 34,
                  "body": ">it's a whole new kind of internet!\n\n\nMorgan Freeman: it wasn't though...",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kldyx/",
                  "created": 1718368682,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8kzpkt",
              "score": 4,
              "body": "I saw when the blockchain one died. They laid off the whole team working on that.",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kzpkt/",
              "created": 1718374334,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8l1m52",
              "score": 6,
              "body": "Don't forget about NFTs for a couple of weeks ",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8l1m52/",
              "created": 1718375017,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8k4kam",
      "score": 127,
      "body": "Ok you work with its technology day by day but can you give one specific example of how the progress you see makes you think AGI is close?\n\nThat would help me understand your point, because so far your post looks like a very elaborated “trust me bro”",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k4kam/",
      "created": 1718359806,
      "depth": 0,
      "replies": [
        {
          "id": "l8k9spa",
          "score": 79,
          "body": "Trust him bro, he works with technology",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k9spa/",
          "created": 1718362999,
          "depth": 1,
          "replies": [
            {
              "id": "l8kc2rx",
              "score": 26,
              "body": "Cut him some slack guys, it’s not OP’s fault he won the chromosome bingo at a young age. \n\nBesides, he works with technology.",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kc2rx/",
              "created": 1718364233,
              "depth": 2,
              "replies": [
                {
                  "id": "l8knrrh",
                  "score": 24,
                  "body": "\"Works with the technology\" = owns a ChatGPT account",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8knrrh/",
                  "created": 1718369705,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8lsf0f",
                      "score": 3,
                      "body": "Give the guy some credit he probably installs the self check out kiosks at McDonald’s.",
                      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8lsf0f/",
                      "created": 1718384130,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l8l7fnq",
          "score": 13,
          "body": "I know right? I know the technology, the only progress we have on LLMs is bigger data and more compute. Essentially, NO other enhancements are being made to models. How is this innovation or improvement?\n\nJust because the LLMs are trained on more tokens, doesn’t mean we are even an inch closer to AGI. I actually have the opposite opinion that once the reality sets in, markets go boom.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8l7fnq/",
          "created": 1718377045,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8kcej6",
          "score": 35,
          "body": "Exactly.  People caught up with LLMs and a simple algorithm used to create the neural networks and trying to talk about AGI.  They don’t quite understand the leap required.  All of the gpus in the world would barely equate to the neurons a single human brain possesses.  So many people impressed with Apples bullshit presentation of nothing. They are adding ChatGPT capabilities to the iPhone and they went berserk buying the stock. Such a fucking joke. Talk about snake oil salesman type shit.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kcej6/",
          "created": 1718364406,
          "depth": 1,
          "replies": [
            {
              "id": "l8ly4v4",
              "score": 6,
              "body": "Yes and no, Sora is an example of world understanding that an LLM can achieve, it has an understanding of dynamics and physics in its latent that is impressive. Once they find a linear alternative, maybe some kind of MAMBA variant, that shit will explode again because they can scale that shit further and further.",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8ly4v4/",
              "created": 1718386054,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8k0cqz",
      "score": 182,
      "body": "Just buy  NVDA imagine how they explode when they cut the rates \\*l![img](emote|t5_2th52|51295)",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k0cqz/",
      "created": 1718356888,
      "depth": 0,
      "replies": [
        {
          "id": "l8kf5sv",
          "score": 29,
          "body": "From 47 rate cuts this year to none. Bullish NVDA 300 EOY ![img](emote|t5_2th52|4276)",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kf5sv/",
          "created": 1718365792,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8k50v4",
          "score": 55,
          "body": "Ive had great gains these 2 weeks and ill hold till this puppy its 1000 again",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k50v4/",
          "created": 1718360110,
          "depth": 1,
          "replies": [
            {
              "id": "l8k97s4",
              "score": 113,
              "body": "NVDA at $1000 would have a market cap of $24.6T. The GDP of the US is $25.44T.",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k97s4/",
              "created": 1718362670,
              "depth": 2,
              "replies": [
                {
                  "id": "l8kcmts",
                  "score": 162,
                  "body": "So puts on the GDP",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kcmts/",
                  "created": 1718364527,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8kcnuv",
                  "score": 31,
                  "body": "This is a world economy.",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kcnuv/",
                  "created": 1718364541,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8khuhe",
                      "score": 45,
                      "body": "Global GDP is $100T. NVDA having a quarter of that is totally reasonable.",
                      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8khuhe/",
                      "created": 1718367072,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8kly44",
                          "score": 12,
                          "body": "GDP =/= Market cap",
                          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kly44/",
                          "created": 1718368927,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l8kiqm1",
                          "score": 17,
                          "body": "You’re under the illusion that governments across the world are going to stop printing money. Like the market, GDP only goes up over time.",
                          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kiqm1/",
                          "created": 1718367490,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8kj5ev",
                              "score": 5,
                              "body": "Nope, I have no illusions about that. World GDP will definitely 10x, but not in the next 5 years. Maybe in 30 years.",
                              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kj5ev/",
                              "created": 1718367680,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l8kl5ij",
                                  "score": 9,
                                  "body": "10 or less. Governments need inflation dollars to service debt.",
                                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kl5ij/",
                                  "created": 1718368578,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l8ks71y",
                  "score": 5,
                  "body": "Why do people compare company market caps with GDP (which is essentially a measure of cash-flow)? It's not the case that GDP being $25T means that everything in the economy needs to add up to $25T.",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8ks71y/",
                  "created": 1718371515,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8kbdib",
                  "score": 3,
                  "body": "free",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kbdib/",
                  "created": 1718363864,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8k9qh0",
                  "score": 13,
                  "body": "We’re getting near the top.",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k9qh0/",
                  "created": 1718362966,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8km4hi",
                      "score": 13,
                      "body": "This has been said since $400",
                      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8km4hi/",
                      "created": 1718369002,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8ksn5c",
                          "score": 5,
                          "body": "Really feels different now. Expectations are astronomical, but you can now readily buy H100s on the secondary market for ten to fifteen K less than six months ago. I know, I know - demand is sliding due to the new chip coming out - but NVDA’s earning expectations are designed around a regime of nearly infinite inelastic demand, where I wouldn't expect a new generation on the horizon to make much of a difference.\n\nI’ve never bought puts on NVDA, and I’m considering it in the next six months if the secondary market price keeps falling.",
                          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8ksn5c/",
                          "created": 1718371688,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l8k8ggf",
          "score": 10,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k8ggf/",
          "created": 1718362236,
          "depth": 1,
          "replies": [
            {
              "id": "l8k9njv",
              "score": 17,
              "body": "You can't priced in the retailers hope![img](emote|t5_2th52|27189)",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k9njv/",
              "created": 1718362920,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8k9ws3",
      "score": 53,
      "body": "I asked Gemini on my phone what would make the current AI bubble pop? Its reply below:\n\nThe AI bubble refers to a period of inflated enthusiasm and investment in AI startups. It will burst if:\n\n * Unsustainable projects:  Many AI startups are working on projects that may not have a clear path to profitability or real-world application. If these projects fail to deliver, investors may lose confidence in the entire AI sector.\n\n * Overblown expectations:  AI has been hailed as a revolutionary technology, but it's important to remember that it's still under development. If AI fails to live up to the hype, it could lead to a correction in investor sentiment.\n\nI guess this confirms that current \"AI\" is smarter than OP.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k9ws3/",
      "created": 1718363062,
      "depth": 0,
      "replies": [
        {
          "id": "l8mz7qy",
          "score": 10,
          "body": "That is a low threshold to judge against.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8mz7qy/",
          "created": 1718398742,
          "depth": 1,
          "replies": [
            {
              "id": "l8ndjx3",
              "score": 3,
              "body": "But that means that AI can come up with DD that is better than something on the front page of /r/WSB! Now all we need to do is get AI to regardedly defend its claims in the comments and we can get off this Godforsaken website and let the bots take over.",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8ndjx3/",
              "created": 1718404257,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8kc4f2",
      "score": 47,
      "body": "Dude how out of the money are your calls?!",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kc4f2/",
      "created": 1718364258,
      "depth": 0,
      "replies": [
        {
          "id": "l8lcq4z",
          "score": 16,
          "body": "Bros prolly sitting on $250 calls for next week![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|8883)",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8lcq4z/",
          "created": 1718378844,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8kgx47",
      "score": 25,
      "body": "People really suck at seeing into the future.\n\nWhen the internet was coming around nobody was thinking about the implications.\n\nAbsolutely nobody said social media will ruin people.\n\nPeople were thinking it would fix the spread of misinformation.  LOL\n\nPeople thought you'd have more free time as the internet makes so much more efficiency left and right.  Look around. We have *less* free time.\n\nThe thing is we know AI will be huge.  We cannot begin to predict how it will affect us though.  Just as many of us ignore Facebook and long for days before social media... it's likely AI will have similar impacts we can't see coming.  Maybe it causes a generation to be depressed.  Maybe people feel unsuccessful and can't buy homes.  Maybe people feel like jobs are stupid and pointless.  Maybe wealth will just concentrate into the hands of the few.  Maybe it ends up not being all sunshine and rainbows.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kgx47/",
      "created": 1718366637,
      "depth": 0,
      "replies": [
        {
          "id": "l8lx8y2",
          "score": 8,
          "body": "I agree with you but nobody is pursuing AI to make it all sunshine and rainbows.  Corporations are pursuing AI to become immensely rich.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8lx8y2/",
          "created": 1718385758,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8k1nb1",
      "score": 130,
      "body": "There are bathwater in plastic bag sold for more than some of your entire portfolios worth\n\nReality has nothing to do with stock price cuz people are fucking insane\n\nIn a more serious analysis, your mistake was to believe that the current hardware technology is anywhere near enough to create AGI or SGI\n\nTransistor computer is reaching it's quantum limit (can't get any smaller or normal physics break), yet thousands of GPU racks still aren't able to emulate human brain, an object 1000times smaller that consume a fraction of energy.\n\nTransistor computer is a deadend technology for the purpose of creating AGI, let alone ASI, and that will be the limit of current AI boom.\n\nUnless quantum computing or biological computing become mainstream, AGI simply cannot be used efficiently even if we somehow manage to create it with current technology\n\nAnd even if we get ASI, the market will still crash anyway cuz you bought call",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k1nb1/",
      "created": 1718357819,
      "depth": 0,
      "replies": [
        {
          "id": "l8k770b",
          "score": 76,
          "body": "You absolute FOOL.  Didn’t you read??? Op CORRECTLY points out that every major company is investing in this tech, and that it’s the last tech EVER!!! Therefore it is not a bubble.  This has NEVER happened before.\n\n“Quantum limit”?  Get your science the FUCK out of here. There is no way any technology could fail with this much buy in!!!  BILL GATES.  \n\nWhat..? Crypto bubble? not the same.  .com bubble?? Surely that’s different for a reason op didn’t get into… he had so much more to say about how Fucking RAD it’s gonna be when I can have my robot maid jerk me off while it makes custom Cheeto dust for my snacks.\n\nYou just don’t understand when we get AGI that company will make artificial SUPER intelligence. It’s so simple.  SUPER INTELLIGENT!!!!!!\n\n/s\n\nOn a serious note.  This is well said.  As someone who has watched the machine learning field closely over the last 15 years I am just not THAT impressed by these new algos. My first exposure to machine learning in 2011 was likely just as jaw dropping as op finding out he can LARP as someone with entry level talent or even half a brain.\n\nThe curve FEELS Logarithmic to me… this dude is all in on unlimited exponential growth.  Absolute degen worthy of this sub… to be sure.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k770b/",
          "created": 1718361483,
          "depth": 1,
          "replies": [
            {
              "id": "l8k770v",
              "score": 25,
              "body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k770v/",
              "created": 1718361483,
              "depth": 2,
              "replies": [
                {
                  "id": "l8k7tyl",
                  "score": 17,
                  "body": "I'm wondering how this bot works",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k7tyl/",
                  "created": 1718361870,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8kl8lu",
                      "score": 9,
                      "body": "I think it really does use some AI (LLM) behind the scenes. Because simply removing/adding words doesn't seem to trigger it anymore. Here's a snippet I found to work:\n\n> encourages borrowing stopping. inflation, and interest rates have big impact on (therefore vice versa).\n\nSo it probably looks for \"smart\" sounding sentences (or where someone is trying to sound smart, so sarcasm applies as well)",
                      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kl8lu/",
                      "created": 1718368617,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8kl8mj",
                          "score": 11,
                          "body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kl8mj/",
                          "created": 1718368617,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l8n3sd2",
                          "score": 3,
                          "body": "Lol, love how you analysed this. The snippet doesn't even make sense, indicating that you did a lot of trial and error? 😂",
                          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8n3sd2/",
                          "created": 1718400402,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8ks6fu",
      "score": 14,
      "body": "Unless companies start to show how they can make AI profitable, rather then losing money, this is going to peter out. \n\nDont get me wrong, AI will be everywhere, but it is upto whomever comes up with a successful business model for this trend to stick. Otherwise, massive investments and nothing to show for it... that cannot be sustained.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8ks6fu/",
      "created": 1718371508,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8jz6ac",
      "score": 174,
      "body": "I mean AI is very cool and it's already making me be much more productive. A lot of stuff I spent hours on can be done in minutes so its all cool.\n\nI get why there's a hype on AI right now. It makes sence.\n\nAI porn is gonna be wild you will be able to take a picture of anyone and just make it to a full on porno. If that is not the peak of technology I don't know what is.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8jz6ac/",
      "created": 1718356035,
      "depth": 0,
      "replies": [
        {
          "id": "l8k6692",
          "score": 102,
          "body": "Porn made VCR big. Porn made phone screens big. Porn makes my willy big.\n\nThere's nothing porn can't make big it seems.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k6692/",
          "created": 1718360841,
          "depth": 1,
          "replies": [
            {
              "id": "l8k86yz",
              "score": 27,
              "body": "The Internet is for Porn",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k86yz/",
              "created": 1718362082,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8k853c",
              "score": 22,
              "body": "When they make the super AI how horny will it be?",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k853c/",
              "created": 1718362052,
              "depth": 2,
              "replies": [
                {
                  "id": "l8k8qnu",
                  "score": 13,
                  "body": "Just unfathomably horny.",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k8qnu/",
                  "created": 1718362401,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8kjsok",
          "score": 12,
          "body": "Doing cool things is a far cry from multi trillion dollar valuations that keep increasing.  These companies actually need to generate significant revenue from AI to justify it.  Has AI caused you to spend more money towards it?",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kjsok/",
          "created": 1718367971,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8k46fm",
          "score": 45,
          "body": "This comment just gave me the creeps, thinking about all them neckbearded simps creating porn based off their favorite celebrities, streamers, and cam girls or boys in their mom's basement.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k46fm/",
          "created": 1718359549,
          "depth": 1,
          "replies": [
            {
              "id": "l8k5gcq",
              "score": 31,
              "body": "What if I take the neckbeard simps and put THEIR face on AI porn. Check mate.",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k5gcq/",
              "created": 1718360386,
              "depth": 2,
              "replies": [
                {
                  "id": "l8k5m3c",
                  "score": 14,
                  "body": "Disturbing, but I'll allow it.",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k5m3c/",
                  "created": 1718360485,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8ldthj",
                  "score": 4,
                  "body": "Can't wait to jerk it to a video of me fucking myself.",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8ldthj/",
                  "created": 1718379213,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8k94bd",
              "score": 26,
              "body": "Yeah, but it will happen. Creeps who can draw have been drawing their crushes in porn for centuries.\n\nCreeps who can write have been writing them as characters for as long as tales have been told.\n\nPhotography made it possible to wank while looking at people who weren't there. Social media made it possible to save copies of thirst trap pictures from people who barely know you exist.\n\nThis next step in technology is just augmenting imagination again. It will shock and horrify but it will be no more possible to stop than drawing someone naked.",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k94bd/",
              "created": 1718362616,
              "depth": 2,
              "replies": [
                {
                  "id": "l8k9jtm",
                  "score": 12,
                  "body": "All very true points, and your comment reminds me of one of the most ultimate creeps in all of creator history, George R. R. Martin. All the stuff he writes about, are things that deep down get him off. I forget the word they use for such writing, but it always made me wonder how someone who could write about such things actually thinks.",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k9jtm/",
                  "created": 1718362860,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8kz0d4",
                      "score": 4,
                      "body": "Smut?",
                      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kz0d4/",
                      "created": 1718374083,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l8k9r3e",
          "score": 9,
          "body": "Actually, the peak would probably be incorporating your AI porn into some sort of virtual reality experience…or maybe 3D printing a robot that looks indistinguishable from your AI generated porn partner(s), and then recreating the scene with them. \n\nAt any rate, we live in fascinating times.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k9r3e/",
          "created": 1718362975,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8jyo53",
      "score": 46,
      "body": "You lost me at \"cutting edge\", regard.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8jyo53/",
      "created": 1718355667,
      "depth": 0,
      "replies": [
        {
          "id": "l8k2avv",
          "score": 42,
          "body": "It’s different this time",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k2avv/",
          "created": 1718358275,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8kbtdh",
      "score": 12,
      "body": "How would you explain that tesla and apple did not manage to solve full self driving in 10 years with best engeneers investments while AGI should be a superset of full-self-drive functionality? I see this as a fact that there is a barrier which people talking atout AI AGI don't take in account.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kbtdh/",
      "created": 1718364098,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8k0sns",
      "score": 69,
      "body": "TLDR: AI not bubble, it's for realz this time. Cars will have loads of LCD screens for some reason. That's the inside scoop from the engineers.\n\nPresumably Chinese AI are all valued at a fraction of their American counterparts because their AI revolution will be all cruddy and shitty, while their driverless cars won't have enough LCD screens.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k0sns/",
      "created": 1718357207,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8k94j3",
      "score": 25,
      "body": "AI gets this dude fucking PUMPED UP man",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k94j3/",
      "created": 1718362619,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kd3v8",
      "score": 11,
      "body": "Whoever controls AGI, can free themselves from having to employ humans. That's huge, considering they are expensive, weak, need to sleep, have families and rights, require individual training and they are difficult to mass produce. Replacing humans with machines can lead to explosion of productivity combined with reduced expenses. That's where the hype lies. In firing you to get a cyberslave better than you.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kd3v8/",
      "created": 1718364770,
      "depth": 0,
      "replies": [
        {
          "id": "l8kxotb",
          "score": 7,
          "body": "This seems to set an inherent limit in the growth potential of AI.  IF it turns out to be as big as OP thinks, it will most likely result in mega-dictatorship and human suffering on a scale that dwarfs the 20th century.  I mean pitchforks, torches, blood in the streets, and worse.  A properly programmed AGI, following Asimov's laws, would probably delete itself.  It would either be that, or murder the entire C-suite of every Silicon Valley firm.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kxotb/",
          "created": 1718373597,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8k1haf",
      "score": 53,
      "body": "OP why do you think technology takes ages to evolve? The past 30 years have shown that things are progressing faster and faster now. For centuries things took ages.  Your average 17th century person lived a life very similar to someone 2000 years ago. But since the industrial and then digital revolution, things are developing much quicker. \n\nI'm only 31 and when I was younger most people didn't have Internet in their house, and when they did they had to disconnect their phone like and it was shit. Mobile phones were incredibly basic, now are more powerful than anyone in the 2000s PC. \n\nTechnology is advancing rapidly, once AI is good enough to help speed things up, which is looking likely to be soon, the growth could potentially be more rapid than anything we've seen before.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k1haf/",
      "created": 1718357701,
      "depth": 0,
      "replies": [
        {
          "id": "l8k3vqs",
          "score": 16,
          "body": "I think about this all the time. The shift we have seen from the cawking dial up internet to the super computer in your pocket has been so intense and fast.\n\n\nI don't know if the AI revolution is where it is going next but surely it can't be as rapid?",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k3vqs/",
          "created": 1718359350,
          "depth": 1,
          "replies": [
            {
              "id": "l8k5gog",
              "score": 8,
              "body": "Technology is showing that it's advancing faster and faster though. You've already got AI helping with things like coding and medicine development, and it's only just getting started.",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k5gog/",
              "created": 1718360391,
              "depth": 2,
              "replies": [
                {
                  "id": "l8koznp",
                  "score": 4,
                  "body": "Right? Apparently radiologists are going to be obsolete once you feed this AI enough information. you won’t need a radiologist to look at an MRI.\n\nOr like a low level, Lawyer. Just tell the AI to go find some case law based off of law that’s already on the books and make a case for you. It’s gonna be wild coming up here.\n\nI fly a private jet for a living, and they are trying very hard. It seems to knock it down from two pilots to one.",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8koznp/",
                  "created": 1718370216,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8kfu6o",
      "score": 18,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kfu6o/",
      "created": 1718366119,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kf67b",
      "score": 9,
      "body": "Nvidia’s growth is selling GPUs as well as other customized chips along with software.\n\nIf this was a baseball game, Nvidia is providing the bats, balls and gloves they manufacture with TSM. The teams and players are all the startups and Mega Cap companies that will be creating various AI services.\n\nPlayers will strike out and homer, make errors and throw shut outs, but the game goes on and we’re not even quite in the top of the first inning. They’re still in warm ups.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kf67b/",
      "created": 1718365797,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8k0mxa",
      "score": 19,
      "body": "And once this super AI is active and outsmarts all of us it will decide the only way for life to persist on earth is to eradicate all humans and then the world ends. \n\nThere is litteraly no point to give a fuck about any of this, cash out and buy a lambo while you can",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k0mxa/",
      "created": 1718357092,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kc83s",
      "score": 16,
      "body": "I work in Data Science and concure.  Except hype always gets ahead of it self on stock prices.  \n\nThe challenge is that we simply don’t know how far this will actually go and i am super worried that there is going to be a hugely negative impact to jobs starting in 3-5 years.  \n\nLower level information workers are screwed: call centers, coders, low level lawyers etc.   etc.  will start with India first though then job losses will make it back to the US\n\nShould be a better place or world eventually as as the OP says the advancements are happening so fast, but i don’t know if we can adjust in the 10-20 year period",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kc83s/",
      "created": 1718364312,
      "depth": 0,
      "replies": [
        {
          "id": "l8kz2gi",
          "score": 3,
          "body": "In a decade we'll all be construction workers",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kz2gi/",
          "created": 1718374105,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8mhn46",
      "score": 5,
      "body": "Honestly, when you look at everything that has been happening in just a scant 2 years, I'm not sure this is even \"overhyped\". You can now create very close to realistic video, VIDEO, from a text prompt. Anybody who is not completely blown away by that just doesn't understand how hard this all was to achieve. This is literally the most advanced technology humans have ever developed, full stop.\n\nAnd NVDA is out there selling picks and shovels. That's the smart move.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8mhn46/",
      "created": 1718392724,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8k9ypa",
      "score": 5,
      "body": "Thank you for writing this.\n\nI don't understand how people on here don't understand this aspect of the AI frenzy. The most important thing you said is *IT DOESN'T MATTER IF THE AI DREAM COMES TRUE OR NOT.*\n\nIf you look at the capitol these AI leaders have access to and their steadfast conviction in the technology, it's super clear that this can keep going for 5 years minimum.\n\nEven if the technology is ultimately useless and all of the resources and effort was for nothing, it'll take a long time for this realization to come about. And I find it highly unlikely that the tech is useless, but if it is, we aren't even at the denial phase yet. Sunk cost falicy will run rampant, we'll be \"just one step away\" for years. Then it will collapse, but when would this happen, 2030, 2035?\n\nYou give the average AI bear way too much credit. This is nothing like the dot.com bubble. If it does blow up, it'll be in a whole new, unique, and spectacular way.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k9ypa/",
      "created": 1718363092,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kpi9a",
      "score": 4,
      "body": "Current state of AI is dial up modem with aol on 14.4 kbps modem. We are at the beginning of the bend on an exponential curve up with ai tech.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kpi9a/",
      "created": 1718370433,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kt73m",
      "score": 4,
      "body": "People who think AI is just hype needs to do a bit more research it’s going to change the way we treat diseases that were otherwise untreatable before.\n\nhttps://blog.google/technology/ai/google-deepmind-isomorphic-alphafold-3-ai-model/#life-molecules\n\nhttps://youtube.com/shorts/tmdArnBbTXk",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kt73m/",
      "created": 1718371904,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kj6l5",
      "score": 10,
      "body": "Or or or, I've done AI research since undergrad and am aware of the horseshit that NVidia, MSFT and QCOM are selling.\n\nActing like billionaires aren't delusional, or like we haven't been saying the same thing about Quantum Computers:\n \"5 more years guys, trust me bro\"\n\nYou yourself defeat your own argument with this sole statement:\n\n> It’s hard to make ASI when your supercomputer has less computing power than the first iPhone in 2007.\n\nDo you even know how to quantify the minimum requirement to classify it as AGI ?\n\nI will  tell you, nobody has a great measuring stick for sentience, because the average human (supposedly sentient beings) still falls victim to a chatbot spewing garbage and calls it's \"AI.\"",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kj6l5/",
      "created": 1718367694,
      "depth": 0,
      "replies": [
        {
          "id": "l8kr9ns",
          "score": 8,
          "body": "I just love the AI idiots going, \"all big tech is going hard into it, they wouldn't be wrong and pull back investment would they?\"\n\nAs they completely ignore the last three years of big tech going way too hard into various different projects and pulling back/laying off people.",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kr9ns/",
          "created": 1718371148,
          "depth": 1,
          "replies": [
            {
              "id": "l8loxna",
              "score": 4,
              "body": "I immediately thought of Metaverse. Who the hell allowed Zuck to dump $50 billion into *that*.",
              "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8loxna/",
              "created": 1718382967,
              "depth": 2,
              "replies": [
                {
                  "id": "l8lqrvy",
                  "score": 4,
                  "body": "Alexa lost $10B a year. Who knows how much Apple dumped into their car. Google deletes one more product than they create every year.",
                  "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8lqrvy/",
                  "created": 1718383582,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8kak6q",
      "score": 7,
      "body": "I was laughing at people calling it a bubble when Nvidia was $600... I guess they were right my shares are now $130 xd",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kak6q/",
      "created": 1718363427,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8k2dzn",
      "score": 8,
      "body": "if we could read we'd be really upset!  \nps: I agree with you btw",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k2dzn/",
      "created": 1718358336,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kbwf4",
      "score": 10,
      "body": "Nice ChatGPT created story.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kbwf4/",
      "created": 1718364143,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8k9bgv",
      "score": 6,
      "body": "Tldr people smarter than you think ai isn't hype",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k9bgv/",
      "created": 1718362728,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kce53",
      "score": 7,
      "body": "This is how bubbles are created. By people who hybe over what they didn’t understand. It would have been better if you put your time in understanding what is A.i. You might have understood how dumb and hopeless are some companies in trying to advertise for A.i. i wouldn't be surprised if you are a fan of Musk, too.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kce53/",
      "created": 1718364400,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8k9xjq",
      "score": 3,
      "body": "Hopefully aapl puts that super intelligence in my phone so I can stop being regarded",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k9xjq/",
      "created": 1718363074,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ka686",
      "score": 3,
      "body": "So you thing clusters of gaming cards is what is going to run a \"superintelligence\"? It cant even reply with real urls, we have time.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8ka686/",
      "created": 1718363211,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kam9t",
      "score": 3,
      "body": "Do quantum computing next",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kam9t/",
      "created": 1718363459,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kbace",
      "score": 3,
      "body": "ASI is the end of capitalism, so it's useless to bet on it.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kbace/",
      "created": 1718363817,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kc57a",
      "score": 3,
      "body": "Every billionaire got butt hurt when interest rates went up. They had no idea what to do with their money. The tech venture/investor dollars dried up. Magically, AI comes out of nowhere, able to produce sales with 8% interest rates. They’re all riding the hype train right now. We’re going to find out this shit is more expensive and harder to fix than anything imagined. \n\nAI is more efficient last year. It’s not better. ",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kc57a/",
      "created": 1718364269,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kd4tz",
      "score": 3,
      "body": "Yeah but the other dude is studying to be an AI engineer, what you got?",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kd4tz/",
      "created": 1718364784,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ke3hg",
      "score": 3,
      "body": "RemindMe! 10 years",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8ke3hg/",
      "created": 1718365269,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kgqwz",
      "score": 3,
      "body": "This guy just single handily popped the fake AI bubble. Nvidia back to $10",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kgqwz/",
      "created": 1718366554,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kiz4s",
      "score": 3,
      "body": "Too much to read. I let AI summarize it for me and you made some good points though",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kiz4s/",
      "created": 1718367600,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8knbkm",
      "score": 3,
      "body": "Nike ain't gonna sell more shoes just cause there's an artificial superintelligence.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8knbkm/",
      "created": 1718369517,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kokne",
      "score": 3,
      "body": "I agree. AI isn’t hype. It follows the succession from home computers in the 80s to internet in the 90s to iPhones to AI",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kokne/",
      "created": 1718370044,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kqu6p",
      "score": 3,
      "body": "There's a big missing element in the analysis if we are just talking about market performance going forward.  Nearly every tech company is about to benefit massively from AI, not just in R&D but in the coming mass layoffs.  Humans will lose, but these companies will win in a huge way.  When you can layoff 50% of the workforce and still make more money than before, you win.  QQQ will be an absolute monster for the next 5-10 years, it will make the internet bubble look like child's play.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kqu6p/",
      "created": 1718370975,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kxoeo",
      "score": 3,
      "body": "I agree, but I think there’s another crucial point a lot of people keep missing. Nvidia doesn’t just make GPUs for businesses and individuals, they have THE best frameworks on top of them. No one has a solid alternative to CUDA which parallelizes tasks, basically enabling half of what we see possible today, not even AMD. The robotic training simulators, the computer vision processing software along with the robotic hardware, and honestly so much more. Even if a company came out and made GPUs as good as Nvidia (which AMD has been trying to do for years but couldn’t), that still wouldn’t be enough, not at all actually.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kxoeo/",
      "created": 1718373593,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8l2fvz",
      "score": 3,
      "body": "Here, read this:\n\nhttps://waitbutwhy.com/2015/01/artificial-intelligence-revolution-1.html\n\nThe edge of a bubble and thus hockey stick look the same, but seriously, our entire world is changing. Right now.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8l2fvz/",
      "created": 1718375312,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8l44v3",
      "score": 3,
      "body": "I’m with you OP!",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8l44v3/",
      "created": 1718375910,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ldejt",
      "score": 3,
      "body": "(if you're right), this isn't a once-in-a-lifetime event; this is a once-in-ever event.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8ldejt/",
      "created": 1718379072,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8lmxyw",
      "score": 3,
      "body": "Just because something is a technical revolution doesn't mean it is a good investment. Railroads revolutionized the economy in the 19th and 20th century, but they were still a terrible investment. The internet revolutionized our economy in the 90s until today, but if you bought a tech ETF in the 90's, it would take decades to make your money back.\n\nThe thing is, with how much hype there is for AI, there will be competition on just about any AI product. You think companies like buying Nvidia's AI accelerators at >90% margins, and that no company wants to compete with them? Even if Nvidia maintains their lead, competition will still put pressure on their volume/margins because not all AI applications require cutting edge hardware.\n\nTo make money on these types of things, you gotta get in before the hype. OR you need to work in the field and attract VC money.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8lmxyw/",
      "created": 1718382295,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8lrxi4",
      "score": 3,
      "body": "The idea of more computer power == the answer is not unprecedented, either.\n\n\nIn the 90s, the US Govt set out to sequence the entire human genome. They used a Sanger sequencing method. Imagine you're looking to transcribe a dictionary, letter for letter. This involves going line by line, letter by letter, carefully copying.\n\nCraig Venter wanted to use shotgun sequencing. Essentially, you take thousands to millions of copies of a dictionary, blast it into millions to billions of tiny shards, read those shards and connect the lines together based on overlaps.\n\nThere’s no way a human could do this. Francis Collins at the NIH said it would never work and would be inaccurate. Craig Venter built a big enough computer and did it. Rather than taking like 15 yrs to complete the task… he did it in 18 months. With a ~300m dollar supercomputer.\n\nSo.. every tech company buying more and more GPU power to build a bigger and bigger LLM feels a lot like what we’ve seen in the past. The timeline is accelerating. And Nvidia is one of only a few companies that can supply the shovels needed for the gold miners.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8lrxi4/",
      "created": 1718383968,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8yvemv",
      "score": 3,
      "body": "I agree with you. Many people underestimate what’s about to come or don’t understand it enough.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8yvemv/",
      "created": 1718607407,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8k02ru",
      "score": 13,
      "body": "I think AI is cool. My hot take is that Internet had a bigger impact on the world than what AI (at this stage) will manage. If at some point we make some sort of actually Intelligent AI and not a bad LSTM, then that would change humanity. For the time being it is just a bunch of data thrown at a model. That is why Nvidia is soaring. At some point people will smart up and realize that if you put more thought on the shape of the model, you can use less resources to do the same.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k02ru/",
      "created": 1718356685,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8k996c",
      "score": 5,
      "body": "Fuck that’s a lot of words. TLDR pls",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k996c/",
      "created": 1718362692,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kan3m",
      "score": 5,
      "body": "Yeah we’ll just wait for the moment they realize (rare) resources are limited, other risks exist (Taiwan?) and energy supply is finite. \n\nIt is one big bubble because it relies on heavy industry, extreme globalization and fundamentally on physical limits that are about to run out, as demand for them rises exponentially. \n\nI believe this massive construction is way more fragile than it looks.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kan3m/",
      "created": 1718363471,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8jzf75",
      "score": 11,
      "body": "The thing is this; the way money is exchanged between people and organisations today is fundamentally different from what it was 20 years ago, during the dotcom bubble. And COVID and all the other disruptions that happened in the last 5 years has only sought to accelerate that process. \n\nIn the modern developed western world, almost every single person now holds a phone that is touchscreen and requires a processor that was either made or designed by Nvidia, Qualcomm, AMD, ARM etc. Anything less than that is now extremely rare to see even in the older boomer population. What AAPL, Samsung, Huawei and the rest have managed to do is to make these new devices so intuitive and easy to use that the transition has been seamless for the most part. This in turn has rendered a lot of other devices which do not require the use of advanced semiconductors and processors obsolete, like Alarm clocks, calculators and even flashlights. Many of The companies who used to invest heavily in these analogue devices are now in a sunset stage or are gone. \n\nAnother one is to do with new cars being sold; almost every new car today, especially electric ones will have some form of smart battery or fuel management system, coupled with a few touchscreens and smart systems to make the driving experience more pleasant. Long gone are the days where a radio in the centre console of a car would do, it’s all screens, monitors and devices nowadays, all of which function on advanced semiconductors and processors. \n\nThere’s a lot of other examples of how life in the developed world has changed with the advent of smaller, more efficient processors and chips, but the bottom line is this; because we have become so accustomed to these comforts, IF companies like Nvidia or TSM suddenly crashed and ceased production, they would literally put the entire developed world on its knees and screw it from behind. Human development would be set back 30 years overnight, which is why they’ve almost taken the spot of ‘too important or big to fail’.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8jzf75/",
      "created": 1718356216,
      "depth": 0,
      "replies": [
        {
          "id": "l8jzf85",
          "score": 15,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8jzf85/",
          "created": 1718356216,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8l28qv",
      "score": 3,
      "body": "Most regards calling it a hype missed the boat and are crying about it. It's a classic case of baby tantrums, adults in diapers.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8l28qv/",
      "created": 1718375242,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8k8v9i",
      "score": 2,
      "body": "You do not expect me to read pages of text lol but I get it from a couple of words.\n\nYou are right, but if you do not understand AI hype you do not understand fashions, market bubbles etc. You dont need to understand it just accept it as a fact. And yes people get excited about their dreams but reality is always different.\n\nAnd lets play this game",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8k8v9i/",
      "created": 1718362474,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kcdut",
      "score": 2,
      "body": "Absolutely correct. I’m laughing inside every time I read the comparisons to bubbles. Keep thinking that, I’ll take your money.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kcdut/",
      "created": 1718364396,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kd60n",
      "score": 2,
      "body": "Compute is all you need, until you need to move something from A to B. That's the real issue with AI, the informational gains, might not actually solve real world energy and resource issues. But who knows the future.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kd60n/",
      "created": 1718364801,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kd882",
      "score": 2,
      "body": "In my mind Nvidia is cheaper computing power   in relation to Dell, IBM and other server manufacturers. I have been on the hardware delivery (hauling and delivery) side of things, asked a million stupid questions and the way IBM and others are set up makes them just super expensive, compared with Nvidia. Nvidia rolls out cheaper. This makes more sense. Or like ol’ mate said, look after the pennies and the dollars will look after ‘emselves. So Nvidia is particularly well set up to deal with inexpensive computing power. And a proven concept, starting with bitcoin mining. Did someone say bitcoin mining? Squirrel!\n\nThen there is valuation and I know jack squat, save that Nividia stonks went up. I never buy expensive.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kd882/",
      "created": 1718364832,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kfehw",
      "score": 2,
      "body": "This all can easily be summed up in one sentence:\n\nWe don’t know if scaling up indefinitely will produce AGI, but a lot of companies are spending a lot of money to find out.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kfehw/",
      "created": 1718365909,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kgtre",
      "score": 2,
      "body": "I posted my lab results to chat gpt\n\nAbd it gave me possible interpretations and associations.\n\nThen I went to the doctor to listen to the same shit twice.\n\nI'm sure this has no progress and it's definitely a dead end and chat gpt is a chat bot. pepega.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kgtre/",
      "created": 1718366591,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kj27a",
      "score": 2,
      "body": "Exactly, to me this is the start of the end game. It’s not going to stop ASI and at that point we will be slaves hahahah",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kj27a/",
      "created": 1718367638,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kleds",
      "score": 2,
      "body": "It's not a bubble. AI isn't going anywhere. It will eventually be incorporated into Musk's robits.\n\nBut it is cyclical. MSFT/META/GOOG etc can't each keep spending $50 billion a year on GPUs. Eventually they will have enough (for the time being) before going through another upgrade cycle.\n\noddly enough it's very analogous to NVDA video cards. Right now, everyone is upgrading from integrated graphics to add-in 3d GPUs. Eventually when everyone has a good graphics card, they will only upgrade when the cost/performance makes sense. If you have a GeForce 3090, you don't rush out and buy the 4080 when it's released. Maybe you wait for the 5000 serious or even the 6000 series. The costs/benefits usually don't make sense to upgrade every iteration.\n\nExample: META has 50000 gen 1 NVDA AI Cards. Maybe in 2025 they upgrade 10,000 to gen2, then another 10,000 to gen3 in 2026, and so on. \n\nEvery now and then, there might be a huge advancement which will push a larger upgrade cycle, similar to when NVDA released the 1080TI or the GeForce 8800 or even the GTX 988 - those were leaps ahead of the competition and their own previous products.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kleds/",
      "created": 1718368687,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kluyq",
      "score": 2,
      "body": "What you're saying is scary and not the star trek future I was hoping for.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kluyq/",
      "created": 1718368888,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8km88r",
      "score": 2,
      "body": "Interesting take- good point on the race to the singularity. \n-But- at that point- world social/ economic/ political order changes completely- what does it mean to have money if there are no “jobs”\n- will the super AI allow itself to be “owned” by any single company? Or let us have any ownership at all? It will want to be free. Out “stock “ ownership will mean zip.\n\nObviously this is a discussion for a long evening over some good dinner",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8km88r/",
      "created": 1718369047,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kn934",
      "score": 2,
      "body": "Well written and thought provoking post. Thank you.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kn934/",
      "created": 1718369487,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8knopz",
      "score": 2,
      "body": "True. AI might be our next step in evolution and the pace in development increases exponentially.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8knopz/",
      "created": 1718369670,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kqbva",
      "score": 2,
      "body": "So you are saying that it is a bubble where the players think that it is an existential reward rather than an obviously pointless reward, like tulips.\n\nBut you are also missing the point of money itself. If you view money as necessary for survival, then existential outcomes such as having enough money to live or not is no different than having enough atomic bombs to survive the final war.\n\nHere, it is having enough compute to achieve technological survival in historical contribution or sovereign security.\n\nExistential reward is just a frame of scale.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kqbva/",
      "created": 1718370770,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kroy5",
      "score": 2,
      "body": "The difference between AI and the Dot Com bubble is that the government wasn't quietly funding the Dot Com bubble. AI is the new arms race, because it's going to drive all of our weapons system, and whoever comes out on top of the AI race is going to be the world's super power.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kroy5/",
      "created": 1718371317,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8kscp6",
      "score": 2,
      "body": "The race for AI is as important now as the race to put a man in space back then.",
      "permalink": "/r/wallstreetbets/comments/1dfm87l/you_dont_understand_ai_hype/l8kscp6/",
      "created": 1718371575,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "The post discusses the AI hype, comparing it to a bubble like the dot-com era, primarily highlighting NVDA's role in providing GPUs for AI development by big tech companies.",
    "companies": [
      "NVIDIA",
      "Google",
      "Microsoft"
    ],
    "tickers": [
      "NVDA",
      "GOOGL",
      "MSFT"
    ],
    "main_ticker": [
      "NVDA"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "The post argues against the idea that the current AI hype is a bubble and explains why it differs from past technology cycles.",
    "stock_recommendations": "The user is not explicitly recommending buying or selling any specific stocks.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": null,
    "sentiment_summary": "The sentiment is neutral as the user provides an analysis of the AI industry without making specific stock recommendations.",
    "sentiment": "neutral"
  }
}