{
  "title": "You Understand AI Hype",
  "score": 90,
  "selftext": "This is in response to the post about how major companies believe they may be building ASI (or the first step to ASI). ETA: since many people seem to be confused, here’s the post I’m referencing https://www.reddit.com/r/wallstreetbets/s/KVzDaNWfW7\n\nThere is an obscene, inordinate amount of hype about AI online (and, unfortunately, in person in the case of some of my friends). Let’s be clear: the talk of “building the last thing humans will create,” “creating the next step in evolution,” etc… *is not coming from the people making large business decisions.* \n\nThat talk is coming from a very online, very insane, very fringe, very self-obsessed group of people who are either convinced AI is going to save us or kill us all. Most sensible people who don’t get their news from Twitter (sorry, X) don’t believe that chatGPT will make humans obsolete and/or extinct. \n\nWhat they _do_ recognize is that LLMs are going to be an important tool to augment (not replace!) human intelligence, and that they will become more commonplace and widespread over the next 3-10 decades. This is why Microsoft has not 1, but 2 products called “copilot.” You don’t name your AI product “copilot” if you plan on it taking over the world in 5 years. \n\nTo be clear: will we create ASI in the next 5 years? *No one knows and anyone who tells you otherwise is presupposing facts and intelligence structures that are entirely theoretical.*\n\nIs $NVDA a bubble? Well, its profit is growing at triple digit rates, so it doesn’t seem to be, unless demand for their products collapses. No one knows if/when that will happen. \n\nIf you feel like you’re lost because everyone around you is talking about how AI will control every facet of our lives, but you don’t feel that way, take a deep breath. This is not the majority opinion. Big tech CEOs do not believe this. The only people who believe this are eggheads and nerds. \n\nWe don’t even know if you can create human level intelligence with digital systems; for all we know it may require analog computers, we simply have no idea. Anyone who tells you otherwise is either trying to sell you something or needs to go outside and touch grass. \n\nPosition: $200K+ in student loans\n\nTl;dr: big tech CEOs don’t actually believe the “Artificial Super Intelligence is coming” hype, that’s coming from a bunch of very online nerds who need to touch grass, the CEOs are just trying to make money\n\nETA: since people seem to think I’m bearish on AI - that’s not at all what I’m saying. I expect LLMs/AI to be used heavily in business, and I’m sure there’s billions to be made. I’m responding to the idea that big tech CEOs are plowing hundreds of billions of dollars into A100 chips in order to build some moonshot artificial super intelligence which will usher us into paradise. They’re buying A100 chips so they can make highly profitable models to serve the business customers. ",
  "link_flair_text": "Discussion",
  "id": "1dfrnu4",
  "num_comments": 68,
  "created_utc": 1718373946,
  "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/",
  "comments": [
    {
      "id": "l8kyn71",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 8 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8kyn71/",
      "created": 1718373949,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8l1pzm",
      "score": 16,
      "body": "TLDR?",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8l1pzm/",
      "created": 1718375056,
      "depth": 0,
      "replies": [
        {
          "id": "l8l2g0s",
          "score": 19,
          "body": "Added to post: \n\nTl;dr: big tech CEOs don’t actually believe the “Artificial Super Intelligence is coming” hype, that’s coming from a bunch of very online nerds who need to touch grass, the CEOs are just trying to make money",
          "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8l2g0s/",
          "created": 1718375313,
          "depth": 1,
          "replies": [
            {
              "id": "l8l4in7",
              "score": 22,
              "body": "Online nerds aren't the ones putting billions into AI companies",
              "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8l4in7/",
              "created": 1718376044,
              "depth": 2,
              "replies": [
                {
                  "id": "l8l4wax",
                  "score": 11,
                  "body": "Yes, my point isn’t about whether it is/isn’t a bubble. The point is the people who are dumping billions of dollars in are people who believe it will help their business and will make money, not people trying to create some weird AI super intelligence to rule the planet",
                  "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8l4wax/",
                  "created": 1718376177,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8mzqjo",
                      "score": 2,
                      "body": "I don't think it's a bubble. But I do see this as the future in terms of trends. Every company who makes them hates the fact that they run out of ideas to sell you a new version of it. I can just picture the next two or three christmas cycles all about TOYS with AI Tvs with AI. Phones with AI. AI in the drive thrus. Eventually it'll fade out of popularity but if you do not see what's coming you should probably not be investing. We will have reached the top once you can buy a shitty Walmart NVDA shirt near all the other ones.",
                      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8mzqjo/",
                      "created": 1718398923,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l8luq7i",
              "score": 11,
              "body": "Tldr....biggest blunder people are making is confusing  Ai for  GeneralAi ... If you take copyrighted material away from Ai you get nothing more than a glorified indexing algorithm ......",
              "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8luq7i/",
              "created": 1718384910,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8m7m9p",
              "score": 6,
              "body": "Sam Altman certainly believes he is making a god. So do all his employees who would rather quit than work under anyone else.\n\nIt's disingenuous to say that it's all just AI bros on Twitter. These people legitimately believe they are \"solving\" every problem in the world by working on AI. They truly believe that once they achieve AGI the world will suddenly become perfect.\n\nYou should see the way they tweet. They're all either brainwashed or know something nobody else does and I'm leaning toward the former.",
              "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8m7m9p/",
              "created": 1718389284,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8mcezb",
              "score": 3,
              "body": "This may suprise you but people just trying to make money is usually what causes a bubble.. especially when that hype fades",
              "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8mcezb/",
              "created": 1718390920,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8vqdj1",
              "score": 1,
              "body": "Tl;dr: instead of dog shit in how [Ryan Gosling explains how to turn debt into money](https://www.youtube.com/watch?v=v_DQtUK-FXg&t=41s), it's nerd shit.",
              "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8vqdj1/",
              "created": 1718556783,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8oyexc",
              "score": 1,
              "body": "Zuck emphatically actually believes. Dude is desperate to not be known as the facebook guy and wants to leave his mark on history.\n\n>Position: $200K+ in student loans\n\nUnless those are medical school loans this says a lot about your intelligence level.",
              "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8oyexc/",
              "created": 1718432566,
              "depth": 2,
              "replies": [
                {
                  "id": "l9ddb3u",
                  "score": 1,
                  "body": "*not to be known\n\nYou are a baby Jeff Yass right now. Learn how to author a sentence.",
                  "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l9ddb3u/",
                  "created": 1718832963,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8myzwx",
              "score": 0,
              "body": "Well Zuck is investing a lot in AI. So is Google.",
              "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8myzwx/",
              "created": 1718398667,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8m63or",
      "score": 26,
      "body": "You will not get AGI from LLMs.",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8m63or/",
      "created": 1718388763,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8m10je",
      "score": 5,
      "body": "Remindme! 3 years",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8m10je/",
      "created": 1718387030,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8l39jm",
      "score": 24,
      "body": "Are you any of you aware of the thousands of lawsuits currently filed against AI companies for \"scrubbing\" the internet of all data, audio, and video without a single acknowledgment of the content creator, intellectual property, or royalty payment? When one of these lawsuits is successful, and it will be, the entire AI as we know it will have to crumble and morph into something new. At that point this bubble bursts. Yes, AI is a different type of technology, but it is entirely based on stolen intellectual property.",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8l39jm/",
      "created": 1718375602,
      "depth": 0,
      "replies": [
        {
          "id": "l8lf6tf",
          "score": 9,
          "body": "It's kind of like self-driving, the liability debate, then one day everyone forgets about that branch of AI, and circle jerks the next one.",
          "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8lf6tf/",
          "created": 1718379676,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8la1l8",
          "score": 11,
          "body": "These AI bros never want to hear the truth that the lawyers will catch up and will start tearing this shit apart piece by piece. They will catch up too, it was a common idea on reddit that Apples closed garden approach could last forever too but that is quickly being dismantled by lawyers and regulations.",
          "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8la1l8/",
          "created": 1718377939,
          "depth": 1,
          "replies": [
            {
              "id": "l8lamtm",
              "score": 12,
              "body": "The AI bros have their own lawyers but they will be severely tested. In the end, calls on lawyers are your best investment. Cannot lose.",
              "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8lamtm/",
              "created": 1718378140,
              "depth": 2,
              "replies": [
                {
                  "id": "l8lb293",
                  "score": 2,
                  "body": "Yeah I don't think they are gonna win, I think your assertion that it will have to be changed drastically is right on the money.",
                  "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8lb293/",
                  "created": 1718378285,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8n1a48",
          "score": 2,
          "body": "I doubt lawsuits take LLMs down... frankly, there is just too much money behind this stuff to let petty junk like \"courts\" and \"justice\" stop it.\n\nThe problem with LLMs is that they had one shot to index an unspoiled Internet, where people were just providing natural text on the web for them to read for free. Now more of that data is going to be cut off by rights owners who know what they've got on their hands, and it's going to be corrupted by other LLMs dumping out potential mountains of gibberish. They've already used the best training dataset they're ever going to get.",
          "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8n1a48/",
          "created": 1718399474,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8oyh3x",
          "score": 2,
          "body": "Those lawsuits have been getting smashed in court and one win that gets appealed won't have any impact.",
          "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8oyh3x/",
          "created": 1718432610,
          "depth": 1,
          "replies": [
            {
              "id": "l8q3eyk",
              "score": 0,
              "body": "At least WSB regards have something more to think about now. Widespread AI rocket launch is far from a sure thing. Ten years ago 3-D printing was going to make us all rich. They were going to change the world by printing everything from human organs to whole houses. How did that work out for investors?",
              "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8q3eyk/",
              "created": 1718459592,
              "depth": 2,
              "replies": [
                {
                  "id": "l8xwfds",
                  "score": 1,
                  "body": "Who tf believed that nonsense? Certainly not investors.",
                  "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8xwfds/",
                  "created": 1718588011,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8l3srk",
          "score": 1,
          "body": "Yes, and that’s a good point but I’m not sure how it relates to my post",
          "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8l3srk/",
          "created": 1718375791,
          "depth": 1,
          "replies": [
            {
              "id": "l8lachm",
              "score": -3,
              "body": "AI is neither going to save us or kill us. It's in danger of extinction. The AI bros have been gaming the system and are going to get crapped on by the courts.",
              "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8lachm/",
              "created": 1718378042,
              "depth": 2,
              "replies": [
                {
                  "id": "l8lclsa",
                  "score": 2,
                  "body": "I agree that they will face a rough court battle. I have no idea how it’s going to turn out, my point is more that the talk of “ASI” is _not_ coming from the decision makers, it’s coming from weirdos. The decision makers are trying to make money (and as you said, they may be stymied by the courts)",
                  "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8lclsa/",
                  "created": 1718378803,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8lu36i",
                  "score": 1,
                  "body": "AI is going to be hugely lucrative to any company on the planet. It's also an information arms-race that the US cannot afford to lose to China or some other less restrained geopolitical player. \n\nYou will be sorely disappointed as you relearn the lesson that capital and the military-industrial complex always wins over hifalutin ideas about the rights of artists and individual creators.",
                  "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8lu36i/",
                  "created": 1718384692,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8m5gcr",
                      "score": 0,
                      "body": "Genuine question: can you explain what you mean by less restrained? By my definition, the states don’t really have much restraint. This is a question, I’m not trying to attack your stance",
                      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8m5gcr/",
                      "created": 1718388542,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8m6bdq",
                          "score": 1,
                          "body": "We don't, but what the other poster is suggesting is that the courts will start to forcibly restrain AI development. We can't afford to do that and lose to a less restrained player on the world stage.",
                          "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8m6bdq/",
                          "created": 1718388837,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8mjp7f",
                              "score": 1,
                              "body": "There are a lot of things we can't afford to do that are becoming reality in the 2024 version of America. We've already lost the battle.",
                              "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8mjp7f/",
                              "created": 1718393437,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l8melhh",
          "score": 1,
          "body": "do you think the finance bros on wall street who are driving up AI stock dont know about these pending lawsuits?",
          "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8melhh/",
          "created": 1718391664,
          "depth": 1,
          "replies": [
            {
              "id": "l8mjdxg",
              "score": 3,
              "body": "They're supremely overconfident that their \"transformative\" technology supported by the best lawyers money can hire will prevail in these lawsuits. I'm not sure they are correct.",
              "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8mjdxg/",
              "created": 1718393328,
              "depth": 2,
              "replies": [
                {
                  "id": "l8n76tg",
                  "score": 3,
                  "body": "you dont think the expensive risk modeling programs they run on wall street have considered these outcomes and their probabilities & impacts already? or are you more uncertain about the regulatory space in the future?",
                  "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8n76tg/",
                  "created": 1718401702,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8mmnqs",
          "score": 1,
          "body": "entirely disagree. there will always be another form. you can’t kill AI. some chinese knock off or indian company will come out with the same thing. ban those? there will be others. short sighted",
          "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8mmnqs/",
          "created": 1718394461,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8myobe",
          "score": 0,
          "body": "No lawsuits will work because it’s not copying",
          "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8myobe/",
          "created": 1718398556,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8lfcrv",
      "score": 7,
      "body": "the thing is all these companies MSFT APPL and so on invest bn in their AI but the return of these investments are not seen yet.",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8lfcrv/",
      "created": 1718379733,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8lejyx",
      "score": 5,
      "body": "what we have now is a fancy trick with some scary tactics thrown in by musk for good measure. Ain't no cyberdyne comin for millennia",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8lejyx/",
      "created": 1718379463,
      "depth": 0,
      "replies": [
        {
          "id": "l8mz10n",
          "score": 1,
          "body": "Millennia is long as fuck I give it 15 years",
          "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8mz10n/",
          "created": 1718398677,
          "depth": 1,
          "replies": [
            {
              "id": "l8zpz4o",
              "score": 1,
              "body": "right after the zombie apocalypse",
              "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8zpz4o/",
              "created": 1718627613,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8l0567",
      "score": 6,
      "body": "Uhhhh, ok.",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8l0567/",
      "created": 1718374491,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8lwnbd",
      "score": 8,
      "body": "the denial is strong in this thread\n\nedit: to reiterate, you are all wrong, downvotes will not make you less wrong",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8lwnbd/",
      "created": 1718385555,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8lcl2t",
      "score": 4,
      "body": "You're right. You wouldn't call a product \"co-pilot\" if you plan on it taking over the world.  You'd call it \"Dominion\"",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8lcl2t/",
      "created": 1718378796,
      "depth": 0,
      "replies": [
        {
          "id": "l8mza3d",
          "score": 2,
          "body": "Co pilot for now dominion is coming next year",
          "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8mza3d/",
          "created": 1718398764,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8l7tbv",
      "score": 5,
      "body": "sorry buddy, but u gotta be stupid to not believe AI will advance to an astronomical level within the next 10 years.",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8l7tbv/",
      "created": 1718377175,
      "depth": 0,
      "replies": [
        {
          "id": "l8l9r2g",
          "score": -11,
          "body": "I don't think so, nothing has advanced to an astronomical level in the last 10 years all the shit I use technology wise is only marginally better than it was in 2014. It seems like you have not caught on to the fact that big tech does nothing but make huge promises it can't actually deliver this is just the latest one. I imagine it will be better than it is now but its not going to be \"astronomically\" better in 10 years. There are debates about whether ASI, AGI are even possible or a century out.",
          "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8l9r2g/",
          "created": 1718377839,
          "depth": 1,
          "replies": [
            {
              "id": "l8mzkpl",
              "score": 4,
              "body": "There have been plenty of advancements in the last 10 years",
              "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8mzkpl/",
              "created": 1718398866,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8mgpl7",
              "score": 0,
              "body": "Ah yes the classic “it didn’t happen with completely unrelated things so it must not happen in this instance”",
              "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8mgpl7/",
              "created": 1718392400,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8lhihq",
      "score": 2,
      "body": "It's not A.I. It's A.C...\n\n'Artificial Capability'",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8lhihq/",
      "created": 1718380460,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mp0bp",
      "score": 2,
      "body": "I think we are likely at the start of a bubble but who knows how or if it will continue.  Im a software dev and l am constantly hearing people on the business side asking how we use AI for this or that.   The answer is usually that we can’t or wouldn’t want to or simply don’t need to.  \n\nRight now im not too worried but if we start to see dozens of unprofitable AI start ups with massive valuations, that will be cause for concern.",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8mp0bp/",
      "created": 1718395255,
      "depth": 0,
      "replies": [
        {
          "id": "l92xd9p",
          "score": 1,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l92xd9p/",
          "created": 1718669117,
          "depth": 1,
          "replies": [
            {
              "id": "l937g05",
              "score": 1,
              "body": "I think if it were to stop or slow down significantly right now, it wouldn't get into true bubble territory.  AI is  good for some stuff, NVDA sold and will sell lets of chips and there aren't a ton of profitless AI companies with large cap valuations.  NVDA will probably pull back at some point but the other players like MSFT and AAPL and GOOGL, etc, can absorb this without tanking.  \n\nI'm bullish for now if for no reason except I'm always early calling the top.",
              "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l937g05/",
              "created": 1718673178,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8m3q78",
      "score": 1,
      "body": "I'm old. So I remember, in the early 90s they called the PC  \"the Pet Rock of the 90s\" & \"no one will need that\". \n\n\n\nAI will be like nothing we have ever seen before. What you are currently witnessing is in its infancy, it will evolve into something we will utilize daily. It will be incorporated into most industries.",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8m3q78/",
      "created": 1718387946,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mrzmq",
      "score": 1,
      "body": "The thing with AI is that out of the 10s of thousands of projects, probably 1 or 2 will end up being the real next step in computing. Just from this fact alone, we are in a bubble that will pop the moment one player pulls ahead into the true AI future.\n\nThe thing is, no matter who wins, they will need a lot of computing power that is very modular. And NVDA is simply the best offer for exactly that. The proverbial shovel of the AI gold rush. The only way for the position to resorb at this point would be a 2nd equally dedicated GPU seller in the AI rush rising in competition, but I don't think it's possible at this scale in the short term.",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8mrzmq/",
      "created": 1718396270,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8q19do",
      "score": 1,
      "body": "[https://www.issuewire.com/lorina-barre-a-revolutionary-ai-influencer-achieving-unprecedented-success-1801702043984517](https://www.issuewire.com/lorina-barre-a-revolutionary-ai-influencer-achieving-unprecedented-success-1801702043984517)",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8q19do/",
      "created": 1718458526,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mshjv",
      "score": 2,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8mshjv/",
      "created": 1718396439,
      "depth": 0,
      "replies": [
        {
          "id": "l8muitd",
          "score": 3,
          "body": "Yeah I agree it’s not necessarily a bubble, my post was more in response to the person saying that big tech is investing hundreds of billions to build a super intelligence that will replace us. They aren’t. They’re trying to make money by improving efficiency.",
          "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8muitd/",
          "created": 1718397129,
          "depth": 1,
          "replies": [
            {
              "id": "l8mvsq5",
              "score": 1,
              "body": "You arent wrong. In the short term AI will simply make things easier to do. Valuable but not life changing. in the long term the limits are still theoretical. non physical jobs will be largely phased out. When robotics catches up then physical jobs will begin to phase out. The thing is that a super intelligence isn't the revolution the big companies are going for. They want a network of small focused AI's that can replace 80% of their workforce.",
              "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8mvsq5/",
              "created": 1718397567,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8meukb",
      "score": 0,
      "body": "TLDR:  OP doesn’t understand AI, is classified with the rest of the population in the fact it’ll take 4 to 6 years to understand then, what we already know now!\n\nIf you’re not holding tech stocks when AI is understand by the normies then you’ll\nmiss the holy grail of the tech stock super cycle!",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8meukb/",
      "created": 1718391750,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8merry",
      "score": -1,
      "body": "Where there's honey there's bears",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8merry/",
      "created": 1718391723,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ll3cv",
      "score": -3,
      "body": "Consumers will never see or utilize high functioning AI products. There is value. It’s just not at the consumer level. My guess is capability on the consumer end is capped currently. Copilot, ChatGPT all of them must be overly biased to spitting out boiler plate responses. Basically a search engine. Universities and startup are building their own models and they perform. But you won’t see them or have access without loads of cash. Months of research I found the machines exist and are proprietary. Some bleeding edge Financial firms have them but they aren’t for trading. They predict global trends industry leaders can play off. It’s an interview process just to talk with these firms. if it works why would I sell it and I definitely wouldn’t tell anyone about it?",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8ll3cv/",
      "created": 1718381670,
      "depth": 0,
      "replies": [
        {
          "id": "l8lmkr4",
          "score": 2,
          "body": "Iam currently running copilot subscription. It’s a lot of work just to get it working properly. I’m learning coding now. Great for work flow automation. Change an invoice to pdf then file it in the appropriate files. That’s weeks for a noob like me. But ask it about mining operations work investing and it has rendered some results I couldn’t find on my own complete with “ investing is a high risk bla blah”  I know economic theory and ML have been hand in hand for decades and they are producing results. I’ve spent the better part of my year looking for consumer level access and it does  not exist, for us",
          "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8lmkr4/",
          "created": 1718382171,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8ot4kg",
      "score": -1,
      "body": "Why are you yelling?",
      "permalink": "/r/wallstreetbets/comments/1dfrnu4/you_understand_ai_hype/l8ot4kg/",
      "created": 1718429058,
      "depth": 0,
      "replies": []
    }
  ]
}