{
  "title": "Weed stocks - why so beat up? Buy now?",
  "score": 54,
  "selftext": "MSOS/MSOX/TLRY/etc - is this a buy now at low situation? Not long term investment, but trying to decide if this is a quick play to consider. The comment period on rescheduling ends on 7/22, so we’ve entered the one month window before that “event”. There seems to be a cyclical trend to some of the etfs and stocks. Just curious of WSB thoughts since Ive read a lot of recent negative comments on DDs for weed stocks. Maybe they got burned in past trades? \n\nAnyway, considering jumping in today/next week. Cheers ",
  "link_flair_text": "Discussion",
  "id": "1dfv6xc",
  "num_comments": 139,
  "created_utc": 1718383128,
  "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/",
  "comments": [
    {
      "id": "l8lpfbp",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 75 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8lpfbp/",
      "created": 1718383131,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8luv6u",
      "score": 48,
      "body": "Buying into HITI, just posted a net profit and fcf, legitimately good numbers for the industry but the whole sector is beat down",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8luv6u/",
      "created": 1718384957,
      "depth": 0,
      "replies": [
        {
          "id": "l8m2r38",
          "score": 11,
          "body": "I remember that from the penny stock days. Seems to still do good but never seems to have the volume or support to fly.",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m2r38/",
          "created": 1718387615,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8lwzvn",
          "score": 14,
          "body": "And it dropped -9% yest/today on that news? Yea seems market is beat down right now",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8lwzvn/",
          "created": 1718385674,
          "depth": 1,
          "replies": [
            {
              "id": "l8m08p9",
              "score": 26,
              "body": "Post earnings drop. Tale as old as time.\n\nUnless I buy puts, then it soars",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m08p9/",
              "created": 1718386767,
              "depth": 2,
              "replies": [
                {
                  "id": "l8pjm27",
                  "score": 1,
                  "body": "Sell puts",
                  "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8pjm27/",
                  "created": 1718448605,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8mwqxk",
              "score": 12,
              "body": "Classic WSB. Up 50% last 6 months and stock is underperforming or beat up. \n\nNot picking but we're at the current top of a roaring market. I've given up on the true fundamentals. It is all swings and short term trends as of late..",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mwqxk/",
              "created": 1718397897,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8m383f",
      "score": 33,
      "body": "Do these companies even warrant retail investors time and money? NY, MA, CT, NJ are littered with black market shops and street dealers dominating any state run dispensary that you can find. I wonder if the same goes in other states, I know its the same but worse on the west coast. Makes me think, will weed stocks ever be worth it.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m383f/",
      "created": 1718387775,
      "depth": 0,
      "replies": [
        {
          "id": "l8m70br",
          "score": 27,
          "body": "It’s because those states charge too much in taxes. Michigan has the most sales with a way smaller population because the dispensaries basically give it away. Street dealers aren’t capable of competing.",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m70br/",
          "created": 1718389076,
          "depth": 1,
          "replies": [
            {
              "id": "l8mq5u7",
              "score": 3,
              "body": "It's not the taxes, California taxes 30% and I can find equivalent products in California for less than half the price of NJ. The reap problem is all of the regulatory hurdles that have been put in place by big business, making it prohibitively expensive and difficult for any real competition to come in to play in the legal market. Make no mistake, consumers and voters did not want these regulations, and it's not the agenda of any given party - it's just corporations using money to influence local government. They have also made homegrow illegal in NJ, which does nothing to incentivize cheaper options in dispensaries. I can't speak to other states, but I know companies like Curaleaf are fighting tooth and nail to make it as hard as possible to become a competitor in the legal landscape.",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mq5u7/",
              "created": 1718395647,
              "depth": 2,
              "replies": [
                {
                  "id": "l8q9h9m",
                  "score": 1,
                  "body": "It absolutely is the taxes, I own a decently sized grow op. It is also the federal illegality which makes the banking/cash part absolute hell.",
                  "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8q9h9m/",
                  "created": 1718462414,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8pq4so",
                  "score": 0,
                  "body": "Damn this why that only dispensary in Florida",
                  "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8pq4so/",
                  "created": 1718452597,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8mavjm",
              "score": 8,
              "body": "That's what I was going to say. It's dirt cheap on the west coast. Our state also taxes it and it's still dirt cheap.",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mavjm/",
              "created": 1718390391,
              "depth": 2,
              "replies": [
                {
                  "id": "l8mdqbe",
                  "score": 17,
                  "body": "It's been the only product I routinely buy which has gone *down* in price over the last 25 years",
                  "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mdqbe/",
                  "created": 1718391370,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8mbo62",
              "score": -1,
              "body": "I love investing in companies that give their product away!",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mbo62/",
              "created": 1718390664,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8mm466",
          "score": 4,
          "body": "I live in Manhattan and the NYPD has been raiding the unlicensed weed shops that used to be on every corner. There was a recent New Yorker piece about how the licenses were supposed to go to communities disproportionately affected by weed arrests and folks with prior weed convictions, and how the unlicensed shops negated that. Maybe that piece shed some light on the issue or maybe it was a timing coincidence, but regardless, there has been a crackdown. Will it snowball into an effect on weed stock prices? No idea.",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mm466/",
          "created": 1718394279,
          "depth": 1,
          "replies": [
            {
              "id": "l8mnuqw",
              "score": 3,
              "body": "It’s a ghost town now. I feel for the shops. The licensing has been stalled for those who could qualify and nonexistent for anyone trying to get one now. I looked into it but good luck. It’s a good question if that will have some sway over current stocks. I wished they would get off their asses and fix the pipe line so that the big distributors could back fill demand and start moving the industry. Give the people a chance.",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mnuqw/",
              "created": 1718394862,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8maqm8",
          "score": 2,
          "body": "I don't see how that could be the case that street dealers dominate state run dispensaries. Like how? Dispensaries are dirt cheap and they have like 50 different strains to choose from.",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8maqm8/",
          "created": 1718390344,
          "depth": 1,
          "replies": [
            {
              "id": "l8mcz78",
              "score": 3,
              "body": "Dispensaries in the states I listed will charge 30% on top of an order, whereas you can go to any smoke shop selling at less than the dispensaries' pre-tax price. A Fine Fettle opened up down the street from me recently, they sell Curaleaf and more brands that are listed under ETFs like MSOS, and the parking lot is always empty. Meanwhile smoke shops have people constantly in and out the doors. The dealers I am familiar with have been dealing since high school and almost 8 years later business is still going for them. You'd have thought they would be priced out by now by legal shops but that hasn't happened. Thats just from my experience at least.",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mcz78/",
              "created": 1718391114,
              "depth": 2,
              "replies": [
                {
                  "id": "l8mdbw8",
                  "score": 2,
                  "body": "Makes sense. The taxes are higher there. Different on the west coast. I still wouldn't invest. The market is saturated with good weed. No room for profits.",
                  "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mdbw8/",
                  "created": 1718391235,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8mg17m",
                      "score": 2,
                      "body": "Super saturated. On the west coast, there are warehouses dishing out pounds to people who have the cash for it as low as $400. Those make their way all over the country. I'm no dealer, but you break that down if you are one and theres no dispensary out there undercutting your price. The black market has such a surplus, and countless times people who invest in the market I only hear about how they have to sell at a loss, companies arent profitable, etc etc.",
                      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mg17m/",
                      "created": 1718392165,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l8mbzgc",
              "score": 5,
              "body": "Some states have really high taxes, so final purchase price just isn’t that great. Like I’m all for the safety of buying it legally, but if it’s cheaper from my boy, and he delivers and will smoke with me on the drop off, I’m calling him.",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mbzgc/",
              "created": 1718390771,
              "depth": 2,
              "replies": [
                {
                  "id": "l8mj8fe",
                  "score": 7,
                  "body": "It's not even just that. High tax rates don't explain Chicago pricing.\n\n\nIt's because of the legal cartels. There is no competition in Illinois and it's by law.",
                  "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mj8fe/",
                  "created": 1718393276,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8n4nxt",
                  "score": 3,
                  "body": "Meanwhile I'll pay extra to not smoke with the dealer",
                  "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8n4nxt/",
                  "created": 1718400735,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8md3on",
                  "score": 1,
                  "body": "fo sho! Different states different fates. No way the average dealer can compete where I am.",
                  "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8md3on/",
                  "created": 1718391156,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8mcps8",
              "score": 2,
              "body": "I mean the guy on the street has the same prices and most people don’t actually care about that kind of variety if the smoke is good. Also a significant number of the dispensaries are actually illegitimate black market operations. ",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mcps8/",
              "created": 1718391024,
              "depth": 2,
              "replies": [
                {
                  "id": "l8mw0d4",
                  "score": 2,
                  "body": "Either way, there isn't really investment opportunity",
                  "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mw0d4/",
                  "created": 1718397641,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8mbdyc",
          "score": 1,
          "body": "You can literally buy weed off of Instagram.",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mbdyc/",
          "created": 1718390566,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8m0kzw",
      "score": 11,
      "body": "It’s really tough to regulate something like weed. It’s grows easy, like a weed. Good luck putting regulations on it and forcing people to pay a 30% premium.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m0kzw/",
      "created": 1718386883,
      "depth": 0,
      "replies": [
        {
          "id": "l8n8zca",
          "score": 6,
          "body": "Grows easy yes, high yield is what takes time and effort, most stoners dont wanna wait on a plant especially if there is the convenience of a store to buy it safely.",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8n8zca/",
          "created": 1718402401,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8m3e0o",
          "score": 12,
          "body": "That’s a legit point, but at the same time why do we buy increasingly expensive fast food like 5 guys when we can make burgers at home, Starbucks is insanely overpriced but has massive business. Technically we could all make our own beer, but why?…. America is a nation of speed and convenience, long term maybe cannabis will be bust, but the first 2-5 years I’m bullish.",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m3e0o/",
          "created": 1718387831,
          "depth": 1,
          "replies": [
            {
              "id": "l8meot9",
              "score": 4,
              "body": "Everybody eats 3 times a day, the food analogy doesn’t work. But the beer one is really easy to explain. You need lots of special equipment and space to make thousands of dollars worth of beer. You can grow thousands of dollars of weed in a 4’x4’ space in your yard with a tiny upfront cost. The other thing is there is already a robust market for weed. Any corporation coming in has to disrupt a marketplace that is already saturated with product. Also due to the nature of growing weed it’s a lot harder to maintain quality the bigger you make your operation.",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8meot9/",
              "created": 1718391696,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8m3w0v",
      "score": 10,
      "body": "If you’re willing to buy and hold for an indefinite period of time, I think now is a nice entry point. Expect to hold for a while, especially if the republicans secure the White House or a congressional majority. Laws and regulations are trending in weeds favor and I don’t buy into the idea that the unregulated market will cap growth on legitimate business. A massive segment of marijuana users are willing to buy from dispensaries but are unwilling to find a dealer. You’ve got a lot of institutional money in these stocks, they view it as a viable long term investment and so do I",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m3w0v/",
      "created": 1718388003,
      "depth": 0,
      "replies": [
        {
          "id": "l8mdf29",
          "score": 2,
          "body": "No it would prob be short term and try to play the next regulation event on 7/22; a buy now and offload at next uptick (if MSOS was to get to $9-$10 again).",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mdf29/",
          "created": 1718391266,
          "depth": 1,
          "replies": [
            {
              "id": "lc6qeja",
              "score": 1,
              "body": "sorry whats on 7/22 again ??",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/lc6qeja/",
              "created": 1720444111,
              "depth": 2,
              "replies": [
                {
                  "id": "lc7bn6l",
                  "score": 1,
                  "body": "I believe the Comment period ends",
                  "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/lc7bn6l/",
                  "created": 1720451895,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8m2saj",
      "score": 20,
      "body": "Usually when things get this bearish in weed its a good sign. Literally everyone is bearish right now its really bad, which is good. Source: been in weed since December 2015.\n\nI think right now people just don’t care about weed stocks. I’m hoping that changes when schedule three happens but that would be good news (which is bad) so idk 🤷‍♂️",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m2saj/",
      "created": 1718387627,
      "depth": 0,
      "replies": [
        {
          "id": "l8mmz8j",
          "score": 9,
          "body": "Same, been in the sector since 2012. But should’ve put more money in BTC. Oh well, I just couldn’t trust it at the time. \n\nBut yeah what you’re saying is true. The ultra bears will come out and claim it’s a terrible business yadda yadda.\n\nIt IS a terrible business. Everyone knows that. Doesn’t mean it’s a bad trade, and could surge on all kinds of good news. If Biden makes good on his medicinal weed promise via rescheduling, I’m certain he’s going campaign on full legalization for his next term and stonks could surge.\n\nThe summer is usually a great time to buy shares. But don’t listen to me because I’m a dumbass.",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mmz8j/",
          "created": 1718394566,
          "depth": 1,
          "replies": [
            {
              "id": "l8mo3c2",
              "score": 1,
              "body": "I regularly have the same thoughts about BTC.\n\nI don’t think cannabis is a terrible business though. We have some great MSOS like Green Thumb that are only going to keep getting better with 280e removed. We also have some bad companies in the mix, no doubt about that.\n\nI think you’re right about the next few months. The election is going to make it interesting. Cheers!",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mo3c2/",
              "created": 1718394943,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8qdk97",
          "score": 1,
          "body": "If you were in weed since 2015 and still in it, then I feel bad for you.",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8qdk97/",
          "created": 1718464221,
          "depth": 1,
          "replies": [
            {
              "id": "l8rbh07",
              "score": 1,
              "body": "I’ve been in and out. I did really well on the initial trade in Canada but ya, we’ve taken a beating. I also feel bad for me.",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8rbh07/",
              "created": 1718478095,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8msplj",
      "score": 4,
      "body": "The deadline for “comments” on the proposed marijuana rescheduling is 7/22. The rescheduling will probably happen one or two months after that.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8msplj/",
      "created": 1718396514,
      "depth": 0,
      "replies": [
        {
          "id": "l8qhky2",
          "score": 1,
          "body": "So maybe September, just in time for Biden to grandstand on the rescheduling and campaign on full legalization for two more months.",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8qhky2/",
          "created": 1718465962,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8lx2yt",
      "score": 3,
      "body": "I think we might see a beverage company eventually get involved in cannabis but until then it’s not worth the gamble",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8lx2yt/",
      "created": 1718385703,
      "depth": 0,
      "replies": [
        {
          "id": "l8lxrs8",
          "score": 3,
          "body": "Just crazy bc I can get a 7/19 call for tlry basically in the money. 7/19 1.5 strike for 28 cents. It’s at 1.70 today.",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8lxrs8/",
          "created": 1718385933,
          "depth": 1,
          "replies": [
            {
              "id": "l8majlm",
              "score": 2,
              "body": "I actually like Tilray and how they have been acquiring brands in the alcohol space. Think once they start offering cannabis drinks through those brands, their revenue should take a pretty good jump.",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8majlm/",
              "created": 1718390277,
              "depth": 2,
              "replies": [
                {
                  "id": "l8n5v62",
                  "score": 0,
                  "body": "Weed drinks will be a short fad at best",
                  "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8n5v62/",
                  "created": 1718401196,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8nxidw",
                      "score": 4,
                      "body": "They already exist and they are wicked.",
                      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8nxidw/",
                      "created": 1718412853,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l8q3mkv",
                      "score": 1,
                      "body": "In New Mexico they are 100% against mixing weed and alcohol.   You can't even apply for a Cannabis license if you own a liquor license",
                      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8q3mkv/",
                      "created": 1718459694,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l8oe1w6",
              "score": 2,
              "body": "TLRY is incapable of not spending money like they're the US government and dilute shares nonstop.",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8oe1w6/",
              "created": 1718420340,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8nr8sz",
          "score": 1,
          "body": "Pabst already makes weed teas.",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8nr8sz/",
          "created": 1718410075,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8oxdbw",
      "score": 3,
      "body": "If a stock drops -99% from $100 to $1, it can drop -99% from $1 to $0.01 too 🤷‍♂️",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8oxdbw/",
      "created": 1718431842,
      "depth": 0,
      "replies": [
        {
          "id": "l8ppti5",
          "score": 1,
          "body": "Facts",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8ppti5/",
          "created": 1718452416,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8m0nok",
      "score": 5,
      "body": "Its time to get sober",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m0nok/",
      "created": 1718386908,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8m8djm",
      "score": 4,
      "body": "TLRY, for example, had $627M in revenue and lost $0.44/share (about $370M) in the last 4 quarters. Revenue growth about 20% yoy, but no path to profitability in near future. Will have to do further offerings to raise more capital.\n\nCGC is even worse, with negative revenue growth and equally bad profit margins\n\nOnly one that looks investment grade is IIPR. Profitable, although revenue growth only in single digits, and pays a dividend.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m8djm/",
      "created": 1718389540,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8lr8m6",
      "score": 6,
      "body": "Price ceiling on the product and the cost of regulation",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8lr8m6/",
      "created": 1718383738,
      "depth": 0,
      "replies": [
        {
          "id": "l8luizr",
          "score": 1,
          "body": "And so if that changes with tax updates…better margin?",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8luizr/",
          "created": 1718384841,
          "depth": 1,
          "replies": [
            {
              "id": "l8lupn2",
              "score": 6,
              "body": "Non legal dealers will adjust pricing accordingly",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8lupn2/",
              "created": 1718384904,
              "depth": 2,
              "replies": [
                {
                  "id": "l8lvy2a",
                  "score": 5,
                  "body": "This is 100% true. Weed stocks will always  be capped by this because they are always competing against a non-regulated market that is willing to drop its price to whatever",
                  "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8lvy2a/",
                  "created": 1718385317,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8m7ca2",
                      "score": 1,
                      "body": "\"willing to\"\n\nSeems to me the black market is always closer to the true price of the product, absent government interference.\n\nInstead of being hard to grow, its hard to stop it from growing (its a \"weed\")\n\nThe demand of a single person is on the order of a half-dozen plants worth per year at the high end. What does something like a watermelon at the grocery cost again?",
                      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m7ca2/",
                      "created": 1718389189,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8m76gp",
      "score": 2,
      "body": "Yeah I held out hope and got killed by IV crush on my $MSOX.\n\nFeelsbadman.jpg",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m76gp/",
      "created": 1718389133,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8n0gdo",
      "score": 2,
      "body": "It’s cost of entry problem. What’s stopping a competitor from opening up a shop tomorrow with a catchy name and drawing their market share? What is any of these companies competitive advantage? If new states legalize and they are first in line for permits, sure - growth. The problem is that anyone can sell weed and it’s a disposable income expense in a tight economy.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8n0gdo/",
      "created": 1718399179,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8nxvam",
      "score": 2,
      "body": "Baked in",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8nxvam/",
      "created": 1718413013,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8og5jh",
      "score": 2,
      "body": "It's a shitty, unprofitable industry for everyone except the corrupt insiders.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8og5jh/",
      "created": 1718421390,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8sjdiq",
      "score": 2,
      "body": "MSOS trading under 200 day moving average with a clear up trend starting. I believe we are nearing the bottom.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8sjdiq/",
      "created": 1718495971,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8m49jf",
      "score": 2,
      "body": "I have a few weed stocks still - originally made 100k when Canada legalized. I keep a couple just in case news comes and it pops. I think it's only a matter of time (for a quick play, that is).\nDon't trust me. Just a fellow regard",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m49jf/",
      "created": 1718388130,
      "depth": 0,
      "replies": [
        {
          "id": "l8mg1wj",
          "score": 1,
          "body": "What would you recommend?",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mg1wj/",
          "created": 1718392172,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8mgn8a",
          "score": 1,
          "body": "That’s what I’m thinking too w/ a quick play",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mgn8a/",
          "created": 1718392378,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8m0g2o",
      "score": 2,
      "body": "Go buy them on your own and get rekt on your own, cheers.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m0g2o/",
      "created": 1718386836,
      "depth": 0,
      "replies": [
        {
          "id": "l8m0laf",
          "score": 6,
          "body": "Haha thanks. Cheers",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m0laf/",
          "created": 1718386885,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8m5snu",
      "score": 1,
      "body": "Hop in, but set stop-losses tight, volatility is high in weed stocks!",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m5snu/",
      "created": 1718388659,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8m8uxo",
      "score": 1,
      "body": "why the need for physical weed when i can light it up in the metaverse",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m8uxo/",
      "created": 1718389706,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mckt8",
      "score": 1,
      "body": "Because it’s weed, was a great business because it was illegal but as everyone is learning, it’s now a commodity with too much supply.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mckt8/",
      "created": 1718390976,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mgvoh",
      "score": 1,
      "body": "The novelty of legalization has worn off and weed products have gotten cheap because of how much production there is now",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mgvoh/",
      "created": 1718392458,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mgwbh",
      "score": 1,
      "body": "I understand there are higher strains, testing, and research purposes but for weed in particular you can just grow your own. \n\nMaybe I'm just naive but I haven't seen someone make their own cigs or make their own beer (cheaply). Just my surface-level, WSB analysis. At least when you think \"weed stocks! hell yeah, everyone smokes! ones gotta go huge!\"",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mgwbh/",
      "created": 1718392464,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mp42u",
      "score": 1,
      "body": "Decent margins are only possible with regulatory capture. It's weed.. that grows like.. ",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mp42u/",
      "created": 1718395291,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mpyoi",
      "score": 1,
      "body": "Probably because they aren’t very profitable.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mpyoi/",
      "created": 1718395581,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mqg2i",
      "score": 1,
      "body": "TLRY is my pick-",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mqg2i/",
      "created": 1718395745,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mrue3",
      "score": 1,
      "body": "Its not a good sector in terms of actual business outcomes, would never invest long term, but the US weed sector is highly reactive to news and def a huge swing trade oppurtunity",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mrue3/",
      "created": 1718396221,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8msduv",
      "score": 1,
      "body": "They are beat up because only stupid potheads actually think selling weed is a good business venture.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8msduv/",
      "created": 1718396405,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8muyg1",
      "score": 1,
      "body": "Shaking weak hands  theres no money for everyone",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8muyg1/",
      "created": 1718397278,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mx1if",
      "score": 1,
      "body": "Weed stocks are penny stocks",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mx1if/",
      "created": 1718397997,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mybzs",
      "score": 1,
      "body": "We are approaching cannabis reschedule from 1 to 3. Once that happens large farms can pump product and price will crash. It will be a commodity business with some people caring about specialty. I have big doubts in the sectors future",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mybzs/",
      "created": 1718398438,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8myutb",
      "score": 1,
      "body": "All the legit brands seem to have terrible products curaleaf stuff used to be the worst.  I don’t use anymore but does someone have inside knowledge on who makes the most prestine stuff?",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8myutb/",
      "created": 1718398618,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8n4jnj",
      "score": 1,
      "body": "Been in and out of these since 2015. Made good money mostly with dumb luck on the timing of some massive runs. But the few things I held onto thinking “long term” are some of the worst purchases I ever made.\n\nI like weed. Like, a lot. But they’re not good stocks. The entire industry is a race to the bottom on pricing with an end game of Philip Morris or whoever swooping in and buying the still functioning businesses when they’re done beating the shit out of each other. It’s an amazing plant but ultimately it’s just an agricultural product and the way the stocks trade shows that.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8n4jnj/",
      "created": 1718400689,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8n5gi4",
      "score": 1,
      "body": "Black market is wayyy too stable and established imo. Think about any company in any sector and now think if you could get their product easier cheaper and better on the black market with little to no risk. This is why I have stayed away from it all. And take in to account it will probably be legal in most states and probably federally in the near future makes bad news for weed companies imo.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8n5gi4/",
      "created": 1718401039,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8n61oc",
      "score": 1,
      "body": "Do yourself a favour and don't. But if you're truely deadset on gambling your money away you're better off buying jimmy or the movie company. Risk is equivalent, but the chance of upward movement is grater on the aforementioned.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8n61oc/",
      "created": 1718401265,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8n84qh",
      "score": 1,
      "body": "Market saturation.. the end.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8n84qh/",
      "created": 1718402068,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8n9oox",
      "score": 1,
      "body": "Yes go all in!",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8n9oox/",
      "created": 1718402682,
      "depth": 0,
      "replies": [
        {
          "id": "l8ndf6k",
          "score": 1,
          "body": "Stonks only go up",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8ndf6k/",
          "created": 1718404202,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8nsou0",
      "score": 1,
      "body": "Over saturated market.  People can only smoke so much weed.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8nsou0/",
      "created": 1718410710,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8oe6ma",
      "score": 1,
      "body": "You’re better off buying PM",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8oe6ma/",
      "created": 1718420403,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8oxb5d",
      "score": 1,
      "body": "![img](emote|t5_2th52|4275)",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8oxb5d/",
      "created": 1718431803,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8uzf06",
      "score": 1,
      "body": "Ehhh, I’ve always been somewhat on the fence about weed stocks. For one, anyone can grow enough weed to last them a year. It’s not too difficult, and can potentially save a user quite a bit of money. On the other hand, industrial hemp production is a nice commodity play in my humble opinion.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8uzf06/",
      "created": 1718546199,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8y4mn4",
      "score": 1,
      "body": "I own Green Thumb and Curaleaf...small positions.  They were up big and now down big and seem to be flatlining.  I would NOT buy now.  Why?  Well, I do not see dispensary crowds as big as they were before.  I drive by several and they used to have so many cars in front of them (I live in CO).  Now I see 2-3 cars in front of each where I used to see 10-20.   It feels like weed has become more of a commodity.  That is my $0.02.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8y4mn4/",
      "created": 1718591798,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l90sr4o",
      "score": 1,
      "body": "When it goes legal federally we will order all our bud from 3rd world countries like everything else. Most of these stocks will fail unless they do the same. God bless capitalism?",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l90sr4o/",
      "created": 1718642221,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l99pi47",
      "score": 1,
      "body": "They need to federally legalize weed recreationally for these stocks to pop",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l99pi47/",
      "created": 1718775465,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzaxnl",
      "score": 1,
      "body": "I think a big announcement from the DOJ is coming out in the next two weeks. Might be good for another MSOX play.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/lhzaxnl/",
      "created": 1723587318,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8lz68z",
      "score": 1,
      "body": "I have some huge losses on HUGE.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8lz68z/",
      "created": 1718386405,
      "depth": 0,
      "replies": [
        {
          "id": "l8m0580",
          "score": 1,
          "body": "That’s the sense I get from the WSB community is that they’ve all been burned by the part or a stock of this market so no one wants to touch it",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m0580/",
          "created": 1718386734,
          "depth": 1,
          "replies": [
            {
              "id": "l8m1j2g",
              "score": 0,
              "body": "My understanding is that when it started getting legalized everyone saw huge potential for profits, and there were. The problem, to my knowledge, is that the market is absolutely saturated with people growing pot legally and surprisingly, the supply far exceeds the demand. I mean it was every pot heads dream to be able to grow pot legally. Now they can and they are. I've talked to a few dispensary owners and they said there is so much out there that it's getting hard for the growers (great DD I know).  The other thing is that pot is dirt cheap now.  You can get an 1/8 of what we would call \"good chronic\" back in the 90's and pay 50-60 bucks for for 10 bucks now.",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m1j2g/",
              "created": 1718387203,
              "depth": 2,
              "replies": [
                {
                  "id": "l8mq8ge",
                  "score": 1,
                  "body": "Supply issues vary wildly from market to market right now.\n\nSome states capped licensing/plant counts and have some mechanisms to actually enforce it, so the supply is artificially low.",
                  "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mq8ge/",
                  "created": 1718395672,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8mvk64",
                      "score": 1,
                      "body": "I could see that happening. It doesn't appear to be an issue here.",
                      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mvk64/",
                      "created": 1718397486,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8n1d4c",
                          "score": 1,
                          "body": "Depends on where \"here\" is.  IL and MA definitely have/had supply issues... meanwhile OR has insane oversupply issues.",
                          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8n1d4c/",
                          "created": 1718399504,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8m0vd7",
      "score": 1,
      "body": "Can’t really dominate when it’s literally a weed.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m0vd7/",
      "created": 1718386981,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mszor",
      "score": 1,
      "body": "My wife works in this business and nearly all of these companies are poorly run and subject to extremely bad legislation and tax schemes.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mszor/",
      "created": 1718396611,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8m075g",
      "score": 0,
      "body": "Most likely legalization hurts most of the companies, which is counter intuitive, I know.\n\n  \nAny short term news they will pop, but eventually the core bus is going to be the focus again which is bad for weed",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m075g/",
      "created": 1718386753,
      "depth": 0,
      "replies": [
        {
          "id": "l8m7w7p",
          "score": 2,
          "body": "All possible changes to the current laws risks the established monopolies and duopolies.\n\nIf you want to see these stocks go through the roof, have the government announce that \"Pot will always be a schedule 1 drug. We consider this matter closed\"",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m7w7p/",
          "created": 1718389376,
          "depth": 1,
          "replies": [
            {
              "id": "l8m8wub",
              "score": 1,
              "body": "Yeah and whether I can grow in backyard is a big factor. If they would allow in bars would be a big factor, etc.",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m8wub/",
              "created": 1718389723,
              "depth": 2,
              "replies": [
                {
                  "id": "l8mpzt8",
                  "score": 6,
                  "body": "Home grow is generally not materially important to the bottom line of these companies, for two reasons:\n\n1. Most people just won't.  You can grow tomatoes at home and yet overwhelmingly people still buy them in the store.\n\n2. The market has been shifting toward \"finished goods\" (vapes, edibles, drinks) and while you technically might be able to make something like them at home, they require knowhow and equipment home growers wont have.",
                  "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mpzt8/",
                  "created": 1718395591,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8qevx6",
                      "score": 0,
                      "body": "Yeah I shouldn't have picked that random data point, this is basically how I view it:\n\n\n\n\"Investors in the weed sector are crossing their fingers for the next legislation victory, yet they don’t realize legalization will actually **negatively** impact valuation in the long term. Each time a bill is proposed, there is a speculative pump that tricks these investors into having hope. The reality is **there is no hope in this sector.**\n\nAs weed gets legalized, these huge corporations see an increase in demand, more opportunities to sell, and an overall mindset shift toward the product. The reality is simple, as marijuana gets legalized, there will be significant increased competition. These bloated corporations will gain market share, but they will also lose more to get it, while also having significantly higher costs than a local small shop.\n\nThere is nearly no path to consistent profitability that will justify the valuation of these bloated corporations.\n\nThe only chance for increased valuation is actually through regulation. If the medical marijuana market becomes more selective on suppliers, or if there is a huge cultural shift to allow marijuana products inside of bars and clubs, then there could be a path to success for the companies willing to pivot to take advantage. This is such a longshot that no savvy investor can hold waiting for it.\n\n  \n The reality is **these companies will continue to dilute the shareholders in order to keep the company afloat until their time runs out.\"**",
                      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8qevx6/",
                      "created": 1718464800,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8s608g",
                          "score": 3,
                          "body": "Your view is not even remotely consistent with reality.  Nearly every sentence in it has a factual error.",
                          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8s608g/",
                          "created": 1718490165,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8s7lsu",
                              "score": 0,
                              "body": "Do you realize how many private companies there are?",
                              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8s7lsu/",
                              "created": 1718490844,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l8sd7c0",
                                  "score": 2,
                                  "body": "Yes - I am extremely familiar with the industry.\n\nWhat's your point?",
                                  "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8sd7c0/",
                                  "created": 1718493270,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "l8qevya",
                          "score": 0,
                          "body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8qevya/",
                          "created": 1718464800,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l8mpfww",
              "score": 1,
              "body": "This is absolutely false.\n\nNeither rescheduling nor federal legalization would touch the existing regime because they're established by state level law. \n\nRescheduling will remove 280E which will dramatically improve margins for operators.  Full legalization or SAFER would open up a lot of payment options that are currently not available or \"gray area.\"  Full legalization would allow for interstate commerce (I'm actually not clear if this would happen with schedule 3) and would deal with supply issues in certain markets.",
              "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mpfww/",
              "created": 1718395404,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8m0766",
          "score": 1,
          "body": "Well, I, for one, would NEVER hope you get hit by a bus.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m0766/",
          "created": 1718386753,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8m0f0n",
          "score": 1,
          "body": "So is this a buy the rumor sell the news opportunity? Buy now and ride any speculation leading up to 7/22? Offload before 7/22?",
          "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m0f0n/",
          "created": 1718386826,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8m1mot",
      "score": 0,
      "body": "Price ceiling and costs of regulations. Plus there's not much future growth priced in yet because of the hesitancy to make weed federally legal.",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8m1mot/",
      "created": 1718387236,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mkyyu",
      "score": 0,
      "body": "No you moron",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mkyyu/",
      "created": 1718393882,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8mx0gd",
      "score": 0,
      "body": "Stay away from SNDL and CGC!",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8mx0gd/",
      "created": 1718397988,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8qdn0c",
      "score": 0,
      "body": "This isn’t 2016. Weed play is over now",
      "permalink": "/r/wallstreetbets/comments/1dfv6xc/weed_stocks_why_so_beat_up_buy_now/l8qdn0c/",
      "created": 1718464255,
      "depth": 0,
      "replies": []
    }
  ]
}