{
  "title": "Hims & Hers - ",
  "score": 39,
  "selftext": "Well folks, my first post here. Longtime lurk, turned wall street jerk. Obviously not financial advice coming. I am new at this.\n\nThat said, I've been watching Hims & Hers since reading [a post 25 days ago](https://www.reddit.com/r/stocks/comments/1cwizmt/hims_follow_up_post/), and have thrown a few bucks into the blender to see what sticks. I think this is an excellent bet for long-time investors and potentially a banger for margin investing (I'm dabbling in 60ish day calls as Q2 earnings are due Aug 5, and some quicker calls too).\n\nNow that we're on after-hours time heading into the darkness that is the weekend, I thought it may be prudent to rally the troops and offer up some recent research so y'all can storm the proverbial beach Monday. If you like a more authoritative source, check out this [article ](https://finance.yahoo.com/news/evaluating-investment-potential-hims-hers-140003556.html)from yesterday (sorry to those who don't like Yahoo), but here are my takeaways looking forward.\n\nI like the stock:\n\n* These guys are taking a big slice of pie that is discreet prescriptions. They offer solutions for problems many of us have (i.e. libido, weight, hair loss). These things are things folks will always want. It's not a fad product, it's not the latest tech, it's not changing. Discreet prescribing, easy ordering, affordability, and easy delivery makes these products attainable by nearly anyone. In addition, those who use these products often continue to use them. As a balding man myself, I assure you that I would have to use their products for life if I gave a turd about my looks.\n* Like their product variety (recently adding weight loss drugs), their market share and their net revenue is growing. Take a look at the graph in the first link \\^. The growth is literally exponential. I know that's not sustainable ad infinitum. But those earnings aren't going down anytime soon.\n* These guys are going all in on ads. I've seen four baker's dozens of Hims ads this week, and I'd bet you have too. That means they want to *grow* growth. It's also clear they've already ironed out production, support for web users, all the corporate stuff that new companies could trip over. (I'm going with calls because accelerative growth spells big gains, but bet how you will)\n\nWhaddya'll think? Anything I missed? What should I be wary of as a relatively new investor/bettor??\n\nAnd please let me know if this post is lacking in quality or breaks any rules.\n\nI love you,\n\ntobeearnestthocomma",
  "link_flair_text": "Discussion",
  "id": "1dg4vm6",
  "num_comments": 65,
  "created_utc": 1718409242,
  "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/",
  "comments": [
    {
      "id": "l8npbwl",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8npbwl/",
      "created": 1718409244,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8nu4j5",
      "score": 23,
      "body": "Selling weeklies puts on HIMS has been kind to me so far.",
      "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8nu4j5/",
      "created": 1718411348,
      "depth": 0,
      "replies": [
        {
          "id": "l8nwrnt",
          "score": 9,
          "body": "Heck yass compadre, this week has been quite lucrative I'm sure. I was debating selling puts instead of buying calls, but my tiny gambling peanut brain said to go for broke. Cheers mate!",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8nwrnt/",
          "created": 1718412525,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8r5xv7",
          "score": 3,
          "body": "Just curious at what strike price ?  Trying to gauge my appetite in this but volumes on ones I’m looking at are lower than I like and spreads a bit larger",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8r5xv7/",
          "created": 1718475884,
          "depth": 1,
          "replies": [
            {
              "id": "l8wwz0c",
              "score": 3,
              "body": "Oh crap I meant to respond to all questions earlier.. I'm doing strikes at 30 for my longer bets (60 days and \\~45.. first time gambles for me), and 25 strikes for this month. I want to dabble in aggressive gambles right now, more as a learning experience as these are my first margin bets, and small... and I'm playing with the house's money at the moment. Not a recommendation, as I'm aggressive and going out on a limb.",
              "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8wwz0c/",
              "created": 1718572722,
              "depth": 2,
              "replies": [
                {
                  "id": "l8xq15j",
                  "score": 2,
                  "body": "I like it but highest weekly Put im thinking on this one is $20 strike weekly. But looking at buying a longer  dated PUT 90 days at $18 the volumes aren’t there for the insurance buy for me.",
                  "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8xq15j/",
                  "created": 1718585080,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8oneyr",
      "score": 25,
      "body": "Up 50k this year and not selling. Planned on giving the ultimate dd closer to earnings because this thing will moon and I have proof. Here is a teaser: the have substantial increased web traffic and ig followers (marketing) because of weight loss which has gone mostly unnoticed. Look at the followers by month on the website socialblade. It 5x in May and points to a massive earnings beat the next two earnings.",
      "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8oneyr/",
      "created": 1718425439,
      "depth": 0,
      "replies": [
        {
          "id": "l8op2se",
          "score": 5,
          "body": "Hell yea!! This is exactly what I want to hear. I'm striving to dig deeper in educating myself on my bets, and tracking web traffic and social media followings are a great tactic. Thanks for opening my eyes up a bit more, hermano.",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8op2se/",
          "created": 1718426453,
          "depth": 1,
          "replies": [
            {
              "id": "l8ophdj",
              "score": 9,
              "body": "No problem. You can also look at Google trends which is exploding (ignore the spikes that correlate with earnings and CEO comments), and the fact that their average order is $55 but weight loss is $70-300, so each new subscriber is worth more than old subscribers.",
              "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8ophdj/",
              "created": 1718426708,
              "depth": 2,
              "replies": [
                {
                  "id": "l8oqc7t",
                  "score": 3,
                  "body": "That info is gold! Much more depth than I've been aware of. All signs point to buy, let's ride! Definitely going to reinvest some of my calls, and keep an eye on those earnings. Cheers, mate!",
                  "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8oqc7t/",
                  "created": 1718427247,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8ozwd1",
          "score": 3,
          "body": "Would that already be reflected in the very next earnings?",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8ozwd1/",
          "created": 1718433605,
          "depth": 1,
          "replies": [
            {
              "id": "l8p0ju9",
              "score": 5,
              "body": "Yes for 5-6 weeks because they charge people upfront. So GLP1 cost $300 for 3 months and they get $900 right away. \n\nAnd next quarter will be the full 12 weeks of selling glp1 so it will be a even more acceleration of growth.",
              "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8p0ju9/",
              "created": 1718434066,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lk95fvs",
          "score": 1,
          "body": "What's been happening to HIMS lately?",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/lk95fvs/",
          "created": 1724799633,
          "depth": 1,
          "replies": [
            {
              "id": "lk98ed8",
              "score": 1,
              "body": "Still holding and the market for what ever reason can't differentiate between Eli Lilly and Novo Nordisk. They are not at any risk to not being able to sell GLP 1s despite all the uncertainty revolving around this. Novo Nordisk supply is still in shortage and another GLP 1, Liraglutide, comes off patient in November.\n\nThis will allow Hims to sell their own GLP 1 for a fraction of the cost by the end of the year. \n\n [Most Zepbound customers](https://www.reddit.com/r/Zepbound/comments/1f2e6d2/lilly_sells_zepbound_vials_at_50_discount_to_meet/) are not pleased with this price drop like the media thinks. They are still complaining it is too expensive at $500-600 while Hims is reasonable priced. And this is only for the starter dose, they are planning to get people hooked on the drug so they can hike the prices for the dosage increase.\n\nWeb traffic is still higher in July and August than ever before according to Google Trends. This company will do over 2 billion revenue in 2025 easy. Maybe 2.5. Can't wait for 2027 call option to come out and might buy at current prices.",
              "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/lk98ed8/",
              "created": 1724800684,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8q0sj7",
      "score": 16,
      "body": "*Not financial advice.*  With ya on this one.  Going to drop my schizo \"dd\" here as well for anyone who's researching this company.  I'm curious to hear what others have gathered.\n\n- 80% gross margins.  50% of revenue spent on marketing to further increase recurring revenue.  If they decided to switch off the marketing machine this company would suddenly be extremely profitable.\n\n- Marketing is working.  [Search interest](https://trends.google.com/trends/explore?date=today%205-y&geo=US&q=%2Fg%2F11fkypmfp7,%2Fg%2F11c3krgywp&hl=en) in the Hims brand has been steadily rising over the past 5 years, while interest in competing companies (Teladoc for example) have stagnated.\n\n- Marketing is working really well.  +60% revenue increase yoy.\n\n- Low debt to equity ratio. $105 mil in cash and equiv., $103 mil in total liabilities.  There's no risk on the balance sheet, they could pay off all their debts any time they want with cash and equiv.\n\n- ~14% short float.  Not enormous, but significant.  Maybe shorts will keep doubling down and price will keep sliding up.\n\n- Small $5 bill market cap.  Price could move a lot from just a handful of buyers.\n\n- The CEO believes in his company.  [Andrew Dudum is a 10% owner](https://www.gurufocus.com/insider/177824/andrew-dudum) with a $264 million stake.  His recent sales have been tiny compared to his overall stake.\n\n- Compared to other companies, the valuation of Hims is cheap.  The price to sales ratio on a lot of big high-growth tech companies (MSFT, AAPL, NVDA, etc.) is >10.  Hims is only at ~5, so 2x in price isn't unreasonable.  Compared to another small $10 bil cap company (ELF) with similar sales of $1 bil, similar gross margin of 70%, higher debt-to-equity ratio, and IMO less stable revenue, Hims should be at least 2x current price today, even higher next year.\n\n- Biggest downside risk I've read so far is \"no moat\".  [85% subscriber retention rate](https://www.emarketer.com/content/hims-hers-caps-off-forceful-2022-by-nearly-doubling-its-revenues) is the moat.  Moats are bs anyways imo, every new growth company could face competition from a larger competitor.  TSLA still ate the lunch of established auto manufacturers.  AMD still ate the lunch of the biggest chip fab in the country, INTC.\n\nLove you too\n\nuser161214",
      "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8q0sj7/",
      "created": 1718458291,
      "depth": 0,
      "replies": [
        {
          "id": "l8qfj7i",
          "score": 6,
          "body": "Yes yes yasssssss, eff it, I might go for a y o l o bet with all this positive feedback. 8 upsides to this company to 1 possible risk? I'm pulling out my non-existent child's college fund.\n\nThank you for the thorough insight, I'm still learning to look for good indicators in market research but wow have I just been pecking around in the dirt. Looks like I tripped onto a rocket ship to the moon though, let's get it, user161214!",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8qfj7i/",
          "created": 1718465082,
          "depth": 1,
          "replies": [
            {
              "id": "l8qj8sq",
              "score": 3,
              "body": "Lmao!  You should know I have no professional financial experience and I'm not giving financial advice.  I'm excited for this company but I'm not betting the farm on it, I've been burned enough times in the past to know investments don't always go the way you expect.  All that being said, I'm giving more weight to my HIMS position right now than my other investments.  Also, there's always unforeseen risks, if another recession hits I'm not sure how well these growth stocks will fare.  I've also seen regulatory issues surrounding telehealth as a potential risk, they list a bunch of risks in their financial statements.\n\nAnyways, good luck to you w/e move you decide to make!  Don't let the casino ruin you though.",
              "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8qj8sq/",
              "created": 1718466664,
              "depth": 2,
              "replies": [
                {
                  "id": "l8qo1y7",
                  "score": 3,
                  "body": "Right on, I appreciate the words of caution. I'm certainly not a big bettor at the moment. Think like 5 calls at a time. And I'm playing with the house's money after a lucky strike a few months back. Mostly joking about going all in. No all in bet is a good one.\n\nI'm glad you're on the HIMS train, and as others have pointed out, most indicators are positive. I'll keep checking my blind spots though and aim to diversify more and more as I get into the wall street game.\n\nCheers my compadre, thanks for the wise words!\n\nEdit: forgot an apostrophe",
                  "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8qo1y7/",
                  "created": 1718468710,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8qijo0",
              "score": 2,
              "body": "Do it brother!",
              "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8qijo0/",
              "created": 1718466373,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8qye2j",
          "score": 3,
          "body": "Excellent points, however I wouldn’t consider teladoc a competitor since it’s a very different business model, they aren’t selling pharmaceuticals and they go through insurance. \n\nAlso in their latest earnings calls and press releases they’ve been emphasizing their ability to compound/personalize medications and I think that will be their moat going forward. Medication adherence (getting people to take their drugs when they’re supposed to take them) is a big problem and Hims’s ability to personalize the form factor (gummies, pills, injections, etc..) and possibly combine multiple prescriptions into a single dose can address this. There are some regulatory issues around it because it’s new, but if Hims can work with the FDA to address their concerns and pioneer a regulatory framework then it will give them one hell of a moat. ",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8qye2j/",
          "created": 1718472851,
          "depth": 1,
          "replies": [
            {
              "id": "l8qzrfp",
              "score": 3,
              "body": "Well said, and I appreciate your points on Teladoc and potentially carving a moat with the FDA.",
              "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8qzrfp/",
              "created": 1718473388,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l90iu4c",
              "score": 1,
              "body": "LOL. $HIMS having any sort of “go” signal from the FDA is unlikely.",
              "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l90iu4c/",
              "created": 1718638820,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8qie4j",
          "score": 3,
          "body": "Love you brother!",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8qie4j/",
          "created": 1718466307,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8q0sk7",
          "score": 2,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8q0sk7/",
          "created": 1718458291,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lk95m1h",
          "score": 2,
          "body": "What's been happening to HIMS lately? Lots of red",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/lk95m1h/",
          "created": 1724799693,
          "depth": 1,
          "replies": [
            {
              "id": "lkew2nm",
              "score": 1,
              "body": "Bloody as hell.  From what I can tell, it's getting beat up for the following reasons:\n\n- They won't be able to continue selling GLP-1s due to shortages ending.\n\n- [LLY is offering Zepbound direct to consumers](https://abcnews.go.com/GMA/Wellness/eli-lilly-sell-zepbound-directly-consumers/story?id=113156533).\n\nMaybe we're trying to catch a falling knife, but I'm still bullish and adding due to counter-arguments:\n\n- HIMS GLP-1s aren't copycats of Eli Lilly drugs, they're copycats of Novo Nordisk drugs, and Novo hasn't indicated a shortage ending in the near-future.\n\n- Zepbound direct will cost ~$399 a month, still significantly more than HIMS offering at $199 a month.\n\n- GLP-1s made up only 5% of Q2 revenue report, making GLP-1 concerns mostly inconsequential.\n\nOther reasons I'm still bullish:\n\n- HIMS board approved another $100 million share repurchase.  Average price of previous share repurchase was ~$13-14.\n\n- Short interest in the stock recently increased from ~19 million shares to ~23 million putting the short float back at ~14%.\n\n- Revenue growth without GLP-1s was and remains strong.  Looking forward to the next quarterly report with potentially a full quarter of GLP-1 sales as icing on the cake.",
              "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/lkew2nm/",
              "created": 1724885664,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8o2nkp",
      "score": 13,
      "body": "first boner pills, then was hairloss drugs, next was weight loss injections, next will be birth control and plan b",
      "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8o2nkp/",
      "created": 1718415135,
      "depth": 0,
      "replies": [
        {
          "id": "l8o37s7",
          "score": 4,
          "body": "Ha, that's accurate.. They already have birth control pills too, [as of 2018](https://www.fastcompany.com/90258512/hims-launches-hers-mens-wellness-startup-now-has-a-badass-sister).",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8o37s7/",
          "created": 1718415386,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8nudg8",
      "score": 7,
      "body": "I have January 2025 calls, and saw this today: \n\n[Blue Cross Blue Shield of Michigan drops coverage of weight loss drugs](https://www.cbsnews.com/detroit/news/blue-cross-blue-shield-of-michigan-dropping-coverage-of-certain-weight-loss-drugs/)",
      "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8nudg8/",
      "created": 1718411457,
      "depth": 0,
      "replies": [
        {
          "id": "l8nverg",
          "score": 5,
          "body": "So true, there are so many people across the country that can't get weight loss drugs covered by their insurers (and those who don't have insurance whatsoever), making affordable weight loss drug providers even more in demand. It's a bit sad but a convenient boost for low-cost e-prescription providers, and this exact market.\n\nBest of luck with those calls, things could go way big compadre!\n\n\\*Edited: forgot a word",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8nverg/",
          "created": 1718411918,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8qhs2m",
      "score": 6,
      "body": "Hey u/tobeearnestthocomma,\n\nDo you know how HIMS actually obtains their drugs, where are they sourcing them from. I have no clue where they actually make the most revenue and profit from so I would love to see a distribution of their revenue in a chart similar to this:\n\nhttps://preview.redd.it/igw6jjeu9r6d1.jpeg?width=2047&format=pjpg&auto=webp&s=2c9231de0c4c8567e68871baef3704496fbd6012",
      "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8qhs2m/",
      "created": 1718466047,
      "depth": 0,
      "replies": [
        {
          "id": "l8qmu6s",
          "score": 3,
          "body": "Also, another followup: It looks like they source from third-party producers like Truepill and Curexa. I had thought they had the production infrastructure, but again, I'm a bit ignorant.",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8qmu6s/",
          "created": 1718468188,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8qm1pu",
          "score": 2,
          "body": "Heyo, I didn't do as deep a dig as some other users, but this [letter ](https://s27.q4cdn.com/787306631/files/doc_financials/2024/FINAL-Q1-2024-Shareholder-Letter-3.pdf)has a great breakdown of Q1 earnings this year. I don't have time to read the whole thing rn, but the full balance sheets are towards the end. Hope that helps!",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8qm1pu/",
          "created": 1718467850,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9a1h6m",
          "score": 1,
          "body": "You should ask someone in the data is beautiful subreddit to make it.",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l9a1h6m/",
          "created": 1718783458,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8qvkgw",
      "score": 6,
      "body": "I’m curious to see if HIMS will make a push into the Testosterone market. It makes a ton of sense and has synergy with their other products. Online T doctors and pharmacies already exist but none with the name recognition of HIMS. They have to keep growing their product offering and this is the one that makes the most sense.",
      "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8qvkgw/",
      "created": 1718471719,
      "depth": 0,
      "replies": [
        {
          "id": "l8rjow3",
          "score": 2,
          "body": "Yes, MorePlatesMoreDates needs more competition.",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8rjow3/",
          "created": 1718481306,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8os4ly",
      "score": 6,
      "body": "Curious to know the uniqueness of the model. Why can other player not enter in this if they see the model succeeding ?\n\nI spent 10 min answering 50+ questions and creating a profile for Depression / Anxiety medication and then I saw the potential $147 as a cost for 30 days of pills. I am not sure how comparable that this to visiting your healthcare provider. I mean their website and UI looks cool to cater to Gen Z but not if they have something reliable. \n\nAll that to say there is surely strong momentum so why not cash in while the wind is blowing in the favor.",
      "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8os4ly/",
      "created": 1718428408,
      "depth": 0,
      "replies": [
        {
          "id": "l8otpc4",
          "score": 2,
          "body": "I don't think it's entirely unique, there are many other players in Telehealth (GoodRX, Cerebral, etc.), but I think Hims & Hers is ahead of the game in their image and ease of use.\n\nAnd I think they provide competitive pricing (in general, though I haven't looked product by product). Here's an [article](https://www.cbsnews.com/news/hims-hers-glp-1-weight-loss-drug-199-wegovy-price/) about breaking into weight loss prescriptions with a far cheaper product.\n\nI think they're just hitting on all cylinders right now, especially marketing... feels like a good pony to back!",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8otpc4/",
          "created": 1718429427,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8p4pna",
      "score": 6,
      "body": "Sold my hood calls to go all in on some 11/24 30c.  Have a good feeling about this one. Or maybe that’s just the dick pills.",
      "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8p4pna/",
      "created": 1718437089,
      "depth": 0,
      "replies": [
        {
          "id": "l8qdigh",
          "score": 3,
          "body": "Hahaha whatever gets it done!! I have quicker calls than that for 30 (late Aug). Some say I'm too quick. On account of the pills.",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8qdigh/",
          "created": 1718464199,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8p9ttj",
      "score": 4,
      "body": "Imagine if they tapped into the adderall market",
      "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8p9ttj/",
      "created": 1718440990,
      "depth": 0,
      "replies": [
        {
          "id": "l8qdznt",
          "score": 5,
          "body": "No joke, just tack on another zero to that bottom line. Especially with the sporatic shortages.",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8qdznt/",
          "created": 1718464410,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8qtwwu",
      "score": 4,
      "body": "p/e is negative 1500. Stock recently doubled in past couple months. Its not the right time. This company is trading at a massive premium.",
      "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8qtwwu/",
      "created": 1718471056,
      "depth": 0,
      "replies": [
        {
          "id": "l8qx1jr",
          "score": 8,
          "body": "p/e ratios are often outrageous for growth stocks.  this company is dumping profits into marketing because it's still in growth phase.  recent quarter however had positive net income.",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8qx1jr/",
          "created": 1718472306,
          "depth": 1,
          "replies": [
            {
              "id": "l8wyzfg",
              "score": 2,
              "body": "I'm glad to hear this. I was thinking about responding to this comment by siting Amazon and the amount of debt they acquired to gain traction in the prospective market. I've been wide-eyed with HIMS' revenue data, which seems astounding, but I shouldn't overlook P/E. I do think overall projections can trump P/E in certain cases, especially in tech, medicine, and other markets where long-term goals are just that: long term. And investment is necessary to break into, grow, capture, and hold a market share.\n\nI do feel Hims & Hers is making the right moves as a relatively young company to take those steps.\n\nIt's hard to believe they don't see this plan working. It's easier to believe they have a profitable strategy, which they're track record shows they fully commit to.",
              "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8wyzfg/",
              "created": 1718573513,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8qx89n",
          "score": 3,
          "body": "Fair enough, though this [source ](https://companiesmarketcap.com/hims-hers-health/pe-ratio/#:~:text=P%2FE%20ratio%20as%20of,%2FE%20ratio%20of%20%2D20.0)says it's at -111 (still bad). However, projections like [this one](https://www.nasdaq.com/market-activity/stocks/hims/price-earnings-peg-ratios), say that's going to change this year with a 264.44 raise in P/E.\n\nCan I ask your source? And am I cherry picking data??\n\nCheers mate!",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8qx89n/",
          "created": 1718472383,
          "depth": 1,
          "replies": [
            {
              "id": "l8qy7dg",
              "score": 4,
              "body": "not cherry picking data, just looking at robinhood homepage. Even if we have different sources for exact number, I think the sentiment is what matters here -- just too expensive at current (for me at least). I wouldn't care about this valuation if it was a meme stock like GameStop for instance because fundamentals just don't matter for the meme. But, this is a real company & valuation matters. \n\nhttps://preview.redd.it/p6lj6miftr6d1.png?width=1956&format=png&auto=webp&s=532f1c0422c9de3980bc00270707b4cd1409c8e9",
              "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8qy7dg/",
              "created": 1718472776,
              "depth": 2,
              "replies": [
                {
                  "id": "l8qzmg3",
                  "score": 3,
                  "body": "Whoa! That's a big difference.. 15-fold. And I agree, the sentiment does speak to the risk in investing with HIMS right now. Good data to keep in mind, and I think that I, like many, am looking ahead (probably too optimistically).\n\nThank you for the input and perspective. I'll keep a keen eye on their change in P/E in the coming months, especially August's Q2 report.",
                  "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8qzmg3/",
                  "created": 1718473335,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l90ccrx",
      "score": 2,
      "body": "Good analysis. I’m in the $26c for Nov. and getting my ass handed to me for now. Bought at 6% up today. Hope there is more upside otherwise loss porn coming due to you regards.",
      "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l90ccrx/",
      "created": 1718636545,
      "depth": 0,
      "replies": [
        {
          "id": "l90jp2n",
          "score": 2,
          "body": "Hold your positions brother.",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l90jp2n/",
          "created": 1718639118,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l90jz0v",
          "score": 2,
          "body": "I believe in the company in the short to medium term. In the long term, they are definitely going to run into some issues with regulators and the FDA. Some of their products are quasi-legal, grey-market in terms of what states allow them to be shipped or sold.",
          "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l90jz0v/",
          "created": 1718639215,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9nz48c",
      "score": 2,
      "body": "Counterpoints: 1) Both the CFO and CCO have sold off sizable amounts of their holdings this month (40% and 70%, respectively); 2) HIMS is able to sell compounded semaglutide (weight loss) because 3 of the dose sizes are currently in shortage.  This could end at any moment (unlike their other product lines), reversing a sales projection that's already reflected in the price.  \n\nRegardless, ad conversion has stayed consistent as revenue has grown (they spend 44% of revenue on advertising) and their SG&A also seems to grow proportionally to revenue.  So they can be expected to always do 80% gross margins, with another 44% ads and 30% SG&A.  So at a $1B, they'll do $800M gross profit against ad costs of $440M and another $300M in SG&A.  That leaves $60M net, which has covered other costs ($66M last year).  So at $2B in revenue they can maybe eek out $60M in earnings, which means that even if you assume they double revenue in the next year they're currently priced at 80x some very rosy future earnings.\n\nI'm sure people will buy this stock, so it's doesn't matter.  But the only economic winners with their business are the advertisers (for instance, RDDT).",
      "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l9nz48c/",
      "created": 1719000543,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8nq3ka",
      "score": 3,
      "body": "Aaaaand just realized my donkeybrain posted this rant without finishing the title. Oopsie poops.",
      "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l8nq3ka/",
      "created": 1718409575,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9a1ms0",
      "score": 1,
      "body": "Am I the only one that always gets HIMS ads on Reddit?",
      "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/l9a1ms0/",
      "created": 1718783568,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laiq3jt",
      "score": 1,
      "body": "It was a great thesis but I’ve experienced pain since open.\n\nhttps://preview.redd.it/bgt94tica49d1.jpeg?width=750&format=pjpg&auto=webp&s=f7dc4217eb147ab120d0b23ae545ff1ddc0c9728\n\nFinally out.",
      "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/laiq3jt/",
      "created": 1719495310,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgji53s",
      "score": 1,
      "body": "Torched",
      "permalink": "/r/wallstreetbets/comments/1dg4vm6/hims_hers/lgji53s/",
      "created": 1722821164,
      "depth": 0,
      "replies": []
    }
  ]
}