{
  "title": "Could Etsy make a comeback?",
  "score": 38,
  "selftext": "So ETSY is at $54.58 today (June 14th 2024). It saw a huge peak in 2021 (stock was around $290). Took a hit the next spring because they raised transaction fees from 5% to 6.5%. Since then, there was a bump to $140 in early 2023, and 52 week high was $102.81.\n\nThere was a lot of backlash after they raised fees, but it appears that it has largely settled. The majority of sellers presumably stayed ([graph](https://www.marketplacepulse.com/stats/etsy-number-of-active-sellers)). \n\nThey will gain the revenue lost from the transaction fee increase by… you know, the transaction fee increase. +1.5% is nothing to sneeze at.\n\nI doubt that it will ever go back to $290, but I’m tempted. Granted, I’m bias because I use Etsy and motley fool likes it ([link](https://www.fool.com/investing/2023/12/20/etsy-stock-in-2024-boom-or-bust/)) and their suggestions have worked for me in the past. But they could also be enchanted harlequins tricking me with their fancy hats.\n\nI’m thinking of investing some of my profit from EFTs. It’s def risky, what do y’all think? \n\nEdit: links and clown comment\n",
  "link_flair_text": null,
  "id": "1dga78e",
  "num_comments": 47,
  "created_utc": 1718427074,
  "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/",
  "comments": [
    {
      "id": "l8osdcb",
      "score": 206,
      "body": "I sell on Etsy.\n\nThey need to get rid of the Chinese junk",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8osdcb/",
      "created": 1718428569,
      "depth": 0,
      "replies": [
        {
          "id": "l8otigu",
          "score": 49,
          "body": "office caption serious bright silky hard-to-find gullible sip wrench like\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
          "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8otigu/",
          "created": 1718429308,
          "depth": 1,
          "replies": [
            {
              "id": "l8ovhx1",
              "score": 20,
              "body": "Yeah Etsy has some issues for sure.\n\nIt’s not to say it’s bad. But it needs some cleanup so the good stuff doesn’t get covered in resellers junk.\n\nWe do much better on Amazon lately",
              "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8ovhx1/",
              "created": 1718430593,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8t0te5",
              "score": 3,
              "body": "Bruh that’s super funny, my wife must have bought same mugs about a month ago and we had the same conversation! 😂",
              "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8t0te5/",
              "created": 1718503909,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8rlvkv",
          "score": 5,
          "body": "The last 3 items I bought off there had great reviews and were absolute garbage when it arrived. Just like in baseball strike 3 your out. I will never use the site again unless I see significant changes, which won't happen.",
          "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8rlvkv/",
          "created": 1718482148,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8p4qos",
      "score": 65,
      "body": "The culture of Etsy is completely different today than it was even a year ago. It's no longer a handmade platform. They hold seller's money in reserve accounts for up to 180 days without funding the seller and it doesn't matter how long you've sold on the platform.\n\nThere is now more dropshippers, AI art and resin tumblers than actual handmade products. It's a totally different platform. I sold my Etsy. It's just a static ebay now",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8p4qos/",
      "created": 1718437109,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8p4my3",
      "score": 64,
      "body": "I would be interested to see how many return buyers they have. It's essentially a drop shippers paradise. \n\nIt grew a reputation for selling handmade products from small businesses. Really organic, great quality one of a kind products.\n\nNow it uses that reputation to flog crap from alibaba for 10x the price.\n\nThere's absolutely no future in this company, they've gone in one clear direction and haven't changed since. How can Etsy compete with Ebay, which is EXACTLY the same shit + a huge second-hand market. And Alibaba/Temu, which is EXACTLY the same shit for 10x cheaper.",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8p4my3/",
      "created": 1718437033,
      "depth": 0,
      "replies": [
        {
          "id": "l8s4qel",
          "score": 1,
          "body": "Note that Etsy also owns reverb.com and depop",
          "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8s4qel/",
          "created": 1718489629,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8q9p8p",
      "score": 20,
      "body": "Etsy is turning into Amazon with tons of cheap junky things on there. Not what it originally was.",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8q9p8p/",
      "created": 1718462515,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8p1msl",
      "score": 40,
      "body": "Short answer: No,  it peaked cause of covid, doubt we’ll see it even hit 100. \n\nThere’s something fundamentally wrong with its business now, the S&P 500 has been going up and Etsy has lost half its value in past year\n\nEarning report be next month, likely see further drop. if it falls to below 30, I’d say throw a few k in. Best sit on the sidelines til the earnings report",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8p1msl/",
      "created": 1718434832,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8q7xuw",
      "score": 15,
      "body": "Just heard a news blurb about how much of Etsy is no longer “hand made” and shoppers are looking for an alternative.",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8q7xuw/",
      "created": 1718461715,
      "depth": 0,
      "replies": [
        {
          "id": "l8tg77y",
          "score": 3,
          "body": "Please somebody make that. It’s such a depressing experience when old Etsy is exactly the platform I’d like to shop on.",
          "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8tg77y/",
          "created": 1718511525,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8w2ule",
          "score": 2,
          "body": "I found out a seller I bought a shirt from just drop ships using printify. I needed more shirts made so I went directly to printify",
          "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8w2ule/",
          "created": 1718561451,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8qns8d",
      "score": 11,
      "body": "I got into Etsy years ago at $45 And sold my shares when It was pretty high, I am so glad I got out of the stock\n\nI used to love Etsy and would use it all the time but then they changed things around and now there's soo many Chinese sellers the place is like Alibaba and a shell of its former self.\n\nI would definitely stay away from this stock, get SHOP instead",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8qns8d/",
      "created": 1718468594,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ptync",
      "score": 29,
      "body": "Some MBA dickwad probably thought it would be great to allow Chinese dropshipping on there to boost numbers or whatever but product quality has dropped off a cliff. It was their differentiator, I can get the same crap off of Temu for cheaper. Why bother with Etsy?",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8ptync/",
      "created": 1718454731,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8q8vwd",
      "score": 8,
      "body": "There are a number of directions Etsy could grow but currently it’s overrun with people reselling crap from large Chinese mfgs and nobody really needs that or wants to wade through it.  And Etsy doesn’t seem interested in fixing the problem or growing in any particular direction.  \nEtsy could be a great place for original art but again, they’d need to use resources to make sure the art is original\nEtsy could be a great place for used items and could take a bite out of eBay - or what eBay used to be.\nEtsy is actually great for plants and I think they should lean into this more.\nEtsy should straight up open a greetings card store but again, would have to be curated - I actually buy greetings cards on Etsy but am frequently disappointed when the cards arrive late being drop shipped off Amazon.\nEtsy is good for jewelry too but there are too many shady sellers and again, it would take oversight to make it grow.\nAnd that’s my Etsy rant",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8q8vwd/",
      "created": 1718462148,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8pjikm",
      "score": 6,
      "body": "I much prefer SHOP, MELI, PDD etc in E-commerce.",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8pjikm/",
      "created": 1718448538,
      "depth": 0,
      "replies": [
        {
          "id": "l8reo2b",
          "score": 3,
          "body": "Yeah, thinking I’m going to go with SHOP instead",
          "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8reo2b/",
          "created": 1718479337,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8rlgkp",
      "score": 5,
      "body": "I don’t shop on Etsy anymore. I don’t trust the market place as a buyer. Everything looks like Chinese counterfeit. They don’t appeal to sellers or buyers. Hard pass.",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8rlgkp/",
      "created": 1718481987,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8qwfjv",
      "score": 4,
      "body": "I sell on Etsy. It is a miserable experience for both sellers and buyers. They peaked during covid and they've been making policy changes to try to get back to where they were and those changes are actively making things worse.",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8qwfjv/",
      "created": 1718472063,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8rmpch",
      "score": 3,
      "body": "\"I doubt that it will ever go back to $290\"\n\nIt went that high because everyone and their mom was selling custom made/custom designed masks becuase no one could actually buy any from retailers due to being out of stock or not available and then Ety's revenue went through the roof.\n\nIf you recall Amazon removed the ability to sell medical equipment relating to COVID on amazon, so you couldn't buy or sell PPE/medical equipment on Amazon.\n\nEtsy will never get that high again unless, again, something totally random and unplanned happens.\n\nI don't really see what they can do to increase, especially with more platforms around, such as vinted.",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8rmpch/",
      "created": 1718482467,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8rwmxe",
      "score": 4,
      "body": "I’ve been buying off Etsy for 17 years and barely use it anymore. Too difficult to filter the results to actually get handmade/vintage results. It’s inundated with the same Chinese shit you get from Amazon but with less ease of purchase. I’ve mostly gone back to ebay. Oh also the home page sucks - it doesn’t expose me to items I might like unless they’re almost exactly what I’ve already searched or purchased.",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8rwmxe/",
      "created": 1718486315,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8pbw1t",
      "score": 10,
      "body": "So called brand image or reputation is based on being marketplace for handmade items. But reality is far different, the handmade items are lost in the mix of garbage. Even requesting handmade or filtering etc. still returns non handmade items. So they have destroyed their own brand.\n\nIf you walked into Cartier's and they were selling K-mart costume jewelry you would just walk out. Simple. How is this a \"mystery\" . . . ?\n\n  \nAs for OP being a \"user,\" or the Motely Fool promoting this stock, well that in itself should be a giant red flag.",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8pbw1t/",
      "created": 1718442583,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8rptn4",
      "score": 3,
      "body": "recent thing i bought i discovered was chinese and poor quality. disappointing bc used to be awesome. make etsy great again",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8rptn4/",
      "created": 1718483676,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8rxtsw",
      "score": 3,
      "body": "Once they allowed all the Chinese stuff they lost",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8rxtsw/",
      "created": 1718486792,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8os8tb",
      "score": 4,
      "body": "I think TAM of Etsy is not really as large as the ceo claims",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8os8tb/",
      "created": 1718428485,
      "depth": 0,
      "replies": [
        {
          "id": "l8rfczo",
          "score": 1,
          "body": "TAM?",
          "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8rfczo/",
          "created": 1718479610,
          "depth": 1,
          "replies": [
            {
              "id": "l8rfl4q",
              "score": 2,
              "body": "Total addressable market",
              "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8rfl4q/",
              "created": 1718479700,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8osky9",
      "score": 3,
      "body": "I love etsy but they're a hold at best imo",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8osky9/",
      "created": 1718428706,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8osbny",
      "score": 2,
      "body": "following*",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8osbny/",
      "created": 1718428538,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ua0uv",
      "score": 2,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8ua0uv/",
      "created": 1718531844,
      "depth": 0,
      "replies": [
        {
          "id": "l8v1tkl",
          "score": 2,
          "body": "+1 for PDD",
          "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8v1tkl/",
          "created": 1718547208,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8s6hvh",
      "score": 1,
      "body": "Etsy is a weird marketplace.\n\nFocuses heavily on smaller sellers that put up with crappy experiences and bad tools. Bad seller support. I joked with someone i know that if you have a seller account problem, the best way to get a response is to tweet them, otherwise they will ghost you.\n\nIf you've sold on basically any larger platform you're going to feel pain on etsy. It is never going to appeal much to more than small mom and pop sellers (without significant changes).\n\nI'm sure etsy is going to continue capturing small sellers of hand made stuff and drop shippers, but i don't see it expanding beyond that. Also most people don't want to buy stuff like that when something that is mass produced is going to be way cheaper. Obviously there are exceptions and i'm generalizing every product in existence, but it limits their business.\n\nIn summary, i just don't think the products etsy can support are worth the hype it has had since covid.",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8s6hvh/",
      "created": 1718490375,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8s6uyo",
      "score": 1,
      "body": "I bought Etsy in 2021 for around $90, I finally gave up and sold all my shares this week. I doubt it ever gets over $100 again. It’s too expensive to order compared to where you can order everything else and it’s not all custom handmade stuff anymore. Unless they update shipping options it’s gonna be a no for me",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8s6uyo/",
      "created": 1718490530,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8spi45",
      "score": 1,
      "body": "Etsy has lots of crap now. I would stay away",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8spi45/",
      "created": 1718498718,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8srlnn",
      "score": 1,
      "body": "No",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8srlnn/",
      "created": 1718499678,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8tf68i",
      "score": 1,
      "body": "I view it as a flash in the pan, the QC has tanked as others have said. I haven’t seen anything from their leadership to make me think it will change",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8tf68i/",
      "created": 1718510973,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ufnxb",
      "score": 1,
      "body": "i sell 1.2m on amazon, 50K on etsy, 50K on walmart.   5K annual on ebay.\n\n  \nI would short ebay before anything . That said, I do not think it will ever get over 200. $100 is going to happen though. \n\n  \nThey have been cleaning it up a little.",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8ufnxb/",
      "created": 1718535862,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ujoxd",
      "score": 1,
      "body": "What ETFs did you profit from?",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8ujoxd/",
      "created": 1718538379,
      "depth": 0,
      "replies": [
        {
          "id": "l8xjhh6",
          "score": 1,
          "body": "Should’ve said mutual fund/EFTs, but my top ones are FXAIX (+19.4%), SPTM (+14.4%), and VIT (+14.6%). I’ve never invested in a stock so I’m new to this game!",
          "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8xjhh6/",
          "created": 1718582171,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8zr2fp",
      "score": 1,
      "body": "Ultimately it's just another middleman market that to my knowledge hasn't made any adjustments on the consumer side to be more user friendly. Meanwhile providers like Shopify and Squarespace are allowing the same business owners to create their own sites and attach them directly to social media.",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8zr2fp/",
      "created": 1718628126,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lq4hrkf",
      "score": 2,
      "body": "Besides what is already mentioned I would like to add the following problems at Etsy. I am a seller fyi.\n\nLegitimate items are being deactivated in the masses and practically next to impossible to get Etsy to reinstate them. The CEO said in an earnings call last May that sellers can appeal a deactivated listing. However, many sellers are finding this almost impossible. If you are quite persistent you can get your items reinstated. The fallout from this - loss of revenue, if it was a best seller loss of that status, loss of star seller, shop suspension, shop closure are some of what is being reported. Then it is next to impossible for a seller to get any help with the latter. Either the CEO intentionally lied or there is a major disconnect between management/lower staff/sellers. And if the latter that is real problem. (My own experience, reported in the Etsy reddit subs and on the Etsy forum-blog posts).\n\nEtsy DMCA process for out of country sellers. A U.S. seller can file a DMCA against a non U.S. seller but that seller cannot submit a counter-notice! So completely unfair to the non U.S. seller they are sitting ducks basically. It is a widespread problem with sellers filing false DMCA's as well. (Reported in the Etsy subs and my guess in the Etsy forum- I can't view as a seller that pays full fees - see below).\n\nPoor customer support. I myself have experienced (and a star seller) the inability to access support in any manner at all at times. Chat does not reply, no email us option, no phone call option! I have gone weeks with it like this as well. This is a widespread issue. (Reported in the masses in the Etsy Reddit subs and when I used to be able to view the Etsy forum, and my own experience).\n\nEtsy's dispute resolution process. They don't follow their own terms of use. They do not process disputes. I myself have submitted two properly submitted disputes, the latest about the issue below I mention. Both are ignored. I have asked for a settlement conference per their own terms of use and ignored. I have seen other sellers say their dispute was ignored as well. I call their terms of use \"fake.\" (my own experience x2 and reported in the Etsy Reddit subs). [**https://www.etsy.com/legal/terms-of-use#arbitrationagreement**](https://www.etsy.com/legal/terms-of-use#arbitrationagreement) **11c**\n\nEtsy bullies sellers. I have my own experience with this. (my own experience and reported in the Etsy Reddit subs as well as when I used to be able to view the Etsy forum there as well).\n\nIt is as if management just does not give a damn how the site is run. Even though it has greatly affected the stock price they still do not seem to give a damn. They just want to sit up there at Etsy HQ and rack in the millions with as little work in as possible. Again, the stock price is a reflection as well as to how Etsy is run. I thought once a stock price got so low that there should be a turnover in management. Why is this not happening?!! Something needs to change. Management does not acknowledge the problems and in fact acts if all is rosy at Etsy.\n\nI would not know if Etsy did acknowledge the problems anyway since I have been bullied by Etsy and they blocked my IP address a few months ago so I can't even see crucial announcements via the forum. They lied about doing this but I have proof they did and caught them in their lie. If something happens like last year where we had to comply and verify banking info or our shop would be suspended I would not know about this since I can't view announcements. Etsy is a bully to sellers. I have seen it many times over.\n\nI had Etsy on my radar some time to buy the stock but I see nothing from a technical or fundamental  standpoint that justifies a buy. If the stock gets into the $30s or $40s like someone else said then maybe. They aren't too far off from the $40's.\n\nFYI they lost me as a habitual buyer that over the course of years has spent probably about $40k on the site. Granted most of that was supplies for my business. They lost me due to how they treat me. I made my plight known to management even. They don't care. Etsy would rather bully a seller than do right by a seller and keep a habitual buyer. You investors don't care about Etsy's need to be a bully do you? You want them to retain habitual buyers right?\n\nAnd read Etsy reviews on Google. Etsy does not even care about its own reputation. A total disconnect at Etsy.\n\nYou can't tell Etsy management the problems (well you can and I have) but they don't listen nor care. It goes in one ear and out the other. Actually, their solution to the problems of Etsy from what I am told and also see in a blog post of a seller's is moderators immediately close technical threads of sellers needing help like deactivated listings. They want to bury the thread and not bring attention to it since it is public. (this is new and did not used to be the case). They claim that the seller's issue has been escalated to a team. How much do you want to bet if this is actually true and that the seller actually got the help needed? (Edited to add - just as I expected it is being reported by sellers that no one has reached out to them - ETSY LIES!). Their other solution was to take the forum private in March so the rest of the world and even some sellers many wrongfully banned can't see the Etsy dysfunction.\n\nElliot Management are you listening because Etsy isn't?!",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/lq4hrkf/",
      "created": 1727957399,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8rib39",
      "score": 1,
      "body": "I think more online retail is headed towards smaller businesses. Which is obviously Etsy’s forte. Not sure how quickly the stock will react. IMHO",
      "permalink": "/r/stocks/comments/1dga78e/could_etsy_make_a_comeback/l8rib39/",
      "created": 1718480776,
      "depth": 0,
      "replies": []
    }
  ]
}