{
  "title": "Philip Morris Earnings Calls?",
  "score": 23,
  "selftext": "The Philip Morris International Inc.  will release their next earnings report on the 23 of July.\n\nFor all of you that don´t know PM is the company behind the Zyn nicotine pouches. This \"new\" product has allowed the company to crush their last earnings in April this year. To my mind the demand for zyns has increased even more in the last few weeks, do you think this + upcoming dividends on the 21 may lead to big increase in the stocks price.\n\nThe only threats I would see rn are plans to \"ban\"/ restrict  tabaco e.g. the UK, but I don´t think these will take action in the next few days\n\nDo you guys think there´s money to be made with calls on PM?\n\nEdit:\n\nI found some numbers on the importance of zyns to the company from APRIL 2024  \n[https://philipmorrisinternational.gcs-web.com/static-files/c82b7e8a-9d5b-42c5-a105-654a9d726f8c](https://philipmorrisinternational.gcs-web.com/static-files/c82b7e8a-9d5b-42c5-a105-654a9d726f8c)\n\n\"Oral SFP2: Shipment volume increased by 40.0% in cans (35.8% in pouches or pouch equivalents), fueled by\n\nZYN nicotine pouch growth in the U.S., where shipment volume reached 131.6 million cans, representing\n\ngrowth of 79.7% versus prior year. Our share of the category in the U.S. increased for the fourth consecutive\n\nquarter to over 74%, up 1.3 percentage points sequentially.\" PM Expectations: Nicotine pouch shipment volume in the U.S. of approximately 560 million cans as a goal for 2024\n\n\"Nicotine pouch shipment volume in the U.S. of approximately 560 million cans\"\n\n\"Net revenue growth of 7% to 8.5% on an organic basis;\n\nOrganic operating income growth of 10% to 12%;\"",
  "link_flair_text": "Discussion",
  "id": "1dgjke9",
  "num_comments": 35,
  "created_utc": 1718462786,
  "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/",
  "comments": [
    {
      "id": "l8qabpq",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 5 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8qabpq/",
      "created": 1718462792,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8qdir9",
      "score": 20,
      "body": "I thought the same but tbh I don’t think it’ll have enough of an impact. They also consistently pay out millions in law suits",
      "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8qdir9/",
      "created": 1718464203,
      "depth": 0,
      "replies": [
        {
          "id": "l8qg9ev",
          "score": 6,
          "body": "Yeah there won´t be a huge jump in price, but around 10$ are def possible. If they beat expectations again the stock will shoot up even further",
          "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8qg9ev/",
          "created": 1718465397,
          "depth": 1,
          "replies": [
            {
              "id": "l8r1enb",
              "score": 8,
              "body": ">If they bet expectations again the stock will shoot up even further\n\nIt’s not that cut and dry, because earnings are irrelevant now. It’s all about the forward guidance provided by management. \n\nA company could beat expectations on the top and bottom line 100 times out of 100, but if forward guidance fails to impress, the stock will get punished.",
              "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8r1enb/",
              "created": 1718474041,
              "depth": 2,
              "replies": [
                {
                  "id": "l8r22wk",
                  "score": 3,
                  "body": "Okay,  that probably explains, why the stock only jumped up a few dollars after earnings. But the stock has gone up the last few days, and with the company focusing more on \"smokeless\" products, I think there´s room for them to grow more in the future",
                  "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8r22wk/",
                  "created": 1718474328,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8ts1ib",
              "score": 2,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8ts1ib/",
              "created": 1718518741,
              "depth": 2,
              "replies": [
                {
                  "id": "l8u1ot3",
                  "score": 1,
                  "body": "Yeah thats why im hesitant, they will probably have good earnings, as well as a product thats hyped, but on the other side, their stock is volutily, and usually doesn’t have huge increases after earnings",
                  "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8u1ot3/",
                  "created": 1718525584,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ln0injr",
              "score": 2,
              "body": "It jumped close to $30 since July. I think it's a good bet. Nicotine isn't going anywhere, and philip Morris will sell it",
              "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/ln0injr/",
              "created": 1726273387,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8tv5yl",
          "score": 1,
          "body": "No more lawsuits once everyone's dead. And everybody dies!",
          "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8tv5yl/",
          "created": 1718520897,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8qmam6",
      "score": 11,
      "body": "Tobacco/nicotine companies are just one of those things. They’ve always been around, they’ll always be around, but no one is excited about the prospects of supporting said companies. Haha Even though like alcohol it’s something you can always bet on being marketable I have trouble picturing people diving in to buy stock for it. I smoked for 20+ years and even I have zero interest in “owning a piece” of said companies. At most I’d bet a few contracts just for the fuck of it.",
      "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8qmam6/",
      "created": 1718467954,
      "depth": 0,
      "replies": [
        {
          "id": "l8r2v7x",
          "score": 2,
          "body": "Yeah I get the sentiment towards nikotine and why these companies are somewhat undesirable. I am not really trying to stay invested in the company for longer, more trying to make a few bucks off some options.\n\nBut I still think that in todays more \"changing\" landscape of tabacco consumption that PM is leading the race, and that with their investments in \"smokeless\" products such as zyns the market will regard them more \"favorably\", or with more interest",
          "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8r2v7x/",
          "created": 1718474644,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8qnrdd",
      "score": 9,
      "body": "Tread carefully, beginning about two months ago there started being major supply issues with ZYN and had to start going with whatever flavor they had and a month ago I couldn’t find them at all at any of my local gas stations and switched to a different product which I’ll probably end up sticking with because I kind of prefer them. Not sure if it was just my area affected but that doesn’t seem very likely.",
      "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8qnrdd/",
      "created": 1718468583,
      "depth": 0,
      "replies": [
        {
          "id": "l8r3ei1",
          "score": 3,
          "body": "Yeah even though I don´t live in the US, I\\`ve heard how popular these snus have become, and thought that with upcoming earnings there is a possibility to capitalize on that \"hype\".  \nIn the press release you can see how drastic and big the change in demand for these zyns is, which is probably the reason why you are having trouble finding them. But this shows even more why I think that this financial release will be bigger than the last. These zyns have become so popular they are basically sold out everywhere which will drive up profits for PM.",
          "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8r3ei1/",
          "created": 1718474860,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l90xsoz",
          "score": 1,
          "body": "What product did you switch to. I got one more can left and I’ve tried a few of the competitors and didn’t like them",
          "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l90xsoz/",
          "created": 1718643901,
          "depth": 1,
          "replies": [
            {
              "id": "l90ywso",
              "score": 1,
              "body": "Velo. It’s kinda trivial but I like the slim profile of the can so it doesn’t look like I have a can of dip in my pocket at work.",
              "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l90ywso/",
              "created": 1718644277,
              "depth": 2,
              "replies": [
                {
                  "id": "l91vqm4",
                  "score": 1,
                  "body": "I’ll have to see if anyone of the shops around me has those. I tried the XQS and they didn’t deliver the same as zyn. They either dumped all the nic at once or just never did. Also the pouches are uncomfortable and left residue in my cheek",
                  "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l91vqm4/",
                  "created": 1718655258,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8t86i1",
      "score": 4,
      "body": "worthless obtainable serious steep uppity disarm forgetful money selective trees",
      "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8t86i1/",
      "created": 1718507416,
      "depth": 0,
      "replies": [
        {
          "id": "l8u1c5h",
          "score": 2,
          "body": "Yeah I think theres a chance to make some money, but because of past performance this is a somewhat risky gamble",
          "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8u1c5h/",
          "created": 1718525329,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8sdl65",
      "score": 3,
      "body": "Zyn has been in short supply in my town and surrounding areas, disappearing completely from king soopers.  Have heard different things from owners - from “prices for gas stations are getting too high” to “FDA ban”, not sure what to think of it but been a pain in the ass finding them!",
      "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8sdl65/",
      "created": 1718493437,
      "depth": 0,
      "replies": [
        {
          "id": "l8st81s",
          "score": 1,
          "body": "Interesting, do you think that demand for them is still high, or that more people have bought them",
          "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8st81s/",
          "created": 1718500428,
          "depth": 1,
          "replies": [
            {
              "id": "l8stm2o",
              "score": 1,
              "body": "Demand is high for sure and growing, they’ve had a supply shortage which I think was due to their container supplier? Again heard different things from different places so not sure.  There is regulatory risk for sure",
              "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8stm2o/",
              "created": 1718500608,
              "depth": 2,
              "replies": [
                {
                  "id": "l8u1hwh",
                  "score": 1,
                  "body": "Yeah tabacco companies always carrie risks, but I hope the chance of one of these issues popping up in the next view weeks is low",
                  "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8u1hwh/",
                  "created": 1718525445,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8su2j6",
      "score": 2,
      "body": "not for this sub, but I think PMI is one heck of a long term holding. I knew their CSO (former and current) and they are betting on a nicotine tobacco free future... that's really interesting and nicotine is the addictive shit. I will start adding once I have some funds to spare",
      "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8su2j6/",
      "created": 1718500821,
      "depth": 0,
      "replies": [
        {
          "id": "l8suw8j",
          "score": 1,
          "body": "Yeah i mean smokeless products are 40% of their earnings rn. Definitely a company that has potential. Only problem ist its volutility",
          "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8suw8j/",
          "created": 1718501204,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8rycg3",
      "score": 1,
      "body": "To be honest you might be onto something. Earnings calls almost always correlate to a drastic price switch. Could be worth looking into",
      "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8rycg3/",
      "created": 1718487002,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8scjhp",
      "score": 1,
      "body": "They're really leaning into smokeless products and not losing cigarette revenue at the same time. [\"Cigarette shipments declined by a modest 0.4% in the first quarter\"](https://finance.yahoo.com/news/philip-morris-international-inc-nyse-144937246.html) I also like that its all nicotine. People might be tightening their belts right now but nicotine is one of the last things people cut back on. Even with all that I don't think I'd get in right now. That charts look a little high and my dumbass has no way of knowing if its overpriced right now. If it dips like it did before last earnings I'd grab some calls though.",
      "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8scjhp/",
      "created": 1718492982,
      "depth": 0,
      "replies": [
        {
          "id": "l8su4kh",
          "score": 1,
          "body": "Well if you look at the RSI you can see that it is moving in the upper part, indicating relative high demand, but I think you are right, as the stock seems to have a low correlation between earnings / dividends and its price, which if still true would make those options relatively risky",
          "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8su4kh/",
          "created": 1718500848,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8su7r1",
          "score": 1,
          "body": "Plus for the most part after earnings, the stock only stays/ goes up for a day or two",
          "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8su7r1/",
          "created": 1718500888,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8sxjwb",
      "score": 1,
      "body": "They just bought them; I run connivence stores and rep literally told me two days ago the zyn sold to them and ordering wise they are out for months they got too big and couldn’t meet demand",
      "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8sxjwb/",
      "created": 1718502415,
      "depth": 0,
      "replies": [
        {
          "id": "l8u19en",
          "score": 1,
          "body": "See that shows how good they are selling, which means the company probably makes good money of zyn sales",
          "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8u19en/",
          "created": 1718525274,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8t5yf8",
      "score": 1,
      "body": "I'm 35. There are few products I've seen explode onto the scene like Zyn. I may increase my PM and MO positions.",
      "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8t5yf8/",
      "created": 1718506341,
      "depth": 0,
      "replies": [
        {
          "id": "l8u1e53",
          "score": 1,
          "body": "Yeah they are expecting huge sales of these products",
          "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8u1e53/",
          "created": 1718525369,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8uvkq4",
      "score": 1,
      "body": "i will buy a call",
      "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8uvkq4/",
      "created": 1718544500,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vejgc",
      "score": 1,
      "body": "Whatever\n\nPM is one of those long hold stocks. \n\nIf you really want to get more into it wait for the economy to crash. Sin stocks always do better in a downturn",
      "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/l8vejgc/",
      "created": 1718552259,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldmlzba",
      "score": 1,
      "body": "Do we not think this is going to tank with all the shortages and bans? I'm expecting them to try to explain why revenue was off on Zyn products with a plan to try to right the ship going forward in the face of regulatory and legal headwinds.",
      "permalink": "/r/wallstreetbets/comments/1dgjke9/philip_morris_earnings_calls/ldmlzba/",
      "created": 1721231929,
      "depth": 0,
      "replies": []
    }
  ]
}