{
  "title": "How much are you willing to pay for perfection? $FICO Analysis",
  "score": 91,
  "selftext": "Fair Issac Corporation (NYSE: FICO) is a data analytics that has slightly beaten the market since its IPO in 1987.\n\nhttps://preview.redd.it/pt5297jept6d1.jpg?width=1280&format=pjpg&auto=webp&s=6b835c4c645ab5f147f163c1602386da8ebad074\n\nA $10,000 investment in 1987 would've turned in $11,195,174, beating the SP500 by 29x.\n\nWhen we evaluate a business, we often look for metrics such as pricing power, revenue growth, expanding margins, and a dedication to shareholder return. FICO **scores (wink)** well in all these metrics. In fact, one might even describe it as the perfect business.\n\nhttps://preview.redd.it/ztx4mbldqt6d1.png?width=2324&format=png&auto=webp&s=31fa768e467d524e49f5ebd239a3bf8cab0b724e\n\nhttps://preview.redd.it/u80uoq6rqt6d1.jpg?width=1280&format=pjpg&auto=webp&s=54631e5c1e74aa36c0097356617aa446fb8448aa\n\nhttps://preview.redd.it/lsz8vppvqt6d1.jpg?width=1280&format=pjpg&auto=webp&s=eaa23e0aa855600c75a032ee85147043b6e168e0\n\nIn the past 5 years, revenue has grown at a 8% CAGR, EPS has grown at 23%, and EBIT margins have expanded an impressive 2,100 basis points. To say this is impressive is an understatement. Let's take a deeper dive into this business.\n\n\"Scores\" accounts for 50% of FICO's revenues and is the consumer facing side of the business. FICO scores are ratings for consumers that range from 300 to 850. These ratings are given when a consumer applies for a credit, auto, or mortgage loan and are generated using FICO's proprietary algorithms. The lower the score, the less trustworthy and consequently higher default risk a consumer has. These scores will cost a business anywhere from a few cents to a dollar. FICO is so ubiquitous, it is used as a verb, demonstrating how ingrained it is in the lending industry.\n\n90% of the largest lenders use FICO scores and 98.8% of the total dollars lent in the US use FICO scores. While financial institutions and lenders have their own in network algorithms and rating methods, they all use FICO scores to communicate with one another and understand each other. As such, FICO has a tremendous moat due to its network effect. It can also be seen as a complementary good, rather than an competitor for instituions.\n\nWhile other methods such as VantageScore do exist, they pale in comparison to FICO's reliability in detecting default risk and lending health. When a loan is worth tens or hundreds of thousands of dollars, why save a few cents and go with a second rate score when you can get what's guaranteed to work?\n\nhttps://preview.redd.it/csn1jy2dst6d1.jpg?width=760&format=pjpg&auto=webp&s=90de18d6845d5add1860957fa34c52dcedc4fc71\n\nLooking at margins, FICO's score margins are breathtaking. Their OPERATING MARGIN (not to be mixed with gross) for their scores segment is a whopping 88%, expanding from 77% in 2016.\n\nhttps://preview.redd.it/7ljot76btt6d1.jpg?width=760&format=pjpg&auto=webp&s=d85b2b302823f7033d6b18f7c5902cc25aac2ef8\n\nFICO scores generates its revenue growth in two ways. One is through volume growth which they have less control over as that's sensitive to macroeconomic conditions. The second is through price increases. As aforementioned, FICO scores as used for Credit, Auto, and Mortgage applications. FICO systematically chooses to raise one category each year to control its revenue growth steadily. There is often no pushback as businesses can pass this price increase on to a consumer. When a credit application costs $75 but a FICO score costs less than a dollar, what does a few more cents matter?\n\nFICO's other half of the business is their B2B software offering where they offer customer management, customer engagement, fraud detection, financial crime compliance, and marketing software. These software subscriptions are multi-year subscriptions and FICO consistently attempts to \"land and expand\". To use a consumer relatable analogy, this is similar to us using Adobe or Microsoft and buying more products after trying just one after we realize their products are amazing and thus paying more annually.\n\nhttps://preview.redd.it/fdbvrvvnut6d1.jpg?width=1280&format=pjpg&auto=webp&s=519c94b22566a1d60c3a03f04d74a2bc1bf7e05c\n\nLooking at their Dollar Based Net Retention Rate, FICO has been keeping their customers engaged and convincing them to spend more money. For those unaware, DBNRR is a measure of how much money an average customer is spending year over year. For example, FICO's most recent DBNRR is 112%. This would imply that a customer who is paying $100 this year will pay $112 next year either through choosing more features or price increases.\n\nThis segment of FICO is not nearly as mature as scores and has a much smaller operating margin. Operating margins are fairly low at 32%, but did improve 300 basis points from 29% of last year. FICO's B2B solutions is the market leader in fraud detection and customer management and protect 66% of card transactions globally. As enterprises move on to FICO's platform, operating income will quietly trickle up and margins will expand. In addition, the recurrent nature of subscription models will have a positive effect on the overall health of FICO's revenues.\n\nhttps://preview.redd.it/gjuznz1cvt6d1.png?width=2330&format=png&auto=webp&s=b73b77fdf6c11045f5374d872257a950154106fc\n\nLooking at capex, FICO has barely spent any money investing in the business. When we sum up the past 5 years, FICO has spent roughly 70 million dollars. This represents 1% of the past 5 years of revenues. So what has FICO been doing with their profits? The answer lies in their share repurchases.\n\nhttps://preview.redd.it/5nmsy9chvt6d1.jpg?width=1280&format=pjpg&auto=webp&s=da8158fb20328519707d48a2e6dfa3dcc2930a6d\n\nIn the past 5 years, FICO has spent $3.2 billion buying back their shares.\n\nhttps://preview.redd.it/jux4pa9rvt6d1.png?width=2386&format=png&auto=webp&s=e64b2bfcc09755e7e4b1b2a10e03cd9af140fb74\n\nTheir repurchases have retired 14% of shares outstanding, or a CAGR of -2.68% per year. However, if you were paying attention, you would have noticed FICO has only generated $1.6 billion in net income over this time period. How are they able to afford this then? The answer lies in their balance sheet:\n\nhttps://preview.redd.it/mlgs3n92wt6d1.jpg?width=1280&format=pjpg&auto=webp&s=0b863f8fe007c851305b5295835b348d7126a97e\n\nAs we can see, FICO has taken on substantial debt to fuel these repurchases. Management has consistently stated in their earnings call that they believe this is the best usage to deliver shareholder value and they continue to deploy this strategy. The most important question when evaluating this decision is what is the interest rate on this debt?\n\nhttps://preview.redd.it/5zepzquhwt6d1.png?width=1438&format=png&auto=webp&s=a650e46a7b49223ac75db3b9236fc92df1d83a2f\n\nLooking at page 10 of their April 2024 10-Q, we can see that FICO's interest rates range between 4.00-5.25% for their senior notes which make up $1.3b of their debt. In addition, we have a revolving LOC at the SOFR rate + roughly 1.5%. The implied interest rate is currently 6.674% with $754m drawn down.\n\nSolely looking at this one factor, it would be easy to question FICO's management as leverage can be scary. When you think of FICO as a whole however, FICO's high margin and constant cash generation reduces the risk of this debt being an issue. FICO does not distribute any dividends and has done almost no M&A. In addition, their repurchase timing has been exceptional as the bulk of their purchases were done when the stock price was around $400 in 2022 and the stock price currently sits at $1390.\n\nManagement is also aware of the precarious environment we stand in and has taken steps to deleverage the balance sheet though it is currently very comfortable with the amount of leverage it possesses.\n\nhttps://preview.redd.it/5lynjg9cxt6d1.jpg?width=760&format=pjpg&auto=webp&s=9e5493fe2257ed5012838553d38c01872647e2c4\n\nAll in all, FICO has everything you could ask for. They have low capital expenditures, expanding margins, consistent revenue growth, an impenetrable moat, and a management team dedicated to shareholder values. Unfortunately, their valuation is sky high.\n\nhttps://preview.redd.it/kg9dt2okxt6d1.jpg?width=1280&format=pjpg&auto=webp&s=b77321f3b1936141a7ce95936a3dda403a2a6635\n\nThe market has recognized the success of FICO and has placed an excessive premium to FICO. When investing in FICO, there's really no question about the exceptional business practices.\n\nIt ultimately boils down to one question: **how much are you willing to pay for perfection?**",
  "link_flair_text": "Company Analysis",
  "id": "1dgvrzy",
  "num_comments": 22,
  "created_utc": 1718498321,
  "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/",
  "comments": [
    {
      "id": "l8sqbpf",
      "score": 21,
      "body": "So invest now or wait for pull back in your opinion",
      "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8sqbpf/",
      "created": 1718499090,
      "depth": 0,
      "replies": [
        {
          "id": "l8suuln",
          "score": 8,
          "body": "the more important question is if fico will be a better and stronger business in 5 years than it is today\n\nthats up to you to decide",
          "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8suuln/",
          "created": 1718501182,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8szc15",
      "score": 32,
      "body": "Great post, but I'm afraid you've spent too much effort for a post on this sub. When a company measures so well in so many parameters and has such a breathtaking trajectory, I feel that its upside is limited for late investors (like me). \n\nTo answer the question, if the market believes a company is nearly perfect, it's time to load up some puts. If money is made when there is doubt and fear, wouldn't the inverse be true? That the most money stands to be lost when premiums and confidence for a company are both great?\n\nBut... it's a monopoly. Barring a recession that dumps its share price back on the floor, its share price will probably continue to grow healthily. Still, given today's market indicators and how priced in everything is, investing in FICO is not something I want to do.",
      "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8szc15/",
      "created": 1718503227,
      "depth": 0,
      "replies": [
        {
          "id": "l8t1ybb",
          "score": 29,
          "body": "lol i just do these for fun, not looking for any return on this post\n\n  \nas for upside from here, i don't really consider than when investing in a company. i care more about the fundamentals. if fico were to take a 50% haircut, i'd probably max out every possible loan i could get to get my hands on it. if you were to realistically calculate returns, if we were to assume FICO to grow their EPS by 20% for the next 5 years while maintaning their multiplier, you would assume a 20% CAGR. You could even assume their PE to reduce down to 50 and expect the same level of growth if FICO expands their EPS growth to 28%.\n\n  \nI know that sounds far fetched and far too optimistic but you have to realize that we've been through 2 recessions and during this time, FICO grew their EPS throughout this at 20%. Mortgage and auto originations have plummeted due to higher interest rates/inflation. Imagine how great their growth will be when the economy stabilizes. Then add in software margin expansion which FICO has continuously improved and I can definitely see a path there, albeit difficult. When you look at companies like Visa or MSCI who have grown their high margins to even higher margins, you understand that there's always upside with high quality businesses",
          "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8t1ybb/",
          "created": 1718504440,
          "depth": 1,
          "replies": [
            {
              "id": "l8vcr6e",
              "score": 2,
              "body": "I agree with you.\n\nPeople think we can't achieve 30% growth going forward when we did 20% through Covid which by some measures was far more acute than even the Great Depression.",
              "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8vcr6e/",
              "created": 1718551562,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8ty10s",
          "score": 12,
          "body": "Visa and Mastercard have been nearly perfect for years. Berkshire, Amazon, Meta or Costco too.",
          "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8ty10s/",
          "created": 1718522919,
          "depth": 1,
          "replies": [
            {
              "id": "l8vcxww",
              "score": 1,
              "body": "COST is such a wonderful business run by geniuses.\n\nThe 96 Bulls of management.",
              "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8vcxww/",
              "created": 1718551636,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8u46mw",
          "score": 9,
          "body": "As howard marks says, overpriced stocks can still become more overpriced.\n\nPuts in front of a steam roller is just stupid.",
          "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8u46mw/",
          "created": 1718527416,
          "depth": 1,
          "replies": [
            {
              "id": "l8w3jb8",
              "score": 0,
              "body": "You don't have infinite losses with puts though",
              "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8w3jb8/",
              "created": 1718561705,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8tjybj",
      "score": 6,
      "body": "Got my ten shares at 251. Only up 451% or 11,390. Bought back in covid bc I said, there is only one person who you use for credit scores. FICO!",
      "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8tjybj/",
      "created": 1718513661,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8tk0sl",
      "score": 6,
      "body": "Could you do Cava stock? I’m bullish on it but early on in the research process. Would love to hear thoughts.",
      "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8tk0sl/",
      "created": 1718513700,
      "depth": 0,
      "replies": [
        {
          "id": "l8up49y",
          "score": 5,
          "body": "Those fuckers sold me a side of Taziki sauce for $3.20, but the whole meal was good enough enough for me to want to go back. Bullish on that.",
          "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8up49y/",
          "created": 1718541369,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8u3r02",
      "score": 5,
      "body": "Top class analysis!",
      "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8u3r02/",
      "created": 1718527096,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8uewxn",
      "score": 6,
      "body": "Good DD!",
      "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8uewxn/",
      "created": 1718535356,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8v4if8",
      "score": 3,
      "body": "Great deep dive. Glad to see more than just voo/vti beginner questions and new articles on this sub.",
      "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8v4if8/",
      "created": 1718548305,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8sqdnf",
      "score": 9,
      "body": "I hate the argument of 10,000 dollars 50 years ago would be 10,000,000 today.",
      "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8sqdnf/",
      "created": 1718499115,
      "depth": 0,
      "replies": [
        {
          "id": "l8sunqe",
          "score": 16,
          "body": "i mustve missed the part where i wrote fico went up in the past therefore its gonna go up in the future lmao its just some history\n\n  \ndid you even read the post?",
          "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8sunqe/",
          "created": 1718501093,
          "depth": 1,
          "replies": [
            {
              "id": "l8sytai",
              "score": -1,
              "body": "Read? We don’t do that around here.",
              "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8sytai/",
              "created": 1718502987,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvz17u1",
      "score": 1,
      "body": "I remember reading this post. Coming back to it FICO is at $2176 today. Approximately 55% up in a little less than 4 months! I never bought though....",
      "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/lvz17u1/",
      "created": 1731016464,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8tgqq4",
      "score": -3,
      "body": "Where is the TLDR?",
      "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8tgqq4/",
      "created": 1718511824,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8t8zqt",
      "score": -6,
      "body": "VTI or die",
      "permalink": "/r/stocks/comments/1dgvrzy/how_much_are_you_willing_to_pay_for_perfection/l8t8zqt/",
      "created": 1718507816,
      "depth": 0,
      "replies": []
    }
  ]
}