{
  "title": "Your current favorite stocks to diversify away from this insane AI/semiconductor rally?",
  "score": 341,
  "selftext": "I don't know about y'all, but this big jump in semiconductor and AI related stocks is making me wanna diversify a little and put a little more into stocks with no correlation to that trend.\n\nWhat are your current favorites that are still solid picks without benefiting from the AI hype wave?",
  "link_flair_text": null,
  "id": "1dh3sa6",
  "num_comments": 413,
  "created_utc": 1718529576,
  "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/",
  "comments": [
    {
      "id": "l8u819r",
      "score": 299,
      "body": "I'd like to hear which companies are actually using AI to boost their earnings here. Not the ones selling the product (so obviously not msft or NVDA, or the data center hyperscalers). The ones using the product and seeing real results reflected on earnings. That to me shows AI is real and not hype\n\nEdit: I should limit it to gen AI since that's the new thing from chatgpt. Also, I know software engineering uses it to some extent, but that's a narrow scope of all the jobs out there.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8u819r/",
      "created": 1718530338,
      "depth": 0,
      "replies": [
        {
          "id": "l8uewkj",
          "score": 244,
          "body": "I work for one of the largest trash haulers in the country and we use AI to watch videos from our trucks to charge our customers extra yards and contamination fees. It's only for recycling because we, as a country, suck at recycling clean product and a fair amount of what ends up in recycling containers has to be thrown away as trash. I've watched the videos and it's actually insanely accurate in catching contamination. I've had to watch video multiple times to see what it's finds.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uewkj/",
          "created": 1718535349,
          "depth": 1,
          "replies": [
            {
              "id": "l8ulndz",
              "score": 120,
              "body": "Yeah, but that's not generative AI. Classification AI has existed for a long time now i.e. think Facebook's photo tagging. Generative AI is the cause of the current AI hype.",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8ulndz/",
              "created": 1718539502,
              "depth": 2,
              "replies": [
                {
                  "id": "l8umxjj",
                  "score": 51,
                  "body": "Gotcha, I'm not very familiar with the AI industry. This technology is new to my company within the last year.",
                  "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8umxjj/",
                  "created": 1718540213,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8x1ybg",
                      "score": 5,
                      "body": "Does it matter? If you’re able to charge customers more due to classification, that’s real impact.",
                      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8x1ybg/",
                      "created": 1718574711,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l8uqi5v",
                  "score": 28,
                  "body": "All the big oil and gas producers and mining companies have started to explore generative AI to write workpacks, schedule, norms estimates, isolations, machine maintenance trends",
                  "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uqi5v/",
                  "created": 1718542074,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8v9roi",
                  "score": 17,
                  "body": "Classification AI will still use AI hardware and chips.\n\nIt's improved a lot / gotten more efficient as well.  It's being used everywhere from the trash example above to shopping carts very effectively.  Inventory stocking even.",
                  "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v9roi/",
                  "created": 1718550389,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8w2hwa",
                  "score": 12,
                  "body": "> Generative AI is the cause of the current AI hype.\n\nDo you really think Generative AI is going to be a huge money maker?\n\nI don't. \n\nI'm investing in Google, Broadcom, Nvidia and AMD not because of Generative AI at all. It has absolutely nothing to do with it.\n\nThe only thing Generative AI is doing (imo), is giving us a sneak peek at our AI future, to let you know that this stuff is ultimately going to change everything, but I have zero illusions that an LLM is actually going to result in a higher GDP",
                  "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8w2hwa/",
                  "created": 1718561318,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8w7p76",
                      "score": 9,
                      "body": "It will kill some industries (basic graphic design, cookie cutter web frontend, content mill article generation) but given it's penchant for lack of accuracy, will be a long time before it starts to make real inroads in other fields where accuracy and precision are critical (say, civil engineering or architecture).\n\nLike with development, I expect it to help in some parts of those tasks, saving human time for what humans do best, critical thinking (well.....the humans who are usually in those roles anyway)",
                      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8w7p76/",
                      "created": 1718563258,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9464wu",
                          "score": 2,
                          "body": "It will take over a lot of customer service roles. There might be a need for a human to do accuracy checking, but writing letters to customers could easily be automated.",
                          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l9464wu/",
                          "created": 1718689138,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "l8wg3zp",
                      "score": 6,
                      "body": "> Do you really think Generative AI is going to be a huge money maker?\n\nI 100% do. I work in an adjacent tech industry, and gen AI already has  huge revenue imapcts to businesses.  \n\nThere is already a fair bit of Gen AI supplemented customer service operations (even if they don't fully replace humans right now, they are certainly supplementing humans in knowledge retrieval). I'd estimate 50-75% of marketing you see already has GenAI influence, and same with software engineering.  \n\nOpenAI revenue is 3 billion already, for a company that's so young, that's completely insane. You also don't see behind the seen huge B2B contracts being thrown arround on this topic. (Just to illustrate the scale, that's more than the entire yearly tax revenue of nation states like Haiti)\n\nI think the better question is where that value will be captured. Will the foundational models become a high margin business despite the challenges of open source models? Will the cloud hyperscailers (AWS, GCP, Microsoft) capture business in the form of selling compute? Will companies with massive dataset benefit from data licensing and asynmetric advantage? or will NVIDA continue their chip monopoly in this space?\n\nRevenue will be there, but it's an open question on who captures a disporportionate of that revenue.",
                      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wg3zp/",
                      "created": 1718566431,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l8wh88p",
                      "score": 2,
                      "body": "If you aren't investing in Nvidia because of generative AI, what are you investing in them for?",
                      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wh88p/",
                      "created": 1718566856,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l8wbhqt",
                      "score": 2,
                      "body": "As it gets better and better at generating code? Oh yes. Absolutely.",
                      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wbhqt/",
                      "created": 1718564684,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l8w45pn",
                  "score": 2,
                  "body": "All forms of AI are getting a lot more investment and hype from the generative AI boom.",
                  "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8w45pn/",
                  "created": 1718561937,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8whxe2",
                      "score": 2,
                      "body": "Not disagreeing here. A lot of companies are putting out news releases claiming they doing something AI-related.",
                      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8whxe2/",
                      "created": 1718567114,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l8vjtzz",
                  "score": 2,
                  "body": "How would you define Generative AI?",
                  "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vjtzz/",
                  "created": 1718554290,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8vc5zx",
              "score": 27,
              "body": "[removed]",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vc5zx/",
              "created": 1718551335,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8uhmp2",
              "score": 5,
              "body": "Interesting, thanks for sharing. Any idea who makes the AI that analyzes the videos? Thanks again.",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uhmp2/",
              "created": 1718537132,
              "depth": 2,
              "replies": [
                {
                  "id": "l8uik12",
                  "score": 7,
                  "body": "I couldn't tell you, I did a quick Google to see and couldn't find anything that said who our partner is.",
                  "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uik12/",
                  "created": 1718537700,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8uix6i",
          "score": 65,
          "body": "I use Github Copilot for coding assistance. It has increased my productivity significantly. Totally worth the 20$ monthly that you pay for it. I guess there are many cases where you can achieve the same outcome with probably 10-20% fewer people.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uix6i/",
          "created": 1718537921,
          "depth": 1,
          "replies": [
            {
              "id": "l8vr5my",
              "score": 9,
              "body": "Yeah IDK how everyone on reddit thinks copilot sucks. It helps me PR things so much faster when I have a gut feeling something is wrong or could be done more efficiently. Instead of tinkering with the PR pulled down locally myself I just ask copilot and tell the person who wrote the PR to test out the code (if it looks right, obviously) and it makes the PR process SO much smoother.\n\nIt also just makes development faster for the same reason. I'll write some code that works and then ask it how to make it better. Is it always right? No. But if I guide it I can get results faster than just googling for shit myself when I might not know a specific term.\n\nIt falls flat on newer stuff though of course. When I was asking it about stimulus outlets (rails) it had no clue what the fuck I was talking about.\n\nI also think it's REALLY good at SQL and writing queries. SQL itself is very very basic and truthfully many software engineers suck at writing good queries and don't know all of the things available in the language itself. That's a situation where copilot really shines imo.",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vr5my/",
              "created": 1718557079,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8v5biz",
              "score": 17,
              "body": "> Github Copilot for coding assistance.\n\nGithub Copilot is actually a perfect example of how reputable tech giants are willing to blatantly lie and deceive in order to push an AI product that barely does anything.\n\nI watched Github's launch presentation of Copilot 2.0, where the whole premise was that the AI could now read your codebase and understand the entire context. This would allow you to, for instance, download a large and unfamiliar open source project, and Copilot would be able to tell you in which files to make x changes, in order to implement some desired change.\n\nBut.. it can't do that. It doesn't work. I mean.. it doesn't even _close_ to work like that. It doesn't have full context of your project, it seems to only be aware of a few files at a time, and even then, the answers it gives are just false/lies.\n\nIf Copilot has \"significantly increased\" your productivity, then I'm sorry, but you must be a Jr. developer? Copilot is not capable of making anything really worthwhile above a simple function that does a specific thing, and even then, you will almost certainly need to make changes if there is any level of complexity in it.\n\nI might be coming off as very harsh, but I actually do have Copilot, too, and use chatgpt often while developing. Copilot has some nice features like enhanced intellisense and variable name suggestions and such (as well as it _can_ produce code). But I feel none of these are what the promise of an AI coding helper actually is.. these are things that could have been implemented without \"AI\". The \"hardcore\" AI features that they boast about, and that would truly make it special, just don't work.",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v5biz/",
              "created": 1718548633,
              "depth": 2,
              "replies": [
                {
                  "id": "l8vjyuy",
                  "score": 5,
                  "body": "Computer programs writing other computer programs is quite frightening to me",
                  "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vjyuy/",
                  "created": 1718554341,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8vau2k",
                  "score": 8,
                  "body": "I second this. It might make me like 5% more productive by helping write some LINQ statements or something annoying like that. And when you consider coding is like 20% of the job.. yeah. I would like to see what people work on that it helps them that much. I'm writing a ton of business logic and unit tests that require lots of test data which is already difficult to understand with full context. If you're writing mostly business logic it's next to useless. I am sure it's great for web dev.",
                  "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vau2k/",
                  "created": 1718550813,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8um533",
              "score": 25,
              "body": "Yep same here. Built an app last night in a few short hours with it. What would have taken me weeks before. Incredible that we have these tools now for us to use. Imagine having it 15 years ago. Wow. Now imagine the next 15 years how it will evolve and be even more fine tuned. Lots of calls on AI related stocks.",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8um533/",
              "created": 1718539777,
              "depth": 2,
              "replies": [
                {
                  "id": "l8uz256",
                  "score": 27,
                  "body": "We have free subscription to co-pilot at work, doesn't cost us anything. It's handy as a code auto fill tool if I'm writing some repetitive code or something, but even then, it's wrong more often than not. How on earth could you use it to build an entire app?",
                  "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uz256/",
                  "created": 1718546046,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8v4yeq",
                      "score": 15,
                      "body": "Probably because building an app is 90% boilerplate and 10% actual business logic.\n\nI was able to create a program that plays tic tac toe and has a couple different strategies that the players use in about 90 minutes the first time I got my hands on copilot. That was fun.\n\nBut in a work context the second you introduce business objects it goes to shit. Like I'm working on a small change to sort a list of objects, but there are too many other parameters to mock out, complexity in the output object the list builds, etc, for copilot to actually write tests for it easily.",
                      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v4yeq/",
                      "created": 1718548486,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8vbrze",
                          "score": 3,
                          "body": "So basically it's useless to *actually* create an app that might generate any revenue or be meaningful to anyone. It's just does \"Build me something *reeeeeally* basic that you can find 900 examples of really badly written college student code posted into public repos to build their portfolio.\"\n\nI got the impression from the post I replied to that the guy literally got it to create his startup or something. That had me baffled.",
                          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vbrze/",
                          "created": 1718551183,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8vdk9y",
                              "score": 7,
                              "body": "The first step in creating that startup is some simple app that looks like it came from a college student. Potentially good for some rapid prototyping.\n\nI'm honestly most looking forward to when my company gets a model trained on our wiki site. Navigating that clusterfuck is awful right now.",
                              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vdk9y/",
                              "created": 1718551879,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l8v5qix",
                  "score": 22,
                  "body": "disagreeable carpenter rotten childlike reach muddle tub deliver sugar screw\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                  "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v5qix/",
                  "created": 1718548803,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8whyid",
                      "score": 7,
                      "body": "OP is probably not professional or probably his app is just some simple gizmo. ",
                      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8whyid/",
                      "created": 1718567126,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l8upeua",
                  "score": 2,
                  "body": "Get ready for your boss to realize that",
                  "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8upeua/",
                  "created": 1718541520,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8upzmc",
                      "score": 8,
                      "body": "And do what? Give them a raise?\n\nAll this will do is recalibrate expectations about productivity in the coming years. \n\nIt’s the same as using these large multi modal models to summarize documents and meetings so I don’t have to spend as much of my own time doing it.",
                      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8upzmc/",
                      "created": 1718541815,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8uxmtr",
                          "score": 20,
                          "body": "Ah yes, all inventing tractors did was help every farmer grow 100x more food. The amount of farmers never changed",
                          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uxmtr/",
                          "created": 1718545427,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l8uye8u",
                          "score": 5,
                          "body": "Layoffs, genius\n\n\nWhy are they going to pay a whole team when AI does weeks of work in a few minutes? Sounds like everyone but maybe one person is redundant now",
                          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uye8u/",
                          "created": 1718545762,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l8umz9q",
          "score": 20,
          "body": "The DLSS in Nvidia consumer graphics cards is an excellent use of AI. It uses the tensor cores to generate frames in between rendered frames. This allows the cards to allow users to play at higher settings while consumer less electricity and generating less heat. \n\nThe only earnings this helps is nvidias as it keeps them pretty far ahead of AMDs cards. But I did want to bring it up because it is an actual tangible use of AI that is benefiting millions of consumers. It is also allowing game developers to make more gpu intensive games that otherwise wouldn’t be possible with current tech. \n\nIn regards to the heat and electricity if we assume that is also the case for other tasks, then the big data centers would have huge electricity savings by using AI cards.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8umz9q/",
          "created": 1718540239,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8us7wd",
          "score": 20,
          "body": "Most people don't realize it, but Google and Meta are some companies that have heavily boosted their earnings using AI for the past many years. Like Youtube is now a huge cash cow for Google because of their AI ads and recommendation engine.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8us7wd/",
          "created": 1718542923,
          "depth": 1,
          "replies": [
            {
              "id": "l8xs31x",
              "score": 8,
              "body": "Recommendation engines are reinforcement learning/multi armed bandit/collaborative filtering models that have been around for 10-20 years. They aren’t using the new LLMs.",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8xs31x/",
              "created": 1718586009,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8vs043",
          "score": 3,
          "body": "Try looking at popular cybersecurity companies. ",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vs043/",
          "created": 1718557399,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8wpiei",
          "score": 3,
          "body": "Nobody is going to give you that level of research for free buddy",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wpiei/",
          "created": 1718569931,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8wswka",
          "score": 3,
          "body": "I feel like you’re wanting to hear of some killer app, some thing that moves the needle in one swoop. Like mobile web or the App Store.\n\nAi is likely improving efficiency in fractions of a percent all over, especially in man hours. Instead of a meeting having either a notes taker, summarized, and sent out to participants, it’s just recorded from the transcript and sent out immediately. And some meetings sometimes get forgotten immediately afterwards it ends. Just wasted thousands in a hour meeting that results in nothing and distractions to everyone’s day.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wswka/",
          "created": 1718571187,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8vjx55",
          "score": 5,
          "body": "How broadly do you define “AI” here?\n\nThe rally isn’t because of ChatGPT and LLMs. It’s about the countless use cases for having such powerful GPUs that can run bazillions of parallel calculations. And they’re just getting started in what they can do. It’s like waiting for the car bubble to pop when the Model T came out. You’d still be waiting.\n\nDeveloping new drugs. Image rendering. CRMs. Accelerating academic research. Customer analysis. Cost cutting from automation. Complex simulations. Satellite broadband. Translating whale communications. Medical imaging. Aerodynamics. You name it. \n\nThere’s a reason Nvidia is on back order and is only constrained by supply.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vjx55/",
          "created": 1718554323,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8vqzoq",
          "score": 5,
          "body": "did you waitch Palantir AIP demo, they had 70 companies talk about it.  How they went from hours to milliseconds making decisions off their data.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vqzoq/",
          "created": 1718557015,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8va0vj",
          "score": 5,
          "body": "A lot of drug companies are using machine learning to recognize chemicals that are likely to be effective drugs. These chemicals still need to go through the long multi year testing and approval process, so it isn’t creating profit yet. \n\nCybersecurity companies are also using AI to recognize and intercept malicious activity in the networks. PANW is a great example. \n\nDuoLingo is using AI in their foreign language software. \n\nThe hype has really been about generative AI like Chat GPT. I’m more interested in ML (machine learning) AI as a transformative function. Adaptive pricing is executed by ML.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8va0vj/",
          "created": 1718550491,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8vcm0p",
          "score": 2,
          "body": "Adobe",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vcm0p/",
          "created": 1718551506,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8vgvzi",
          "score": 2,
          "body": "Generative AI is sorta like working with a Toddler right now. It gives you an answer but you have to fix it every time.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vgvzi/",
          "created": 1718553160,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8vqiz4",
          "score": 2,
          "body": "The company I work for isn't public but I'm tech lead on a new feature that wouldn't be possible (or at least, not easily) without AI and our clients are supposedly very excited about it.\n\nProbably the biggest feature as well (built by a different team) in our businesses eyes was also AI based the past fiscal year.\n\nWe grow at just under 40% YoY for like 20 years btw (we are missing this year but barely under)",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vqiz4/",
          "created": 1718556840,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8ub3za",
          "score": 10,
          "body": "The thing is that the first company to achieve AGI will have no need for 95% of all other companies. If Microsoft for example achieves general purpose AI capable of training itself then the company should reasonably be worth 100x what it is currently and 95% or more of other companies will go out of business.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8ub3za/",
          "created": 1718532645,
          "depth": 1,
          "replies": [
            {
              "id": "l8ud75n",
              "score": 21,
              "body": "The potential for AGI doesn't seem like something that should be affecting investment decisions right now. Right now, people just need to be looking at what companies are currently reaping large rewards from current AI tech.",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8ud75n/",
              "created": 1718534165,
              "depth": 2,
              "replies": [
                {
                  "id": "l8ufaqx",
                  "score": 9,
                  "body": "It doesn't seem like it, but there are so many people drinking the koolaid thinking AGI is gonna be possible within their lifetimes.",
                  "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8ufaqx/",
                  "created": 1718535618,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8ugbb5",
                      "score": 16,
                      "body": "It very well could be, but AGI coming out of LLM's is delusional. We are not there yet, and more compute alone is not going to get us there.",
                      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8ugbb5/",
                      "created": 1718536291,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l8uxiru",
                      "score": 4,
                      "body": "Unless I'm dying in the next 10 years then it's going to be here in my lifetime, by a conservative estimate",
                      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uxiru/",
                      "created": 1718545378,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l8ul16w",
              "score": 17,
              "body": "Current AI systems are not even close to true AGI.\n\nAlso, even if AGI is achieved, there will always be an opportunity for specialized AI systems.\n\nHumans posess true general intelligence - nevertheless, for most tasks you hire specialists instead of asking random people on the street.\n\nPer definition, AGI should also be able to learn anything, e.g. they could drive a car for you. Would you rather want an AGI system to do that or would you rather use a highly specialized autonomous driving system?\n\nAlso, it's not certain that there is even a path to achieve AGI. Therefore, most companies will focus on building specialized AI system. This is already difficult enough -- we have heard for years that we are close to autonomous driving, and it's still not ready for prime time.",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8ul16w/",
              "created": 1718539152,
              "depth": 2,
              "replies": [
                {
                  "id": "l8uo38s",
                  "score": 5,
                  "body": "The advent of AGI will be the advent of ASI.  It’s not correct to compare a general intelligence human to an AGI, because its speed of learning is orders of magnitude beyond ours and its ability to translate all its knowledge from one generation to the next, or to replicate is something we do not possess.",
                  "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uo38s/",
                  "created": 1718540828,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l8umfte",
              "score": 2,
              "body": "Theoretically yes. But, the company that creates the hardware to help power AGI will still be around. In fact, achieving agi will mean more hardware is needed. Hence Nvidia. Probably the best moated AI related company stock to hold long.",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8umfte/",
              "created": 1718539942,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8uz12t",
          "score": 4,
          "body": "Any pharmaceutical companies with public statements about future AI advances are probably the first big ones that will happen.\n\nRight now we are in the infancy of the boom of this new technology. It seems overhyped, but we aren’t even close.\n\nOnly infrastructure and deep supply chain companies are benefitting right now. They’re setting the stage. The only major end product right now is generative chatbots.\n\nSemiconductors, data centers, and cloud services are where the hype is right now, and of course the companies developing the models. These are not what the models will end up producing, just the infrastructure to allow the distribution and development of the models.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uz12t/",
          "created": 1718546033,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8va2x5",
          "score": 4,
          "body": "Edit: also 1Q actually was a really, really great quarter for earnings at +6.0%.  Earnings estimate for 2Q are even better at +9.0%.\n\nHow are you always first to comment on everything lol and at the top.  Makes me think you might have bots assist you or something... \n\n\nAnyways, Apple Intelligence will get people to upgrade their phones so they can say \"see my new phone has these cool features yours don't\".\n\nThat alone is already something.\n\nAlso just because AI is not reflected in earnings doesn't mean it isn't \"real\".  A lot of technology cannot be monetized except a small few key players, despite everyone benefiting enormously from it.\n\nIf you are saying individual companies saying AI will help increase earnings specifically might be hype.  But the overall economy growing, becoming more productive and all companies profiting more due to AI is very real.  That will still indirectly translate to growing revenue / profits for all.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8va2x5/",
          "created": 1718550513,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8v7uf3",
          "score": 2,
          "body": "Pretty much all companies are using it now in one way or another. That's why the price is skyrocketing.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v7uf3/",
          "created": 1718549639,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8uonn2",
      "score": 63,
      "body": "BRK.B & BN are both trading at good prices right now. These two make up over 10% of my portfolio.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uonn2/",
      "created": 1718541125,
      "depth": 0,
      "replies": [
        {
          "id": "l8vk7d3",
          "score": 9,
          "body": "I agree with BN and the PE sector. I own both KKR and APO.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vk7d3/",
          "created": 1718554431,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8ulpzs",
      "score": 80,
      "body": "Utilities, especially electricity companies",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8ulpzs/",
      "created": 1718539542,
      "depth": 0,
      "replies": [
        {
          "id": "l8v5anc",
          "score": 17,
          "body": "Utilities don't generally make more money the more electricity you use. Their price hikes need to be backed by cost increases on their end, and need to be approved by the government.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v5anc/",
          "created": 1718548623,
          "depth": 1,
          "replies": [
            {
              "id": "l8v5zek",
              "score": 10,
              "body": "But even if they don’t raise prices, there would still be an increase in volume, no? What am I missing? (Genuine question, if my assumption is wrong, please correct me)",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v5zek/",
              "created": 1718548898,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8v2vn1",
          "score": 17,
          "body": "Those are rising on AI data center power demand.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v2vn1/",
          "created": 1718547643,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8w5b2b",
          "score": 3,
          "body": "As someone in his mid 30s, I love utilities. People will always need to turn on the lights/run the dishwasher/other household appliances, our population is growing, and within my relatively short time on this Earth, I'm amazed by how many household objects use electricity.\n\nI really wish trash and water ETFs didn't have such high expense ratios because I love them too.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8w5b2b/",
          "created": 1718562365,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8ypn0o",
          "score": 2,
          "body": "But isn’t the expected growth in that sector not also heavily correlated with AI and their power consumption?",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8ypn0o/",
          "created": 1718603471,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8uh8lf",
      "score": 33,
      "body": "IQV, which I still think is a moderately underappreciated company with a tremendous amount of data that I don't think anyone else could replicate or at least do so without enormous effort. Additionally, it's a business that I don't think would be allowed to happen today and I'm surprised the merger that created it was allowed to happen when it did. \n\nFrom the most recent annual report: \"**We have one of the largest and most comprehensive collections of healthcare information in the world, which includes more\nthan 1.2 billion comprehensive, longitudinal, non-identified patient records spanning sales, prescription and promotional data, medical\nclaims, electronic medical records, genomics, and social media. Our scaled and growing information set contains approximately 61\npetabytes of unique proprietary data sourced from approximately 150,000 data suppliers and covering over one million data feeds\nglobally. Based on this data, we deliver information and insights on over 90% of the world’s pharmaceuticals, as measured by 2022\nsales.** We standardize, curate, structure and integrate this information by applying our sophisticated analytics and leveraging our global\ntechnology infrastructure. This helps our clients run their organizations more efficiently and make better decisions to improve their\nclinical, commercial and financial performance. We have developed a comprehensive portfolio of intelligent, actionable information\nofferings over a period of many years through innovation, expertise and hard work that differentiates our capabilities to support\ncustomers throughout the world.\"\n\nAdditionally, with all the discussion of AI and demand for data, imo the above is a massive amount of valuable data. \n\nAn article from Scientific American in 2016 that mentions IMS Health (which somehow was allowed to merge with peer Quintiles to become Iqvia):\n\n\"The dominant player in the medical-data-trading industry is IMS Health, which recorded $2.6 billion in revenue in 2014. Founded in 1954, the company was taken private in 2010 and relaunched as public in 2014. Since then, it has proved an investor favorite, with shares rising more than 50 percent above its initial price in little more than a year. At press time, IMS was a $9-billion company. Competitors include Symphony Health Solutions and smaller rivals in various countries.\n\n**Decades ago, before computers came into widespread use, IMS field agents photographed thousands of prescription records at pharmacies for hundreds of clerks to transcribe—a slow and costly process. Nowadays IMS automatically receives petabytes (1015 bytes or more) of data from the computerized records held by pharmacies, insurance companies and other medical organizations—including federal and many state health departments. Three quarters of all retail pharmacies in the U.S. send some portion of their electronic records to IMS. All told, the company says it has assembled half a billion dossiers on individual patients from the U.S. to Australia.**\" (https://www.scientificamerican.com/article/how-data-brokers-make-money-off-your-medical-records/)\n\n__________________________\n\nHave also been buying some WSC, which a fund discusses in detail here: https://pbs.twimg.com/media/GOBAGR0XIAEJcv6?format=png&name=900x900 and here: https://pbs.twimg.com/media/GOBAJgLWAAAJVg_?format=png&name=900x900\n\nBRBR back in the $50's is something I may consider a little of. There's a bunch of smaller recent additions I've made - including MPC. \n\nAs I've said elsewhere though, I'm finding ideas for small/low end of medium sized positions, not really finding things that are worthwhile ideas to make large positions and perhaps that doesn't occur until the market corrects.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uh8lf/",
      "created": 1718536885,
      "depth": 0,
      "replies": [
        {
          "id": "l8un1c8",
          "score": 23,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8un1c8/",
          "created": 1718540269,
          "depth": 1,
          "replies": [
            {
              "id": "l8uuvrs",
              "score": 4,
              "body": "Fair (although I don't think there's really hype - it was more, \"fairly quiet/rarely mentioned, fairly steady business that might have more interest down the road\" - but I guess maybe not.) Thanks for the insights, much appreciated.",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uuvrs/",
              "created": 1718544186,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8vauw6",
          "score": 4,
          "body": "Oracle would be a better play in this regard. They Own Cerner which has the 2nd largest healthcare IT behind Epic",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vauw6/",
          "created": 1718550822,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8uqzvi",
      "score": 32,
      "body": "$UEC, $KAP, $URA - Uranium Energy as there is now a ban on Russian Uranium \n\nAlso, precious metals mining $GDX, $GDXJ and $SIL",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uqzvi/",
      "created": 1718542318,
      "depth": 0,
      "replies": [
        {
          "id": "l8y7sk6",
          "score": 4,
          "body": "So..ban ok Russian uranium is supposed to be good for those tickers?",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8y7sk6/",
          "created": 1718593315,
          "depth": 1,
          "replies": [
            {
              "id": "l8y8vlw",
              "score": 4,
              "body": "Yep. For the URA ETF and Uranium tickers. Now only \"free world\" sources can be used so I am thinking that if demand stays the same then these companies should be more profitable as they will have more control of the supply.\n\nOther play is on value of USD, build out of solar and AI which require more gold and silver. The silver mining stocks perform better with a higher return than the actual metal when the price goes up but they drop more when the metal price drops.\n\nEveryone has Silver in their house. Silver is in every circuit breaker.",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8y8vlw/",
              "created": 1718593855,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8wb20a",
      "score": 19,
      "body": "Costco ❤️",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wb20a/",
      "created": 1718564518,
      "depth": 0,
      "replies": [
        {
          "id": "l8wx6jh",
          "score": 2,
          "body": "best stock ever if you got in early, but now its expensive kinda",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wx6jh/",
          "created": 1718572805,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8uk0nb",
      "score": 16,
      "body": "VBNK.  Wrote about it here: https://www.reddit.com/r/ValueInvesting/s/CHCNS6Rl4H\n\nCSIQ.  My reason is solar is really taking off in Canada lately.  I got panels installed this year by one of the most popular companies in my city and they used all CSIQ equipment and that's when I took notice of them.  After the investment from BlackRock (who have a huge influence on Canadian policy), I was convinced to buy in.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uk0nb/",
      "created": 1718538569,
      "depth": 0,
      "replies": [
        {
          "id": "l8vcpuk",
          "score": 6,
          "body": "CSIQ is the kind of stocks that make people rich. It is super cheap, has super healthy financials and profits, and is in an industry that is expected to double next year, boosted by interest rates cuts. The cherry on the cake is that it is not on front of all mainstream media which means that now is the best time to buy.\n\nGood to know that you see the impact directly on the ground.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vcpuk/",
          "created": 1718551548,
          "depth": 1,
          "replies": [
            {
              "id": "l8wjd9q",
              "score": 3,
              "body": "Their debt level doesn’t worry you? ",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wjd9q/",
              "created": 1718567649,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8vf7vu",
              "score": 2,
              "body": "Is it cyclical? Because it’s been going down for a long time already.",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vf7vu/",
              "created": 1718552521,
              "depth": 2,
              "replies": [
                {
                  "id": "l8vhorm",
                  "score": 5,
                  "body": "Just like with all the solar industry, it went down when interest rates jumped as solar projects are almost always financed.",
                  "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vhorm/",
                  "created": 1718553464,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8v778f",
      "score": 10,
      "body": "$ASTS building a global infrastructure of cell towers in space",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v778f/",
      "created": 1718549382,
      "depth": 0,
      "replies": [
        {
          "id": "l8vrshq",
          "score": 5,
          "body": "this is probably a good play, regardless of a great depression or not this industry won't slow down.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vrshq/",
          "created": 1718557318,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8uokfw",
      "score": 7,
      "body": "Unless they add AI to their gadgets,  SharkNinja(SN).  It's been such a solid performer for me since it's IPO.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uokfw/",
      "created": 1718541079,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vff3j",
      "score": 6,
      "body": "The entire health care sector is appealing right now. Whether it be undervalued giants or plucky upstarts, there is a lot of room for growth as humanity continues to find ways to live longer. \n\nI’m currently looking further into eye care companies to see if there is one that is particularly interesting but may be ok with going with an ETF that bundles several of them at a decent weighting if I can’t figure out the winner. We are spending more and more time on screens and AI is only going to accelerate that further. We will need to take care of our eyes.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vff3j/",
      "created": 1718552598,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vu9l4",
      "score": 5,
      "body": "This recent drop in Celsius (CELH) presents one of the best entry points since the $50 dip a few months ago; got hit with some neutral news that was taken too rough, they single handedly are growing the energy drink market, and it’s rare to meet any health-focused / insta model type / gen z who doesn’t prefer Celsius to us older folks Red Bull / monsters background. \n\nAbsolute smash buy. 30% YoY growth, growing market share, international opportunities.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vu9l4/",
      "created": 1718558250,
      "depth": 0,
      "replies": [
        {
          "id": "l8w3gdm",
          "score": 5,
          "body": "My worry with them is that literally every week I see a new energy drink next to them advertising themselves as “healthy energy”. Whats going to keep Celsius at the top?",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8w3gdm/",
          "created": 1718561675,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8uds35",
      "score": 19,
      "body": " SN, ASTS, HCA, LLY, FSLR",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uds35/",
      "created": 1718534573,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8umpne",
      "score": 19,
      "body": "LLY (health), BLDR (construction products supplier)",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8umpne/",
      "created": 1718540092,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8un5zp",
      "score": 26,
      "body": "Novo Nordisk.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8un5zp/",
      "created": 1718540339,
      "depth": 0,
      "replies": [
        {
          "id": "l8xe3yx",
          "score": 3,
          "body": "Already bought 100 shares last year. Americans are fat and I for one am willing to make money of them.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8xe3yx/",
          "created": 1718579834,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8uxox0",
          "score": 2,
          "body": "How?",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uxox0/",
          "created": 1718545453,
          "depth": 1,
          "replies": [
            {
              "id": "l8uzbt5",
              "score": 8,
              "body": "They are one of the global leaders in insulin treatments. They are pharmaceutical, not tech.",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uzbt5/",
              "created": 1718546161,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8v2jql",
              "score": 5,
              "body": "Largest European company on the stock market, outperforming Eli Lilly in the US, and studies keep showing more and more positive side effects of their medicine. It would be reasonable to fear that it’s a bubble (it has had INSANE growth so far, and I don’t know a single person in Denmark who isn’t praising the company, and talking of (or actually doing it) buying stocks), yet they keep doing excedingly well, so I doubt it",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v2jql/",
              "created": 1718547508,
              "depth": 2,
              "replies": [
                {
                  "id": "l8vbkkd",
                  "score": 5,
                  "body": ">Largest European company on the stock market, outperforming Eli Lilly in the US\n\nNovo Nordisk as a company might be outperforming Eli Lilly in the US, but LLY stock has outperformed NVO\n\n[https://stockcharts.com/freecharts/perf.php?nvo,lly](https://stockcharts.com/freecharts/perf.php?nvo,lly)",
                  "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vbkkd/",
                  "created": 1718551103,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8wkfqb",
      "score": 5,
      "body": "1. Paramount Global- Stock is trading at dirt cheap prices at the moment because of a cyclical advertising downturn, and because investors don't think Paramount+ can compete with Netflix even though it's one of the fastest growing streaming services. They can also benefit from Generative AI reducing costs of production, but haven't really been vocal about it. \n\n2. Portillos(PTLO) - Local restaurant chain that is always packed that is incredibly popular in the Chicago area, and expanding throughout the country. Some locations are so packed that police have to direct traffic during busy times of day. Was very overvalued when IPOd so I was avoiding it, but its now trading at a reasonable price at about 25x earnings and roughly 1x sales.\n\n3. Intel(INTC)- Trading at less than 5% of the value of Nvidia, even though their book value is higher. The thing is products built around AI still need traditional compute hardware for things like running the web server, processing requests, etc. Additionally, the AI boom creates demand for fab space, and Intel can lease their production capacity for profit. They're also likely to get a ton of government subsidies, so you can profit at the taxpayer's expense.\n\n4. REITs in general. There is a huge panic right now over real estate, and IMO the impact to REIT prices is not justified. REITs are down about 30% on average, and office REITs are down 90%.\n\nMost real estate distress are with privately held, highly leveraged office properties. REITs, on the other hand, have quite safe amounts of leverage, and most REIT market cap is in sectors that are doing well like datacenters, self storage, logistics, cell towers, etc.\n\nDatacenter REITs in particular have a lot of potential to benefit from the AI boom- AI applications require a lot of compute. Whereas an entire companies traditional applications could run on a fewservers running dozens of virtual machines, occupying just a single rack, AI/ML applications deployed at scale requires a ton of space and power.\n\n5.Small cap value funds. If you don't want to take the risk of individual stocks, small cap value funds are a good way to gain a diverse selection of equities that generally aren't overhyped stocks.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wkfqb/",
      "created": 1718568042,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8w1be0",
      "score": 12,
      "body": "Lockheed Martin, Raytheon, General Dynamics, Northrop Grumman. All backed by Uncle Sam and his addiction to war.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8w1be0/",
      "created": 1718560873,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8uox3w",
      "score": 11,
      "body": "BRB.K & LLY both strong and steady",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uox3w/",
      "created": 1718541264,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8utuih",
      "score": 9,
      "body": "Value small cap ETF",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8utuih/",
      "created": 1718543701,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8weksr",
      "score": 9,
      "body": "Let’s face it, the majority of “Ai” being peddled is just  if-this-then-that. Still waiting for the intelligence part.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8weksr/",
      "created": 1718565853,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8v8yhs",
      "score": 2,
      "body": "Invest in retail/consumer goods. \n\nWalmart/target/costco. \n\nIf the market is going to do extremes, I personally believe the consumer goods that are necessary to live will thrive. \n\nhttps://www.suredividend.com/bill-gates-portfolio/\n\nLook at how many of his stocks impact the “common man”.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v8yhs/",
      "created": 1718550073,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vkwjt",
      "score": 3,
      "body": "Copper miners. Electrification of everything is the worlds policy direction. Will need alot of copper to make that happen",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vkwjt/",
      "created": 1718554699,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8uijv3",
      "score": 3,
      "body": "IRM, MPLX, vTRS, MO",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uijv3/",
      "created": 1718537697,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8us1j2",
      "score": 3,
      "body": "IRM & TKO have been been steady gainers for me .",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8us1j2/",
      "created": 1718542836,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8utxu2",
      "score": 3,
      "body": "Small caps and healthcare. Will probably need to wait a little longer but I think a reversal is coming. Some names I own cvs, ci, Sem, wms, csv.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8utxu2/",
      "created": 1718543744,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8uxz5w",
      "score": 3,
      "body": "I like fat stocks: Novo Nordisk is doing great, and defense stocks not doing great but ok.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uxz5w/",
      "created": 1718545580,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8v1tib",
      "score": 3,
      "body": "Renewable energy, possibly miners / rare earth related.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v1tib/",
      "created": 1718547207,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8v297z",
      "score": 3,
      "body": "Healthcare sector: Eli Lilly, Novo Nordisk",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v297z/",
      "created": 1718547389,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vh276",
      "score": 3,
      "body": "Financial Services, & Oil",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vh276/",
      "created": 1718553226,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vhqd4",
      "score": 3,
      "body": "Asts has had a good 2 months. Promising tech and finally starting to go to market. ",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vhqd4/",
      "created": 1718553481,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8voqlm",
      "score": 3,
      "body": "Novo Nordisk is currently my biggest position",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8voqlm/",
      "created": 1718556164,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vr6pv",
      "score": 3,
      "body": "Novo Lilly LVS BA XOM Kroger. Buy some Russell indexes if you wanna try for small cap in general. The stocks i named certainly aren’t small cap. \n\n\nYou’re getting at",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vr6pv/",
      "created": 1718557091,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8we40z",
      "score": 3,
      "body": "Ai is the new 3D.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8we40z/",
      "created": 1718565678,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8wqj4q",
      "score": 3,
      "body": "Rocket Lab $RKLB\n\n[https://x.com/RocketLab/status/1800733697181880657](https://x.com/RocketLab/status/1800733697181880657)",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wqj4q/",
      "created": 1718570307,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8wwhom",
      "score": 3,
      "body": "Hitachi, rolls royce hldg",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wwhom/",
      "created": 1718572534,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8x1kaw",
      "score": 3,
      "body": "The only other trendy stock outside of AI seems to be LLY.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8x1kaw/",
      "created": 1718574553,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8xhb11",
      "score": 3,
      "body": "RYCEY🚀",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8xhb11/",
      "created": 1718581217,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8u8kzv",
      "score": 5,
      "body": "BN",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8u8kzv/",
      "created": 1718530760,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8uonnc",
      "score": 5,
      "body": "HON",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uonnc/",
      "created": 1718541126,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8umph0",
      "score": 6,
      "body": "Costco or any big oil company.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8umph0/",
      "created": 1718540089,
      "depth": 0,
      "replies": [
        {
          "id": "l8ur3ma",
          "score": 7,
          "body": "I disagree I work in oil and gas and all the majors are hemeragging money at the minute and doing huge cost cutting exercises, I’m not 100% sure what is causing this but that’s what I see. A lot of my mates are being made redundant for the first time in 15-20 years. Something is going down and we will be the last to know.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8ur3ma/",
          "created": 1718542369,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8umynq",
      "score": 9,
      "body": "Palantir  is  a company that  actually uses ai. People have no clue what they do but basically it is an engine that a company can plug there requirements into",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8umynq/",
      "created": 1718540229,
      "depth": 0,
      "replies": [
        {
          "id": "l8uwx60",
          "score": 11,
          "body": "Its PE ratio is beyond reasonable at this point",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uwx60/",
          "created": 1718545111,
          "depth": 1,
          "replies": [
            {
              "id": "l8v9gsi",
              "score": 5,
              "body": "So their PE ratio is technically at 196 with a net income of around 300 million. They had gross profit of 1.9B, out of that gross profit they will no doubt be able to get better net income in the future. They have only just recently become profitable, the PE ratio is not an accurate measurement yet.",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v9gsi/",
              "created": 1718550271,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8v45cn",
          "score": 2,
          "body": "I rode pltr from the bottom up and now im pretty heavy long term bonds. Palantir can go further up but the downside risk is greater in my opinion",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v45cn/",
          "created": 1718548157,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8vtzsc",
      "score": 4,
      "body": "Hell no buy more AI",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vtzsc/",
      "created": 1718558147,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8usy8f",
      "score": 2,
      "body": "Industrials - ATKR and UFPI specifically.\n\nThey're tanking right now but with the inflation reduction act, beads act, data center build out and a turnaround in housing these will do well over the next 5-10 years. It's just getting them near the bottom of the cycle.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8usy8f/",
      "created": 1718543273,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8uwvhx",
      "score": 3,
      "body": "My favorite is $GEV. Leading supplier to power plants and the grid. Growing power demand. Expanding margins and room for multiple expansion. +50 to 100% upside in 4 years.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uwvhx/",
      "created": 1718545091,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8uzxxm",
      "score": 2,
      "body": "QCLN - Green energy ETF just dying to pop after the rate pause. \nUNH - Good time to buy. Under $500 for this in 2024 is a steal compared to a lot of the rest of the market. \nGRND - it’s got meme stock written all over it.  Cheap for a ubiquitous househd name for a demographic that’s known to spend $",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uzxxm/",
      "created": 1718546422,
      "depth": 0,
      "replies": [
        {
          "id": "l8wo1i6",
          "score": 2,
          "body": "I like grinder too and I’m in TAN which is practically identical to QCLN. ",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wo1i6/",
          "created": 1718569389,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8v0tn1",
      "score": 2,
      "body": "Industrials\n\nCSL,PH,CAT,SNA,FAST,HD\n\nReits\n\nBio-pharma\n\nConsumer staples",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v0tn1/",
      "created": 1718546792,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8v65lp",
      "score": 2,
      "body": "BA",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v65lp/",
      "created": 1718548966,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vc64m",
      "score": 2,
      "body": "Ozemtic / weight loss stocks and Japan index or mutual funds .",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vc64m/",
      "created": 1718551336,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vltq9",
      "score": 2,
      "body": "Looked at the performance of my holdings vs the S&P 500 index year-to-date (YTD) and these are the ones not *directly* related to semiconductors or AI that have outperformed the S&P 500 index YTD. The S&P 500 index is up +14.55% YTD.\n\nTicker...Return above the S&P 500 index YTD (S&P 500 index is up +14.55% YTD)\n\n* NFLX...+23.0%\n* TNK...+20.6%\n* TTD...+18.5%\n* AMZN...+6.4%\n* CCJ...+6.0%\n* BROS...+5.9%\n* FRO...+5.4%\n* FICO...+5.0%\n* TRMD...+4.0%\n* CGBD...+3.9%\n* WMB...+3.7%\n* UAN...+3.1%\n* HGTC...+2.9%",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vltq9/",
      "created": 1718555050,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vq1k8",
      "score": 2,
      "body": "Lily, Berkshire, Costco.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vq1k8/",
      "created": 1718556658,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vrmwx",
      "score": 2,
      "body": "Pfe. The CEO invested his whole pension into PFE and this stock is cheap. How can you not buy this stock?",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vrmwx/",
      "created": 1718557260,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8wkxfi",
      "score": 2,
      "body": "Vitesse Energy. Pays a nice dividend and Warren has invested in them.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wkxfi/",
      "created": 1718568226,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8uc2a0",
      "score": 5,
      "body": "I would look into a value factor ETF for this, e.g. *iShares MSCI Intl Value Factor ETF*.\n\nIt will very likely underperform during bull markets, but for diversification / non-correlation to tech boom stocks, this exactly what you need.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uc2a0/",
      "created": 1718533341,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8uxhym",
      "score": 2,
      "body": "CAVA, VZ",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uxhym/",
      "created": 1718545368,
      "depth": 0,
      "replies": [
        {
          "id": "l8vuhe5",
          "score": 4,
          "body": "Cava is way too rich right now, but 6 months ago - for sure the right call.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vuhe5/",
          "created": 1718558331,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8vii1e",
      "score": 3,
      "body": "spotify, netflix",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vii1e/",
      "created": 1718553775,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ud2hh",
      "score": 6,
      "body": "RKLB",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8ud2hh/",
      "created": 1718534071,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8uubuv",
      "score": 4,
      "body": "Intc, lol",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uubuv/",
      "created": 1718543926,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ukyfa",
      "score": 2,
      "body": "PFE, PYPL, BA.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8ukyfa/",
      "created": 1718539108,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8v2918",
      "score": 2,
      "body": "EV industry. Both China and the US. I have some diversified ETFs as well as solid holdings with RIVN, NIO, LI, and XPEV. \n\nMany are at all-time lows after an insane run of overvaluation in 2021-2022. To me, I’m optimistic since they seem to have very promising futures. These are long positions for me. \n\nI fully expect RIVN to hit $100-200 in the next 5 years and have loaded up appropriately.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v2918/",
      "created": 1718547386,
      "depth": 0,
      "replies": [
        {
          "id": "l8vxg9g",
          "score": 5,
          "body": "RIVN seems to be dying to me. Since 2022 it has only gone down, down, down. Even the unveiling of their new models did nothing, and there's basically zero brand recognition among the general public.\n\nThey also seem to have trouble with production, as the new models won't actually come out until at least 2026. They're burning cash, down to 6B from 12B last year. By 2026 the company might honestly be dead.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vxg9g/",
          "created": 1718559430,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8ufr94",
      "score": 2,
      "body": "CROX and EVVTY (Evolution Gaming)",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8ufr94/",
      "created": 1718535924,
      "depth": 0,
      "replies": [
        {
          "id": "l8ugn9p",
          "score": 3,
          "body": "I’ve had $CROX since it was around $92, still holding. I was looking at $EVVTY the past day, might get into it on Monday when the market opens.",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8ugn9p/",
          "created": 1718536506,
          "depth": 1,
          "replies": [
            {
              "id": "l8uig36",
              "score": 2,
              "body": "I have CROX at around the same price, it’s my biggest position at the moment given how well it has done this year, I’m not selling until the Crocs brand is no longer growing and if they fail to overturn the situation surrounding HeyDude.",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uig36/",
              "created": 1718537633,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8uiq5p",
          "score": 2,
          "body": "What's the rationale behind going into EVVTY?",
          "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uiq5p/",
          "created": 1718537802,
          "depth": 1,
          "replies": [
            {
              "id": "l8ul56m",
              "score": 4,
              "body": "The global online casino market is expected to be the among the fastest-growing gaming segments in the next few years and Evolution Gaming has the most market share as compared to its competitors.\n\nAnalysts are currently estimating a revenue growth rate of 15% and EBITDA margin to remain at 70% over the next 3 years. The FCF margin is at least 50% for the last 3 years.\n\nEven though this company has a narrow moat which allows other companies to copy their games, the barrier to success is much higher due to regulations and the difficulty to gain consumers’ trust.\n\nDespite all of these growth factors, the current metrics for the companies are at all time low since its IPO, I’m referring to forward PE and EV/EBITDA. And for that, I believe the company is undervalued at the moment.",
              "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8ul56m/",
              "created": 1718539214,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8ui3ug",
      "score": 1,
      "body": "PAAS or other miners even though they have already rallied quite a bit, there is still much growth possible. Next earnings might get a huge boost based on silver price increase",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8ui3ug/",
      "created": 1718537426,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8uu37s",
      "score": 1,
      "body": "small caps are going to benefit from the lower interest rates in the near future.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8uu37s/",
      "created": 1718543814,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8v18su",
      "score": 1,
      "body": "Chipotle.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v18su/",
      "created": 1718546969,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8v3ajq",
      "score": 1,
      "body": "Hedging some capital into energy that is transitioning from carbon fuel gradually.  The EV slowdown caused by O&G and legacy carmakers that has brought a tariff war on consumers means gasoline and diesel will be with us longer than the US, EU, and remarkably China had planned.  BP, TTE, APD (not an energy company but the long play is they are developing green hydrogen).",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v3ajq/",
      "created": 1718547812,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8v4g79",
      "score": 1,
      "body": "Small value or small quality etfs",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v4g79/",
      "created": 1718548280,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8v6kpb",
      "score": 1,
      "body": "Food and beverage. People need to eat and drink.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v6kpb/",
      "created": 1718549133,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8v7cxn",
      "score": 1,
      "body": "I’m still bullish on tech but I have two non tech positions that have done well. \n\nHIG - Hartford Insurance has solid performance. \n\nFSHOX - A mutual fund focusing on construction and housing. It holds home builders, Home Depot and Lowe’s, Trane (air conditioning), etc. I started accumulating a year ago and my holdings are up over 30%.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v7cxn/",
      "created": 1718549446,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8v7z65",
      "score": 1,
      "body": "Costco and John Deer",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8v7z65/",
      "created": 1718549691,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8va3eh",
      "score": 1,
      "body": "Berkshire Hathaway",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8va3eh/",
      "created": 1718550519,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vbc66",
      "score": 1,
      "body": "Brkb",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vbc66/",
      "created": 1718551012,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vdsua",
      "score": 1,
      "body": "Gold exposure , small cap etfs and non oil energy",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vdsua/",
      "created": 1718551972,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vgsx0",
      "score": 1,
      "body": "healthcare, consumer staples and good reits/bdc's for some income",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vgsx0/",
      "created": 1718553127,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vjqtq",
      "score": 1,
      "body": "Industrial stocks",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vjqtq/",
      "created": 1718554256,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vn1hh",
      "score": 1,
      "body": "Oil & Gas servicing companies, a lot of them are diversifying towards serving the offshore renewables market and potential for decommissioning work on end of life oil/gas infrastructure. \n\nNot to mention these firms have such high barriers to entry and their clients are their biggest competitors when it comes to propensity to rent.\n\nLastly, they have incredible ROIC averages with generally low WACC.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vn1hh/",
      "created": 1718555516,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vonox",
      "score": 1,
      "body": "Waste Management, Mercado Libre, RPM, Visa and OReilly Auto Parts",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vonox/",
      "created": 1718556134,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vrb73",
      "score": 1,
      "body": "I hold KO, BRK.B, PR",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vrb73/",
      "created": 1718557137,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vtccc",
      "score": 1,
      "body": "SSNC. Lots of manual paperwork and lack of integration across software in financial advisors offices as I understand it.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vtccc/",
      "created": 1718557904,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vxlsj",
      "score": 1,
      "body": "Some of my favorites:\nCadeler (wind farm installation vessels)\nMærsk (shipping)\nNKT (cables)\nAurubis (copper)\nVisa (everything money)\nSpotify / Netflix (entertainment)\nHugo Boss (fashion)\nAirbnb (travel)",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vxlsj/",
      "created": 1718559488,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vxo7w",
      "score": 1,
      "body": "Not stocks, but I’m a big fan of INCO and SMIN, two ETFs that track Indian company stocks. Both have done very well the last 2 years. INCO is consumer-facing companies; SMIN is small and mid-cap.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8vxo7w/",
      "created": 1718559513,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8w0mdz",
      "score": 1,
      "body": "Dover",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8w0mdz/",
      "created": 1718560612,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8w17ij",
      "score": 1,
      "body": "I’m quite invested in health care which will benefit from the AI",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8w17ij/",
      "created": 1718560833,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8w1rku",
      "score": 1,
      "body": "Berkshire. It’s had a good run up and now I think its starting to consolidate and come down a little. Good defensive stock that’s has a portfolio of excellent business the size of most mutual and index funds with a bunch of other wholly owned businesses on top of that.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8w1rku/",
      "created": 1718561042,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8w2gpk",
      "score": 1,
      "body": "Bank of America Corp\nNYSE: BAC\n\nRoyal Bank ( in Canada )",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8w2gpk/",
      "created": 1718561306,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8w4eza",
      "score": 1,
      "body": "Pharma (Lilly and Novo) \n\nBanking \n\nInfrastructure or energy\n\nI personally have stayed away from oil or retail with the exception of Walmart",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8w4eza/",
      "created": 1718562033,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8w8343",
      "score": 1,
      "body": "Rigetti Computing, RGTI, quantum computing. I think it’s the best value opportunity in quantum right now",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8w8343/",
      "created": 1718563402,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8waa0i",
      "score": 1,
      "body": "All roads lead to AI. It's basically impossible to put your money somewhere that ***won't*** be fundamentally changed by AI smashing into reality. \n\nThings are about to get spicy.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8waa0i/",
      "created": 1718564228,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8wf61l",
      "score": 1,
      "body": "CAVA.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wf61l/",
      "created": 1718566073,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8wfz8x",
      "score": 1,
      "body": "Hello? This guy wants to hear about stocks outside of AI",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wfz8x/",
      "created": 1718566382,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8wig7m",
      "score": 1,
      "body": "NFLX, AMZN, BRK.B",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wig7m/",
      "created": 1718567309,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8wnul7",
      "score": 1,
      "body": "DIS, ODFL",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wnul7/",
      "created": 1718569319,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8wt3cw",
      "score": 1,
      "body": "Start wading SLOWLY into Brazil, FLBR, EWZ, EWZS. Larger and larger incremental purchases as it continues to fall, bottom should be within 10-20%, sell on the bounce. ",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wt3cw/",
      "created": 1718571257,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8wv3fg",
      "score": 1,
      "body": "Don’t avoid a good rally; binge the rally while it lasts.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8wv3fg/",
      "created": 1718571995,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8x3jsl",
      "score": 1,
      "body": "Redfin $RDFN. If you believe, like I do, that real estate is bottoming and rate cuts are coming in the next 12 months, then now is the time to start accumulating.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8x3jsl/",
      "created": 1718575368,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8x6l6o",
      "score": 1,
      "body": "TLT and TMF",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8x6l6o/",
      "created": 1718576648,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8x6pbi",
      "score": 1,
      "body": "Anyone on Albermale?",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8x6pbi/",
      "created": 1718576697,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8x9wh2",
      "score": 1,
      "body": "A number of traditionally unrelated plays suddenly have an AI correlation, like utilities and energy (supplying power to datacenters), commodities (uranium for energy, copper for datacenters), and even Berkshire (Apple stake). \n\nI’d suggest farther afield, less market correlated plays like LQDA (drug for pulmonary arterial hypertension), UAN (fertilizer plant selling at a discount), and BOOM (small cap with three divisions that just received a buyout offer). I’m also liking UnitedHealth but it’s correlated to the market I’m guessing.",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8x9wh2/",
      "created": 1718578038,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8xbpg4",
      "score": 1,
      "body": "nanocap and small caps w/ no debt and good qualitative factor suggesting future performance (partnership agreements, purchase orders, asset acquisitions, future projects, disruption in industry, and if applicable a lot of cross industry application of the product offerings).\n\n20+ yr treasury leverage ETFs\n\n7-10yr treasury leverage ETF - (not in yet, probably monday).",
      "permalink": "/r/stocks/comments/1dh3sa6/your_current_favorite_stocks_to_diversify_away/l8xbpg4/",
      "created": 1718578804,
      "depth": 0,
      "replies": []
    }
  ]
}