{
  "title": "Solar powered discussion. ",
  "score": 35,
  "selftext": "I’d like to generate some thoughtful discussion on which solar power companies you think are set to thrive over the next 1-10 years and why. \n\nTo start I’ve been wanting to get back into / more into renewable energy and really like the idea of solar being the play.  Tell me about your thoughts and companies to? \n\nI’ve been eyeballing $RUN (sunrun) and $FSLR (first solar). I’ve been eyeing $RUN because of their transition into energy storage. I think this is a big play for solar and whoever has the best battery. Without good storage the power is limited in supply. \n\nI’ve been watching $FSLR because they continue beating expectations, and have powerhouse analysts who have rated this and the stock has already beat their predictions from 2 months ago. \n\nAnyways, penny for your thoughts on solar plays. ",
  "link_flair_text": "Company Discussion",
  "id": "1dh39zo",
  "num_comments": 93,
  "created_utc": 1718527296,
  "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/",
  "comments": [
    {
      "id": "l8ub5lu",
      "score": 19,
      "body": "Solar stocks don't seem to be doing well lately. We're seeing a swing towards pro-fossil fuel governments worldwide, and Chinese manufacturing has created an oversupply of low-cost panels predicted to last for several years. So it's hard for solar companies to make money in this environment. This is reflected in ETFs like Invesco Solar ETF $TAN and Betashares Solar ETF $TANN losing 37% and 29% of their value over the last year. First Solar is an outlier, increasing quite a bit in recent months, so I put a few dollars in there last week. Hoping they can continue to buck the trend.",
      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8ub5lu/",
      "created": 1718532679,
      "depth": 0,
      "replies": [
        {
          "id": "l8w9w29",
          "score": 5,
          "body": "Short term yes, long term it's irrelevant. Regardless of what nonensene the right/extreme right spreads *climate change is an irrefutable fact* and needs to be addressed (see the UN).\n\n\n\n\nSecondly our need for energy, especially *locally produced* is increasing at a rapid pace. And while building more nuclear is perhaps part of the solution it takes *many, many years* and makes us dependant on nuclear fuel from less then honest countries (Russia).\n\n\n\n\nHaters gonna hate, solar gonna stay. It light not be a guaranteed good investement (who knows) but thearlet for solar will only increase.",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8w9w29/",
          "created": 1718564082,
          "depth": 1,
          "replies": [
            {
              "id": "l8y7ad0",
              "score": 1,
              "body": "I completely agree. At least where I’m living; there has been a massive amount of new developments. I’m talking like 20+ apartment buildings, 40+ town home areas, and countless subdivisions with houses lined up all within a 5 - 10 mile radius. And as you expand out 20-30m, it’s well into the thousands of new housing developments. There’s a constant growing need for electricity / energy.",
              "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8y7ad0/",
              "created": 1718593066,
              "depth": 2,
              "replies": [
                {
                  "id": "l95ejdn",
                  "score": 3,
                  "body": "Building large solar farms can be a hassle in America tho. NIMBY gonna nimby. A wind farm and a solar farm were both successfully defeated near me. Then again, nimbys stop nuclear too, so more fossil fuels it is! ",
                  "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l95ejdn/",
                  "created": 1718716431,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8ubos5",
          "score": 3,
          "body": "You think it would take longer than 10 years for solar plays to maybe become valuable? Because china makes them cheaper and better?",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8ubos5/",
          "created": 1718533068,
          "depth": 1,
          "replies": [
            {
              "id": "l8unlr3",
              "score": 17,
              "body": "I think part of the reason residential solar isn’t doing well is interest rates. People almost always take a big loan to install solar on their home and it’s unaffordable right now.\n\nI think long term residential solar needs to come up with a model other than requiring big loans or liens on houses",
              "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8unlr3/",
              "created": 1718540570,
              "depth": 2,
              "replies": [
                {
                  "id": "l8x4vi7",
                  "score": 4,
                  "body": "Residential solar is much more expensive than utility scale solar. It is only worth it while utilities give generous subsidies, which are getting cut over time.",
                  "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8x4vi7/",
                  "created": 1718575921,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8v2yy1",
                  "score": 2,
                  "body": "Makes me wonder if any of the energy giants eg. duke energy is interested in creating a solar farm and somehow intertwining the solar energy directly to the grid saving the company units of production during sunny days, and giving the generators a break needing less output. \nNot an engineer by any means and just stimulating conversation. But it’s an interesting thought.",
                  "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8v2yy1/",
                  "created": 1718547682,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8vb65i",
                      "score": 3,
                      "body": "I think that could happen. I think that since wind and solar fluctuate so much with the environment that battery capacity and energy storage is a huge market. Nuclear and geothermal though provide baseline energy that is supplied regardless of what’s going on in the environment\n\nI think long term nuclear and geothermal are the answers to energy. Nuclear needs to get over a huge publicity/fear hurdle and geothermal really hasn’t taken off in America yet",
                      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8vb65i/",
                      "created": 1718550946,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l8vc989",
                      "score": 3,
                      "body": "I saw some statistic (haven’t done the math myself) that if the US wanted to be solar only (not that that’d happen) then we’d need a solar farm the size of Spain. Solar also takes up a large land footprint where you then can’t use the land beneath it for much (yet). Do you want to give up farm land for a solar farm?\n\nIn my view, I’d see solar being a regionally appropriate energy solution in big cities where it could provide covered parking lots and roof tops. Or, a residential surplus. I’m skeptical of solar farm being a long-term desirable solution. If the underlying thesis for solar is that it’s good for the environment, I think the trade off of land use for solar farms and preserving the environment aren’t met. As an extreme example, I’d prefer a forest with a nuclear plant over chopping down the forest to make room for a solar farm",
                      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8vc989/",
                      "created": 1718551369,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8y8gqq",
                          "score": 1,
                          "body": "I see your point, but I don’t think it would have to be one giant solar farm. I like to think that outside the big cities would house such farms, maybe even split the farms up to “surround” the cities to cut the distance it would need to travel. (If that’s even a necessary thing) \n\nI like your point though about the space the farms would take up and having the land underneath being un-usable. I also like to think that the cities could use them on roofs, sides of buildings, even building more “roofs” for over sidewalks, which would promote more walking even in inclement weather conditions but could be lined with solar panels on the top.",
                          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8y8gqq/",
                          "created": 1718593648,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "l8x50k5",
                      "score": 0,
                      "body": "You are talking about utility scale renewable energy...\n\nHonestly, if this is your level of understanding of renewable energy you should not be investing in it at all.",
                      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8x50k5/",
                      "created": 1718575980,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l8xq8pw",
                  "score": 2,
                  "body": "There are some options for handling the upfront costs. Some political parties have suggested zero-interest loans for installing home solar, which could help a country lower their emissions and reduce spending on carbon credits. Some businesses offer free installation in exchange for a long-term contract that locks in profitable rates for excess power generation they resell to the grid.",
                  "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8xq8pw/",
                  "created": 1718585174,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8ubses",
      "score": 17,
      "body": "It's very difficult for any company to build a strong moat in the solar industry. China can (and does) produce enormous amounts of top-quality panels so there's no supply/demand deficit to profit from. It's a race to the bottom for price, government assistance via tariffs, grants and bans will only go so far. We could easily come to a situation where everything is solar and yet no investment in solar has provided meaningful returns.",
      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8ubses/",
      "created": 1718533140,
      "depth": 0,
      "replies": [
        {
          "id": "l8w1jl7",
          "score": 8,
          "body": "That's one point of view 🐻 \n\n\nLooking at bullish side, companies like Enphase energy (ENPH) have patented software/ chips tech around efficient charging, pumping back to grid and really making solar viable for household installations.\n\n\nEnormous energy that A.I. companies need to power their data centers, training of models etc. can't possibly be just \"hooked\" from the grid. These companies (Google, FB, for example) have captive solar plants for elec generation. ",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8w1jl7/",
          "created": 1718560957,
          "depth": 1,
          "replies": [
            {
              "id": "l8wrdkd",
              "score": 6,
              "body": "My solar energy insider friend says ENPH is far away best for batteries and inverters. Says it could be a survivor after the wash out from terminating subsidies, the end of net metering, and interest rates. ",
              "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8wrdkd/",
              "created": 1718570618,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8x498y",
              "score": 4,
              "body": "Those data centers need reliable sources of power. If they are producing on site, they are going to be better off with a Combined Cycle Natural Gas plant.\n\nFor solar, it makes more sense to take advantage of cheap daytime wholesale rates and just buy from the grid.",
              "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8x498y/",
              "created": 1718575661,
              "depth": 2,
              "replies": [
                {
                  "id": "l905f5i",
                  "score": 0,
                  "body": "OK",
                  "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l905f5i/",
                  "created": 1718634037,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8v2dgn",
          "score": 2,
          "body": "So would it be safe to assume the best power storage would be a stronger play? Or do you think the current energy giants are funding legislation to slow clean energy progress?",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8v2dgn/",
          "created": 1718547438,
          "depth": 1,
          "replies": [
            {
              "id": "l8v98vy",
              "score": 1,
              "body": "There's no guarantees that solar w/ battery storage will ever provide a better option for baseline grid power than something like nuclear which is itself \"clean\"/low carbon in its operation.",
              "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8v98vy/",
              "created": 1718550185,
              "depth": 2,
              "replies": [
                {
                  "id": "l8vkbro",
                  "score": 5,
                  "body": "Battery storage is an orthogonal topic to the type of power generated from the grid you draw upon from today.\n\nBattery storage allows redundancy and decentralization, which is dependent on single source of energy (like a nuclear plant).\n\nThis is important in the scenarios of extreme conditions (ie, Texas winter).\n\nWhich town would you expect to be more resilient? \n\n1. One with a utility that has natural gas and a wind farm\n2. One with a utility that has natural gas and a wind farm, along with 30k homes with a few solar panels and local battery storage?",
                  "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8vkbro/",
                  "created": 1718554478,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8vndho",
                      "score": 1,
                      "body": "Redundancies come with increased costs and diminishing returns. How sound is an investment strategy based around solutions for \"extreme condition\"? It's a difficult space to pick out clear winners in whom to put your money.",
                      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8vndho/",
                      "created": 1718555644,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8vo088",
                          "score": 3,
                          "body": "You on the internet can't determine a person's need for additional energy based on their circumstances in real life.\n\nThere are plenty of other times it's useful, like utility companies that charge surge pricing or have rolling blackouts.",
                          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8vo088/",
                          "created": 1718555884,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8w0jns",
                              "score": 0,
                              "body": "You seem to have drifted pretty far from the actual topic of discussion.",
                              "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8w0jns/",
                              "created": 1718560584,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l8w16eg",
                                  "score": 3,
                                  "body": "That was my entire point when I said it's an orthogonal topic.\n\nYou made a topic that was drifting, and I explained a counter point to your drifting topic.",
                                  "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8w16eg/",
                                  "created": 1718560821,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l8x4iw8",
                  "score": -1,
                  "body": "The future for nuclear power is not looking good. Aging fleet, high construction costs, long build time and mixed political sentiment.\n\nNatural gas is the bigger threat to batteries.",
                  "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8x4iw8/",
                  "created": 1718575773,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8y6r73",
                      "score": 1,
                      "body": "Just curious why you think natural gas would be a threat to batteries? Batteries store the energy, how would gas create / store usable energy for later consumption? Just trying to pick your brain.",
                      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8y6r73/",
                      "created": 1718592810,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l8y7gr3",
                          "score": 1,
                          "body": "Because its cheaper to use natural gas as a complement to renewables rather than to store the energy and use it later.",
                          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8y7gr3/",
                          "created": 1718593153,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l8yff1o",
                              "score": 1,
                              "body": "Nuclear is the way to go, China is building a bunch every year, they catching up fast.",
                              "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8yff1o/",
                              "created": 1718597308,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l8zxlyn",
                                  "score": 1,
                                  "body": "China is also building a bunch of new coal plants, but I wouldn't call it the future. They need a lot more energy, so they are building everything.\n\nIts a very different dynamic than developed countries with modest changes in energy  demand.",
                                  "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8zxlyn/",
                                  "created": 1718630994,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l90b5ee",
                                      "score": 1,
                                      "body": "https://www.reuters.com/business/energy/us-many-15-years-behind-china-nuclear-power-report-says-2024-06-17/",
                                      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l90b5ee/",
                                      "created": 1718636117,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l96zntk",
                                          "score": 1,
                                          "body": "Yeah, the US is also way behind China on high tech coal plants. \n\nThat is the natural result of having a mature energy grid where you are focused on replacing existing plants as they retire rather than expanding the grid.",
                                          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l96zntk/",
                                          "created": 1718736051,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8uensp",
      "score": 5,
      "body": "Possibly a good play with [PV Modules imports increasing](https://imgur.com/LAFrmUv), but with the upcoming election - I prefer to watch from the sidelines.",
      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8uensp/",
      "created": 1718535185,
      "depth": 0,
      "replies": [
        {
          "id": "l8v1wgf",
          "score": 1,
          "body": "Interesting. Yeah, I don’t really follow the politics or their party closely, but I haven’t heard anything about clean energy, or initiatives.",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8v1wgf/",
          "created": 1718547242,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8uma34",
      "score": 4,
      "body": "If we accept that hypothesis that solar will provie us with the largest chunk of primary energy, as nuclear has high capex and overruns budget, then at least some US or EU solar companies should benefit.  Why? \n\nBecause I doubt that the US nor the EU would have their complete energy system being manufactured or run by chinese subsidized companies. Every country would want some autonomy on energy matters. \n\nAlso, the opposition towards solar based from latest EU election is overblown, Le Penn is actually pro solar (and pro nuclear). Von der Leyen proposed the new green deal and she will likely keep her position. \n\nThe tough question is who the winners will be; and apart from FSLR I would guess solar module producers will not join the club easily. Inverter companies might benefit, SMA Solar quite cheap right now (p/e 7.5)\n\nEnphase is right now a bit stretched, maybe solaredge recovers.",
      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8uma34/",
      "created": 1718539854,
      "depth": 0,
      "replies": [
        {
          "id": "laz1iro",
          "score": 1,
          "body": "My argument is that US solar stocks should outperform EU ones in the coming years solely based on interest rates. We can see Europe raising interest rates now while the US is starting to slow down and already talking cuts. P/E's are cool and all, but I wanna know the EPS growth potential too.",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/laz1iro/",
          "created": 1719753065,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8vk8vd",
      "score": 4,
      "body": "I normally stick to enph as it is almost entirely down because of interest rates hampering installations. I think they handled the recent drawdown very well while solar edge didn't but could violently pop when it does. I am also in icln which is a good coverage. Panels are down huge and sun power just came down from a squeeze.",
      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8vk8vd/",
      "created": 1718554447,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8uwkiz",
      "score": 7,
      "body": "I am afraid investing in solar is kind of like walking in minefield. I believe solar industry will expand and % of power from solar will grow. I do not know who will make money.\n\n1) Solar powerplants kanibalize their own profits. In Europe the price of electricity is negative when solar produce and ~~negative~~ positive when solar doesnt produce. = It doesnt make sense to build and own new solar = whether you profit is determined by laws about selling solar power, which can change.\n\n2) Manufacturing is very standardized. Which company will profit is determined by tarrifs and embargoes. If you buy chinese they can collapse when tarrifs are imposed, if you buy american they can collapse whe tarrifs are lifted.\n\nI believe who will make profits will be determined by political decision outside our control. I am not sure if solar power overall beats the market. Maybe look for somebody who will smartly control solar power, or somebody who will help regulate solar power (batteries,pumphydro,gasturbines,10y from now hydrogen)",
      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8uwkiz/",
      "created": 1718544954,
      "depth": 0,
      "replies": [
        {
          "id": "l8v10u1",
          "score": 1,
          "body": "Oh yeah, I forgot about hydro. I think that’s a good one to support too. I’m not so sure what they’ve been up to lately, but have you been following OPPT (ocean power technologies) by any chance? Penny stock last time I checked, but that’s the only one I’ve been onto before and have any slight knowledge of.",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8v10u1/",
          "created": 1718546875,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9eg5fo",
          "score": 1,
          "body": "[removed]",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l9eg5fo/",
          "created": 1718848291,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8uxzam",
      "score": 6,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8uxzam/",
      "created": 1718545582,
      "depth": 0,
      "replies": [
        {
          "id": "l8v1kt3",
          "score": 2,
          "body": "Wouldn’t this (summer) be the time all the solar installations would happen for preparation of colder months?",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8v1kt3/",
          "created": 1718547107,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8v8mh8",
      "score": 3,
      "body": "Still think solar isn't moving much until the election passes. Biden wins their will be a pump, Trump wins their will be a drop. But long-term, solar stocks will keep moving up.",
      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8v8mh8/",
      "created": 1718549945,
      "depth": 0,
      "replies": [
        {
          "id": "l9eh4jr",
          "score": 1,
          "body": "[removed]",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l9eh4jr/",
          "created": 1718848683,
          "depth": 1,
          "replies": []
        },
        {
          "id": "laz1npk",
          "score": 0,
          "body": "The drop has already been priced in for Trump winning. And the funny thing is, solar stocks performed best and peaked during Trump lol. He is the one afterall the impose Chinese tariffs which helps.",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/laz1npk/",
          "created": 1719753127,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9a8ukg",
      "score": 3,
      "body": "I am big in to clean grid. I believe the future growth is in clean grid rather than residential. I made good gain on fslr, the only american utility scale solar player. \n\nMy next big bet is FLNC. BESS investment is expected to grow 30-40percent every year until 2030. It has to cuz of climate targets. FLNC have the biggest pipeline&backlog among all bess integrators. They are asset light and does not produce battery cells, so they are risk free from china battery price and wont have to compete against catl for battery.\n\nFY2024 & FY2025 are going to be great for them. Their bess system is now eligible for ira credits, which lowers client's project cost by 50 percent. Their only problem in FY2023 was gross margin, but in FY2025 it will be around 12~15percent (now around 11) with 4 billion in revenue. They are at the profitability inflection point now and price is so attractice. My price target for FY2025 is 31.\n\nCons would be that bess integrators all have low moat, which FLNC is developing with their software system on top of bess. Another is that FLNC has two customers that acxount for 40 percent of revenue, naturally as they are a joint venture of the said companies. Lastly trump being elected would cause a small dent probably (management doesnt seem to think so).\n\n+ their FY2024 rev is 80percent contracted backlog. 20percent super late stage.",
      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l9a8ukg/",
      "created": 1718788842,
      "depth": 0,
      "replies": [
        {
          "id": "l9btnt5",
          "score": 1,
          "body": "I completely agree that clean grid is the future! I’ll definitely look into FLNC. I’ve never heard of them before. Do you know of any projects they’re working on now to meet climate accords and where / which states or cities are using their products / services? \nLet’s pray the election has more preservation for earth, and global causes. Winters aren’t what they use to be, and we could really use more / better global initiatives on this.",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l9btnt5/",
          "created": 1718814122,
          "depth": 1,
          "replies": [
            {
              "id": "l9bvjg2",
              "score": 1,
              "body": "I use energy-storage.news for all the clean grid news. You can check all the ongoing projects there!",
              "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l9bvjg2/",
              "created": 1718814748,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8vktxi",
      "score": 2,
      "body": "What are the economics like on battery storage? Say you charge up the batteries during excess solar capacity (daytime) and sell back when grid capacity is lower than demand (evening, night, morning). Then is it reasonable to say that you make money from the number of charge cycles you complete per battery?\n\nSo your production costs include the batteries themselves and infrastructure to support them. If you charge the batteries when its day and discharge the batteries at night (one cycle per day), what sort of profit can you generate? And how long would it take to pay back the battery investment to be in the green on the project? And is that an attractive investment to even make in the first place?",
      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8vktxi/",
      "created": 1718554670,
      "depth": 0,
      "replies": [
        {
          "id": "l8wrxx8",
          "score": 2,
          "body": "Didn’t they get rid of net metering?",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8wrxx8/",
          "created": 1718570826,
          "depth": 1,
          "replies": [
            {
              "id": "l8x1nni",
              "score": 2,
              "body": "I don't know, I'm just asking how it works. Doesn't seem like a realistically practical solution from my perspective, but maybe I'm missing something. Battery storage isn't cheap and there has to be some sort of financial incentive for it to make sense.",
              "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8x1nni/",
              "created": 1718574590,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8yagxx",
          "score": 1,
          "body": "So while I don’t personally have solar powered units on my home, I don’t know if I’m quite qualified to answer the question. But In my case I wouldn’t be so worried about selling the excess stored energy back to the grid during times where energy consumption is less, (I sleep with the tv on for example) so I assume it would slowly just use the stored energy. \nAnd as per day hours when the most activity happens in the house, computer microwave, toilets, hot showers, etc, I’d assume it would save some money by not taking 100% power from the grid. \nI would also like to assume this could help during storms when the grid shuts down because a tree or whatever took out a power line. I kinda think of this as a power bank for my phone (except for my house) and if massive adoption occurred I’d like to think it would lower power costs because the generators wouldn’t need to pump out as much energy. I would also think that would lower maintenance costs because the machines aren’t running so hard. \nBut I don’t know what I don’t know and I’m no where close to an electric engineer or specialist in any way, these are all just assumptions.\nAs far as the costs go, I too wonder how long it would take to essentially “pay for the solar power” with the savings from using less grid power. Likely years last time I checked prices on residential solar projects. But once they’re there, it’s there for generations to benefit from. So long term ++",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8yagxx/",
          "created": 1718594657,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8xqx04",
      "score": 2,
      "body": "One of my largest wins. Nextracker and Enphase. I’ve gotten downvoted a lot in the last 10 years or so and have only made profit. \n\nIt’s very clearly the future unless we get a life changing technology in nuclear, but then so many daily needs would be met. \n\nFSLR would not be my first priority. Enphase changed the industry.",
      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8xqx04/",
      "created": 1718585480,
      "depth": 0,
      "replies": [
        {
          "id": "l8yao8i",
          "score": 1,
          "body": "I’ve seen emphase mentioned 3-4x in this thread. How did they change the industry? I’m definitely going to look into them. I wasn’t so sure on which way to look at it, the solar farm or the storage of the energy as the best play.",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8yao8i/",
          "created": 1718594762,
          "depth": 1,
          "replies": [
            {
              "id": "l8yj97w",
              "score": 3,
              "body": "Mostly their micro inverters. Increased efficiency so much. At this point energy and efficiency is significantly important for our tech reliant world. With such large quantities, those tiny margins mean the difference in billions of costs",
              "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8yj97w/",
              "created": 1718599501,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l992ozu",
      "score": 2,
      "body": "My thinking is that clean energy is at a collective low point. Build better back plan has us pretty locked in to commitment to renewables/EVs, trump wont be able to reverse it even if he gets elected.\n\nTSLA is the main exception because of the weirdness around Elon and his pay package.\n\nAnyways, I like ACES ETF right now, and just started via reoccurring to mitigate risk.\n\nI also like cannabis ETFs given the federal declassification of marijuana as a schedule 1 drug.",
      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l992ozu/",
      "created": 1718763884,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8uat8n",
      "score": 3,
      "body": "Both seem solid. There is solar ETF TAN.",
      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8uat8n/",
      "created": 1718532427,
      "depth": 0,
      "replies": [
        {
          "id": "l8ub209",
          "score": 1,
          "body": "Anything interesting about it? I’ll take a look.",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8ub209/",
          "created": 1718532605,
          "depth": 1,
          "replies": [
            {
              "id": "l8ubpqq",
              "score": 3,
              "body": "It’s just a bunch of solar stocks.  I bought some long dated calls that expire in January.",
              "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8ubpqq/",
              "created": 1718533087,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8uba57",
          "score": 1,
          "body": ".67% expense ratio? Kind of high??",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8uba57/",
          "created": 1718532772,
          "depth": 1,
          "replies": [
            {
              "id": "l8ubr46",
              "score": 2,
              "body": "Yeah, it’s a bit high.",
              "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8ubr46/",
              "created": 1718533114,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8udain",
      "score": 3,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8udain/",
      "created": 1718534229,
      "depth": 0,
      "replies": [
        {
          "id": "l8uorq1",
          "score": 2,
          "body": "I prefer the Iron Flow technology.  GWH",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8uorq1/",
          "created": 1718541186,
          "depth": 1,
          "replies": [
            {
              "id": "l8v1f6t",
              "score": 1,
              "body": "Can you elaborate, I never heard of this either. What makes you more interested in the iron flow? Are you watching any tickers?",
              "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8v1f6t/",
              "created": 1718547043,
              "depth": 2,
              "replies": [
                {
                  "id": "l8vljta",
                  "score": 2,
                  "body": "Na Ion batteries have been in development just as long as Li and now CATL is the only one producing commercial batteries.      They still have complex chemistry issues and short life-time.   There may have a place but I feel LFP batteries will dominant EVs.   Also if government see China controlling the technology - they will shy away.\n\nFor me, the market is Energy Storage - Iron Flow technology has over 25 years  life expectancy and enhanced safety.  Utilities do not want to change out systems every 5-10 years.\n\nESS Tech is gaining a foothold with demonstration units in a number of countries, and I like their partnership with Honeywell.",
                  "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8vljta/",
                  "created": 1718554945,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8v1c6v",
          "score": 1,
          "body": "That’s pretty interesting, never heard of this kind of battery before. Are you watching any tickers? If so why specifically are you interested in their company.",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8v1c6v/",
          "created": 1718547009,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8val66",
          "score": 1,
          "body": "Vanadium redox flow batteries...\n\nHuge in China.",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8val66/",
          "created": 1718550716,
          "depth": 1,
          "replies": [
            {
              "id": "l8xxt8u",
              "score": 1,
              "body": "Hey. DM’d u a question about spdr rebalance/nvda",
              "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8xxt8u/",
              "created": 1718588655,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8v5qbc",
      "score": 2,
      "body": "Too much competition, possibility of government distorting markets, and lack of moats keeps me on the sidelines when it comes to PV energy. \n\nI hope to see every home covered with solar cells, but I just don't see making money from it.",
      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8v5qbc/",
      "created": 1718548801,
      "depth": 0,
      "replies": [
        {
          "id": "l8y8sb5",
          "score": 1,
          "body": "I hope so too, I think we really need to do something to help our environment as much as we can.",
          "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8y8sb5/",
          "created": 1718593808,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8uvasj",
      "score": 2,
      "body": "Only nuclear has the energy density to support growth 🤷‍♂️. your kids or grandkids might get rich off of space based solar or something tho.",
      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8uvasj/",
      "created": 1718544374,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9ekcpx",
      "score": 1,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l9ekcpx/",
      "created": 1718849993,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8w06yx",
      "score": -2,
      "body": "*This comment has been replaced with a top-secret chocolate chip cookie recipe:*\n\n**Ingredients:**\n\n - 1 cup unsalted butter, softened\n - 1 cup white sugar\n - 1 cup packed brown sugar\n - 2 eggs\n - 2 teaspoons vanilla extract\n - 3 cups all-purpose flour\n - 1 teaspoon baking soda\n - 2 teaspoons hot water\n - 1/2 teaspoon salt\n - 2 cups semisweet chocolate chips\n - 1 cup chopped walnuts (optional)\n\n**Directions:**\n\n1. Preheat oven to 350°F (175°C).\n2. Cream together the butter, white sugar, and brown sugar until smooth.\n3. Beat in the eggs one at a time, then stir in the vanilla.\n4. Dissolve baking soda in hot water. Add to batter along with salt.\n5. Stir in flour, chocolate chips, and nuts.\n6. Drop by large spoonfuls onto ungreased pans.\n7. Bake for about 10 minutes, or until edges are nicely browned.\n\nEnjoy your delicious cookies!\n\n---\n\n*edited by Power Delete Suite v1.4.8*",
      "permalink": "/r/stocks/comments/1dh39zo/solar_powered_discussion/l8w06yx/",
      "created": 1718560451,
      "depth": 0,
      "replies": []
    }
  ]
}