{
  "title": "SoFi: Overhyped or Underhyped?",
  "score": 56,
  "selftext": "Everyone knows the story. A one stop shop for all your financial needs, the Apple of finance, the AWS of fintech... but the stock has not moved in over a year and is down 38% since its IPO. Probably mostly due to being overhyped at first, the macro uncertainty at the moment and the thought that this \\*bank\\* has not been tested on a real difficult macro environment. I probably wont say anything new existing bulls don't already know though, as the stock is cultish and has a very loyal following\n\nHowever, in recent months, due to the constant negative stock price action there has been a real increase in negative sentiment on social media, with people saying that they are capitulating or are desperate to sell at the next uptick, and sofi bulls are being trashed all over social media, with bears being increasingly vocal as well. This increased so much so that even on SoFi Stock subreddit the mods said that they started letting more and more posts and comments straight up trashing the stock through, in part due to their large volume I believe.\n\nTrading/investing on sentiment alone is never a good idea, \\*unless\\* the sentiment is trending in the opposite direction of the fundamentals. What's more, although insiders are net sellers atm, the CEO keeps buying the stock on every single dip, and institutional ownership has increased from around 32% to over 41% over the past year.\n\nWhy do I believe the fundamentals are trading in the opposite direction?\n\n1. SoFi is valued like a moderately fast growing bank even though their pace of growth in margins and earnings for now is that of a tech company.\n   * Their current P/B value (used to value banks) sits at around 1.17, with an all time high of 4.32 and low of 0,78, while JP Morgan is currently valued at 1.82. To be fair, JP Morgan's growth in book value per share has been 13.2% over the past 12 months, while SoFi's has been -0.9%, due to dilution.\n   * Despite this, management has been determined to lower SBC as the company matures, and at the moment are in growth mode, focused on scaling their multiple business segments to make up 33% of their revenue each, this includes: Lending (currently significantly overweight in terms of revenue share), Financial Services, Tech Platform.\n2. The current growth rate projected by management takes into account extremely conservative assumptions:\n   * Lending is set to grow around 0% percent this year, as is management's conscious decision, reflecting an uncertain macro environment, with that rate having the potential to explode once default rates stabilize and projections are more clear.\n   * Financial services are currently growing by more than 70% each year and are expected to grow by at least 50% every year for the next few years.\n   * Tech platform is set to grow by at least 20% Y/Y. \n   * All of these rates assume no new product launches or \"unexpected\" sources of revenue. However, management has hinted that they are in talks with multiple top financial institutions about tech platform implementation, with \"a top 5 US bank\" having tested a proof of concept. This platform would help the banks switch from their old legacy software to one that is a lot more robust and able to accommodate modern online banking needs, as well as having people who actually know the coding language and so can help if any technical difficulties arise. Thing is, galileo is based in part on infrastructure-as-a-service model that allows SoFi to generate revenue based on their clients' size, for example generating a small profit every time a transaction is made on one of their clients' platforms. Having a large bank as their client would significantly accelerate their growth rate.\n3. They turned profitable this year, and EPS growth is expected to continue, but not everyone is convinced.\n   * They expect to grow from projected 0,08 in 2024 c to at least 0.50 to 0.80 c by 2026, which if done and continued would significantly aid in growing book value, if not demand a higher multiple, currently being at around 81 FWD PE (2024), but 13 FWD PE (2026).\n   * The analysts and financial institutions are sceptical about this growth rate, and this is in part where the opportunity lies. The growth targets have been called \"aspirational\", and the first quarter that SoFi turned profitable, one analyst basically asked if they were rigging numbers.\n   * There has also been some controversy surrounding their accounting, as they are using a method that assumes they would sell their loans rather than hold them to maturity, and the scepticism was that they would fail to sell due to reducing demand which would force them to account for higher losses on their balance sheet. However, they have demonstrated that even their unsecured loans are of the highest quality (FICO scores more than 750), and trusted by the market, by selling a significant number of their loans last quarter.\n4. People are mostly happy with the product, SoFi is well rated, and their deposits are insured up to 2 mil due to the banking license, so customers probably feel their money is safe as well. They are dilligent with their product launches, the CEO has hinted that they were slow with Zelle implementation for example to ensure customers' security. Crypto has currently been discontinued, but the talks are ongoing with regulators, and with all the recent product launches, such as the crypto ETFs, it may come back at some point.\n5. The management seems nimble, with Anthony Noto at the forefront, having kept up their growth rates despite losing their largest business segment (Student loans) a few years back, having completely transformed the business, and now focusing on improving other segments rather than unsecured loans when the default rates are still rising, this makes me trust their guidance a little more.\n\nInvesting in this company requires trusting that the managements' projections are honest and potentially conservative, and that they are able to execute, which they currently have a history of doing. There is a lot of mistrust in the market, however, which may be founded, but just seems overdone at the moment.\n\nThe bet would be that they sign up a large client within the next few quarters and significantly raise their guidance, which could make current price seem like peanuts.\n\nBecause of these reasons, I believe SoFi may currently be Underhyped.",
  "link_flair_text": "DD",
  "id": "1dhbykv",
  "num_comments": 83,
  "created_utc": 1718557133,
  "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/",
  "comments": [
    {
      "id": "l8vrb6e",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 9 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8vrb6e/",
      "created": 1718557137,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8w2t3y",
      "score": 124,
      "body": "Seasoned veteran SOFI bag holder here. I’ve averaged down into almost every dip since it existed. I still like the business but I would’ve done things a lot differently knowing what I do now. And this goes for any stock not just SOFI.\n\nWhat I’ve learned here is whether over/under hyped…what the market thinks is clear. One day I may be ‘proven right’ and blessed with huge gains. I’ll show people my $6.85 cost basis and they’ll go wow so smart wow he knew before everyone else. Maybe. But I’ll have spent a lot of time with my money stuck in a turd. That $ could’ve been in NVDA or any other name constantly making new highs and those profits could’ve been rolled into SOFI whenever it actually became investable. There’s a huge hidden cost of having your $ stuck in names the market doesn’t like.  \n\nUnderstand when you buy a stock you’re not just buying the business, you are buying the behavior of the stock price. Doesn’t matter what you think or feel about it. The stock doesn’t care. Doesn’t matter if it’s being suppressed or manipulated or whatever you might imagine. Buy stuff that’s acting right or just don’t buy.",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8w2t3y/",
      "created": 1718561436,
      "depth": 0,
      "replies": [
        {
          "id": "l8xgcxw",
          "score": 14,
          "body": "sage advice,  nicely put.",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8xgcxw/",
          "created": 1718580806,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8xga1r",
          "score": 9,
          "body": "This right here. My strategy has been to sell Cash-Secured Puts on SOFI during the dips because it’s an impossible stock to call the bottom on. Currently have 10k shares at a $7.03 basis & last week sold 150 $7 7/5 puts & received $9K. If assigned I’ll have 25K shares at a $6.65 basis & start selling $7 covered calls or if we get a good bounce in the next few weeks I’ll buy the puts back for hopefully at least 50% profit. \n\nI actually love the volatility of this stock for selling options on & running the wheel.",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8xga1r/",
          "created": 1718580771,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8x6a7u",
          "score": 10,
          "body": "I'm somehow green on SOFI. I sold at 7.21 last month. I might buy a couple hundred shares at this price.",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8x6a7u/",
          "created": 1718576519,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8y3qwc",
          "score": 5,
          "body": "I've sold covered calls on my 1k shares in my roth account and its taken my average from 7.44 to 3.21 mathematically speaking. Since it never goes above 7.50",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8y3qwc/",
          "created": 1718591382,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8w486l",
      "score": 19,
      "body": "Great analysis, undervalued due to sentiment, management's guidance looks solid",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8w486l/",
      "created": 1718561962,
      "depth": 0,
      "replies": [
        {
          "id": "l8w79bj",
          "score": 9,
          "body": "SoBuy?",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8w79bj/",
          "created": 1718563094,
          "depth": 1,
          "replies": [
            {
              "id": "l8xgfv1",
              "score": 7,
              "body": "The CEO keeps buying when below $6.70 so I’d say yes.",
              "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8xgfv1/",
              "created": 1718580842,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8vtw9r",
      "score": 43,
      "body": "There are so many stocks out there and retail seems to love to focus on the same 10 or so. If there are dedicated YouTube channels to covering your stock and a semi-cult around it, then it's probably fairly priced for the risk/reward that it offers. Bank stocks are notorious for carrying risks that are invisible until they manifest, at which point they go down 80% in a week. Everyone seems to be assuming that because Sofi has grown in the past, it will continue to do so in the future. It's harder to grow as you get larger, and Sofi has likely collected most of the low hanging fruit that it had available.",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8vtw9r/",
      "created": 1718558111,
      "depth": 0,
      "replies": [
        {
          "id": "l8vvlt7",
          "score": 7,
          "body": "Completely agree about the risk, but again this assumes a black swan event, thus my thesis about people being very sceptical about the company. As for the cultishness, a lot of cultish stocks on the market that went up significantly after the fears surrounding them subsided after delivering good results, thus I think it may work both ways: high amounts of retail are prone to panic selling and thus driving the price down.",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8vvlt7/",
          "created": 1718558747,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8w0a6l",
      "score": 26,
      "body": "I don't know anything about the stock, but I use the product and it has been good. Personal anecdote, Sofi gave me a refund the next day, no questions asked after I tried fight with ebay for 7 months.",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8w0a6l/",
      "created": 1718560484,
      "depth": 0,
      "replies": [
        {
          "id": "l8wb7n0",
          "score": 12,
          "body": "Yep all in one banking with about 4.5% apy savings (better returns than some of my shitty stock picks) is great. Switched from USAA to SoFi a few years ago and have been quite happy with the product",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8wb7n0/",
          "created": 1718564577,
          "depth": 1,
          "replies": [
            {
              "id": "l8x6kpd",
              "score": 1,
              "body": "My issue is that their loan rates are dogshit compared to other banks, so i feel like they dont close many loans.",
              "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8x6kpd/",
              "created": 1718576642,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8wd6i1",
      "score": 9,
      "body": "They didnt mention AI, which would make it skyrocket, obviously",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8wd6i1/",
      "created": 1718565325,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8wkpbz",
      "score": 8,
      "body": "Only thing that gives me a bit of optimism is those long-term EPS targets. They’ve been pretty much beating guidance every quarter so I don’t know if they’d put out numbers like that if they weren’t even close to hitting them.",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8wkpbz/",
      "created": 1718568141,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8xe2vv",
      "score": 5,
      "body": "I bought 3k worth in 2021 at $19.31 a share because this sub was filled with posts saying to buy… still holding but looking to sell in the next few months and just move on",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8xe2vv/",
      "created": 1718579821,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vwxpm",
      "score": 13,
      "body": "SoFi is not a cult stock. Not even close. Ppl here are not posting hodl every 30 minutes. Some ppl sell and post goodbyes and others sympathize. The cult stock does not.",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8vwxpm/",
      "created": 1718559238,
      "depth": 0,
      "replies": [
        {
          "id": "l8wk537",
          "score": 2,
          "body": "There are dedicated YouTube channels for this stock lol, if that ain’t a cult, I dunno what it is",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8wk537/",
          "created": 1718567933,
          "depth": 1,
          "replies": [
            {
              "id": "l8xtb35",
              "score": 5,
              "body": "Same with any other meme stock. AMC/GME is an objectively money losing piece of shit that only operates by selling shares to retail. They post weird spiritual journey diaries dedicated to DFV. \n\nSOFI does none of those. No one here peddles conspiracy theories about hedgefunds.",
              "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8xtb35/",
              "created": 1718586568,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l910fj8",
              "score": 2,
              "body": "There’s dedicated YouTube channels for a lot of stocks\n\nNNDM … like 2 years ago… Jfc everyone hyping that shit up",
              "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l910fj8/",
              "created": 1718644784,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8x6qti",
              "score": 0,
              "body": "They are probably trying to peddle referral codes for sofi",
              "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8x6qti/",
              "created": 1718576714,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8w6n5n",
      "score": 4,
      "body": "i can't read",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8w6n5n/",
      "created": 1718562863,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8wuxic",
      "score": 4,
      "body": "It doesn’t really matter what we think, the market thinks it’s a shit fintech , until they can prove wallstreet different, it won’t go anywhere. It’s a meme stock at this point.",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8wuxic/",
      "created": 1718571932,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8wgweh",
      "score": 4,
      "body": "Excellent post, thank you for your analysis. I buy companies with great leadership and Anthony Noto has proven himself a terrific leader and CEO. This thing’s gonna pop, IMO. Rates go down, SoFi crushes it with Student Loan refi and Mortgages. When rates went up, SoFi originates a lot of personal loans. They win either way rates go. In either case, they lend to high earning, high FICO borrowers. Dont forget also that their Net Interest Income keeps growing every quarter and looks like will continue to do so. Why? Because their member base and deposit base are also growing. They dont need to steal a ton of customers from Wells or BAC or JPM, they just need to keep doing what they’re doing and it’s a success. And yes, I use the product and love it. ",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8wgweh/",
      "created": 1718566732,
      "depth": 0,
      "replies": [
        {
          "id": "l8x6x1h",
          "score": 1,
          "body": "Their loan rates are dogshit, I've looked into them lol",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8x6x1h/",
          "created": 1718576787,
          "depth": 1,
          "replies": [
            {
              "id": "l8x7ino",
              "score": 8,
              "body": "If you don't like the rate, then don't take out a loan. But SoFi has plenty of demand for those loans, as evidenced by their pace of monthly originations.",
              "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8x7ino/",
              "created": 1718577042,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8vx7k3",
      "score": 12,
      "body": "It’s just a shitty online bank designed for poor people. Dime a dozen.",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8vx7k3/",
      "created": 1718559340,
      "depth": 0,
      "replies": [
        {
          "id": "l8w74cz",
          "score": 8,
          "body": "So the same as nubank which people here love?",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8w74cz/",
          "created": 1718563043,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8vxkk2",
          "score": 7,
          "body": "Poor or not rich yet? Haha",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8vxkk2/",
          "created": 1718559475,
          "depth": 1,
          "replies": [
            {
              "id": "l8w0q5l",
              "score": 10,
              "body": "HENRY",
              "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8w0q5l/",
              "created": 1718560652,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8x9sxl",
          "score": 1,
          "body": "This is it though. They try dressing up their POV as different from their peers in their sector (Financial Credit Services) but their P/S is in line with everyone else and there really isn't anything differentiating them. It's like online insurance companies telling you life will be easier and less costly with them, but then you run their rates and they are 50% higher than their peers (looking at you ROOT Insurance) and their customer service base focuses more on upselling than issue resolution and customer serivce (looking at you again ROOT Insurance).\n\nSofi will sit where its at, and in line with the other shitty stocks in their sector.",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8x9sxl/",
          "created": 1718577997,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l910ica",
          "score": 0,
          "body": "Designed for poor people is probably the exact opposite of their business model",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l910ica/",
          "created": 1718644811,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8xbe7i",
      "score": 2,
      "body": "Huge secular trends. People moving to online banking, consolidation of banking into a few online winners (from all the 1000 regional banks) , clients are young their net worth will rise with promotions and eventual boomer inheritance wealth transfer. They are growing direct deposit account customers these customers are sticky. Once you have a bank many people don’t even switch.  Buy your shares and forget about it just check in that revenue/profits still growing >15% a year each year. This will be a grower not a shower though. Patience. It will compound just due to secular trends.",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8xbe7i/",
      "created": 1718578673,
      "depth": 0,
      "replies": [
        {
          "id": "l8xbgit",
          "score": 2,
          "body": "*They are the best setup bank branding wise for these trends of any",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8xbgit/",
          "created": 1718578700,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8vu64z",
      "score": 4,
      "body": "Definitely overhyped. Even at these valuations it’s priced at around double the p/e compared to fellow banks like Bank of America, and they don’t come close to making a fraction even of the amount of money those fellow banks cost. Not to mention they have worse margins. And yet it’s all anyone on Reddit wants to cope about - right now it’s valued for future growth that they haven’t even shown they can match. I think that’s fair for such a hyped stock, but certainly not worth all the posts it gets",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8vu64z/",
      "created": 1718558214,
      "depth": 0,
      "replies": [
        {
          "id": "l8vuw62",
          "score": 14,
          "body": "Thats fair, but PE reflects expected growth more than anything. SoFi is growing its EPS, with projected significant growth, while BoA's EPS is shrinking, thus is a higher PE, even if it should be valued just like a bank, really that unwarranted?",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8vuw62/",
          "created": 1718558485,
          "depth": 1,
          "replies": [
            {
              "id": "l8vvmfv",
              "score": 2,
              "body": "Actually yes considering their two greatest possible catalysts - bank charter and student loans resuming - have passed and now it’s actual hard work and user growth/retention which is all they have to rely on. But beyond that I’m referring to how overhyped it is per your request - what part of any of this makes you believe they are underhyped when they are priced higher towards competitors when they are dealing peanuts in comparison with similar growth rates? Because that’s the barrel SoFi is facing down. \n\nAnd I say this as someone who really likes SoFi and what they’ve done - great management in Noto which is beyond rare to see these days.",
              "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8vvmfv/",
              "created": 1718558753,
              "depth": 2,
              "replies": [
                {
                  "id": "l8vx7hi",
                  "score": 9,
                  "body": "Yes their revenue is peanuts comparatively, but revenue is not important for PE ratio, the growth in EPS is important, for SoFi its a little higher due to positive EPS growth, for BoA its lower due to negative EPS growth. However, I still believe the higher PE is not high enough when taking into account the potential 600% growth in EPS between 2024-2026 that they are projecting. Am I a fool for believing? Maybe, I believe that the market is pricing in slowing growth because of the reasons you mentioned, as well as believing that SoFi has nothing unique to offer, without believing in the catalysts, I.E. that the EPS growth is delivered as promised, SoFi manages to survive the macro environment, and a large financial institution signs up for Galileo, which brings in additional revenues.",
                  "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8vx7hi/",
                  "created": 1718559339,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8vzwjt",
      "score": 3,
      "body": "It is being diluted, that is a reason",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8vzwjt/",
      "created": 1718560345,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8w57e0",
      "score": 2,
      "body": "I feel like their business model is pretty good, but I don’t think traditional banks will ever let them fuck with them. All of manipulation happening for sure.",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8w57e0/",
      "created": 1718562327,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8yg1ry",
      "score": 2,
      "body": "Strangely the stock is down, with improving fundamentals. This is a clear value play in my eyes. I'm 50% allocated to SOFI at about 7.00$ I expect it to go to 14$ by the end of the year. I think Tony needs to stop sandbagging  the guidance though it doesn't help anyone.",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8yg1ry/",
      "created": 1718597660,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8x2idu",
      "score": 1,
      "body": "Private financing (student loans, etc etc) is really hot when interest rates are 2.5%. All of a sudden when no one needs to refinance things, there’s not as much need for their “product” so it largely just depends on market conditions. Right now I say no, but maybe if rates drop again and people want to look into refinance it may be a decent play",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8x2idu/",
      "created": 1718574940,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8xitsa",
      "score": 1,
      "body": "I’m a bagholder so my point will fall on deaf ears. On metrics for stocks with similar growth it’s undervalued. Although there’s an army of opposing banks and analysts that work to cripple any movement on the stock. I’ve never seen a stock beat guidance drastically and get two price downgrades from an analyst in a few weeks. The life of a sofi bagholder",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8xitsa/",
      "created": 1718581883,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l90eszl",
      "score": 1,
      "body": "It’s an overpriced bank",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l90eszl/",
      "created": 1718637413,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l940d9c",
      "score": 1,
      "body": "OP you're supposed to post your position not say you believe it's underhyped",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l940d9c/",
      "created": 1718685889,
      "depth": 0,
      "replies": [
        {
          "id": "l9452t5",
          "score": 2,
          "body": "Sorry, 474@8.87. But started to really believe its underhyped at 6.5 recently",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l9452t5/",
          "created": 1718688476,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9h6ciu",
      "score": 1,
      "body": "dont understand why Sofi insiders has been selling their shares frequently recently. maybe they know some info we dont or just pure tax purpose?",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l9h6ciu/",
      "created": 1718898153,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8w5nob",
      "score": 1,
      "body": "total meme, avoid if you like money",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8w5nob/",
      "created": 1718562495,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8wb4x2",
      "score": 0,
      "body": "Overhyped. Always overhyped",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8wb4x2/",
      "created": 1718564549,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8wfjep",
      "score": 1,
      "body": "An overpriced bank masquerading as an innovative Fintech",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8wfjep/",
      "created": 1718566216,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8wj90q",
      "score": 1,
      "body": "lol the Apple or AWS of fintech? Come back to me and let us know what each’s margins are.",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8wj90q/",
      "created": 1718567606,
      "depth": 0,
      "replies": [
        {
          "id": "l8wk0tp",
          "score": 1,
          "body": "I was being facetious, this is just what people have called it",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8wk0tp/",
          "created": 1718567889,
          "depth": 1,
          "replies": [
            {
              "id": "l8woru0",
              "score": 3,
              "body": "Those people are good at losing other peoples’ money.",
              "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8woru0/",
              "created": 1718569660,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8xednt",
      "score": 1,
      "body": "I remember looking into them a couple months back, I just remember thinking their business model sounded sus. Also I really don't like the investment aspect of their product. I vaguely remember something (**Edit: this is not true)** about how they only allow you to invest in their own ETFs or something, I found that stupid.\n\nPersonally, companies like SoFi rn are a dime a dozen and I'm just not really seeing their competitive advantage compared to whats out there already.\n\nNow, I can easily be wrong, this is really only an armchair analysis but I did in fact try out their product and didn't like anything I saw.",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8xednt/",
      "created": 1718579952,
      "depth": 0,
      "replies": [
        {
          "id": "l8y7f79",
          "score": 2,
          "body": "I have bought individual stocks through SoFi",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8y7f79/",
          "created": 1718593131,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8xi0gk",
      "score": 1,
      "body": "I totally believe in the company.  I mean FFS TATUM IS ON THE COMMERCIAL.   That’s all the DD I need baby GO CELTICS",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8xi0gk/",
      "created": 1718581527,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8wiuh6",
      "score": 0,
      "body": "Underhyped. I love the stock but Wallstreet hates it just like upst and other fintech. But they got a bank, so they have so much going for them. They are a massive threat to the brick and mortar system.  I see their future being massive. The minute they blow out earnings the stock will fly so I sit hold and wait.",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8wiuh6/",
      "created": 1718567457,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8wybg5",
      "score": 0,
      "body": "Don't work, it is going up this week.",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8wybg5/",
      "created": 1718573252,
      "depth": 0,
      "replies": [
        {
          "id": "l9hbdbg",
          "score": 1,
          "body": "it's thursday now, 1 day left.. hope ur right",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l9hbdbg/",
          "created": 1718899828,
          "depth": 1,
          "replies": [
            {
              "id": "l9jk8u3",
              "score": 1,
              "body": "So what happened on Monday? Doesn't count?",
              "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l9jk8u3/",
              "created": 1718927753,
              "depth": 2,
              "replies": [
                {
                  "id": "l9k53jg",
                  "score": 1,
                  "body": "I just bought 4000@6.78 , still hope it's going up",
                  "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l9k53jg/",
                  "created": 1718936630,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8xeuq2",
      "score": 0,
      "body": "Me sitting here on 500 shares at $16 cost basis",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8xeuq2/",
      "created": 1718580157,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8xou8l",
      "score": 0,
      "body": "Nothing you mention here hasn't been part of the bull pitch for SOFI for literally the last 4 years.  And yet the stock is busted.\n\n*Never buy a broken stock.*\n\nLong SOFI",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8xou8l/",
      "created": 1718584544,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8vruxt",
      "score": -3,
      "body": "Didn’t they only make money due to some combination with interest rates and student loans?",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8vruxt/",
      "created": 1718557344,
      "depth": 0,
      "replies": [
        {
          "id": "l8vt2ct",
          "score": 3,
          "body": "What do you mean? Yes the student loans have resumed and so they are generating some more money from them, but they are operationally profitable in all three of their segments if Im not mistaken.",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8vt2ct/",
          "created": 1718557800,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8vtd3m",
          "score": 5,
          "body": "They're way less reliant on student loans now\n\nTheir profitability will only go up as interest rates lower. Banks like low interest rates",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8vtd3m/",
          "created": 1718557912,
          "depth": 1,
          "replies": [
            {
              "id": "l8vzjoh",
              "score": -1,
              "body": "That’s not true highest interest rates increase their revenue but also their funding costs so overall it’s mixed whether lower rates can help them\n\nBut however Fed is not going to lower rates without a recession which means they will face bigger issues wth defaults..",
              "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8vzjoh/",
              "created": 1718560211,
              "depth": 2,
              "replies": [
                {
                  "id": "l8w3phd",
                  "score": 3,
                  "body": "People take way less loans when interest rates are up. Yes more revenue, way less volume \n\nOverall worse",
                  "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8w3phd/",
                  "created": 1718561770,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l8x75yh",
                  "score": 1,
                  "body": "They dont make more money on higher rates. They borrow money to lend do you, they only make closing fees and the arbitrage between fed rate and your rate.",
                  "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8x75yh/",
                  "created": 1718576894,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8w4u9h",
      "score": -4,
      "body": "They are a small bank that doesn’t make money.  Why bother ?",
      "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8w4u9h/",
      "created": 1718562191,
      "depth": 0,
      "replies": [
        {
          "id": "l8w51d8",
          "score": 8,
          "body": "They have been profitable for two quarters now and are guiding to maintain it",
          "permalink": "/r/wallstreetbets/comments/1dhbykv/sofi_overhyped_or_underhyped/l8w51d8/",
          "created": 1718562265,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}