{
  "title": "[deleted by user]",
  "score": 80,
  "selftext": "[removed]",
  "link_flair_text": null,
  "id": "1dhhenw",
  "num_comments": 53,
  "created_utc": 1718572156,
  "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/",
  "comments": [
    {
      "id": "l8xd19l",
      "score": 46,
      "body": "I've been in and out of uranium positions for several years.\n\nThere is an extremely compelling thesis for uranium miners / U stocks (*these are your primary ways to invest in the sector*). Even without considering the recent developments in the sector, the uranium market was always looking at a deficit this decade. There was too little investment and mining in the 2010's, and now many projects **need** to come to production in order to meet demand.\n\nThe 'uranium thesis' has less to do with future viability of nuclear power (*including the threat of fusion, or criticisms of the permitting process, safety, waste, or other reasons people commonly write off the trade*) -- it is a simply a supply & demand problem. There are currently X number of reactors in the world and they need Y .lb's of fuel. \n\nHowever, nuclear has seen a measurable resurgence around the world in recent years, meaning there's going to be more demand than anticipated while supply has *not* been catching up. Geopolitics *(especially around Russia / Kazakhstan)* have also fueled this frenzy, among many other factors. So we have uranium projects racing to come online in the near future to close the supply gap, but also new reactors to gobble up that new supply. \n\nIt's a raging market with a very promising future, but here's the catch - U stocks blow a big one. They are extremely volatile, and anyone considering jumping into them needs to brace their ass for that volatility. It's a small sector and will have often have frustrating and quite significant pullbacks.",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8xd19l/",
      "created": 1718579375,
      "depth": 0,
      "replies": [
        {
          "id": "l8ydaev",
          "score": 6,
          "body": "Thanks for the response. I’ve been tracking mildly from the sideline for the last few years. \n\nDo you have any interesting tickers to look into?",
          "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8ydaev/",
          "created": 1718596144,
          "depth": 1,
          "replies": [
            {
              "id": "l8yem97",
              "score": 11,
              "body": "$URNM is my go-to ETF and it's just the easiest exposure to sector. I think it is balanced quite well in it's weightings. $CCJ has been rock solid and is one of the largest names in the sector.\n\nBeyond that - rules of the sub forbid talking about many other uranium miners. A lot of them are sub $1B in market cap, or are OTC stocks. You can check out $URNM's holdings a good overview of what's available. Again, these are speculative and volatile.",
              "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8yem97/",
              "created": 1718596866,
              "depth": 2,
              "replies": [
                {
                  "id": "l8ykrq5",
                  "score": 1,
                  "body": "I’m guessing the expense ratio is honkers lol ",
                  "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8ykrq5/",
                  "created": 1718600407,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l8yldce",
                      "score": 5,
                      "body": "0.75%, I believe. Pretty standard for niche ETFs like this.",
                      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8yldce/",
                      "created": 1718600770,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8wytn3",
      "score": 10,
      "body": "When cake was ~$25 no one cared and US producers needed at least $60 for break even.  It was tried to be thrown as a national security risk for American uranium companies when trump was president because America imports like 99% of its uranium.",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8wytn3/",
      "created": 1718573450,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8xeqav",
      "score": 3,
      "body": "I am curious if anyone has any idea of a good company to invest in for nuke power?",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8xeqav/",
      "created": 1718580104,
      "depth": 0,
      "replies": [
        {
          "id": "l8xhrx8",
          "score": 7,
          "body": "Uranium miners are your best bet for exposure into the sector. Cameco is arguably the best 'blue-chip' stock, in terms of market cap, liquidity and stability. Risk / reward gets more extreme as you look at smaller cap stocks, ranging anywhere from $100M - $1.5B.\n\nURNM and URA are the two major ETFs that dominate the sector. URNM is almost strictly uranium mining companies, while URA has a few other related inclusions.",
          "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8xhrx8/",
          "created": 1718581424,
          "depth": 1,
          "replies": [
            {
              "id": "l8xk2g9",
              "score": 2,
              "body": "Yeah I’m doing solid with URA, but I may pull back on routine investment for a bit",
              "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8xk2g9/",
              "created": 1718582426,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l8xz5ah",
              "score": 1,
              "body": "Thanks for the suggestion but past experience in investing in mining companies has made me wary of jumping in on these types of companies. I was thinking more along the lines of power plant construction and operation. I was curious about the growing movement toward SMRs (small modular reactors) that GE, Rolls-Royce, and BWXT seem to be heavily invested in. You have European countries such as the UK and Poland that are looking for alternatives to Russian oil and these SMRs, if successful, could really mark a paradigm shift in the proliferation of nuclear power if what I am reading about the subject is accurate. These companies are already profitable and are diversified outside of nuclear energy.",
              "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8xz5ah/",
              "created": 1718589268,
              "depth": 2,
              "replies": [
                {
                  "id": "l8ybl98",
                  "score": 1,
                  "body": "Being wary of mining companies makes you smart and wise! They can be a mess. \n\nThe reason the go-to investment is uranium miners is because they provide the most direct asset to the sector, and in a way that still has a lot of upside. Other related companies may be private, or larger corporations that have only have subsidiaries that touch this stuff, or maybe have just a small portion of their larger business related to nuclear buildouts, or they're foreign companies not listed on major markets, etc., etc. \n\nPoint being, it's just easier to go with the miners. A lot of these other companies may benefit from the uranium bull market, or they may not. It's just not as clear cut. Take a look at URA's non-miner holdings for an idea of the types of companies you could buy as an alternative to miners. \n\nI think SMR's are wonderful and they have a ton of potential as they gain momentum. Though as it stands, I see them just as risky as uranium miners. At least for the 'pure play' companies, such as $SMR. These are just as volatile - if not *more so* - than their mining counterparts. I've been swinging in and out of $SMR as best I can, but it's been a wild ride recently. Hard to pinpoint a good entry!",
                  "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8ybl98/",
                  "created": 1718595243,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l8xqp6e",
          "score": 4,
          "body": "CCJ also",
          "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8xqp6e/",
          "created": 1718585382,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9awyjt",
          "score": 1,
          "body": "Rolls Royce $rycey",
          "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l9awyjt/",
          "created": 1718802310,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8xhwmi",
          "score": 1,
          "body": "Oklo is a good one to watch",
          "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8xhwmi/",
          "created": 1718581481,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8xx0am",
      "score": 2,
      "body": "$LEU",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8xx0am/",
      "created": 1718588281,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8xex7f",
      "score": 4,
      "body": "Ummmm...probably not very good? Considering the timeline of things like (a) permitting process and (b) actual build timeline once you're through all the regulatory hurdles are pretty broad - usually measured in decades.\n\nJust browsing the [EIA Uranium report](https://www.eia.gov/uranium/marketing) that was published last week.....it doesn't look like [deliveries had any significant increase in 2023](https://imgur.com/a/So1iwS4). It looks to be the case going back as far as [2002 as well](https://imgur.com/a/Joo1VBV)\n\nBut as far as gaining actual exposure to any of the uranium market by way of investing in public equities, the universe of uranium sellers (not sure if you can really call them E&Ps) looks [incredibly limited - only public name I recognize is BHP](https://imgur.com/a/j0bjIl7)\n\nedit: Link to [full 2023 Uranium Marketing Annual Report](https://www.eia.gov/uranium/marketing/pdf/2023%20UMAR.pdf) from the EIA",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8xex7f/",
      "created": 1718580187,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8x38vi",
      "score": 4,
      "body": "> In addition to the operational reactors, around 60 new reactors are currently under construction, indicating ongoing investment and expansion in nuclear power​.\n\nAnd how many are reaching end of life? Over the last 20 years, we have had 107 plants retire and 100 new plants online.\n\nNuclear has an aging fleet and is dealing with significant price competition from renewable energy, on top of mixed political views. I would expect more contraction than growth.",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8x38vi/",
      "created": 1718575241,
      "depth": 0,
      "replies": [
        {
          "id": "l8y0edn",
          "score": 2,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8y0edn/",
          "created": 1718589841,
          "depth": 1,
          "replies": [
            {
              "id": "l8y1hn7",
              "score": 0,
              "body": "This is a stock subreddit. What happens 100 years from now isn't relevant.",
              "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8y1hn7/",
              "created": 1718590337,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8zhopj",
      "score": 2,
      "body": "Are we building anymore nuclear power plants?\n\nI’m more bullish on oil, natural gas, and coal.  Renewables make us feel good, but fossil fuels provide the energy driving our world.",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8zhopj/",
      "created": 1718623299,
      "depth": 0,
      "replies": [
        {
          "id": "l8zztcx",
          "score": 2,
          "body": "Said the quiet part out loud.",
          "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8zztcx/",
          "created": 1718631888,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l90j7d7",
          "score": 2,
          "body": "I think more nuclear plants are shutting down then being built, in the US at the very least. The public is still generally anti-nuclear power, despite what the reddit hivemind may tell you. And it just takes once bad nuclear incident to make the public much more anti-nuclear then they already, are even if no one dies in said incident (see Fukushima, and how it's turned Japan against nuclear power).\n\nPlus nuclear power plants are simply too expensive and time consuming to build, and nuclear power plants tend to have more expensive electricity.",
          "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l90j7d7/",
          "created": 1718638948,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8zddal",
      "score": 1,
      "body": "I have a small position in LEU, centrus energy  to have uranium exposure",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8zddal/",
      "created": 1718620657,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ze3qv",
      "score": 2,
      "body": "The Reddit user 3STmotivation is super into uranium stocks if you want to do some reading. ",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8ze3qv/",
      "created": 1718621130,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8zzj27",
      "score": 1,
      "body": "Futures are not a good way to get exposure to this thesis. There’s a completely rationale scenario where nuclear takes off in a big way which causes uranium mining to get more competitive and for uranium prices to actually go down in the long run due to scalability.\n\nIt’s kind of like living through the 90s and saying “the internet looks to have promising potential. What do you think about buying tons and tons of Ethernet cables?”",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8zzj27/",
      "created": 1718631774,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l92uf7z",
      "score": 1,
      "body": "Does anyone know why URNM volume is so low compared to URA? It's options spread is so large",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l92uf7z/",
      "created": 1718667934,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9awtbr",
      "score": 1,
      "body": "SMRs buy $rycey",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l9awtbr/",
      "created": 1718802249,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9hv2rs",
      "score": 1,
      "body": "Buy some GEV instead.",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l9hv2rs/",
      "created": 1718906183,
      "depth": 0,
      "replies": [
        {
          "id": "l9icu0f",
          "score": 1,
          "body": "Why? xD   \nIs there any more information other than the random ticker?",
          "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l9icu0f/",
          "created": 1718912068,
          "depth": 1,
          "replies": [
            {
              "id": "l9it5b4",
              "score": 1,
              "body": "If you want to be in the mining business , uranium raw is alright but I want the finished product as a refined fuel and a more valuable and expensive commodity in the market. I repeat for lithium and copper also.  Give me the product and the negotiable market for my money.  That is what I get thru GEV , a turn key business in nuclear.  Set a limit on it as a sector and let it run and keep track of which way the enviromentalist and government mood are blowing. Everything is under one roof.",
              "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l9it5b4/",
              "created": 1718917527,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8x1z43",
      "score": 0,
      "body": "Buy",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8x1z43/",
      "created": 1718574720,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8x8vdm",
      "score": 0,
      "body": "Still needs a couple more years.",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8x8vdm/",
      "created": 1718577606,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8y0tau",
      "score": 0,
      "body": "I'm tilted heavy into uranium just off a gut feeling. I feel like AI will figure out how to make it even more efficient somehow.",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8y0tau/",
      "created": 1718590032,
      "depth": 0,
      "replies": [
        {
          "id": "l9itejl",
          "score": 1,
          "body": "Please share how AI will influence uranium. Inquiring minds want to know.",
          "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l9itejl/",
          "created": 1718917616,
          "depth": 1,
          "replies": [
            {
              "id": "l9j1tjg",
              "score": 1,
              "body": "I see it as a give and take cycle. The take is more obvious is that AI requires a lot of power, which nuclear does best. The give is that AI is already optimizing nuclear reactor technology. Literally Google the effect of AI on nuclear. One exceptionally interesting one is that we achieved stable nuclear fusion for the first time due to AI predicting failures before they happened.\n\nhttps://interestingengineering.com/science/ai-to-stabilize-nuclear-fusion?utm_source=facebook&utm_medium=article_image",
              "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l9j1tjg/",
              "created": 1718920584,
              "depth": 2,
              "replies": [
                {
                  "id": "l9j5qek",
                  "score": 1,
                  "body": "I'm not trying to appear obstinate , but HOW is AI optimizing nuclear power ?\n\nHow can it even optimize grid efficiency from a nuclear plant. A load is a load.\n\nHow was nuclear fusion stabilized thru AI ?  Math and engineering have been around for a long time before any artificial control programming.  Pressure and heat are defined levels.\n\nYour points reinforce my argument that many production tasks are now being rewritten to include AI as having played a role and the facts are not there for those prone to knowledge of actual operating systems. Soon . making pizza and pasteurization of milk will be attributed to AI . \n\nEveryone needs to read between the lines of many AI claims.  Too many are drinking the punch without understating the data currently needed.",
                  "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l9j5qek/",
                  "created": 1718922037,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9j6a2z",
                      "score": 1,
                      "body": "You might be right and it's just hype bullshit on the optimization side, but the increase in energy demand is definitely real. I'm not an expert on energy but I've read that nuclear can provide the most power consistently. My personal ignorant assumption on energy production is utilizing the tides, but I haven't researched enough about it to confidently invest.",
                      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l9j6a2z/",
                      "created": 1718922245,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8yxoun",
      "score": 0,
      "body": "I’ve been waiting for someone to do a DD on this, as I myself have been researching a lot on renewable energy and have been slowly investing into companies like nano nuclear $NNE which is up over 120% in the last month. \nI recently discovered rolls Royce $rycey has been investing money into this tech as well, and $smr is another one displaying moves into this tech. I have a small position, but would like to hear other people’s thoughts as well.",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8yxoun/",
      "created": 1718609035,
      "depth": 0,
      "replies": [
        {
          "id": "l9ax1zn",
          "score": 1,
          "body": "Ya they have just been doing nuclear subs since the 60s lol",
          "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l9ax1zn/",
          "created": 1718802349,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8zl6mg",
      "score": 0,
      "body": "In the future Uranium will do the heavy lifting when renewables fall short.  \n\n\nI've had some nice gains on a uranium miner and a uranium ETF and I agree Uranium is the future but recently my gut told me to pull the money from uranium and put it into something else whilst I wait for Uranium's future to gain momentum. I moved most of the cash into a semiconductor ETF.",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8zl6mg/",
      "created": 1718625208,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8zc665",
      "score": -1,
      "body": "I think we don‘t need new nuclear reactors but we will build many anyways and eventually realize that it was a stupid and redundant move.",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8zc665/",
      "created": 1718619854,
      "depth": 0,
      "replies": [
        {
          "id": "l9itnzu",
          "score": 1,
          "body": " It may scare the horses ?",
          "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l9itnzu/",
          "created": 1718917710,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8xghwj",
      "score": -2,
      "body": "Uranium ain’t gonna be a good play. We went too hard for solar/wind and those industries will continue their exponential growth because of it. Nuclear will get less and less love as a result. It’ll be decades before nuclear has a resurgence imo.",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8xghwj/",
      "created": 1718580866,
      "depth": 0,
      "replies": [
        {
          "id": "l8xk4e0",
          "score": 1,
          "body": "Buy low? LOL",
          "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8xk4e0/",
          "created": 1718582450,
          "depth": 1,
          "replies": [
            {
              "id": "l8xmn35",
              "score": 2,
              "body": "It’s the age old r/stocks strategy of catching a falling knife and then gripping it HARD for 15 years before considering it might have been wiser to let go earlier.",
              "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8xmn35/",
              "created": 1718583566,
              "depth": 2,
              "replies": [
                {
                  "id": "l8xmq5t",
                  "score": 2,
                  "body": "Oh no! One of those lol",
                  "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8xmq5t/",
                  "created": 1718583604,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8xocmn",
      "score": -2,
      "body": "The future in energy is nuclear fusion which is powered by Helium-3 that can be found on the moon.",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8xocmn/",
      "created": 1718584325,
      "depth": 0,
      "replies": [
        {
          "id": "l8z0nzu",
          "score": 1,
          "body": "Interesting",
          "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8z0nzu/",
          "created": 1718611278,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9itzdo",
          "score": 1,
          "body": "I don't know about moon mining but I will bet the farm on the transport supporting such when it becomes viable.",
          "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l9itzdo/",
          "created": 1718917821,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8x1n07",
      "score": -17,
      "body": "unsustainable because of its possible damage to the nature like radioactive waste. clean energy is the way to go. maybe fusion energy that can give almost “limitless” energy.",
      "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8x1n07/",
      "created": 1718574584,
      "depth": 0,
      "replies": [
        {
          "id": "l8x21mc",
          "score": 3,
          "body": "Well, right now the two leaders on that subject are China and India.\nNot sure how much weight they put on the environment",
          "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8x21mc/",
          "created": 1718574749,
          "depth": 1,
          "replies": [
            {
              "id": "l8x4v8t",
              "score": 6,
              "body": "It’s also factually false. Nuclear energy uses the least material, land and has the lowest carbon footprint. It’s the most environmentally friendly method to generate electricity. Unfortunately the upfront costs are tremendous.\n\nFWIW, I’ve been invested in uranium for a while on the thesis that countries with limited land will not be able to decarbonize without nuclear energy. Not financial advice, but just my thoughts on why I’ve been holding for a while ",
              "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8x4v8t/",
              "created": 1718575918,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8xgvik",
          "score": 5,
          "body": "Incorrect. Nuclear waste is minimal, it’s  understood, extremely easy to transport and store safely. The NIMBY’s have made it impossible to work with nuclear because of hysteria regarding the topic. If we had put the same investment into nuclear as we have growing solar and wind, we’d have free electricity this decade.",
          "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8xgvik/",
          "created": 1718581030,
          "depth": 1,
          "replies": [
            {
              "id": "l8ybp6v",
              "score": -1,
              "body": "the thing you called “hysteria” is what scientists has concluded. underestimating the damage of nuclear waste just shows you have no idea about the topic",
              "permalink": "/r/stocks/comments/1dhhenw/deleted_by_user/l8ybp6v/",
              "created": 1718595299,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}