{
  "title": "Plan to short TSLA",
  "score": 55,
  "selftext": "Why:\n\nTesla sales have been slowing and tesla inventory has been building. This is apparent from reports of inventory build up around their factories, Q1 reporting, layoffs, and the April 2nd update.  The following site also shows an inventory increase but I do not trust this source entirely since some of the basic functionality on this site is broken. [https://tesla-info.com/blog/inventory-stats-regional/Global?q=4#google\\_vignette](https://tesla-info.com/blog/inventory-stats-regional/Global?q=4#google_vignette)\n\nThe recent tesla layoffs (late April) were a crossed the board and un-structured; reported as \\~10% of the workforce. I suspect that it may have been larger than that but have nothing to back that up. They were un-structured as employees were given no notice and some key divisions were let go in mass (supercharger team) which were later brought back on. Employees were given 2 months of severance pay to prevent a WARN act lawsuit. Payment was scheduled to go out 45 days after termination. All in all we can expect that for this quarter payroll will be approximately unchanged for Q2 reporting while production efficiency will have been reduced by more than 20% (reduced moral, key employees will have been let go, other employees will need retraining to fill vital roles). this means less than 80% of the work for 100% of the pay which means reduced margins in Q2.\n\nSpeculation: Tesla does not have updated models that would entice current model 3/Y (their bread and butter) owners to buy a new Tesla. Most people who wanted a Tesla have already bought one. Competition in the EV market is building; many auto makers now have EV's available that are more attractive to the every day driver.\n\nTesla is way behind now on autonomous vehicles. Waymo is already online in Phoenix and San Francisco and is being brought online in LA. Tesla rejected radar and lidar technology which is rapidly decreasing in cost. GM, Hyundai, BMW and other manufactures already have level 2 advanced cruise control (this is what FSD is) online. BMW will be releasing a level 3 ACC soon. Tesla dropped the ball and is already late to the market for fully autonomous cars and is falling behind on level 2 ACC. \n\n [https://www.bmwblog.com/2023/07/26/bmw-level-3-self-driving/](https://www.bmwblog.com/2023/07/26/bmw-level-3-self-driving/)\n\nTesla's robot, optimus, has not been shown to do anything useful beyond acting as a pick and place machine (these have existed since the 80's). Optimus can barely walk and is far behind Boston Dynamics (mostly owned by Hyundai). Optimus is a dead end and a pipe dream; Tesla is many years behind other companies and it's not clear if this technology will be useful considering the competitive wages of overseas workers. \n\nAfter the vote last week TSLA shot up in the pre-market then fell on Thursday and Friday. My guess is that a few, or even one, large share holder was backing out of Tesla; this was expected since this was a very divisive vote. The fan boi's have been pushing Tesla stock hard lately and although I have no proof I suspect that many influencers on youtube, twitter, and main stream media are somehow profiting through a back door means to pump Tesla and have been for some time. I have the feeling that most of us, or at least the people who have enough control to actually move markets, are seeing through Elon's BS and just need a catalyst to take a closer look and drop TSLA from their portfolio's.\n\nWhat:\n\nI plan to use \\~10% of my portfolio to buy out of the money puts on 1JUL24 expiring 19JUL24. Strike price should be about -10% from stock price at that time. Depending on the severity of the 2JUL24 report from Tesla I may see either a sudden drop or a slow decline in the stock price leading into 17JUL24. After market on 17JUL24 I am expecting another drop and will close my position at market open 18JUL24 with out regard to price.\n\n",
  "link_flair_text": "DD",
  "id": "1dhou8r",
  "num_comments": 103,
  "created_utc": 1718595417,
  "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/",
  "comments": [
    {
      "id": "l8ybxl1",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 week ago\n**Total Comments** | 5 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8ybxl1/",
      "created": 1718595423,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8yhrbg",
      "score": 133,
      "body": "Elon will come up with even more ridiculous lies to pump the stock. It always happens.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yhrbg/",
      "created": 1718598632,
      "depth": 0,
      "replies": [
        {
          "id": "l8zitt1",
          "score": 28,
          "body": "Space robotaxis end of the year!",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8zitt1/",
          "created": 1718623945,
          "depth": 1,
          "replies": [
            {
              "id": "l8zoo17",
              "score": 11,
              "body": "20K usd Galactic humanoids by the end of 2025",
              "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8zoo17/",
              "created": 1718626981,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l8yi99d",
          "score": 20,
          "body": "agreed",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yi99d/",
          "created": 1718598918,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8zsla5",
          "score": 8,
          "body": "Or he'll post on Twitter that he's doing something he's not just to pump it right when this poor guy is trying to make money off his puts... August 8th anyone?",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8zsla5/",
          "created": 1718628822,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8zilu5",
          "score": 3,
          "body": "“$25 trillion market cap”",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8zilu5/",
          "created": 1718623820,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8yovmm",
      "score": 42,
      "body": "I'm never falling for tsla puts again",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yovmm/",
      "created": 1718602979,
      "depth": 0,
      "replies": [
        {
          "id": "l903b3p",
          "score": 6,
          "body": "There is a sell button, if you didn't know that.",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l903b3p/",
          "created": 1718633245,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8yp0o5",
          "score": -12,
          "body": "details, when did you short and why?",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yp0o5/",
          "created": 1718603069,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8yxr11",
      "score": 37,
      "body": "I stopped reading at “a crossed the board”",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yxr11/",
      "created": 1718609080,
      "depth": 0,
      "replies": [
        {
          "id": "l8zfv2b",
          "score": 8,
          "body": "same",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8zfv2b/",
          "created": 1718622222,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l90iyio",
          "score": 2,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l90iyio/",
          "created": 1718638862,
          "depth": 1,
          "replies": [
            {
              "id": "l926i8y",
              "score": 4,
              "body": "OP is probably non native englihs pseaking ceo of chinese EV company",
              "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l926i8y/",
              "created": 1718658878,
              "depth": 2,
              "replies": [
                {
                  "id": "l93xtvp",
                  "score": 2,
                  "body": "you caught me",
                  "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l93xtvp/",
                  "created": 1718684508,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8yehyl",
      "score": 42,
      "body": "but didn't you watch the investors meeting? it's going to 30 trillion.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yehyl/",
      "created": 1718596800,
      "depth": 0,
      "replies": [
        {
          "id": "l8ykhho",
          "score": 17,
          "body": "an increase of half a brazillion dollars!",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8ykhho/",
          "created": 1718600234,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8yelyg",
          "score": 7,
          "body": "lol",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yelyg/",
          "created": 1718596862,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8yo43v",
      "score": 37,
      "body": "My only thought is that you might be too caught up in a storyline that you’ve created. You’re predicting what you’re going to do on specific days a month from now, I don’t think it’ll be quite that easy.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yo43v/",
      "created": 1718602490,
      "depth": 0,
      "replies": [
        {
          "id": "l9g27zs",
          "score": 1,
          "body": "The numbers don’t support the 50 times forward earnings price, it is overvalued based on hype.  Reality dictates a much lower share price.",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l9g27zs/",
          "created": 1718882156,
          "depth": 1,
          "replies": [
            {
              "id": "l9gj737",
              "score": 1,
              "body": "That’s never prevented the stock from going higher before so you shouldn’t rely on it to start mattering now.",
              "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l9gj737/",
              "created": 1718890007,
              "depth": 2,
              "replies": [
                {
                  "id": "l9go9s3",
                  "score": 1,
                  "body": "You shouldn’t rely on the same master plan over and over to create the same hype.  The actual numbers don’t lie.",
                  "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l9go9s3/",
                  "created": 1718891944,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9gpb3d",
                      "score": 1,
                      "body": "I’m not. I don’t care about the company or Elon, just here to make a buck. If something keeps working I’ll just keep with that strategy while it works. When the parade ends, it’s just a small loss because I’m managing risk and then I move on. Being right about numbers doesn’t pay if the stock price goes a different direction and that’s ultimately all that matters.",
                      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l9gpb3d/",
                      "created": 1718892326,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l8yogns",
          "score": -2,
          "body": "Your absolutely right; everything is up for modification until then even the abandonment of the plan in it's entirety. I do think that it is a good idea to hold off until the 1st though to minimize risk associated with speculation and random events.",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yogns/",
          "created": 1718602712,
          "depth": 1,
          "replies": [
            {
              "id": "l8zoyaq",
              "score": 1,
              "body": "Just wait till after the numbers then go short",
              "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8zoyaq/",
              "created": 1718627119,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l8yiule",
      "score": 7,
      "body": "When is next earnings report? Too lazy to look.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yiule/",
      "created": 1718599264,
      "depth": 0,
      "replies": [
        {
          "id": "l8yjdpw",
          "score": 8,
          "body": "17JUL24",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yjdpw/",
          "created": 1718599574,
          "depth": 1,
          "replies": [
            {
              "id": "l8zwa3g",
              "score": 5,
              "body": "Its not official date. I hope you arent buying 07/19 puts thinking ER date is official lol",
              "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8zwa3g/",
              "created": 1718630437,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l90qlm9",
      "score": 7,
      "body": "Geofenced autonomous driving is insignificant in the bigger picture compared to FSD. Yes FSD isn't ready yet but it's really just a matter of time. There are zero other companies that have a comparable product. For your sake I hope you didn't short it at the today's open.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l90qlm9/",
      "created": 1718641486,
      "depth": 0,
      "replies": [
        {
          "id": "l93y9zg",
          "score": 1,
          "body": "no of course not; expecting bs news and speculation to screw around with price for the next few weeks; don't know what strikes to use yet.",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l93y9zg/",
          "created": 1718684746,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l93x5dg",
          "score": 1,
          "body": "[https://en.wikipedia.org/wiki/Tesla\\_Autopilot](https://en.wikipedia.org/wiki/Tesla_Autopilot)\n\nThey are using a camera only system on most of their cars at the moment; some have radar. They are not using lidar or high resolution maps. Tesla's implementation autonomous driving was abandoned by everyone else many years ago as it was found to be unsafe and unreliable; this is only suitable for SAE level 2 at most. They are also training on consumer drivers were as competitors are only using training data derived from professional drivers + using a driving simulator (garbage in = garbage out no matter how much data you have). They have not yet applied for legal permission anywhere to use an SAE level 3, 4, or 5 system. the current level 4 systems in operation are geofenced and speed limited for safety; Tesla would be required to follow these guidelines as well. No level 5 systems currently exist. \n\nThis is all really a moot point though; most Tesla owners did not buy autopilot/FSD and most drivers drop the subscription after the 1 month trial. Even if they achieved level 5 FSD it's not clear how profitable it would be since it is being sold as an add-on for a car sale (guessing it would be about as profitable as current systems are now). It's not clear if robotaxi's will be profitable either. These taxi's will still need maintenance (daily cleaning at least). For a service like Uber the driver would be on the hook for all of these expenses; with robotaxi's Tesla will be. Consumer cars will not be on the robotaxi network no matter what Elon says; imagine the insurance nightmare. Remember, Waymo already has SAE level 4 robotaxi's; last I checked their valuation is only $30 billion. SAE level 4 and 5 is not a golden ticket, this won't change Tesla's income by a wide margin.",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l93x5dg/",
          "created": 1718684145,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8zdcqx",
      "score": 14,
      "body": "I would not short tesla even if all the factories where on fire.\n\n\nElmo; thanks to the fires we have discovered our latest car in the family the model f3n1k£, our hottest car yet!\n \n*shares go up 30%.\n\n\nTesla stock is such an oddball, nothing makes sense.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8zdcqx/",
      "created": 1718620648,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l90sfa1",
      "score": 11,
      "body": ">Tesla is way behind now on autonomous vehicles.\n\n  \nYou are going to lose all your money if you seriously believe this.  Hate Tesla all you want but their FSD is years ahead of anyone else.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l90sfa1/",
      "created": 1718642109,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l90aiaz",
      "score": 4,
      "body": "I like your analysis but remain unconvinced.  \n\nYour claim that the economic fundamentals of TSLA do. It support its current price and we should expect more bad news in the coming month makes sense.  The problem is that everyone knows that TSLA trades well above the actual economic performance of the company.  Therefore, showing that TSLA stock would fall in a rational universe is trivially true.\n\nYour more interesting argument is that we should expect a change in behavior of the investors pumping the stock for reasons other than economic fundamentals such as weakened influencer support.  However, I don’t see why you expect such support to soften.  Why is July 2024 the month that TSLA investors return to their senses?  I need more convincing on this step.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l90aiaz/",
      "created": 1718635890,
      "depth": 0,
      "replies": [
        {
          "id": "l93xr8l",
          "score": 1,
          "body": "Tesla has been growing quarter over quarter for years now. The drop in sales and build up in inventory in Q1 is a problem if it continues as it would show that Tesla has reached it's peak. It's valuation has always been based on the idea that it would eventually grow into a behemoth vertically integrated auto manufacture supplying most of the worlds vehicles. A further inventory build up, missed sales, and reduced margins could be a wake up call for a lot of investors that they are on a sinking ship. We will have a better idea if that is going to happen on July 2nd and will know for sure the third Wednesday in July when Q2 posts.",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l93xr8l/",
          "created": 1718684468,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8ycaua",
      "score": 12,
      "body": "Puts on Elon as a human",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8ycaua/",
      "created": 1718595618,
      "depth": 0,
      "replies": [
        {
          "id": "l8yfdd0",
          "score": 5,
          "body": "ELON is no longer trading, bought out by Adesto",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yfdd0/",
          "created": 1718597283,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l91kui2",
          "score": 2,
          "body": "Already ITM",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l91kui2/",
          "created": 1718651601,
          "depth": 1,
          "replies": [
            {
              "id": "l91pqz2",
              "score": 2,
              "body": "Already printing premiums",
              "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l91pqz2/",
              "created": 1718653256,
              "depth": 2,
              "replies": [
                {
                  "id": "l91u77u",
                  "score": 2,
                  "body": "![img](emote|t5_2th52|4258)",
                  "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l91u77u/",
                  "created": 1718654742,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8yjz17",
      "score": 7,
      "body": "Elmo will push some bs to shore up worse than expected Q2 earnings.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yjz17/",
      "created": 1718599926,
      "depth": 0,
      "replies": [
        {
          "id": "l8yk3kd",
          "score": 2,
          "body": "He will; the hope is that investors see through it",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yk3kd/",
          "created": 1718600002,
          "depth": 1,
          "replies": [
            {
              "id": "l8yraba",
              "score": 8,
              "body": "They won’t.",
              "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yraba/",
              "created": 1718604556,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l920f7t",
      "score": 3,
      "body": "I was shorting it but had to get out. Loss was too big. I haven’t given up but may need to wait.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l920f7t/",
      "created": 1718656826,
      "depth": 0,
      "replies": [
        {
          "id": "l93ykme",
          "score": 1,
          "body": "too early",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l93ykme/",
          "created": 1718684907,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l92howz",
      "score": 3,
      "body": "I shorted Tesla before. Hint hint - it didn’t go well",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l92howz/",
      "created": 1718662967,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8yn4g2",
      "score": 8,
      "body": "Had puts for 180 before the stock rocketed to 190$ , but kept cool as it’s just a part of routine and likewise it fell to normal level just a day later. Probably will fall to 170$ this week. People voted for him hoping stock will go up , then got hit with the dilution news.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yn4g2/",
      "created": 1718601859,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8zx854",
      "score": 2,
      "body": "A Redditor shorting TSLA...\n\n\nhttps://media.tenor.com/2zEJyyQy3GEAAAAe/daring-today-are-we-spongebob.png",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8zx854/",
      "created": 1718630835,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l90rq2p",
      "score": 2,
      "body": "Buying options with expiry immediately after an ESTIMATED earnings report date. This is the WSB I know and love 😂",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l90rq2p/",
      "created": 1718641869,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l91tmrx",
      "score": 2,
      "body": "Why get them expiring so soon if you're going to use 10% of your portfolio? I usually buy and trade weeks out. You'll be fighting IV crush.\n\nI hope you're right, I just straddle TSLA ATM. I sold the calls but I'm holding onto puts out at 8/16. I dream of making both sides profitable.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l91tmrx/",
      "created": 1718654552,
      "depth": 0,
      "replies": [
        {
          "id": "l934bxx",
          "score": 1,
          "body": "IV is less just before production and deliveries report date than just before earnings report date for Tesla; volatility will be elevated but it will not be at a local maximum. Buying before that increases risk exposure to speculation, theta, and random news/events. I will be holding through an IV crush but since I am expecting a big move I don't really care to much; hopefully I will be in the money. I'm not rich; 10% is \\~1kish here (separate from emergency funds/savings/retirement).",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l934bxx/",
          "created": 1718671942,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l92b7sy",
      "score": 2,
      "body": "I believe Tesla was quiet with big announcements because they were waiting for the vote results. Now that Elon has gotten what he wanted, they can pump the stock again. I wouldn't bet against it.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l92b7sy/",
      "created": 1718660550,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbah4uo",
      "score": 2,
      "body": "How’s that going?",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/lbah4uo/",
      "created": 1719931425,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8yrrw7",
      "score": 5,
      "body": "Dude I'm was listening until you got to autonomy.\n\nTesla is eons, theyre Elons ahead. \n\nFSD is legit. Fucken Suck (my) Dick",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yrrw7/",
      "created": 1718604886,
      "depth": 0,
      "replies": [
        {
          "id": "l8ysqya",
          "score": 5,
          "body": "https://preview.redd.it/9xkiomtms27d1.jpeg?width=619&format=pjpg&auto=webp&s=f60c2eba1ed8d2d02da0eacf7603a6a33688270b",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8ysqya/",
          "created": 1718605551,
          "depth": 1,
          "replies": [
            {
              "id": "l8yssxa",
              "score": 0,
              "body": "Dude I'm fucken stiff.",
              "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yssxa/",
              "created": 1718605589,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l920871",
      "score": 4,
      "body": "TSLA investors are too detached from reality. They ignore all fundamentals and instead focus on the long-term potential of FSD and robots. TSLA could lose money for several quarters in a row and the stock will barely move.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l920871/",
      "created": 1718656760,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8za904",
      "score": 2,
      "body": "A lot of what you wrote is probably priced in. Let's see how Q2 earnings go.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8za904/",
      "created": 1718618509,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l91zuhh",
      "score": 2,
      "body": "It’s your financial ruin, go for it",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l91zuhh/",
      "created": 1718656635,
      "depth": 0,
      "replies": [
        {
          "id": "l9319yv",
          "score": 1,
          "body": "I'm poor so it wouldn't be much even if I went all in haha",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l9319yv/",
          "created": 1718670708,
          "depth": 1,
          "replies": [
            {
              "id": "l935pg5",
              "score": 1,
              "body": "Title says short. If you short your potential for loss is infinite.",
              "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l935pg5/",
              "created": 1718672487,
              "depth": 2,
              "replies": [
                {
                  "id": "l93676k",
                  "score": 1,
                  "body": "If I buy puts my potential for loss is the cost of the puts since they would expire worthless",
                  "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l93676k/",
                  "created": 1718672686,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l8zvl1a",
      "score": 2,
      "body": "Shorting Telsa is a headache!!",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8zvl1a/",
      "created": 1718630139,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8yuzqs",
      "score": 2,
      "body": "Have you tried mb/bmw/gm “fsd”? They’re jokes, not even close to what Tesla can do.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yuzqs/",
      "created": 1718607114,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8yewa0",
      "score": 0,
      "body": "shorting the bottom like a regarded regard",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yewa0/",
      "created": 1718597020,
      "depth": 0,
      "replies": [
        {
          "id": "l8ynd6i",
          "score": 4,
          "body": "Why do you think its The bottom",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8ynd6i/",
          "created": 1718602013,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l8yg05x",
          "score": 1,
          "body": "Trading with triangles seems to be a losing proposition. I'm price agnostic",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yg05x/",
          "created": 1718597636,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8zn4bq",
      "score": 1,
      "body": "Bookmarking",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8zn4bq/",
      "created": 1718626207,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9238nb",
      "score": 1,
      "body": "I have a bit of TSDD. No expiration date and compounding growth if tesla falls hard.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l9238nb/",
      "created": 1718657760,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l92ursy",
      "score": 1,
      "body": "Why do you want to buy on 1 July? I got burnt today but will get puts when price stops to rise. If I manage.\nI’m also considering an August call bear spread.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l92ursy/",
      "created": 1718668074,
      "depth": 0,
      "replies": [
        {
          "id": "l9321bb",
          "score": 2,
          "body": "Tesla normally issues a production and deliveries + earning report date on the second of July. Earnings report date is still an estimate, but that is the day it should be released (third Wednesday of July).",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l9321bb/",
          "created": 1718671016,
          "depth": 1,
          "replies": [
            {
              "id": "l9398jf",
              "score": 1,
              "body": "I got the earnings report date but was wondering about the date of buying the put. I understood you intend to buy on 1 July rather than in the comings days.",
              "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l9398jf/",
              "created": 1718673898,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l93498i",
      "score": 1,
      "body": "Did you do your plan?",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l93498i/",
      "created": 1718671912,
      "depth": 0,
      "replies": [
        {
          "id": "l934dkt",
          "score": 0,
          "body": "not time yet",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l934dkt/",
          "created": 1718671959,
          "depth": 1,
          "replies": [
            {
              "id": "l934ke8",
              "score": 0,
              "body": "lame",
              "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l934ke8/",
              "created": 1718672036,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lab3ds9",
      "score": 1,
      "body": "what about their solar business?",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/lab3ds9/",
      "created": 1719370151,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb6cxo8",
      "score": 1,
      "body": "you in?",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/lb6cxo8/",
      "created": 1719863378,
      "depth": 0,
      "replies": [
        {
          "id": "lcjdb98",
          "score": 1,
          "body": "2AUG24 puts for 175 and 150 strikes. Won't lose too much but what I did buy is worthless now. There is a chance  things could turn around but it is doubtful.",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/lcjdb98/",
          "created": 1720630988,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbcxpt4",
      "score": 1,
      "body": "I will never short Tesla again … any other company who had a earning like q1 would be destroyed",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/lbcxpt4/",
      "created": 1719960687,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbq9dfk",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/lbq9dfk/",
      "created": 1720178985,
      "depth": 0,
      "replies": [
        {
          "id": "lcjcvn8",
          "score": 2,
          "body": "Is not working out haha. went with 2aug24 puts; still time for things to turn around but it is unlikely at this point. Won't lose too much.",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/lcjcvn8/",
          "created": 1720630849,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcjaaps",
      "score": 1,
      "body": "Regard.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/lcjaaps/",
      "created": 1720630045,
      "depth": 0,
      "replies": [
        {
          "id": "lcjcmws",
          "score": 1,
          "body": "Yep; bought 2AUG24 puts didn't go all in on this thank god. Hopefully things turn around but I doubt they will.",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/lcjcmws/",
          "created": 1720630773,
          "depth": 1,
          "replies": [
            {
              "id": "lcjdxow",
              "score": 1,
              "body": "I sold a covered call, and sold off 4 of my deep itm calls. Left like 8k on the table so hoping it turns around. Usually drops a bit after these massive runs. 8/8 will probably be anticlimactic and lead to a sell off once the hype dies and people realize fsd is like 2 years away at least and we are at a 90ish PE.\n\nI think you’re good.",
              "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/lcjdxow/",
              "created": 1720631189,
              "depth": 2,
              "replies": []
            },
            {
              "id": "leug8na",
              "score": 1,
              "body": "👏👏👏",
              "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/leug8na/",
              "created": 1721899651,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lekzd0u",
      "score": 1,
      "body": "This aged well",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/lekzd0u/",
      "created": 1721758810,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l91167h",
      "score": 1,
      "body": "Something smells funny at Tesla.\n\n\nTime will expose the truth. \n\n\nTick tock...",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l91167h/",
      "created": 1718645028,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8yr9sd",
      "score": 0,
      "body": "TSLA will hit at least $100 by the end of the year maybe less.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yr9sd/",
      "created": 1718604546,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8zjpp6",
      "score": 1,
      "body": "This is the way",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8zjpp6/",
      "created": 1718624430,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8ztahl",
      "score": 1,
      "body": "i totally agree but the problem is you’re using logic.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8ztahl/",
      "created": 1718629136,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l8yiloo",
      "score": -2,
      "body": "Tesla has been through a lot of BS recently. Be it RoboTaxis, AI-driven self-driving, $25K car, and so on. The fact is all these are money pits.\n\nAnd the worst of it all - Cathy endorsed Tesla. That kiss of death on its own will tank Tesla.",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yiloo/",
      "created": 1718599119,
      "depth": 0,
      "replies": [
        {
          "id": "l8yjohc",
          "score": 3,
          "body": "I don't think it will go bankrupt but I do think it will be priced in line with other auto manufactures within a few years",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yjohc/",
          "created": 1718599751,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l8yckv2",
      "score": 0,
      "body": "Should have posted the post,\nAfter buying the securities",
      "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yckv2/",
      "created": 1718595766,
      "depth": 0,
      "replies": [
        {
          "id": "l8yd425",
          "score": 2,
          "body": "doubt enough people will see this to have any effect",
          "permalink": "/r/wallstreetbets/comments/1dhou8r/plan_to_short_tsla/l8yd425/",
          "created": 1718596050,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}