{
  "title": "What you think about Nike stock?",
  "score": 19,
  "selftext": "I have a general biased view towards Nike. A few things below makes me think the stock price might suffer over the next 2-3 years.\n\n1. The competition (On, Hoka, Lulu, etc) are taking market shares like it's free pizza.\n\n2.They over indexed on their own online sales vs wholesale. And made some of the relationships with key retail partners weird. Seeing news articles about big box sports retailer criticizing Nikes approach over the past 1-2 years. Even tho Nike is trying to fix that now, but it doesn't seem that's going to increase revenue much in the  short/mid term.\n\n3. Lack of innovation is probably the biggest problem. The most recent Pegasus 41 release seems to be a disappointment to some.\n\nThe brand is still selling a fuk ton of stuff. But I'm seeing an incoming decline of their business and sales over the next few years. However, based on their recent layoff news, I am speculating there will be a share buyback around the earnings call which might push the price up a bit. Curious if any of you have any thoughts and advice on Nike stock. Buy or short this stock? ",
  "link_flair_text": "Company Discussion",
  "id": "1di5f9z",
  "num_comments": 87,
  "created_utc": 1718649488,
  "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/",
  "comments": [
    {
      "id": "l92h6dz",
      "score": 37,
      "body": "No AI shoes! Puts!",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l92h6dz/",
      "created": 1718662770,
      "depth": 0,
      "replies": [
        {
          "id": "l95vskg",
          "score": 2,
          "body": "Good luck with AI, they can’t even get that Marty Mcfly self lacing sneaker made on time and properly. They only had what? 30 years to do it.",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l95vskg/",
          "created": 1718722821,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l92lp9a",
          "score": 2,
          "body": "That RTFKT stuff...they dished out 2B for it....what's the ROI?? Lol",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l92lp9a/",
          "created": 1718664509,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l927u7t",
      "score": 39,
      "body": "I own Nike.  I’m not convinced the on running and hoka’s of this world are any different than under armour several years ago.  Nike still owns the basketball shoe segment, has a great roster of classic shoes to re-release, has a great diverse assortment of products, and overall is still a great brand \n\nI don’t expect it to rocket ship but i look at it as buying a great brand at a good valuation.  That will pay off in the long run.  Do your own research though",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l927u7t/",
      "created": 1718659344,
      "depth": 0,
      "replies": [
        {
          "id": "l957kkd",
          "score": 7,
          "body": "NKE brand has consistently been losing marketshare and brand interest for years now. Not massively, but competitors are definitely chipping away at their dominance. Also, Under Armor never had a HOKA or ON-like moment. \n\nThis is from the most recent Piper Sandler survey:\n\n* Nike remains the No. 1 favorite footwear brand, but mindshare decreased 190 bps Y/Y and 230 bps from fall 2023.\n* New Balance gained the most footwear mindshare Y/Y, while Converse lost the most footwear mindshare Y/Y.\n* Among upper-income teens, HOKA remained the No. 3 athletic footwear brand, increasing mindshare by 280 bps Y/Y, and On Running remained the No. 5 athletic footwear brand, increasing mindshare by 120 bps Y/Y. Nike lost 510 bps of mindshare Y/Y in athletic footwear among upper-income teens\n\nI would be putting new money into DECK, CROX, SKX, ON, and even BIRK. \n\nI have about 100 pairs of Jordans in my collection but haven't bought a new pair in 7-8 years now. The last pair of Nikes I bought was AM90's at 60% off (to use at the gym).",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l957kkd/",
          "created": 1718713435,
          "depth": 1,
          "replies": [
            {
              "id": "l97046j",
              "score": 3,
              "body": "You have ascended beyond shoe game intro shoe season.",
              "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l97046j/",
              "created": 1718736199,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l950m9x",
          "score": 5,
          "body": "I’ve owned Nike for years and I would agree — it’s a solid stock, very stable and probably my strongest performing one.",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l950m9x/",
          "created": 1718709998,
          "depth": 1,
          "replies": [
            {
              "id": "l95wf9u",
              "score": -4,
              "body": "If Nike is one of ur best stock, then I feel sorry for your portfolio. Time to move into tech, semiconductors",
              "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l95wf9u/",
              "created": 1718723036,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l95wax1",
          "score": 1,
          "body": "Great nostalgia brand sure. I would buy the classic Jordan’s and air max. But now the Jordan’s are all either trash Color’s heading straight to the outlets or over produced $300 Jordans. Who is buying those consistently to sustain Nike? Look how often they are releasing classic Jordan’s and Jordan 1 no want wants anymore. They killed it. Maybe move on to Kobe’s that’s all they have left.",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l95wax1/",
          "created": 1718722994,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lapa0e4",
          "score": 1,
          "body": "Hopefully you didn’t get wrecked in stocks ",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/lapa0e4/",
          "created": 1719592438,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lqrp9iy",
          "score": 1,
          "body": "They're down 10% in 5 years.  How long run?",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/lqrp9iy/",
          "created": 1728305276,
          "depth": 1,
          "replies": [
            {
              "id": "lqs9uyo",
              "score": 1,
              "body": "That’s why I didn’t own them five years ago haha",
              "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/lqs9uyo/",
              "created": 1728312851,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l92j55u",
      "score": 9,
      "body": "Deckers is eating their lunch. DECK",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l92j55u/",
      "created": 1718663525,
      "depth": 0,
      "replies": [
        {
          "id": "l92qh88",
          "score": 3,
          "body": "Big time!",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l92qh88/",
          "created": 1718666369,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l95vwkm",
          "score": 1,
          "body": "On cloud, adidas, anybody is killing them, it’s almost not cool to wear Nikes.",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l95vwkm/",
          "created": 1718722858,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l92jbgu",
      "score": 9,
      "body": "i steer clear of stocks whos underlying business has zero stickiness other than consumer preference.  Mainly i just don't understand the business.",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l92jbgu/",
      "created": 1718663593,
      "depth": 0,
      "replies": [
        {
          "id": "l94pyke",
          "score": 2,
          "body": "I agree. With apparel you need to not just know the business but also know the customers and potential customers.  With apparel and footwear it's so hard to tell what will be trendy and what will be \"grandpa's shoes.\" It gets even harder with Basketball because so much of the sport's growth has been overseas in markets like China, so to know their growth prospects you need to know the Chinese sports consumer too.",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l94pyke/",
          "created": 1718703272,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l92un2v",
      "score": 9,
      "body": "I haven’t been impressed with any of their sports or athletic wear for about a decade or more. I own Nike products, but right now athletic wear has so many brands and smaller companies that make more custom wear I don’t see why I would buy Nike products ever.\n\n\nNike is the McDonalds of athletic wear; consistent average quality with little to no change for the foreseeable future except higher prices that aren’t justified",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l92un2v/",
      "created": 1718668022,
      "depth": 0,
      "replies": [
        {
          "id": "l990y4z",
          "score": 1,
          "body": "Agreed. Seems like the kids these days don't hold Jordan's in high esteem anymore and as far as athletic clothes go, there are a million other brands out now especially with the fitness influencer craze. I never liked the look or fit of Nike shit anyway.",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l990y4z/",
          "created": 1718763151,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l91p3mc",
      "score": 17,
      "body": "May be more downside in the near term, but if you can stomach the volatility, I think the current price Nike is trading at will look extremely cheap in 5-10 years. Don’t underestimate strong brand value.",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l91p3mc/",
      "created": 1718653044,
      "depth": 0,
      "replies": [
        {
          "id": "l94sb2o",
          "score": -3,
          "body": "What strong brand? Nike is litterary a big nothingburger and has been for years. Their shoes aren't higher quality, they got no unique moat, and tbh neither sneakerheads nor sport jocks nor casuals seems to care. No one pays more for Nike...",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l94sb2o/",
          "created": 1718704933,
          "depth": 1,
          "replies": [
            {
              "id": "l95v2bn",
              "score": 15,
              "body": "The Nike swoosh is one of the most powerful brands in the world, and they continuously sign the world’s most elite athletes. Plenty of people are still willing to pay up for the Nike brand and that ain’t changing anytime soon.",
              "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l95v2bn/",
              "created": 1718722577,
              "depth": 2,
              "replies": [
                {
                  "id": "l95wn2k",
                  "score": -2,
                  "body": "Strong brand don’t mean strong stock prices.",
                  "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l95wn2k/",
                  "created": 1718723110,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l92mg9o",
      "score": 4,
      "body": "am a current bag holder. was a big shoe collector but that has pretty much stopped lately. jordans and air maxes are cyclical in popularity, and they arent that popular now. too many models and colors that no one is buying. nike made it too difficult to buy the stuff that people actually want and people have moved on from the brand. i do expect it to come back someday, but not soon.\n\noh, and china weakness is what everyone says",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l92mg9o/",
      "created": 1718664799,
      "depth": 0,
      "replies": [
        {
          "id": "l92rc4o",
          "score": 4,
          "body": "What are people buying these days for sneakers ? \n\nI still see almost every other person wearing air forces or air maxed across all age groups with adidas Stan smith popular too. \n\nI don’t own any stock as I only invest in tech but curious. Maybe it’s time to upgrade and try some new brands (Hoka/On shoes are just ugly and if want runners I buy ultra boost).",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l92rc4o/",
          "created": 1718666704,
          "depth": 1,
          "replies": [
            {
              "id": "l92sap1",
              "score": 6,
              "body": "my unofficial survey from disneyland last week says hokas, ascics, and new balance are on trend now. still tons of nikes but its not the same dominance. lots of adidas too but yeezys are dead so thats a huge chunk of share they lost",
              "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l92sap1/",
              "created": 1718667081,
              "depth": 2,
              "replies": [
                {
                  "id": "l950rjn",
                  "score": 1,
                  "body": "A lot of the age group you would see at Disneyland also didn’t over lap with who you would see in sportswear and pop brand footwear though",
                  "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l950rjn/",
                  "created": 1718710076,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l94g4nz",
              "score": 1,
              "body": "New Balance is taking a meaningful bite out of Nike now and has more momentum than you would’ve expected just 2 years ago. They’ve made some smart moves and look well prepared to be more than another challenger brand.\n\nThe success of ON is baffling.\n\nAdidas is experiencing a quiet resurgence with retro trainers.",
              "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l94g4nz/",
              "created": 1718695942,
              "depth": 2,
              "replies": [
                {
                  "id": "l990qmb",
                  "score": 2,
                  "body": "> The success of ON is baffling.\n\nThese are all I see in my area. Also in the airport a few weeks ago I swear I saw more ON than anything else. They seemingly came out of nowhere too. I only started seeing them this year and had to ask someone what they were.",
                  "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l990qmb/",
                  "created": 1718763063,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l96nzee",
                  "score": 1,
                  "body": "Having Roger Federer was smart move by ON as his reputation is stellar both on and off the court. \n\nAgree with NB, I like their sneakers and color-ways.",
                  "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l96nzee/",
                  "created": 1718732209,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l970fqo",
              "score": 1,
              "body": "Adidas Samba on the rise the last two years.... making my old ass look hip. I've been wearing them for 2 decades lol.",
              "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l970fqo/",
              "created": 1718736304,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgtat8d",
              "score": 1,
              "body": "In the sneaker world. New Balance, Asics, On, HOKA, nike but more so dunks, birkenstocks, and crocs. Those are your top brands. And the nike dunk model is very in.",
              "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/lgtat8d/",
              "created": 1722969450,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l92tuzr",
      "score": 5,
      "body": "My money and feet are in ONON",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l92tuzr/",
      "created": 1718667709,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l936o4c",
      "score": 6,
      "body": "Isn’t Nike still popular with teenagers? Is that not a moat?",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l936o4c/",
      "created": 1718672867,
      "depth": 0,
      "replies": [
        {
          "id": "l94oo6a",
          "score": 3,
          "body": "Seems to me young people little better at not falling for materialism. Gets me people like LeBron all into activism supporting BLM etc mad at Americas slavery past has no issue with Nike sweat shop labor making him millions. Same with Nike was all into BLM yet make all products overseas by people for pennies a day so can make the biggest profit margins damn hypocrites.",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l94oo6a/",
          "created": 1718702311,
          "depth": 1,
          "replies": [
            {
              "id": "l94q8hc",
              "score": 2,
              "body": "A lot of young people also realize you can wear the Chinese counterfeits and nobody will be able to tell without taking your shoes off and examining them closely.  You also used to have people \"invest\" in rare or trendy shoes because they could go above sticker price.  I feel like that entire investor/scalper market segment has been dying though as young people would rather invest in crypto or tech stocks, and scalpers have been badly burned in recent years.",
              "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l94q8hc/",
              "created": 1718703474,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l91k63r",
      "score": 17,
      "body": "As a consumer I don't buy Nike products. They don't offer anything unique. They have a lot of competitors that offer similar or better products for similar or cheaper prices. That being said, I cannot speak for all consumers habits but my own philosophy is not to be interested in investing in a company if I'm not even interested in their products.",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l91k63r/",
      "created": 1718651368,
      "depth": 0,
      "replies": [
        {
          "id": "l9913q0",
          "score": 1,
          "body": "Same. Never liked their clothes and now that Nike Free RN's are discontinued, I will likely never buy a Nike product ever again.",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l9913q0/",
          "created": 1718763216,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l940vr8",
      "score": 3,
      "body": "I know Nike and Crocs aren’t exactly the same thing, but I feel like foam clogs are drinking their milkshake too. Also, it’s worth mentioning that this country is increasingly out of shape, I could see this being bad for an athletic wear brand over the long term. If you bought CROX at $80 a share like I thought about, but didn’t think it was overpriced like me, grats.",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l940vr8/",
      "created": 1718686175,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l96hf0f",
      "score": 3,
      "body": "Just Do It!",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l96hf0f/",
      "created": 1718730044,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9bcyxk",
      "score": 3,
      "body": "Do yourself a favor and just buy nvda, before you say it's too high and it'll tank soon, I bought at the previous all time high 2 months ago, up almost 50% already. Before that, I bought at the all time high back in 2021, up 600%. The world will be yours. If you are too scared to pile in one company, buy spy or any spx etc. Don't bother looking for the next big thing, you'll just end up losing money (know from experience) in this day and age, the next big thing is already a big ass tech company everyone has already heard of, the world is yours when the world is theirs.",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l9bcyxk/",
      "created": 1718808435,
      "depth": 0,
      "replies": [
        {
          "id": "l9bk8py",
          "score": 1,
          "body": "Make sense. Pretty convincing facts laid out. Just curious tho, what is the main driver behind the bullish run? Is it AI related and they have almost no competition like Microsoft, but in the GPU market?",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l9bk8py/",
          "created": 1718810937,
          "depth": 1,
          "replies": [
            {
              "id": "l9c4etn",
              "score": 2,
              "body": "I believe you are right, and Market has factored all that in. It can keep it's bullish run simply because there are a lot of degenerates right now who want to strike it rich in the stock market, specifically good old fashion options trading (this is not you since you are actually analyzing, and you seem to be more of an investor mindset/long run.) all the longterm, buy and hold investors are thanking the folks at Wallstreetbets, or at least they should as they are responsible for pumping the market thru options trading, basically burning their money earned from meagre jobs (Wendy's most likely). Meanwhile long term investors who don't have time to go gamble in options, are reaping the profits like never before. Thank you to all the degenerate traders and Thank you to all the finance gurus on youtube for pumping this once in a generation bull run. God bless you, and God bless wall street",
              "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l9c4etn/",
              "created": 1718817722,
              "depth": 2,
              "replies": [
                {
                  "id": "l9c664s",
                  "score": 1,
                  "body": "Lol, that actually explains why the market had been so volatile.",
                  "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l9c664s/",
                  "created": 1718818313,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9cem8t",
                      "score": 2,
                      "body": "Just when you think it's too high, it goes up even more due to fomo. Fomo isnt a new thing but it has exponentially increased when social media exploded with all these finance gurus. The gurus don't make money from stocks, but from their views and subscribers and educational courses.",
                      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l9cem8t/",
                      "created": 1718821135,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l92gerf",
      "score": 2,
      "body": "judging by the price action, the market has already decided NKE results will fail to impress.. like you, i have a feeling they will attempt to reinvigorate the stock by announcing some mildly exciting news (buyback, innovation etc) but i don't see it working.. I don't think it will tank, but won't moon either so i have a neutral position on for it to stay within a range.. the kids are still wearing Nike's sweatshop shite, just not so much..",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l92gerf/",
      "created": 1718662480,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l94cggu",
      "score": 2,
      "body": "Just do it?",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l94cggu/",
      "created": 1718693317,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l94f7ku",
      "score": 2,
      "body": "Fast fashion industry is a horrible toxic industry. I will stay away and only focus on luxury industry. At least they carry quality.",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l94f7ku/",
      "created": 1718695265,
      "depth": 0,
      "replies": [
        {
          "id": "l95bpg9",
          "score": 1,
          "body": "Hope you are not invested in LV and Hermes....the recent lux bag stock drop was pretty crazy 😧",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l95bpg9/",
          "created": 1718715269,
          "depth": 1,
          "replies": [
            {
              "id": "l95ch8m",
              "score": 2,
              "body": "Fortunately no. I am skeptical to the fashion industry. They rely on brand loyalty and perception of luxury product... Which may be just an illusion.",
              "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l95ch8m/",
              "created": 1718715587,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l94t8u4",
      "score": 2,
      "body": "Killshots are still the best shoe you can buy imo.  Works with most any outfit.  That’s all I know.",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l94t8u4/",
      "created": 1718705569,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l94xr3f",
      "score": 2,
      "body": "Trash stock, they become a nostalgia company now look at all the air max and air Jordan that they are pushing out and in multiple weird colorways. Their latest basketball shoes all suck and feels cheap unless it’s the rare premium expensive ones. Almost everything they come out with you can find in outlets.",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l94xr3f/",
      "created": 1718708389,
      "depth": 0,
      "replies": [
        {
          "id": "l95crt3",
          "score": 1,
          "body": "Yep...they over flooded the market with crappy weird design and color ways...some comments here mentioned they are jacking up the price without justification...that's a true problem..try to squeeze margins, instead driving people away...",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l95crt3/",
          "created": 1718715711,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l96koam",
      "score": 2,
      "body": "i think it smells funny.  its like the young kids are no longer in love with Nike, or its high price.",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l96koam/",
      "created": 1718731123,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l97xd1r",
      "score": 2,
      "body": "I was up 900% now i’m up 39%, and their products now suck.",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l97xd1r/",
      "created": 1718747337,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9agizj",
      "score": 2,
      "body": "Only boomers buy Nike. Young people want new stuff.",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l9agizj/",
      "created": 1718794092,
      "depth": 0,
      "replies": [
        {
          "id": "laq45my",
          "score": 2,
          "body": "only boomers have money =)",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/laq45my/",
          "created": 1719602613,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9cg5ph",
      "score": 2,
      "body": "why buy a turtle when you can buy an horse?",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l9cg5ph/",
      "created": 1718821653,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9ev2j5",
      "score": 2,
      "body": "Very meh. It's not a necessity to have the Nike brand, and they could fall out of style at the drop of a hat. In fact they are not in style, they're very dorky and make forgettable clothing, it's just brand power. No room for innovation for sure but look at Lulu, they make fucking yoga pants and they're sky rocketing. Just whatever is in season. Maybe Nike needs to make even sexier pants.",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l9ev2j5/",
      "created": 1718854734,
      "depth": 0,
      "replies": [
        {
          "id": "l9fdz3e",
          "score": 1,
          "body": "Lol, this is the way, sexier pants! I agree with pretty much everything you said... It's sad their product pipeline is mediocre at best....time has changed...I wonder how long this brand power will last tho. It's a double edged sword..look at Decker, they were able to penetrate niche markets with the portfolio of brands...Nike sticks with one big swoosh for everybody...",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l9fdz3e/",
          "created": 1718865589,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l91op9x",
      "score": 3,
      "body": "Swoosh for life.",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l91op9x/",
      "created": 1718652911,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l91hch4",
      "score": 2,
      "body": "I'm a bagholder of that /s",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l91hch4/",
      "created": 1718650410,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l92hwkr",
      "score": 3,
      "body": "Its a trap,  I have friends who will never go back to Nike after the kapernick blow up.  For me, I am a heal striker and they just dont make a decent shoe for me to run in.  Plus the last 2 pairs of nike's i owned failed after minimal usage.  \n\nAss a stock it still has a premium to market that no longer seems justified, no longer growing at a pace ahead of the market.  I think it deserves to go lower, not penalty box lower like under armor, but maybe 65 - 70 as a tur around story",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l92hwkr/",
      "created": 1718663049,
      "depth": 0,
      "replies": [
        {
          "id": "l92lxj4",
          "score": 1,
          "body": "Same target range... curious what shoes are you running in now?",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l92lxj4/",
          "created": 1718664597,
          "depth": 1,
          "replies": [
            {
              "id": "l92ndej",
              "score": 3,
              "body": " just got 3 pair of asics and one hoka.....loving all of them",
              "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l92ndej/",
              "created": 1718665156,
              "depth": 2,
              "replies": [
                {
                  "id": "l9421no",
                  "score": 1,
                  "body": "You bought four pairs of shoes at one time ?",
                  "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l9421no/",
                  "created": 1718686846,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l951m8p",
                      "score": 1,
                      "body": "Yes, a big time runner taught me, never wear a pair on back to back days, 2 days off  even better.  It really extends the life  Plus asics had  a deal so I got an extra.",
                      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l951m8p/",
                      "created": 1718710526,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l92q1ee",
              "score": 2,
              "body": "I run in Brooks and do prolonged standing in Hokas or Ons.  Nike still has premium marketing going for them and their quality hasn't slipped, but it isn't getting better.  They run tight and are not particularly comfortable.",
              "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l92q1ee/",
              "created": 1718666198,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lg839l9",
      "score": 1,
      "body": "Nike has 350m followers. Just imagine one hit and it pump",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/lg839l9/",
      "created": 1722643067,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0qqg1",
      "score": 1,
      "body": "It was a decent buy for 75$ I think sale is over",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/li0qqg1/",
      "created": 1723607151,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lqrp6kd",
      "score": 1,
      "body": "What a crappy investment.  Down over 10% in 5 years and down over 22% in the last year.",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/lqrp6kd/",
      "created": 1728305241,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9247re",
      "score": 1,
      "body": "Fuck nike",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l9247re/",
      "created": 1718658084,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l93fhzn",
      "score": 1,
      "body": "Shoes are junk and the competition has better stuff. Nikes best days are behind them IMO",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l93fhzn/",
      "created": 1718676376,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l941w6n",
      "score": 1,
      "body": "besides their ongoing problems with child labor and loss of market share to newer firms and that little misunderstanding with kanye .....",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l941w6n/",
      "created": 1718686757,
      "depth": 0,
      "replies": [
        {
          "id": "l94qj43",
          "score": 3,
          "body": "That was Adidas that had the high profile disaster with Kanye.  Nike is not related to Adidas and if anything benefited from Kanye's line imploding.",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l94qj43/",
          "created": 1718703685,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l95x7go",
      "score": 1,
      "body": "Wokeness has destroyed the stock just as wokeness is destroying the country.",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l95x7go/",
      "created": 1718723304,
      "depth": 0,
      "replies": [
        {
          "id": "l95ygpw",
          "score": 1,
          "body": "That's deep! Mind elaborate a bit?",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l95ygpw/",
          "created": 1718723738,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l93rwj2",
      "score": 0,
      "body": "Junk. Buy GME and AMC or get banned",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l93rwj2/",
      "created": 1718681557,
      "depth": 0,
      "replies": [
        {
          "id": "l940dbb",
          "score": 1,
          "body": "Diamond hand to the moon. I was finally xxxx last week my fellow ape.",
          "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l940dbb/",
          "created": 1718685890,
          "depth": 1,
          "replies": [
            {
              "id": "l9432dk",
              "score": 1,
              "body": "heee. but what shoes you wear while staying broke",
              "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l9432dk/",
              "created": 1718687446,
              "depth": 2,
              "replies": [
                {
                  "id": "l947lto",
                  "score": 1,
                  "body": "Lol...Cole Haan",
                  "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l947lto/",
                  "created": 1718690071,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l92gnt6",
      "score": -1,
      "body": "Not worth it.  Im so happy I sold my shares 4 years ago after noticing decline in quality on their products",
      "permalink": "/r/stocks/comments/1di5f9z/what_you_think_about_nike_stock/l92gnt6/",
      "created": 1718662576,
      "depth": 0,
      "replies": []
    }
  ]
}