{
  "title": "Paramount Global Shares Fall Under $10, A Record Low Since Viacom & CBS Merged",
  "score": 148,
  "selftext": "Share of Paramount Global hit a milestone today, and not a good one.\n\nThe stock price fell below $10 intraday, changing hands at $9.91 just now, down 2% from Friday. It’s never dipped below ten bucks since Viacom and CBS merged in December of 2019, making this an all-time low after David Ellison‘s Skydance packed up and went home.\n\nShares of the combined company have have bounced around, starting at about $35 at the merger (ViacomCBS was subsequently renamed Paramount Global). They were briefly around $10 in the depths of Covid, but were pushing $90 a year later, before a slow decline. It’s the media industry — the streaming wars, linear woes — but also some self-inflicted wounds. Paramount had a chance at different times to sell both Showtime and BET for a nice cash infusion. The shares were above $16 at the height of merger speculation last fall.\n\nAfter discussing a potential transaction for months, Paramount’s controlling shareholder Shari Redstone backed away at the 11th hour last week, leaving the company her father built in a complicated position with high debt, significant exposure to declining linear television, and ongoing streaming losses. She surely had her reasons but it was so messy.\n\nThe company’s three newly appointed CEOs have outlined plans for $500 million in costs cuts, a strategic partnership in streaming and other measures to keep the company chugging ahead.\n\nBut the drama of the last six months has left Wall Streeters frustrated and considering the options.\n\nThere are two other parties (Edgar Bromfman and Steven Paul) interested in buying her family holding National Amusements (which controls Paramount). and other may emerge for a transaction that would be a simple change in control. Redstone could also sell just a part of her NAI holding for some cash to address the holding company’s debt payments. Loans are collateralized in large part by Paramount stock and NAI has had to renegotiate debt covenants several times as the shares slipped.\n\nThe Skydance proposal was two steps, the first being an acquisition of NAI from Redstone, a number that was lowered in revised offers to find cash for Par’s public shareholders. The second step was a merger of Skydance and Paramount. Sticking points included how Paramount would be run during a period of regulatory scrutiny, which it was expected to pass. Another was legal liability since shareholders had threatened to sue Redstone if the deal went through. There may have other considerations.\n\nThe current restrictive regulatory regime has hovered over all aspects of the deal. An offer from Sony and Apollo was considered by many a non-starter due to foreign ownership rules for broadcasters, station caps, and concerns that it wouldn’t be easy to merger two more Hollywood studios. Everyone’s eyeing the polls because it’s though a victor by Donald Trump that could reconfigure the FCC and FTC might shift the landscape and be more forgiving of deals. For now, a trio of CEOs are running Paramount and have anticipated cost cuts, a strategic partnership for Paramount+ and other measures.\n\n[Source](https://deadline.com/2024/06/paramount-global-shares-hit-low-as-skydance-merger-up-in-smoke-1235975782/)\n\n&#x200B;",
  "link_flair_text": "Company News",
  "id": "1di6rze",
  "num_comments": 37,
  "created_utc": 1718652836,
  "permalink": "/r/stocks/comments/1di6rze/paramount_global_shares_fall_under_10_a_record/",
  "comments": [
    {
      "id": "l927444",
      "score": 57,
      "body": "How greed and incompetence eats a company. She doesn’t want to sell the company off for a fair price nor is she capable of appointing a good executive team to run the company. Fucking idiot, making me lose money.",
      "permalink": "/r/stocks/comments/1di6rze/paramount_global_shares_fall_under_10_a_record/l927444/",
      "created": 1718659090,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l91rbbq",
      "score": 108,
      "body": "Nobody feels bad for Shari. She is a totally unqualified moron who inherited the company and has contributed absolutely nothing of value. Gotta wonder what she’s gonna do now that she has fully nuked the stock price.",
      "permalink": "/r/stocks/comments/1di6rze/paramount_global_shares_fall_under_10_a_record/l91rbbq/",
      "created": 1718653780,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l94nlk8",
      "score": 12,
      "body": "The market isn’t dealing with a normal person in Shari. She is Shiv Roy from Succession.\n\nI think she likes the political power of owning CBS News. \n\nWithout ownership, she’s just another slightly wealthy older woman that no one will listen to or take seriously. \n\nIn addition, her ego and the need to prove her father wrong will continue to be damaging to Paramount.\n\nI wish the staff good luck.",
      "permalink": "/r/stocks/comments/1di6rze/paramount_global_shares_fall_under_10_a_record/l94nlk8/",
      "created": 1718701511,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l91pb8r",
      "score": 30,
      "body": "Oof, rough times over at Paramount.  Maybe they should've taken the deal when they had the chance. Could be a buying opportunity here though, gotta do some DD.",
      "permalink": "/r/stocks/comments/1di6rze/paramount_global_shares_fall_under_10_a_record/l91pb8r/",
      "created": 1718653113,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l91pxqu",
      "score": 19,
      "body": "I’ll be curious to see if Paramount might drop out of the S&P500.",
      "permalink": "/r/stocks/comments/1di6rze/paramount_global_shares_fall_under_10_a_record/l91pxqu/",
      "created": 1718653319,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l91qnne",
      "score": 24,
      "body": "Most of the focus on the stock is on whether or not a deal will be made. A lot of investors this year bought in hoping that they can make a quick buy if Paramount gets sold off. Byron Allen offered $21.53 per class B share, The Apollo/Sony Offer was $26 Billion, or about $20 per share after debt is paid off, and the most recent Skydance offer was a $15 per share tender offer on about 50% of the shares. So the stock has hovered between $10 and $15 based on various leaks to the media about offers, negotiations, etc.\n\nWith many offers shot down by Shari Redstone, the most recent one being the Skydance offer, optimism for a deal is at record lows.\n\nWhat also isn't helping is nearly every media outlet is releasing articles implying that the company is on the brink of collapse, even though the company's financials paint a completely different picture.\n\nThere is reason for optimism- Legacy TV, while it is slowly declining(about 1% YoY decline in subscription/affiliate revenue, and a cyclical downturn in advertising), it is still producing over $4.5 Billion in operating income per year, while the company's market cap is just $6.3 Billion. Direct To consumer, despite its tremendous growth, has been a money pit for the past 3 years, which is why the stock has tanked so hard, but is on track to become domestically profitable by 2025.\n\nThe stock isn't going to be the next Nvidia, the next Apple, etc. But it is a deep value play- with the actions they're taking to cut costs, aim for cashflow/profitability, and deleverage, I think the stock can easily double in the next 3 years and triple in 5 years.",
      "permalink": "/r/stocks/comments/1di6rze/paramount_global_shares_fall_under_10_a_record/l91qnne/",
      "created": 1718653559,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l927dhl",
      "score": 4,
      "body": "The other week I made a topic asking if bottom was in then. Seems it was not. Averaged down my previous 13$ position to 11$. Will buy even more if hits 9 and then leave it till whenever it goes back to +15$",
      "permalink": "/r/stocks/comments/1di6rze/paramount_global_shares_fall_under_10_a_record/l927dhl/",
      "created": 1718659181,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l92ga0n",
      "score": 4,
      "body": "This is another example of why tiered/dual class stocks can be a disaster",
      "permalink": "/r/stocks/comments/1di6rze/paramount_global_shares_fall_under_10_a_record/l92ga0n/",
      "created": 1718662430,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l934lgf",
      "score": 5,
      "body": "I’m torn on this one, I refuse to buy falling knives but I love obvious takeover targets ",
      "permalink": "/r/stocks/comments/1di6rze/paramount_global_shares_fall_under_10_a_record/l934lgf/",
      "created": 1718672048,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l94yqam",
      "score": 4,
      "body": "Lollll not me debating getting back in… 🧐",
      "permalink": "/r/stocks/comments/1di6rze/paramount_global_shares_fall_under_10_a_record/l94yqam/",
      "created": 1718708954,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l955vvt",
      "score": 3,
      "body": "Value investors and their sum of the parts cases (\"the IP!\") vs majority shareholder who doesn't give a shit, lousy/overpaid CEO (now 3 co-CEOs - if the company did as bad as it did under one overpaid CEO, how about three?) and a horrible industry = predictable disappointment.",
      "permalink": "/r/stocks/comments/1di6rze/paramount_global_shares_fall_under_10_a_record/l955vvt/",
      "created": 1718712643,
      "depth": 0,
      "replies": [
        {
          "id": "li7ddy6",
          "score": 1,
          "body": "Looks like everyone overlooked Shari Redstone’s sheer will be a choosing beggar trying to save her family fortune and family legacy. \n\nLooks like she’ll get both with this Skydance deal. \n\nI don’t feel to good with this 50% dilution…",
          "permalink": "/r/stocks/comments/1di6rze/paramount_global_shares_fall_under_10_a_record/li7ddy6/",
          "created": 1723706417,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l92mr52",
      "score": 3,
      "body": "Here's how my thinking here has evolved:\n\n22 Feb 2022: coming close to good value, but needs to bring debt down to below 12bio, wait\n\n01 Mar 2023 - 17bio debt, 1bio net income, too much leverage, too much market cap, pass and no further interest. \n\n01 Dec 2023 - redid valuation using analyst sales, NI, div. at this historic low P/S was very close to value a few weeks ago, but has since climbed away - revisit in 6m, \n\n13 Jun 2024 - unprofitable with margins eroded, 20x ev/ebitda, 13x debt to ebitda, pass",
      "permalink": "/r/stocks/comments/1di6rze/paramount_global_shares_fall_under_10_a_record/l92mr52/",
      "created": 1718664914,
      "depth": 0,
      "replies": [
        {
          "id": "li7dl1c",
          "score": 1,
          "body": "2023 was peak investment, of course margins eroded. Overall, the company has improved since 2022. \n\nWhat screwed everything up was Shari Redstone willing to dilute all shareholders 50% in the Skydance merger so she could cash out, pay her NAI debts, and still keep the company intact. \n\nByron Allen’s offer is clearly superior, but Byron Allen has made it clear he would break up the company, which Shari Redstone does not want. \n\nWhat a bitch",
          "permalink": "/r/stocks/comments/1di6rze/paramount_global_shares_fall_under_10_a_record/li7dl1c/",
          "created": 1723706544,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}