{
  "title": "Why buy AMD over NVDA?",
  "score": 27,
  "selftext": "Sup weather boys. I have room IQ (not temperature). so, I was debating whether to buy AMD or NVDA. Then it hit me, what does AMD do thats close to what NVDA is doing? their PE is high asf too. So, just wondering if someone could explain the point of buying AMD over NVDA as I have 2 related parents. thanks :)",
  "link_flair_text": "Discussion",
  "id": "1diwjcs",
  "num_comments": 90,
  "created_utc": 1718732271,
  "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/",
  "comments": [
    {
      "id": "l96o6gb",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 417 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96o6gb/",
      "created": 1718732273,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l96qiky",
      "score": 156,
      "body": "You don’t buy AMD over Nvidia.",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96qiky/",
      "created": 1718733037,
      "depth": 0,
      "replies": [
        {
          "id": "l970939",
          "score": 10,
          "body": "[https://x.com/sfs\\_economics/status/1803131252226269506](https://x.com/sfs_economics/status/1803131252226269506)\n\nFrom 2017 - AMD has been the better call. 2023-2024 NVDA. Why can't it change?",
          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l970939/",
          "created": 1718736243,
          "depth": 1,
          "replies": [
            {
              "id": "l98w7e3",
              "score": 8,
              "body": "That's a dumb ass graph wtf lol. Just start it two years later and you can say since 2019 NVDA has had more gains.",
              "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l98w7e3/",
              "created": 1718761204,
              "depth": 2,
              "replies": [
                {
                  "id": "l995ycj",
                  "score": 0,
                  "body": "The point is timing matters bud. I own both. I’m just saying I’d rather increase my AMD position here. I’d even sell NVDA but I don’t want to pay the taxes yet.",
                  "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l995ycj/",
                  "created": 1718765291,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l992k8s",
              "score": 2,
              "body": "Go ahead and buy AMD. You are about to learn literally the same thing I learned when I tried to have faith in that piece of shit for 5 years. NVIDIA is massively overbought, but I swear the moment NVIDIA pull back, AMD also does. It happens every time. AMD is very sensitive to bad news, lack buying conviction.",
              "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l992k8s/",
              "created": 1718763829,
              "depth": 2,
              "replies": [
                {
                  "id": "l9hvh01",
                  "score": 1,
                  "body": "Funny how things work out.",
                  "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9hvh01/",
                  "created": 1718906310,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9hychx",
                      "score": 1,
                      "body": "My point is not that AMD will pull an Intel. My point is that after holding AMD you will inevitably come to the conclusion that you could have skipped all the hassle and buy NVIDIA in the beginning. Let it run 6 months then you will know.",
                      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9hychx/",
                      "created": 1718907258,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9jomu7",
                          "score": 1,
                          "body": "First buy with NVDA was based on the graphic chips for the Nintendo switch. I’ve owned it forever but recently I’ve noticed how everyone “knows” it. I think the relative outperformance will be on AMD side for years at this point. Nvda had a lot of risk not priced into it.",
                          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9jomu7/",
                          "created": 1718929573,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l9880l3",
              "score": -4,
              "body": "NVIDIA is already too well integrated in software and support, ie CUDA, and owns more manufacturing space than AMD. I'm not exactly familiar with the process but I'd guess it would go something like AMD having to throw tens of billions of dollars to outbid nvidia for tsmc space.",
              "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9880l3/",
              "created": 1718751404,
              "depth": 2,
              "replies": [
                {
                  "id": "l98q4nl",
                  "score": 1,
                  "body": "As well - AMD uses open source which most developers prefer. Think Android vs. Apple, PC vs MAC. Tech companies have already started to look at AI spend. Listen to Marc B on the CRM call for example. Imagine buying a stock with infinite growth priced into it with no competition. What could go wrong?😐",
                  "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l98q4nl/",
                  "created": 1718758705,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l98xgnd",
                      "score": 2,
                      "body": "NVIDIA's software, such as cuda, is integrated almost to a point of no return. Literally every model used by any company smaller than a local startup is relying on cuda functionalities. Companies already don't like to switch frameworks unless there's a VERY good reason - in fact, companies will usually continue working with years old version of software unless they are forced to upgrade to a newer version (*of the same software, let alone a different one all together*).\n\nBut sure, let's assume AMD magically improved zluda to be better than cuda in some way, AND companies decided it's worth switching to it permanently. Even then, AMD simply doesn't have the funds to outbuy chip manufacturing space (Nvidia owns a significant share of 3/4 nm space). The only way AMD can beat out nvidia hardware wise is if 1) a group of companies come together and dump money on AMD to outbid nvidia on space or 2) AMD gets funding to create their own manufacturing plants.\n\nWith that being said, I never said anything about nvidia's *stock* continuously going up forever. Stock is something different and not 1-to-1 correlated to the likelihood that amd is unlikely to ever beat nvidia. Obviously, the stock would peak at some point once it is confirmed that \"infinite\" growth is priced in. However, I fail to see how that makes AMD a buy over some other company.",
                      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l98xgnd/",
                      "created": 1718761710,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l995sss",
                          "score": 2,
                          "body": "I’m an engineer for a large gaming co. Yea, it is integrated well. It isn’t at the point of no return.",
                          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l995sss/",
                          "created": 1718765224,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l998a93",
                              "score": 1,
                              "body": "Let's say amd come up with a solution better than nvidia's. How long, and for how much cost, would you think it would take your company to switch?",
                              "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l998a93/",
                              "created": 1718766323,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l99i6ud",
                                  "score": 1,
                                  "body": "Unlikely the mega Data Centres switch… You’re correct. However, the GPU prices will drop which is a massive risk. That 70% margin cushion will shrink fast. The 90%+ control will shrink. Therefore, the growth story dies like CSCO in 99. I’m not alone in this thesis. That’s the biggest risk. \nIt is a fantastic technology. I am not arguing that.",
                                  "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l99i6ud/",
                                  "created": 1718771235,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l98wnpy",
                  "score": 1,
                  "body": "Cuda is just a language some developers will love and a whole lot will hate it with a bunch of them not caring what they use as long as they get paid.\n\n\nIt’s easy to add extensions in any language so a developer can use what they want too so don’t put much stock in CUDA.",
                  "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l98wnpy/",
                  "created": 1718761387,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l998kbg",
                      "score": 1,
                      "body": "Well, cuda is just an example. There are other software/framework extensively used by the public. cuda is just the most basic one.",
                      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l998kbg/",
                      "created": 1718766450,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l98opag",
                  "score": 1,
                  "body": "Yes but no analyst is basing their projections on the software. It is a small factor… Every assumption has serious growth built in but wait times for the GPUs are down from 1yr to 3months. The price is coming down and that means growth will too. Assuming NVDA holds 90%+ of data centre sales on a going forward basis with no margin compression is some wild expectations. Won’t take much to re-rate this one. It’s lower from here by EOY.",
                  "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l98opag/",
                  "created": 1718758121,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l96vky1",
      "score": 42,
      "body": "AMD is an Intel competitor, and did a good job at it because Intel fucked around with their R&D and didn't make any of their milestones for over a decade. Partly that is due to them being arrogant when they had monopoly power.\n\nMost of Nvidia's profit comes from data center/AI cards. AMD really isn't a competitor on that front. Maybe in 5-10 years when they have a good solution and Nvidia takes their foot off the gas, but I don't see that happening.",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96vky1/",
      "created": 1718734694,
      "depth": 0,
      "replies": [
        {
          "id": "l96x41e",
          "score": 18,
          "body": "This. Just because AMD touches their toes in AI a little, and they make GPUs, does not mean they take it as seriously as NVDA has been. To put it into perspective, the whole reason the modern AI boom even happened is because a researcher decided to use write custom CUDA kernels for their deep learning model. But even before that, NVDA has had close ties to the supercomputing and research space. This isn't something where AMD can catch up overnight. As more AI players start popping up, the entrenched ones will soon realize that leasing their existing NVDA stack is a great way to make a quick buck, thus increasing the dependency on NVDA. Viscious cycle, AMD has no entry, even if Geohot manages to fix their dumpster fire of a driver",
          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96x41e/",
          "created": 1718735198,
          "depth": 1,
          "replies": [
            {
              "id": "l96x42x",
              "score": 11,
              "body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
              "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96x42x/",
              "created": 1718735199,
              "depth": 2,
              "replies": [
                {
                  "id": "l96xcjh",
                  "score": 15,
                  "body": "If an AI said it, it means I'm actually regarded",
                  "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96xcjh/",
                  "created": 1718735277,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9ag7jv",
                      "score": 0,
                      "body": "Wow. You’re basically the Stephen Hawking of WSB. Whose tube are you gonna blow to get around?",
                      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9ag7jv/",
                      "created": 1718793893,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l9h67md",
                  "score": 1,
                  "body": "Stop by the Wendy's dumpster stall for your free blow job, any time.",
                  "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9h67md/",
                  "created": 1718898109,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l9704b5",
              "score": 1,
              "body": "Tinygrad and AMD on MLPerf maybe bullish?",
              "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9704b5/",
              "created": 1718736200,
              "depth": 2,
              "replies": [
                {
                  "id": "l9707nw",
                  "score": 1,
                  "body": "Oh sorry missed your last sentence",
                  "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9707nw/",
                  "created": 1718736230,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l99ytnx",
          "score": 3,
          "body": "Actually AMD is both. \n\nMI300X is a directly competing product to Nvidias B100.\nYes, it is probably a bit slower in most use cases, but that was the same with AMD vs Intel... unil it wasn't. \n\nI wouldn't bet on the 10 years there.",
          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l99ytnx/",
          "created": 1718781557,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9agni5",
          "score": 1,
          "body": "AMD is as much of a competitor with Intel as with Nvidia, on both AI and graphics. Also they make arm chips at scale supplying for consoles, which would not be surprising if they came up with their own ARM chip for desktops, something I don’t foresee Intel to be doing. They may have less market share on most fronts but they do have a foot in the door.",
          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9agni5/",
          "created": 1718794168,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l97qnj4",
      "score": 11,
      "body": "I worried about this in late 2022 and never bought either. Big fucking mistake. So just BUY BOTH. And don’t worry about it",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l97qnj4/",
      "created": 1718744972,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l96wri6",
      "score": 12,
      "body": "So short amd got it",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96wri6/",
      "created": 1718735084,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9865yy",
      "score": 4,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9865yy/",
      "created": 1718750681,
      "depth": 0,
      "replies": [
        {
          "id": "l9a9be6",
          "score": 1,
          "body": "I have it and can’t decide when to pull out",
          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9a9be6/",
          "created": 1718789185,
          "depth": 1,
          "replies": [
            {
              "id": "l9by3nl",
              "score": 1,
              "body": "Just do 10% at a time or something, can't go far wrong that way",
              "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9by3nl/",
              "created": 1718815617,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l96rr00",
      "score": 15,
      "body": "don't compete in necessarily the same markets ie) NVDA does not produce cpu's.. there is some overlap naturally, but AMD can erode NVDA's market share position over time, the same way they did to Intel over the past decade. Customers increasingly want competition in the market & AMD will offer alternatives on-par in performance & likely cheaper. AMD will never become the market leader probably, but NVDA currently owns 92% of the market from what I have read. AMD has 3%. AMD has much more to gain & NVDA much more to lose. probably more upside to AMD than NVDA at this point at time as well, considering the run NVDA has been on. In truth, they are both going to be winners, but NVDA seems more of like a short term play given its current position whereas AMD seems more like a 1-3 year play.",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96rr00/",
      "created": 1718733438,
      "depth": 0,
      "replies": [
        {
          "id": "l96sgpl",
          "score": 7,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96sgpl/",
          "created": 1718733668,
          "depth": 1,
          "replies": [
            {
              "id": "l96up02",
              "score": 1,
              "body": "based off of ARM's IP however, point is still valid though. I just don't foresee NVDA gaining any steam in the cpu space as an incumbent -- either need to provide superior value (which NVDA charges premium prices so that is unlikely) or superior product (which I also find unlikely, AMD has been in the space for decades). NVDA's cpu's are aimed to be purely professional as well, whereas AMD and Intel are more of a mix on consumer/industrial.",
              "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96up02/",
              "created": 1718734404,
              "depth": 2,
              "replies": [
                {
                  "id": "l96v65h",
                  "score": -2,
                  "body": "[deleted]",
                  "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96v65h/",
                  "created": 1718734559,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l96vq62",
                      "score": 0,
                      "body": "im saying your point is valid, they are producing cpus, that is a correct statement.",
                      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96vq62/",
                      "created": 1718734743,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l97dyy6",
          "score": 0,
          "body": "AMD has a crazy P/E compared to NVDA though",
          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l97dyy6/",
          "created": 1718740787,
          "depth": 1,
          "replies": [
            {
              "id": "l98ibwk",
              "score": 5,
              "body": "AMDs valuation is skewed by an aquisition that didn't actually cost them any cash.\n\nForward PE should show you a more realistic number.",
              "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l98ibwk/",
              "created": 1718755529,
              "depth": 2,
              "replies": [
                {
                  "id": "l9egnn1",
                  "score": 0,
                  "body": "People say this and completely leave out that amd overpaid for Xilinx just like intel admitted they did for altera. Fpgas don’t contribute significantly to their earnings. Imagine paying 50 billion for a measly 3 billion in revenue a year and even less earnings ",
                  "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9egnn1/",
                  "created": 1718848493,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9eh2kk",
                      "score": 2,
                      "body": "Thats an analysis that is up to you to make.\n\n\nDoesnt change that the acquisition skews their pe to the point that it is useless.",
                      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9eh2kk/",
                      "created": 1718848660,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9ehiyb",
                          "score": 0,
                          "body": "Sorry I edited my comment with the actual revenue numbers but paying 50 billion for the earnings they’re getting is objectively not worth it",
                          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9ehiyb/",
                          "created": 1718848843,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l97o217",
              "score": 1,
              "body": "valuation is way out the window on these AI plays. ARM is over twice as expensive as AMD on a p/e basis, and many would argue ARM is the better investment right now over AMD & NVDA.",
              "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l97o217/",
              "created": 1718744111,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9egfea",
          "score": 0,
          "body": "Nvidia does make CPUs and most hyperscalers are using their own custom arm CPUs. Also a large chunk of cpu bandwidth is used for east west server traffic and will be replaced by nvidia’s bluefield dpu ",
          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9egfea/",
          "created": 1718848402,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l98nq05",
      "score": 4,
      "body": "AMD is a longterm hold. But so is NVDA and definitely the play right now. I wouldn't worry about missing out on any AMD momentum unless they break 175-180 and even then they've been known to dump for no reason.",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l98nq05/",
      "created": 1718757716,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l97tpej",
      "score": 3,
      "body": "You shouldn’t buy either in a damn bubble",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l97tpej/",
      "created": 1718746030,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l97kapu",
      "score": 2,
      "body": "Me personally, bullish as fuck on AMD, nvidia, overinflated vaule. AMD isn't the God father of GPUs, nvidia is 100% that, AMD had THE BEST cpus money could buy for YEARS, wasn't until a decade ago amd realized they should make GPUs as well. That is the #1 that's different between those. Once AMD starts to throttle that shit, and not just tap, I mean full throttle, they WILL be close to nvidia. also, keep in mind, meta, amd, intel, Amazon, Microsoft are all linking together to create a new \"link\" to battle nvidias nv link, some food for thought",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l97kapu/",
      "created": 1718742873,
      "depth": 0,
      "replies": [
        {
          "id": "l99z8wx",
          "score": 1,
          "body": "What? AMD bought ATI in 2006. I am sure you can guess why!",
          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l99z8wx/",
          "created": 1718781853,
          "depth": 1,
          "replies": [
            {
              "id": "l9b8fbh",
              "score": 1,
              "body": "I'm talking about pre 98 times, back when desktops, had a 56k modem, to us then, that was wicked fast",
              "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9b8fbh/",
              "created": 1718806815,
              "depth": 2,
              "replies": [
                {
                  "id": "l9b9hze",
                  "score": 2,
                  "body": "I remember those times. Started with Atari and C64.\nBut that's more than a decade ago. Sorry to break it to you, we're both old my friend.",
                  "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9b9hze/",
                  "created": 1718807205,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9bb5zo",
                      "score": 1,
                      "body": "Lame",
                      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9bb5zo/",
                      "created": 1718807801,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l96rg43",
      "score": 6,
      "body": "Nvidia is now the world’s most valuable stock, I’ll take it any day. I had AMD but sold cause it was lagging, and loaded up on FSELX a few months ago for some more NVDA weighting but moderate risk, and now I’m up 20% on the year, I’ll take it",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96rg43/",
      "created": 1718733341,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l977zt0",
      "score": 4,
      "body": "Always buy NVIDIA. You don't know when a great AI application drops that requires cuda cores. And AMD will be left behind always.",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l977zt0/",
      "created": 1718738801,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l96voko",
      "score": 3,
      "body": "Because you hate money, and don’t understand the current state of the AI tech infrastructurez",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96voko/",
      "created": 1718734728,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l975r4d",
      "score": 3,
      "body": "AMD is overvalued. they make like no money , if it was for tax benefits they would be loosing money. This stock will crash soon",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l975r4d/",
      "created": 1718738067,
      "depth": 0,
      "replies": [
        {
          "id": "l9byje1",
          "score": 2,
          "body": "It's the opposite lol, the tax benefits from the acquisition artificially depress earnings. Their EPS is around $3 if you exclude this",
          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9byje1/",
          "created": 1718815766,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lp142br",
          "score": 1,
          "body": "Yeah- regarded statement that did not age well. AMD will double in the next 5 years.",
          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/lp142br/",
          "created": 1727363284,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l97wd27",
      "score": 2,
      "body": "Go all in NVDA don’t be stupid..",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l97wd27/",
      "created": 1718746980,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l970u3y",
      "score": 2,
      "body": "I don’t recommend buying NVIDIA. It’s a big bubble. Buy APPL instead.",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l970u3y/",
      "created": 1718736435,
      "depth": 0,
      "replies": [
        {
          "id": "l97cjir",
          "score": 7,
          "body": "It's been a bubble for a year now give it a rest",
          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l97cjir/",
          "created": 1718740318,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l96ubwo",
      "score": 3,
      "body": "AMD is the new INTC.",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96ubwo/",
      "created": 1718734285,
      "depth": 0,
      "replies": [
        {
          "id": "l96wdb6",
          "score": 4,
          "body": "Intel goes for chip foundry, id buy intc over AMD any time at that price",
          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96wdb6/",
          "created": 1718734955,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l96wbq0",
          "score": 2,
          "body": "Or INTC is the new Nvidia if you have a time horizon of a couple of years. My bet is that they will be able to produce a higher quantity of next gen AI chips. Maybe not beat Nvidia, but for the potential growth, I'm picking INTC.",
          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96wbq0/",
          "created": 1718734941,
          "depth": 1,
          "replies": [
            {
              "id": "l9749av",
              "score": 1,
              "body": "Maybe, but they are too slow. You lose money now if you keep Intel.",
              "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9749av/",
              "created": 1718737564,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l97eip4",
              "score": -2,
              "body": "Lol what?\n\nOne designs chips and one is focusing on fabbing chips...",
              "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l97eip4/",
              "created": 1718740966,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l973ded",
      "score": 1,
      "body": "i like amd as a play on efficient compute which they seem to be pretty good at on the processor side not sure about gpus\n\ni honestly thought they might be able to give nvda a run for their money on a lower end more efficient not as powerful product, but thats not proving to be the case in their financials",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l973ded/",
      "created": 1718737266,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l97m7ow",
      "score": 1,
      "body": "Prob would go micron over amd myself but not over nvidia.",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l97m7ow/",
      "created": 1718743513,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l987ien",
      "score": 1,
      "body": "You always buy the número uno in a sector",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l987ien/",
      "created": 1718751208,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98e7cf",
      "score": 1,
      "body": "Literally no reason. None. But NVDA and don’t make the same mistake so many have already made.\n\nHope this helps",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l98e7cf/",
      "created": 1718753860,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98twft",
      "score": 1,
      "body": "At this point, NVDA is the King and AMD is a desperate Knight trying to get his own kingdom.  I have a little on the Knight but no way they are dethroning NVDA GPUs anytime soon.",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l98twft/",
      "created": 1718760268,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l99pqnc",
      "score": 1,
      "body": "You’re poor and not making smart decisions.",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l99pqnc/",
      "created": 1718775611,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9a30lm",
      "score": 1,
      "body": "Difficult to find a reason. Best way is to buy the SMH ETF. You'll get exposure to both (with the rest of the sector) and you'll catch up on the AMD gains over NVDA decline, if that happens.\n\nI invested in 2021 in SMH, which has given me great returns, not as great as NVDA of course. Then at the start of this year I invested a little bit in NVDA, which helped me catch up with the run up to 1k per share.\nOver the last few weeks I added to both NVDA and SMH, so I am currently overweighting NVDA vs the SMH exposure. \n\nThere are plenty of names that are worth watching in the semi sector, not just AMD. As a long term investor, I try to be satisfied with good consistent returns over the urge of picking the next winner.",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9a30lm/",
      "created": 1718784566,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9afuv1",
      "score": 1,
      "body": "AMD has consistently lost me money over the last month. NVDA has definitely not. I even loaded up after the split. All green. \n\nI was just logging in here to see if I could find some DD on AMD’s losses and whether I need to dump them.",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l9afuv1/",
      "created": 1718793673,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l96u97p",
      "score": 1,
      "body": "Just buy nvidia. AMD is never going to go anywhere, even if they do make more money, the stock won't actually go up. It'll just stay at the same range and sell off\n\nNvidia could show slow and growth and massive inventory and still go up 20% in a week.",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96u97p/",
      "created": 1718734261,
      "depth": 0,
      "replies": [
        {
          "id": "l97e2uu",
          "score": 7,
          "body": "AMD has exploded since I started trading it in 2016, you must be new as fuck if you think it won't go anywhere",
          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l97e2uu/",
          "created": 1718740822,
          "depth": 1,
          "replies": [
            {
              "id": "l97nfog",
              "score": 7,
              "body": "I bought tons of AMD at around $3 a few years back.  Made more off that than Nvidia so far..\n\nMy issue with Nvidia is simple - it doesn’t make enough to warrant its current valuation, and anyone who says it does is an absolute idiot.  It’s over speculated… but that doesn’t mean it can’t go higher.. look at how Tesla performed…",
              "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l97nfog/",
              "created": 1718743908,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l96y1xp",
      "score": 1,
      "body": "If you aren’t sure just buy SOXX leaps",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l96y1xp/",
      "created": 1718735517,
      "depth": 0,
      "replies": [
        {
          "id": "l97eewb",
          "score": 1,
          "body": "Whats the advantage of doing this over just buying SOXL? More risk/reward?",
          "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l97eewb/",
          "created": 1718740931,
          "depth": 1,
          "replies": [
            {
              "id": "l97f7m4",
              "score": 1,
              "body": "I think 3x etfs have some tracking error risk where if it goes down sharply then back up you can lose value due to the leverage.\nBut right now you can get a January 2026 $265 leap for $32.8, so you get 26k worth of stock delta for $3280 in exposure, which is a better leverage ratio anyways",
              "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l97f7m4/",
              "created": 1718741198,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l97dhu6",
      "score": 1,
      "body": "Got enough gains in AMD to hold until it levels up again. Bought four years ago",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l97dhu6/",
      "created": 1718740630,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l974aae",
      "score": 0,
      "body": "AMD makes GPUs but they don't run CUDA so, not same thing.",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l974aae/",
      "created": 1718737574,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l971lay",
      "score": -1,
      "body": "Why buy both over ARM?",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l971lay/",
      "created": 1718736684,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l980aq1",
      "score": -2,
      "body": "yeah dont man, bought amd and all it did was go down. sold everything and went all in nvda and now making some money",
      "permalink": "/r/wallstreetbets/comments/1diwjcs/why_buy_amd_over_nvda/l980aq1/",
      "created": 1718748414,
      "depth": 0,
      "replies": []
    }
  ]
}