{
  "title": "Am I crazy or is $PARA a screaming buy??",
  "score": 78,
  "selftext": "Ok... $PARA is tanking after the Skydance acquisition deal fell through. The company's market cap is below $7 Billion. The PB ratio is 0.29.\n\nThis is a company that did $29 billion in revenue last year. The Paramount+ streaming service is the least profitable part of the company, and the leadership already admitted that they're looking to do a JV with another streamer to reduce their costs and churn.\n\nThey still have an extremely valuable IP library (the godfather, terminator, mission impossible, star trek, top gun, ninja turtles, spongebob), linear tv channels that throw off a lot of cash with NFL rights for eight more years, one of the top/ growing free streaming tv services in pluto tv, international tv networks that are less susceptible to cord cutting, and prime real estate in LA that's worth billions on its own.\n\nYes, the leadership is a mess right now, and it's a wildcard moving forward. Meanwhile the analyst class could not be more bearish on it, and it's the butt of all kinds of jokes in the hollywood trade media.\n\nBut, man, this company is undervalued. It's worth a lot more than its current $6.75B market cap. Period.\n\nAt a low valuation of 1x revenue it has almost 3x upside to the current stock price. It may not get there, but Apollo put in an acquisition bid at 26 billion, so it's not like some crazy pipe dream.\n\nThoughts???",
  "link_flair_text": "Discussion",
  "id": "1diwt78",
  "num_comments": 93,
  "created_utc": 1718732968,
  "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/",
  "comments": [
    {
      "id": "l96qblf",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 10 months ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l96qblf/",
      "created": 1718732975,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l96sasq",
      "score": 106,
      "body": "All the things you said are true but Shari Redstone is still in charge. I’ve thought about buying several times recently. So far glad I didn’t. Haha",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l96sasq/",
      "created": 1718733615,
      "depth": 0,
      "replies": [
        {
          "id": "l974zq1",
          "score": 26,
          "body": "She's in charge in terms of voting power, but at least she appoints people who know what they're doing to handle the day to day, instead of appointing herself as CEO.\n\nThe most important thing to me is she is no longer mandating that the CEO focus on growing Paramount+ at all costs. That was what was sinking the stock.",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l974zq1/",
          "created": 1718737813,
          "depth": 1,
          "replies": [
            {
              "id": "l97f0pd",
              "score": 4,
              "body": "Yeah, I’m not sure she can tank the stock price anymore than she already has, but I also didn’t think it’d be trading as low as it is now…",
              "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97f0pd/",
              "created": 1718741134,
              "depth": 2,
              "replies": [
                {
                  "id": "l97fr91",
                  "score": 6,
                  "body": "I mean, short sellers keep tanking it more and more every day despite a lack of news. Her inaction seems to be enough to tank the stock.",
                  "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97fr91/",
                  "created": 1718741379,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l97r62m",
              "score": -7,
              "body": "Why the fuck would you buy a dying company in a dying market headed by a dying hag who didn't do shit except inherit the thing, when you live in a world where there is literally NVDA, a company *founded* by a Taiwanese GigaChad who's still the CEO 20 years later and who signs his name on tits with an indelible red marker at conventions on microcontroller architecture. Now think about that for a minute...\n\nJesus Christ You must really hate money. \n\nEither that or you too are also a dying 50+ yo boomer.",
              "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97r62m/",
              "created": 1718745148,
              "depth": 2,
              "replies": [
                {
                  "id": "l97tf8k",
                  "score": 25,
                  "body": "One word, price. At the right price, I would rather own Nvidia. But Nvidia is too expensive. You have to keep in mind, stocks are based on supply and demand. Everyone wants to own Nvidia for the reasons you stated, which has the price high. No one wants to own Paramount for the reasons you stated, so the price is very low.\n\nNvidia is estimated to do $2.50 in earnings per share this year. On a $133 valuation, that means it will take more than 50 years for their earnings to cover their share price.\n\nParamount, on the other hand, is also estimated to do $2.50 in earnings per share. But at a less than $10 price, it only takes 4 years to cover their valuation.\n\nAnother reason is I believe Nvidia is a cyclical company, and wall street is not properly accounting for that. Right now, they have an earnings surge because practically every company is rushing to buy up AI hardware, without even having a business plan. Eventually, like every market theme, that hype will dry up, and so will their orders.\n\nThen it's worth considering the economics of AI- at Nvidia's current prices(of AI acclerator chips), AI doesn't even save money or produce any profit. The only reason companies are buying them is because they're afraid of being left behind. For AI to take off, prices have to come down, such that they are economically feasible to deploy at scale. I think this will happen, it does happen with most new technologies, but it will be because of competition. So Nvidia's profit surge will be short lived, they won't enjoy a 78% gross margin for long.\n\nusually, companies this cyclical trade at a P/E of 10 during boom periods. But Nvidia is trading at a P/E of 80. This means if Nvidia's earnings ever stop growing, they will face a crash of epic proportions.",
                  "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97tf8k/",
                  "created": 1718745933,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l983a69",
                      "score": 3,
                      "body": "Wait til NVDA plateaus and theta gang the shit out of it?",
                      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l983a69/",
                      "created": 1718749552,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lboms26",
                          "score": 1,
                          "body": "No leap puts?",
                          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/lboms26/",
                          "created": 1720144144,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l96wv34",
      "score": 42,
      "body": "MAJOR roadblocks:\n\n  \n\\*Shari Redstone is INSANE. Read up on her. Succession is based on her and her Dad although Shiv is competent, Shari is not.\n\n\\*Dual Share Classes.\n\n\\*Deal killed at the finish line with a partner company doesn't instill confidence.\n\n\\*3 CEO's with no power currently.\n\n  \nYes, it's grossly undervalued. That said, the parts are worth far more than the sum and Shari is trying to keep the family \"legacy\" together. She doesn't want to split it up...and this all hinges on an unhinged individual.\n\n  \nI've been for about 3 months and still have almost ZERO faith in her doing anything for common shareholders. She'd rather run it into the ground and Wall Street seems content to kill it and then buy the pieces off the scrap heap after it's dead.\n\n  \nDefinitely a lotto play. \n\n  \n[https://puck.news/shari-redstone-hasnt-solved-her-biggest-problem-shari-redstone/](https://puck.news/shari-redstone-hasnt-solved-her-biggest-problem-shari-redstone/)\n\nhttps://preview.redd.it/n9frvlakhd7d1.png?width=571&format=png&auto=webp&s=1430ab484c9ba5a41754de1cdbf97931be4dc5df",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l96wv34/",
      "created": 1718735116,
      "depth": 0,
      "replies": [
        {
          "id": "l97lyvz",
          "score": 8,
          "body": "Shari Redstone is exhausted and stressed from inheriting National Amusements, and is looking for an exit. She called off Skydance because countless shareholders were threatening to sue her over it, and Skydance wouldn't cover her liability. She faced a lawsuit for the Viacom/CBS merger, and probably doesn't want another. On top of all this, there's the sentimental value of not wanting her father's company to be split up.\n\nWhile it's looking like a direct sale of NAI to Edgar Bronfman or Steven Paul is most likely, I'm still hopeful for the maybe 10% chance that she just gets tired of constant negotiations, and ends up selling to Sony/Apollo, or selling NAI to someone that then goes and splits up the company.",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97lyvz/",
          "created": 1718743432,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9aohtw",
          "score": 4,
          "body": "“although Shiv is competent”\n\nSource needed",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l9aohtw/",
          "created": 1718798463,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9av9ko",
          "score": 4,
          "body": "\"Shiv is competent\" lmao everyone inverse this regards opinion immediately",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l9av9ko/",
          "created": 1718801588,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l96sli9",
      "score": 76,
      "body": "An old hag that has majority voting power while holding 5% of the shares is a recipe for disaster. I'm sure it's a SCREAMING buy though.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l96sli9/",
      "created": 1718733712,
      "depth": 0,
      "replies": [
        {
          "id": "l97gyym",
          "score": 12,
          "body": "Based on how stocks are moving, seems like the majority of people think NVDA is a screaming buy seeing as it just relentlessly keeps climbing. meanwhile PARA is dropping like a fuckin rock. its a screaming sell, lmao",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97gyym/",
          "created": 1718741782,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l96webn",
      "score": 15,
      "body": "I bought some. Even though SR seems like an idiot, at this price point I think risk vs reward makes sense.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l96webn/",
      "created": 1718734965,
      "depth": 0,
      "replies": [
        {
          "id": "l996jnz",
          "score": 1,
          "body": "She could still get it",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l996jnz/",
          "created": 1718765553,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l97bu3p",
      "score": 11,
      "body": "Ha I bought 300 shares today. My theory is Netflix partners with them for the December football games.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97bu3p/",
      "created": 1718740088,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l96sp5l",
      "score": 31,
      "body": "PARA depends on Shari Redstone - she has majority for voting.\n\nShe killed the deal and something is telling me that she has reverse daddy's issues - her daddy never trusted her.\n\nSo I wouldn't be surprised if she will run PARA to bankruptcy. PARA needs a new leadership (how you said) but her reverse daddy's issues will never allow it.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l96sp5l/",
      "created": 1718733747,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l96thni",
      "score": 19,
      "body": "Entertainment industry is currently in a violent slump. There used to be at least 5 movies which grossed a billion dollars every year. This year we don’t even have one.\n\nEven though paramount has a lot of good IP like you listed. All of them are beaten to death. Personally I don’t see any of those legacy IP making a good comeback. In short people are done with sequels and remakes(unless it’s very specific subset of Disney stuff). Hell A24 is the only production house I’d say is in a rising trend. \n\nNow coming back to your bull thesis, PARA needs a catalyst for its stock to jump. Netflix or HBO is the only streaming service that’s worth its money. Streaming sports is cyclical. I don’t think there is a catalyst for buy back. Yet…",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l96thni/",
      "created": 1718734008,
      "depth": 0,
      "replies": [
        {
          "id": "l970tnt",
          "score": 10,
          "body": "Deadpool 3 may make $1billion but your point still stands",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l970tnt/",
          "created": 1718736431,
          "depth": 1,
          "replies": [
            {
              "id": "l970x5x",
              "score": 8,
              "body": "Yes, Deadpool and inside out 2 are the only one I think has a shot",
              "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l970x5x/",
              "created": 1718736464,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l977717",
              "score": 8,
              "body": "$DIS calls?",
              "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l977717/",
              "created": 1718738540,
              "depth": 2,
              "replies": [
                {
                  "id": "l97kuoi",
                  "score": 8,
                  "body": "They blew $22M/episode on The Acolyte - it'll take half of Deadpool's profit.",
                  "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97kuoi/",
                  "created": 1718743058,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l97ilkq",
                  "score": 3,
                  "body": "I kind of think so…",
                  "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97ilkq/",
                  "created": 1718742313,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l97mv4z",
          "score": 5,
          "body": "Filmed entertainment is only a tiny portion of Paramount's earnings. TV media is their main cash flow driver, producing $4-5 Billion per year in OIBDA. With a $6-7 Billion market cap, that's pretty huge.\n\nParamount+ has been a money pit for sure, but after years of trying to grow it, they're finally hitting the brakes and pursuing profitability and seeking out a joint venture.",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97mv4z/",
          "created": 1718743725,
          "depth": 1,
          "replies": [
            {
              "id": "l97ob3n",
              "score": 2,
              "body": "True. But as to your point, seeking is still in progress. Also, how many streaming platforms do you currently subscribed to and how many do you actually use? \nCoz I have almost 8 different subscriptions and the only ones I keep using is YouTube, Netflix, HBO and occasionally Hulu/Prime. Disney+ may be once or twice in an year will just subscribe to those months where new shows will be dropped, Peacock is pretty much a legacy library of sitcoms, ESPN seems to have everything except the sports you would want to watch, PARA is also a legacy library of films you watch once and never come back. \n\nI see the streaming services to unite and form a mega single streaming service which is nothing but a TV provider we already have. Disney already did this by adding Hulu, NatGeo and ESPN to the bundle. Until that happens PARA is still a hard pass for me",
              "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97ob3n/",
              "created": 1718744193,
              "depth": 2,
              "replies": [
                {
                  "id": "l97r7ig",
                  "score": 3,
                  "body": "I don't really pay for streaming services because I'm not into Hollywood content, but I know with paramount+, they've added a few million new subscribers every quarter. So clearly there's demand, it's just that they spend way too much to attract customers, the ROI isn't there.\n\nTo be honest, I don't think any investors are optimistic about Paramount+, like at all. Most just see it as a liability that is eating away at Paramount's profits. The whole appeal of Paramount is their TV media division, which does like $4-5 Billion in profit per year, and their film studio, which Apollo offered $11 Billion for.\n\nLet's put it this way. Let's suppose Paramount decides to limit spending on Paramount+, such that it operates at break even. Subscriber growth will slow down for sure, but its no longer a money sink. \n\nWith that alone, they could theoretically use half of their profits to pay a $1 per quarter($4 per year) dividend, and use the remaining ~$2.5 Billion in profit to pay down half of their $14 Billion in debt within 3 years. That would be a 40% dividend yield, and they still would be making huge progress in improving their balance sheet.\n\nAlternatively, let's suppose they sell off their film studio to Apollo for their $11 Billion offer. They could pay out $10 per share to common shareholders as a special dividend, and use the remaining $4 Billion to pay off some of their $14 Billion in debt.\n\nOf course, this is all wishful thinking. It's highly unlikely management will act in the way I want them to.",
                  "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97r7ig/",
                  "created": 1718745162,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l97j5zt",
          "score": 4,
          "body": ">. There used to be at least 5 movies which grossed a billion dollars every year. This year we don’t even have one.\n\nThis is definitely an overstatement. There's only been 53 movies ever that have made over $1 billion so I don't think there's been a consistent period of 5 movies a year grossing over $1 billion.\n\nAdditionally we have much of the year left with potential movies like Deadpool or Joker 2 to get $1 billion this year (the first Joker did make it over $1 billion).\n\nI do think there is a bit of a slump in the movie theater industry specifically (I would definitely disagree on saying a slump for entertainment as a whole).",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97j5zt/",
          "created": 1718742497,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9876gz",
          "score": 2,
          "body": "And it's a lot worse when you factory in inflation.",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l9876gz/",
          "created": 1718751078,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9b4w7t",
          "score": 1,
          "body": "They keep producing woke shit and then complain that nobody wants to watch it for a price? LoL",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l9b4w7t/",
          "created": 1718805496,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l96yctc",
      "score": 18,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l96yctc/",
      "created": 1718735618,
      "depth": 0,
      "replies": [
        {
          "id": "l9740cq",
          "score": 2,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l9740cq/",
          "created": 1718737482,
          "depth": 1,
          "replies": [
            {
              "id": "l9837j6",
              "score": 5,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l9837j6/",
              "created": 1718749524,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l971wt3",
      "score": 9,
      "body": "I think its a really good value. Short sellers are keeping the price down, it's one of the most shorted stocks in the S&P500.\n\nDon't be too certain of an acquisition, though. Shari Redstone owns most of the voting shares, and she is more focused on her own self interest than that of shareholders when it comes to M&A opportunities.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l971wt3/",
      "created": 1718736791,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l971ibq",
      "score": 7,
      "body": "Ya like catching falling knives? I'd much rather catch the beefy part of an uptrend than try to guess a bottom.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l971ibq/",
      "created": 1718736657,
      "depth": 0,
      "replies": [
        {
          "id": "l977gia",
          "score": 3,
          "body": "how to catch the uptrend?",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l977gia/",
          "created": 1718738625,
          "depth": 1,
          "replies": [
            {
              "id": "l97p4ok",
              "score": 3,
              "body": "There is this company.... It's called Nvidia. I don't know if you've heard of it... Ticker is NVDA. They make shovels.",
              "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97p4ok/",
              "created": 1718744463,
              "depth": 2,
              "replies": [
                {
                  "id": "l991tcn",
                  "score": 2,
                  "body": "So\nIt doesnt matter what they mine?\nWait a second....who verified this guy!?!",
                  "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l991tcn/",
                  "created": 1718763514,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l96stda",
      "score": 6,
      "body": "I bought a few calls in case of a sale or merger",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l96stda/",
      "created": 1718733786,
      "depth": 0,
      "replies": [
        {
          "id": "l9710af",
          "score": 3,
          "body": "Same, and currently they are worthless",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l9710af/",
          "created": 1718736493,
          "depth": 1,
          "replies": [
            {
              "id": "l977w87",
              "score": 2,
              "body": "Same.  Dropped 600 bucks on the rumor, will never see them again.",
              "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l977w87/",
              "created": 1718738768,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l96ropg",
      "score": 11,
      "body": "Dude buy leaps",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l96ropg/",
      "created": 1718733417,
      "depth": 0,
      "replies": [
        {
          "id": "l979r6e",
          "score": 2,
          "body": "What’s a leap in your definition of",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l979r6e/",
          "created": 1718739394,
          "depth": 1,
          "replies": [
            {
              "id": "l97cy15",
              "score": 7,
              "body": "a year out. Whether the ceo stays or not, there will be a buyout, shareholders will want money, and they'll either push her out, or they'll rein her in. Either way, Para will either be a shell of its former self and crash and burn, or it'll be scooped up by someone and they'll pay for the licensing agreements for whatever movies were done in the past. They must have some implied value",
              "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97cy15/",
              "created": 1718740451,
              "depth": 2,
              "replies": [
                {
                  "id": "l97nt1h",
                  "score": 3,
                  "body": "I disagree with this assessment. I don't see Paramount crashing and burning like most of the media seems to suggest. The company is capable of producing $4-5 Billion a year in cash flow just from its TV media division. And TV subscription/affiliate revenue is only declining 1-2% per year. If they get streaming losses under control, which they're finally working on and have been making progress on, it would be very easy for them to pay off their debt.\n\nThis kind of transformation might take a few years for the market to finally reward. Paramount's financial situation has improved drastically the past few years, with their long term liabilities declining substantially, and paramount+ being the fastest growing streaming service since launch, and PlutoTV growing tremendously, but investors don't care. Until Paramount starts buying back shares and put pressure on short sellers, the stock can stay way too cheap.\n\nIMO your downside is so much higher with LEAPs. If the stock is cheaper than your strike price by the time it expires, you're down 100%. With shares, I'd say they have maybe 20% downside at most at this point. It would take a financial crisis for the stock to drop below $8 IMO.\n\nIV is way too high for LEAPS too I think. On a December 2025 $10 call, it costs $2.50, so it needs to hit $15 just for you to break even...Paramount isn't some innovative company like Nvidia that can be a 10-bagger. We're betting on maybe a return to $20-30 in 3-5 years.",
                  "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97nt1h/",
                  "created": 1718744029,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l97tev2",
                      "score": 2,
                      "body": "Interesting. I was hoping to leverage the buyout offers and then sell for a quick buck, or exercise calls at that time and sell the shares at inflated pricing. \n\nWhile I agree with your assessment, the reason why I think leaps would be better in this scenario is that money instead of hares could be better put to doing option plays. \n\nIf you go down to shares route, you'd have to do the setup place in order to try to recoup your investment",
                      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97tev2/",
                      "created": 1718745929,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l96yrsc",
      "score": 6,
      "body": "Shari will drive this thing into bankruptcy just on being stubborn headed not to sell it.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l96yrsc/",
      "created": 1718735756,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98rm82",
      "score": 3,
      "body": "Warren Buffett exited all of Berkshire Hathaways positions on Paramount; he tends to know what he’s doing…",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l98rm82/",
      "created": 1718759321,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l990mpv",
      "score": 3,
      "body": "If you actually know the media business and that the whole “linear is dying” thing is overdramatized bullshit, then yes, this company is stupid undervalued. CBS viewing is up recently and the whole linear division *grew* last quarter.\n\nRevenue will grow by a billion from $29bn to $30bn. They will surprise earnings to the upside Q2 (and the rest of the year) since everyone is raising advertising spend forecasts. They will cash flow a billion dollars this year. Somewhere along the way significant earnings will return. \n\nI think Shari stopped the sale because the dividend is going up in Q4 and that will save NAI. She doesn’t want to sell and now she doesn’t  need to.\n\nThe only thing wrong with this stock is that it’s not fashionable because it’s “not Netlfix”. But neither was AMC. Sound like a familiar opportunity?",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l990mpv/",
      "created": 1718763018,
      "depth": 0,
      "replies": [
        {
          "id": "l9bt9c0",
          "score": 1,
          "body": "Shari stopped the deal because the deal is toxic, with terms that after deal Para will pay 5B to merge in Sky. Both Shari and Sky knew that term is hurting Para class B shareholders, and none of them want to take the legal liability in deal term. \n\nShari could sell NAI since it's private. But all these people are looking for is the chance to screw up Class B.",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l9bt9c0/",
          "created": 1718813987,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l97d7i5",
      "score": 5,
      "body": "I'm big in to star trek and they are the only game in town, so I loaded up on shares lol.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97d7i5/",
      "created": 1718740536,
      "depth": 0,
      "replies": [
        {
          "id": "l995qwv",
          "score": 2,
          "body": "Live long and prosper.",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l995qwv/",
          "created": 1718765201,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l98a902",
      "score": 6,
      "body": "PARA is a dogshit company helmed by idiots. I own 275 shares.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l98a902/",
      "created": 1718752290,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l96xxf4",
      "score": 10,
      "body": "You say it’s an extremely valuable IP library but I’m not so sure. \n\nTerminator - no ones asking for more of these\n\nGodfather - 3 and done. \n\nMission Impossible - next one is last one. If they try and do more with out cruise it won’t do half as well. \n\nStar Trek - little public interest these days \n\nTop gun - maybe we’ll get one more. If it doesn’t have cruise who says he’s reluctant to another, then it’s not going to do half as well. \n\nSpongeBob - it’s not 2000 anymore \n\nTurtles - last movie did meh. It’s not the 1980s anymore.  \n\nI like most of the above, but let’s not pretend there’s much value left in them at this stage.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l96xxf4/",
      "created": 1718735474,
      "depth": 0,
      "replies": [
        {
          "id": "l99379w",
          "score": 4,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l99379w/",
          "created": 1718764100,
          "depth": 1,
          "replies": [
            {
              "id": "l9dgopv",
              "score": 1,
              "body": "Aired on Paramount Network but I'm pretty sure they don't own it. It was produced by a bunch of other companies. [https://en.wikipedia.org/wiki/Yellowstone\\_(American\\_TV\\_series)](https://en.wikipedia.org/wiki/Yellowstone_(American_TV_series))",
              "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l9dgopv/",
              "created": 1718834197,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9dgff4",
          "score": 2,
          "body": "Yes those IPs are old, but they still get TONS of views. [Spongebob is the #42 TV show in 2024](https://televisionstats.com/s/spongebob-squarepants). As well as being [#1 on Nickelodean](https://televisionstats.com/n/nickelodeon/year), higher than Paw Patrol. That's just one IP. \n\nThey also own films such as Top Gun, Jackass, Scream, A Quiet Place, Footloose, Jack Ryan, Paranormal Activity,  Grease, War of the Worlds, Frosty the Snowman, and Rudolph the Red Nosed Reindeer. We just saw how well Top Gun Maverick did, who's to say they couldn't reboot a different franchise and do well with it. \n\nThey also handle distribution for Dreamworks, such as Shrek, Paw Patrol, Madagascar, and Kung Fu Panda.\n\n[Then we can talk about their library of TV shows owned by CBS](https://en.wikipedia.org/wiki/List_of_programs_broadcast_by_CBS). Such as NCIS, FBI, Blue Bloods, Tracker, Amazing Race, Survivor, The Price is Right, Let's Make a Deal, Late Show with Stephen Colbert, 60 Minutes, 48 Hours, as well as a ton of sports and news shows.\n\nThe IPs they own are worth WAY more than their market cap right now. \n\nThen tack on all their other ventures like the movie studios, real estate, Paramount+, PlutoTV, etc.",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l9dgff4/",
          "created": 1718834103,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l96w33i",
      "score": 2,
      "body": "When's the next Top Gun?",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l96w33i/",
      "created": 1718734864,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l970koc",
      "score": 2,
      "body": "The 26B proposal included buying the debt.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l970koc/",
      "created": 1718736349,
      "depth": 0,
      "replies": [
        {
          "id": "l972dt2",
          "score": 1,
          "body": "Still about $12 Billion net of debt, which nearly double the current market price",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l972dt2/",
          "created": 1718736945,
          "depth": 1,
          "replies": [
            {
              "id": "l975vj4",
              "score": 6,
              "body": "You are correct. Factor in perception of poor management and so much competition, I will be happy with an exit around 18",
              "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l975vj4/",
              "created": 1718738108,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l97e90f",
      "score": 2,
      "body": "I look at this chart when I saw your post and think my fellow apes are regarded but so am I.\n\nhttps://preview.redd.it/zprryp12zd7d1.jpeg?width=1170&format=pjpg&auto=webp&s=825f2fb87b032d6e51e5afeb9220dc1b32929a6f",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97e90f/",
      "created": 1718740877,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l97fp94",
      "score": 2,
      "body": "Shari.\n\nWait till she sells her stake.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97fp94/",
      "created": 1718741360,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l97yfjx",
      "score": 2,
      "body": "Quarter end is causing all the underperformers to really accelerate to the downside.  Shari needs money so we'll probably see a deal.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97yfjx/",
      "created": 1718747725,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98mcl6",
      "score": 2,
      "body": "I'm only buying shares if they make Kendall Roy CEO. ",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l98mcl6/",
      "created": 1718757157,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l975x8x",
      "score": 3,
      "body": "SR needs to disappear",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l975x8x/",
      "created": 1718738124,
      "depth": 0,
      "replies": [
        {
          "id": "l99400f",
          "score": 1,
          "body": "Thats the only way anything good ever will happen to stock price.  Wish her boytoy would unlock her phone and sell all her shares.",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l99400f/",
          "created": 1718764439,
          "depth": 1,
          "replies": [
            {
              "id": "l995w86",
              "score": 1,
              "body": "Which boytoy? David ellison?",
              "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l995w86/",
              "created": 1718765265,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9764xg",
      "score": 1,
      "body": "They fucked up the layup that was supposed to be a Halo show",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l9764xg/",
      "created": 1718738196,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l97ol77",
      "score": 1,
      "body": "Well all the things you just said were true a month ago, and if you bought shares then you’d be down 20%. 40% if you bought them a year ago, who’s to say it won’t go down another 20% over the next month or 40% over the next year?\n\nUnless something major & significant happens I think they are more likely to continue down the current trajectory rather than turn it around.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97ol77/",
      "created": 1718744284,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l97ucjq",
      "score": 1,
      "body": "Mmm…pb",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97ucjq/",
      "created": 1718746255,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98isxw",
      "score": 1,
      "body": "You are in fact crazy",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l98isxw/",
      "created": 1718755722,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98j69u",
      "score": 1,
      "body": "You crazy",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l98j69u/",
      "created": 1718755872,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98ocgh",
      "score": 1,
      "body": "I asked the same thing about WBD.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l98ocgh/",
      "created": 1718757973,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98sa81",
      "score": 1,
      "body": "WBD is a better buy IMO",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l98sa81/",
      "created": 1718759599,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98sfl0",
      "score": 1,
      "body": "TC is gonna buy it eventually, and keep making MI/Top Gun movies until his 80's. Scream Buy.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l98sfl0/",
      "created": 1718759661,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l991mxj",
      "score": 1,
      "body": "NVDA is to AI as PTON is to COVID",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l991mxj/",
      "created": 1718763438,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9a0fzq",
      "score": 1,
      "body": "There is no chance of this going up once it appears on wallstreetbets. Look what you guys did to paypal.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l9a0fzq/",
      "created": 1718782711,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9aci01",
      "score": 1,
      "body": "Also paramount has over 12 billion dollars of debt.\n\nEven with the best 2026 estimates of $1.2 billion net income, with 100% of that spend on debt pay down that’s over 10 years.\nAnd over the last years they had big losses",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l9aci01/",
      "created": 1718791449,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9boixm",
      "score": 1,
      "body": "PARA has 14B debt,  6B market cap, total EV at 20B. Apollo's 26B buyout is not too much premium. Class B shareholders are likely screwed in any deal.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l9boixm/",
      "created": 1718812377,
      "depth": 0,
      "replies": [
        {
          "id": "l9caa1h",
          "score": 2,
          "body": "You forgot 3 B$ in cash.",
          "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l9caa1h/",
          "created": 1718819676,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9duyx9",
      "score": 1,
      "body": "You’d think that wouldn’t you….",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l9duyx9/",
      "created": 1718839730,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9gvduk",
      "score": 1,
      "body": "alright, I'm in for 1/4 of my normal position... If it breaks above anchored weekly VWAP I will go to half and if it breaks $10.10 I will go to full position on a swing trade up to the 10 day SMA where I will get out of half and hold the rest long term.  My stop is set at 9.48",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l9gvduk/",
      "created": 1718894468,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7y519",
      "score": 1,
      "body": "How did they announce a deal without pricing for $PARA and $PARAA WTF?",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/lc7y519/",
      "created": 1720459258,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l97v7sh",
      "score": 1,
      "body": "Screaming. Shouting. Yelling buy. Go all in!\n\n\n\nPrice to book - the perfect metric for media company LMAO\n\n\nWhat real estate is worth billions? The studio spaces ?\n\n\nA++++ due diligence you’ve done here. I’m proud of you. You articulated very well, the value paramount holds in terms of DCF of IP, streaming future profits, declining cable revenues, declining movie revenues. \n\n\nAll in!",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l97v7sh/",
      "created": 1718746568,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9743ul",
      "score": 1,
      "body": "I’d think with the latest last minute exit on a deal the stock will now be priced going forward to assume there’s no chance of a buyout since SR is crazy",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l9743ul/",
      "created": 1718737514,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l99f9o2",
      "score": 1,
      "body": "I am also intrigued by low PB companies but I prefer TBV rather than intangible. The adage- is rather invest in A players with B ideas than B players with A ideas. Mgmt has proved to be C players. MSG is the same with crappy mgmt. Activists may eventually buy it but who knows. Same with WB. Maybe options are the better play",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l99f9o2/",
      "created": 1718769688,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98zwyu",
      "score": -2,
      "body": "This was a thread on another sub. Someone smarter than me mentioned their revenue isn't covering their debts.",
      "permalink": "/r/wallstreetbets/comments/1diwt78/am_i_crazy_or_is_para_a_screaming_buy/l98zwyu/",
      "created": 1718762722,
      "depth": 0,
      "replies": []
    }
  ]
}