{
  "title": "Looking for advice on long term stocks",
  "score": 20,
  "selftext": "I hope this is the right place to ask but I've rarely ever bought individual stocks.  I'm looking to purchase some stocks for the long term (15+ years).  \n\nWould it be smart to buy 10-20 shares each of: nvidia, apple, microsoft, amazon, google, etc (big names that should be around for a long time)?   \n\nAny other stock recommendations for long term growth?   Thank you",
  "link_flair_text": null,
  "id": "1dj5qky",
  "num_comments": 66,
  "created_utc": 1718756079,
  "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/",
  "comments": [
    {
      "id": "l99wtwd",
      "score": 29,
      "body": ">Would it be smart to buy 10-20 shares each of: nvidia, apple, microsoft, amazon, google, etc\n\nNVDA, MSFT, AAPL, AMZN, META, and GOOG/GOOGL already make up 31% of the net assets of the S&P 500 index (SPLG/VOO/SPY) and 40% of the net assets of the NASDAQ 100 index (QQQ/QQQM), so if all you want to do is own mega cap tech stocks you might as well just buy the S&P 500 index or the NASDAQ 100 for simplicity.\n\nOne of the advantages of buying individual stocks is buying high performers that aren't among those well-known names, or aren't even in the big index ETFs. Here are my top performing stocks that aren't in the Magnificent 6 (I also own NVDA, MSFT, AAPL, and AMZN) and my current gains over the past 7 years or less:\n\n* MDB +187%\n* INTU +195%\n* ASML +195%\n* MA +226%\n* DDOG +253%\n* ADBE +254%\n* SNPS +285%\n* ODFL +316%\n* HUBS +323%\n* ANET +332%\n* NFLX +340%\n* NOW +354%\n* AVGO +378%\n* CELH +392%\n* KNSL +419%\n* SHOP +500%\n* CRWD +572%\n* FICO +619%\n* TTD +712%\n\nIf you want more growth stocks to research I made a spreadsheet of 134 dividend-paying S&P 500 index stocks that have beaten the S&P 500 index since 1993 or since the stock's IPO if it was after 1993\n\n[https://new.reddit.com/r/stocks/comments/1byeabm/134\\_sp\\_500\\_index\\_stocks\\_that\\_have\\_beaten\\_the\\_sp/?utm\\_source=share&utm\\_medium=web2x&context=3](https://new.reddit.com/r/stocks/comments/1byeabm/134_sp_500_index_stocks_that_have_beaten_the_sp/?utm_source=share&utm_medium=web2x&context=3)\n\nTLDR: if you just want to own the Magnificent 6 (NVDA, MSFT, AAPL, AMZN, META, GOOG/GOOGL) just buy the S&P 500 or even better the NASDAQ 100. Buy individual stocks that are either underweighted in the big indexes and their ETFs or aren't even in the big indexes and their ETFs.",
      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l99wtwd/",
      "created": 1718780197,
      "depth": 0,
      "replies": [
        {
          "id": "l99z3vo",
          "score": 9,
          "body": "Thank you for sharing this, I do not have generation wealth and I’m really hoping to build something for my future kids.",
          "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l99z3vo/",
          "created": 1718781754,
          "depth": 1,
          "replies": [
            {
              "id": "l9a0akl",
              "score": 20,
              "body": "I started from nothing and my portfolio is over $1 million. More important than leaving something for your kids is teaching them about investing and the importance of starting as early as possible. My adult children have had Roth IRAs from the time they were 18 and had jobs.",
              "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9a0akl/",
              "created": 1718782602,
              "depth": 2,
              "replies": [
                {
                  "id": "l9a35ej",
                  "score": 3,
                  "body": "That’s awesome, I hope to be in the same position in the future as well",
                  "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9a35ej/",
                  "created": 1718784664,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9b22ge",
                      "score": 3,
                      "body": "“Hope isn’t a plan”\n\nMy close friends *say* they want to save a lot of money, but when it actually comes down to it they aren’t putting the money away. \n\nYou have to *actually* start putting money away if you even want a chance at accumulating any wealth. Not tomorrow or next week or next month. If you keep putting it off it will not happen for you.",
                      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9b22ge/",
                      "created": 1718804403,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l9aly62",
                  "score": 3,
                  "body": "Contradictory, my parents have always taught me to be frugal, save money, and live within the means. My father has talked about stocks, but it was not something that was highly recommended. I think we’re lucky to be in a massive bull run or a bubble.",
                  "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9aly62/",
                  "created": 1718797170,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9b0sfi",
                      "score": 3,
                      "body": "I agree with all that, but in addition to saving money that comes from living frugally and within your means, it is crucial to go beyond just saving money and invest in the stock market as well. Looking at rolling 120 month periods starting in January 1928, 93% of those rolling 120 month periods had positive gains. In other words, if you invested in the stock market for 10 years starting in any month since January 1928, there is a 93% chance you made money.\n\nhttps://winthropwealth.com/commentary/how-has-the-sp-500-historically-performed-over-10-year-periods/",
                      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9b0sfi/",
                      "created": 1718803893,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l9bnd70",
                      "score": 3,
                      "body": "That’s good advice too, but also the same advice. The question is what do with the money you’re saving. \nAfter a certain point there’s no reason to just have it sitting in the bank",
                      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9bnd70/",
                      "created": 1718811986,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9bpgu1",
                          "score": 2,
                          "body": "Yeah. Traditional investing has been bank CD, treasury, bonds, stocks, and possibly real estate. That or run a business yourself and make real money. lol",
                          "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9bpgu1/",
                          "created": 1718812694,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l9ah42e",
          "score": 1,
          "body": "This is some good research, I do have questions on it tho! Mind if I hit you up",
          "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9ah42e/",
          "created": 1718794451,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l98uhb8",
      "score": 23,
      "body": "Individual stocks can be good, you'll hit more home runs with them than with index funds, but you might also strike out a bit.\n\nPersonally I look for stocks with a long history of paying regular and growing dividends that will return at least 4 or 5 percent on the price of the stock\n\nI look for a p/e ratio under 20\n\nI look for a quick ratio above one \n\nI look for a return on assets of around 10 percent \n\nI look at the balance sheet to make sure that the company is not over-leveraged.\n\nI read the annual report, focusing on risk factors. What is the company worried about? How likely to happen are those bad things that they listed?\n\nNot a comprehensive list, but the bare bones of it",
      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l98uhb8/",
      "created": 1718760500,
      "depth": 0,
      "replies": [
        {
          "id": "l99y2mw",
          "score": 2,
          "body": "So which ones?",
          "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l99y2mw/",
          "created": 1718781038,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9974vm",
      "score": 8,
      "body": "Sounds like you’re literally making an ETF.",
      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9974vm/",
      "created": 1718765807,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98l5uy",
      "score": 8,
      "body": "Look into ETF's.",
      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l98l5uy/",
      "created": 1718756676,
      "depth": 0,
      "replies": [
        {
          "id": "l98lajr",
          "score": 2,
          "body": "Any recommendations?",
          "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l98lajr/",
          "created": 1718756728,
          "depth": 1,
          "replies": [
            {
              "id": "l98ll7g",
              "score": 14,
              "body": "VOO",
              "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l98ll7g/",
              "created": 1718756850,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9a8al9",
              "score": 2,
              "body": "KWEB is all Chinese company internet stocks like BABA Tencent JD.com...somewhat beaten up, still largely trading sideway since after pandemic...getting in low",
              "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9a8al9/",
              "created": 1718788431,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l990gkg",
      "score": 8,
      "body": "I know everyone is saying to buy etfs like VOO which is true but I believe that blue chip companies will just continue growing at a faster rate so what I would do personally is put most of my money equally into blue chip like Nvidia, Apple, Microsoft, dell, google, Amazon, etc because there is a much better chance of high gains with singular stocks than an etf.",
      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l990gkg/",
      "created": 1718762946,
      "depth": 0,
      "replies": [
        {
          "id": "l991k09",
          "score": 4,
          "body": "Is it smart (tax wise) to buy within my taxable account?",
          "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l991k09/",
          "created": 1718763404,
          "depth": 1,
          "replies": [
            {
              "id": "l99a2y6",
              "score": 0,
              "body": "Idk what that means honestly",
              "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l99a2y6/",
              "created": 1718767152,
              "depth": 2,
              "replies": [
                {
                  "id": "l99a904",
                  "score": 3,
                  "body": "Is it better to buy individual stocks within a ROTH/401k vs taxable account?",
                  "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l99a904/",
                  "created": 1718767231,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l99cw60",
                      "score": 8,
                      "body": "Bro I’m 17 💀 I just have some random account under my dad I’m sorry I can’t answer that, my advice ain’t 100% trustable, hopefully someone else can help answer",
                      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l99cw60/",
                      "created": 1718768495,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l99d2ou",
                          "score": 1,
                          "body": "Though if you google that, there seem to be some good results",
                          "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l99d2ou/",
                          "created": 1718768582,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "l9a99hh",
                      "score": 2,
                      "body": "if you own funds, you will get hit with taxable dividends and capital gains...(but these distributions can also be reinvested to buy more shares)...dividends paid out by individual stocks will be taxed...and if you sell shares of an individual stock, any capital gains (net profit) will be taxed...so generally, if you hold securities that pay a lot of dividends and have capital gain distributions (e.g, mutual funds) and you do any trading, better to have them in a non taxable account (IRA) so any taxable events will not affect your taxes...stocks with no dividends and where you don't intend to trade much and hold long long term, keep those in taxable accounts...finally, if you invest in REITS (real estate stocks) which pay high dividends but are taxed at high rates, best put them in IRAs...i have great REITS like VTR, SPG, WPC, NNN)",
                      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9a99hh/",
                      "created": 1718789146,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l99tcww",
                      "score": 1,
                      "body": "Depends if you'd like to pay more taxes or not...",
                      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l99tcww/",
                      "created": 1718777893,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l9g3ec0",
                      "score": 1,
                      "body": "Depends on when you intend to spend the money.\n\n401ks reduce your tax burden but will be taxed later when you pull the money out.",
                      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9g3ec0/",
                      "created": 1718882792,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l9jffiq",
                      "score": 1,
                      "body": "Why worry about taxes when you have nothing to tax ? \n\nPour all your money into the equities or funds so ALL of it can work for you now. \n\nYou can pay taxes in the future when you have something to pay taxes on",
                      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9jffiq/",
                      "created": 1718925802,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l990kk5",
          "score": 1,
          "body": "Like I’ve doubled my account in a year with mostly individual stocks and some etfs, all blue chip too",
          "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l990kk5/",
          "created": 1718762992,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l98ndvz",
      "score": 3,
      "body": "The short answer is maybe it would be smart and that’s the rub: no one really knows until the time has passed.\n\nThe slightly longer answer is that with skill and some luck you *may* be able to buy some individual stocks that outpace the S&P 500 over a 15 year period but it is not easy. Those are all good companies you listed - the question is less what they are delivering today (it’s easy to get swept up in the excitement) but are they still going to be leading their markets in 2039?\n\nI have personally held V (2008) and AAPL (2014) for long periods of time and they have done great, but I honestly don’t feel one bit more confident about any next pick I might make because of this. Use your skill and intuition to the best of your ability.",
      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l98ndvz/",
      "created": 1718757577,
      "depth": 0,
      "replies": [
        {
          "id": "l98r7wp",
          "score": 4,
          "body": "Thanks. How does one even begin to figure out which stocks to invest in?  Obviously I just chose the biggest names because they seem “safer”.  What resources do you use to research?",
          "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l98r7wp/",
          "created": 1718759155,
          "depth": 1,
          "replies": [
            {
              "id": "l99b9na",
              "score": 4,
              "body": "One weird way to look at it is that most of the dollars that are invested in stocks in the US are in the 500 largest companies… with 40% of *that* in the handful of largest “megacap” companies. So you can’t go too wrong wrong investing in the S&P 500 index broadly or in some large cap companies that you believe will do well if you want to get into stocks. So that’s one place to start.",
              "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l99b9na/",
              "created": 1718767708,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l98v433",
              "score": 1,
              "body": "You’re not necessarily wrong with your picks - it’s just that none of us has a crystal ball.\n\nToday, I might simply look at the world around me and see what people are doing, using, spending money on and then research the company behind it. When I was first considering V and AAPL I remember thinking these things are in many people’s pockets and wallets and they aren’t going anywhere. Then I started to learn more about each business and went step by step.",
              "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l98v433/",
              "created": 1718760755,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9b43bf",
      "score": 2,
      "body": "I’m looking to Tesla now. I especially like the move they are making towards hydrogen. I find it interesting that Musk wasn’t interested in hydrogen at all but for some reason this changed. This makes me think that they might have had a technological breakthrough or they are on the cusp of one.",
      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9b43bf/",
      "created": 1718805191,
      "depth": 0,
      "replies": [
        {
          "id": "l9blnat",
          "score": 2,
          "body": "They have to because China is making better EVs. There is no growth for them in a few years.",
          "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9blnat/",
          "created": 1718811408,
          "depth": 1,
          "replies": [
            {
              "id": "l9bnx32",
              "score": 1,
              "body": "I don’t know about better EV’s but china is definitely a strong competitor. Tesla did miss out of the battery swapping idea that Nio has. But I would recon that there is a reason Tesla decided to not do this.",
              "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9bnx32/",
              "created": 1718812172,
              "depth": 2,
              "replies": [
                {
                  "id": "l9bpc6n",
                  "score": 2,
                  "body": "Battery swapping is very common in China in vehicles. Tesla didnt because they have a fixed monopoly here in USA with subsidized money and set up charging staions. USA is all about govt and corporations scratching each other backs. One day the export import market will open and consumers will get a better deal and Tesla stocks will take a hit.",
                  "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9bpc6n/",
                  "created": 1718812650,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l9d0lz1",
      "score": 2,
      "body": "Rolls Royce RYCEY \n\nStill somewhat beaten down post-Covid and some suggest their aircraft engine quality is not on a par with GE and Pratt & Whitney, but:\n\n* 55% of wide-body engines sold in 2022 were Rolls\nRoyce,\n* A new, more fuel-efficient Ultrafan engine is in the\nworks,\n* Possible expansion into the (much larger) narrow-\nbody engine market,\n* Engine Flying Hours are still increasing (a large % of\ntheir profits comes from servicing engines, not the\nsale of engines),\n* Continuing increase in defence spending in Europe,\n* Free Cash Flow increasing exponentially,\n* Dividends due soon,\n* Upgrade to investment grade this year, and\n* Small Modular Reactors announcement pending:\n\nThey are the only company to have passed Stage 1 of\nthe Generic Design Assessment and Stage 2 (a 16\nmonth process) should be completed in August.\n\nThe stock was up 229% last year and is up 55% so far\nthis year.\n\nMid-year results are due on 1st August 2024.",
      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9d0lz1/",
      "created": 1718828578,
      "depth": 0,
      "replies": [
        {
          "id": "l9jdyjd",
          "score": 1,
          "body": "I don't know where you get your earnings numbers but they are WAY OFF.\n\nRolls Royce Holdings?  They could possibly be out of business in the next ten years unless the government pour more cash in. Currently, maintenance contracts is what pays the bills\n\nCheck airline orders. Several have paid to drop RR for other engines.\n\nRespect your investment dollar in such a limited sector and buy GEA.",
          "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9jdyjd/",
          "created": 1718925219,
          "depth": 1,
          "replies": [
            {
              "id": "l9jza1d",
              "score": 1,
              "body": "https://www.rolls-royce.com/~/media/Files/R/Rolls-Royce/documents/investors/rr-plc-holdings-2023-half-year-results-press-release.pdf",
              "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9jza1d/",
              "created": 1718934116,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9jzw1c",
              "score": 1,
              "body": "https://www.investing.com/news/company-news/goldman-sachs-ups-rollsroyce-shares-target-optimistic-on-fiscal-performance-93CH-3489532",
              "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9jzw1c/",
              "created": 1718934376,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9hn4vl",
      "score": 2,
      "body": "buy VUG and VOO",
      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9hn4vl/",
      "created": 1718903621,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98mkx2",
      "score": 4,
      "body": "Yes that would be a great idea \n\nNVDA\nAAPL\nMSFT\nMETA\nAMZN\nTSLA\nGOOGL\n\nDKNG\n\nVOO\nQQQM",
      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l98mkx2/",
      "created": 1718757250,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9bbz0a",
      "score": 1,
      "body": "Qcom is my latest pick.",
      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9bbz0a/",
      "created": 1718808085,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9cuhb3",
      "score": 1,
      "body": "Boom: right here : https://www.reddit.com/r/stocks/s/7wTseARaZN.   FSELX. It’s going to outperform the S&P and its safe",
      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9cuhb3/",
      "created": 1718826505,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98t4sn",
      "score": 0,
      "body": "Intel",
      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l98t4sn/",
      "created": 1718759951,
      "depth": 0,
      "replies": [
        {
          "id": "l98ux99",
          "score": 4,
          "body": "are we feeling good about Intel? I’m thinking about buying",
          "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l98ux99/",
          "created": 1718760677,
          "depth": 1,
          "replies": [
            {
              "id": "l99sskj",
              "score": 2,
              "body": "Long term yes",
              "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l99sskj/",
              "created": 1718777529,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9bbob8",
          "score": 2,
          "body": "I would agree that Intel could have a good future ahead of them but they need to start innovating. They pretty much fumble the ball every time they get it. Even right now their primary business plan isn’t to innovate it is to build chips for the actual innovators. They will not be bigger than Nvidia because they hope to be one of the companies that Nvidia hires to build their AI chips. Intel built PC and Laptop chips, this was a great business but now most people do not even use laptops or PC’s. Instead they use their phones. When Apple introduced their first iphone this should have been Intels cue to start working on mobile chips. They didn’t. They continued building PC chips, this was a terrible decision. Today we have AI and again, Intel just sits around and waits for someone to give them a job. If Intel were in the beverage industry, I would picture them as being the company that produces the plastic bottles. They only do jobs that are contracted to them and honestly I think contracts will dwindle down because there are other options aside from Intel for companies that need chips built. On the positive side, Intel has been researching Quantum computing this could be promising, however I think they should halt or severely reduce all dividend payments and focus as much resources into this as possible. Otherwise, they will lose the race again.",
          "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9bbob8/",
          "created": 1718807981,
          "depth": 1,
          "replies": [
            {
              "id": "l9be8gg",
              "score": 2,
              "body": "Interesting analysis \n\nThe new ceo realized they lost the chip war \n\nHe did a great thing and pivoted \n\nThey are building 4 chip plants in the US and guess what ( will always be protected by US government for National security supply chain reasons because no one else can do chips except Taiwan semi on a scale that is needed )\n\nThey are also building one in Ireland \n\nThey do have some chips and can offer consumers and businesses a lower cost entry point if that entity has different needs then running the top of the line 75% margin chips Nvidia and amd sells\n\nThey do not need to be bigger then Nvidia \n\nLook at intel’s market cap \n\nThey can grow really really nicely for a very long time and only hit half of Nvidia \n\nIntel Is at a bottom right now \n\nVery easy for them to consistently climb from a very long time especially with all the seeds Pat G has already planted \n\nNvidia has much different path and has already performed in an amazing way = future growth in revenue and earnings and price will be difficult \n\nIntel has failed for years but is now in the middle of a super turn around with tens of billions invested \n\nWith the AI buzz and more tech coming chips will be even more important and I see a future where both Taiwan semi and intel are at max production capacity \n\nThese plants take forever to set up and are a finite resource, chips will become more and more in demand then even now and we saw how a slight disruption like Covid in the supply chain stoped a lot of production due to lack of chips \n\nThe future for Intel is bright \n\nOnly 2 types of investors exist for Intel right now \n\nThe ones who are holding these levels with 💎🙌 cause they see that future and the ones who go off old Info, do not understand the changes PG has made and don’t understand its future. \n\nI like the stock for a consistent climb long term which is what the OP’s question was \n\nIt’s also one of the safest stocks right now cause even in a market wise and sector pullback Intel is the only one in the space that isn’t over valued or over bought \n\nSo a lot of cash flow can go into it in those scenarios \n\nJust my opinion \n\nNot stock advice \n\nI like trivia and simply answered the OP’s question",
              "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9be8gg/",
              "created": 1718808873,
              "depth": 2,
              "replies": [
                {
                  "id": "l9bjrds",
                  "score": 1,
                  "body": "You are right there is potential, in fact I do own 5 shares of Intel in hopes that they do win at least one race. But I do consider them to be a little more risky. With US government help they may be able to win and they are the best US based chip company set to benefit from government spending. But on the other hand, can they be price competitive by producing chips in the US? This remains to be seen.",
                  "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9bjrds/",
                  "created": 1718810773,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9bywxa",
                      "score": 2,
                      "body": "I own 5,000 shares 🏆\n\nI honestly think if you average the gain between right now and the current share price over next 4 years \n\nI think 25% average increase per year \n100% return in 4 years and \nUniquely positioned to do so even in a sell off or bear market",
                      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9bywxa/",
                      "created": 1718815890,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l9bggph",
              "score": 1,
              "body": "Look at TSMC's msrket cap vs Intel.\nNow imagine what would happen to the stock if Intel hot 20-30% of TSMC's business.",
              "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9bggph/",
              "created": 1718809641,
              "depth": 2,
              "replies": [
                {
                  "id": "l9bkxkf",
                  "score": 1,
                  "body": "That is a good point, but by building chips the US can they be price competitive enough to gain these contracts? Many countries are also ramping up chip production. How long will it be before there is an oversupply of chips? How would intel fare if there was an oversupply and their chips already cost 25% more because they are made in the US?",
                  "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9bkxkf/",
                  "created": 1718811168,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9bp1c2",
                      "score": 2,
                      "body": "I´m not too sure about this but i dont think labor costs play that much part in overall chip costs.  \nThose fab are damn expensive, but Intel got large subsidies here. They also have fabs in Israel, Irealand and planned in Germany for wich they will get 10 billion subsidy from German State.\n\nSo in the end, will it really be such a large cost disadvantage?  \nAlso, just out of strategic considerations, companies might want to give some business to intel so they have an alternative source if not for fear of conflict in east asia, then for better negotiation position with TSMC.  \nCurrently, TSMC cant even fulfill all requests.\n\nI dont know, what do you think?\n\nBTW, here is an interesting document about the whole value-chain, little outdated, but mostly accurate as far as i can tell:  \n[https://www.consilium.europa.eu/media/58112/220712-the-semiconductor-ecosystem-global-features-and-europe-s-position.pdf](https://www.consilium.europa.eu/media/58112/220712-the-semiconductor-ecosystem-global-features-and-europe-s-position.pdf)",
                      "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9bp1c2/",
                      "created": 1718812548,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9bpkmm",
                          "score": 1,
                          "body": "Thanks for that document, interesting stuff!",
                          "permalink": "/r/stocks/comments/1dj5qky/looking_for_advice_on_long_term_stocks/l9bpkmm/",
                          "created": 1718812729,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}