{
  "title": "[deleted by user]",
  "score": 74,
  "selftext": "[removed]",
  "link_flair_text": null,
  "id": "1dj5raq",
  "num_comments": 96,
  "created_utc": 1718756134,
  "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/",
  "comments": [
    {
      "id": "l99j4x9",
      "score": 113,
      "body": "I would have said no, but given how many people are strongly saying no in here, I’m going to go with yes",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99j4x9/",
      "created": 1718771762,
      "depth": 0,
      "replies": [
        {
          "id": "l9albm3",
          "score": 24,
          "body": "So....that's a no then.",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9albm3/",
          "created": 1718796841,
          "depth": 1,
          "replies": [
            {
              "id": "l9blm9h",
              "score": 8,
              "body": "Yes",
              "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9blm9h/",
              "created": 1718811399,
              "depth": 2,
              "replies": [
                {
                  "id": "l9bxnsy",
                  "score": 4,
                  "body": "Maybe",
                  "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9bxnsy/",
                  "created": 1718815469,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9vb47f",
                      "score": 2,
                      "body": "I don't know",
                      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9vb47f/",
                      "created": 1719123514,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la33csj",
                          "score": 1,
                          "body": "Can you repeat the question?",
                          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/la33csj/",
                          "created": 1719253219,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l9cov6y",
          "score": 3,
          "body": "So buy calls and puts?",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9cov6y/",
          "created": 1718824602,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l99fvwj",
      "score": 32,
      "body": "Interest rates, interest rates, interest rates. It’s not about the stock, it is about the market risk category the market is pricing in. Small cap. It could be beating earnings and still be powned to the ground. The good news is, as long as they deliver long term the market will reward you. And when it does it will move fast.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99fvwj/",
      "created": 1718770009,
      "depth": 0,
      "replies": [
        {
          "id": "la33kb7",
          "score": 1,
          "body": "Can you ELI5 how interest rates affect this stock's price?",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/la33kb7/",
          "created": 1719253286,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l98q224",
      "score": 94,
      "body": "Is there any hope for fintech in general? Wall St has been dumping fintech all year, and seemingly no amount of good news or earnings can stop it",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98q224/",
      "created": 1718758676,
      "depth": 0,
      "replies": [
        {
          "id": "l99vt14",
          "score": 39,
          "body": "Wall St has been largely dumping fintech because of a swathe of shockingly inept fintech's shitting the bed on regulation. Go read the Synapse / Evolve situation for example, which happened literally just this past month - missing customer funds of $85M, blending DDA and FBO funds, etc. Probably the most shocking example of weaponized, nuclear-grade incompetence I've ever read in business. [1](https://fintechbusinessweekly.substack.com/p/synapse-claims-evolve-owes-50m-evolve) [2](https://fintechbusinessweekly.substack.com/p/full-reconciliation-may-not-be-possible) quick reads on that one. Or the BaaS Prizepool who just got hit with an FDIC cease & desist over falsely claiming to be FDIC insured to market their \"risk free\" lottery \"banking product.\"  \n\nAll to say, the recent hit is a natural consequence of the interest rate free for all. Every jabroni with a $10M funding round started a \"BaaS Fintech\" without an ounce of regulatory consideration, and now the OCC is dropping a metric-tonne sized hammer on everyone. Fintech's overall will be fine, but only the fed is done clearing house of the 9/10 who fucked around and are now finding out and people can be sure which companies will actually still be here.",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99vt14/",
          "created": 1718779509,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l98salj",
          "score": 18,
          "body": "Yep. Also see SQ/PYPL. SHIFT4 is the diamond in the rough",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98salj/",
          "created": 1718759603,
          "depth": 1,
          "replies": [
            {
              "id": "l98torn",
              "score": 10,
              "body": "I like SQ and maybe shift4.  Paypal operating income has been flat for several years now despite revenue growth",
              "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98torn/",
              "created": 1718760182,
              "depth": 2,
              "replies": [
                {
                  "id": "l98w7uy",
                  "score": 8,
                  "body": "Ya pypl Margin issue is getting addressed as well as better customer experience. Don't forget New ad revenue and AI integration. PYPL will have it's day when the stock price catches up to fundamentals...it always does!! Alex Chriss leadership and new Crew hires seem promising.",
                  "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98w7uy/",
                  "created": 1718761210,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9ahnfo",
                      "score": 2,
                      "body": "The fear for PYPL is that FedNow making ACH able to clear in minutes will lead to banks basically offering the same service.",
                      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9ahnfo/",
                      "created": 1718794774,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9b3hef",
                          "score": -2,
                          "body": "Lol no way it's a competition. People don't like using/trust government services because they usually suck. Furthermore, you don't want your money tracked closely by the government.",
                          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9b3hef/",
                          "created": 1718804959,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l9cy9z5",
                              "score": 2,
                              "body": "FedNow is a service offered to your bank, not one offered to the consumer. What it means is that ACH bank transfers from one bank to another now clear in a minute or so, rather than 1-3 days. That means Chase or your local credit union can offer basically instant payments and transfers, allowing them to make PayPal irrelevant. Canada jas had this among their banks for aome years, and PayPal has very low consumer usage there.",
                              "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9cy9z5/",
                              "created": 1718827792,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l98wpi3",
                      "score": 1,
                      "body": "Interesting, I need to take a closer look.  Their cashflow is really solid and it seems the threat of other payment companies is a bit overblown.  Of the 3 which do you like most rn?",
                      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98wpi3/",
                      "created": 1718761407,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l99uqyj",
                          "score": 2,
                          "body": "SHIFT4 is killing it!! I don't have positions but looking for an entry point. SoFi requires patience but fundamentaly doing well just need to ramp up their technology side.",
                          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99uqyj/",
                          "created": 1718778805,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l993vw1",
                          "score": 1,
                          "body": "I own SoFi avg $9 small position. PYPL have rather big position avg $103 not worried and I'm gonna double down now.\n\nSide note: lot of folks don't understand how huge PYPL is in online payments/merchant space. Huge international presense which no one can compete. Apple pay also have to use PayPal's Braintree for payments . Clients like uber use Braintree. Oh of course venmo monetization has started with small fees. Crypto/ pay USD stable coin. Fast lane checkout etc. strong balance sheet and stock buybacks/free cash flow and the list goes on. NFA just my bullish thesis. Excellent company just a broken stock.",
                          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l993vw1/",
                          "created": 1718764390,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l99h1p4",
                              "score": 6,
                              "body": "We definitely are convinced after hearing those positions",
                              "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99h1p4/",
                              "created": 1718770622,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l99qblw",
                                  "score": 10,
                                  "body": "Hey I can't time the market. The market doesn't always get things right and money rotates from different asset classes. I averaged down on PLTR when it hit $6. I bought meta at $100. If you're gonna dumpster dive buy when low especially when the fundamentals are looking good with the company. My 2c",
                                  "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99qblw/",
                                  "created": 1718775972,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l9ediwl",
          "score": 2,
          "body": "Robinhood. Stock is up a ton from the bottom and the underlying business is doing really well",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9ediwl/",
          "created": 1718847210,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9b7ha2",
          "score": 1,
          "body": "Nubank would like a word.   Up 400% in past year or so.  ",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9b7ha2/",
          "created": 1718806466,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l99wekl",
          "score": -1,
          "body": "Not really sure how it’s a fintech, but i guess it’s priced as it was. It’s my worst performing stock of the year for sure",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99wekl/",
          "created": 1718779907,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l99fv74",
      "score": 34,
      "body": "No position but it seems like both OP and the commenters here are mostly just talking about price action? The revenue growth seems pretty impressive and stable to me. I’d stick with it and keep looking at how the fundamentals improve or deteriorate rather than how the price moves day by day.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99fv74/",
      "created": 1718769999,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98u0ji",
      "score": 43,
      "body": "Wait till interest rates go down",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98u0ji/",
      "created": 1718760314,
      "depth": 0,
      "replies": [
        {
          "id": "l991761",
          "score": 19,
          "body": "One factor anyone buying financial fails to comprehend.   Interest income will plummet as expense rises.   The Banks are overpriced.",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l991761/",
          "created": 1718763256,
          "depth": 1,
          "replies": [
            {
              "id": "l99ppya",
              "score": 13,
              "body": "Re: banks being overpriced— that’s where it’s important to know how these companies *each* make money. Consumer banks (interest income) vs asset managers (fees on AUM & services), etc. \n\nWhere this comes into play: to name one example, about 55% of MS revenue is fees for wealth management services and assets under management. Their next biggest stream is investment banking, which may get a shot in the arm as lower rates increase incentive to be active. They’re an example of a beneficiary of some rate decreases.",
              "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99ppya/",
              "created": 1718775600,
              "depth": 2,
              "replies": [
                {
                  "id": "l9a4t5c",
                  "score": -5,
                  "body": "Sofi is also just a shitty product. I want to like it. But it’s clunky. They’re close but the app isn’t great. Shit doesn’t work half the time and it’s spammy. Is it a nice concept? Yes. I like being able to centralize all that shit, but that’s not really original to Sofi and they’re not doing it so much better than anyone else.  I’m gonna give a year but i haven’t been impressed tbh",
                  "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9a4t5c/",
                  "created": 1718785881,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l99aihw",
          "score": 5,
          "body": "why......b/c they did so well when rates were low?",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99aihw/",
          "created": 1718767354,
          "depth": 1,
          "replies": [
            {
              "id": "l99l1at",
              "score": 4,
              "body": "The company does well. The stuck on the other hand..",
              "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99l1at/",
              "created": 1718772831,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9andqk",
          "score": 2,
          "body": "Gta 6 will come out before interest rates go down.",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9andqk/",
          "created": 1718797906,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9amm3i",
      "score": 9,
      "body": "People are so excited over a digital bank. It's not a great business, there's not much of a moat and any time the economy cools this will go in the shitter as people worry about what's on the balance sheet. \n\n 2020/21 where anything \"disruptive growth\" that had an easily sold \"story\" only went up you had things like UPST become the hottest stock (\"it's the AI based way to lend!\") and when someone went on CNBC and froze when asked what they actually did, that was the top. \n\nIt's down about 95% since - a little over two years later, people still not going to be so eager to apply growth stories to fintechs, especially ones that no longer really have much of a growth story at all (PYPL) or ones that do have a lot of underlying risk (like UPST.)\n\nFintech in general has become a commoditized/much less appealing story than it used to be, but for some reason a lot of people seem to want fintech to happen again (and SOFI in particular is an oddly culty stock on Reddit) and when it doesn't, they get frustrated and double and triple down (SOFI stock not doing what people think it should was a common topic last year and is once again a common topic this year) rather than thinking that maybe they're wrong about some aspect of the investment. \n\nIf you have had a good experience with the company, that's great but it does not = this is a great investment.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9amm3i/",
      "created": 1718797515,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98reh3",
      "score": 34,
      "body": "Been circling with no returns for a long time along with other bagholder specials PYPL, INTC, SQ, etc.\n\nSPY is up 50% over two years no reason to be in these dogs that are still down.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98reh3/",
      "created": 1718759231,
      "depth": 0,
      "replies": [
        {
          "id": "l99ignm",
          "score": 20,
          "body": "crown simplistic deserted cake hobbies pathetic rhythm expansion birds weather\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99ignm/",
          "created": 1718771386,
          "depth": 1,
          "replies": [
            {
              "id": "l99k5vw",
              "score": 10,
              "body": "That one is the crown dogshit",
              "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99k5vw/",
              "created": 1718772337,
              "depth": 2,
              "replies": [
                {
                  "id": "l99kkme",
                  "score": 9,
                  "body": "squeamish innocent seed fuzzy entertain homeless cagey special rainstorm ask\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                  "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99kkme/",
                  "created": 1718772569,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9b2pmz",
                      "score": 7,
                      "body": "What do you envision Intel doing in the next 1-3 years that will meaningfully improve the share price?",
                      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9b2pmz/",
                      "created": 1718804659,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9bf5c3",
                          "score": -1,
                          "body": "nothing, they got comfortable staying as they were and amd came out of nowhere with a cheaper and better product and have taken huge market share and word of mouth.",
                          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9bf5c3/",
                          "created": 1718809187,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "l9dvz3k",
                      "score": 1,
                      "body": "Are you invested in any other semis?",
                      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9dvz3k/",
                      "created": 1718840126,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l9aalo2",
          "score": 5,
          "body": "Square sucks \n\nAfter pay is a joke and that tidal buyout is stupid .\n\nBuy now pay later is a feature that everyone has, they overpaid like crazy for that company \n\nJack is using squares balance sheet to make friends …",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9aalo2/",
          "created": 1718790124,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l98te4b",
      "score": 36,
      "body": "If you believe SoFi management’s guidance of 0.55-0.80 EPS by 2026, then there’s a lot of hope. SoFi has historically sandbagged on estimates, so I would be pretty surprised if they don’t hit this target. \n\nFor people saying Sofi is JUST a bank and should be valued at 1x TBV, show me another bank growing members and revenue as consistently and at the rate SoFi has… I’ll wait.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98te4b/",
      "created": 1718760058,
      "depth": 0,
      "replies": [
        {
          "id": "l99llrf",
          "score": 18,
          "body": "Nubank.\n\nDamn that was easy",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99llrf/",
          "created": 1718773154,
          "depth": 1,
          "replies": [
            {
              "id": "l9aoy8e",
              "score": 3,
              "body": "What's the ticker symbol?",
              "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9aoy8e/",
              "created": 1718798690,
              "depth": 2,
              "replies": [
                {
                  "id": "l9boso1",
                  "score": 2,
                  "body": "$NU, you can find it as Nu holdings",
                  "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9boso1/",
                  "created": 1718812467,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9dyepm",
                      "score": 2,
                      "body": "I own both and have since the beginning. I’m more interested in SOFI’s future.",
                      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9dyepm/",
                      "created": 1718841091,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l990glb",
          "score": 8,
          "body": "show me a company that dilutes as much as SOFI and has low of a profit margin as SOFI... i'll wait. SOFI's revenue/miniscule profit is a rounding error to a bank like JPM or BAC\n\n  \nyou want to be priced at a premium to bank but have inferior fundamentals? that's an interesting demand",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l990glb/",
          "created": 1718762947,
          "depth": 1,
          "replies": [
            {
              "id": "l99g3vv",
              "score": 4,
              "body": ">show me a company that dilutes as much as SOFI and has low of a profit margin as SOFI... i'll wait.\n\nSeriously? Lol",
              "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99g3vv/",
              "created": 1718770126,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l99exhd",
      "score": 6,
      "body": "They have a huge held for sale book. They are looking for rates to drop so they can have lower cost of funds there, but based on inflation data that could be a while.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99exhd/",
      "created": 1718769513,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9aroue",
      "score": 6,
      "body": "I’m holding until either first interest rate cut or next earnings report. Then will reassess. Sticking to my original plan as I think this is all just random noise at the moment. Saying that my average price is $7 so may be a different scenario",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9aroue/",
      "created": 1718799989,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9agg0e",
      "score": 7,
      "body": "I've been buying SOFI hand over first at $7and below, they had a good quarterly result that fell on deaf ears because of the market sentiment, not on the prafornance.  \n\nJust wait for the financial report after the Fed lowers the rates. The buyers will pile in. They all love to buy high for some reason?",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9agg0e/",
      "created": 1718794040,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9aj04a",
      "score": 6,
      "body": "Pls can someone pump this shit, so i can sell?",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9aj04a/",
      "created": 1718795567,
      "depth": 0,
      "replies": [
        {
          "id": "l9cju7p",
          "score": 1,
          "body": "Same 😂",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9cju7p/",
          "created": 1718822897,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l98tmut",
      "score": 8,
      "body": "It's a company that's controlled by day traders currently. If you're unwilling to hold for the long term, don't hold at all. This is gonna be a very long thesis to play out",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98tmut/",
      "created": 1718760160,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98sm19",
      "score": 13,
      "body": "bank trading at 1.6x book value when banks trade at 1x\n\nbank trading at 75x forward earnings\n\nsofi shareholders are definitely interesting",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98sm19/",
      "created": 1718759737,
      "depth": 0,
      "replies": [
        {
          "id": "l98veu7",
          "score": 8,
          "body": "Yeah, I don’t get the obsession. It’s just another online bank to me, no moat. And at some point some strong competition will come along. ",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98veu7/",
          "created": 1718760879,
          "depth": 1,
          "replies": [
            {
              "id": "l98wqb7",
              "score": 12,
              "body": "its heavily pumped by youtube finance bros who cant read an income statement but know how to cater to people who are naive unfortunately\n\n  \npeople think banks that are fintechs are valued at the same multiple as SaaS companies that are disrupters despite being completely different fields/valuations",
              "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98wqb7/",
              "created": 1718761416,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l98l27v",
      "score": 6,
      "body": "lol.  during silicon valley bank crisis sofi was $4+.  i bought some back then.  trust me, what's happening right now is not bad.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98l27v/",
      "created": 1718756634,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9axq42",
      "score": 2,
      "body": "Bank stocks blow",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9axq42/",
      "created": 1718802633,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l99if56",
      "score": 5,
      "body": "I was stupid enough to bag hold for this company for 3 years. Literally dumped all my shares but 1 in January. My portfolio is up 150% after reinvesting. The company doesn’t care about its shareholders at all and wallstreet loves to manipulate the hell out of it. People on here also love to over value it saying it should be around the 40-45$ mark and that’s absurd as well. Sell your bag and move on and learn from your mistake.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99if56/",
      "created": 1718771363,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98kils",
      "score": 7,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98kils/",
      "created": 1718756415,
      "depth": 0,
      "replies": [
        {
          "id": "l98yplk",
          "score": 5,
          "body": "They always beat earnings, doesn’t really matter",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98yplk/",
          "created": 1718762225,
          "depth": 1,
          "replies": [
            {
              "id": "l99dv7p",
              "score": -7,
              "body": "You do realize they can set guidance they know they will beat, right?",
              "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99dv7p/",
              "created": 1718768979,
              "depth": 2,
              "replies": [
                {
                  "id": "l99ip9e",
                  "score": 3,
                  "body": "Wall Street projects those earnings.",
                  "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99ip9e/",
                  "created": 1718771518,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l99lg9m",
                      "score": -3,
                      "body": "Look dude that’s not how it works.  Idk why you think it’s the case but feel free to ask ChatGPT if you don’t believe me.  You should read the fine print of Sofi “members” and “products”.  You also should sell and move on.  Sooo many better companies out there",
                      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99lg9m/",
                      "created": 1718773066,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l99vp1n",
                          "score": 1,
                          "body": "Ok Mr bot",
                          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99vp1n/",
                          "created": 1718779435,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l98oroa",
          "score": 13,
          "body": "They have a really solid history of beating earnings plus management has literally said they sandbagged the guide for next quarter so I guess we will see",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98oroa/",
          "created": 1718758147,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l99aqt9",
      "score": 3,
      "body": "Are you asking why Sofi is doing exactly what its been doing since it went public........under preforming the market......any hope that it changes now that people are less hyped about fintech?\n\nLets think about this....they got an narrow revenue stream, mainly consumers in a market where consumer strength is weakening, the product they offer isn't unique and even worse its easily replicated by much larger and well funded competitors. The consumer base they chase is one of the least profitable in the banking sector, people who will pull up and switch banks at a moments notice.  Even their ETF's are over priced, they don't have a serious wealth management division.  \n\nAt best you are getting the last two puffs of the cigar.....buying a bad business at a even better price.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99aqt9/",
      "created": 1718767461,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98njoj",
      "score": 2,
      "body": "High end clientele, with no brick + mortar… better leverage once through growth. However that’s years away. With. 30 year time horizon I am accumulating and expect a 10x in that time.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98njoj/",
      "created": 1718757644,
      "depth": 0,
      "replies": [
        {
          "id": "l98qhtz",
          "score": 17,
          "body": "There is no incentive for rich people to specifically use Sofi lol.",
          "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98qhtz/",
          "created": 1718758854,
          "depth": 1,
          "replies": [
            {
              "id": "l98z58z",
              "score": 3,
              "body": "True, besides rewards/commitment and products that get better the more other products you use. Perhaps some brand loyalty and content was from those same existing members. 🤷‍♂️",
              "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98z58z/",
              "created": 1718762406,
              "depth": 2,
              "replies": [
                {
                  "id": "l98zeoi",
                  "score": 3,
                  "body": "I am rich and have financial relationships with various institutions and unions. Nothing Sofi has shown has given me incentive to go with them. If anything, I recommended Sofi to some teenagers starting off. It seems to suit them more.",
                  "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98zeoi/",
                  "created": 1718762513,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l990piy",
                      "score": 1,
                      "body": "you mean you dont like their customer service being an outsourced south asian call center? i would definitely feel safe moving hundreds of thousands of dollars with a chat bot. i can't imagine why sofi has a low average FICO/avg deposit",
                      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l990piy/",
                      "created": 1718763051,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l9ailr0",
              "score": 0,
              "body": "When he says high-end, I don't think mean ritch? It's generating interest in younger affluent people who like to have all the boxes ticked all in one place. Sofi is attractive to them and cross sells its products to an increasing number of students and younger professionals as they are moving away from more traditional brick and motor banks.",
              "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9ailr0/",
              "created": 1718795336,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9bhrqb",
      "score": 1,
      "body": "Honestly, you have to have conviction in the stock. Otherwise you won't buy it when it's red, and those are the best days to buy.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9bhrqb/",
      "created": 1718810091,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9bt9g1",
      "score": 1,
      "body": "Do short options if you believe in the stock",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9bt9g1/",
      "created": 1718813988,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9bu0na",
      "score": 1,
      "body": "Based on the sentiment, i guess yes.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9bu0na/",
      "created": 1718814239,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9c0hbt",
      "score": 1,
      "body": "Rates would be my best guess. And with any potentially disruptive company, wall streets tries to hammer them out of existance",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9c0hbt/",
      "created": 1718816411,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9cjsbk",
      "score": 1,
      "body": "SOFI is my only gamble. Sold a put at 20, got assigned, saw it hit 24+ and unwisely didn’t sell thinking it had the potential to go higher.\n\nMaybe it does, but not for a while.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9cjsbk/",
      "created": 1718822879,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9ct55q",
      "score": 1,
      "body": "whelp the stocks at an 52 week low",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9ct55q/",
      "created": 1718826055,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9dgfk9",
      "score": 1,
      "body": "SOFI’s problem is that it was a meme coin that left a LOT of bag holders. Happened in 21 and this year too.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9dgfk9/",
      "created": 1718834104,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9dlath",
      "score": 1,
      "body": "I don't buy anything where the stock based comp. to insiders is more than earnings.  It just mean the company is more interested in enriching insiders than outsiders.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9dlath/",
      "created": 1718835962,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9dn3bm",
      "score": 1,
      "body": "Who cares. The company is performing. The price will eventually correct itself. Doesn't matter whether it's a bank or tech company. The numbers will speak for themselves whether they are good or bad. If people can't handle stock prices then maybe they should stick with index funds.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9dn3bm/",
      "created": 1718836652,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9edbx7",
      "score": 1,
      "body": "its a bank",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9edbx7/",
      "created": 1718847132,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9eddba",
      "score": 1,
      "body": "JPM trades at 12x earnings. Sofi is trading around 10x their potential earnings in 2026. Seems slightly overvalued right now to me given the 2026 earnings are still 2 years away and no guarantee they reach them.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9eddba/",
      "created": 1718847147,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9enm37",
      "score": 1,
      "body": "Let’s all be honest Taylor Swift’s Era’s Tour was like free advertising for them saying she was at SOFI Stadium in it.  Now that the hypes died down their growth is done for!  Haha",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9enm37/",
      "created": 1718851351,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9g5gga",
      "score": 1,
      "body": "There’s high IV in SOFI.  It’s a good one for selling out of the money puts.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9g5gga/",
      "created": 1718883869,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9k9tqt",
      "score": 1,
      "body": "Probably earnings. I plan to buy more will definitely buy more if nvda crashes the whole market.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9k9tqt/",
      "created": 1718938790,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l98nqdy",
      "score": 1,
      "body": "It’s a shitco in a high interest rate environment. What did you expect? Stop over thinking this and just invest in huge market cap companies that aren’t sensitive to interest rates",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l98nqdy/",
      "created": 1718757720,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l99mkc8",
      "score": 1,
      "body": "Keep accumulating, as long as they keep over delivering on the guidance I'm happy. I just bought another 1300 shares yesterday, we'll see 14$ by next year unless they drop the ball.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l99mkc8/",
      "created": 1718773711,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9c1icg",
      "score": 1,
      "body": "Just seen too, overall insiders have sold over a billion and bought under a million. Chart looks ugly. Might be a play for them to dilute. Get under a buck then reverse split",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9c1icg/",
      "created": 1718816755,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9ad0j5",
      "score": 0,
      "body": "If I am the CEO of SOFI, then I will just do a 1:10 reverse split. Right now SOFI in low single digit is just a retail investors meat grinder. Retail investors bought a lot because of the optically \"low\" price, but have weak hands, at the same time the low single digit price makes manipulation by shorts easier.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9ad0j5/",
      "created": 1718791800,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9andlu",
      "score": 0,
      "body": "TLDR: SOFI is fundamentally unprofitable if you use a realistic loan loss provision ratio of ~2%, much less 5% - like DFS is currently experiencing. SOFI is expecting to lose 0.1% on largely unsecured loans averaging 15%+ interest. Banks lose 0.5-1% on largely asset-secured loans averaging 4-7% interest. \n\n\nCurrently SOFI has $22b in loans on their books. Their average effective interest rate is ~12% ($661m/q in gross interest / $22b in loans). Note that SOFI is selling their loans, so the interest rate to consumers is much higher. \n\nDFS, a long-term successful financial services company, just reported 5.66% charge-off rate for their credit card business. Losses are elevated currently, but I believe the LT avg charge-off rate in credit cards is 2-3%. The LT loss rate in traditional bank loans (which are are typically secured by lender rights to assets [i.e. mortgages or car loans] and have much lower interest rates) is 0.5% to 1%. \n\nSOFI is provisioning $7m in losses for $22b in loans. That actually rounds (x4 to annualize) to a 0.1% loss-provision rate. So SOFI is claiming they can make largely unsecured loans at a credit card like interest rate and take losses at a 98-99% lower rate than asset secured bank loans. \n\nLots of fintechs claim ‘our algorithm and data collection makes traditional banking obsolete.’ Usually after the loans season for a few years it turns out the fintech start-up just had hyper-poor underwriting standards and blows up. \n\nBanks aren’t that bad at lending. Lending is a hyper competitive low margin business. If you could write an algorithm fed by some surveillance data and improve underwriting by 50-100x, that would have already been done at one of the banks who collectively spend $10s of b annually trying to get 1% better at underwriting. \n\nLook at Prosper, Lending Club, and UPST for examples of ‘we solved banking’ which were actually using very poor underwriting that eventually came home to roost. \n\nSOFI is selling their loans, but if the loan portfolios they are selling don’t season well, it will massively reduce the price SOFI can get selling the loans. It may also cause SOFI to keep more toxic loans on their own BS. \n\nUltimately SOFI has marginal profitability with a 0.1% loss provision. Their business model looks non-viable with a 2% loss provision, while a 5-7% loss provision seems completely possible. \n\nI have no position. Bank accounting is a black-box CF.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9andlu/",
      "created": 1718797905,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9cd2zg",
      "score": 0,
      "body": "It's a good company with excellent growth and as a customer I absolutely love them as my bank.\n\nCan't say what way the stock price will go but as far as companies with a promising future sofi is solid.",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9cd2zg/",
      "created": 1718820617,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9cdhgu",
      "score": 0,
      "body": "It's a good time to buy the stock",
      "permalink": "/r/stocks/comments/1dj5raq/deleted_by_user/l9cdhgu/",
      "created": 1718820752,
      "depth": 0,
      "replies": []
    }
  ]
}