{
  "title": "UK inflation falls to Bank of England’s 2% target ahead of elections",
  "score": 141,
  "selftext": "KEY POINTS\n\n* U.K. inflation fell to the Bank of England’s target of 2.0% in May, the Office for National Statistics said Wednesday.\n* The headline reading declined from 2.3% in April, bringing it in line with the central bank’s 2% target.\n* The print is the last key economic measure ahead of national elections in July.\n\nU.K. inflation fell to the Bank of England’s target of 2.0% in May, the Office for National Statistics said Wednesday, in the last print of the key economic measure ahead of national elections in July.\n\nThe headline reading declined from [2.3% in April](https://www.cnbc.com/2024/05/22/uk-inflation-april-2024.html#:~:text=U.K.%20inflation%20fell%20to%202.3,April%20from%204.2%25%20in%20March.) and came in line with the 2% expectations of economists polled by Reuters.\n\nSterling rose slightly shortly after the release, trading at $1.2721 by 7:33 a.m. London time.\n\nServices inflation — which is closely watched by the BOE given its dominance within the U.K. economy and its reflection of domestically-generated price rises — was at 5.7% in May, versus 5.9% during the previous month.\n\nCore inflation, excluding energy, food, alcohol and tobacco, dipped to 3.5% from 3.9% in April.\n\nFalling food prices were the largest contributor to the declines, while car fuel costs continued to see an upward pressure, the ONS said.\n\nUnseasonably bad weather led to the slowest increase in grocery sales in two years, new figures from U.K. market research firm Kantar showed Tuesday. Grocery sales rose 1.0% in the four weeks to June 9, marking the sixteenth consecutive monthly decline in food inflation, according to the index.\n\n# Bank of England decision in focus\n\nWhile the latest print brings inflation in line with the BOE’s target, Azad Zangana, senior European economist and strategist at Schroders, cautioned that upward pressure could return in the second half of the year, as the U.K. phases out its energy price cap.\n\n“From the third, fourth quarter onwards, you might start to see a bit more upward pressure coming through as the Bank of England has warned,” he told CNBC’s “Squawk Box.”\n\nZangana suggested that the Bank could even “surprise” the market with a rate cut this week, when it next meets on Thursday. The Bank is otherwise widely expected to hold rates steady at 5.25%, where they have been [since August 2023](https://www.cnbc.com/2023/08/03/bank-of-england-hikes-rates-by-quarter-percentage-point-in-split-vote.html) — back when inflation hovered around 7.9%.\n\nNevertheless, with inflation now falling closer to target, markets are now pricing in a near-term cut. All but two of 65 [economists polled by Reuters](https://www.reuters.com/world/uk/bank-england-cut-rates-august-least-one-more-expected-this-year-2024-06-12/#:~:text=Just%20over%20half%20of%20economists,cut%20this%20year%20to%205.00%25.) last week said they expected an interest rate trim in August, while financial markets are pricing in such a curb in September.\n\nThe economic performance comes as the U.K. gears up for its general election on July 4, with polls pointing to a landslide victory for the opposition Labour party.\n\nU.K. Prime Minister Rishi Sunak dubbed the latest print “great news” in a [post on the X social media platform](https://x.com/RishiSunak), adding that inflation was now “back to normal.”\n\nOpposition politician Rachel Reeves acknowledged that, while inflation is growing at a slower rate, “the cost of living crisis is still acute” for many families.",
  "link_flair_text": "Broad market news",
  "id": "1dje0ze",
  "num_comments": 18,
  "created_utc": 1718785202,
  "permalink": "/r/stocks/comments/1dje0ze/uk_inflation_falls_to_bank_of_englands_2_target/",
  "comments": [
    {
      "id": "l9a3vwl",
      "score": 1,
      "body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1dje0ze/uk_inflation_falls_to_bank_of_englands_2_target/l9a3vwl/",
      "created": 1718785203,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9aby5l",
      "score": 82,
      "body": "How convenient. Just in time for elections!",
      "permalink": "/r/stocks/comments/1dje0ze/uk_inflation_falls_to_bank_of_englands_2_target/l9aby5l/",
      "created": 1718791068,
      "depth": 0,
      "replies": [
        {
          "id": "l9awltz",
          "score": 34,
          "body": "Voters will still vote by how things feel. And stuff feels too expensive. Maybe lay off the tin foil",
          "permalink": "/r/stocks/comments/1dje0ze/uk_inflation_falls_to_bank_of_englands_2_target/l9awltz/",
          "created": 1718802161,
          "depth": 1,
          "replies": [
            {
              "id": "l9dzjhm",
              "score": 3,
              "body": "because voters are idiots",
              "permalink": "/r/stocks/comments/1dje0ze/uk_inflation_falls_to_bank_of_englands_2_target/l9dzjhm/",
              "created": 1718841542,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9dczmp",
          "score": 3,
          "body": "It was pretty obvious when Sunak called the election that it was a \"good as it's going to get\" economic moment for him to cling on to. Might save the one or two seats, but no more than that.",
          "permalink": "/r/stocks/comments/1dje0ze/uk_inflation_falls_to_bank_of_englands_2_target/l9dczmp/",
          "created": 1718832847,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9bjpup",
          "score": 4,
          "body": "The US was below target at the end of 2023. Base effects can start to raise the number, which the BOE specifically mentions.",
          "permalink": "/r/stocks/comments/1dje0ze/uk_inflation_falls_to_bank_of_englands_2_target/l9bjpup/",
          "created": 1718810758,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9bk1yz",
      "score": 23,
      "body": "Easier to bring inflation down when the economy is shit and hasn’t grown in a decade + half the country unable to pay their energy bills.",
      "permalink": "/r/stocks/comments/1dje0ze/uk_inflation_falls_to_bank_of_englands_2_target/l9bk1yz/",
      "created": 1718810874,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9exbd0",
      "score": 0,
      "body": "Seems like a pretty reasonable probability that they are going to be rapidly cutting, 2.3, becomes 2.0, becomes 1.x and potentially 0.x or -x.x\n\nOnly a matter of time before the US data begins to look similar, how much TLT do you guys own? Anybody on zt, zn, ZB futures?",
      "permalink": "/r/stocks/comments/1dje0ze/uk_inflation_falls_to_bank_of_englands_2_target/l9exbd0/",
      "created": 1718855833,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9a9vzy",
      "score": -58,
      "body": "Persistent inflation isn't normal.",
      "permalink": "/r/stocks/comments/1dje0ze/uk_inflation_falls_to_bank_of_englands_2_target/l9a9vzy/",
      "created": 1718789608,
      "depth": 0,
      "replies": [
        {
          "id": "l9arkl3",
          "score": 42,
          "body": "This is a reminder to not listen to everything random redditors say with confidence",
          "permalink": "/r/stocks/comments/1dje0ze/uk_inflation_falls_to_bank_of_englands_2_target/l9arkl3/",
          "created": 1718799935,
          "depth": 1,
          "replies": [
            {
              "id": "l9deeyf",
              "score": -7,
              "body": "I bet you've never complained about prices going up /s.",
              "permalink": "/r/stocks/comments/1dje0ze/uk_inflation_falls_to_bank_of_englands_2_target/l9deeyf/",
              "created": 1718833362,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9chgdr",
              "score": -16,
              "body": "Like you.",
              "permalink": "/r/stocks/comments/1dje0ze/uk_inflation_falls_to_bank_of_englands_2_target/l9chgdr/",
              "created": 1718822089,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9b1y80",
          "score": 16,
          "body": "It is normal and it is needed. If there was no inflation, there would ne no incentive to buy something today because it‘s cheaper tomorrow. This would be a disaster for the economy. (In very simple terms)",
          "permalink": "/r/stocks/comments/1dje0ze/uk_inflation_falls_to_bank_of_englands_2_target/l9b1y80/",
          "created": 1718804355,
          "depth": 1,
          "replies": [
            {
              "id": "l9bio2j",
              "score": 7,
              "body": "China right now is facing serious deflationary issues for anyone who would like to see a real world example of this.",
              "permalink": "/r/stocks/comments/1dje0ze/uk_inflation_falls_to_bank_of_englands_2_target/l9bio2j/",
              "created": 1718810402,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9b6sn4",
              "score": 5,
              "body": "Downvoters hate that things cheaper is bad for economy.",
              "permalink": "/r/stocks/comments/1dje0ze/uk_inflation_falls_to_bank_of_englands_2_target/l9b6sn4/",
              "created": 1718806210,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9chrdm",
              "score": -5,
              "body": "So people aren't going to buy food in a deflationary environment because it will be cheaper in the future? Deflation is good for buyers and happens in tech all the time yet people buy iPhones etc all the time without hesitation.",
              "permalink": "/r/stocks/comments/1dje0ze/uk_inflation_falls_to_bank_of_englands_2_target/l9chrdm/",
              "created": 1718822192,
              "depth": 2,
              "replies": [
                {
                  "id": "l9dw8fy",
                  "score": 3,
                  "body": "Tell that to Japan. People refuse to purchase goods because they expect prices to go down. That is not good for an economy and that’s why you see Japan lacking economic growth.",
                  "permalink": "/r/stocks/comments/1dje0ze/uk_inflation_falls_to_bank_of_englands_2_target/l9dw8fy/",
                  "created": 1718840228,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}