{
  "title": "Most stocks hyped as winners from AI boom have fallen this year",
  "score": 414,
  "selftext": "Source: https://www.ft.com/content/1e02d0d3-3f0b-4bd1-a79c-9fd45d1b6056\n\nMost of the stocks that were caught up in last year’s hype around artificial intelligence have fallen this year, suggesting that investors are increasingly trying to separate the wheat from the chaff among companies claiming to be beneficiaries of the AI trend.\n\nMassive share price rallies for high-profile groups such as Nvidia, the chip designer that this week became the world’s most valuable listed company, have spurred a growing debate about whether the US stock market is being driven by speculative hype.\n\nBut the recent declines for dozens of stocks that had benefited from the early enthusiasm suggest that investors are starting to look past optimistic commentary if the companies cannot back up their claims.\n\n“AI is still a big theme but if you can’t demonstrate evidence you’re getting hurt,” said Stuart Kaiser, head of US equity trading strategy at Citi. “Just saying ‘AI’ 15 times is not going to cut it any more.”\n\nAbout 60 per cent of stocks in the S&P 500 have risen this year, but more than half the stocks included in Citi’s “AI Winners Basket” — an index based on the names that were garnering the most excitement among the bank’s clients last year — have declined. More than three-quarters of companies in the AI basket had climbed in 2023.\n\nInvestment funds that tried to pick a wide spread of AI beneficiaries have had a similar experience. More than half of the individual stocks in BlackRock’s Robotics and Artificial Intelligence ETF, Invesco’s AI and Next Gen Software fund, and First Trust and Nasdaq’s Artificial Intelligence and Robotics ETF have declined this year.\n\nMona Mahajan, senior investment strategist at Edward Jones, said: “Investors are looking a bit more at the earnings story among ‘AI’ names. The differentiator with something like a Nvidia is they have delivered on the bottom line, showing real data.”\n\nNvidia has more than doubled in value this year, after more than tripling in 2023, and its market cap is now well over $3tn. However, the massive demand for its graphics processing units is such that, measured as a multiple of its sales over the previous 12 months, the stock is actually cheaper than this time last year. \n\nIn contrast, tech groups such as Salesforce, Snowflake, Intel and Adobe — now far smaller than Nvidia by market value, but classed as large-cap stocks — have fallen sharply after strong gains in 2023.\n\n“In tech the bar was quite high [in earnings season] and if you missed that bar you got hit hard,” said Citi’s Kaiser. Salesforce suffered its worst one-day drop in 20 years after publishing a disappointing quarterly update last month.\n\nAlthough some have taken the shift as a sign of rationality returning, Rob Arnott, chair of asset manager Research Affiliates, said the AI-linked rally still “has the look to me of a classic bubble”.\n\n“One of the things about a classic bubble is you do see smaller players fade before big ones start to suffer,” he said.\n\nArnott stressed that he was a believer in the long-term impact of AI, but said “a lot of the benefits are going to come gradually, and the market is pricing in immediacy”.",
  "link_flair_text": "Industry Discussion",
  "id": "1djh7bs",
  "num_comments": 111,
  "created_utc": 1718797736,
  "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/",
  "comments": [
    {
      "id": "l9b0w6x",
      "score": 99,
      "body": "The ones listed are all at the end of the AI line. Will benefit eventually. Besides Mag 7, plenty others doing well all in semis - ARM, AVGO, SMCI, CDNS, TSM - the picks and shovels so to speak.",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9b0w6x/",
      "created": 1718803935,
      "depth": 0,
      "replies": [
        {
          "id": "l9bhmae",
          "score": 50,
          "body": "Go one step lower in supply chain..\n\n\nAxcelis, AMAT, ASML.. ",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9bhmae/",
          "created": 1718810039,
          "depth": 1,
          "replies": [
            {
              "id": "l9en4lu",
              "score": 6,
              "body": "AMAT is my fav, long hold for me all the financials make it much more attractive than many of the others",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9en4lu/",
              "created": 1718851149,
              "depth": 2,
              "replies": [
                {
                  "id": "l9ev70c",
                  "score": 3,
                  "body": "When did you get in? Feels too late to jump in now.",
                  "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9ev70c/",
                  "created": 1718854795,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9gbe2b",
                      "score": 1,
                      "body": "Never too late.. 10B buyback they did in 2023, is likely done with a mindset of holding for more than 4-5 years ",
                      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9gbe2b/",
                      "created": 1718886731,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l9cetvd",
          "score": 14,
          "body": "Also MU",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9cetvd/",
          "created": 1718821206,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9cj8dy",
          "score": 12,
          "body": "I don't understand ARM. Other than offering licensing for their mediocre reference cores, they have no AI specific hardware. They don't even license an NPU. So that's a head scratcher.",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9cj8dy/",
          "created": 1718822693,
          "depth": 1,
          "replies": [
            {
              "id": "l9cvdtv",
              "score": 13,
              "body": "It's mostly just hype. When you had the likes of rivian or lucid at insane valuations during the EV boom, it was the same.",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9cvdtv/",
              "created": 1718826811,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9cl3b5",
              "score": 13,
              "body": "ARM may be one of the most overvalued companies in the market today.",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9cl3b5/",
              "created": 1718823320,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9cryfz",
              "score": 8,
              "body": "Copying from a comment I made yesterday bc I’m lazy:\n\nARM has a few potential growth vectors that *might* be huge. There are investors that are taking a high risk, high reward position based on:\n\n1.\t⁠Market penetration that could expand further in both data center and PC market\n\n2.\t⁠Favorable settlement or ruling in Qualcomm lawsuit with significant pricing implications\n\n3.\t⁠More leverage on pricing when deal renewals come up, including in mobile where they are already strong\n\nThese are all oversimplifications, to be clear. Pricing leverage outcomes are not figures they can bake into their forward estimates, particularly when it comes to the lawsuit. Their forward P/E may not be indicative of their future potential or market gains.\n\nMy personal view is that it’s arguably worth holding a modest position for the upside, but it certainly comes with more risk. I’m also not an expert in any of this, so I’m basically just dipping my toes in the water here…",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9cryfz/",
              "created": 1718825652,
              "depth": 2,
              "replies": [
                {
                  "id": "l9dg3i5",
                  "score": 2,
                  "body": "Why do they have pricing leverage? The threat from royalty free RISC-V chip designs could push companies away from ARM if they aren’t careful.  They’re definitely continuing to experiment.",
                  "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9dg3i5/",
                  "created": 1718833981,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9eu7qe",
                      "score": 2,
                      "body": "Smart phones wont be switching to RISC-V for the [foreseeable future](https://www.semianalysis.com/p/arm-and-a-leg-arms-quest-to-extract). Arm has an under appreciated moat in mobile. Switching costs are not trivial",
                      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9eu7qe/",
                      "created": 1718854326,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9flynj",
                          "score": 2,
                          "body": "Same is true for PC and Server. Windows on ARM has been a disaster. I mean even on the 3rd attempt with the latest Snapdragon Elite X, most stuff isn't working right and there is really no point to it.",
                          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9flynj/",
                          "created": 1718871194,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l9gabmu",
                              "score": 2,
                              "body": "I think one aspect that's underlooked is the potential automotive market.\n\nI work in the automotive industry, and it is being completed dominated by ARM processors. Next few years, basically all cars will run ARM",
                              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9gabmu/",
                              "created": 1718886237,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l9gajf8",
                                  "score": 1,
                                  "body": "I don't disagree, but isn't this already the case? Like I can't think of any cars which don't have ARM chips already?",
                                  "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9gajf8/",
                                  "created": 1718886338,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l9gfr4b",
                                      "score": 1,
                                      "body": "a 5 yr old low-mid level car probably doesn't. People drive cars for more than 5 years",
                                      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9gfr4b/",
                                      "created": 1718888614,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "l9hd5il",
                              "score": 1,
                              "body": "I’m not really taking a side with my prior comments, but I don’t really think the PC market or the hyped AI PCs are very exciting. Arm’s datacenter potential is more intriguing to me, personally.\n\nAs for the new Snapdragons… are they even out yet? I feel like these are just generic reviews. Either way, AI PCs are going to be pretty underwhelming for awhile, so I don’t totally disagree",
                              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9hd5il/",
                              "created": 1718900412,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l9hh6hd",
                                  "score": 1,
                                  "body": "I dunno. I feel like the general public can be easily impressed by the AI PC features, but I do agree, it's a big IF. Because it depends on how Microsoft implements it. A lot of people are excited about Apple's \"Apple Intelligence\" for instance.\n\nI feel like ARM in server is kind of a dead end. The reason I say this is that ARM basically has no advantage over AMD's offerings. \n\nParticularly telling was this slide from Computex for instance: https://i.imgur.com/vm3qyEC.png\n\nIf companies like Amazon are choosing AMD's Epyc over their own Graviton that's basically a huge sign that ARM isn't really panning out like the way they thought it would.\n\nAnd we already knew this, when it comes to multi threaded efficiency x86 chips have an edge thanks to SMT. \n\nAnd Intel also with their new Skymont architecture, is basically making small ARM like cores. So whatever opening was there, is closing.",
                                  "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9hh6hd/",
                                  "created": 1718901712,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l9oqp0q",
          "score": 2,
          "body": "Picks and shovels make for good picks and shovelloads of money",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9oqp0q/",
          "created": 1719010795,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9deht7",
          "score": 1,
          "body": "Intel isn’t end of line for AI, and they’re listed.  Not all the semi’s will be winners in this space.",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9deht7/",
          "created": 1718833391,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb5rmz6",
          "score": 1,
          "body": "What do you think of QCOM?",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/lb5rmz6/",
          "created": 1719856419,
          "depth": 1,
          "replies": [
            {
              "id": "lb60apg",
              "score": 1,
              "body": "Same bullishness!",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/lb60apg/",
              "created": 1719859234,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9co9qt",
          "score": 2,
          "body": "Soon enough NVDA will be added to that list",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9co9qt/",
          "created": 1718824404,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9dcoaz",
          "score": -2,
          "body": "To be fair, ARM is doing well because of delta hedging.\n\nUpdate: look at that.. we are now well beyond a -10% correction, right after options expiration time. Guys you need to study instead of downvoting, you're all playing with fire here.",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9dcoaz/",
          "created": 1718832735,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9atc2h",
      "score": 114,
      "body": "Other than Tesla, all the big AI players have done well - the magnificent 7 or whatever. Even Apple has been hot finally. Meta took a step back on their last earnings and have almost fully recovered. Microsoft, Amazon, Google have been great. Nvidia unstoppable. \n\nMaybe they are referring to smaller AI plays.",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9atc2h/",
      "created": 1718800742,
      "depth": 0,
      "replies": [
        {
          "id": "l9avom4",
          "score": 46,
          "body": "They’re referring to anyone not in the Mag 7. Mag 7 are the only ones with immediate AI revenue that is today growing and so are valued on earnings not on AI hype. They’re the only ones I’m investing in",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9avom4/",
          "created": 1718801766,
          "depth": 1,
          "replies": [
            {
              "id": "l9azejs",
              "score": 54,
              "body": "The Mag 7 are definitely being valued on AI hype too lol.",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9azejs/",
              "created": 1718803329,
              "depth": 2,
              "replies": [
                {
                  "id": "l9bpp24",
                  "score": 6,
                  "body": "About $1.5 trillion per, apparently",
                  "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9bpp24/",
                  "created": 1718812771,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l9ukc1p",
                  "score": 1,
                  "body": "They’re ranging from 25 to 38 PE ratio. That’s typically where they’re valued. Their earnings are increasing incredibly fast. How do you see them as overvalued?\n\nTesla is the highest PE at 45",
                  "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9ukc1p/",
                  "created": 1719108960,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l9b0dry",
              "score": 12,
              "body": "SMCI and VRT seem to have had solid 2024s so far.",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9b0dry/",
              "created": 1718803729,
              "depth": 2,
              "replies": [
                {
                  "id": "l9b41lq",
                  "score": 10,
                  "body": "To bring some context here, they're definitely talking about how software stocks have not benefitted.  \n\n\nMag 7 ex TSLA, semiconductors, and data center related stuff has been successful.",
                  "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9b41lq/",
                  "created": 1718805174,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9b8usu",
                      "score": 1,
                      "body": "Thanks for clarifying that",
                      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9b8usu/",
                      "created": 1718806972,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l9bv0wy",
                  "score": 8,
                  "body": "Yeah $VRT is killing it.  They provide infrastructure and cooling do data centers, and are official partners of NVIDIA.  They will continue to thrive.",
                  "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9bv0wy/",
                  "created": 1718814575,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9ddpe4",
                      "score": 1,
                      "body": "So I SMCI and Dell, what’s so unique about VRT",
                      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9ddpe4/",
                      "created": 1718833105,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9dihoe",
                          "score": 3,
                          "body": "Vertiv is in a league of their own right now in terms of thermal management, and as data centers get more and more demanding as more powerful chips come out, they will be more and more in demand.\n\nhttps://www.vertiv.com/en-emea/products-catalog/thermal-management/\n\nEDIT: Here is a recap of their Q1 earnings as well https://investors.vertiv.com/financial-news/news-details/2024/Vertiv-Reports-60-Organic-Orders-Growth-8-Net-Sales-Growth-in-First-Quarter-Updates-Full-Year-2024-Outlook/default.aspx",
                          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9dihoe/",
                          "created": 1718834880,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l9dllcz",
                              "score": -1,
                              "body": "I don’t see how that is different at all to https://www.supermicro.com/en/solutions/liquid-cooling from competitors who can do it cheaper and faster",
                              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9dllcz/",
                              "created": 1718836074,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l9dnp6x",
                                  "score": 3,
                                  "body": "I admittedly have not read up on SMCI in a quite a bit, but from what I remembered I was not overly impressed with their model in regards to liquid cooling solutions.  With that said though, any company that can offer quality liquid cooling solutions for data centers should be incredible over the next decade.\n\nNVIDIA announced that liquid cooling will be required for running the most powerful configuration of Blackwell.  As the industry continues to grow, the demand for these solutions will be unreal.",
                                  "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9dnp6x/",
                                  "created": 1718836891,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l9b5ypr",
                  "score": 5,
                  "body": "Dell and hpe as well",
                  "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9b5ypr/",
                  "created": 1718805898,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l9bis2r",
              "score": 3,
              "body": "AI has comparable revenue to the entire organisation of subway, the valuation is all hype for everyone, investors just expect the Mag 7 to actually deliver instead of just AI-washing",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9bis2r/",
              "created": 1718810439,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9dq6le",
              "score": 1,
              "body": "which mag 7 has growing AI revenue today? Outside of Microsoft with only around 2b copilot revenue this year, 1% of their annual revenue. Meta said it won't make money from AI for years. I'm obviously not counting the data center revenue, which is still technically \"picks and shovel\" and not actual AI product where people actually use it.",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9dq6le/",
              "created": 1718837853,
              "depth": 2,
              "replies": [
                {
                  "id": "l9eiy5h",
                  "score": 1,
                  "body": "Yeah not sure why you wouldn’t count data center but that’s on you. AWS, Azure, Nvidia, all are pumping AI revenue",
                  "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9eiy5h/",
                  "created": 1718849413,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9esjpo",
                      "score": 2,
                      "body": "I saw a demo of Copilot for Power BI yesterday. I was honestly impressed. Microsoft is giving it to our Power BI community for testing workspaces only, for now. We know they are going to start charging us for, probably by year end. We are told we will be competing against each other internally for production use of Copilot. \n\nI predict a year from now Microsoft will report dramatic revenue from their copilot product.",
                      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9esjpo/",
                      "created": 1718853536,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9fkipx",
                          "score": 1,
                          "body": "Thanks for sharing. Can you tell us more what impressed you in the demo?",
                          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9fkipx/",
                          "created": 1718870148,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "l9ejgkl",
                      "score": 2,
                      "body": "data centers are the AI enablers, no difference from NVDA. We're talking about the actual real usage of gen AI, what separates it from the \"hype\".\n\nIf you're just selling picks and shovels for the gold rush but there's no gold, then you're not gonna be selling picks and shovels for very long.",
                      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9ejgkl/",
                      "created": 1718849624,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9et9nu",
                          "score": 1,
                          "body": "I think Machine Learning AI will ultimately be more transformative for businesses than generative AI. I’m trying to identify the early innovators in various industries who will leap ahead of their competitors when ML can predict which business decisions will optimize their performance. (Pharma drug discovery appears to be aggressively pursuing this strategy.)",
                          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9et9nu/",
                          "created": 1718853876,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "l9uk1ca",
                          "score": 1,
                          "body": "What makes you say there’s no gold? In 3 years time the world will be flooded in gold",
                          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9uk1ca/",
                          "created": 1719108823,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l9etbcc",
              "score": 2,
              "body": "Didnt know pltr was in the mag 7",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9etbcc/",
              "created": 1718853899,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9b3akn",
          "score": 6,
          "body": "TSMC is up 76% YTD as well, hardly a small fry.",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9b3akn/",
          "created": 1718804885,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9c4nnb",
          "score": 7,
          "body": "They are referring to c3ai, pagaya, path, sound hound…",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9c4nnb/",
          "created": 1718817804,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9cfg0g",
          "score": 8,
          "body": "I don't consider Tesla a big AI player anymore.  They haven't really delivered.  Sure they delivered level 2 driving automation, but [so have Ford and GM, and all of them are behind Mercedes-Benz, which last year delivered level 3 driving automation (albeit only approved for use in CA and NV).](https://cars.usnews.com/cars-trucks/advice/tesla-full-self-driving)\n\n\nCombine that with Elon saying he won't have AI products built in Tesla unless his share of the company is increased to 25% and I don't see how they can regain an edge on competitors.  Not to mention how he's seemingly followed through with that by diverting Tesla's place in line for Nvidia AI chips from Tesla to X.",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9cfg0g/",
          "created": 1718821413,
          "depth": 1,
          "replies": [
            {
              "id": "l9cjaai",
              "score": 0,
              "body": "No one else currently comes close to Tesla FSD.  Last week I selected 'home' as a destination and it drove out of the restaurant parking lot, down multiple urban streets, and arrived in front of my house - but it doesn't know to find my driveway on the side street and enter my garage.   edit: You can search youtube for all of those manufacturers and see for yourself that they are no where near close.  Mercedes is freeway only, and only in certain conditions (i.e. close to Autopilot ~8 years ago)\n\nWaymo comes closest, but only in the few cities they have premapped/pre-modeled.\n\nMercedes is using NVIDIA Drive (hardware and software), and they will probably catch up to FSD in ~2025 with new hardware/software from NVIDIA.\n\nI can't link youtube here (the sub blocks it), but if you search YT for \"Driverless autonomous vehicle is now official in Shenzhen\" you can see deeproute.ai already using NVIDIA's system to drive like FSD in China a year ago.",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9cjaai/",
              "created": 1718822710,
              "depth": 2,
              "replies": [
                {
                  "id": "l9cvlo3",
                  "score": 5,
                  "body": "FSD may be good on a good day, but it also kills more people than others on a bad day. And it wildly overestimates its capabilities (by not restricting itself to safe operating conditions), and it is known to disengage fractions of a second before impact to make the driver liable. \n\nGenuinely happy to see it work well for you, and I am not denying its value, but in the discussion about L4/L5 driverless cars it is a Potemkin village.",
                  "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9cvlo3/",
                  "created": 1718826884,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9ewj10",
                      "score": -2,
                      "body": "> FSD may be good on a good day\n\nI forgot to mention it wasn't a good weather day - it was sprinkling\n\n> but it also kills more people than others on a bad day\n\nlol, no.  \n\n>  and it is known to disengage fractions of a second before impact to make the driver liable.\n\nalso no - it beeps to tell the driver to take over in dangerous situations.  It does not do this factions of a second before impact.  If the driver is an idiot and ignores it... they are still responsible for what the car is doing as they are being nagged to pay attention.\n\nAlso, most stories about this are about AutoPilot years ago.  It's like complaining about Windows Vista when it hasn't been used in years.",
                      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9ewj10/",
                      "created": 1718855446,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9oxyfl",
                          "score": 1,
                          "body": "I'll cut this short - that's not what I meant by a bad day, yes it does, and yes it does, and no there have not been changes that are significant.\n\nWithout telling you to do research because that is a cheap way to win a debate, I'll ask you this: Why does Tesla insist that a system they call \"Full Self Driving\" in front of the customer, is no more than Level 2 when they talk to authorities, insurances and courts?",
                          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9oxyfl/",
                          "created": 1719013782,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l9e0esj",
              "score": 0,
              "body": "Mercedes Benz is level 3... but only on some major freeways in CA and Nevada and only under 40 MPH. Ford is the same, their self driving works only on highways. Tesla has FSD working on all roads though still working out edge cases. \n\nOther then FSD, Tesla is using AI for Optimus, Megapacks and powerpacks. \n\nTesla never slowed down on AI, there wasn't any risk of Elon leaving, and back in April Elon said they had enough compute power for FSD training. People should not act as if NVDA is going to stop making AI chips. Tesla wasn't ready for them and the wait times for NVDA chips are no longer a year long. \n\nNext couple of years are going to be fun for Tesla investors.",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9e0esj/",
              "created": 1718841889,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9dn52m",
          "score": 2,
          "body": "Their share price has done well, but none of the companies have demonstrated any actual benefit to shareholders from their AI products, other than Nvidia and cloud providers like Microsoft selling hardware/leasing hardware. \n\nThe main problem is very few companies have actually demonstrated a value add from AI... most of the time it just takes an existing product/service, and makes it worse and more expensive. Amazon Go flopped because the AI required far more labor for humans to manually review the AI's output than a traditional store(plus the hardware costs), self driving taxis are just as expensive as traditional taxis while they aren't profitable for the company themselves, AI drive throughs have flopped at every restaurant that's tried it.\n\nAs long as Nvidia is charging 5 figures for their AI chips, AI's is not economical to deploy at scale as a cost saving measure.\n\nPretty much the only actual value-add AI I've seen has been generative AI used for entertainment, ChatGPT, and of course research. But even then, consumers have lost interest in these products very quickly after their novelty wears off, and they are still very unprofitable to run.",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9dn52m/",
          "created": 1718836671,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9chuqp",
          "score": 1,
          "body": "Tesla hasn't delivered.  Their Dojo super computer was supposed to make them a player in delivering AI compute, but they are buying more NVIDIAs than ever.  \n\nAnd the CEO created a new AI company called x.ai, and doesn't want to develop AI at Tesla unless the Board gives him more stock (to get him back to 25% voting rights).  x.ai has hired AI talent away from Tesla.",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9chuqp/",
          "created": 1718822225,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9beihs",
          "score": -10,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9beihs/",
          "created": 1718808969,
          "depth": 1,
          "replies": [
            {
              "id": "l9bfnyw",
              "score": -1,
              "body": "Yeah I’m interested to see how Tesla AI plays out. \n\nFeels like everyone wants to see it first. Elon has over spoken on Tesla targets so many times, the CEO that cried wolf.",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9bfnyw/",
              "created": 1718809367,
              "depth": 2,
              "replies": [
                {
                  "id": "l9bpzz8",
                  "score": 1,
                  "body": "It’s too bad that he redirected all those GPUs from Tesla to xAI, so we’re going to have to wait to see what they do with “AI.”",
                  "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9bpzz8/",
                  "created": 1718812873,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9bw4e2",
                      "score": -1,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9bw4e2/",
                      "created": 1718814948,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9bwcue",
                          "score": 0,
                          "body": "You’re saying this is misinformation? Do you have any sources? I do.\n\nhttps://www.cnbc.com/amp/2024/06/04/elon-musk-told-nvidia-to-ship-ai-chips-reserved-for-tesla-to-x-xai.html\n\nhttps://arstechnica.com/cars/2024/06/elon-musk-is-diverting-teslas-gpus-to-x-xai-nvidia-emails-say/",
                          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9bwcue/",
                          "created": 1718815029,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l9bperj",
              "score": -4,
              "body": "Very true, self driving in Tesla or whoever else comes up with it is the only AI tech I actually see myself using daily.",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9bperj/",
              "created": 1718812674,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9avvy2",
      "score": 24,
      "body": "Just saying AI isn’t enough for investors?",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9avvy2/",
      "created": 1718801854,
      "depth": 0,
      "replies": [
        {
          "id": "l9clcxj",
          "score": 18,
          "body": "> AI\n\nI'd like to buy 5% of your comment for 5 trillion dollars.",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9clcxj/",
          "created": 1718823410,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9bwp8d",
          "score": 1,
          "body": "No, but saying cannabis in addition to AI will still work. People lit the pipes during tough times.",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9bwp8d/",
          "created": 1718815145,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9aow0l",
      "score": 27,
      "body": "\"Arnott stressed that he was a believer in the long-term impact of AI, but said **“a lot of the benefits are going to come gradually, and the market is pricing in immediacy”.**\n\nI don't disagree with this and if it becomes more of an issue, things will get interesting. \n\n\"But the recent declines for dozens of stocks that had benefited from the early enthusiasm suggest that investors are starting to look past optimistic commentary if the companies cannot back up their claims.\"\n\nMDB a big example of this, as well SNOW.\n\nI definitely don't agree with article title that most stocks hyped as AI winners have fallen this year, but I do think you're getting to the point where anything hyped as participating in AI that isn't - *or won't materially be for another year or three* - is having a reset to varying degrees: from major (software; SNOW/MDB/etc) to more moderate (people were betting for a while earlier this year as if AMD would more materially catch up to NVDA but that has come off.)",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9aow0l/",
      "created": 1718798659,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9dm4l5",
      "score": 15,
      "body": "If Nvidia's customers are failing to produce a ROI on their AI investments, why does Wall Street think that Nvidia's sales will continue to grow for the next decade? The whole reason companies are buying Nvidia's products is because they think AI will save them money or make them more money... if neither of these things turn out to true, then who will buy their products?",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9dm4l5/",
      "created": 1718836279,
      "depth": 0,
      "replies": [
        {
          "id": "l9fhcs0",
          "score": 4,
          "body": "Wall Street doesn't. Wall street bets are buying like that will happen but they are just buying because it went up and are betting it will go up more.\n\nThe way this reported obfuscates the insanity:\n\"NVDA grows to become bigger than MSFT\". \n\nNo they didn't. \n\n\"Some chump pays $140 for a claim on NVDA earnings that amounts to about $2 a year if they can sustain current bubble-driven profits\" would be more accurate.",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9fhcs0/",
          "created": 1718867886,
          "depth": 1,
          "replies": [
            {
              "id": "l9g6iap",
              "score": 0,
              "body": "Someone’s salty they don’t own nvda",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9g6iap/",
              "created": 1718884395,
              "depth": 2,
              "replies": [
                {
                  "id": "l9g9q56",
                  "score": 6,
                  "body": "This is how it works every time.  \nAnyone who stands apart saying it is foolish gets mocked by the participants with paper fortunes.",
                  "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9g9q56/",
                  "created": 1718885957,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l9h32we",
          "score": 2,
          "body": "How will AI not make corporations more efficient?",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9h32we/",
          "created": 1718897068,
          "depth": 1,
          "replies": [
            {
              "id": "l9h88wn",
              "score": 5,
              "body": "1. Reliability and training cost. AI is only as good as its training inputs. If your AI is trained on data scraped from the internet, which is filled with trolls, misinformation, etc, it's going to be unreliable. We've already seen a lot of cases of chat bots getting companies into legal trouble because they make things up. The only way to get reliable training data is to pay people to build a model yourself, which is very expensive, and even then, performance is not guaranteed. So quite often, human reviewers are needed to verify the quality of AI outputs.\n\n2. Cost of the AI chips themselves. Nvidia is charging $30,000-40,000 for a single H100. You need a tremendous amount of these to build an AI model or to deploy it at scale. Then consider, they intend to come out with new AI chips every year.  So companies are spending Billions buying these chips, and will just need to replace them every 1-2 years to stay competitive.\n\nAs a result, the cost of deploying an AI solution is substantially more expensive than just outsourcing the job overseas, or even just hiring people locally to do the task.\n\nI still think AI will eventually take off and make companies more efficient, but it will because prices of AI chips will come down. Cutting edge technology is always expensive, especially when competition is limited. When Nvidia starts facing more competition from AMD and others, or when demand for AI chips slows down such that Nvidia no longer has a backlog, prices WILL come down. And that's what will finally make AI economical.\n\nWhat Nvidia has is a temporary windfall- they are making a fortune from the start of the AI arms race. These margins will not last forever, so the stock shouldn't be priced at 80x earnings.",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9h88wn/",
              "created": 1718898786,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9bbmm2",
      "score": 12,
      "body": ">Most of the stocks that were caught up in last year’s hype around artificial intelligence have fallen this year, **suggesting that investors are increasingly trying to separate the wheat from the chaff among companies claiming to be beneficiaries of the AI trend.**\n\nNo. Funds are trying to make money and will ride the waves pulling money out of whatever isn't working and putting money into what is. Retail is known for it's trend following behavior so again they will pull money out of whatever isn't working and put money into what is. This is not a \"quality assessment\". \n\n>Arnott stressed that he was a believer in the long-term impact of AI, but said “a lot of the benefits are going to come gradually, **and the market is pricing in immediacy”.**\n\nNo. The participants are simply taking the free money. You literally can just buy these things and hold them for 6 months and make money. You do not have to do any work or analysis. As long as everyone agrees that it's not foolish the price will rise. Who will be the last fool and when will they emerge? No one cares as long as the music doesn't stop.\n\nThe market is looking at reality, saying, \"This shouldn't be happening, economy is not great atm.\" and saying, \"Well, take what's given.\" They even named their golden calf. M7 or whatever.",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9bbmm2/",
      "created": 1718807964,
      "depth": 0,
      "replies": [
        {
          "id": "l9etj05",
          "score": 2,
          "body": "Economy is not great? Lmao you are a funny one",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9etj05/",
          "created": 1718854000,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9csl7j",
      "score": 13,
      "body": "Salesforce, Snowflake, Intel, Adobe.. why tf did anyone think these would be AI winners?\n\nSalesforce is a CRM. It requires a human customer and a human to manage the relationship..\n\nAdobe is getting absolutely ravaged by AI. Why pay for generic stock photos and spend hours photoshopping something when you can tweak a prompt in seconds and have Midjourney generate exactly what you want?\n\nIntel is clearly the loser who’s way too far behind to catch up any time in the next decade. \n\nSnowflake is scrambling to implement AI before they lose market share to another new startup. Data analytics are getting easier than ever now that we can train our own LLMs on local machines.",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9csl7j/",
      "created": 1718825868,
      "depth": 0,
      "replies": [
        {
          "id": "l9dklk4",
          "score": 3,
          "body": "lol because those are the “hot names” out there that people always try to parrot since it’s in their bags.",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9dklk4/",
          "created": 1718835690,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9b2wo2",
      "score": 17,
      "body": "NVDA 200",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9b2wo2/",
      "created": 1718804734,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9aq7jh",
      "score": 6,
      "body": "The flood raises all the boats",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9aq7jh/",
      "created": 1718799298,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9d9hbo",
      "score": 3,
      "body": "Lots of normal companies jumped on the bandwagon to span the AI button. The companies that are actually in the AI biz are doing great",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9d9hbo/",
      "created": 1718831600,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9bz59u",
      "score": 5,
      "body": " the US stock market is being driven by speculative hype = duhh",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9bz59u/",
      "created": 1718815967,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9bvcze",
      "score": 5,
      "body": "That's why you buy the guy selling the shovels, not digging around and hoping for gold, the claims are already taken.",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9bvcze/",
      "created": 1718814687,
      "depth": 0,
      "replies": [
        {
          "id": "l9fhitu",
          "score": 1,
          "body": "Yeah, but don't overpay for that guy.",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9fhitu/",
          "created": 1718868001,
          "depth": 1,
          "replies": [
            {
              "id": "l9fi2fr",
              "score": 1,
              "body": "Everyone is overpaying Nvidia, that's why they are worth so much :)",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9fi2fr/",
              "created": 1718868384,
              "depth": 2,
              "replies": [
                {
                  "id": "l9fk5xt",
                  "score": 1,
                  "body": "How much they are worth depends on how long they keep being overpaid.",
                  "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9fk5xt/",
                  "created": 1718869889,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l9c3wfj",
      "score": 2,
      "body": ">that investors are increasingly trying to separate the wheat from the chaff among companies claiming to be beneficiaries of the AI trend.\n\nIn order to do this, one needs to know what the wheat looks like, and what the chaff looks like.\n\nThe situation is closer to a botanist being teleported to an alien planet teeming with strange life and trying figure out what it is he is looking at.",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9c3wfj/",
      "created": 1718817552,
      "depth": 0,
      "replies": [
        {
          "id": "l9cklv4",
          "score": 2,
          "body": "Maybe they should ask ai for help with that lol",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9cklv4/",
          "created": 1718823157,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9cadd8",
      "score": 2,
      "body": "What do you think the next buzz term will be to drive stock valuations for no name company's? \n\nMy opinion will be something along the lines of \"quantum energy\" or something. For company's that are developing essentially free energy using some new break through method in science that hasnt been completely validated. Kinda like nuclear but maybe something a little different.",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9cadd8/",
      "created": 1718819706,
      "depth": 0,
      "replies": [
        {
          "id": "l9cko3q",
          "score": 6,
          "body": "Robotics",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9cko3q/",
          "created": 1718823179,
          "depth": 1,
          "replies": [
            {
              "id": "l9cnipc",
              "score": 0,
              "body": "Yes, an automated workforce would save lots of money. AMZN is almost halfway there it seems",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9cnipc/",
              "created": 1718824150,
              "depth": 2,
              "replies": [
                {
                  "id": "l9cnzlc",
                  "score": 1,
                  "body": "There’s a new Amazon hub in LA that is half robots\n\nIf a worker drops an item in a robot traffic area, they have to call a supervisor.  It’s happening.",
                  "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9cnzlc/",
                  "created": 1718824308,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l9dp1wh",
      "score": 2,
      "body": "Yeah nvidia, apple, and miscrosft are really struggling lol",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9dp1wh/",
      "created": 1718837413,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9atg7h",
      "score": 5,
      "body": "I'd say it's more like separating the rocks from the chaff. There's no wheat there with value other than the fertilizer Nvidia is selling to you.",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9atg7h/",
      "created": 1718800794,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9cbmnp",
      "score": 1,
      "body": "This is why it's important to understand the difference between blue ocean and red ocean sectors.",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9cbmnp/",
      "created": 1718820124,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9cixx5",
      "score": 1,
      "body": "Correct me if I’m wrong but isn’t AI technically already priced in to most industry leaders?",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9cixx5/",
      "created": 1718822592,
      "depth": 0,
      "replies": [
        {
          "id": "l9dk9rv",
          "score": 4,
          "body": "The markets understanding of AI is priced in. Those aren’t necessarily the same things",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9dk9rv/",
          "created": 1718835564,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9et621",
      "score": 1,
      "body": "Like with any movement in the market you’ll have winners and losers. During the pandemic we had the vaccine companies and all the players for masks and cleaning supplies etc. money just moves to different sectors.",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9et621/",
      "created": 1718853828,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9f76tu",
      "score": 1,
      "body": "This is an interesting market where the hardware market (i.e. NVDA) is growing well ahead of the software market. Many of the GPUs are being bought by the large cap cloud players to offer AI-enabled services (reflected in the capex spend). Many of these AI solutions do deliver value but the question of whether the hype has surpassed demand is a valid question. What are the use cases where folks have seen AI deliver significant value vs the current standard?",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9f76tu/",
      "created": 1718861325,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9fdreb",
      "score": 2,
      "body": "PLTR",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9fdreb/",
      "created": 1718865448,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9g5vd1",
      "score": 2,
      "body": "ASML still wins",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9g5vd1/",
      "created": 1718884078,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9e1aje",
      "score": 1,
      "body": "CRM and ADBE are high-quality companies with long-term bull cases. SNOW's price is depressed, the valuation is not cheap, their SBC is egregious, and DataBricks is emerging competition. SNOW also has 128% revenue retention, revenue grew 34% YoY, Snowflake Marketplace Listing is up 35% YoY, $1M+ customers grew 30% YoY.  They have a new CEO and I am convinced they are sandbagging guidance to ensure beats. Intel has executed so poorly over the last decade -- their poor stock performance should not be a surprise.",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9e1aje/",
      "created": 1718842246,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9apxd8",
      "score": -11,
      "body": "Either I'm a genious investor who just happened to pick all winners, or this article is bs.",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9apxd8/",
      "created": 1718799162,
      "depth": 0,
      "replies": [
        {
          "id": "l9au35k",
          "score": 10,
          "body": "?\n\nThis article is mainly stating easily proven, objective facts:\n\n> more than half the stocks included in Citi’s “AI Winners Basket” — an index based on the names that were garnering the most excitement among the bank’s clients last year — have declined.\n\n...\n\n> More than half of the individual stocks in BlackRock’s Robotics and Artificial Intelligence ETF, Invesco’s AI and Next Gen Software fund, and First Trust and Nasdaq’s Artificial Intelligence and Robotics ETF have declined this year.",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9au35k/",
          "created": 1718801075,
          "depth": 1,
          "replies": [
            {
              "id": "l9b1yt7",
              "score": 1,
              "body": "Well, sure. But have you checked the holdings in these ETFs that are mentioned?  \n\nNasdaq's ETF (ROBT) has mostly no-name (or no big hitter) companies. The top 10 holdings account for 20% of the ETF holdings. The ETF value has fluctuated massively in the past years and is actually only +7% up since inception (2019 I think).  \n\nInvesco's ETF (IGPT) has >60% of its portfolio in the top 10, and all are big names in the industry (including Google, NVIDIA, Meta, etc.). However, even with \"more than half of the stocks declining\", the ETF is up 10% since 2019 and 30% since last year.  \n\nDiversity in ETF holdings is important.",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9b1yt7/",
              "created": 1718804361,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9e23lo",
      "score": 0,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9e23lo/",
      "created": 1718842573,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9date5",
      "score": -4,
      "body": "The leader in AI, GOOG/GOOGL, is up 26% so far this year.    But I expect to see a ton more over the next decade.\n\nAI is going to be a lot bigger than even the Internet.",
      "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9date5/",
      "created": 1718832071,
      "depth": 0,
      "replies": [
        {
          "id": "l9ddrmb",
          "score": 11,
          "body": "Google is the leader in AI as much as IBM is the leader in home computing.",
          "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9ddrmb/",
          "created": 1718833127,
          "depth": 1,
          "replies": [
            {
              "id": "l9e0pqo",
              "score": 1,
              "body": "Noting that we can easily source answers via a ChatGPT etc UI, I struggle with trying to understand how their core ad business / search is not going to feel pain in the very near future, as these AI tools become ubiquitous.",
              "permalink": "/r/stocks/comments/1djh7bs/most_stocks_hyped_as_winners_from_ai_boom_have/l9e0pqo/",
              "created": 1718842013,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "stockTickers": {
    "post_summary": "Most stocks hyped as winners from the AI boom have fallen this year, with Nvidia's value doubling amid growing debates on speculative hype.",
    "companies": [
      "Nvidia",
      "Citi",
      "BlackRock",
      "Invesco",
      "First Trust",
      "Nasdaq",
      "Edward Jones",
      "Salesforce",
      "Snowflake",
      "Intel",
      "Adobe",
      "Research Affiliates"
    ],
    "tickers": [
      "NVDA",
      "S&P 500"
    ],
    "main_ticker": [
      "NVDA"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Most stocks hyped as winners from AI boom have fallen this year, with Nvidia being an exception due to its strong financial performance.",
    "stock_recommendations": "The user is not explicitly recommending buying or selling any specific stocks.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": null,
    "sentiment_summary": "There is a neutral sentiment as the post discusses the variability in stock performance related to AI without recommending specific stock actions.",
    "sentiment": "neutral"
  }
}