{
  "title": "Scenarios: Stock market crash",
  "score": 31,
  "selftext": "The US equities have performed phenominally on the back of strong earnings from AI/tech related stock. \n\nAI is still in infancy and presents myraid of opportunities to boost productivity and reduce costs.\n\nWhile the S&P 500 and Nasdaq are at All Time High, I personally believe that there is still significant growth ahead [ ofcourse punctuated with some corrections and pull backs].\n\nTo remove any ambiguity, I am referring to stock market crash as 30% or more drop in the S&P 500 index [broader market and not any specific stock or sector].\n\nThese are hypothetical scenarios [for readers' benefit and enjoyment] and not a forecast or prediction.\n\nHere are few of the scenarios that may trigger stock market crash [someday in the future]:\n\nStagflation: 2 or more quarter of slower or negative growth, high unemployment, along with persistent inflation.\n\nRegional Banking Crisis: failure of 3, 4 or more regional banks in a short period of time [1 week] and the loss of confidence in the financial markets in the aftermath.\n\nGeopolitical crisis: Examples, War in the Taiwan straits, India-China border clash, Collapse of Ukrain as a state, Israel strike on Iranian targets etc.\n\nFailure of AI/GAI driven business models to generate returns: in part this is the most likely scenario. Several companies have hitched to AI/GAI bandwagon but in winner takes all setup: most companies are likely to be left behind. For the moment, investors have generously opened purse strings to invest in companies touting AI/GAI credentials. \n\nDecline in consumer spending in a persistent high interest rate environment: a severe slowdown in consumer spending will have a chilling effect on the bottom lines of companies which may trigger mass sell off as investor rush to safety of defensive assets like bonds, gold etc.\n\n",
  "link_flair_text": "Discussion",
  "id": "1djzmhv",
  "num_comments": 49,
  "created_utc": 1718846616,
  "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/",
  "comments": [
    {
      "id": "l9ec2no",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 78 | **Previous Best DD** | \n**Account Age** | 1 month | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9ec2no/",
      "created": 1718846618,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9efqjv",
      "score": 21,
      "body": "Consumers will be gone because AI take over",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9efqjv/",
      "created": 1718848123,
      "depth": 0,
      "replies": [
        {
          "id": "l9eoomh",
          "score": 14,
          "body": "AI: Look at me, I am the consumer now.",
          "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9eoomh/",
          "created": 1718851809,
          "depth": 1,
          "replies": [
            {
              "id": "l9ez4fv",
              "score": 2,
              "body": "Tell us, what does AI consume?",
              "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9ez4fv/",
              "created": 1718856772,
              "depth": 2,
              "replies": [
                {
                  "id": "l9f9q14",
                  "score": 9,
                  "body": "NVDA chips -> stocks will go up even more",
                  "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9f9q14/",
                  "created": 1718862866,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9qf3qa",
                      "score": 1,
                      "body": "nooo. you will lose all your money on nvda calls",
                      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9qf3qa/",
                      "created": 1719040869,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l9fm5or",
                  "score": 3,
                  "body": "Microcontrollers and Energy. Literally.",
                  "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9fm5or/",
                  "created": 1718871332,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l9ecr4x",
      "score": 32,
      "body": "![img](emote|t5_2th52|27189)\n\nThere will be pullbacks, and I can already hear the screeches of “VIN! DI! CATION!!!” from 🌈🐻 only to have their hopes and dreams smashed by giant green dildos.",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9ecr4x/",
      "created": 1718846895,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9f7v4y",
      "score": 8,
      "body": "The present is so dotcommy while also being very Seventies-staglationary while also being very, very pre-\\[Mortgage crash\\]-y.  I would, at the very least, hedge my bets.\n\nSpeaking for myself, I hold only three stocks and am more invested in treasury bonds and the Vanguard bond fund.\n\nThe sweater has already begun unraveling from the bottom.",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9f7v4y/",
      "created": 1718861733,
      "depth": 0,
      "replies": [
        {
          "id": "l9g03xs",
          "score": 4,
          "body": ">The sweater has already begun unraveling from the bottom.\n\nOh yes, check McD's earnings if anyone is in doubt. Poor people are in trouble with the new inflated prices.",
          "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9g03xs/",
          "created": 1718880948,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9ei77j",
      "score": 12,
      "body": "Good write up.  I was going to pull out a couple of bullet points and make notes but as I was typing I started to realize that most of these points are interconnected.\n\nI don't think we'll run into stagflation - at least not 70's / 80's stagflation but I think we'll see a slow down of GDP growth due to point #3 - consumer spending habits.  Consumers drive \\~2/3rd of total GDP and the numbers aren't looking great for consumer credit -- https://fred.stlouisfed.org/series/RCCCBBALDPD30P.  If the consumers are hurting then businesses will be hurting so they cut hiring, so people spend less, etc, etc. until the money printer gets turned back on and rates get cut.\n\nEventually I'm optimistic we create some amazing software applications resulting from the increase in GPU and LLM capacities but I don't think we're there yet and won't be there for another decade+.  Big tech has so much cash on hand they're going to continue dumping money into data centers so I doubt the lack of monetization will precipitate a crash.  NVDA will have to prove their value by sustaining high growth and their ridiculous margins which I think will be tough.  Once we get AGI then it's a winner take all potential skynet scenario\n\nThat being said - full steam ahead.  I don't know what good news we'll see over the next couple of months before earnings but I think it's safe to ride the trend up until we get bad news (unemployment, war, sentient AI, etc)  I'll get nervous when consumer discretionary companies start doing poorly - e.g. Booking, THD, etc.  Unemployment is also ticking up slightly but still low historically.",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9ei77j/",
      "created": 1718849112,
      "depth": 0,
      "replies": [
        {
          "id": "l9g5ay7",
          "score": 1,
          "body": "Dividend growth on big tech will remain limited due to all the potential over investment in AI. It is not recognized in EPS metric, since its capex spending.\nIt will matter alot.",
          "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9g5ay7/",
          "created": 1718883792,
          "depth": 1,
          "replies": [
            {
              "id": "l9gzkx1",
              "score": 2,
              "body": "Yea but as revenues and earnings are growing no one gives a shit about their dividend yields.  Look at NVDA and Goog yields and their return over time.  \n\nEventually... eventually they'll have to return value to shareholders but right now they're just buying back shares and investing in their core business.  I think the other Mag 7 are stupidly transferring wealth to NVDA by spending so much on CapEx but these companies have very smart people so maybe they're right and it's all worth it in the end.",
              "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9gzkx1/",
              "created": 1718895892,
              "depth": 2,
              "replies": [
                {
                  "id": "l9h0n9i",
                  "score": 2,
                  "body": "Yeah, its circular. Cash flowing from Mag 7 to NVDA, which then receives a 50+ multiple on valuation\n\nI wouldn't count on the smartness of these guys since it's an overcrowded trade at the moment. You basically have no choice but to follow.. just listen in to some of these CEO's take on AI. There is NO big insight here, it's all shooting in the dark",
                  "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9h0n9i/",
                  "created": 1718896253,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9h65cm",
                      "score": 2,
                      "body": "I know it just trying to be optimistic.  I work in non-FAANG tech (profitable though) and we're pushing our own Gen AI in earnings calls.  Which I think can actually have a huge impact but our fucking engineers can barely build OCR tech and you're telling me that they're going to come up with a system that's way more complicated in a short period of time?\n\nGoog has the best AI program IMO.  What they've done with the Deepmind system is impressive.  MSFT is also in a good position based on their acquisition of openAI.  I just don't think we're anywhere near realizing or capturing the benefits of AI as a whole.  But working with some of these companies I know they're still spending on data centers for the time being but I agree it's not efficient but they have to do it cause that's what's pumping stock prices - AI, AI, AI\n\nAlso think back to when META was getting absolutely roasted for spending 5b on the metaverse that was like 2 years ago and their stock lost 80% then regained it all lol.  Times have been weird lately",
                      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9h65cm/",
                      "created": 1718898088,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9hb6ae",
                          "score": 2,
                          "body": "100%. Will butst but timing is key to make decent money here on the market plays. Extremely difficult to time\n\nOnly way i can think of: Shorting USD against other currencies (JPY, Euro) with enough leverage could work, since one can carry that trade with reasonable cost",
                          "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9hb6ae/",
                          "created": 1718899763,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l9feobz",
      "score": 6,
      "body": "Bold prediction incoming- The AI bubble will be bigger than the dot-com bubble. I’ll sell when Schiller PE reaches a new ATH. ",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9feobz/",
      "created": 1718866057,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9efodh",
      "score": 23,
      "body": "Markets will NEVER go down again. This is a new paradigm",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9efodh/",
      "created": 1718848099,
      "depth": 0,
      "replies": [
        {
          "id": "l9ffmi6",
          "score": 1,
          "body": "Markets will crash when the AI bubble pops, don’t know when, not buying puts",
          "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9ffmi6/",
          "created": 1718866695,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9eh27u",
          "score": -6,
          "body": "top is in",
          "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9eh27u/",
          "created": 1718848656,
          "depth": 1,
          "replies": [
            {
              "id": "l9ehnop",
              "score": 11,
              "body": "your moms top is off",
              "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9ehnop/",
              "created": 1718848895,
              "depth": 2,
              "replies": [
                {
                  "id": "l9fzwc3",
                  "score": 1,
                  "body": "Always has been 🌏👨‍🚀🔫👨‍🚀🌌",
                  "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9fzwc3/",
                  "created": 1718880825,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l9elwwn",
      "score": 9,
      "body": "Stocks only go up bro",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9elwwn/",
      "created": 1718850646,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9fjerv",
      "score": 4,
      "body": "A stock market crash will happen if earnings shit the bed. Inflation and higher interest rates are good for tech stocks because they're the ones charging more and they're generating return off of the interest rates because they're cash flow Kings. This comes at the expense of other companies, but since they're such a big component of the indexes, they'll drive it higher.",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9fjerv/",
      "created": 1718869340,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9ffvwi",
      "score": 3,
      "body": "keep your stocks, keep cash to buy when crash happens, keep some other cash off markets no matter what. \nsleep well.",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9ffvwi/",
      "created": 1718866870,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9fg6du",
      "score": 3,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9fg6du/",
      "created": 1718867067,
      "depth": 0,
      "replies": [
        {
          "id": "l9fgbfw",
          "score": 0,
          "body": "One may argue that AI is a concept and not a feature. We can go as granular & nebulous our bioenergy powered brain cells can go.",
          "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9fgbfw/",
          "created": 1718867163,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9etehj",
      "score": 4,
      "body": "[removed]",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9etehj/",
      "created": 1718853940,
      "depth": 0,
      "replies": [
        {
          "id": "l9ewr7o",
          "score": 3,
          "body": "AI is here to stay? ai isnt even remotely established. where are the 10, 100b ai driven companies, projects etc? its pretty pure speculation off the back of flashy but not all that useful LLMs.",
          "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9ewr7o/",
          "created": 1718855558,
          "depth": 1,
          "replies": [
            {
              "id": "l9exq5u",
              "score": 3,
              "body": "[removed]",
              "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9exq5u/",
              "created": 1718856041,
              "depth": 2,
              "replies": [
                {
                  "id": "l9f0qyw",
                  "score": 2,
                  "body": "Yes this exactly. \n\nIt’s like saying eggs aren’t useful for cooking because you had scrambled eggs once and didn’t like it",
                  "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9f0qyw/",
                  "created": 1718857647,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l9fldd3",
                  "score": 1,
                  "body": "So what are the remaining ones?\n\nAnd don't share generic machine learning models use cases (like AlphaZero or AlphaFold), because they're very specialized and very different than what people think by AI (for example, LLMs are very universal, though they can't be trusted with their output).\n\nLLMs are the closest we'd get to AGI, but I highly doubt they'll ever get there.",
                  "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9fldd3/",
                  "created": 1718870768,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9i62ld",
                      "score": 1,
                      "body": "drug discovery",
                      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9i62ld/",
                      "created": 1718909804,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l9f0ivz",
              "score": 1,
              "body": "It’s literally not. LLMs are one use case of countless use cases. I could list 25 off the top of my head but I’ve done that too many times on Reddit. If you Google AI use cases then you’ll be inundated. It’s already far more engrained than you realize. And it’s barely revved up. That’s why businesses are paying billions. They already know how they want to use it. But they never had the compute before.",
              "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9f0ivz/",
              "created": 1718857523,
              "depth": 2,
              "replies": [
                {
                  "id": "l9f15tw",
                  "score": 7,
                  "body": "ive seen so many of these posts and literally never seen anyone make a long list. feel free to link a pre existing comment?\n\nI'm well aware theyre SPENDING billions. that does not mean value is materializing.",
                  "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9f15tw/",
                  "created": 1718857868,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l9g9vy1",
      "score": 2,
      "body": "Sure, great, now just tell me the day it's happening and we Gucci",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9g9vy1/",
      "created": 1718886033,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9gpsf3",
      "score": 2,
      "body": "Bad news always possible. Not sure why good scenarios aren’t highlighted as much - productivity boom, growth of new start-ups that can use Chat GPT as their own team, period of peace ☮️",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9gpsf3/",
      "created": 1718892503,
      "depth": 0,
      "replies": [
        {
          "id": "l9gtwn7",
          "score": 1,
          "body": "Positive case has been presented in one of my previous posts.",
          "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9gtwn7/",
          "created": 1718893957,
          "depth": 1,
          "replies": [
            {
              "id": "l9gue54",
              "score": 2,
              "body": "I see now - thanks for directing me! Solid 🤝",
              "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9gue54/",
              "created": 1718894126,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfvazuy",
      "score": 2,
      "body": "Fed pivot. Once fed starts dropping rates we are hosed. Right now on Reddit everything seems rosey and people buying dips. That is when u should be on edge. Reddit getting too bullish and brash.",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/lfvazuy/",
      "created": 1722457316,
      "depth": 0,
      "replies": [
        {
          "id": "lfvazvx",
          "score": 1,
          "body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/lfvazvx/",
          "created": 1722457316,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgobuv0",
      "score": 2,
      "body": "You nailed it",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/lgobuv0/",
      "created": 1722894302,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgocghh",
      "score": 2,
      "body": "Did you do this?",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/lgocghh/",
      "created": 1722894505,
      "depth": 0,
      "replies": [
        {
          "id": "lgq4r80",
          "score": 1,
          "body": "Haha, no",
          "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/lgq4r80/",
          "created": 1722919914,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9esg8c",
      "score": 2,
      "body": "One of these post again, time to buy more calls",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9esg8c/",
      "created": 1718853491,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9fqwfc",
      "score": 1,
      "body": "I'm sorry it happened to you ![img](emote|t5_2th52|4271)",
      "permalink": "/r/wallstreetbets/comments/1djzmhv/scenarios_stock_market_crash/l9fqwfc/",
      "created": 1718874767,
      "depth": 0,
      "replies": []
    }
  ]
}