{
  "title": "Dell is Building a Monstrous AI Factory Powered by NVDA for Elon’s xAI",
  "score": 90,
  "selftext": "https://gearmusk.com/2024/06/19/dell-ai-factory-xai/\n\nI’m not a musky fan, let’s make that clear first — just in case you needed another reason to buy NVDA calls.\n\nGrok is gonna continue being regarded btw, but my calls will be far expired by then, so thanks Elon! Way to grab that _6th place_ participation trophy. Think I’m kidding? Copilot/OpenAI, Meta AI, Perplexity, Gemini, Anthropic. Is it better or close to any of them? \n\nAnyway, I digress — don’t be ghey, but celebrate pride month!\n\nPositions: $156k worth of leaps (posted previously), but mainly here to collect berr tears — they’re highly precious",
  "link_flair_text": "Discussion",
  "id": "1dk063k",
  "num_comments": 60,
  "created_utc": 1718848270,
  "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/",
  "comments": [
    {
      "id": "l9eg42c",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 months ago\n**Total Comments** | 1447 | **Previous Best DD** | \n**Account Age** | 2 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9eg42c/",
      "created": 1718848276,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9eih8m",
      "score": 58,
      "body": "How monetizable is this tech? Feels like every large tech company is doing this on a massive scale. I'd do it too if I was Elon. If a bunch of people wanted to fork over $6B, why not build massive AI factories? If you succeed, you make a bunch of money. If you fail, you lose other people's money. Feels like the incentives right now for all corporate executives, investors, managers, analysts, etc. are pointing in one direction. Just invest in AI and if you fail, everyone else will probably fail as well and you won't look like a complete jackass.",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9eih8m/",
      "created": 1718849223,
      "depth": 0,
      "replies": [
        {
          "id": "l9fbxgj",
          "score": 17,
          "body": ">How monetizable is this tech?\n\nPeople keep saying \"oh AI is just chatbots\" or something similar, but there are most definitely uses for it, [like this.](https://www.materialsnexus.com/news/magnex-rare-earth-free-permanent-magnet)\n\nShould probably add a quote since people can't click on links: \n\n\" With an initial focus on magnets, Materials Nexus’ AI platform identified and analyzed over 100 million compositions of rare earth-free permanent magnet candidates that address industry challenges, such as supply chain security, cost, performance, and environmental issues.  The current industry standard permanent magnet took decades to discover and even longer to develop into the products we use today; MagNex took just 3 months to design, synthesize and test – x200 faster.  MagNex can be produced at 20% of the material cost and a 70% reduction in material carbon emissions (kg CO2/kg), compared to rare earth element magnets currently on the market. \"",
          "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fbxgj/",
          "created": 1718864253,
          "depth": 1,
          "replies": [
            {
              "id": "l9fkjud",
              "score": 17,
              "body": "But this isn't the AI people are talking about. By *AI* people mostly mean something *really intelligent*; ChatGPT for example appears to be intelligent, and the pinnacle of it would be an AGI.\n\n> People keep saying \"oh AI is just chatbots\" or something similar\n\nYour statement proves it. You're trying to use a specialized machine learning model as an example of a very different kind of AI innovating an industry.\n\nMachine learning has been used for decades and has e.g. reached superhuman performance in many video/board games. But it wasn't a universal humanoid robot with a body that played it; it was a computer that processed the game's state and its output was the next best movement. It was made for a particular game only.\n\nAs for your example: yeah we could loosely call it „AI”, but it makes people think they have a black box (like ChatGPT), which they asked (in natural language): \"Hey we need help in this industry, could you come up with some new ideas for us”, and it answered with: „Sure, let me think for a bit... .... ... I got the answer: you simply need to do this and that.”. Then people think it could be asked anything.",
              "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fkjud/",
              "created": 1718870172,
              "depth": 2,
              "replies": [
                {
                  "id": "l9gk70w",
                  "score": 6,
                  "body": "Well said. It's ridiculous the amount of people having an opinion that confuse the global and mature AI/Machine learning field with the new developments around Generative AI/LLMs. Regarding AI being used since decades: https://en.wikipedia.org/wiki/History_of_artificial_intelligence#AI_behind_the_scenes",
                  "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9gk70w/",
                  "created": 1718890401,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9hjmsd",
                      "score": 0,
                      "body": "100% agree, I've been told it was impossible to expect AI! lol...\n\n  \nBut there is a caveat. The recent AI wave does make it more available to more and more people to analyze more and more data. That makes it bigger than the internet.",
                      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9hjmsd/",
                      "created": 1718902485,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l9fj1cg",
              "score": 6,
              "body": "I agree with you at some extent. But some of the claims that I see on the industry like energy savings of 30-50% on certain industries is just stupid. Unless AI finds a way to violate thermodynamic laws, it is a meme. ON the other hand, for circuits and solid materials, AI has been used quite a bit because those materials are easier to model, thus, to predict with an AI algorithm.",
              "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fj1cg/",
              "created": 1718869075,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9fkgom",
              "score": 3,
              "body": "Can AI \"inventions\" be patented? You can use AI to cure every kind of cancer and that's neat but who fuckin cares if you can't exploit your fellow man for all of the monies?\n\n\nIt all comes back to monetization. No one wants to hear a story about making the world a better place.",
              "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fkgom/",
              "created": 1718870106,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9fce6s",
              "score": -9,
              "body": "These regards are like 2 year olds — they think the extent of existence of things is limited to what they see/know/understand ![img](emote|t5_2th52|4271) (which to these simpletons, there are only chatbots in AI’s context today).\n\nThat’s how you can easily tell we’re nowhere near the top. Most of the regards have no idea what’s about to happen in the next 5 years",
              "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fce6s/",
              "created": 1718864555,
              "depth": 2,
              "replies": [
                {
                  "id": "l9fctsl",
                  "score": 8,
                  "body": "I thought the top was when the taxi driver tells you about Nvidia which I think we passed a while back, but I prefer your take ![img](emote|t5_2th52|27189)",
                  "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fctsl/",
                  "created": 1718864837,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9fcwys",
                      "score": -5,
                      "body": "NVDA’s unlocked a new level of top — one where 80 year old grannies are talking about it — at that point, it’s only bullish ![img](emote|t5_2th52|8882)\n\nEdit: some of you really need to be force fed /s signs lol",
                      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fcwys/",
                      "created": 1718864895,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l9fkpp5",
                  "score": 2,
                  "body": "Why are you so emotional if you think your play is so good? The guy's argument is very weak, but you didn't even read it or attempted to understand it; you're happy that it was an argument *for* AI, instead of *against*. Lol",
                  "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fkpp5/",
                  "created": 1718870290,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9fty2r",
                      "score": 0,
                      "body": "No, I read it. The downvotes are fine if people disagree, but there def are regards doing the shit I just described — I’ve seen them first hand on my previous posts. People don’t understand that nvda isn’t just a GPU company anymore because they haven’t interacted with the side of things outside chatbots.\n\nAnyway, that’s all good. I’m not here to win any internet arguments with regards ![img](emote|t5_2th52|4271) Just wanted to encourage buying calls which is what I usually do by sharing news updates on nvda semi-regularly.\n\nAs for my play — think I’m doing more than fine but feel free to keep being ghey if you’d like\n\nhttps://preview.redd.it/bqckb17z7p7d1.jpeg?width=1290&format=pjpg&auto=webp&s=9849cc527d16fd3d2d3be2775a88628cc844862f",
                      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fty2r/",
                      "created": 1718876960,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9fubr9",
                          "score": 1,
                          "body": "> I’m not here to win any internet arguments with regards \n\n> Just wanted to encourage buying calls which is what I usually do by sharing news updates on nvda semi-regularly\n\nSo you don't want to spread logical and truthful arguments that validate your positions. Instead you'd rather encourage people to do the same as you so that your profit keeps growing. Got it",
                          "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fubr9/",
                          "created": 1718877225,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l9fwerm",
                              "score": 1,
                              "body": "See my post history and share one non-“logical” or “truthful” thing shared.\n\nIt’s all links to news articles and my due diligence on my own positions. And most of the time I remember to say out loud that I’m a regard and don’t treat this as blind financial advice.\n\nYou think NVDA needs me to pump it….by getting wsb poors to hop on lol?\n\nSuggesting buying in the money nvda leaps because it’s far from being over valued isn’t exactly grifting, nor some genius self-made idea. It’s far less regarded than most shit people do here anyway.\n\nI like/talk about that play because I think it has a good likelihood of printing. Not to hype up my own calls, which are doing more than fine on their own so don’t be a conspiracy fuckin regard ￼​![img](emote|t5_2th52|4271)",
                              "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fwerm/",
                              "created": 1718878627,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l9eiuph",
          "score": -11,
          "body": "I see what you’re saying — I just am way more bullish/optimistic on the use-cases than you seem to be. I’d highly recommend watching GTC and ComputeX. I don’t have the patience to lay out everything there in terms of announcements/concepts/concrete roadmaps, but the investment is more than warranted and it is very likely gonna pay off.\n\nI think what the market is seeing rn isn’t even a small glimpse of what the use-cases will emerge to be in 5 years across robotics, healthcare and auto.\n\n_For the winners. That is why it is a race to first to ____ - AGI/mass productivity/ whatever you wanna call it in their respective industries._",
          "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9eiuph/",
          "created": 1718849374,
          "depth": 1,
          "replies": [
            {
              "id": "l9ephr4",
              "score": 5,
              "body": "We have chat bots right now, slightly better than 90s ones but not by much (a bigger library is all), and you think there’s a race to AGI or useful tech?",
              "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9ephr4/",
              "created": 1718852154,
              "depth": 2,
              "replies": [
                {
                  "id": "l9epkmr",
                  "score": -7,
                  "body": "Ok you’re clearly regarded — yes keep being berr ![img](emote|t5_2th52|4275)",
                  "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9epkmr/",
                  "created": 1718852190,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9eq1w8",
                      "score": 5,
                      "body": "We are no where near AGI. Language models does not equal real intelligence. There is a major ceiling we will hit within 5 years",
                      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9eq1w8/",
                      "created": 1718852402,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9f49v4",
                          "score": 0,
                          "body": "This ages badly. If there is a ceiling we have already hit it but it doesn’t seem so",
                          "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9f49v4/",
                          "created": 1718859603,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l9fjhmu",
                              "score": 5,
                              "body": "Why do you think so? The models are getting improved by they're still purely probabilistic word generators. They'll get bigger and more sophisticated, but it doesn't seem like AGI can come out of this",
                              "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fjhmu/",
                              "created": 1718869396,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l9fwgnl",
                                  "score": 1,
                                  "body": "Yep only cool thing is the self building library, problem is that only expands the options not actually makes it a smarter system.",
                                  "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fwgnl/",
                                  "created": 1718878663,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l9enw30",
      "score": 32,
      "body": "The Nvidia bubble is not NVDIA will run out of growth or relative innovation it’s that everyone will have data centers, and some won’t be profitable at all. Same way with  websites. Mass adoption then collapse. We still have time.",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9enw30/",
      "created": 1718851468,
      "depth": 0,
      "replies": [
        {
          "id": "l9fbpe2",
          "score": 8,
          "body": "The picks and shovels are safer than whatever they are mining",
          "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fbpe2/",
          "created": 1718864110,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9hku3l",
          "score": 1,
          "body": "Lmao comments like these remind me never to listen to Redditors",
          "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9hku3l/",
          "created": 1718902865,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9fkvtz",
          "score": 0,
          "body": "Are you comparing data centers with websites?? Jesus..",
          "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fkvtz/",
          "created": 1718870412,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9f7z7s",
      "score": 9,
      "body": "These new AI companies need to put people at ease, perhaps with some sort of relatable mascot, something like a puppy puppet.",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9f7z7s/",
      "created": 1718861801,
      "depth": 0,
      "replies": [
        {
          "id": "l9g8zho",
          "score": 2,
          "body": "There’s a prompt that will do that for them",
          "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9g8zho/",
          "created": 1718885606,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9gh34q",
          "score": 2,
          "body": "How about a talking paperclip?",
          "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9gh34q/",
          "created": 1718889165,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9fbu87",
      "score": 12,
      "body": "https://preview.redd.it/q9zgqasq5o7d1.jpeg?width=1122&format=pjpg&auto=webp&s=957ceccd87c2ef92625bd14b83daf1a83ebf49fc",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fbu87/",
      "created": 1718864196,
      "depth": 0,
      "replies": [
        {
          "id": "l9fbyjk",
          "score": 15,
          "body": "https://preview.redd.it/pfun6sjw5o7d1.jpeg?width=1782&format=pjpg&auto=webp&s=92826fe16152ab0ab861bb26eddd5c42e642b7f4\n\nThen try betting against these United States of nvda and show some fucking puts ![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fbyjk/",
          "created": 1718864272,
          "depth": 1,
          "replies": [
            {
              "id": "l9fkm9g",
              "score": 3,
              "body": "Please clap",
              "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fkm9g/",
              "created": 1718870220,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9elcgb",
      "score": 6,
      "body": "Dell build 1/2 of it, SMCI also have a huge share out of it.",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9elcgb/",
      "created": 1718850408,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9euish",
      "score": 3,
      "body": "Whooohooo!",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9euish/",
      "created": 1718854474,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9f4qkk",
      "score": 3,
      "body": "Lol.....wut?",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9f4qkk/",
      "created": 1718859872,
      "depth": 0,
      "replies": [
        {
          "id": "l9f86o4",
          "score": 12,
          "body": "https://preview.redd.it/dtshadqzyn7d1.jpeg?width=1290&format=pjpg&auto=webp&s=859c8fe46db5369b738bba2639984f5989d0730d\n\nUnderstand me better now, visual learner sir? ![img](emote|t5_2th52|4275) I said calls",
          "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9f86o4/",
          "created": 1718861928,
          "depth": 1,
          "replies": [
            {
              "id": "l9gmomi",
              "score": 5,
              "body": "Man slapped his huge dong on table ![img](emote|t5_2th52|8882)",
              "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9gmomi/",
              "created": 1718891359,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9fnlyh",
      "score": 3,
      "body": "I don't think these people know what the word factory means.",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fnlyh/",
      "created": 1718872383,
      "depth": 0,
      "replies": [
        {
          "id": "l9fvelf",
          "score": 1,
          "body": "It’s clear from the comments how many regards here think they know what they’re talking about without even understanding what NVDA’s building/already built ![img](emote|t5_2th52|4275)",
          "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fvelf/",
          "created": 1718877955,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9gi4ft",
      "score": 3,
      "body": "Bought Dell a couple weeks ago, it dropped on earnings. :\\\\\n\nBeen slowly recovering, now I'm in the green and up 5%. \n\nHopefully this news gets me to 15-20% so I can sell.",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9gi4ft/",
      "created": 1718889583,
      "depth": 0,
      "replies": [
        {
          "id": "l9gi6op",
          "score": 1,
          "body": "Godspeed sir",
          "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9gi6op/",
          "created": 1718889608,
          "depth": 1,
          "replies": [
            {
              "id": "l9gqtou",
              "score": 2,
              "body": "Shoulda sold at 12% and now it's back down. :\\\\",
              "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9gqtou/",
              "created": 1718892878,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9ehaop",
      "score": 4,
      "body": "You mean DELL calls",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9ehaop/",
      "created": 1718848752,
      "depth": 0,
      "replies": [
        {
          "id": "l9ehcoc",
          "score": 1,
          "body": "I didn’t stutter ![img](emote|t5_2th52|4271) but Godspeed either way!\n\nDell will give me great gains most likely with high volatility risk. NVDA will likely give me even better gains without the added risk long term. Even though it’s volatile, youre fine as long as you buy in the money leaps or long calls.\n\nIdk if I personally can say the same about dell as confidently and that’s the difference to me",
          "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9ehcoc/",
          "created": 1718848774,
          "depth": 1,
          "replies": [
            {
              "id": "l9gb2tt",
              "score": 2,
              "body": "Can I buy stocks in Dell and NVDA instead? Is it allowed over calls and leaps in this sub?",
              "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9gb2tt/",
              "created": 1718886588,
              "depth": 2,
              "replies": [
                {
                  "id": "l9gb52n",
                  "score": 2,
                  "body": "what the fuck is a “share”??",
                  "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9gb52n/",
                  "created": 1718886617,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l9fil7c",
      "score": 2,
      "body": "Dell\n\n#and SMCI\n\nare building the servers for Elons xAI\n\n(Fixed it for ya)",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fil7c/",
      "created": 1718868753,
      "depth": 0,
      "replies": [
        {
          "id": "l9fvhcm",
          "score": 2,
          "body": "You’re right! I just copy pasta’d the actual article’s title but correct, it’s a partnership",
          "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fvhcm/",
          "created": 1718878007,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9ga7r4",
          "score": 2,
          "body": "Both getting a huge pop",
          "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9ga7r4/",
          "created": 1718886186,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9fw38f",
      "score": 1,
      "body": "Heard it was dell and SMCI, no?",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9fw38f/",
      "created": 1718878417,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9gk4ck",
      "score": 1,
      "body": "dell investors: \"if you build it, they will come\"",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9gk4ck/",
      "created": 1718890372,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9glwsu",
      "score": 1,
      "body": "Tight tight tight. Dell, Xai, whatever man. Just keep pumping NVDA",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9glwsu/",
      "created": 1718891067,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9i13lq",
      "score": 1,
      "body": "I bet Elon has calls too. Keep making huge announcements!",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9i13lq/",
      "created": 1718908162,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9kcxrs",
      "score": 1,
      "body": "He can always just sell xAI to Tesla to extort more shares and offload his toxic asset.",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9kcxrs/",
      "created": 1718940288,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9oqp6y",
      "score": 1,
      "body": "SMCI is building 1/2 … this news came last weekend",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9oqp6y/",
      "created": 1719010797,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9f1xlk",
      "score": 0,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9f1xlk/",
      "created": 1718858292,
      "depth": 0,
      "replies": [
        {
          "id": "l9f20tk",
          "score": 2,
          "body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1dk063k/dell_is_building_a_monstrous_ai_factory_powered/l9f20tk/",
          "created": 1718858341,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}