{
  "title": "Dell and Partners Join Forces to Build AI Factory for Elon Musk's xAI",
  "score": 38,
  "selftext": "Dell Technologies and Super Micro Computer are collaborating to provide server racks for a supercomputer being developed by Elon Musk's artificial intelligence startup, xAI. This supercomputer will power the next version of xAI's generative AI chatbot, Grok, and is expected to be operational by fall 2025.\n\n# Key Takeaways\n\n* Dell and Super Micro Computer are providing server racks for xAI's supercomputer.\n* The supercomputer will power the next version of xAI's AI chatbot, Grok.\n* The project is expected to be completed by fall 2025.\n* The collaboration involves Nvidia's advanced AI GPUs.\n\n# Dell and Super Micro's Role\n\nDell Technologies and Super Micro Computer are key players in the development of xAI's supercomputer. Dell is responsible for assembling half of the server racks, while Super Micro, known for its liquid-cooling technology and strong ties with chip firms like Nvidia, will handle the other half. This collaboration was confirmed by Elon Musk on the social media platform X.\n\n# Nvidia's Contribution\n\nNvidia is providing the advanced AI GPUs required for the project. The training of AI models like Grok requires tens of thousands of power-hungry chips. For instance, training the Grok 2 model took about 20,000 Nvidia H100 graphic processing units (GPUs), and future models will require even more. Nvidia's CEO, Jensen Huang, emphasized the importance of this collaboration in expanding the reach of AI technology.\n\n# The AI Factory\n\nDell CEO Michael Dell announced that the company is building an \"AI factory\" with Nvidia to power Grok. This AI factory will be a comprehensive infrastructure, including CPUs, GPUs, networking switches, software systems, and storage, all connected by miles of cables. The factory aims to make it easier for a broader range of customers to establish their own AI factories.\n\n# Future Prospects\n\nElon Musk has ambitious plans for xAI. The supercomputer, termed the \"Gigafactory of Compute,\" is expected to be operational by fall 2025. This venture aims to enhance the capabilities of the Grok AI chatbot, making it a formidable competitor to existing AI models like OpenAI's ChatGPT. The project will utilize up to 100,000 Nvidia H100 GPUs, potentially making it one of the largest GPU clusters in existence.\n\n# Conclusion\n\nThe collaboration between Dell, Super Micro, and Nvidia marks a significant milestone in the AI industry. By combining their expertise and resources, these companies are set to create a powerful supercomputer that will drive the next generation of AI technology. With the project expected to be completed by fall 2025, the future looks promising for xAI and its generative AI chatbot, Grok.\n\n# Sources\n\n* [Dell and Partners Join Forces to Build AI Factory for Elon Musk’s xAI](https://www.chatgptguide.ai/2024/06/20/dell-and-partners-join-forces-to-build-ai-factory-for-elon-musks-xai/)\n* [Dell, Super Micro providing server racks for xAI's supercomputer | Reuters](https://www.reuters.com/technology/artificial-intelligence/dell-assembling-racks-xais-supercomputer-elon-musk-says-2024-06-19/), Reuters.\n* [Dell is building an AI factory with NVIDIA AI GPUs to train Grok for xAI and Elon Musk](https://www.tweaktown.com/news/98907/dell-is-building-an-ai-factory-with-nvidia-gpus-to-train-grok-for-xai-and-elon-musk/index.html), TweakTown.\n* [Dell, Nvidia and SMC collaborate to power Musk's Grok AI factory By Investing.com](https://www.investing.com/news/stock-market-news/dell-nvidia-and-smc-collaborate-to-power-musks-grok-ai-factory-3489258), Investing.com.\n* [Elon Musk On Nvidia Collaborator Powering ChatGPT Rival: 'Dell Is Assembling Half Of The Racks for xAI's Supercomputer' - NVIDIA (NASDAQ:NVDA), Dell Technologies (NYSE:DELL) - Benzinga](https://www.benzinga.com/markets/equities/24/06/39403884/elon-musk-on-nvidia-collaborator-powering-chatgpt-rival-dell-is-assembling-half-of-the-racks-for), Benzinga.",
  "link_flair_text": "Company News",
  "id": "1dk68we",
  "num_comments": 12,
  "created_utc": 1718870395,
  "permalink": "/r/stocks/comments/1dk68we/dell_and_partners_join_forces_to_build_ai_factory/",
  "comments": [
    {
      "id": "l9g1hid",
      "score": 83,
      "body": "This is quite the bombastic way to say that Dell is selling them server racks.",
      "permalink": "/r/stocks/comments/1dk68we/dell_and_partners_join_forces_to_build_ai_factory/l9g1hid/",
      "created": 1718881748,
      "depth": 0,
      "replies": [
        {
          "id": "l9ghzyi",
          "score": 23,
          "body": "AI racks 👌",
          "permalink": "/r/stocks/comments/1dk68we/dell_and_partners_join_forces_to_build_ai_factory/l9ghzyi/",
          "created": 1718889534,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9ga2lu",
      "score": 19,
      "body": "Pretty soon we’ll look back and wonder at all the massive amounts of money that were spent to build *chatbots.*",
      "permalink": "/r/stocks/comments/1dk68we/dell_and_partners_join_forces_to_build_ai_factory/l9ga2lu/",
      "created": 1718886119,
      "depth": 0,
      "replies": [
        {
          "id": "l9h4x33",
          "score": 10,
          "body": "Which will still suck.",
          "permalink": "/r/stocks/comments/1dk68we/dell_and_partners_join_forces_to_build_ai_factory/l9h4x33/",
          "created": 1718897679,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9j9ni9",
          "score": 2,
          "body": "Pretty soon we will look back and wonder at the massive amounts of energy that were spent to build AI and alt currency.",
          "permalink": "/r/stocks/comments/1dk68we/dell_and_partners_join_forces_to_build_ai_factory/l9j9ni9/",
          "created": 1718923535,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9jipg2",
          "score": 1,
          "body": "It's like the Canadian Weed boom. Where did all the money go but at least we have legal weed.",
          "permalink": "/r/stocks/comments/1dk68we/dell_and_partners_join_forces_to_build_ai_factory/l9jipg2/",
          "created": 1718927122,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9kkw5r",
          "score": 1,
          "body": "What do you think the % odds are that AI amounts to nothing in the short to mid term?",
          "permalink": "/r/stocks/comments/1dk68we/dell_and_partners_join_forces_to_build_ai_factory/l9kkw5r/",
          "created": 1718944385,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9hju6g",
          "score": -1,
          "body": "And why you didn't invest more",
          "permalink": "/r/stocks/comments/1dk68we/dell_and_partners_join_forces_to_build_ai_factory/l9hju6g/",
          "created": 1718902550,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9fwpno",
      "score": 6,
      "body": "A lot of effort for fart jokes and edgy humor but I guess Dell and co are getting a payday which is nice.",
      "permalink": "/r/stocks/comments/1dk68we/dell_and_partners_join_forces_to_build_ai_factory/l9fwpno/",
      "created": 1718878828,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9j9y5h",
      "score": 2,
      "body": "With his new pay package , is Elon self financing this build out ?",
      "permalink": "/r/stocks/comments/1dk68we/dell_and_partners_join_forces_to_build_ai_factory/l9j9y5h/",
      "created": 1718923649,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9vikm1",
      "score": 1,
      "body": "Top!",
      "permalink": "/r/stocks/comments/1dk68we/dell_and_partners_join_forces_to_build_ai_factory/l9vikm1/",
      "created": 1719128680,
      "depth": 0,
      "replies": []
    }
  ]
}