{
  "title": "Am I alone here?",
  "score": 187,
  "selftext": "I am rarely a bear, but seeing the market beat record high after record high after record high (x10) is starting to scare me... I just fear it will cause irreparable damage to the market when it collapses. No matter where I go, it's like everyone believes $NVDA is going to skyrocket and make every Uber driver a billionaire. I just don't see how this is even possible (let alone sustainable).\n\nI expect to be met with lots of \"stonks only go up\" comments, but would really love to hear from the one other bear in the millions of mega-bulls...\n\nHow is it possible that inflation is only 3% when the market is parabolic? There must be a lot more money out there than I thought, which leads me to believe that inflation is not transitory after all... Just watching stocks rocket far past the moon makes me believe the next few inflation prints are going to hurt and I'm actually predicting rate hikes in 2025 instead of cuts... Plus with the national debt at $34 trillion, how can that the interest payments be made without hyperinflation?",
  "link_flair_text": null,
  "id": "1dkddts",
  "num_comments": 219,
  "created_utc": 1718894674,
  "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/",
  "comments": [
    {
      "id": "l9h1lv8",
      "score": 298,
      "body": "I'm not a bear but I definitely say that NVDA will not remain as the world's most valuable company.  But the thing is, though, even if the AI craze is a bubble, it's just getting started.  NVDA is going to sell a load of chips.  A lot of the forward demand has already been bought up but who knows how much there is?  Until I see a clear sign of weakness, I have to be bullish.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9h1lv8/",
      "created": 1718896576,
      "depth": 0,
      "replies": [
        {
          "id": "l9k84gy",
          "score": 50,
          "body": "Yep, it didn't take long for the internet to overtake the world right agter the \"dot com\" bubble popped.",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9k84gy/",
          "created": 1718938005,
          "depth": 1,
          "replies": [
            {
              "id": "l9q56xf",
              "score": 11,
              "body": "The recovery after the dotcom bubble took more than a decade.  \nIn mid ‘99 I got nervous and thought about moving all into bonds. Then I listened to all the “pros” and stayed I. The market because “you can’t time the market “. Got righteously reamed but did recover but it sure stung.",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9q56xf/",
              "created": 1719034275,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9k7com",
          "score": 18,
          "body": "AI has popped up now and again for some time.  It will retract, but not without a catalyst I imagine.  What do you think?",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9k7com/",
          "created": 1718937651,
          "depth": 1,
          "replies": [
            {
              "id": "l9kuvcu",
              "score": 16,
              "body": "AI starts to entail so much stuff thats it's hard to just group it all together.\n\nFor example AI systems now regulate traffic lights in some cities. Will we scale that back? I doubt it. Especially since many countries are facing a declining population, but will still want to keep the same level (or better) of economy, infrastructure and welfare. Thus it seems logical (to me at least) that we will leave more and more systems in the hands of all kinds of AI systems.\n\nHowever, if Nvidia will benefit from this is another question. But just like internet, AI is not going away.",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9kuvcu/",
              "created": 1718950266,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9ma3qz",
          "score": 3,
          "body": "But TSMC makes \"the chips\" right? Nvidia packages it all together for the cards they then sell to AI data centers. Please correct me if I'm wrong.",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9ma3qz/",
          "created": 1718979447,
          "depth": 1,
          "replies": [
            {
              "id": "l9mgr90",
              "score": 4,
              "body": "TSMC makes the chips, but they don’t design them. They have the machinery to make what a company like Nividia designs. So nividia designs (part of) “the shovel”, which TSMC makes, and then nividia assembles alongside with whatever else, and then sells that finished chip product to whoever. So while TSMC does make them it’s not like nividia is just a middle man",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9mgr90/",
              "created": 1718981827,
              "depth": 2,
              "replies": [
                {
                  "id": "l9mh757",
                  "score": 1,
                  "body": "Thanks for explanation.",
                  "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9mh757/",
                  "created": 1718981982,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l9h2wm0",
          "score": -24,
          "body": "Why else would people overpay for something unless they thought it was \"just getting started\" and will increase in price? It seems a lot of people are admitting we're in a bubble, but they make this same argument that bubbles can continue to rip up - while I admit they can continue up, I just think don't think that's a good reason to buy something",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9h2wm0/",
          "created": 1718897010,
          "depth": 1,
          "replies": [
            {
              "id": "l9h4dbo",
              "score": 120,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9h4dbo/",
              "created": 1718897496,
              "depth": 2,
              "replies": [
                {
                  "id": "l9i6dvv",
                  "score": 47,
                  "body": "1) the market can stay longer irrational than I can stay solvent. This is especially true for shorting the hottest stock out there.\n\n\n2) it's entirely possibly that NVDA price is gonna tread water for the next 2 years while the business catches up to market expectations. \n\nEverybody knows that NVDA is a great company. But if I  believe that current price levels will not warrant a price appreciation higher than VOO, I just stay out. Shorting can still be a bad idea.",
                  "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9i6dvv/",
                  "created": 1718909907,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9k3thc",
                      "score": 9,
                      "body": "Shorting is almost always a bad idea.",
                      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9k3thc/",
                      "created": 1718936060,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l9j27uk",
                  "score": 30,
                  "body": "This idea that someone needs to short something just because they view it as overvalued is crazy.\n\nMaybe it would make sense if the market were completely rational, but if that was the case stuff wouldn't ever get overvalued.\n\nBut since the market has a strong element of emotion tied to it there is no reason to actively fight the trend. Either ride it or stand on the sidelines.",
                  "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9j27uk/",
                  "created": 1718920727,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l9ilbey",
                  "score": 12,
                  "body": "Shorting is more risk than it's worth; especially in a bubble.",
                  "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9ilbey/",
                  "created": 1718914877,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l9jc4rl",
                  "score": 5,
                  "body": "Just because the market can remain irrational long enough to blow up all the bears doesn’t mean they are wrong.   \nI’m not going to bet against the bubble but I think it has to correct sooner or later.   \nJust like Tesla “investors” aren’t smart just because they made money. They are regarded and happened to make money off of a bunch of fraud and hype.",
                  "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jc4rl/",
                  "created": 1718924501,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9k47js",
                      "score": 4,
                      "body": "I track memestocks in a separate watchlist in my brokerage app. They all sink post peak but there's always a latest one. It helps to track what the hive mind has forgotten.",
                      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9k47js/",
                      "created": 1718936232,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9o3t5u",
                          "score": 2,
                          "body": "It’s a bubble the main point is to get when explode.  Beside amc and gme which other names come to mind?",
                          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9o3t5u/",
                          "created": 1719002173,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l9pzy1s",
                              "score": 2,
                              "body": ">It’s a bubble the main point is to get when explode.\n\nI'm not sure what you mean by this.",
                              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9pzy1s/",
                              "created": 1719031161,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l9q0xzp",
                                  "score": 1,
                                  "body": "Shorting the bubble providing that the trader has the right tool to approach this. (Entry timing, stops in places etc)",
                                  "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9q0xzp/",
                                  "created": 1719031729,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "l9q256d",
                                      "score": 1,
                                      "body": "I don't believe you can reliably do so profitably.",
                                      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9q256d/",
                                      "created": 1719032420,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "l9q2eou",
                                          "score": 1,
                                          "body": "Well I don’t disagree in a sense that most should not do that. I have learned the art of shorting from an American on twitter after many stops . It’s the best way to make tons of money in a very short time frame.",
                                          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9q2eou/",
                                          "created": 1719032577,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l9hg7od",
              "score": 18,
              "body": "Nvidia isn't a fraudulent bank lending out sub prime variable rate mortgages. It's also an individual stock so like invest in something else. S and p and other funds have plenty of Nvidia exposure you don't need to go all in.",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9hg7od/",
              "created": 1718901410,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9h6iql",
              "score": 6,
              "body": "That's true but, at this point, I don't really see any signs of trouble.  I believe lots of new AI products will come to market before we really understand the value.  Most of those are going to use NVDA chips.  If everybody is gung ho on it now, how long will it take them to change their minds?  When I see AI companies with large valuations and no revenue, then I will start to worry and even then I will probably be worrying too soon.",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9h6iql/",
              "created": 1718898211,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9kamt6",
              "score": 4,
              "body": "Found the guy who missed the boat.",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9kamt6/",
              "created": 1718939174,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9mae4y",
              "score": 2,
              "body": "If I overplayed for Amazon 10 years ago when it was at a high… I would have made a killing today… it’s where a company will be in 5-10 years and NVDA was waiting for this exact advantage to take off as a company…. I think the evaluation is high, but they could take other markets easily.",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9mae4y/",
              "created": 1718979554,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9h8c2v",
              "score": 5,
              "body": "Reverse what you just said as it could go either way. There is a 50/50 chance AI is just getting started and if that is true NVDA isn't even close to being a bubble. They have revenues that back up their gains. The only fear is that the revenue starts to drop if demand for chips slows. If the chips continue to sell then NVDA is the clear winner for many years. It can go up or down. No one can read the future, people will say I told you so afterwards.",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9h8c2v/",
              "created": 1718898815,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9jgk0g",
              "score": 0,
              "body": "Bubbles can take years to pop. Decades. I think you are more concerned with being right than making money.",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jgk0g/",
              "created": 1718926252,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9gxrvk",
      "score": 187,
      "body": "If you’re so concerned about NVDA, invest elsewhere. Equal weight s&p is up less than 5% ytd. \n\nThere’s btwn 6-$10 trillion on the sidelines in cash/mm/short end of curve.  Large cap US companies are not in dire shape and looking to invest in efficiency gains. \n\nThe market may not go straight up always, but if you are a bear right now you’re going to have to do better than “I missed this run and want it to correct.”",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9gxrvk/",
      "created": 1718895278,
      "depth": 0,
      "replies": [
        {
          "id": "l9h6x6r",
          "score": 17,
          "body": "Equal weight S&P lost 12% when the Nasdaq got slammed in 2022, so this thesis doesn't work. Only contrarian thesis that seems to play is buy oil stocks, they seem to perform when tech stocks don't.\n\n\nI will say this though so I don't make more than one post, the thesis that this shows that there is more inflation than what's hoped for is incorrect at least for now (and silly honestly, this is nothing really that new if you remember late summer 2020). June inflation numbers look like they're going to be good. ",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9h6x6r/",
          "created": 1718898346,
          "depth": 1,
          "replies": [
            {
              "id": "l9h7smn",
              "score": 11,
              "body": "Right. To be clear I was not advocating doing this and, if your principal concern is inflation, this is a particularly dogshit idea. To your point though, inflation does not appear to be the concern this person believes it will be, and they’re clearly upset they missed the run here, so RSP offers a less “expensive” entry point.  ",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9h7smn/",
              "created": 1718898636,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9i4knu",
          "score": 10,
          "body": "The current run isn't supported by earnings growth. Forward PE valuations on SP500 are back to pandemic  speculative bubble levels.\n\n[https://yardeni.com/charts/stock-market-p-e-ratios/](https://yardeni.com/charts/stock-market-p-e-ratios/)\n\nIt gets even worse when you look at SP500 tech companies. Forward PE multiple on SP500 tech is now higher than at any point during pandemic. See Figure 8.\n\n[https://yardeni.com/charts/sp-500-sectors-forward-p-e-ratios/](https://yardeni.com/charts/sp-500-sectors-forward-p-e-ratios/)\n\nThis is definitely just an AI FOMO market right now.",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9i4knu/",
          "created": 1718909314,
          "depth": 1,
          "replies": [
            {
              "id": "l9iaqof",
              "score": 19,
              "body": "This shows that the forward p/E on the mega caps is still significantly below pandemic highs. That’s where all the earnings growth is coming from.  ",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9iaqof/",
              "created": 1718911364,
              "depth": 2,
              "replies": [
                {
                  "id": "l9ib157",
                  "score": 6,
                  "body": "The tech sector as a whole is extremely extended.  The Megacaps, which are driving index performance, not as concerning imo.  ",
                  "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9ib157/",
                  "created": 1718911461,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l9ipj8v",
                  "score": 4,
                  "body": "Actually this shows MegaCap forward PE is back to levels seen in mid 2021 during pandemic fueled bubble. The absolute peak in 2020 is misleading because earnings dropped when they shut down the economy for months on end so PE spiked artificially high as business suffered.",
                  "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9ipj8v/",
                  "created": 1718916278,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l9kesvs",
              "score": 23,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9kesvs/",
              "created": 1718941217,
              "depth": 2,
              "replies": [
                {
                  "id": "l9kj6q1",
                  "score": 17,
                  "body": "After the dotcom bust the Nasdaq lost 80% and took 15 years to regain ATH. The market does mostly go up, but it all depends upon where one buys in. Buying after a steep run up with stretched valuations is unwise due to the risks of being the bag holder.",
                  "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9kj6q1/",
                  "created": 1718943471,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9o812h",
                      "score": 4,
                      "body": "Exactly, it's like how people talk about 2023 stock market as free money while ignoring the fact that most people were massively down in 2022 and had to spend the year just to make back losses",
                      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9o812h/",
                      "created": 1719003652,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "l9khghv",
                  "score": 7,
                  "body": "No one said to sit on the sidelines but you can control what you are overweight and underweight on. If you’re FOMOing into AI stocks you better have a high risk tolerance.",
                  "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9khghv/",
                  "created": 1718942566,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l9krsis",
                  "score": 0,
                  "body": "Thank you. On point.",
                  "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9krsis/",
                  "created": 1718948362,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l9kth7o",
                  "score": 0,
                  "body": "SPOT ON!!!!",
                  "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9kth7o/",
                  "created": 1718949391,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l9j65sh",
          "score": 5,
          "body": "You are absolutely correct. It’s sad when people are so pessimistic when the economy is so strong. \n\nAll they want is a crash because they missed out. In other words, they are hoping people lose their life savings / jobs / evicted out of their house so they can come in and swoop your assets. It’s fking pathetic and sad. ",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9j65sh/",
          "created": 1718922201,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9nvmux",
          "score": 1,
          "body": "the money market sidelines argument makes no sense because there will always be a large minority of people who will never put that money into the market and never did before this. I know you probably caught that line from financial news sources or here but it's just an opinion that bulls have. There is no real reality where 6-10 trillion goes into the market.",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9nvmux/",
          "created": 1718999333,
          "depth": 1,
          "replies": [
            {
              "id": "l9ogqle",
              "score": 1,
              "body": "The argument isn’t that all this money flows into equities, but these are elevated cash levels, and some amount of it is waiting for a better entry point into equities. ",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9ogqle/",
              "created": 1719006853,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9h8hpk",
      "score": 112,
      "body": "Umm that is how all time high works. When you look back at a historical chart, when you see a peak on the chart, you have to remember that the path before the peak, is all all-time-highs being broken everytime. The statistics show that when stocks high all time high, 80% of the time, it will go up and 20% of the time it will go down from there, this is historical data.\n\nI have been investing for more than 20 years, and sometimes all time high records gets broken for months to no end, sometimes years.\n\nYour feelings though are derived from something else that is not data.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9h8hpk/",
      "created": 1718898867,
      "depth": 0,
      "replies": [
        {
          "id": "l9i1ra8",
          "score": 16,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9i1ra8/",
          "created": 1718908379,
          "depth": 1,
          "replies": [
            {
              "id": "l9i68hy",
              "score": 16,
              "body": "Anyone who bought Tesla after 2020 has been holding heavy bags though. Hindsight is 20/20. It was very clearly overvalued and you could have gambled that it would continue to go up and made money. Or you could have bought the top. You don't know until it's too late. You have to have a very high risk tolerance.",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9i68hy/",
              "created": 1718909858,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9irdif",
      "score": 15,
      "body": "Everywhere I go people say nvda is too expensive and can’t go up any more, been like this for a year now",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9irdif/",
      "created": 1718916904,
      "depth": 0,
      "replies": [
        {
          "id": "l9iuvlm",
          "score": 7,
          "body": "I'm not saying NVDA can't go up any more... not saying that at all... I'm saying there is not enough money in existence for NVDA and AAPL and MSFT and NFLX and AMZN and the rest of the market to continue skyrocketing simultaneously.\n\nNVDA can definitely go up if people sell other stocks and use the money to buy NVDA. NVDA has an 8% share of the S&P 500. If NVDA goes up 10x it would be like 80% of the S&P. Of course that's possible, but the inflows to NVDA has to mostly come from outflows from other stocks. And one stock making up 80% of the S&P is just... crazy...",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9iuvlm/",
          "created": 1718918136,
          "depth": 1,
          "replies": [
            {
              "id": "l9s9rct",
              "score": 2,
              "body": "Same could be said for crypto. It's pure fiat value extrapolated from the margin. The money doesn't need to \"exist\" for the valuation to be there. All that will matter is supply and demand for the stock.\n\nI was looking at apple in 2010 thinking how insane it was and getting to a trillion was absolutely crazy because that would be like x% of the market. Exactly the same thinking as your post. Yet here we are, with apple up 10x in the trillions. Just perspective.",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9s9rct/",
              "created": 1719075503,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9rxt9j",
              "score": 1,
              "body": "Good point, the only thing you need to remember is the economy is growing so with the growth of these companies more wealth is also generated. But I am not arguing your point. You are right, if this stock goes another 1000% up how does it fit in the whole equation ha ha. Could NVIDIA alone generate profit equal to all S&P companies' profits.... highly unlikely.",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9rxt9j/",
              "created": 1719070980,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9gx4lm",
      "score": 101,
      "body": "Chill man just buy some more NVDA",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9gx4lm/",
      "created": 1718895062,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9h5qbc",
      "score": 52,
      "body": "Everyhing else has doubled in price, why not stocks? 3 trillion today was 1.5T a few years ago. Same as milk and eggs.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9h5qbc/",
      "created": 1718897950,
      "depth": 0,
      "replies": [
        {
          "id": "l9jc00u",
          "score": 13,
          "body": "Bring back $5 foot longs!",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jc00u/",
          "created": 1718924450,
          "depth": 1,
          "replies": [
            {
              "id": "l9jw9kg",
              "score": 5,
              "body": "McDonald’s just announced a 5 dollar meal deal coming soon. Can’t wait!",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jw9kg/",
              "created": 1718932808,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9jh5aw",
              "score": 1,
              "body": "this",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jh5aw/",
              "created": 1718926491,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9inbso",
          "score": 7,
          "body": "NFL stadiums have 5x",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9inbso/",
          "created": 1718915539,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9k6npq",
      "score": 17,
      "body": "Heres a counter thesis to the bear.  China and India are each over a billion people and are rapidly modernizing/have modernized (China)  they are creating millions and i mean 10s of millions of middle class every year or few years.  Thats huge worldwide demand for things like cars, electronics, vacations, natural resources, etc.\n\nWeve seen worldwide inflation due to how most large advanced countries tackled covid.\n\nWe are approaching asymptotic curve with regards to technological innovation and development.\n\nHumans have been around roughly 200,000 years and it took about 195ish thousand years to start to develop modern civilization.  Then it took another 4,700 years to get to the scientific revolution and age of enlightenment, and in less than 125 years weve invented human powered flight, radio, TV computers, combustion engine, nuclear weapons, satellites, etc.  All started once printing press was invented and information was easier to disseminate and education began reaching the masses\n\nWithin 100 years (assuming we havent wiped ourselves out) we should have a space based economy for mining where a single asteroid could contain a $trillion worth of minerals.  Could have cold fusion, advanced genetic engineering, nano materials, bio engineering, mars colonization, terraforming, quantum computing, AI, etc\n\nSo yes, will a given stock or 2 hundred or so occaisonally get into bubble/speculative values, you betcha. Will the market have some big time drops and corrections now and then.  Yep.  But overall, our economy, our technological innovation and stocks seem like they have quite a bit of room for growth over the next 100+ years.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9k6npq/",
      "created": 1718937336,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9i3qvw",
      "score": 16,
      "body": "I just bought more NVDA",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9i3qvw/",
      "created": 1718909039,
      "depth": 0,
      "replies": [
        {
          "id": "l9lpjv0",
          "score": 4,
          "body": "Top is in boys",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9lpjv0/",
          "created": 1718970730,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9gy1v0",
      "score": 21,
      "body": "Yes, there is a lot more money than you thought. Unfortunately, they printed way more money previous 5-10 years.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9gy1v0/",
      "created": 1718895372,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9gyxiv",
      "score": 41,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9gyxiv/",
      "created": 1718895669,
      "depth": 0,
      "replies": [
        {
          "id": "l9hglda",
          "score": 11,
          "body": "Amazon, ebay Microsoft etc. Plenty of companies did fine in that bubble. The internet overall has fueled tremendous stock growth.",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9hglda/",
          "created": 1718901527,
          "depth": 1,
          "replies": [
            {
              "id": "l9kjfhz",
              "score": 2,
              "body": "MSFT lost 50% of its value and traded sideways for a decade, taking about 12 years to regain ATH set in the dotcom bubble.",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9kjfhz/",
              "created": 1718943600,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9h7osy",
          "score": 21,
          "body": "Not many of these AI startups are showing crazy valuations in the stock market yet. It seems the AI money has been mostly concentrated into Nvidia and a few other already large companies, MSFT, META etc and although these have seen some good performance still a way off the ridiculous valuations we saw with dotcom",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9h7osy/",
          "created": 1718898600,
          "depth": 1,
          "replies": [
            {
              "id": "l9i5hxd",
              "score": 13,
              "body": ">Investors have poured 330B into about 26,000 AI and machine learning startups over the past three years, according to Pitchbook, which tracks the industry.\n\nA lot of this 330B in investment is going directly to compute spend and GPU build out. Which is causing Nvidia and cloud infrastructure related companies to balloon.\n\nFurthermore, we are seeing a lot of the unicorn AI startups with billion dollar valuations starting to flounder. Many are looking to get acquired, sell IP, or shutting down because there's a lot of GenAI hype with very little to show for it in terms of viable business models and revenue generation. Inflection AI, Stability AI, Humane, Adept, Babylon, Olive, etc.",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9i5hxd/",
              "created": 1718909616,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9pkrjn",
              "score": 1,
              "body": "The AI startups are mostly not publicly traded. You can't buy them on the stock market.",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9pkrjn/",
              "created": 1719023590,
              "depth": 2,
              "replies": [
                {
                  "id": "l9pxt48",
                  "score": 1,
                  "body": "What’s the opposite of a rising tide lifts all boats?",
                  "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9pxt48/",
                  "created": 1719029968,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9tpq5c",
                      "score": 1,
                      "body": "Receding tide beaches all boats?",
                      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9tpq5c/",
                      "created": 1719095565,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l9h9lik",
          "score": 4,
          "body": "Same with crypto and fintech startups. It took a hit, but the believe in the system is so strong and it’s far removed enough from the general population and the big companies tend to be drowning in enough cash that if/when the AI book collapses, the market will take a hit, but it will adjust quickly and move elsewhere. The biggest problems are related to banks and housing. If inflation and bank loans hit a high, that’s when the red flags go up and we should worry. Right now I believe most of the big companies invested and investing in AI will just throw the money at the next thing, make it big and keep it going. \n\nDon’t get me wrong, there is absolutely a bubble going on, but the optimism and cash flow is so ridiculous that something pretty shitty has to happen for it to burst. And I don’t think if even 90% of AI startups or even 95% of them going bust will considerably effect the market, cause people are too fucking optimistic right now. And optimistic people will see all the red signs as “well now it’s time for me to invest, I can’t lose” which causes everything to somehow go up. Kinda like how the market very quickly corrected during covid while everything else was in the gutter. Just too much money going on and modern fashion investments are kind of too detached from reality to be affected by it.\n\nThat’s of course a red flag and warning bells would be ringing in any sane economy. It’s essentially all a big scheme to remove suckers like us from our money and move it to the biggest investors. Maybe in a week or two the market corrects itself and shit rolls downhill, maybe in a few years. But until it does, I will be putting money into the market because I firmly believe ETF’s will be a good bet and I also believe companies like Nvidia, which are probably horrifically overvalued, are still a good investment opportunity because people believe that it is. \n\nIt’s all psychological at this point and we need a critical mass of cash to be pulled out before the whole thing collapses. So buckle up, cause we are on Mr Bones wild ride and he has no idea what’s going on, he’s just happy",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9h9lik/",
          "created": 1718899231,
          "depth": 1,
          "replies": [
            {
              "id": "l9lahi6",
              "score": 1,
              "body": ">It’s essentially all a big scheme to remove suckers like us from our money and move it to the biggest investors.\n\nThis...i feel like they know alot of retail and common folk $$$ are in high yield treasuries. Once and when rates go down gradually, this money has to be cycled to 'somewhere'.\n\nBut wouldn't there exist a scenario: Where they wait for average joe's money to be in the market, before pulling the trigger. While simultaneously average joe is waiting for them to pull said trigger, and hence staying out of the market. In that way, the game is prolonged and the stock market goes infinitely higher for longer?",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9lahi6/",
              "created": 1718961368,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9joo7p",
          "score": 2,
          "body": "This could be a good comparison, but NVDA is where AAPL and MSFT were during then during the dot com boom.  There were a lot of casualties then, but these two companies emerged as tech titans.  And Google a bit later on.",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9joo7p/",
          "created": 1718929589,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9gyyfg",
      "score": 23,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9gyyfg/",
      "created": 1718895677,
      "depth": 0,
      "replies": [
        {
          "id": "l9jkcri",
          "score": 5,
          "body": "#1 is biggest reason. Everyone and their mothers want NVDA now and think they are a trader.",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jkcri/",
          "created": 1718927798,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la3p5s0",
          "score": 1,
          "body": "They are price controlling everything...until the people bank run the fraud",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/la3p5s0/",
          "created": 1719260447,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9h62v2",
      "score": 15,
      "body": "No, there's a post like this here every 3 hours. Y'all have predicted the last 69 crashes since 2008.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9h62v2/",
      "created": 1718898064,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9hh7zs",
      "score": 7,
      "body": "Irreparable?  😂. What???  You know there have been massive crashes before right?  The market recovered from it and then some every time.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9hh7zs/",
      "created": 1718901726,
      "depth": 0,
      "replies": [
        {
          "id": "l9jxe2s",
          "score": 6,
          "body": "Goal is to buy after the crash, not before. At least that’s what I gather is OP’s intent in speculating an inevitable crash is coming. The post is probably the result of frustration from it not happening yet.",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jxe2s/",
          "created": 1718933303,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9hllhu",
      "score": 6,
      "body": "A year ago you were bitching about the AI bubble.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9hllhu/",
      "created": 1718903113,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9gwvdi",
      "score": 9,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9gwvdi/",
      "created": 1718894974,
      "depth": 0,
      "replies": [
        {
          "id": "l9gx4ta",
          "score": 8,
          "body": "Usually isn't",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9gx4ta/",
          "created": 1718895064,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9h5qqn",
      "score": 17,
      "body": "crazy high prices, bonds inverted, overwhelming positive sentiment,... all tell me park it in high interest cash acct for a little while.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9h5qqn/",
      "created": 1718897954,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9i41qh",
      "score": 3,
      "body": "Market always has corrections just some are worse than others. The consumer is squeezed dry by inflation and paychecks not keeping up. People charging too much. So I expect some correction but not like 2008 style.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9i41qh/",
      "created": 1718909140,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9imdp0",
      "score": 3,
      "body": "Market is at all time high. It means it has beaten all the previous all time highs in history. And it has done that thousands of times. Beating all time highs is probably what the market does best. \n\nThe question has to be… is there any reason why it shouldn’t continue doing what it does best? And the answer to that is what should guide you not the records.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9imdp0/",
      "created": 1718915225,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9imtdx",
      "score": 3,
      "body": "It's good to be on the outlook for risks. Our human mind is primed to look for trouble. That's why doom news gets so many eye balls on social media.\n\nMy decade of investing has taught me the hard lesson of diversifying, staying in the market long, and setting trail % loss orders. The money is only real when you sell it.\n\n2020 correction is a good scar. When one domino falls, the whole market falls really fast. Tech was hit really hard. I thought it was done, but it bounced back. I sold out of fear, bought back too late. Unless you are Nancy Pelocy, timing is gonna be a rookie mistake.\n\nNVDA needs one bad earnings and they will be fucked. Like TSLA losing 70% of its value within an year due to missing their mark. I bought TSLA at 50% drop thinking it wouldn't drop further, and it was my biggest lost. \n\nMy best performing long term asset is FNILX (0% fee). Never taken out of it, only added to it. US economy is a solid long term bet.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9imtdx/",
      "created": 1718915368,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9ipq99",
      "score": 3,
      "body": "Nah you aren't alone. I'm not selling my NVDA shares, but I'm not confident enough in it to keep buying more.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9ipq99/",
      "created": 1718916344,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9h71b0",
      "score": 14,
      "body": "You’re just mad you missed the run Lmaooo",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9h71b0/",
      "created": 1718898385,
      "depth": 0,
      "replies": [
        {
          "id": "l9ibpno",
          "score": 9,
          "body": "I just bought NVDA two weeks before the split and I’m up 27%.",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9ibpno/",
          "created": 1718911688,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9h1f8x",
      "score": 5,
      "body": "I hedged against societal collapse with prison conglomerates, loan origination and servicing and US based firearm manufacturing.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9h1f8x/",
      "created": 1718896513,
      "depth": 0,
      "replies": [
        {
          "id": "l9i58s7",
          "score": 3,
          "body": "Grim. But smart!",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9i58s7/",
          "created": 1718909533,
          "depth": 1,
          "replies": [
            {
              "id": "l9jymgl",
              "score": 1,
              "body": "How so? can you use it at that point?",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jymgl/",
              "created": 1718933836,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9j0por",
      "score": 2,
      "body": "I've been waiting for the inevitable pullback ever since the S&P was at 4k 🫣",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9j0por/",
      "created": 1718920186,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9jklnq",
      "score": 2,
      "body": "Zoom out on the graph and take a chill pill. What direction does the market inevitably go?\n\nWe have dips, we have crashes but one thing is for certain- it keeps growing. Take solace in that",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jklnq/",
      "created": 1718927899,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9jlf48",
      "score": 2,
      "body": "As a long time crypto trader I can tell you that markets on big tears can get so much bigger than you can imagine before they crash. \nEven Warren Buffet has some degen moments i guarantee  you \nThat is NOT financial advice.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jlf48/",
      "created": 1718928233,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9js7kq",
      "score": 2,
      "body": "My understanding is that the “chip bubble” right now is due to the increase in tariffs in Chinese chip manufactures and the money coming from the CHIPS Act.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9js7kq/",
      "created": 1718931076,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9k6r8o",
      "score": 2,
      "body": "No such thing as “irreparable” damage to the stock market\n\nalso you should read up a bit more on the national debt. it’s not money we owe anyone but ourselves for the most part",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9k6r8o/",
      "created": 1718937380,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9k6rrs",
      "score": 2,
      "body": "I don't want to add fuel to the fire, but over the long term, the stock market reflects the level of economic activity and productivity.\n\nThe industrial revolution increased productivity, the invention of integrated circuits helped, electrification helped.\n\nWe aren't moving around in horse drawn buggies, and most of us do not farm for a living.\n\nThe current hype in AI is probably premature, but I think there is a long term optimism that we will see those economic benefits eventually...",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9k6rrs/",
      "created": 1718937387,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9k8o80",
      "score": 2,
      "body": "I'm a permabear at heart, but I'm not stupid enough to go against the trend.  It will all come crashing down at some point, but today is not the day.  The \"irreparable harm\" bit is a little trite though.  Every crash is the end of the world, and every time it eventually recovers.  The good news is, when it does crash, we can short the market and make money on the way down.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9k8o80/",
      "created": 1718938257,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9l07mb",
      "score": 2,
      "body": "OP. The market is NOT the Economy, and the Economy is NOT the market. Just because market go up doesn’t mean inflation go up (as you see in the latest CPI report) Inflation is caused by when there is a demand inbalance to supply especially when we are talking supply chains.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9l07mb/",
      "created": 1718953820,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9lza3r",
      "score": 2,
      "body": "After election there won’t be a need to artificially inflate the market",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9lza3r/",
      "created": 1718975215,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9nfwi2",
      "score": 2,
      "body": "What scares me is the fact that people think the market is booming right now. That’s not the case. There are a handful of giant companies propping up the market and the rest are running on fumes. The market has not recovered from COVID even though people think it has. My IRA that was invested in small-mid cap companies is still down 62% and continues to drop by the day. The fact that we are seeing massive consolidation by only a few companies is what is really concerning. Start ups don’t stand a chance anymore.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9nfwi2/",
      "created": 1718993867,
      "depth": 0,
      "replies": [
        {
          "id": "l9nrssu",
          "score": 1,
          "body": "100%",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9nrssu/",
          "created": 1718998006,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9nsupa",
      "score": 2,
      "body": "They changed Big Data to AI and people forgot that it was all junk. \n\nSo what now? More tailored Ads on Facebook? More Ads on Google. My youtube is now recommending stuff I don't actually want to watch just because I was searching for it. \n\nWhat, new tracking devices so I can see more when my order is ready? Better Coupon clips off Microsoft? \n\nMy robot vacuum still sucks. I doubt AI is going to improve on that. \n\nNo AI has created a better playlist for me. In fact, I kind of enjoyed creating my own playlists without all the constant recommendations. \n\nI have to now use Yandex for search just to get rid of all the ads and find the free stuff. \n\nWhen it comes to cars, nothing beats the classics. I can't stand the push button. I can't stand the stupid wide screen dash screen either. It looks like crap and is distracting.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9nsupa/",
      "created": 1718998373,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9t2voe",
      "score": 2,
      "body": "I just sold 25% of my NVDA.   Never wrong to take a profit",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9t2voe/",
      "created": 1719086579,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9h3c3o",
      "score": 2,
      "body": "I think we can start worried if Intel and amd start to catch up, which seems not possible in 1-5 years.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9h3c3o/",
      "created": 1718897154,
      "depth": 0,
      "replies": [
        {
          "id": "l9hbbov",
          "score": 3,
          "body": "To tell the truth, you probably need ATHs by the Russell 2000 much more than flashback mode by the Nasdaq with some different names playing a major role before you can even think about concern over a meaningful top occurring. \n\n\nAnd the only way that seems possible soonish is if the same push that came post-2020 election replays itself this time.",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9hbbov/",
          "created": 1718899813,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9hyzj6",
      "score": 3,
      "body": "There will be a correction, even a bear market. However, we have no way of knowing when. Stay the course but plan for a correciton.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9hyzj6/",
      "created": 1718907465,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9igb6k",
      "score": 3,
      "body": "The NVDA money will be spread out after Q2 end. Funds want to show they held the biggest winner than can sell to spread into mid and small caps. Breadth will leave to another move higher. \nIt’s time to buy outside the mega cap tech names.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9igb6k/",
      "created": 1718913223,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9hsaps",
      "score": 7,
      "body": "Blah blah blah. I've been investing  since 2017. People say this every time the market is at all-time highs. I've held through market corrections/crashes ( I buy a lot more when that happens) and always come out better on the other side. If you think you can time the next market crash, pull your money out and wait on the sidelines. There is no need to try to convince us to do the same.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9hsaps/",
      "created": 1718905298,
      "depth": 0,
      "replies": [
        {
          "id": "l9j1fdq",
          "score": 9,
          "body": "Investing since 2017, quite the old hand here 🤣",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9j1fdq/",
          "created": 1718920442,
          "depth": 1,
          "replies": [
            {
              "id": "l9j64xk",
              "score": 3,
              "body": "Right! That made me crack up.",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9j64xk/",
              "created": 1718922192,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9jqb6e",
              "score": 3,
              "body": "But he has seen some shit tbf...",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jqb6e/",
              "created": 1718930275,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9hfwqk",
      "score": 1,
      "body": "ive dumped in BILS mostly. i get 5% pretty much guaranteed returns.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9hfwqk/",
      "created": 1718901318,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9i05u0",
      "score": 1,
      "body": "Like you said \"Stonks only go up!\"  It can go way up and not inflation because most people invest and never take their money out of the market and spend it.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9i05u0/",
      "created": 1718907856,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9i198u",
      "score": 1,
      "body": "Getting caught with your pants down when a switch happens hurts but ultimately if things start trending downwards just hedge with short positions it's not that dire.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9i198u/",
      "created": 1718908213,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9id1h4",
      "score": 1,
      "body": "I feel like there's gonna be a correction at some point.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9id1h4/",
      "created": 1718912138,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9ifvob",
      "score": 1,
      "body": "Markets are usually making new highs it’s a reason for caution but not a reason to avoid investing.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9ifvob/",
      "created": 1718913084,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9j8kvw",
      "score": 1,
      "body": "Invest based on reason challenge: impossible",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9j8kvw/",
      "created": 1718923121,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9j96f8",
      "score": 1,
      "body": "Well if inflation make my shit mo' money, stonks is mo' money too",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9j96f8/",
      "created": 1718923348,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9jf5dw",
      "score": 1,
      "body": "Find stocks that you believe are undervalued and invest.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jf5dw/",
      "created": 1718925691,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9jlle5",
      "score": 1,
      "body": "Market beating record highs time and time again is literally what is required for charts to go up. That’s literally how a breakout occurs. \n\nIs it weird that there was some digestion today on a day following a big headline? No.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jlle5/",
      "created": 1718928304,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9jol5m",
      "score": 1,
      "body": "Go with the flow, I missed the pandemic rebound because I thought we had one more leg down. Buy when it's going up and sell when it's going down. Granted you take profit along the way and are willing to take some losses at the turn around, you'll be good to go",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jol5m/",
      "created": 1718929554,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9jqp6y",
      "score": 1,
      "body": "You're not gonna convince people on reddit. They don't even remember the last 3 times nvda corrected by over 50% (which has been every 2 years btw, ask me how I know). All it takes is a little bit of weakness.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jqp6y/",
      "created": 1718930436,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9jrr2n",
      "score": 1,
      "body": "Keep in mind most people ultimately lose money when they deviate from the basic hold the market type of investing. Most people telling you not to worry will probably eat shit soon enough but you may too if you think you know better.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jrr2n/",
      "created": 1718930883,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9jumxo",
      "score": 1,
      "body": "Just set a stop loss and don't worry.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jumxo/",
      "created": 1718932108,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9jvyeh",
      "score": 1,
      "body": "People are scared of big numbers and things they don’t understand. NDVA will keep going up in the medium to long term, with a correction here and there.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jvyeh/",
      "created": 1718932672,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9jw6h4",
      "score": 1,
      "body": "I think it’s more likely that it goes the way of tesla stock; rather than completely evaporating in value, it hits a few years of stagnation and respectably steep corrections.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jw6h4/",
      "created": 1718932770,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9k2igi",
      "score": 1,
      "body": "Why do you hate Uber drivers?",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9k2igi/",
      "created": 1718935489,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9k2np8",
      "score": 1,
      "body": "Been around a while. Make money going up in a bubble... Make money coming down in a bubble. Selling covered calls on ATH the whole time. \n\nOnce you take out your fomo... You settle down into a strategy.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9k2np8/",
      "created": 1718935552,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9k7se3",
      "score": 1,
      "body": "I’ll tel’ you why nvda is sky high suddenly.. because AI has entered the ‘top 5 ceo priorities’ since 2023. Just like ‘cybersecurity’ did 5 years ago (check crowdstrike).",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9k7se3/",
      "created": 1718937852,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9kcaa3",
      "score": 1,
      "body": "NVDA is going to solve the mystery of the Flower of Life. If you know what means then you’ll understand why it will be the most valuable company in the world until anyone else can solve anything bigger than the freaking FLOWER OF LIFE itself.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9kcaa3/",
      "created": 1718939970,
      "depth": 0,
      "replies": [
        {
          "id": "l9ki3o2",
          "score": 1,
          "body": "I looked it up but didn’t quite get it. Very intrigued., would u pls explain more",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9ki3o2/",
          "created": 1718942900,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9kdkl7",
      "score": 1,
      "body": "NVDA is overpriced for its earnings.\n\nYour link between stock prices and general inflation is nonsensical.\n\nA huge amount of value can be created or destroyed in the stock market because the theoretical value of a huge number of inert assets is calculated on the basis of the most recent transaction price. This is set by the tiny fraction of the assets actually being bought and sold.\n\nFrom an inflationary perspective the gyrations of such transactions, in which only a minority participate, are irrelevant to the broader economy and hence they are not included in most inflation baskets.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9kdkl7/",
      "created": 1718940603,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9kfvka",
      "score": 1,
      "body": "Everything is going to get more expensive… including stocks. Just don’t hold USD, but hard assets, and leave nothing in banks.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9kfvka/",
      "created": 1718941758,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9kioqz",
      "score": 1,
      "body": "fundamentals matter \n\ntry to predict nvidia's future cash flows and the valuation will make more sense",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9kioqz/",
      "created": 1718943207,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9klsfm",
      "score": 1,
      "body": "But NVDA IS making a lot of money... and remember stock market dosent print money it creates and destroys value.. IF you buy a stock today and tomorrow because X news it is up 500% some will sell some buy and some sell and buy. If for X news it sinks 70% thats value destroyed... you and the big fund will be F... the fund maybe had some puts to hedge that risk\n\nAs for the debt... I am from Argentina and when money realy starts to lose value fast, the safest place to safeguard your wealth is the stock market... will you hold cash bonds??? or shares of a company ??  Thats why stock markets go always up in the long term",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9klsfm/",
      "created": 1718944875,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9l7kjp",
      "score": 1,
      "body": "None of the market crashes throughout history have caused irreperable damage. Why should the next one be any different?",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9l7kjp/",
      "created": 1718959206,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9l8dxa",
      "score": 1,
      "body": "Being at or near all time highs is the norm.  It don't mean shit.\n\n\nThat doesn't mean things won't crumble tomorrow, but if they do, it's not because market is at an all time high\n\n\nFed always has to balance inflation with unemployment...  Right now, inflation is too high still but unemployment is inching up too.  I don't think they're going to ramp up the funds rate\n\n\nAlso market isn't parabolic, it's geometric.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9l8dxa/",
      "created": 1718959808,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9lmdeo",
      "score": 1,
      "body": "If something like the S&P collapses long term then you have more issues to worry about other than what you have invested.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9lmdeo/",
      "created": 1718969067,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9lpk95",
      "score": 1,
      "body": "You are definitely not alone in what you are thinking about the market",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9lpk95/",
      "created": 1718970735,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9lt03a",
      "score": 1,
      "body": "No i'd say 99% of us think its a bubble.  But all we can do is just position for a massive collapse and ride the wave. \n\n  \nEmbrace it, you do more damage trying to time the top ( the hardest).  Bottoms are easy in markets.  \n\n  \n1-10% Dip= who cares\n\n15-25% dip= Alright its over sold buy \n\n30-50% dip= What a crash start layering in\n\n60-90% collapse= this is hit, toss in all you got blood in the streets!! pray and start screaming, throw everything you got at it!! fire it all!!! shut down your internet go outside then come back in 5 years.\n\n  \nall there is to it",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9lt03a/",
      "created": 1718972421,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9lybjh",
      "score": 1,
      "body": "Ai bubble.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9lybjh/",
      "created": 1718974803,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9m3z0t",
      "score": 1,
      "body": "The stock market is NOT the economy. \n\nEspecially so in lower volume price seeking behavior on positive news. Also, rises accelerate near the edges, and this is normal since percentage changes remaining the same on increasingly larger numbers results in increasingly larger unit jumps.\n\nThe money near the edges here only apply to the first shares sold, integrate that down the price ladders.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9m3z0t/",
      "created": 1718977116,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9m63pp",
      "score": 1,
      "body": "You are scared that the stock market is doing what the stock market does? The stock market is almost always near ATH and breaks happen often in a bull market. We are in an easing inflation environment with no fears of a recession what do you think is going to happen?",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9m63pp/",
      "created": 1718977942,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9n84k3",
      "score": 1,
      "body": "Up and to the right until the whole system collapses",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9n84k3/",
      "created": 1718991207,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9nyqaj",
      "score": 1,
      "body": "I understand your fear and I am counting of this 401K to not only give me a great retirement, but to create a lasting legacy for my people (my family), but I have always been a believer in God.  Joy comes in the morning, so no matter what happens, I will dust off my knees and get back at the business of life.  We were never promised everything would be perfect, so I don’t worry about it.  You can take my job (They did, I found another one, I have been hungry, never homeless, but I still had people around me will to help, but even if I had no one, I would meet someone new.  I don’t worry or borrow on things I can’t control.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9nyqaj/",
      "created": 1719000406,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9oendm",
      "score": 1,
      "body": "I suspect insider NVDA (Jensen, etc) are profit-taking. He and others weeks ago announced they planned to sell millions of shares over the coming months. Discuss among yourselves.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9oendm/",
      "created": 1719006070,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9q4s4a",
      "score": 1,
      "body": "The market will go down. Damage will not be irreparable unless you sell at the bottom or jump out a window.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9q4s4a/",
      "created": 1719034019,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9rvc2g",
      "score": 1,
      "body": "Basically they are a bit like Microsoft 20 years ago. They have a product (Microsoft had Windows and Office when in the 90's PCs moved into everyone's homes and offices) that is fundamental to the AI revolution and nobody is anywhere near them to provide a competitive product at the moment. It is one of these companies that happen to be in the right place at the right time to capitalise on and drive technological change. Before it was railroads then oil and gas companies, some pharma comapnies, to certain extent, then said Microsoft. I can see the trend reverse only on specific conditions. Some competitor secretly works on a breakthrough and all of a sudden announces a chipset that beats Nvidia's chipsets and also is so unique that only that company will be able to continue to develop for a while without competition being able to catch on. Idk, maybe something based in quantum computing. Unlikely. Next thing that can affect this stock are tensions in the east between US and China but hey this will affect every other stock. Risk - medium. Another one is if the whole AI turns out to be a dud and not as beneficial as initially thought and anticipated. This will definitely decrease the demand. Seeing how companies already benefit from AI cannot see this as a significant risk. Lastly, something that one cannot ignore is some anti monopoly actions taken by the regulators that will somehow let the competition catch up. The chances of this are pretty high but what impact it will have on the overall company and stock performance will depend on the severity of the actions.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9rvc2g/",
      "created": 1719070042,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9y9glm",
      "score": 1,
      "body": "Bullish. Spy to 600 then huge correction to 550 then  up to 750 and giant sell off to 600 then up to 1000",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9y9glm/",
      "created": 1719173937,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la0jxyp",
      "score": 1,
      "body": "stock price changes for reasons that we don't know - manipulation, fraud, algo trading, misinformation, insider trading, etc. - nvda could go to zero and wipe everyone out on a whim. it is also a bit of a pyramid scheme",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/la0jxyp/",
      "created": 1719210998,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la13vx9",
      "score": 1,
      "body": "People should remember too the history of the stock market is short.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/la13vx9/",
      "created": 1719225351,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la3oqhq",
      "score": 1,
      "body": "Just market fraud friend...just fraud...they own over 90%...Bank runs will end it though",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/la3oqhq/",
      "created": 1719260307,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9he13g",
      "score": 1,
      "body": "Have you looked up company earnings now versus in the past to see if the market is overvalued based on money flows, or is this just a feeling because everything seems “too high”?",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9he13g/",
      "created": 1718900700,
      "depth": 0,
      "replies": [
        {
          "id": "l9j1ckl",
          "score": 1,
          "body": "Shiller CAPE is sky high",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9j1ckl/",
          "created": 1718920414,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9ha482",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9ha482/",
      "created": 1718899404,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9ha4tx",
      "score": 1,
      "body": "No, you just picked the wrong side. It's all made up valuation, but NVDA makes more money than all other things that pretend to make money.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9ha4tx/",
      "created": 1718899411,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9is9tg",
      "score": 1,
      "body": "All this talk of recession and an ai bubble have almost made me believe there won’t be one. I have always believed a recession/bubble popping only happens when no one believes it would happen.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9is9tg/",
      "created": 1718917221,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9j07na",
      "score": 1,
      "body": "I just entered a nvda position today. 100 shares @130$. I’ll sell cc on them and use the cash to buy any dips. The. IV so high it’s going to have to dip a good bit before I really start losing imo. Then I’ll use the cash and buy more. Bring the avg down. Still a lot of powder. I’ll buy another 100 at 120. Another 100 at 110 and so on.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9j07na/",
      "created": 1718920007,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9jy5dn",
      "score": 1,
      "body": "Well, it may depend on who wins the election. A return to Trump will mean lower rates, print baby print and deregulate everything along with maybe some other wild ideas he's tossed around. Biden hasn't publicly put pressure on the fed to lower rates like Trump did in 2018 when he didn't want rates raised.  So, if Trump wins I expect to see new ath's on everything as the m2 supply gets sent into overdrive. Which means buy and hold on to your ass.\n\nWhat we really need is someone to stop playing games with the economy, just because you raise rates and turn off QE doesn't mean you fixed it. The Biden admin is doing other things like canceling debt, that mortgage stuff etc etc. It's all a form of increasing free cash without doing so much printing. They need to stimulate the economy some how without printing because it's obvious what will happen without pumping the m2 supply. So I think if Biden wins, we see stocks continue to go higher, but not as quick as if Trump wins.  Both will eventually lead to another crash. The question is which path will we be on.\n\nEither way, if you feel bearish, buy hard assets, land (like all the billioniares), gold, art etc.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9jy5dn/",
      "created": 1718933634,
      "depth": 0,
      "replies": [
        {
          "id": "l9laiqe",
          "score": 1,
          "body": "I'm no expert so take this w a grain of salt but -  I believe  they can't stop (permanently) printing money now and will continue to do so indefinitely in cyclical form off and on around election cycles creating a liquidity cycle. Bad for the US great for assets.",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9laiqe/",
          "created": 1718961392,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9iwc6e",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9iwc6e/",
      "created": 1718918645,
      "depth": 0,
      "replies": [
        {
          "id": "l9j7dwy",
          "score": 2,
          "body": "Imagine thinking one of the best companies out there is a Ponzi scheme or it’s just gambling. Don’t think you understand how capitalism works if you assume one of the largest companies in the world is inherently worthless lol. ",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9j7dwy/",
          "created": 1718922663,
          "depth": 1,
          "replies": [
            {
              "id": "l9kl45v",
              "score": 1,
              "body": "The value of stocks is what the market thinks its worth, based upon future projections, which can change on a dime, especially if macro conditions change. After the dotcom bust even large companies like MSFT lost 50% of their value and traded sideways for a decade. They were the same good companies before and after the crash, but the market viewed them differently, no longer afforded them the high PE multiple they enjoyed during the bubble.",
              "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9kl45v/",
              "created": 1718944504,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9gy9t7",
      "score": -2,
      "body": "You are not alone, look at a 20 year chart of NDX and its pretty obvious things are chaotic. That being said, no telling what the future holds just be vigilant and don't get caught out in the rain so to speak.",
      "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9gy9t7/",
      "created": 1718895446,
      "depth": 0,
      "replies": [
        {
          "id": "l9hc2z2",
          "score": 2,
          "body": "Chaotic how? Not disputing it but just asking for curiosity.",
          "permalink": "/r/stocks/comments/1dkddts/am_i_alone_here/l9hc2z2/",
          "created": 1718900062,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}