{
  "title": "Hertz Sells $750 Million of Bonds to Strengthen Finances",
  "score": 74,
  "selftext": "(Bloomberg) -- Hertz Global Holdings Inc. increased the size of a junk-bond sale by a third to $1 billion, as the car-rental company works to bolster its balance sheet after a misstep on its electric vehicle fleet.\n\nThe firm priced $750 million of first-lien secured notes maturing in 2029, up sized from $500 million previously, at par to yield 12.625%, according to a person familiar with the matter, tighter than the previous talk of the 12.75% area. The company initially floated a yield in the 13% area to investors.\n\nJPMorgan Chase & Co. is leading the deal. It declined to comment and Hertz didn’t immediately respond to a request for comment.\n\nHertz received a commitment to purchase up to $500 million of the bonds, it said in a morning statement.\n\nThe company is also selling $250 million of second-lien exchangeable notes maturing in 2029. Hertz said it received anchor orders from CK Amarillo LP — a fund set up by Certares Management and Knighthead Capital Management — and another investor to possibly purchase that entire offering.\n\nThose notes were being offered with an 8% coupon and a conversion price between $6 and $7 a share. other people with knowledge of the matter said.\n\nHertz’s 4.625% bond due 2026 fell 4.75 cents on the dollar to 68.25 cents as of 3:30 p.m. Thursday in New York, according to pricing source Trace, on pace for a record closing low. S&P Global Ratings downgraded Hertz following its capital raising announcement, citing higher debt and interest expenses associated with the new bonds, while Fitch Ratings said it was considering doing the same.\n\nSounding Out\n\nBloomberg previously reported that Hertz was sounding out investors on a $500 million senior secured debt financing as well as raising $200 million in convertible bonds.\n\nThe company said it plans to use the net proceeds to pay down a portion of its $2 billion committed revolving credit facility.\n\nHertz also said in a regulatory filing Thursday that it’s accelerating a planned fleet refresh after announcing earlier this year that it would sell a third of its US electric vehicles. The rental company was two-thirds of the way through a planned sale of 30,000 vehicles as of May 31.\n\nThe acceleration is moving more non-cash depreciation into near-term periods. In the second quarter, Hertz expects an adjusted corporate loss before interest, taxes, depreciation and amortization of $435 million to $495 million.\n\nhttps://finance.yahoo.com/news/hertz-starts-750-million-debt-121940603.html",
  "link_flair_text": "Company News",
  "id": "1dkyt38",
  "num_comments": 14,
  "created_utc": 1718957408,
  "permalink": "/r/stocks/comments/1dkyt38/hertz_sells_750_million_of_bonds_to_strengthen/",
  "comments": [
    {
      "id": "l9ltmji",
      "score": 53,
      "body": "How does this strengthen their finances? They now have $1b more in debt at 12.6% APY. They fucked",
      "permalink": "/r/stocks/comments/1dkyt38/hertz_sells_750_million_of_bonds_to_strengthen/l9ltmji/",
      "created": 1718972707,
      "depth": 0,
      "replies": [
        {
          "id": "l9lw27a",
          "score": 30,
          "body": "If they can bring in more then a 12.6% return on capital employed it can be profitable. But... it looks like Hertz has been losing money the last few quarters, and the most profitable quarters in the last few years had just a 4.52% ROCE at best. Meaning each dollar Hertz is borrowing at best will earn them at best 4 and a half cents, while they'll owe 12 and a half cents in extra interest payments, so yeah an 8 cent loss per dollar borrowed isn't a good deal.\n\nAnd the worst part? If I go all the way back to Hertz very best quarter (Q2 in 2008) they only had a ROCE of 9.96% in their very best quarter, so even at their very best Hertz would be losing money on each dollar borrowed.",
          "permalink": "/r/stocks/comments/1dkyt38/hertz_sells_750_million_of_bonds_to_strengthen/l9lw27a/",
          "created": 1718973816,
          "depth": 1,
          "replies": [
            {
              "id": "l9lwa95",
              "score": 12,
              "body": "Solid analysis. I agree completely they are not making more than 12.6% they are losing money.",
              "permalink": "/r/stocks/comments/1dkyt38/hertz_sells_750_million_of_bonds_to_strengthen/l9lwa95/",
              "created": 1718973914,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9q7qf1",
              "score": 1,
              "body": "They are quite fucked",
              "permalink": "/r/stocks/comments/1dkyt38/hertz_sells_750_million_of_bonds_to_strengthen/l9q7qf1/",
              "created": 1719035863,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9lbiwz",
      "score": 26,
      "body": "payday loan",
      "permalink": "/r/stocks/comments/1dkyt38/hertz_sells_750_million_of_bonds_to_strengthen/l9lbiwz/",
      "created": 1718962137,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9l7dle",
      "score": 7,
      "body": "I was wondering why Hertz had so much volume on Thursday, maybe the price has bottomed.",
      "permalink": "/r/stocks/comments/1dkyt38/hertz_sells_750_million_of_bonds_to_strengthen/l9l7dle/",
      "created": 1718959063,
      "depth": 0,
      "replies": [
        {
          "id": "l9mdrv9",
          "score": 16,
          "body": "Why would you a buy a stock that just borrowed 1 billion dollar on 12.6% interest rate? The typical consumer line of credit is under 10%. That shows you how bad Hertz credit score is, they’re borrowing 1 billion and paying above market rates.",
          "permalink": "/r/stocks/comments/1dkyt38/hertz_sells_750_million_of_bonds_to_strengthen/l9mdrv9/",
          "created": 1718980775,
          "depth": 1,
          "replies": [
            {
              "id": "l9o2vqz",
              "score": 4,
              "body": "Member during the pandemic when Hertz set fire to whole fleets of new vehicles? Pepperridge Farms remembers.",
              "permalink": "/r/stocks/comments/1dkyt38/hertz_sells_750_million_of_bonds_to_strengthen/l9o2vqz/",
              "created": 1719001859,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9yryjl",
      "score": 2,
      "body": "Gotta pay for all those bricked Teslas.",
      "permalink": "/r/stocks/comments/1dkyt38/hertz_sells_750_million_of_bonds_to_strengthen/l9yryjl/",
      "created": 1719180635,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9ry5lf",
      "score": 1,
      "body": "They bet harder than Cathie woods on tesla.  They used their own money. Now fail and go bankrupt",
      "permalink": "/r/stocks/comments/1dkyt38/hertz_sells_750_million_of_bonds_to_strengthen/l9ry5lf/",
      "created": 1719071110,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9wkbmp",
      "score": 1,
      "body": "Hertz ads are up though.",
      "permalink": "/r/stocks/comments/1dkyt38/hertz_sells_750_million_of_bonds_to_strengthen/l9wkbmp/",
      "created": 1719151481,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la0p4fe",
      "score": 1,
      "body": "What a train wreck.\n\n  \nEdit: Every time I've rented from Hertz the employees have been great people.\n\nIt's a shame Hertz's management is driving the company off the road.  Again.",
      "permalink": "/r/stocks/comments/1dkyt38/hertz_sells_750_million_of_bonds_to_strengthen/la0p4fe/",
      "created": 1719214654,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9l6slv",
      "score": -8,
      "body": "Bullish",
      "permalink": "/r/stocks/comments/1dkyt38/hertz_sells_750_million_of_bonds_to_strengthen/l9l6slv/",
      "created": 1718958623,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lakf09k",
      "score": 1,
      "body": "A desperation move",
      "permalink": "/r/stocks/comments/1dkyt38/hertz_sells_750_million_of_bonds_to_strengthen/lakf09k/",
      "created": 1719515510,
      "depth": 0,
      "replies": []
    }
  ]
}