{
  "title": "Regulators hit Citigroup, JPMorgan Chase, Goldman Sachs and Bank of America over living will plans",
  "score": 58,
  "selftext": "KEY POINTS\n\n* Banking regulators on Friday disclosed that they found weaknesses in the resolution plans of four of the eight largest American lenders.\n* The Federal Reserve and the Federal Deposit Insurance Corporation said that the so-called living wills of Citigroup, JPMorgan Chase, Goldman Sachs and Bank of America filed in 2023 were inadequate.\n* Regulators found fault with the way each of the banks planned to unwind their massive derivatives portfolios; derivatives are Wall Street contracts tied to stocks, bonds, currencies or interest rates.\n\nBanking regulators on Friday [disclosed](https://www.federalreserve.gov/newsevents/pressreleases/bcreg20240621a.htm) that they found weaknesses in the resolution plans of four of the eight largest American lenders.\n\nThe Federal Reserve and the Federal Deposit Insurance Corporation said that the so-called living wills — plans for unwinding huge institutions in the event of distress or failure — of [Citigroup](https://www.cnbc.com/quotes/C/), [JPMorgan Chase](https://www.cnbc.com/quotes/JPM/), [Goldman Sachs](https://www.cnbc.com/quotes/GS/) and [Bank of America](https://www.cnbc.com/quotes/BAC/) filed in 2023 were inadequate.\n\nRegulators found fault with the way each of the banks planned to unwind their massive derivatives portfolios. Derivatives are Wall Street contracts tied to stocks, bonds, currencies or interest rates.\n\nFor example, when asked to quickly test Citigroup’s ability to unwind its contracts using different inputs than those chosen by the bank, the firm came up short, [according](https://www.federalreserve.gov/newsevents/pressreleases/files/bcreg20240621a3.pdf) to the regulators. That part of the exercise appears to have snared all the banks that struggled with the exam.\n\n“An assessment of the covered company’s capability to unwind its derivatives portfolio under conditions that differ from those specified in the 2023 plan revealed that the firm’s capabilities have material limitations,” regulators [said](https://www.federalreserve.gov/newsevents/pressreleases/files/bcreg20240621a3.pdf) of Citigroup.\n\nThe living wills are a key regulatory exercise mandated in the aftermath of the 2008 global financial crisis. Every other year, the largest US. banks must submit their plans to credibly unwind themselves in the event of catastrophe. Banks with weaknesses have to address them in the next wave of living will submissions due in 2025.\n\nWhile JPMorgan, Goldman and Bank of America’s plans were each deemed to have a “shortcoming” by both regulators, Citigroup was considered to have a more serious “deficiency” by the FDIC, meaning that the plan wouldn’t allow for an orderly resolution under U.S. bankruptcy code.\n\nSince the Fed didn’t concur with the FDIC on its assessment of Citigroup, it was overall deemed to have the less-serious “shortcoming” grade.\n\n“We are fully committed to addressing the issues identified by our regulators,” New York-based Citigroup said in a statement.\n\n“While we’ve made substantial progress on our transformation, we’ve acknowledged that we have had to accelerate our work in certain areas,” the bank said. “More broadly, we continue to have confidence that Citi could be resolved without an adverse systemic impact or the need for taxpayer funds.”",
  "link_flair_text": "Industry News",
  "id": "1dlb1jh",
  "num_comments": 6,
  "created_utc": 1718994621,
  "permalink": "/r/stocks/comments/1dlb1jh/regulators_hit_citigroup_jpmorgan_chase_goldman/",
  "comments": [
    {
      "id": "l9pdz0c",
      "score": 4,
      "body": "What does this mean for us?",
      "permalink": "/r/stocks/comments/1dlb1jh/regulators_hit_citigroup_jpmorgan_chase_goldman/l9pdz0c/",
      "created": 1719020603,
      "depth": 0,
      "replies": [
        {
          "id": "l9peh2h",
          "score": 6,
          "body": "It means nothing",
          "permalink": "/r/stocks/comments/1dlb1jh/regulators_hit_citigroup_jpmorgan_chase_goldman/l9peh2h/",
          "created": 1719020817,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9q6kyf",
          "score": 3,
          "body": "If either of those banks need to be unwound at the moment it could crater the stock market and they would need a bailout. Then again, if any of those fail that would crater the stock market so whos counting anyways",
          "permalink": "/r/stocks/comments/1dlb1jh/regulators_hit_citigroup_jpmorgan_chase_goldman/l9q6kyf/",
          "created": 1719035136,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9qmk4u",
      "score": 4,
      "body": "Sounds like a nothing burger ",
      "permalink": "/r/stocks/comments/1dlb1jh/regulators_hit_citigroup_jpmorgan_chase_goldman/l9qmk4u/",
      "created": 1719046318,
      "depth": 0,
      "replies": []
    }
  ]
}