{
  "title": "The Bull Case for Krispy Kreme (DNUT)",
  "score": 72,
  "selftext": "I feel Krispy Kreme may be undervalued and could represent a good hold over the next 18 months. I've taken a deep dive into the company over the past couple of weeks and currently hold **350 shares**. The fundamentals aren't perfect but I believe there is a lot of potential for growth that is going by underappreciated.\n\n**Business model**\n\nKrispy Kreme sells donuts. They have a long and solid reputation and the business structure is easy to understand. They operate via a \"hub and spoke\" model where donuts are produced and sold at hubs. The donuts are sold at varying other points of access through their \"Delivered Fresh Daily\" (or DFD, for short) scheme. These DFD doors include grocery stores, convenience stores and, most recently, McDonald's, which I believe is key to future growth.\n\n**Value**\n\nKrispy Kreme is currently undervalued at yesterday's closing price of **$11.27**. The average analyst one-year price target is **17.06**. Krispy Kreme is currently unprofitable but is trading at a Price/Sales ratio of 1.1 which is below the hospitality industry average of 1.3.\n\nSince April, one analyst (JP Morgan) have maintained their rating to \"Overweight\", with a price target of $14, while two other analysts have upgraded them to a buy. Most recently, Truist had the following to say (quoted from Yahoo Finance): \n\n*\"Truist Securities upgraded their recommendation on Krispy Kreme to buy from hold, reversing their October downgrade on the stock. The overhang from the drugs known as GLP-1s “is already here,” and fully reflected in the stock’s current valuation, analysts led by Bill Chappell said.*\n\n*Truist’s Chappell said the potential of Krispy Kreme’s new partnership with McDonald’s Corp. — the announcement of which triggered a record surge in the stock — was being undervalued by investors. A nationwide rollout is expected by the end of 2026.\"*\n\nI think it's worth noting that Truist made this upgrade after downgrading the company to a Hold back in October 2023 at the height of the Ozempic concerns.\n\n**Growth**\n\nRevenues have been growing steadily at Krispy Kreme, increasing by 10.54% in 2022 and 10.35% in 2023 annually in the US. Earnings are currently negative, but DNUT is projected to become profitable by next year. Its losses have reduced over the past 5 years at a rate of 16.9% per year.\n\nThere are currently 14,814 global points of access and a further **12,000 points of access** are expected to be added in the US alone by the end of 2026 through their agreement with McDonald's. The team from Truist recently met up with chief executive and finance heads from Krispy Kreme and came away with the view that accelerated revenue growth will be achieved \"well before the McDonald's rollout is complete\". Furthermore, because Krispy Kreme hubs have the potential to reach many more points of access than they currently do, this increased return on capital can be achieved at minimal additional expenditure, in my opinion. I also believe that the profile of customer that likely eat out regularly at McDonald's are not the same clients that would be able to afford/make regular use of appetite suppressant drugs like Ozempic.\n\n*\"We believe the easiest way to get comfortable with the forecast is to simply haircut it,\" the analysts wrote. \"Let's say that it only generates 75% or 50% incrementality post rollout; that still represents +25% or +17% revenue off the existing trailing 12-month U.S. base, and +16% or +11% off the total company TTM revenue base, respectively.*\n\n*Those assumptions would allow the company to easily hit its top-line algorithm of 9% to 11% annual sales growth, which is well above where most packaged goods or restaurants are expected to grow in the next few years, based on industry data, said the note.\"* - Truist.\n\nFinally, I think International Markets are also being underappreciated. The latest opening in Winnipeg had people waiting in line for *hours* for a donut. Paris was also immensely successful. Anecdotally, I can say that doors at my nearest Tesco grocery stores are very popular. The standard glazed donuts are always sold out by the end of the day. Colleagues bring the occasional box of Krispy Kreme into work to share and they feel that Krispy Kreme donuts are tastier than competitors.\n\n**Health**\n\nThis is where a couple of red flags come in, free cash flow and debt. While Krispy Kreme's Debt/Equity ratio has reduced over the past 5 years, it still has a debt/equity ratio of around 70% (as per Simply Wall Street). Free cash flow is negative (-45,769,000 as per the company's last earnings report, which has improved from Q4 of 2023).\n\n**CONCLUSION**\n\nI should preface this by saying that I do not have a lot of experience with deep fundamental analysis, and that this is not financial advice, but I really feel that Krispy Kreme is undervalued at it's current price, and that it can achieve considerable growth over the coming 12-24 months through its business model of increasing points of access both in the US and abroad and increasing the productivity of available hubs. I feel that the company has a clear path to profitability and that current headwinds have been blown out of proportion. Furthermore, the share price has declined steeply from its 40% rise following the announcement of the McDonald's deal for no clear new reasons.",
  "link_flair_text": "Company Discussion",
  "id": "1dm2wh2",
  "num_comments": 58,
  "created_utc": 1719082979,
  "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/",
  "comments": [
    {
      "id": "l9suon9",
      "score": 67,
      "body": "I always love saying the ticker symbol for Krispy Kreme.",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9suon9/",
      "created": 1719083419,
      "depth": 0,
      "replies": [
        {
          "id": "l9tfk4r",
          "score": 28,
          "body": "Deez nut is the first thing that comes to mind lol",
          "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9tfk4r/",
          "created": 1719091431,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9t3wto",
      "score": 29,
      "body": "great crack donut, but hell no to stock....third time this company has come public.  Why should this time be any different than the last two times it went bk",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9t3wto/",
      "created": 1719086975,
      "depth": 0,
      "replies": [
        {
          "id": "la1gvy4",
          "score": 1,
          "body": "Devil's advocate here, good morning. With the rise of GLPs becoming more in fashion, better supply and lower prices, I could see people enjoying their Krispy Kremes again. Maybe you'll eat less at a time but can eat them more often? Total stretch? Yeah probably, but when Atkins and keto was all the rage, donut sales took a major hit.",
          "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/la1gvy4/",
          "created": 1719232422,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9sw53y",
      "score": 41,
      "body": "KK used to be a regular hot and ready staple here, but they have closed many of their stores. Sadly, most new to these donuts will experience them at a McDonalds or their local grocery/convenience store. This is not where you get their best product.",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9sw53y/",
      "created": 1719083985,
      "depth": 0,
      "replies": [
        {
          "id": "l9t2as3",
          "score": 20,
          "body": "Agreed.  Fresh Krispy Kreme donuts are out of this world.  Not fresh is just not the same.",
          "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9t2as3/",
          "created": 1719086358,
          "depth": 1,
          "replies": [
            {
              "id": "l9tspml",
              "score": 9,
              "body": "In college we used to go to KK after getting wasted and they'd let use eat the deformed donuts for free if we got a drink",
              "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9tspml/",
              "created": 1719096812,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9uivaf",
          "score": 3,
          "body": "A lot of folks didnt like their donuts. Too sweet.",
          "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9uivaf/",
          "created": 1719108285,
          "depth": 1,
          "replies": [
            {
              "id": "l9uopyj",
              "score": 6,
              "body": "They should sell just the doughnuts without the icing.  Problem solved.",
              "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9uopyj/",
              "created": 1719111002,
              "depth": 2,
              "replies": [
                {
                  "id": "l9vajos",
                  "score": 6,
                  "body": "So i cant say for sure because its been too long since i tried KK, but i know a little about cooking and donuts thanks to my asian pals. There are different types of flour, some much more expensive than general purpose. One type gives you better moisture retention. With donuts, this flour keeps them in great shape for a day or two. I know a couple of donut places here in san diego who use this better flour and they been around 40+ years.\n\nI also know of a few places who use cheap flour. They tend to do ok but their donuts outright suck if they sit around for a couple of hours because they dry out. The bakers are well aware of the problem so how do you fix it? Glaze. They glaze to lock in moisture so that they can last through the day. I am just guessing here but i think big chains like kk and duncan use this strategy to save on costs. At their scale, it would tons of money and probably increases margin a good 1-2% which is significant when you operating margin is 3% in a good year... Even if they magically got margins up to 15% like most restaurants, that 1-2% is significant.\n\nAnd yea i flipping hate glaze on pretty much anything. It sucks. Though I actually love melted sugar on stuff like Flan especially with a slight burn to it. I also hate sandwich shops that seal bread with butter or mayo. Means they are using cheap bread.",
                  "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9vajos/",
                  "created": 1719123140,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la517c9",
                      "score": 1,
                      "body": "Sounds like the winning move for KK is to carmelize their glaze.",
                      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/la517c9/",
                      "created": 1719278060,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la5tkd6",
                          "score": 4,
                          "body": "If only it were so easy... Its very hard to make mass quantities of plain sugar caramel. Never mind purposely giving it a slight burn. If you let it cook just a few seconds too long it turns nasty and never mind how hard it is to handle before its ready and never mind the atrociously hard cleanup. Also caramel, the good stuff, isnt thick like a glaze. It turns liquidy when cooled and would just turn bread into mush. Thats why we typically use it on top of a hearty base like various forms of custards. Even in bread pudding, the bread is soaked and thick before adding things like real caramel.\n\nIve tried every ready mass produced version of flan here in the USA that I have access to. Much of it from Mexico and some EU and the caramel they come with are all absolute trash. A total travesty and I feel terrible for anyone who has tried any of that off the shelf garbage and thinks this is what caramel tastes like... its not even close.\n\nThe only way to get good caramel on anything like flan or creme brulee is to get it from a cook that prepares it carefully long in advance and they need to have a good patient cook, not some fast food dingleberry who was training to maximize profit margins. Its a very delicate process. Maybe an AI bot can be trained to do it... that would be awesome.\n\nSo yea... i dont think it can be done in mass quantities for things like doughnut glaze. It would require an unholy amount of it to cover trays of doughnuts. It clearly cannot be made in a prepackaged form and shipped around, or at least, no one has made an acceptable version afaik. The minute you add any preservatives, water, fats, thickener or any other ingredient its turns to crap.",
                          "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/la5tkd6/",
                          "created": 1719290074,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "la5y078",
                              "score": 1,
                              "body": "I meant, \"Sprinkle some sugar crystals on top and then hit it with a blowtorch,\" but yeah, there would probably be problems with mass production. Not insurmountable problems, necessarily, but definitely things that would drive up the price per unit.",
                              "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/la5y078/",
                              "created": 1719292461,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l9vm09t",
                      "score": 1,
                      "body": "Good to know.",
                      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9vm09t/",
                      "created": 1719131184,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l9w1x48",
              "score": 0,
              "body": "Their standard glazed icing tastes just like candy corn to me. But yes, slightly too sweet",
              "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9w1x48/",
              "created": 1719142492,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9xlgm2",
          "score": 2,
          "body": "The grocery store ones are pretty good. Admittedly not fresh off the press good, but they are making sure they are fresh.",
          "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9xlgm2/",
          "created": 1719165320,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9svvzm",
      "score": 35,
      "body": "I wouldn’t touch that stock with a 10 foot pole.",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9svvzm/",
      "created": 1719083887,
      "depth": 0,
      "replies": [
        {
          "id": "l9t0wx2",
          "score": 5,
          "body": "Why not?",
          "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9t0wx2/",
          "created": 1719085830,
          "depth": 1,
          "replies": [
            {
              "id": "l9t1zd6",
              "score": 28,
              "body": "nail hard-to-find sip payment plough capable merciful attempt test innate\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
              "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9t1zd6/",
              "created": 1719086238,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9t1kau",
              "score": 10,
              "body": "Their graph looks fucking terrible starting from day 1. They are very old company that had clearly has trouble maintaining itself or let alone growing. Too much competition that is clearly more successful in the business.",
              "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9t1kau/",
              "created": 1719086079,
              "depth": 2,
              "replies": [
                {
                  "id": "l9t540q",
                  "score": 6,
                  "body": "They are an old company, but they are adapting their business model through increased distribution of donuts to new points of access using existing hubs, improving their operating leverage. The plan to add an additional 12,000 points of access is an enormous scale-up. \n\nAlso, Krispy Kreme is still a popular brand. Seeing the response in Paris, and scenes like [this](https://www.reddit.com/r/Winnipeg/comments/1dj5hqj/id_say_the_krispy_kreme_is_popular/) at their new store in Winnipeg makes me optimistic about the future roll-out. Can't find a link but their CEO had mentioned in a recent earnings call that the major reason customers didn't buy their donuts more frequently was limited access, and the McDonald's deal gives that a big boost.",
                  "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9t540q/",
                  "created": 1719087437,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9tt5y8",
                      "score": 11,
                      "body": "They just open in paris, within less than a year shop has barely any clients, priced around 1 donut for 3€++\n\nGive it another year, bet it will close down",
                      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9tt5y8/",
                      "created": 1719097004,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9vgf1e",
                          "score": 1,
                          "body": "It will be the same here in Berlin. r\\/berlin is frothing in the mouth over Krispy Kreme coming here but I am sure in a year they will be a mostly empty novelty. Maybe a good short-term play though, since their revenue will probably be high during the hype.",
                          "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9vgf1e/",
                          "created": 1719127129,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "l9u7xrx",
              "score": 1,
              "body": "The creation of Ozempic",
              "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9u7xrx/",
              "created": 1719103388,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9tyss6",
          "score": 2,
          "body": "I agree. This company is an absolute joke. No creativity no strategy. I remember in late 2000s when they expanded everywhere like idiots and had to close down a lot of those shops.",
          "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9tyss6/",
          "created": 1719099402,
          "depth": 1,
          "replies": [
            {
              "id": "l9xlq38",
              "score": 1,
              "body": "You can say no creativity, but you can't say no strategy. The expansion to grocery stores and Mcdonald is undeniably a strategy.",
              "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9xlq38/",
              "created": 1719165414,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9t4rx9",
      "score": 11,
      "body": "arrest groovy dazzling practice late plough disagreeable sulky tie distinct\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9t4rx9/",
      "created": 1719087307,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9t7a5w",
      "score": 8,
      "body": "I agree with OP and think the stock has significant upside. Even without the McDonalds deal, the ROI for new convenient store set up is 12-18 months to recover the full start up investment. The hub and spoke model may not be ideal for the fresh out of the oven experience but better for fast pick up sales at high frequent locations without the overhang of a stand alone model \n\nThey also have an extensive growth plan that includes more international expansion with a target of 75,000 points of access.",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9t7a5w/",
      "created": 1719088264,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9wc2pp",
      "score": 3,
      "body": "Team up with wegovy/mounjaro. \n\nFor every injection, you can enjoy a complementary 12 Krispy Kremes box (voucher) guilt free.\n\nThe partnership potential is obvious.",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9wc2pp/",
      "created": 1719147882,
      "depth": 0,
      "replies": [
        {
          "id": "l9xuoon",
          "score": 2,
          "body": "Make sure to diversify your portfolio with companies developing medication for pancreatic insufficiency.",
          "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9xuoon/",
          "created": 1719168648,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9swr0n",
      "score": 7,
      "body": "This has been a great short. I buy puts every time I see message board promoters hyping this nonsense ticker.",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9swr0n/",
      "created": 1719084215,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9v9u66",
      "score": 2,
      "body": "They're not just building out their distribution for McDonald's right now, but also to increase product flow to their current partners, and plan to use retail and pharmacy space to achieve 100,000 points of access. Current reading say's the CEO is optimistic of the partnership, because he wants to go back and show other clients that this is a more than capable model. As of now you can only find Krispy Kreme donut's in a handful of these locations, and they want all of them nationwide, inside readily made cabinets available in most locations. If you look there at current offerings they only have 356 stores in the US alone currently, and around 14,000 points of access, this is extremely low compared to their competitors including McDonald's.\n\n  \nLocations Included:\n\n* Kroger\n* Albertson's\n* Walmart\n* Target\n* Publix\n\nCompetitors:\n\n* McDonald's - 14,300 locations/US - Price - $259.39\n* Starbucks - 17,068 - locations/US - Price - $79.91\n* Dunkin Donuts - 8600 locations/US - Last Stock Price $106.50\n\n\n\nThey are stepping away from CPG (Consumer Packaged Goods), and going a DFD route to insure that their donut's are delivered daily and fresh, using that hub and spoke model to deliver to an expected 75,000 to 100,000 as they call them doors. They're building out their trucks to have warmers and insulators to keep the donuts warm during transport, and using automation to increase the productivity workflow. This would also allow them to scale the business to quickly close underperforming \"doors\", that aren't meeting goals.\n\nA lot of people will be trying Krispy Kreme worldwide for the first time by the end of 2026, and they'll be guaranteed fresh, I'm definitely in.",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9v9u66/",
      "created": 1719122673,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc2udow",
      "score": 2,
      "body": "Write up in light of side effects of new weight loss drugs:\n\n\n[DNUT](https://borncrisis.com/blog/krispy-kreme-stock-dnut/)",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/lc2udow/",
      "created": 1720378497,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9v4xxq",
      "score": 3,
      "body": "Short. Stock will ultimately go to $2 dollars.",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9v4xxq/",
      "created": 1719119593,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9u4jjd",
      "score": 3,
      "body": "Why are you avoiding talking about cash flows, earnings, and balance sheet? Do you do this maliciously or purely ignorance? Or to suit your narrative and agenda to promote this stock?",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9u4jjd/",
      "created": 1719101894,
      "depth": 0,
      "replies": [
        {
          "id": "l9vd29f",
          "score": 8,
          "body": "I’ve literally said that the company is unprofitable, that cash flows are negative and that they are high on debt. So I’ve commented on all three of those factors, while trying to put together a bull case for the stock. I could talk about the company all day but didn’t want a post that was too long that it would put users off of a discussion. Maybe read through the post next time you consider accusing somebody you haven’t met or being malicious or ignorant. ",
          "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9vd29f/",
          "created": 1719124811,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9t8bwy",
      "score": 1,
      "body": "Wheel strategy? I don’t know much about anything but I like the product",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9t8bwy/",
      "created": 1719088662,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9xkuxb",
      "score": 1,
      "body": "I think their donuts are too sweet for me nowadays and the stock is too rich.",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9xkuxb/",
      "created": 1719165104,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la02jcp",
      "score": 1,
      "body": "This is the very same post that was up in another forum last week.  Jeez, give it a break.",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/la02jcp/",
      "created": 1719200736,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la0qqcl",
      "score": 1,
      "body": "Another seemingly solid pick is PZZA\n\nI'm drawn to them from a valuation standpoint. But I just don't know about their execution. Lot remains to be seen and leaves a lot to be desired\n\nMarket simply doesn't see the growth either so doesn't reward them with a higher multiple",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/la0qqcl/",
      "created": 1719215843,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la2lei8",
      "score": 1,
      "body": "Be careful with this stock in the past 5 years  -48% in stock and has not seemed a potential growth or plan for the future to see an increase in overall sales",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/la2lei8/",
      "created": 1719247334,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbakwys",
      "score": 1,
      "body": "Not looking so good right now - hopefully it will recover",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/lbakwys/",
      "created": 1719932700,
      "depth": 0,
      "replies": [
        {
          "id": "lbapd9n",
          "score": 1,
          "body": "Nope. It’s at historic support levels. Having a quick glance at the bollinger bands suggest we may be bottoming out. I still believe in the upside, but I’m in it for the long haul. ",
          "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/lbapd9n/",
          "created": 1719934191,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9tlpsk",
      "score": 1,
      "body": "They aren’t profitable and they are a retail business.  It doesn’t get simpler than that to be honest. Might be a solid short though",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9tlpsk/",
      "created": 1719093888,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9tqneg",
      "score": 1,
      "body": "One of the first lessons I learned in Marketing Class was how Krispy Kreme was a business failure until recently. \n\nThey expanded too quick and the product was sub quality for many years throughout the early 2000s.they sold KK donuts en masse in grocery stores...which defeats the purpose of fresh donuts.  Only recently did they dump their old strategies with a change in management. They were also falsifying profits for a very long time to satisfy shareholders. \n\nThat being said, they have turned it around in recent years and both their coffee and donuts are solid imo. \n\nBut like many things, I don't invest in something I don't regularly use or purchase. And KK is a rare treat for myself. So its a hard sell imo.",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9tqneg/",
      "created": 1719095949,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9u24fv",
      "score": 1,
      "body": "only their freshly made donuts are special. but anyone's freshly made donuts taste great. you just can't scale up freshly made donuts in an efficient manner.  their regular stuff tastes similar or worse compared to other donut shops.",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9u24fv/",
      "created": 1719100840,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9uooxt",
      "score": 1,
      "body": "Yada yada yada donuts. I’ll purchase $2000 shares Monday.",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9uooxt/",
      "created": 1719110989,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9ucnne",
      "score": 0,
      "body": "Too much debt, not enough profit, gtfo",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9ucnne/",
      "created": 1719105496,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9vzyod",
      "score": 0,
      "body": "Agreed",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9vzyod/",
      "created": 1719141292,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9wo5pi",
      "score": 0,
      "body": "the ma and pop stores make better donuts and they taste good all day long, just not out of oven",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9wo5pi/",
      "created": 1719153015,
      "depth": 0,
      "replies": [
        {
          "id": "li6jfaz",
          "score": 1,
          "body": "Wet paper towel…lightly wrap donut in it and microwave for exactly 8 seconds….just like off the line…problem solved. It isn’t rocket science. I’ve ate their donuts and others after 3-4 days no prob.",
          "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/li6jfaz/",
          "created": 1723690531,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9u6zmh",
      "score": -1,
      "body": "Stock hasn’t done anything relevant besides drop in 10 whole years",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9u6zmh/",
      "created": 1719102968,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9suxrq",
      "score": -9,
      "body": "Personally, I love KK coffee. KK's coffee is superb. but the donuts are trash.\n\nDunkin has great coffee AND great donuts. \n\n11.27 is cheap. Ill think about it. but if KK admitted it had to step up its donut game I would look closer.",
      "permalink": "/r/stocks/comments/1dm2wh2/the_bull_case_for_krispy_kreme_dnut/l9suxrq/",
      "created": 1719083519,
      "depth": 0,
      "replies": []
    }
  ]
}