{
  "title": "What is going on at Southwest Airlines? Is there disaster lurking in the shadows?",
  "score": 92,
  "selftext": "After COVID-19 the airline industry started to [experience a shortage of pilots.](https://www.oliverwyman.com/our-expertise/insights/2021/mar/after-covid-19-aviation-faces-a-pilot-shortage.html) This shortage is [still on going and of concern for regional airlines.](https://www.travelweekly.com/Travel-News/Airline-News/Pilot-shortage-still-concern-regional-airlines)\n\nIn February 2023, [Southwest Airlines lowered the turbine time requirement ](https://www.dallasnews.com/business/airlines/2023/02/06/southwest-airlines-lowers-requirements-for-new-pilots/) for new pilot applicants from 1,000 hours to only 500.\n\nAs of this year, Southwest has experienced three incidents that have made the news and warranted investigation by the FAA\n\nMarch 23, 2024: On approach to LaGuardia Airport, [a Southwest Airlines flight veered off course and flew close to the air traffic control tower.  ](https://www.nbcnews.com/news/us-news/faa-investigating-southwest-airlines-flight-flew-close-tower-laguardia-rcna146542) This incident is currently under review by the FAA.\n\nApril 11, 2024: Shortly after takeoff from Daniel K. Inouye International Airport [a Southwest Airlines flight plunged to within 400 feet of the ocean](https://www.usatoday.com/story/travel/airline-news/2024/06/17/southwest-flight-2786-hawaii-ocean-faa-investigation/74122119007/) before pilots pulled up to avoid a crash. This incident is currently under review by the FAA\n\nJune 19, 2024: On approach to Will Rogers Airport, [a Southwest Airlines flight descended to less than 500 feet 9 miles short of the runway](https://www.usatoday.com/story/travel/airline-news/2024/06/21/southwest-airlines-plane-plunges-oklahoma-city-faa/74167295007/) in Oklahoma City before an altitude warning from air traffic control caused pilots to correct the mistake. This incident is currently under review by the FAA.\n\nThese incidents all appear to be pilot error, but we will have to wait for the official FAA report for confirmation.",
  "link_flair_text": "Discussion",
  "id": "1dmcudx",
  "num_comments": 55,
  "created_utc": 1719112753,
  "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/",
  "comments": [
    {
      "id": "l9usbdr",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 1587 | **Previous Best DD** | \n**Account Age** | 14 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9usbdr/",
      "created": 1719112759,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9uyija",
      "score": 255,
      "body": "i only read the first two assumptions and they’re both wrong or at least vague.  there isn’t a pilot shortage there’s qualified captain shortage.  southwest absolutely did not reduce the requirement for new pilots to 500 hours, the FAA requires 1500 hours minimum, no commercial carrier can undercut that.  what they may have reduced was the preferred multi turbine time but that has likely gone back up and regardless southwest isn’t hiring the rest of the year.  they have enough pilots.",
      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9uyija/",
      "created": 1719115934,
      "depth": 0,
      "replies": [
        {
          "id": "l9w3qtm",
          "score": 130,
          "body": "Don't bring facts into a good trash talk post.",
          "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9w3qtm/",
          "created": 1719143553,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9x7n4t",
          "score": 10,
          "body": "Not completely true about the 1,500. An associates degree in aviation makes it 1,250 and a bachelor’s degree in aviation makes it 1,000. Military is 750. Also keep in mind these are requirements to apply for an Airline Transport Pilot certificate. Not apply to an airline. Lots of airlines offer there own version of a “gateway” program. Where they’ll hire you as low as 0 hours, but require you to work/build hours at specific places. Once you hit ATP minimums they’ll bring you back in and provide the training for the certificate. As long as you pass you start working for that carrier. It’s not as cut and dry as you’re suggesting.",
          "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9x7n4t/",
          "created": 1719160287,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9wsngj",
          "score": 9,
          "body": "500 hours turbine time 1500 total",
          "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9wsngj/",
          "created": 1719154728,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9xgm2b",
          "score": 6,
          "body": "Pilots are spending less time at the regionals than ever. That’s where they’ve typically built up experience with most becoming captains before moving into other airlines and larger airplanes. \n\nIt’s no coincidence that experience at legacies and SWA have gone down dramatically and there have been an increase in incidents like this. Just because hiring mins haven’t changed doesn’t mean competitive time hasn’t changed. Wasn’t that long ago people needed 4-5,000hrs to be competitive for a legacy job. Now people are getting hired with 2-2,500hrs. Couple that with quick upgrade times and you have two relatively inexperienced people flying together.",
          "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9xgm2b/",
          "created": 1719163566,
          "depth": 1,
          "replies": [
            {
              "id": "l9y04gj",
              "score": 2,
              "body": "and forcing first officers to upgrade whether they feel ready or not.",
              "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9y04gj/",
              "created": 1719170616,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9uzdz6",
          "score": -64,
          "body": "You are correct. I corrected the wording, as the requirement is for pilot applicants.",
          "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9uzdz6/",
          "created": 1719116413,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9v3pu8",
      "score": 52,
      "body": "I bought Delta because the ratings were good. Then I got American when it went down to like 11 something a share. And then I got Southwest when that weirdo bought a big stake. I feel like a total regard.\n\nEven Warren Buffett knows that airlines stocks are regarded.\n\nI should’ve bought United and Alaska and maybe Skywest. \n\nNow, I have to wait till these sideways movers gain enough altitude that I can get my money back out of them.\n\nI spent a whole freaking month watching NVDA throw money at you people while I’m stuck in goddamn airline stocks waiting for DAL to go to the moon lol fml",
      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9v3pu8/",
      "created": 1719118861,
      "depth": 0,
      "replies": [
        {
          "id": "l9wfm8q",
          "score": 9,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9wfm8q/",
          "created": 1719149480,
          "depth": 1,
          "replies": [
            {
              "id": "l9wfy0f",
              "score": 8,
              "body": "Oh man. I’m in KHC too (and Ford, about which there was a shitty cope post here last night). “If it’s good enough for Berkshire Hathaway portfolio, it’s good enough for mine,” said I.\n\nIt’s like I came into a casino and bought a savings bond. Fuck sakes.",
              "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9wfy0f/",
              "created": 1719149625,
              "depth": 2,
              "replies": []
            },
            {
              "id": "la824p7",
              "score": 1,
              "body": ">what's more American than Katchup and hot dogs and macaroni and cheese\n\nThat's changing to Sala, Beef (preferable steak), and Tortillas and Queso. Outside of changing demographics, changing preferences is relegating those staples to 4th of July type cook out's for 'traditional' Americans.\n\nI'd finally argue what's more American is buying the store brand, especially now with inflation younger generations have never seen before. I mean, it was all fun to spend 20% more on the name brand and act better then us poors eating kirkland whatever, but then brands kept marking their product up more until people got a reality check and noticed it was unsustainable for their budget and dumb in retrospect. Once the brands lost those customers, even heavy sales are hard to bring them back. If it tastes the same, or now better because you can buy 100% beef, instead of bologna, in an intestine sleeve for less $, why the hell would you go back to over paying even 20% more? Don't believe me, I don't care, I know what my local stores have to discount, then ultimately throw away. The Genie is not going back into the bottle for at least 50% of the people forced to do something slightly different then their everyday life routine.",
              "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/la824p7/",
              "created": 1719331486,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9whpig",
          "score": 3,
          "body": "You should look up the value of airline’s outstanding frequent flyer miles compared to market cap\n\nhttps://www.wsj.com/articles/are-frequent-flier-programs-really-worth-more-than-airlines-11615810430",
          "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9whpig/",
          "created": 1719150385,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la1iml9",
          "score": 1,
          "body": "I did the opposite thing, I bought the turbine companies that make airplanes fly. It's actually gone really well.",
          "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/la1iml9/",
          "created": 1719233221,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9vd0tz",
      "score": 20,
      "body": "All casual travellers only look at prices to book a flight, airlines have no margins.",
      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9vd0tz/",
      "created": 1719124783,
      "depth": 0,
      "replies": [
        {
          "id": "l9wj1ra",
          "score": 4,
          "body": "Yup for me it’s cheapest direct flight, I don’t travel for work at the moment so don’t care about all the loyalty shit they have. But I know people who are religious about Delta",
          "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9wj1ra/",
          "created": 1719150949,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la2pses",
          "score": 1,
          "body": "The industry is so strange. The airlines don’t generally own or operate the airports, they’re all flying the same planes, and there are heavy and consistent regulations they all have to follow. The average traveler is flying every 2-3 years or maybe a couple times a year on the high end, and their experience is going to be mostly determined by external conditions at the time they’re flying. Add in that air travel is expensive and most people are going to look to do it cheap and prices get pushed down.\n\nThere’s not a lot of space for airlines to compete against each other and the differences they can make probably aren’t going to be noticed by someone flying infrequently. These are the same companies that had to be bailed out a week into the lockdowns, I just don’t see any real upside to investing in them.",
          "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/la2pses/",
          "created": 1719248782,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9wwgan",
      "score": 6,
      "body": "Bullish on southwest (I am flying southwest on a 737 next month and am in denial)",
      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9wwgan/",
      "created": 1719156160,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9uzh2y",
      "score": 17,
      "body": "No, there is no diaster lurking in the shadows.\n\nInstead, there is a diaster lurking in full daylight.",
      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9uzh2y/",
      "created": 1719116458,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9ux5nl",
      "score": 7,
      "body": "I got burned bad on American 3-4 weeks ago \n\nI’m staying away from airlines",
      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9ux5nl/",
      "created": 1719115218,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9x78am",
      "score": 2,
      "body": "Your not allowed to mention why on reddit it's like the atf but 3 other letters",
      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9x78am/",
      "created": 1719160138,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la0bmoo",
      "score": 2,
      "body": "DIE hires and Clot shots are great for business !\n/S",
      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/la0bmoo/",
      "created": 1719205696,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9y4pzw",
      "score": 2,
      "body": "We are losing standards to be a doctor too. DIVERSITY!",
      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9y4pzw/",
      "created": 1719172263,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9w5atb",
      "score": 1,
      "body": "I quit southwest job a few years back..the company was going the wrong way then..I can only imagine what it is today..with all the earnings and news coming out..it’s gotten worse..smh.",
      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9w5atb/",
      "created": 1719144429,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la037g2",
      "score": 1,
      "body": "I didn’t read all of your post but this past week I had to fly Southwest round trip \n\n1. They don’t allow you to book your seat, even flying business select…all you get for business select is priority boarding and no penalties for changing your flights. (Having to sit amongst the poors really makes me want to fly another airline next time I need to make the trip) \n\n2. WTF happened to getting honey roasted nuts on a flight?? Is this some poor airline thing? \n\n3. Our flight was delayed because they had to swap out the aircraft they were going to fly us in. \n\nSeems like they’re cutting corners and it’s ruining the experience and possibly going to end in some sort of incident. \n\n3/10 I’ll be looking at other airlines next time I fly. \n\nProbably need to take a put position on these fucks",
      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/la037g2/",
      "created": 1719201079,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9vjsgr",
      "score": 1,
      "body": "I'm on board with Southwest shares despite the turbulence here, pun intended. I believe Elliott will manage to return shareholder value and bring in new management within the year. Now - whether or not they can do it in the way that's beneficial to Southwest in the long-term, or even society in general, not so sure.\n\nBut when I see a racehorse being given heroin and put on the track, I'm betting on that horse today.",
      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9vjsgr/",
      "created": 1719129558,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9vct3n",
      "score": -1,
      "body": "Great, just booked a flight probably a Boeing airplane too",
      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9vct3n/",
      "created": 1719124639,
      "depth": 0,
      "replies": [
        {
          "id": "l9vt178",
          "score": 12,
          "body": "Southwest only flies 737s lol",
          "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9vt178/",
          "created": 1719136466,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9uwooc",
      "score": -12,
      "body": "All of these incidents can be explained by the lack of training really. A bunch of noobs should  not be flying commercial airplanes with hundreds of lives onboard. Is this specific to Southwest? If so, I will keep this in mind when flying domestic",
      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9uwooc/",
      "created": 1719114974,
      "depth": 0,
      "replies": [
        {
          "id": "l9v0nf0",
          "score": -2,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9v0nf0/",
          "created": 1719117105,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9uz0uc",
          "score": -12,
          "body": "I haven’t looked at the requirements for new pilots at the other airlines. A YouTube channel I watch pointed out that this was the third such incident in the past few months for Southwest, and I looked to see if there was any changes in their required experience for pilots and that’s when I came across the article from 2023.",
          "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9uz0uc/",
          "created": 1719116212,
          "depth": 1,
          "replies": [
            {
              "id": "l9vxezw",
              "score": 6,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9vxezw/",
              "created": 1719139615,
              "depth": 2,
              "replies": [
                {
                  "id": "l9w0272",
                  "score": 4,
                  "body": "This is wsb, it's tradition",
                  "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9w0272/",
                  "created": 1719141354,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "l9zfssy",
      "score": -1,
      "body": "Pilots should have ratings based on test scores, experience and flight safety record. Then flights and pilot pay can be priced accordingly.",
      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9zfssy/",
      "created": 1719190464,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9uzr4x",
      "score": -3,
      "body": "Wouldn't the low altitude incidents be more of an issue with the aircraft instead of the pilots?  Isn't there supposed to be altitude warnings?  Or the gauge that tells you your altitude?  Along with what caused the descent in the first place?  \n\nMy gut says it's a Boeing issue, but I have no facts to support that.",
      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9uzr4x/",
      "created": 1719116613,
      "depth": 0,
      "replies": [
        {
          "id": "l9v0n3d",
          "score": 2,
          "body": "> Wouldn't the low altitude incidents be more of an issue with the aircraft instead of the pilots? \n\nNo. For the Hawaii incident\n\n[The memo indicated a “newer” first officer was flying at the time and inadvertently pushed forward on the control column, the outlet wrote.](https://www.usatoday.com/story/travel/airline-news/2024/06/17/southwest-flight-2786-hawaii-ocean-faa-investigation/74122119007/)\n\nFor the Oklahoma incident, its possible [pilot fatigue](https://youtu.be/Mb3PNASDbh4?t=276) as there is no indication that there was a problem with the aircraft.",
          "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9v0n3d/",
          "created": 1719117100,
          "depth": 1,
          "replies": [
            {
              "id": "l9v120a",
              "score": -7,
              "body": "Regardless of whether the pilot made the plane go down or not, it should have started beeping or freaking the fuck out telling the pilots there was an issue.  If ATC received a notification, the cockpit should have had a similar notification.",
              "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9v120a/",
              "created": 1719117330,
              "depth": 2,
              "replies": [
                {
                  "id": "l9v9i4r",
                  "score": 6,
                  "body": "Incorrect. \n\nsource: 737 pilot.",
                  "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9v9i4r/",
                  "created": 1719122453,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9vawwl",
                      "score": 0,
                      "body": "? Gpws?\n\nAlso does anyone else have the guys annunciation stuck in their head? Wind  Shear  A head Wind Shear  A head",
                      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9vawwl/",
                      "created": 1719123381,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9vb3x3",
                          "score": 2,
                          "body": "Low altitude alerts from ATC are not the same as GPWS in the aircraft. ATC has minimum vectoring altitudes (MVA). If you dip below them, they have to give you a low altitude alert. The GPWS is a terrain avoidance system. If the plane doesn’t sense a conflict *yet* it won’t yell at you, but ATC might be.",
                          "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9vb3x3/",
                          "created": 1719123509,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "l9vd40n",
                              "score": 1,
                              "body": "The LRRA activates at 2k ft I believe and all these incidents were below that. Would the gpws have been sternly annunciating at them? It senses they are descending into terrain while not on glideslope? I'm not a pilot but technician.",
                              "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9vd40n/",
                              "created": 1719124845,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "l9vdepg",
                                  "score": 2,
                                  "body": "GPWS isn’t about altitude alone. It accounts for terrain, speed, vertical speed, etc. \n\nSo, maybe .. maybe not. \n\nRadar altimeter activates at 2500 on Southwest 737s.",
                                  "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9vdepg/",
                                  "created": 1719125043,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "l9vjdb8",
                      "score": -2,
                      "body": "\"source: 737 pilot.\"  Uh, question: ... 737 ***MAX***?",
                      "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9vjdb8/",
                      "created": 1719129250,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "l9vv3o0",
                          "score": 5,
                          "body": "Per the FAA if you can fly one, you can fly them all. \n\nYes, I also fly the MAX.",
                          "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9vv3o0/",
                          "created": 1719137981,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l9y0a36",
                  "score": 1,
                  "body": "Nope, since the crew was cleared for a visual approach, they probably had the altitude selector set for either the field elevation or for pattern altitude in the event that they need to do a go around. The altitude selector will give an aural warning when +/- 1000 feet during a climb or decent to the selected altitude, and gives a 200 foot buffer when it’s in hold mode, and it gives just the single aural to notify the pilots that they are leaving the selected. \n\nHaving the aircraft “freak the fuck out” is in most cases poor aircraft design (the only exception is a GPWS mode 2 activation “whoop whoop, pull up”, as the alarms constantly go off this would \n1. Hinder communication between the pilots\n2. If done enough, will create a “boy who cried wolf” type situation.\n\nChances are that the Southwest crew was fatigued (has the same effects as moderate alcohol impairment) and they probably lined up with a road  that looked like a runway.\n\nSource: I’m a heavy jet pilot",
                  "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9y0a36/",
                  "created": 1719170674,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "l9viorj",
          "score": -2,
          "body": "No, those are not due to the aircraft, you conspiracy theorist. It's because Southwest has made it a priority to have at least 50% of its pilots be women and minorities.",
          "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9viorj/",
          "created": 1719128762,
          "depth": 1,
          "replies": [
            {
              "id": "l9w0eo7",
              "score": 2,
              "body": "This could have been worded differently but it isn’t necessarily wrong. The point being that the push to be pc makes hiring pilots because of their sex/race slightly more important than hiring the best qualified pilots. Obviously not the best practice. Additionally during the pilot shortage airlines brought on a huge number of new f/o’s. With that volume there are bound to be some mistakes made. All that being said there are a lot more factors at play in those incidents than one person making one mistake. To make it to the airlines you HAVE to be pretty competent. Period!Without fully understanding the rigors and complexity of flying, the training involved, the countless rules attached, the environment that flying exists in and the particulars of each event one cannot accurately point a finger at either an individual event or an overarching problem.",
              "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/l9w0eo7/",
              "created": 1719141571,
              "depth": 2,
              "replies": [
                {
                  "id": "la1epdn",
                  "score": 1,
                  "body": "Cool apologia for a complete fucking asshole above. \n\nMediocre white dudes exist in goddamn droves. In fact, nearly all of human suffering throughout recorded history has been at the hands of mediocre white guys. Even more boring shit like the invention of TGI Friday’s and Applebee’s were the result of some mediocre white guy.",
                  "permalink": "/r/wallstreetbets/comments/1dmcudx/what_is_going_on_at_southwest_airlines_is_there/la1epdn/",
                  "created": 1719231376,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}