{
  "title": "Nvidia Sales Grow So Fast That Wall Street Can’t Keep Up. Chipmaker’s revenue beats have made projections difficult",
  "score": 999,
  "selftext": "",
  "link_flair_text": "News",
  "id": "1dmtivi",
  "num_comments": 119,
  "created_utc": 1719169409,
  "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/",
  "url_overridden_by_dest": "https://www.bloomberg.com/news/articles/2024-06-23/nvidia-sales-grow-so-fast-that-wall-street-can-t-keep-up?srnd=homepage-americas",
  "comments": [
    {
      "id": "l9xwtcb",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9xwtcb/",
      "created": 1719169413,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9xy7uv",
      "score": 429,
      "body": "[removed]",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9xy7uv/",
      "created": 1719169928,
      "depth": 0,
      "replies": [
        {
          "id": "l9y682q",
          "score": 58,
          "body": "All in on 0DTE",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9y682q/",
          "created": 1719172793,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9zhqjf",
          "score": 24,
          "body": "Start paying some dividends NVDA!",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9zhqjf/",
          "created": 1719191302,
          "depth": 1,
          "replies": [
            {
              "id": "la143ou",
              "score": 2,
              "body": "They already do",
              "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la143ou/",
              "created": 1719225492,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9yrdlt",
          "score": 6,
          "body": "i wonder if the company pays their employs well",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yrdlt/",
          "created": 1719180407,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9y178o",
          "score": 5,
          "body": "![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9y178o/",
          "created": 1719171003,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9xz8q9",
      "score": 337,
      "body": "Nvidia beats earning \"expectations\" by 2 billion for the past 4 quarters. Very hard to predict indeed",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9xz8q9/",
      "created": 1719170298,
      "depth": 0,
      "replies": [
        {
          "id": "l9y2yyw",
          "score": 92,
          "body": "It's a matter of percent growth. Not saying it's not overpriced rn but what other major company has growth like nvidia rn?",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9y2yyw/",
          "created": 1719171638,
          "depth": 1,
          "replies": [
            {
              "id": "l9y66ux",
              "score": 117,
              "body": "None, and maybe its like that for a reason. Capitalism typically doesn't allow 50% margins on quarterly 25 billion revenue.",
              "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9y66ux/",
              "created": 1719172781,
              "depth": 2,
              "replies": [
                {
                  "id": "l9ye6xd",
                  "score": 54,
                  "body": "It’s truly wild the scale and margins they are operating on….",
                  "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9ye6xd/",
                  "created": 1719175581,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9yzmzt",
                      "score": 28,
                      "body": "Well when the cost to start up competition it makes sense. Not only does it take billions, but so many countries are involved in the full product that you’d likely need to line some pockets too",
                      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yzmzt/",
                      "created": 1719183672,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "l9zxo2v",
                      "score": 27,
                      "body": "I worked with nvidia gpus for the past 25 years and when the stock started skyrocketing I figured it was a bubble.   it absolutely shocked and confused me that their earnings basically did a 10x in a few months til I saw what they did, they increased the ASP of their products by 10x.   $40,000 for a high end gpu just made no sense to me.  But they charge whatever they want as long as they are the only option available.",
                      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9zxo2v/",
                      "created": 1719198365,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la041o9",
                          "score": 15,
                          "body": "Look at /r/localllama and you'll understand why.\n\nYou can run LLMs locally, but your only feasable option is to do it with Nvidia cards. You need a lot of video memory to do it. Amd isn't a option because the  tooling does not work well (yet) for AMD GPUs.\n\nTheir only competitor might be Apple. The M2 max Mac Studio can be ordered with 192GB of ram. It's slow now, but people are waiting for the M4 version.",
                          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la041o9/",
                          "created": 1719201513,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "la0ozji",
                              "score": 6,
                              "body": "I mean local deployment of LLMs on (relatively) small GPUs (like RTX 4080) says nothing about huge GPUs like H100 or B100 and their prices. It doesn't necessarily scale that way; there could be specialized chips for LLM inference/training that turn out to be cheaper to scale.\n\nMaybe we'll see more TPUs in the future that are more efficient both performance and cost wise",
                              "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la0ozji/",
                              "created": 1719214553,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "la119kl",
                  "score": 4,
                  "body": "Capitalism also relies on competition, which NVDA has swallowed whole. AMD has an uphill battle to fight, the CUDA moat is insane.",
                  "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la119kl/",
                  "created": 1719223590,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la2ow01",
                      "score": 1,
                      "body": "What makes CUDA such a moat?",
                      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la2ow01/",
                      "created": 1719248481,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la3k3lj",
                          "score": 2,
                          "body": "I've only written a few small programs in it, but one huge advantage is that writing it isn't too different from writing C. The all-purpose framework is called OpenCL and that language is ugly as fuck and kind of annoying to learn. I think NVIDIA's compiler is super sophisticated and builds a huge graph to optimize data movement and such. It's also just annoying for developers to support multiple parallel compute frameworks and since CUDA is the gold standard they might just write that one and call it quits.",
                          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la3k3lj/",
                          "created": 1719258794,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "la1wlyv",
                  "score": 1,
                  "body": "well apparently it does...",
                  "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la1wlyv/",
                  "created": 1719238874,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "l9yk1la",
              "score": 28,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yk1la/",
              "created": 1719177635,
              "depth": 2,
              "replies": [
                {
                  "id": "l9ynftx",
                  "score": 13,
                  "body": "More curious about how much revenue these guys can generate with the chips. Is what we are seeing basically a shift of money from the excess engineers stockpiled at Fanmag to Nvidia's hardware?",
                  "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9ynftx/",
                  "created": 1719178902,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9zy12b",
                      "score": 5,
                      "body": "No doubt someone will make $, but for something like Google the question is whether they will make less with their new (costly) products than their old ones",
                      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9zy12b/",
                      "created": 1719198535,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la25fjj",
                          "score": 2,
                          "body": "Protein folding and other advances in biomedicine Google's Deep Mind is doing could revolutionize health and human life far more than LLMs will. And all this future advances depend on GPUs",
                          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la25fjj/",
                          "created": 1719241968,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "la0p6vl",
                  "score": 2,
                  "body": "> current identified use cases make the investment in the hardware completely worth it\n\nHuh? Can you share a few of those use cases? You mean  AI assistants and image generators?",
                  "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la0p6vl/",
                  "created": 1719214704,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la0tjt6",
                      "score": 5,
                      "body": "[deleted]",
                      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la0tjt6/",
                      "created": 1719217937,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la0xmip",
                          "score": 0,
                          "body": "> Programming - Either a very knowledgeable pair programmer or a full-blown replacement in some cases (web dev), will reduce software development costs by a lot.\n\nWhy would an LLM replace a developer (why web dev in particular?)?\n\nLLMs (at current stage; who knows if they'll get better or if there's a limit to their capabilities) aren't reliable (especially in coming up with solutions to new problems).\n\nThere's no way to verify if what an LLM told you is true or not without fact checking it. They need to be bound by laws of logic when connecting facts (sometimes they even change the meaning of what you told it when asked to repeat/summarize it, e.g. if there's too much text or it's not written in simple form).\n\n> Video/Image Generation - Will reduce costs of CGI and marketing material, maybe even costs of hiring actors in the future.\n\nAt current stages not at all. It may help in creating 3D models, but you you can't even get it to generate an image of what you want (it's always different and there's no way to tell it exactly what you want); let alone the generated images are distorted if look closely (same with LLM generated text — overall looks good, but individual facts may be made up)\n\n> Support - Will entirely eliminate the need for humans in customer support\n\nAgain — currently? No way, unless you mean something simple like ordering food over the phone. I don't see an LLM being deployed as tech or banking support. There's simply too much at stake while it's impossible to know if a) it says something completely stupid or b) it straight up „lies” while being confident in its answer.\n\n> Surveillance and Security - Will reduce the costs and need of so many police patrols by using AI in CCTV\n\nI could agree with that\n\n> Healthcare - Will reduce the need for so many general practitioners and help in finding new drugs\n\nReplacing doctors? I don't see it (see above arguments). Finding new drugs? Definitely.\n\n> Finance - Since we're on wall street bets, neural networks will replace (or have already replaced) most algo trading with more efficient and more profitable bots\n\nWhat do you think algo trading is? Tons of rules for simple indicators? No, they've been deploying machine learning for a long time. You could call it AI but it's simply specialized ML models; nothing even remotely resembling „intelligence” (in the same way you don't — I assume — call the YouTube algorithm an AI, just because it uses some neural networks — or other deep learning methods — and is good at recommending videos to you)\n\n> Self Driving - pretty self explanatory, will eliminate a bunch of more jobs\n\nWe're yet to see how it turns out. Maybe it'll never be good enough to drive fully autonomously and a driver will have to be present at all times.\n\n> Analytics - AI is very good at pattern recognition and will improve analytics in a bunch of scenarios by prediction of demand and supply and optimisation of distribution in energy, agriculture, manufacturing etc.\n\nSure, machine learning has been used for that for a long time\n\n> \"AI\" is not just a chatbot, it doesn't need to understand human language to achieve great things (see AlphaFold).\n\nMost of what you've described has already been possible before the AI boom (it's just deep learning).\n\nThe AI we're talking about here is the models that people believe could really be generally intelligent; the ones that the speculation is based on (mostly LLMs).\n\nYou don't need thousands of H100s or B100s for even advanced deep learning algorithms; those are needed for huge LLMs.\n\nCompare your AlphaFold (a specialized deep learning model; 90M parameters, 7 days training time; $15k cost) example with e.g. ChatGPT-4 (an LLM; ~1.5T parameters;  several months training time; > $100M cost).\n\nThe AI boom (especially for Nvidia) started with OpenAI. Sure, for what it's worth you can call AlphaFold an AI (I'd say it's more an ML model; however I don't want to get into a logomachy here). But it's not the kind of AI we're discussing here.\n\nOnly speculation on LLMs (and derivatives, or similarly huge models) makes the corporations spend billions on those Nvidia GPUs. And until we can be sure of their answers, they're pretty much useless for anything meaningful.\n\n> it doesn't need to understand human language to achieve great things\n\n> It doesn't even need to fully eliminate a job, just increasing efficiency and reducing the workforce is plenty to make a huge profit.\n\nIf it doesn't understand human language then it's presumably a small model, i.e. it doesn't need thousands of H100s (a simple cloud server with A100s/V100s would be enough). And the hardware investment is precisely what we're discussing here, so you're defending a completely different point (strawman)",
                          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la0xmip/",
                          "created": 1719220978,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "la11l0o",
                              "score": 2,
                              "body": "[deleted]",
                              "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la11l0o/",
                              "created": 1719223809,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "la23jnc",
                                  "score": 0,
                                  "body": "> You're very set in what's currently available to you... Why do you think this hardware is being bought, it's to improve what is currently available and take it 10 steps further...\n\nThe point is, those solutions may have an upper boundary.\n\nWe'd like to think that throwing more and more compute into ChatGPT or whatever will make it smarter (and eventually turn it into something like AGI), but if fundamental problems aren't fixed (e.g. hallucinations, lack of fact checking/answer validation, inability to make the model adhere to the laws of logic in its answers), it may turn out to be a complete waste of resources. The model architecture needs to be developed first.\n\nAnd your argument („in the future...”) is as valuable as „in 6 months we'll have reached the limit. Why? Because I predict so”, i.e. both are worthless. It's pure speculation that has little to do with what's currently available.\n\n> Why web dev? Because it's full of repetitive tasks that an LLM can handle and in 99% of web development you're not making anything new and you're not coming up with new solutions to new problems.\n\nI see creating a function or two with the help of an assistant, but it won't create a separate feature that could be seamlessly into the codebase (I mean, it could, but you never know if it's done right or not, unless you go through its solution step by step). It's hard to get it to work with larger projects.\n\nBy the way, again, the question here isn't about whether the models are useful, but whether it's worth to spend billions for the latest hardware. My answer is still *no*, because once a closed source model is trained, many open source alternatives emerge, so people can still reap the benefits without having to pay e.g. for GitHub copilot subscription (let alone dozens of others) — there are fewer subscribers, and the revenue is decreasing.\n\n> Have you seen the progress in video generation, look up Sora and compare it to what we had 1-2 years ago...\n\nYes, I did. Even OpenAI's demo with a woman walking the street had obvious glitches (e.g. at certain point the woman floated instead of walking).\n\n> It’s just a matter of time before it nails CGI.\n\nIt doesn't mean it'll scale at least linearly though. Again, you're purely speculating here.\n\nIt's cool that you can generate a video of dogs playing in the snow, but it doesn't mean you'll be able to make actual quality content that way.\n\nMaybe we'll see tons of AI generated movies, all of which will be completely shitty, yet the average consumer will get used to it. It'll be the beginning of the end as far as cultural taste is concerned (it's kind of beginning already with TikTok — and social media in general — and its algorithm recommending videos to make people scroll into oblivion).\n\n> Chatbots handle a ton of queries that used to need a human.\n\nExample of industry where it's used? Unless it's ready-made questions and answers, companies are skeptical of chatbots.\n\n> As AI improves, it’ll cover more ground.\n\nAgain, the *what if...*\n\n> AI can analyze medical data way faster than a human, freeing up doctors for more critical tasks.\n\nLLMs aren't (for the most part) needed for that (and they're the biggest models out there). Regular ML models are orders of magnitude smaller and can be trained within days using simple GPUs in the cloud.\n\n> ML has been used in analytics, but AI is making it way more accurate. It’s about better predictions and optimizations, saving time and money in energy, ag, and manufacturing.\n\nUh, any example? What do you mean by AI here, because I'm still not sure — as I've told you several times, those ML models are tiny in comparison to e.g. ChatGPT-4, and they don't need as much compute. So what kind of AI are we talking about?\n\n> You’re splitting hairs. Whether it's a huge LLM or a specialized model\n\nNo, the issue here if spending billions on the hardware is worth it. It started after ChatGPT was out and it's for the most part used to train and run LLMs (which aren't that useful; your arguments cover specialized ML models, which don't require the newly bought hardware, so they're irrelevant here).\n\n> AI is driving innovation and the bigger its data gets the more expensive it is to train.\n\nNot sure what you're trying to prove here. The costs to train AlphaFold are *4 orders of magnitude* smaller than to train ChatGPT. So why do we need thousands of H100s if a few A100s in the cloud will do?\n\n> All in all, you seem way too focused on what is currently available right now for you to use and not what is the intention of these companies and how much we can progress these what's essentially tech demos\n\nNo, I just realize that there are certain limitations to LLMs (which are what those companies are investing in; other models don't need so much money to be trained/run).\n\n> If we had your mindset then why would we ever progress beyond the 90s level of internet technology? \n\nWhat mindset? I'm amazed by e.g. AlphaZero or AlphaFold, but they were created *before* the spending spree.\n\nThey don't need nearly as much compute as what the money is being spent on (well, AlphaZero may be an exception, but it uses reinforcement learning, which in itself takes a long time to train the model, and doesn't always lead to the best results. AI for more concrete — and real-world — problems isn't that costly).\n\nYou're still seem to be defending a completely different point, i.e. „AI is relevant” which isn't what we're talking about.",
                                  "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la23jnc/",
                                  "created": 1719241316,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "la1mpr8",
                              "score": 2,
                              "body": "I’m already 2-3x more productive as a senior developer. We can build a lot more with a lot less people. I don’t think developers will not be used by the amount of software written will go up 10x, and if it’s profitable that’s all going to filter back to nvidia",
                              "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la1mpr8/",
                              "created": 1719234994,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "la245m1",
                                  "score": 1,
                                  "body": "> I’m already 2-3x more productive as a senior developer.\n\nFair enough. What do you use it for? E.g. examples of how to do something (especially with a new framework), writing tests or boilerplate code (any examples?), or creating entire features?\n\n>  I don’t think developers will not be used by the amount of software written will go up 10x\n\nI don't get what you mean here unfortunately. Was it supposed to be something like „I don't think developers will not use it if the amount of written software goes up 10x”?",
                                  "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la245m1/",
                                  "created": 1719241527,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "la2qye7",
                                      "score": 1,
                                      "body": "I get it to write the initial 90% of the code and it usually helps me tweak another 5% and then some I have debug and test. I wrote an entire react front end the other day mostly generated from gpt 4o. There isn’t any code that I don’t try and get it to write first . It’s mostly good for new code but there are a lot of apps to build",
                                      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la2qye7/",
                                      "created": 1719249169,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "l9ymy9t",
                  "score": 4,
                  "body": "That's called implied volatility",
                  "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9ymy9t/",
                  "created": 1719178716,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "l9yzib7",
                  "score": 0,
                  "body": "rn there is an equation which looks like this: more compute = better AI. So until AI can’t get any better with more compute, companies that want to be relevant will buy more compute.\n\nSo the only realistic (not that much actually) risk, is another company coming up with better chips, or maybe algorithms that require different kind of computing power.",
                  "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yzib7/",
                  "created": 1719183619,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9z3t3x",
                      "score": 3,
                      "body": "That’s not true at all. Maybe more compute = more speed, but the “strength” of the model relies on advancements in software and quality of training data.",
                      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9z3t3x/",
                      "created": 1719185366,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la2atmf",
                          "score": 1,
                          "body": "Except that best way to get advancements in software and quality of training data is to put the hardware in the hands of more people, so the proof of that simple equation still tracks.",
                          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la2atmf/",
                          "created": 1719243795,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l9zk5o1",
          "score": 3,
          "body": "Large part of those sales are to companies that NVidia has invested in. Look at the cash flow side and volume of chip sales does not equal the same jump in cash flow so a lot are on credit",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9zk5o1/",
          "created": 1719192351,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la05rcq",
          "score": 2,
          "body": "then next quarter it beats it by 2 billion again, ez",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la05rcq/",
          "created": 1719202407,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9y46by",
      "score": 84,
      "body": "I thought I heard there was some kind of limit due to power consumption and companies will basically need nuclear reactors or fields and fields of solar or whatnot to run the real gangster AI. Oh and a lot of CEOs have admitted they are probably overbuying but basically 'might as well, just in case'.",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9y46by/",
      "created": 1719172071,
      "depth": 0,
      "replies": [
        {
          "id": "l9yntzn",
          "score": 56,
          "body": "True. And many will go bust. But the way to get rich in a gold rush is to sell shovels. And Nvidia has all the shovels.",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yntzn/",
          "created": 1719179051,
          "depth": 1,
          "replies": [
            {
              "id": "la0jj2z",
              "score": 12,
              "body": "Theoretically TSM has the shovels.",
              "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la0jj2z/",
              "created": 1719210714,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9y9urs",
          "score": 23,
          "body": ">I thought I heard there was some kind of limit due to power consumption and companies will basically need nuclear reactors or fields and fields of solar or whatnot to run the real gangster AI.\n\nThis is where $OKLO comes in",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9y9urs/",
          "created": 1719174076,
          "depth": 1,
          "replies": [
            {
              "id": "l9ze8ij",
              "score": 8,
              "body": "I think nuclear is the way to go, but I am not sold on the $OKLO story. It doesn't have the economy of scale while being expensive to build/maintain.\n\nThey are pushing for zero-personnel sites to lower costs, but that is just asking for trouble imo. Their reactor design doesn't use as much fissile materials as traditional designs, but still enough to pose a danger.\n\nWith that being said, I am happy to open a minor position to pull a few swing trades.",
              "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9ze8ij/",
              "created": 1719189792,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9ytwl6",
              "score": 7,
              "body": "Go on",
              "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9ytwl6/",
              "created": 1719181403,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "la098m5",
          "score": -3,
          "body": "Those nuclear plants are literally being built right now by Google I think. All to power big AI farms",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la098m5/",
          "created": 1719204322,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9ydm16",
      "score": 43,
      "body": "Demand > Supply\n\nDemand is increasing. Supply is increasing.\n\nRevenue goes up. Profits go up. Stock goes up. Outlook does not change for several years. It's really that simple. Thinking more than this leads to losing.",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9ydm16/",
      "created": 1719175381,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9yj5bm",
      "score": 21,
      "body": "Article: NVDA is impossible to predict the price \\~\n\nMe: I will take this information and now price it in ![img](emote|t5_2th52|4271)",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yj5bm/",
      "created": 1719177311,
      "depth": 0,
      "replies": [
        {
          "id": "l9yz2ki",
          "score": -4,
          "body": "Probably be around $90 within next 3 months.",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yz2ki/",
          "created": 1719183446,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9y365i",
      "score": 98,
      "body": "As a financial analyst let me tell you something my friend, most analyst undershoot because the banks get paid some nice fees. Those that are not paid usually use a CAGR model instead of more flexible models that properly predict organic growth + whatever M&A brings to the table.\n\nThose that use stupid models end up having truly regarded predictions like our honorary member Cathy. The very few that use proper  econometrical models are the ones you see posting big returns on large HF or smaller investors that are a sub branch of a bank or HF.\n\nAt the end of the day WS benefits a lot from publishing lower expectations and setting very low bars to beat.",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9y365i/",
      "created": 1719171709,
      "depth": 0,
      "replies": [
        {
          "id": "l9y9oer",
          "score": 45,
          "body": "Cathy's model is PIOOMA (Pulled it out of my ass). She makes here money on ETF fees, not things going up or down. Any price she mentions is marketing, not finance.",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9y9oer/",
          "created": 1719174013,
          "depth": 1,
          "replies": [
            {
              "id": "l9yk5vt",
              "score": 13,
              "body": "Woah there! She prays in a very analytical way and her quant, Jesus, gives her all the technical analysis she needs to make decisions in a completely faith based way.",
              "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yk5vt/",
              "created": 1719177680,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9y66g0",
          "score": 9,
          "body": "Dam that makes sense . So when companies don’t beat their expectations it’s truly a bad sign ?",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9y66g0/",
          "created": 1719172777,
          "depth": 1,
          "replies": [
            {
              "id": "l9y9jv5",
              "score": 12,
              "body": "Yeah, I remember how they were setting stupid low expectations during covid.",
              "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9y9jv5/",
              "created": 1719173969,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9yn5mz",
              "score": 9,
              "body": "Yeah even if it’s by a small margin on the top side it truly concerns investors because the bar was so low. Most expectations you see as a consensus are under 4%-7% of what should be truly expected. Some sectors have wider margins of difference but you would need to dive into some GARCH, TARCH, ARCH, EGARCH or even PARCH for the different sectors out there.\n\nWhen you look into the revenue streams of a company most analysts just lump them all together instead of actually forecasting each one individually. And just as I said it’s done in order to benefit from beating the bar, that is why you always see GS or JPM or your favorite bank always revising up after it already happened.\n\nIf the proper forecast’s were out in the open the market would easily be between 20%-30% lower than what it currently is at.",
              "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yn5mz/",
              "created": 1719178794,
              "depth": 2,
              "replies": [
                {
                  "id": "l9yoiop",
                  "score": 4,
                  "body": "This is so common sense that truly bothers how come It never crossed my mind. No wonder time and time again they beat their earnings. I wonder if they get fired for making higher a prediction and doesn’t hit.",
                  "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yoiop/",
                  "created": 1719179312,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "l9ypcp3",
                      "score": 3,
                      "body": "You can get fired my friend and even have a bulletin on your back within the industry if you decide to be talkative. When I finished college and got my first full time job many years ago I learned that honest people don’t last long in the financial industry.",
                      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9ypcp3/",
                      "created": 1719179632,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "l9ycxcw",
          "score": 8,
          "body": "Correct. Worked in corp fin for a start up turned small cap public company and analysts would adjust their models based on how we guided them. Then we’d beat them. If we didn’t, we got pummeled deservedly",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9ycxcw/",
          "created": 1719175141,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9yct6v",
          "score": 3,
          "body": "Does it work the other way too? Like if the market and banks are super bearish on a specific company, will most analysts start overshooting their expectations? Like set them higher than their models call for, in order to help a certain outcome along? (Not trying to be a conspiracy theorist, just honestly curious. Also fuck gay bears)",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yct6v/",
          "created": 1719175101,
          "depth": 1,
          "replies": [
            {
              "id": "l9yng8w",
              "score": 1,
              "body": "It can happen but it rarely happens at least for the big companies, for small and medium size it’s a whole different story.",
              "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yng8w/",
              "created": 1719178906,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9yk2ij",
          "score": 3,
          "body": "Yes. This is the truth. There are places that use econometric models for internal dissemination only. But they will publish results from the regarded models with simple assumption that will say nvidia grows only by 5%.",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yk2ij/",
          "created": 1719177645,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9zuyfr",
      "score": 24,
      "body": "They beat until they don’t. They are one of the most valuable companies on the planet by stock price. \n\nNVIDIA annual revenue for 2023 was $26B\n\nNVIDIA annual revenue for 2022 was $26B\n\nApple annual revenue for 2023 was $383B\n\nApple annual revenue for 2022 was $394B\n\nMicrosoft annual revenue for 2023 was $211B\n\nMicrosoft annual revenue for 2022 was $192B\n\nOne of these things is not like other",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9zuyfr/",
      "created": 1719197111,
      "depth": 0,
      "replies": [
        {
          "id": "la0dows",
          "score": 18,
          "body": "You missed NVIDIA annual revenue ending Jan 28 2024 , $60.92B.  Their fiscal years end in January.",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la0dows/",
          "created": 1719206933,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la1s139",
          "score": 7,
          "body": "NVDA with like 90% less overpaid people on sheet though",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la1s139/",
          "created": 1719237141,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la24us4",
          "score": 3,
          "body": "yeah and now nvidia's quarterly revenue in 2024 is 26b. whats your fucking point?\n\nYou realize how dumb you sound, right?\n\nThe stock is skyrocketing because their revenue and forward guidance has skyrocketed. \n\nWhy would you value NVDA today based on revenue from 2023 when their revenue has gone up so much that just the revenue from ONE quarter today is the same as their revenue from an entire year back in 2023?",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la24us4/",
          "created": 1719241768,
          "depth": 1,
          "replies": [
            {
              "id": "la2dr07",
              "score": -4,
              "body": "Dumb? I’m pointing out their financials. One quarter ain’t shit. Can they keep this up? If not they are toast. Please learn to read. It will really help you in life",
              "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la2dr07/",
              "created": 1719244775,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "la0xds0",
          "score": 1,
          "body": "Nvidia not like Microsoft and Apple, It has very cyclical business. Demand will dry out in couple of quarters then stock price nose dive so fast so deep.",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la0xds0/",
          "created": 1719220796,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9yrxt6",
      "score": 11,
      "body": "As soon as some of the big tech companies slow down purchases, the entire world will implode…",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yrxt6/",
      "created": 1719180627,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9ya0pn",
      "score": 54,
      "body": "Remember when NVIDIA made graphics cards for gamers?",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9ya0pn/",
      "created": 1719174134,
      "depth": 0,
      "replies": [
        {
          "id": "l9ywzl6",
          "score": 29,
          "body": "Quickly becoming the only name left in that market as well. Intel is making inroads, AMD is scaling back to low/mid range cards only.\n\nI never would have imagined that PC gaming would surge in an era where a high end GPU costs more than a console, sound bar, and 55 inch TV.",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9ywzl6/",
          "created": 1719182620,
          "depth": 1,
          "replies": [
            {
              "id": "la24j2s",
              "score": 1,
              "body": "computers are just more versatile then a TV setup. also I prefer PC gaming because the added experience of typing more and more and thus getting significantly faster at it, actually helps me in my job to be more productive with less time spent. or maybe im coping",
              "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la24j2s/",
              "created": 1719241657,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "l9yg33j",
          "score": 11,
          "body": "Remember the \"chip glut\"",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yg33j/",
          "created": 1719176232,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9ydh34",
          "score": 10,
          "body": "They still do",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9ydh34/",
          "created": 1719175332,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la1rum2",
          "score": 0,
          "body": "butthurt gamers are the most funny thing of this whole NVDA run I swear  \n\"Muh nextgen 69 shader 420 raytrace 3D animewaifutiddy rendering gaming GPU is delayed because they prioritize AI/LLM market reee1111!!!\"",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la1rum2/",
          "created": 1719237071,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9yjntb",
      "score": 12,
      "body": "Fuck the moon. We’re going into the next galaxy boys!",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yjntb/",
      "created": 1719177496,
      "depth": 0,
      "replies": [
        {
          "id": "l9zvj1m",
          "score": 2,
          "body": "hell yeah!!",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9zvj1m/",
          "created": 1719197369,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9xz7nx",
      "score": 6,
      "body": "Headline fighting back",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9xz7nx/",
      "created": 1719170288,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9y20hr",
      "score": 12,
      "body": "Holding shares long options to expensive and volatile short term for me",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9y20hr/",
      "created": 1719171296,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9ye54g",
      "score": 6,
      "body": "These analysts are stupid af and behave like a herd.\n\nEverybody checks the others expectations and set theirs close to each other’s.\n\nWith that said, Nvidia will grow by 5-10% QoQ, not much room for error now",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9ye54g/",
      "created": 1719175564,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9yv35r",
      "score": 3,
      "body": "Up and to the right… does any one know if languages that read RTL reverse their charts as well?? :s",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yv35r/",
      "created": 1719181870,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9zrqxk",
      "score": 3,
      "body": "Ahhh these bullish articles warm the hearts of my puts.",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9zrqxk/",
      "created": 1719195674,
      "depth": 0,
      "replies": [
        {
          "id": "la0xk17",
          "score": 1,
          "body": "Those articles, to FOMO in and trap retail investors.",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la0xk17/",
          "created": 1719220928,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la0b1z5",
      "score": 3,
      "body": "And yet, some of you regards are losing money on calls. That takes a special level of degeneracy and recklessness to lose money on a rocket ship like this. It’s like you fell off the boat and missed the water.",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la0b1z5/",
      "created": 1719205355,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9ykqhi",
      "score": 2,
      "body": "NVDA 0DTE tba soon!",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9ykqhi/",
      "created": 1719177891,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9z23w5",
      "score": 3,
      "body": "They should ask AI what its opinion is on Nvidia's value. Maybe it can shed some insight ![img](emote|t5_2th52|29637)",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9z23w5/",
      "created": 1719184671,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9zod0f",
      "score": 2,
      "body": "Anyone that holds is going to have a hell of a tendie time.",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9zod0f/",
      "created": 1719194189,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la061z2",
      "score": 2,
      "body": "this is just the beginning of another era, the era of AI, Nvidia to become the largest company on earth so big that it will become a country with it's own name.",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la061z2/",
      "created": 1719202562,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la0xsl4",
      "score": 2,
      "body": "https://preview.redd.it/xxeq5fvumh8d1.png?width=2574&format=png&auto=webp&s=9a05a6be6c1788ed55abe410dd0f9e761acee5a0\n\nAuthor's other articles, seems like he has some kind of agenda to FOMO in.",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la0xsl4/",
      "created": 1719221102,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9y2cqo",
      "score": 6,
      "body": "At some point it'll drop regardless of their impressive performance",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9y2cqo/",
      "created": 1719171417,
      "depth": 0,
      "replies": [
        {
          "id": "l9ymb0f",
          "score": 18,
          "body": ">stock up 1000%\n\n\"Bubble! This will go down just watch\"\n\n>stock up another 10,000,000,000%\n\n*crickets*\n\n>stock drops 25%\n\n\"KNEW IT\"",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9ymb0f/",
          "created": 1719178472,
          "depth": 1,
          "replies": [
            {
              "id": "l9zgdub",
              "score": 7,
              "body": "I am not a bear. But 25% drop after 10,000,000,000% gain is a big number ![img](emote|t5_2th52|8883)",
              "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9zgdub/",
              "created": 1719190718,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9y0ukh",
      "score": 4,
      "body": "Beating exponentially",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9y0ukh/",
      "created": 1719170877,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9y43v3",
      "score": 2,
      "body": "Wall street can't predict fast growth? It's pretty easy to have higher expectations numbers.",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9y43v3/",
      "created": 1719172045,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9xxf0n",
      "score": 1,
      "body": "Nvidia is on fire.  Reminds me of Tesla in 2020 -  analysts just can't seem to price in the growth.  Might be time to buy some $NVDA calls.",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9xxf0n/",
      "created": 1719169634,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9yhyuq",
      "score": 1,
      "body": "So just hold and Fugget About It?\n\nSeems easy enough ![img](emote|t5_2th52|8882)",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yhyuq/",
      "created": 1719176886,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9zd8t6",
      "score": 1,
      "body": "![img](emote|t5_2th52|4258)",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9zd8t6/",
      "created": 1719189364,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la01clq",
      "score": 1,
      "body": "That's the cool part. The stock price is up because the revenue has doubled in a year. Its not hype or anything, it's just raw success. I don't own shares but it is cool to see. Projections are silly. You just have to hold good companies and cross your fingers.",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la01clq/",
      "created": 1719200144,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la05742",
      "score": 1,
      "body": "I project that nvda is a meme bubble and price will crash ",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la05742/",
      "created": 1719202112,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la05pmp",
      "score": 1,
      "body": "Wall Street my pp ![img](emote|t5_2th52|4267)",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la05pmp/",
      "created": 1719202381,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la0fot4",
      "score": 1,
      "body": "Hahaha what fucking nonsense. If you wanted a sign the top is coming in, surely this has to be it",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la0fot4/",
      "created": 1719208185,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la0xq9b",
      "score": 1,
      "body": "4T 😎",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la0xq9b/",
      "created": 1719221055,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la31qg9",
      "score": 1,
      "body": "They’re growing so fast, Wallstreet can’t keep up with making their darling’s PE ratio 100.",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la31qg9/",
      "created": 1719252692,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9y0pih",
      "score": 1,
      "body": "I imagine they didn’t predict this new Middle East deal given the trade sanction uncertainty\n\n*Leo licking his lips meme*",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9y0pih/",
      "created": 1719170828,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9ycvbc",
      "score": -1,
      "body": "It is trading at 40 times revenues, that's not exactly: \" Wall Street Can’t Keep Up\". It's more like Wall Street has turned NVDA stock into a meme stock. Traders trading NVDA stock are not going to earn from NVDA in the foreseeable future.",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9ycvbc/",
      "created": 1719175121,
      "depth": 0,
      "replies": [
        {
          "id": "la2y0rh",
          "score": 1,
          "body": "It's trading at 40x revenues because their growth is insane and nobody is trading equity based the balance sheet today.",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la2y0rh/",
          "created": 1719251481,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9y4fav",
      "score": -2,
      "body": "Top signal.",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9y4fav/",
      "created": 1719172158,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9yfa36",
      "score": -6,
      "body": "In 2000 they said the same thing about Enron.",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yfa36/",
      "created": 1719175955,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9yidgx",
      "score": -3,
      "body": "Makes perfect sense that it tanked the past 2 trading days.",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yidgx/",
      "created": 1719177031,
      "depth": 0,
      "replies": [
        {
          "id": "l9yo3hf",
          "score": 6,
          "body": "People taking profits. People being skittish. Totally normal. And actually really healthy for a run up. A straight run up is not healthy. A meandering climb is way more durable and I’d prefer to see it.",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yo3hf/",
          "created": 1719179152,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la1s62x",
          "score": 1,
          "body": "I think a 2 week correction would be healthy at this point",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/la1s62x/",
          "created": 1719237194,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9ycv0z",
      "score": -4,
      "body": "They can’t “predict,” but they will gladly “correct” as if Nvidia is too powerful for the Seattle Mafi— I mean Microsoft to beat on its own. Once this “correction” is over, it’s time for all of the Calls.",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9ycv0z/",
      "created": 1719175118,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9yncf7",
      "score": -7,
      "body": "Overpriced stock. That's why I shorted.",
      "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yncf7/",
      "created": 1719178866,
      "depth": 0,
      "replies": [
        {
          "id": "l9ypnt1",
          "score": 8,
          "body": "Get ready for Jensen to announce a massive buyback and a 9 percent dividend. ![img](emote|t5_2th52|4276)",
          "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9ypnt1/",
          "created": 1719179750,
          "depth": 1,
          "replies": [
            {
              "id": "l9yxwb5",
              "score": 2,
              "body": "That should add a few dollars to the price for a day.",
              "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yxwb5/",
              "created": 1719182980,
              "depth": 2,
              "replies": [
                {
                  "id": "l9yy8bs",
                  "score": 1,
                  "body": "Sorry I mean $500 forever more",
                  "permalink": "/r/wallstreetbets/comments/1dmtivi/nvidia_sales_grow_so_fast_that_wall_street_cant/l9yy8bs/",
                  "created": 1719183112,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}