{
  "title": "Rockstar-GTA6-TTWO",
  "score": 32,
  "selftext": "[removed]",
  "link_flair_text": null,
  "id": "1dn234a",
  "num_comments": 86,
  "created_utc": 1719193688,
  "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/",
  "comments": [
    {
      "id": "la18fix",
      "score": 1,
      "body": "Sorry -- we removed your post or comment because it's low effort.  Please put effort into what you post to r/stocks.  Any of the following are considered low effort and will result in your post or comment being removed:\n\n* Posts or comments that rely on memes to get your point across\n\n* Posts or comments which are basic one/two sentence questions\n\n* Posts or comments that are similar to ones made several times recently\n\n* Posts or comments where no actual research was done before asking the question or starting the discussion\n\nIf you need more information on a stock, try looking it up on finviz.com or a business news website.  After that, come back and back up your statements with a source or provide a more in-depth question.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la18fix/",
      "created": 1719228097,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9zo2kj",
      "score": 98,
      "body": "Take a few minutes and look through their financials.",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/l9zo2kj/",
      "created": 1719194061,
      "depth": 0,
      "replies": [
        {
          "id": "la13ag2",
          "score": 6,
          "body": "Isn't their financial the reason why they might be undervalued? it's about the numbers they'll do after gta6 release, not during development",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la13ag2/",
          "created": 1719224957,
          "depth": 1,
          "replies": []
        },
        {
          "id": "l9zq7xg",
          "score": -62,
          "body": "I sorta just did. What did I miss? Obviously it’s not an investment, more of a gamble. But look at how they skyrocketed after GTA 5 released in 2014. History repeats itself. I think it’s definitely safe to buy a few shares and hold till well after release ?",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/l9zq7xg/",
          "created": 1719195002,
          "depth": 1,
          "replies": [
            {
              "id": "la0amqv",
              "score": 42,
              "body": ">What did I miss? \n\nThat they made a billion dollar loss this past year for starters?\n\nGTA V was over-monetized far beyond expectations. People didn’t know that in 2013. GTA 4 was a 3 year old game when GTA V was announced so the expectation was that it was another release that’s out for a few years and then onto the next product. If you told people back in 2013 that GTA V would have well over a decade of longevity and that people would still be paying money hand over fist for Shark Cards then of course it would have been an easy choice to buy back them.",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0amqv/",
              "created": 1719205111,
              "depth": 2,
              "replies": []
            },
            {
              "id": "la0916q",
              "score": 9,
              "body": "I don't follow the stock closely, but I was shocked how much cash they're losing. I don't know the detailed story, but it seems like a classic case of financial mismanagement, taking a golden goose and turning it into a lump of coal.",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0916q/",
              "created": 1719204205,
              "depth": 2,
              "replies": []
            },
            {
              "id": "l9zuq74",
              "score": 42,
              "body": "Sorta?\n\nHistory repeats itself is your investment thesis? \n\nwtf is this",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/l9zuq74/",
              "created": 1719197006,
              "depth": 2,
              "replies": [
                {
                  "id": "la0ef1n",
                  "score": -25,
                  "body": "I said it was obviously not for investment purposes.",
                  "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0ef1n/",
                  "created": 1719207386,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la0h822",
                      "score": 29,
                      "body": "then post on wsb not stocks",
                      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0h822/",
                      "created": 1719209169,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la0risy",
                          "score": -13,
                          "body": "it’s a stock! jesus lol. it’s not a dice roll at a craps table.",
                          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0risy/",
                          "created": 1719216428,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "la0j9id",
              "score": 8,
              "body": "Sorry bro, but this not proper Due Diligence",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0j9id/",
              "created": 1719210531,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9zxk3i",
      "score": 155,
      "body": "This sub is becoming more and more degenerate by the minute. \n\n* no one knows how to actually analyze a company anymore\n\n* there’s 50 fucking posts about intel a day\n\n* there is like one intelligent comment in a thread and then about 100 comments that struggle to create a single coherent sentence as most of them are half-assed thoughts filled with bruh, lmfao, to the moon, bearish/bullish, bruh, stonks, bruh, nah bro, etc.\n\n* half-ass analysis’ that are clearly made by people bagholding and just hoping to try to convince someone else they aren’t as dumb as they think are\n\nAnd to top it off in this thread, OP saying “i sorta just did” when asked to look through their financials and the only thing OP did when looking at financials is this statement: “ 5b revenue, 27b market cap.” That’s all they did. Literally. JFC I am really starting to believe high school teachers when they say their students are reading at terrible levels and can barely write a full coherent sentence. Absolutely pathetic.",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/l9zxk3i/",
      "created": 1719198313,
      "depth": 0,
      "replies": [
        {
          "id": "la00hm2",
          "score": 58,
          "body": "Maybe I am a CPA who reads financial statements for a living and have a huge bias but I feel like 99% of people in any of these subreddits really have absolutely no fucking idea what they are talking about. If we were not in what is really a 15 year bull market where it is exceedingly difficult to lose money, so many of these morons would be broke",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la00hm2/",
          "created": 1719199721,
          "depth": 1,
          "replies": [
            {
              "id": "la07dee",
              "score": 24,
              "body": "Traditional analysis would have kept you very far from profits",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la07dee/",
              "created": 1719203277,
              "depth": 2,
              "replies": []
            },
            {
              "id": "la0yy1y",
              "score": 5,
              "body": "If you truly know what you’re talking about, this subreddit is essentially Wall Street Bets without the insults. \n\nThese lots have no idea what they’re talking about and it’s full of political nonsense.",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0yy1y/",
              "created": 1719221950,
              "depth": 2,
              "replies": []
            },
            {
              "id": "la02asb",
              "score": 17,
              "body": "CFA here. These people help us make money in markets.",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la02asb/",
              "created": 1719200617,
              "depth": 2,
              "replies": [
                {
                  "id": "la08d7l",
                  "score": 3,
                  "body": "I am curious: Did you generate alpha on the last 6 months through your recent trades?\n\nI am not sh*tting on CFAs here. I just feel that with crazy hull sentiment on a bunch of overhyped tech-meme-stocks, anybody with a conservative approach would have underperformed recently.\n\nCompanies with already crazy valuations do well, but the established bread&butter stuff lags behind.",
                  "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la08d7l/",
                  "created": 1719203829,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la0cc6x",
                      "score": 13,
                      "body": "You shouldn’t necessarily equate CFA with fundamentals-only analysis, as CFAs can take on lots of functions depending on their abilities and interests. I was a sellside tech analyst during dotcom (typical CFA gig), so I took companies public with almost no revenue, never actually had any profits, and ended up at $0 (like today’s SPACS) except for LendingTree and TD Waterhouse (absorbed into AMTD, then SCHW). After the bust I grabbed a CMT designation and worked as a prop analyst and trader for SIG, and I’ve also worked as a HF trader and PM, but retired early 6 years ago. I’ve owned NVDA since 2015, SMCI, AVGO and BKNG since 2023, started accumulating MSFT, GOOG, AMZN, COST, and AAPL in 1985-90, along with dogs I dropped along the way. So yep, grabbed some great alpha in the past 6 months without touching shitcos like GME, PLTR, or AFRM",
                      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0cc6x/",
                      "created": 1719206117,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "la0u7ze",
              "score": 4,
              "body": "If you knew who were really behind these accounts, you'd get off reddit or this sub reddit.\n\n\nIt ain't some 20 year old bag holder.\n\n3rd party trolls hired by investment banks.",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0u7ze/",
              "created": 1719218437,
              "depth": 2,
              "replies": [
                {
                  "id": "la0xszo",
                  "score": 3,
                  "body": "Do IB firms do that? First time hearing about this",
                  "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0xszo/",
                  "created": 1719221111,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la11rxk",
                      "score": 2,
                      "body": "fact bike chunky dull busy judicious imagine snails wild support\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la11rxk/",
                      "created": 1719223942,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "la0xdbq",
              "score": -4,
              "body": "This really triggered you guys? like I just threw my net worth on a roulette table or something. it’s a stock. the same company that bought zynga, and is most definitely going to succeed. \nNot like every other post is about VOO or mutual funds already huh? wow! OMG! “VOO AND CHILL!” that’s more degenerate than my post",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0xdbq/",
              "created": 1719220787,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "la03ykx",
          "score": 10,
          "body": "There's an inverse relationship between how valuable this sub is for financial knowledge and how many intel posts there are. Absolutely useless. Needs new mods",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la03ykx/",
          "created": 1719201468,
          "depth": 1,
          "replies": [
            {
              "id": "la0yr72",
              "score": -1,
              "body": "It’s almost like we just should talk about VOO all day huh?",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0yr72/",
              "created": 1719221814,
              "depth": 2,
              "replies": [
                {
                  "id": "la3d0ia",
                  "score": 3,
                  "body": "Not a VOO fan, no. That's for people less risk tolerant. INTC is for people who want to watch their money burn. It's why those VOO people are less risk tolerant",
                  "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la3d0ia/",
                  "created": 1719256427,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "la0az6r",
          "score": 12,
          "body": "[removed]",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0az6r/",
          "created": 1719205311,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la02cem",
          "score": 8,
          "body": "Reddit doesn’t optimize for high quality content with high quality information; it optimizes for engagement, which results in content trending towards the lowest common denominator. Bigger subs display this “issue” more frequently than smaller, well-moderated subs.",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la02cem/",
          "created": 1719200639,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la0ym7n",
          "score": 3,
          "body": "One way to tell we're in a bubble.... Horrendous DD and pure speculation posts 😂",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0ym7n/",
          "created": 1719221712,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la1785c",
          "score": 2,
          "body": "Everyone with even a little bit of intelligence already left reddit, we will do too in time if we actually have some. To add on to this\n\n* See a relevant company post\n* First comment is a joke\n* Next 10 comments is repeating single most popular lines to ever repeat about the topic\n* Sprinkle in some traumatised PTSD ridden people from dot com bubble ''actually if you invested in dot com and never any other time you get like 9 - 16 years of no returns''\n* Add in some r/technology users that never invested in a single stock in their lives, they are just here to shit on corporations and evil CEOs",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la1785c/",
          "created": 1719227408,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la0a6ia",
          "score": 2,
          "body": "And thats why I'm more and more decided to switch to an index fund and just forget it.",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0a6ia/",
          "created": 1719204854,
          "depth": 1,
          "replies": [
            {
              "id": "la0xo5d",
              "score": -2,
              "body": "yah cuz “VOO and chill” is so enlightening to read every day",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0xo5d/",
              "created": 1719221011,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "la0wssq",
          "score": 0,
          "body": "relax warren buffet, it’s really not that far stretched to see gains in this stock.",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0wssq/",
          "created": 1719220370,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la11t8a",
          "score": -1,
          "body": "A pokémon fanatic with a 1 year reddit history. That’s insane",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la11t8a/",
          "created": 1719223966,
          "depth": 1,
          "replies": [
            {
              "id": "la1kqom",
              "score": 3,
              "body": "Really? That’s your only response — that i like Pokémon? Oooooohhh how terrible of me!!! Like I said, pathetic.",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la1kqom/",
              "created": 1719234150,
              "depth": 2,
              "replies": [
                {
                  "id": "la53eo1",
                  "score": 0,
                  "body": "Well you wrote a 5 point thesis on my post about a particular stock, In a very lucrative industry. You coulda just called me an idiot and said just buy the game. I think you’re heads gotten so big you can’t handle others who maybe aren’t as “educated’ as you are. I shouldn’t have to feel like I need to be a CFA to post on Reddit.",
                  "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la53eo1/",
                  "created": 1719278931,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la5kv93",
                      "score": 1,
                      "body": "I’m not a CFA and never said you had to be. My “thesis” basically boiled down to “I’m sick of all these half-assed analysis’ people keep posting in this sub”\n\nMaybe do some reflection and realize just how little effort you put into your post. Then realize that we have to deal with similar level quality posts 100x per day and any decent analysis gets buried with the sea of trash. \n\nYou performed piss poor work on your analysis and now you are blaming it on elitism and not being as educated as others. **Stop putting the blame on everyone else and try to understand that you produced half ass work.** It was YOUR actions that led to these comments.",
                      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la5kv93/",
                      "created": 1719285898,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la7jroh",
                          "score": 0,
                          "body": "[deleted]",
                          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la7jroh/",
                          "created": 1719325214,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "la0wzve",
          "score": -2,
          "body": "[removed]",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0wzve/",
          "created": 1719220514,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la01dma",
      "score": 13,
      "body": "Just looking at their financials:\n\nhttps://finance.yahoo.com/quote/TTWO/\n\nTheir market cap is around the other big gaming companies, slightly less than EA. The difference with EA is that they are currently profitable and have a good balance sheet with positive free cash flow. Whereas Take Two aren’t currently profitable and their other financials indicate they aren’t really making money at the moment. \n\nThis might not mean they’re actually in financial trouble but more speaks to the cyclical nature of GTA games. \n\nAt a $30 billion market cap, you’d want their profit to be somewhere in the avenue of $1 billion for their valuation to make sense. This puts their p/e at 30, which is about in line with EA. A quick Google shows that GTA 5 made a $billion in its first 3 days (although I think this is revenue).",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la01dma/",
      "created": 1719200159,
      "depth": 0,
      "replies": [
        {
          "id": "la09m0n",
          "score": 11,
          "body": "Sounds like a decent approach. \n\nMy view: $1b is a 3.3% earnings yield on $30b. That'd be kinda meh for such a risky business. \n\nBUT...\n\nGTA made $8.5b revenue. Operational yearly cost for Take Two is about $6.5b. it *could* work put, depending ok the revenue of GTA6 (I expect $12b is not unrealistic), the other money they make and how many years of effort GTA6 represents.\n\nToo many variables for me, too much of a gamble. Cyclical are not an easy winner, and I don't have the insight to calculate this through and get a good margin of error.\n\nHands off for me.",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la09m0n/",
          "created": 1719204534,
          "depth": 1,
          "replies": [
            {
              "id": "la0yzyb",
              "score": 2,
              "body": "An actual educated response. Thanks",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0yzyb/",
              "created": 1719221987,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "la0xwou",
          "score": 2,
          "body": "I clearly know nothing, but I think their market cap was that high after zynga and gta 5. It’s been projected for nearly a decade now that their next big move would be gta 6. It’s not really that crazy to think the most anticipated game in our generation will be success in the stock.",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0xwou/",
          "created": 1719221187,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "l9zqn66",
      "score": 25,
      "body": "They have a great ceo \n\nLikely the best in the business \n\nThe problem is he has been so great at squeezing out every little bit of revenue on every game and IP that most analysts already build in the expected income from GTA 6 \n\nAnd consider this \nDelays delays delays \n\nThey can only release once and anything other thing a perfect release will cost them hundreds of millions in initial purchases \n\nTTWO as a company needs 2 major new IPs and a serious MMo and they do not have it \n\nHis biggest misstep as a ceo imo was not fostering 2 new studios under his banner \n\nWallstreet stock price is All about growth \n\nI fear GTA 6 will only keep revenue where it is and not be able to grow the entire company \n\nWhich means the stock will fall after release because of lack of growth \n\nYou might get a big pop closer to release but after that I think ttwo will have top’d and be a big short candidate",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/l9zqn66/",
      "created": 1719195188,
      "depth": 0,
      "replies": [
        {
          "id": "l9zy6el",
          "score": -4,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/l9zy6el/",
          "created": 1719198606,
          "depth": 1,
          "replies": [
            {
              "id": "l9zzemq",
              "score": 9,
              "body": "Based on what ?\n\nDo you have any idea how many units GTA 5 sold ?\n\nHow many platforms the game was sold on ?\n\nAny idea how much the online portion has contributed to steady revenue over how many years ?\n\nYou think GTA 6 is just going to magically sell 100 million units day 1 and then day 30 grab another 100 million on some type of dlc \n\nYou think the extremely critical fan base of 5 are all going to like 6 better ? \n\nMany will dump the game and continue playing 5 and do so less and less \n\nYes tens of millions of units will be sold \n\nYes millions of dlc will be sold \n\nGuess what dude \nThat’s already estimated and needed to keep cash flow coming in and do you have any idea how much ttwo has to pay the founders of rockstar ?\n\nTtwo got raped long ago on that royalty deal \n\nA lot of profit goes to rockstars founders \n\nSo no, respectfully \n\nYou have no idea if it will be the most profitable product In history or even the best selling\n\nYou just showed how much you do now know about the specifics \n\nBy the way \nI’ll buy the game \nAnd as I said \nThey have the best ceo in the business \nBut that’s not much of a compliment \nEA leadership is totally incompetent \nActivision a Bobby kotick is an overpaid moron —— sad that Microsoft left him in charge \n\nBethesda is now owned by Microsoft  🤦🏻‍♂️\n\nWill shall see",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/l9zzemq/",
              "created": 1719199196,
              "depth": 2,
              "replies": [
                {
                  "id": "la0cktd",
                  "score": 2,
                  "body": "To be fair they have already gave an outlook on future growth which includes the GTA 6, unless they themselves miss calculated it (which would also throw off a lot of analysts expectations) there should be incremental sales.",
                  "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0cktd/",
                  "created": 1719206261,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "la0zhbn",
                  "score": 1,
                  "body": "yes, yes and yes. I don’t know shit about the stock market, but i’ve been gaming my whole life and I feel like i’ve heard GTA in my sleep for 20 years. I think it will have full VR support and put EPIC/ACTIVISION in a very competive position. Microsoft will probably buy them too some day.",
                  "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0zhbn/",
                  "created": 1719222341,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "la0z74o",
              "score": 1,
              "body": "I agree. it’s almost crazy how much I was roasted for a valid question😳. Like these guys think they’re wayyy too educated and overly qualified to buy a few shares. omfg the arrogance",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0z74o/",
              "created": 1719222132,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "la0cth6",
      "score": 9,
      "body": "Your time to do that was before the trailer got released. \n\n\nMost of that is priced in now.",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0cth6/",
      "created": 1719206407,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9zp9la",
      "score": 6,
      "body": "Your use of bearish makes it easy to call you that 😂",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/l9zp9la/",
      "created": 1719194587,
      "depth": 0,
      "replies": [
        {
          "id": "l9zpqs6",
          "score": -8,
          "body": "But in all seriousness. Look at the charts. They skyrocketed after GTA 5 released in 2014.",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/l9zpqs6/",
          "created": 1719194795,
          "depth": 1,
          "replies": [
            {
              "id": "l9zso6d",
              "score": 11,
              "body": "Yes bcos the expectations weren't there.. this time it's high expectations.. you meet it.. stock may not pop . You don't.. stocks drops like hot potatoes",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/l9zso6d/",
              "created": 1719196083,
              "depth": 2,
              "replies": [
                {
                  "id": "la0zm86",
                  "score": 1,
                  "body": "well yah, I agree. I wasn’t saying try to retire off it or go all in with your life savings. A few shares got this crowd really triggered",
                  "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0zm86/",
                  "created": 1719222437,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la1qrxl",
                      "score": 1,
                      "body": "No body got triggered.. people are trying to explain why ttwo may not be the best stock.. I am a holder since 2019.. because I see very few game producers and it's a secular theme .. people will love play and enjoy games and I see kids buying cosmetic stuff which never made any sense.. so I invest... Not for a particular game but for the trend",
                      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la1qrxl/",
                      "created": 1719236654,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "l9zxgc9",
              "score": 2,
              "body": "It’s not for me but you can easily make a bill case for 175-200 to the run up for the new game. But that’s likely your double-top from the post COVID bull run and then it will chime back down unless the ER after the quarter *GTAVI* comes out absolutely smashes expectations. My reluctance is that I’m not sure there Zynga acquisition will pay off and there is an over-reliance on *RDR, GTA*, and *2k* (to a lesser degree). If I’ve of those titles slips up or isn’t well-received given the high number of competitors, I think outlook could be negatively impacted.",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/l9zxgc9/",
              "created": 1719198263,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "la0p91n",
      "score": 5,
      "body": "Always remember that's the same company which bought 2 years ago Zynga for 12.7 billion dollar. \n\nThe company is way more than just GTA6. \n\nThey also own Gearbox since 2024 which is mostly known for Borderlands and they paid 0.5 billion for that. From what it feels like Borderlands 3 sold many copies, but at a steep discount. \n\nThere are better gaming companies. My favorite to buy currently would be Bandai Namco.",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0p91n/",
      "created": 1719214748,
      "depth": 0,
      "replies": [
        {
          "id": "la0pit3",
          "score": 2,
          "body": "good point",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0pit3/",
          "created": 1719214951,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la0545g",
      "score": 10,
      "body": "Yeah this game will probably shatter every expectation. A lot of that’s already baked into stock price. I expect an insane number of base sales and for them to introduce some kind of reoccurring subscription revenue that will probably change the gaming industry for the worse but make stock holders very happy",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0545g/",
      "created": 1719202070,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la0nmjs",
      "score": 3,
      "body": "i thought the same thing as you, like 5 years ago or something. \"it'll pop when they announce it\" \"it'll pop in the years leading to release\" etc.\n\nsold for like a 5% loss earlier this year. done waiting, done playing \"smaller\" stocks. ultra blue chips or etfs only.\n\noh and like as an actual stock its really not very good. theres only so much the market will tolerate in favour of pure hype.",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0nmjs/",
      "created": 1719213557,
      "depth": 0,
      "replies": [
        {
          "id": "la0plzx",
          "score": 2,
          "body": "you’re probably right. Better buy a couple shares just to be safe",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0plzx/",
          "created": 1719215018,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la10uo7",
      "score": 3,
      "body": "Ah yes, another fucking moron thinking that GTA 6 sales aren't priced in.",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la10uo7/",
      "created": 1719223303,
      "depth": 0,
      "replies": [
        {
          "id": "la14o5x",
          "score": 1,
          "body": "“priced in derp derp” So why did AMD double in price last year? everyone knew they were entering AI. Just doesn’t seem like a valid argument",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la14o5x/",
          "created": 1719225855,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la1314h",
          "score": 0,
          "body": "Didn’t say it will make you rich, in fact I said it’s not even an investment. It doesn’t mean it’s not a potentially lucrative buy and hold. Get over yourself. You seem like the type of guy that DCA’a into VOO and acts like warren buffet with your homies.",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la1314h/",
          "created": 1719224784,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la0t5os",
      "score": 5,
      "body": "This is a valid strategy. \n\nLook at 11 bit studios stock price in the last few months ahead of Frostpunk 2's release date in July.\n\nLook at CD Projeckt Reds stock run up prior to Cyberpunks 2020 release.\n\nThe markets love a 'story' particularly when its a good news one with a definable timetable. TTWO got hit badly with the delays to GTA6 derailing this timeframe (which the market hates). Once the market sees the release date firm up expect the hype and momentum to start.\n\nAlso, the eliteism from the CFAs in this sub is hilarious. If reading a set of accounts was all it took then we'd all be billionaires. Have a bit more humility, the markets have a lot more to them than just company fundamentals.",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0t5os/",
      "created": 1719217644,
      "depth": 0,
      "replies": []
    },
    {
      "id": "l9zwsz7",
      "score": 2,
      "body": "Was thinking about this with a friend a couple days ago and damn was expecting something like that",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/l9zwsz7/",
      "created": 1719197959,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la0fc0k",
      "score": 2,
      "body": "I think it can run up to 180 or so but really not much of a big return when there’s other value plays to look at",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0fc0k/",
      "created": 1719207960,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la0rke7",
      "score": 2,
      "body": "T2 is not only R* and by this time it‘s priced in anyway. Has been for years.",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0rke7/",
      "created": 1719216462,
      "depth": 0,
      "replies": [
        {
          "id": "la1504c",
          "score": 1,
          "body": "priced in doesn’t seem like a very valid argument these days. look at AMD, why did they double in price in a few months if everyone already knew they’re getting into AI",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la1504c/",
          "created": 1719226064,
          "depth": 1,
          "replies": [
            {
              "id": "la151k3",
              "score": 1,
              "body": "Because we‘re currently in an AI bubble and hype is at its peak",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la151k3/",
              "created": 1719226090,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "la126wg",
      "score": 2,
      "body": "GTA6 launch trailer released on 12/3. After December 4th the market gave TTWO a 10% bump, taking it from about $154 to $169 which added about $2.5 billion in market capitalization. These are rough estimates and not exact numbers as I have no interest in this stock. \n\nCurrent analyst DCF models would account for GTA6’s annual revenue boost to TTWO, although, collectively, they would most likely be on the conservative side hence the 8-10% boost the stock has gained since the launch trailer.",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la126wg/",
      "created": 1719224224,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la18dmx",
      "score": 2,
      "body": "Two things: \"buy the hype, sell the actual release.\" (Truism) And if you know anything about Rockstar, they will delay the heck out of this thing. Don't expect that game until 2026.\n\nI am their oldest customer.",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la18dmx/",
      "created": 1719228068,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la0acas",
      "score": 3,
      "body": "I think gaming is a great investment in general",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0acas/",
      "created": 1719204946,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la04l4p",
      "score": 1,
      "body": "I think it'll do well but worse than expected. Way more competition for time",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la04l4p/",
      "created": 1719201794,
      "depth": 0,
      "replies": [
        {
          "id": "la05gua",
          "score": 1,
          "body": "It's going to be the only game anyone plays for at least 3 months, especially after the decade long wait.",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la05gua/",
          "created": 1719202254,
          "depth": 1,
          "replies": [
            {
              "id": "la108kd",
              "score": 1,
              "body": "3 months ?  GTA 5 has been on repeat since launch and keeps coming out with dlc. And this is coming from a COD addict",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la108kd/",
              "created": 1719222882,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "l9zxqr7",
      "score": -2,
      "body": "What if GTA 6 creates an actual brokerage where you can buy and sell cryptos",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/l9zxqr7/",
      "created": 1719198400,
      "depth": 0,
      "replies": [
        {
          "id": "la0ro2z",
          "score": 3,
          "body": "What if you went outside for once?",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0ro2z/",
          "created": 1719216539,
          "depth": 1,
          "replies": [
            {
              "id": "la10aav",
              "score": -2,
              "body": "lighten up Nancy.",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la10aav/",
              "created": 1719222916,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "la10exn",
          "score": -1,
          "body": "haha that would be epic. pulls out cell phone to do a contract. opens up coinbase.",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la10exn/",
          "created": 1719223007,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la0cd8v",
      "score": 0,
      "body": "Since the release of the trailer there at least one post about them every month, maybe read those first and ask yourself if others have maybe not had the same idea before you",
      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la0cd8v/",
      "created": 1719206134,
      "depth": 0,
      "replies": [
        {
          "id": "la10huh",
          "score": -2,
          "body": "oh you mean like I read about VOO and Chill all day on this sub? Yea, spare me.",
          "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la10huh/",
          "created": 1719223062,
          "depth": 1,
          "replies": [
            {
              "id": "la10pjb",
              "score": 2,
              "body": "What does the first has to do with the second? You’re asking about opinions on investing in TakeTwo and since we have not received any new fundamental information everything that was discussed in the threads last month, two months ago or three months ago is exactly the same as what you are receiving here.",
              "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la10pjb/",
              "created": 1719223207,
              "depth": 2,
              "replies": [
                {
                  "id": "la12fxz",
                  "score": -2,
                  "body": "Im pretty sure I said it’s not for investing, doesn’t mean you can’t still buy shares wisely, conservatively. I’m brand new to the sub anyway.",
                  "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la12fxz/",
                  "created": 1719224396,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la153cm",
                      "score": 3,
                      "body": "Similar to your use of bearish I’m not sure you know what investing means here but anyway there is a search function. Being new is a strong argument to using that first.",
                      "permalink": "/r/stocks/comments/1dn234a/rockstargta6ttwo/la153cm/",
                      "created": 1719226121,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}