{
  "title": "$LLY up potential ",
  "score": 27,
  "selftext": "The revenues of $LLY has mostly been driven by the glp-1 weight loss drug which was experiencing a lot of supply issues. A family member actually started using zepbound 2 months ago and both of the refills were completed within a day. The supply in the big cities seem to be in good shape now from the info I gathered on forums (for instance https://www.reddit.com/r/Zepbound/s/hvopL8fY0K ). On top of that, the main competitor $NVO had major fires in its factory which might limit their supply further.\n\nI don’t have much experience with pharmaceuticals sector. Curious if folks think there might be an upside potential based on the supply improvements?\n\nLooking at the stock price, i wouldn’t be surprised by a stock split announcement as well which can boost the stock little bit further.",
  "link_flair_text": null,
  "id": "1dn5e2k",
  "num_comments": 36,
  "created_utc": 1719204600,
  "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/",
  "comments": [
    {
      "id": "la0cejg",
      "score": 39,
      "body": "I’m disappointed there’s no leveraged etf for LLY, it’s very likely there’ll be a split as the share price getting closer to $1000.",
      "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la0cejg/",
      "created": 1719206157,
      "depth": 0,
      "replies": [
        {
          "id": "la19y1j",
          "score": 6,
          "body": "There is always the option market:)",
          "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la19y1j/",
          "created": 1719228933,
          "depth": 1,
          "replies": [
            {
              "id": "ljvuiiy",
              "score": 1,
              "body": "Are you good with options? I recently took a bit of my profit out of LLY, but consider the rest a long term investment. I'd love to do options, but the last time I played with options I lost so much fucking money (got too cocky). I didn't fully understand what I was doing so I struck big and thought I was a pro lol",
              "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/ljvuiiy/",
              "created": 1724606146,
              "depth": 2,
              "replies": [
                {
                  "id": "ljyplzb",
                  "score": 1,
                  "body": "Happens to the best of us lol. I usually avoid getting very short term contracts (targeting 2-3 months minimum) in which case the position has less risk of becoming zero if you entered at the wrong time. Which can make it a bit pricey, so it helps looking for a strike price that is 8-10% out of money. If the expiration date becomes <1 month either roll it over or sell the position. YMMV but worked well for me so far",
                  "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/ljyplzb/",
                  "created": 1724644865,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lk29lsq",
                      "score": 1,
                      "body": "Thank you for providing insight. I want to try options out for lly I just don't want to fuck it up lol",
                      "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/lk29lsq/",
                      "created": 1724701317,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ltsx2mg",
          "score": 2,
          "body": "LLYX",
          "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/ltsx2mg/",
          "created": 1729917540,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la11zic",
      "score": 30,
      "body": "LLY is currently building a $10 billion plant in Indiana to increase their weight loss drug supply. Scheduled to be making medicine by 2026. \n\nThat’s when the real supply will skyrocket. Whether investors are pricing this in already or not is anyone’s guess. But looking at the performance of Lilly over the past decade, I’d be very hesitant to bet against it.",
      "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la11zic/",
      "created": 1719224086,
      "depth": 0,
      "replies": [
        {
          "id": "la1batb",
          "score": 13,
          "body": "They just built a new facility in RTP area of NC and another one in Concord NC as well. I believe RTP site already has some lines approved so they are up and running. Supply should be increasing before 2026.",
          "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la1batb/",
          "created": 1719229648,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la1xa30",
      "score": 12,
      "body": "looks like they just applied Zepbound to be used for sleep apnea - helped 50% of patients with obstructive apnea. that’s big imo",
      "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la1xa30/",
      "created": 1719239117,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la1vdyx",
      "score": 10,
      "body": "Split or no split... I'm very bullish about the products in the markets and the ones in the pipeline.    long term hude upside on those drugs",
      "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la1vdyx/",
      "created": 1719238423,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la0gw5c",
      "score": 30,
      "body": "Don’t forget they have a major Alzheimer’s drug awaiting FDA approval that I truly believe will be successful. Could give them a sizable jump when announced..",
      "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la0gw5c/",
      "created": 1719208953,
      "depth": 0,
      "replies": [
        {
          "id": "la0xj45",
          "score": 17,
          "body": "Their Alz drug was approved 2 weeks ago.",
          "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la0xj45/",
          "created": 1719220908,
          "depth": 1,
          "replies": [
            {
              "id": "la1abkm",
              "score": 3,
              "body": "Exactly https://www.nytimes.com/2024/06/10/health/alzheimers-treatment-donanemab.html",
              "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la1abkm/",
              "created": 1719229132,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "la0g79h",
      "score": 23,
      "body": "What about HIMS selling the equivalent for $200?",
      "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la0g79h/",
      "created": 1719208510,
      "depth": 0,
      "replies": [
        {
          "id": "la204ym",
          "score": 3,
          "body": "HIMS has treated me very well the past month and a half.",
          "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la204ym/",
          "created": 1719240142,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la1gp6g",
          "score": 3,
          "body": "Theirs is compounded which can have its own issues with dosage variation, worse side effects, etc.  I am not saying HIMS specifically has issues like this, but compounded medication is not quite apples and oranges to proprietary.",
          "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la1gp6g/",
          "created": 1719232334,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la20rwo",
      "score": 10,
      "body": "Just keep in mind that it's already priced for insane growth. Forward PE of 60.",
      "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la20rwo/",
      "created": 1719240363,
      "depth": 0,
      "replies": [
        {
          "id": "la25068",
          "score": 4,
          "body": "Right. I think the raw P/E might need to be calibrated with (i) the new alzheimer drug has an estimated annual revenue amount of 5B (ii) LLY has been investing a lot to increase the production, building new and expensive plants  (iii) GLP-1 drugs have been supply constrained, and lilly’s investments are improving the supply side",
          "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la25068/",
          "created": 1719241821,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la0xh4u",
      "score": 7,
      "body": "The fire at Novo was in an office building, not a manufacturing area, and NVO just bought Catalent. Catalent is (was) a major contract manufacturer for Eli Lilly.\n\nIf anyone is going to be supply constrained it’s going to be Lilly once novo moves in the building and turns Catalents lines off for them. Catalent is one of the world’s biggest pharmaceutical contract manufacturers.",
      "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la0xh4u/",
      "created": 1719220866,
      "depth": 0,
      "replies": [
        {
          "id": "la19k0r",
          "score": 1,
          "body": "It seems NVO had 3 fires in the last one month. The first one was a factory building under construction, the other two fires happened at office buildings. Thanks for pointing it out!\n\nhttps://www.wealthprofessional.ca/news/industry-news/big-pharma-company-suffers-third-facility-fire/386200",
          "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la19k0r/",
          "created": 1719228723,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la4spj3",
      "score": 4,
      "body": "I’m in. Hasn’t even hit $1T yet.",
      "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la4spj3/",
      "created": 1719274738,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la2gnv1",
      "score": 3,
      "body": "Check this company out too, just had a big win in heart drug phase 3 trial: https://finance.yahoo.com/news/alnylam-shares-soar-drug-meets-113947027.html\n\n(Bloomberg) -- Alnylam Pharmaceuticals Inc. shares soared after its drug succeeded in treating a progressive and deadly form of heart disease, potentially open...",
      "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la2gnv1/",
      "created": 1719245747,
      "depth": 0,
      "replies": [
        {
          "id": "la2lypq",
          "score": 2,
          "body": "Personally i am not that comfortable with the pharma space. Hope your advice will be useful to the other readers here! \n\nMy impression is that there are a lot of promising phase 3 trials going on",
          "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la2lypq/",
          "created": 1719247520,
          "depth": 1,
          "replies": [
            {
              "id": "la38gro",
              "score": 2,
              "body": "Pharma is very dependent on clinical trials or big contracts that come and good, or patents and patent wins. I've worked in enough pharma to have seen that. Smaller companies with good pipelines can have quick gains on good news, something to watch closely and catch the wind when it hits",
              "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la38gro/",
              "created": 1719254913,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "la0dzbn",
      "score": 8,
      "body": "The novo fires weren't in the factories, won't affect supply at all 🤦",
      "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la0dzbn/",
      "created": 1719207113,
      "depth": 0,
      "replies": [
        {
          "id": "la19tl9",
          "score": 1,
          "body": "Thanks for the correction! I actually didn’t realize there were three fires. I read about the first one a month ago and it was in a factory site under construction.",
          "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la19tl9/",
          "created": 1719228866,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la31slk",
      "score": 2,
      "body": "I called my small pharmacy in a very large city for a zepbound refill just this morning and they told me that due to the lack of supply and the hassle of all the people calling asking about availability the owner has decided not to carry it anymore.  I got it from them no problem starting in December until last month when they were out and I had to pay the Medfinder service $50 to find me some 30 minutes from my house.",
      "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la31slk/",
      "created": 1719252712,
      "depth": 0,
      "replies": [
        {
          "id": "la37ejc",
          "score": 2,
          "body": "We get it from CVS, and didn’t have any issues both times. Thanks for sharing the datapoint! \n\nMy impression from the zepbound subreddit is that the supply side is improving, and the demand is already very very strong as your pharmacist mentioned.",
          "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la37ejc/",
          "created": 1719254559,
          "depth": 1,
          "replies": [
            {
              "id": "la37jcv",
              "score": 2,
              "body": "Thank you! I will check with CVS.",
              "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la37jcv/",
              "created": 1719254604,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "la8y1ly",
      "score": 2,
      "body": "Lilly's future is tied to the success of Verve's genetic cure for high cholesterol. If you want to capitalize on pharmaceutical's look to who the pharmaceutical companies are investing in.\n\nLilly is into Verve Therspeutics for some 50 million shares at $10 a share. Right now, Verve's stock is selling at $5.25 a share and is easily a great buy.\n\nLilly isn't betting that big on Verve bless something really big is going to come out of their investment.\n\nPS, All the Verve insiders are also loading up on the stock... To me, here are strong indicators of a dark horse primed to explode!",
      "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la8y1ly/",
      "created": 1719341951,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la60gcn",
      "score": 1,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la60gcn/",
      "created": 1719293885,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lad51b8",
      "score": 1,
      "body": "I think you and the Intel guy should have a debate",
      "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/lad51b8/",
      "created": 1719410597,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la11wdd",
      "score": -18,
      "body": "Garbage stock selling garbage drugs to make fat people think they’re not fat.. must keep going up forever",
      "permalink": "/r/stocks/comments/1dn5e2k/lly_up_potential/la11wdd/",
      "created": 1719224027,
      "depth": 0,
      "replies": []
    }
  ]
}