{
  "title": "European Union regulators accuse Apple of breaching the bloc's tech rules ",
  "score": 170,
  "selftext": "European Union regulators on Monday said that Apple is in breach of sweeping new tech rules because it does not allow customers of its App Store to be steered to alternatives.\n\nThe European Commission, the EU’s executive arm, also said it had opened a new probe into Apple into new contractual terms with developers.\n\nThe EU opened an investigation into Apple, Alphabet and Meta in March under a landmark new law known as the Digital Markets Act (DMA), which aims to reel in the power of Big Tech firms. So-called anti-steering rules were one of the big areas of focus of the probe. Under the DMA, tech firms are not allowed to block businesses from telling their users about cheaper options for their products or about subscriptions outside of an app store.\n\nOn Monday, regulators said in their preliminary findings that Apple was in breach of the DMA because its App Store rules “prevent app developers from freely steering consumers to alternative channels for offers and content.”\n\nCNBC has reached out to Apple for comment.\n\nApple only allows steering through a system where app developers can provide a link that sends users to a webpage where they can then purchase content, such as a subscription, according to the Commission. However, this process is “subject to several restrictions imposed by Apple that prevent app developers from communicating, promoting offers and concluding contracts through the distribution channel of their choice,” the Commission noted.\n\nThe regulators also said that the fees Apple charges developers for the initial acquisition of new customers via the App Store “go beyond what is strictly necessary.” The Commission did not disclose what represents a “strictly necessary” fee.\n\nApple could face fines of up to 10% of the company’s total worldwide annual turnover, if it is found in breach of the DMA.\n\nThe U.S. tech giant has been in EU’s crosshairs this year. Regulators hit Apple with a 1.8 billion euro ($1.93 billion) antitrust fine in March for abusing its dominant position in the market for the distribution of music streaming apps. The steering rules were also a focus in that investigation.\n\nEU opens another DMA probe\n\nApple made some big changes to its App Store in the EU this year in anticipation of the DMA. The Cupertino giant now allows apps to be downloaded from websites, as well as third-party app stores on its devices.\n\nBut the Commission also raised concerns about some of Apple’s new practices.\n\nApple still charges a “core technology fee” of 50 euro cents ($0.54) per app installed for downloads outside its own App Store. The Commission said it is looking into whether this complies with the DMA.\n\nRegulators are also looking at whether the steps Apple makes users take to download alternative app stores or apps comply with the bloc’s rules.\n\nThe Commission will also look at whether “eligibility requirements related to the ability to offer alternative app stores or directly distribute apps from the web on iPhones” is also in compliance with the tech law.\n\nSource: https://www.cnbc.com/2024/06/24/apple-app-store-rules-are-in-breach-eu-tech-rules-regulators-say.html",
  "link_flair_text": null,
  "id": "1dnasfp",
  "num_comments": 99,
  "created_utc": 1719226990,
  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/",
  "comments": [
    {
      "id": "la1b4va",
      "score": 16,
      "body": "I will be curious to see if they open up the app store if Google decides to do an app store for iOS.\n\nMake a lot of sense.",
      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la1b4va/",
      "created": 1719229560,
      "depth": 0,
      "replies": [
        {
          "id": "la2vnji",
          "score": 24,
          "body": "Honestly, it’s wild how long they got away with it.\n\nIt’s your phone, how is it that Apple blocks you from installing other apps you want? You paid for the phone and the software in it.\n\nImagine if dell started limiting what software can be installed on their laptops. \n\nIt’s not just the app installation, Apple forces everyone to only install through their store and then charges a 30% cut on every financial purchase/transaction made through the phone.\n\nAll startups have to straight up pay 30% of their revenue to Apple that comes from users using iPhones. Google adopted the same pricing model because Apple got away with it. \n\nAt this point, do you really own your iPhone? You can’t install what you want, and you need to pay a 30% tax for every transaction you make on your phone to Apple.",
          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2vnji/",
          "created": 1719250706,
          "depth": 1,
          "replies": [
            {
              "id": "la32m41",
              "score": 3,
              "body": "I completely agree.    I do find it weird that you are being downvoted.\n\nNot sure how anyone could disagree.",
              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la32m41/",
              "created": 1719252978,
              "depth": 2,
              "replies": [
                {
                  "id": "la33b94",
                  "score": 8,
                  "body": "Because apple apologist don't want to get it and the average users don't get it. The difference between having the option and having to use it are fundamentally not the same. They act as if the app store will dissappear just because you can now sideload or use a different one. It's bizarre.",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la33b94/",
                  "created": 1719253204,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la33mou",
                      "score": 1,
                      "body": "I thought maybe it was share holders and why downvoted.\n\nThey think it means the stock will decline and they are voting in terms of their investment instead of logic or being a consumer.\n\nBTW, I am a very long time shareholder of AAPL.  But it does not change me from seeing what is right in front of me.\n\nAAPL is the most anti competitive of the big tech companies by far.   Far worse than Google for example.",
                      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la33mou/",
                      "created": 1719253307,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la3487w",
                          "score": 5,
                          "body": "Idk. Apple always work kind of cultish. Don't get me wrong, from an investment view that was always great, with the build in customers etc. But from a user/tech enthusiast point of view it was always frustrating, especially when you are the go to guy for fixing tech in your family.",
                          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la3487w/",
                          "created": 1719253509,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "la34n89",
                              "score": 2,
                              "body": "> But from a user/tech enthusiast point of view it was always frustrating, especially when you are the go to guy for fixing tech in your family.\n\nI could not agree more.   My mom was using an iPad like a laptop until I replaced with a Chromebook and she is so much happier.",
                              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la34n89/",
                              "created": 1719253646,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "la3d4oj",
                  "score": 3,
                  "body": "> Not sure how anyone could disagree.\n\nProbably because it is a strawman argument. Apple does not stop a user from doing what they want with their device. You can do what you want with your phone. You can even melt it in your oven if you want.\n\nApple simply doesn’t support installing third party apps in iOS. \n\nTheir own fucking operating system that they wrote from the ground up. \n\nThis is basically equivalent to demanding that a grocery store sell a different item that you want in their store but they don’t stock. \n\nPeople think they’re asking for “let me do what I want” but you can already flash the OS and do unsupported shit. What people are actually asking for is “write me software for me to do what I want”.",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la3d4oj/",
                  "created": 1719256464,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la4ekgd",
                      "score": 1,
                      "body": "> but you can already flash the OS and do unsupported shit\n\nApple actively prevents you from doing this. I didn’t look hard but AFAIK no exploits are published with the last few versions of iPhone.",
                      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la4ekgd/",
                      "created": 1719269361,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la4kwtv",
                          "score": 2,
                          "body": "You can do it on older devices. The fact that you can’t do it to new ones is a security feature",
                          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la4kwtv/",
                          "created": 1719271793,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "la4n5f3",
                      "score": 1,
                      "body": "You can’t in one comment contradict yourself so hard and also lie. How can you say you can do anything with the phone, but the next sentence you say “Apple just doesn’t support third party apps”. \n\nThey do, they just lock it first (in the past) to needing a Mac to sideload only, then they allowed windows to do the same(which is where we are today). But even then, it’s a 3-app limit for a week and then you have to redo the process. Why do I need a pc to do something with my phone that is already possible if I BUY A DEVELOPER CERTIFICATE FROM APPLE for 100$/year. No way. Apple gatekeeps sideloading through an indirect subscription?",
                      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la4n5f3/",
                      "created": 1719272659,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la4y37r",
                          "score": 1,
                          "body": "> How can you say you can do anything with the phone, but the next sentence you say “Apple just doesn’t support third party apps”.\n\nI honestly don’t know how I could have made it any more clear. YOU can do what you want with your phone. APPLE isn’t required to support it.\n\nYou can drive your BMW off-road, but if you damage it and they can tell it was driven off road they won’t warranty it. ",
                          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la4y37r/",
                          "created": 1719276841,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "la4i59e",
                      "score": 0,
                      "body": "Damn could you lick a boot harder. Your grocery store analogy is a false equivalency. \n\nA truer analogy would be if you bought a house or car and it comes with proprietary parts. Sure,  you can go to the manufacturer to get replacement or new parts. But that being your ONLY options is bullshit. No you can’t demand that the manufacturer sells the parts you want, but at least you can get them elsewhere. There is no practical alternative to the App Store for Apple",
                      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la4i59e/",
                      "created": 1719270727,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la4l3t5",
                          "score": 3,
                          "body": "There are plenty of cars with proprietary parts that can only come from OEM. \n\nBut as a matter of principle I’m not going to talk to someone who goes with BoOt LiCkEr route. Always insufferable ",
                          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la4l3t5/",
                          "created": 1719271868,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "la3co7j",
              "score": 1,
              "body": "> It’s your phone, how is it that Apple blocks you from installing other apps you want?\n\nApple only blocks you from installing third party apps on iOS. You can do whatever you want with your iPhone. Throw it in the ocean. Flash it and install a jailbroken OS.\n\nYou guys think what you’re asking for is “let me do what I want with my device” but what you’re actually asking for is “write extra software into your OS that’s sole purpose is supporting other companies’ third party apps”.\n\nIt doesn’t make any sense. You don’t DEMAND that Target sell you an item that they haven’t vetted and approved for sale in their store. The App Store is not yours. Your phone is yours, but the App Store isn’t.\n\nYour car also has an OS, but it doesn’t let you install whatever you want on it, and if you force the issue, the problems that occur are on you.",
              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la3co7j/",
              "created": 1719256313,
              "depth": 2,
              "replies": [
                {
                  "id": "la3em8o",
                  "score": 2,
                  "body": "I should be able to install whatever I want. Yes, I can’t demand sell me they don’t like, but I don’t own target or that particular store. At the end of the day, I buy what they sell.\n\nHere, it’s my device. I paid for it. I will install virus on it if I want. It’s my device. I can use it as a paperweight if I want, I should be able to install anything, from any company I want. Once Apple sold me the device, it’s no longer theirs. They don’t get to tell what to use it for.\n\nImagine the outrage if dell restricts what software can be installed on its laptops. \n\nOr if BMW sells you a car and then says “we are tracking you, you can’t take this car to XYZ locations”. Its my product, I can do whatever I want with it\n\n> problems that occur are on you\n\nThat’s fine. That’s how laptops are sold. If I install virus and fall for a scam, it’s on me.",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la3em8o/",
                  "created": 1719256969,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la3m5sg",
                      "score": 6,
                      "body": "> Once Apple sold me the device, it’s no longer theirs. They don’t get to tell what to use it for. By this logic, iOS can never be made satisfactory. There will always be some restrictions, some setting that can’t be toggled. You’re setting an impossible standard. Does “it’s my device I can do what I want” mean iOS not allowing me to turn off Deep Fusion for photos should be illegal?  The whole point of an operating system is that it’s a set of rules that run on hardware. It has a limited number of possible states. It’s not even possible in theory to design an OS that doesn’t limit you.  So where do you draw the line? What *should* Apple be able to program into iOS?\n\n> Or if BMW sells you a car and then says “we are tracking you, you can’t take this car to XYZ locations”. Its my product, I can do whatever I want with it\n\nThis literally happens. Car manufacturers do not allow most of their models to be used off road. If the GPS indicates it was, warranty can be denied. \n\nYes, you can do whatever you want. No, you can’t expect the manufacturer to support you doing whatever you want. ",
                      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la3m5sg/",
                      "created": 1719259468,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "la423kw",
                      "score": 2,
                      "body": "If you catch a virus or fall for a scam, you might be understanding enough to get that it’s on you. The vast majority of average people are not and will blame Apple. Just like how there’s a popular perception that androids are terrible because of a small percentage of them being cheap and full of bloatware",
                      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la423kw/",
                      "created": 1719264774,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la4nqns",
                          "score": 1,
                          "body": "The era where everyone got a virus from someone who called them telling them what to do and doing what an ad said is long gone. Even my old boomer grandparents, whenever I get an email from the official bank I registered my credit to, tell me it may be a scam.\n\nIt’s time we go to the next stage.",
                          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la4nqns/",
                          "created": 1719272886,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "la1chy2",
      "score": 17,
      "body": "Apple did this on purpose, so I'm guessing they have a plan. I don't see how they escape a massive fine though",
      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la1chy2/",
      "created": 1719230265,
      "depth": 0,
      "replies": [
        {
          "id": "la2ccqy",
          "score": 18,
          "body": "Their plan is to hold onto that 30% service fee for as long as possible. If they lose ground on this Apple's profits are in serious trouble.",
          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2ccqy/",
          "created": 1719244309,
          "depth": 1,
          "replies": [
            {
              "id": "la39fbg",
              "score": 1,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la39fbg/",
              "created": 1719255228,
              "depth": 2,
              "replies": [
                {
                  "id": "la39yxm",
                  "score": 4,
                  "body": "They take 30% cut of all sales in the App Store, this accounts for a HUGE percentage of their revenue today. The latest earnings put that number over 100 billion per year. If they lose even 10% of that revenue to alternate payment methods it is bad, if they lose more it could be absolutely catastrophic to Apple's business model.",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la39yxm/",
                  "created": 1719255408,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la3lbec",
                      "score": 1,
                      "body": "They still make a profit selling the physical phones, ipads, computers and widgets though. If the EU completely shut down their app store tomorrow, they'd still be profitable.",
                      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la3lbec/",
                      "created": 1719259191,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "la1gdhi",
      "score": 8,
      "body": "Seems to me it's pretty clear Apple is not following the rules here. On purpose, since they know they can stretch this out as long as possible, try to water down regulations and not do it too easily so other countries don't all implement the same rules quickly. Guess they are betting the fines will be lower then the profit in that time period they would otherwise missing out on by following the rules.",
      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la1gdhi/",
      "created": 1719232180,
      "depth": 0,
      "replies": [
        {
          "id": "la1jiog",
          "score": 1,
          "body": "Well this makes a lot of sense",
          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la1jiog/",
          "created": 1719233615,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la1zdh3",
          "score": -1,
          "body": "They’re dumb rules - why do you need eight different app stores on your device? The EU likes to act like they’re doing the right thing by meddling and pretending it’s in the name of consumer rights, but in reality they’re just trying to extract money from the private sector and it ends up making things worse for the consumer. Vote with your wallet - if you don’t like the way Apple does things, buy one of the many other phone brands on the market",
          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la1zdh3/",
          "created": 1719239875,
          "depth": 1,
          "replies": [
            {
              "id": "la38ur2",
              "score": 4,
              "body": "> why do you need eight different app stores on your device?\n\nJust don't install them if you don't want them. This only benefits people and developers who want them.\n\n> Vote with your wallet - if you don’t like the way Apple does things, buy one of the many other phone brands on the market\n\nApple can vote with their feet. If they don't like our laws they can leave. They won't, though, because we're their second largest market. While they do business here they have to follow our laws.",
              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la38ur2/",
              "created": 1719255040,
              "depth": 2,
              "replies": [
                {
                  "id": "la4lh30",
                  "score": 1,
                  "body": "“Just don’t install them” Great attitude to have until you start getting App Store Exclusives and are forced to install 8 different app stores in order to get the apps you want. Ask any PC gamer how many launchers they’re forced to install on their computer in order to play the games they want to.\n\n“Apple can vote with their feet” they won’t need to - the EU will just end up with a gimped version of iOS while the rest of the world gets to enjoy one-stop app shopping",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la4lh30/",
                  "created": 1719272011,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la62bd7",
                      "score": 1,
                      "body": ">\t“Just don’t install them” Great attitude to have until you start getting App Store Exclusives and are forced to install 8 different app stores in order to get the apps you want.\n\nThis hasn’t happened on Android so I don’t see why you believe iOS will be so very different.\n\n>\tthe EU will just end up with a gimped version of iOS \n\nYou say gimped. I say more powerful. I suppose it is good that I live here and you live there :)",
                      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la62bd7/",
                      "created": 1719295015,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la6enf6",
                          "score": 2,
                          "body": "I have EU citizenship so if I feel really desperate for a few more app stores I’ll just go there and buy a phone🤷🏻‍♂️",
                          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la6enf6/",
                          "created": 1719303532,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "la23sbs",
              "score": 2,
              "body": "Nonsense. Right now we have a duopoly, where both companies do the same shit. So you can't simply 'buy one of the many brands'. You should be free to do what you please, like you do on the Windows PC platform, for example.\n\nSteam - the most innovative and efficient videogame store - wouldn't exist without the freedom that Apple and Google are limiting on the mobile platform. Just to name one example of what means free competition.",
              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la23sbs/",
              "created": 1719241399,
              "depth": 2,
              "replies": [
                {
                  "id": "la258as",
                  "score": 3,
                  "body": "I'll do you one better: the modern internet wouldn't exist, since it would be Microsoft still holding dominance with Internet Explorer and not allowing Firefox and Chrome to be on the platform at all. We would have lost out on trillions of dollars in stock holder value and growth if people would just accept that situation.",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la258as/",
                  "created": 1719241899,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "la4kw3u",
                  "score": -1,
                  "body": "It’s hardly a “duopoly” - there’s plenty of other brands out there, Samsung and Apple are just the most popular by a massive margin because consumers have decided that they make the best quality phones. I think you’re pretty ignorant as to how (increasingly) limited you are using Windows, also. If you want true freedom, I think Linux would be the example you’re looking for. \nI know all about Steam - my account is 18 years old. Steam has also had its fair share of anti-consumer drama. They were hit with a massive lawsuit a few years ago in my country over their returns policy that was deemed illegal and against the consumers best interest.",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la4kw3u/",
                  "created": 1719271785,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la5tit5",
                      "score": 0,
                      "body": "iOs, Android. That's your duopoly right here.\n\nAlso, it makes no sense trying to find issues in other, more free, ecosystems. Did I say they were perfect? No, I said that the best PC platform by a large (canyon) margin wouldn't even exist without this freedom that Apple and Google are restricting on mobile. So, time to remove those limitations. \n\nWill it cost them some profits? Oh, someone will think of the poor corporations!",
                      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la5tit5/",
                      "created": 1719290052,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la5w7cy",
                          "score": 1,
                          "body": "Android allows other app stores on their platform and Google don’t tightly control what customisation manufacturers implement when using Android on their platform. Apple develop iOS purely for their own devices.\n\nI don’t care about it costing corporations profits at all - in fact, that’s what this whole thing is about. Corporations being mad that they can’t make enough profit on the iOS platform. It has nothing to do with consumers. I, as a consumer, don’t want to be forced into using multiple app stores in order to get the apps I want on my phone. I don’t want to be forced to hand my data over to other marketplace providers, either. I like that Apple is a closed ecosystem and that’s why I buy their products. If somebody doesn’t like that, I suggest they switch to Android, which is open.",
                          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la5w7cy/",
                          "created": 1719291479,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "la5wt5x",
                              "score": 0,
                              "body": "And if you like the walled garden approach you will not be forced to download other stores.\n\nI like this freedom and I'll be happy when Apple and Google will be forced to fix their mobile approach. \n\nIn the case of Google, when it will be possible to download the stores directly from the Play Store or websites, instead of installing the APK which is not user-friendly.",
                              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la5wt5x/",
                              "created": 1719291808,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "la5x6sl",
                                  "score": 1,
                                  "body": "You will, though. What happens when XYZ App Store gets exclusive rights to an app I want, or currently have and already rely on? The I’m forced to either forgo or use that platform",
                                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la5x6sl/",
                                  "created": 1719292013,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "la5xixd",
                                      "score": 1,
                                      "body": "No one will leave the App Store. Probably you will just be asked to pay more for the privilege, like Spotify is doing.\n\nWith a specific warning that you are paying more for the same product.",
                                      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la5xixd/",
                                      "created": 1719292195,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "la24vu1",
              "score": -1,
              "body": "Because it is better for competition. Simple as that.\n\nIn any other situation where there is this much market dominance with those companies acting as gatekeepers, people would find it ridiculous to allow. Yet for Apple, a ton of people get up in arms and defend it. I don't get why.\n\nIf you are actually in favor of a free market, then you would support the ones trying to break open these closed platforms, since that leads to a more free market with more opportunities for companies and more options for consumers.\n\nAnd if you don't like those options, you can take the same advice you give people now: don't use it. You are 100% free to just stick with the App Store and ignore the rest.",
              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la24vu1/",
              "created": 1719241778,
              "depth": 2,
              "replies": [
                {
                  "id": "la4lt9g",
                  "score": 1,
                  "body": "You have a warped idea of what a “free market” is. Government regulation is not free market - a free market would be allowing consumers to vote with their wallets and just not buy Apple products if they’re not happy with the way they work.\n\nI don’t want a situation where there’s several different app stores I need to install in order to access the apps I want, because there will inevitably be exclusives that I can’t access without X company’s App Store installed on my phone. Which is 100% what will happen.",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la4lt9g/",
                  "created": 1719272142,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la67oaf",
                      "score": 1,
                      "body": "People are saying \"then buy a different phone\" yet can't seem to then also think \"then don't install different app stores\" for some reason if they don't want to use different app stores.\n\nAlso, you don't use an app store to access your apps. You use it to install. After that the app is there just as usual.\n\nDont know why people have such an issue with the situation they are 100% familiar with and used to on MacOS and Windows.",
                      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la67oaf/",
                      "created": 1719298538,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la6etoz",
                          "score": 1,
                          "body": "Okay so you obviously either just completely skipped over the second part of my comment or physically can’t comprehend it",
                          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la6etoz/",
                          "created": 1719303662,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "la6h4kf",
                              "score": 1,
                              "body": "This could be solved easily by allowing the app-in-app concept, but Apple doesn't seem to like that also (actually the whole thing could have been avoided if Apple would have just allowed that, but here we are). They even banned for a good amount of time some streaming abilities for apps in their store because they were so afraid of missing out on their cut.\n\nBesides that, the same thing applies here. If you're not happy with the way they work, don't use that app. Don't really get why that advice apparently only applies when telling people to not buy an iPhone, but you are unable to skip installing an app if you don't like the way they work.",
                              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la6h4kf/",
                              "created": 1719305345,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "la2782t",
          "score": 0,
          "body": "Agreed. It's crystal clear that they were trying to maliciously comply by \"technically\" allowing more app stores, but making it so absurdly expensive with stuff like per install fees to developers that no one in their right mind would ever use it since malicious users can just constantly uninstall and reinstall your app to bankrupt you.\n\nIt would have been absolutely horrendous for the EU to let that runaround of the DMA stand.",
          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2782t/",
          "created": 1719242576,
          "depth": 1,
          "replies": [
            {
              "id": "la2brdu",
              "score": -1,
              "body": "Yeah the EU will probably come after Apple hard for this, I doubt the regulators are happy about the way Apple \"complied\" with their ruling.",
              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2brdu/",
              "created": 1719244110,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "la17zz6",
      "score": 15,
      "body": "Fuck yeah, can't wait to have 10 different app stores with each having their own exclusives",
      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la17zz6/",
      "created": 1719227852,
      "depth": 0,
      "replies": [
        {
          "id": "la1fge4",
          "score": 44,
          "body": "Stop this nonsense fear-mongering. This hasn‘t happened on Android and won‘t happen on ios.",
          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la1fge4/",
          "created": 1719231740,
          "depth": 1,
          "replies": [
            {
              "id": "la1oigp",
              "score": 4,
              "body": "vanish insurance knee flag crush bow shelter sink relieved deer\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la1oigp/",
              "created": 1719235741,
              "depth": 2,
              "replies": [
                {
                  "id": "la1p0lq",
                  "score": 28,
                  "body": "What exclusive apps are you using from the Samsung store or the Amazon store?",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la1p0lq/",
                  "created": 1719235948,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la28k1o",
                      "score": 0,
                      "body": "Fr. I tried disabling it Lol, sadly you need it for the Samsung apps, nothing else though",
                      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la28k1o/",
                      "created": 1719243026,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la2ql00",
                          "score": 4,
                          "body": "And that's on *Samsung forcing you* not Android or EU. In fact Samsungs behaviour is *anti-collective* and could very well end up facing EU justice in the future.",
                          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2ql00/",
                          "created": 1719249046,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "la28hb5",
                  "score": 2,
                  "body": "You use the Samsung Galaxy store??",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la28hb5/",
                  "created": 1719243001,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "la1ogmw",
              "score": -6,
              "body": "It did happen on PC tho",
              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la1ogmw/",
              "created": 1719235720,
              "depth": 2,
              "replies": [
                {
                  "id": "la1rm6d",
                  "score": 24,
                  "body": "I can only speak as a Windows user, I feel like this turned out pretty great where everyone competes freely.\n\nIt's nice having the freedom to install whatever I want.\n\nFWIW I also own AAPL stock, own an iPad and think they can promote freedom for users, developers and still make a lot of money.  In fact, fighting it too hard could backfire.",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la1rm6d/",
                  "created": 1719236981,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "la1rt6g",
                  "score": -6,
                  "body": "Steam literally controls the whole PC gaming market",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la1rt6g/",
                  "created": 1719237055,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la1u9ny",
                      "score": 14,
                      "body": "That's exactly why I have Steam, Xbox (GamePass), GoG, Epic, the Rockstar launcher and the Ubisoft launcher installed on my PC at this very moment.",
                      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la1u9ny/",
                      "created": 1719238005,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la25xdr",
                          "score": 1,
                          "body": "Agreed. The big game companies like Blizzard, EA, etc. just make their own \"app store\" where you can go to launch their games and buy their other games. But calling this the equivalent of a bunch of app stores with their own exclusives is just plain silly and wrong. \n\nYou can already find the free games these companies make on the Apple and Android app stores. They don't lock it behind a \"blizzard app store\" or an \"EA app store\" that you have to install on your Android device first in order to install the game that you actually want.",
                          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la25xdr/",
                          "created": 1719242137,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "la23av7",
                      "score": 1,
                      "body": "I wish. Anyone trying to compete with Steam is somehow worse storefront than any e-shop or digital store I ever seen in my life.\n\nTo top it off the Steam is not enforcing half its TOS and is not doing anything to actually compete and take countless advantages of their positions. They let their competition do whatever they want and even use Steam and break their TOS, endless publishers and devs to do whatever they want, even use Steam and regularly break their TOS.\n\nYou can even have situations where product bought on Steam is unusable without installing other storefront, making endless other accounts and agreeing to whatever insane data spying bullshit they want to.\n\nThe level of incompetence provided by the alternatives makes me wish Steam was the only storefront, because Steam is just literally existing and everyone else fumbles bag so hard its still a monopoly.",
                      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la23av7/",
                      "created": 1719241231,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la277ao",
                          "score": 3,
                          "body": "Steam is not just 'existing', though. They have tons of features that other stores don't have. And they cost a lot of money and time. Also they don't have the same ambitions. Rockstar or EA stores for example just want to sell their games without paying 20% to Steam, nothing else.",
                          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la277ao/",
                          "created": 1719242569,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "la2acer",
                              "score": 1,
                              "body": ">They have tons of features that other stores don't have.\n\nLiterally everyone has tons of features Steam competitors don't have, this is what i have been explaining.\n\nI thought i didn't need to add the context that some leftover Valve employers work on Valve products and sometimes add some features here and there in a workplace that is famous for where they are allowed to do or not do that if they feel like it, i expected this much to be very clear. \n\nThe entire point is Steam has endless options, including enforcing their own TOS to stifle competition and punish everyone taking advantage of Steam, and make everyone even more dependant on Steam, but they just sit there, through out the rise and fall of every other storefront and no matter what others do.",
                              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2acer/",
                              "created": 1719243635,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "la2n0hr",
                          "score": 1,
                          "body": "I can't say I have any issues with the Xbox app/Windows Store personally.",
                          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2n0hr/",
                          "created": 1719247866,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "la1gojh",
          "score": 15,
          "body": "Competition drives innovation and in the end profits. I don't see the problem. We should not applaud anti-competitive practices, since in the end it means the company will fail to innovate and miss out on new market opportunities and the associated profits.",
          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la1gojh/",
          "created": 1719232326,
          "depth": 1,
          "replies": [
            {
              "id": "la3dxt5",
              "score": 3,
              "body": "“You designed, developed, manufactured and marketed this phone, and designed, developed and deployed the operating system for it, complete with a way to install new apps, but by the way, if you don’t add new code to your operating system that is exclusively and solely meant for other companies to sell their own products on your product, you’re being anti-competitive”\n\nJesus how the fuck do so many people believe this? The only reason iOS apps are so profitable is because of iOS itself to begin with. This is like demanding that Whole Foods allow you to go put your food cart in their store without them vetting or approving of it. This is fucking nonsense.",
              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la3dxt5/",
              "created": 1719256738,
              "depth": 2,
              "replies": [
                {
                  "id": "la3fkwa",
                  "score": 1,
                  "body": "Yes, sometimes that can mean being anti competitive. Nobody would ever accept Microsoft doing this on Windows, yet here we are with people for some reason defending Apple over it.\n\nYour Whole Foods comparison is not accurate in this. It would be like Whole Foods controlling the city council and setting all the rules, and telling every store they are only allowed to start selling if they give 30% of revenue to them. You're damn sure that is anti competitive and should be stopped.",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la3fkwa/",
                  "created": 1719257293,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la3mt6m",
                      "score": 1,
                      "body": "How the fuck is this anything at all like\nWhole Foods controlling city council? There are multiple other competing phone manufacturers and operating systems. You can even use an open source, free OS. \n\n> Yes, sometimes that can mean being anti competitive. Nobody would ever accept Microsoft doing this on Windows\n\nI would. You design an operating system, you make the rules. Don’t like it — use another OS.",
                      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la3mt6m/",
                      "created": 1719259681,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la3y58t",
                          "score": 0,
                          "body": "There would be other towns in that example, but the one you are living in is stopping fair competition and limiting your options to shop or to start a business. \"But you can move then\" is not really an argument here about how the practice is not anti competitive.\n\nBut well, Apple has done a good job on convincing people otherwise. Part of the reason they are such a valuable company in the end. But if governments decide they need to change things to comply with regulations, they need to adapt to that.",
                          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la3y58t/",
                          "created": 1719263397,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "la46osr",
                              "score": 1,
                              "body": ">There would be other towns in that example, but the one you are living in is stopping fair competition and limiting your options to shop or to start a business. \"But you can move then\" is not really an argument here about how the practice is not anti competitive.\n\nNot even remotely comparable. Someone having to physically move their entire fucking family and life to a different spot many miles away just to use a different grocery store is not at all comparable to a smartphone you can swap out in a day. This is so absurd it's hard to tell if you're being serious.\n\nLike, Jesus Christ man. In the city council example, a company is forcing an entire town to use their services which are necessary to eat and survive, and they have a monopoly in that physical area.\n\nIn Apple's case, nobody is forced to buy an iPhone, they're not even the cheapest or most convenient option, and anyone can freely choose to use a different cell phone.\n\n  \nAre we really saying \"Apple has a monopoly on iOS\" right now lmao",
                              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la46osr/",
                              "created": 1719266412,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "la67x6l",
                                  "score": 1,
                                  "body": "Yes, Apple has the monopoly on app distribution on iOS. Which wouldn't be a problem if they weren't part of a duopoly in the smartphone market overall, but they are.\n\nAlso, about the physical moving. It is indeed hard for people to move platforms when all your stuff is on one already. Luckily the EU is also having regulations to make that easier to prevent the platform lock in a little bit.",
                                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la67x6l/",
                                  "created": 1719298706,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "la267u0",
              "score": 0,
              "body": "The regulation itself is kinda anti-competitive because if there is no profits in creating phone OS then why even try?",
              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la267u0/",
              "created": 1719242236,
              "depth": 2,
              "replies": [
                {
                  "id": "la2ct8h",
                  "score": 2,
                  "body": "Apple sells the iPhone with a good amount of profit and people buy it due to iOS. Of course there is profit to try, as we can see with them being a 2+ trillion dollar company based on the sales of this device. Android is an open source project, but the Google apps and such use licenses.",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2ct8h/",
                  "created": 1719244463,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "la273id",
          "score": 1,
          "body": "Politicians gonna politics.",
          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la273id/",
          "created": 1719242533,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la2ph9u",
      "score": 3,
      "body": "Holy shit\n\n  \nGovernment coming to save us (kinda)",
      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2ph9u/",
      "created": 1719248679,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la4tw1t",
      "score": 1,
      "body": "In this case, can we see the EU go after Microsoft, Sony and Nintendo to force them to allow third party app stores on their platforms?",
      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la4tw1t/",
      "created": 1719275193,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la1l5j0",
      "score": -10,
      "body": "Just another way for the government to steal money from the free market.",
      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la1l5j0/",
      "created": 1719234328,
      "depth": 0,
      "replies": [
        {
          "id": "la1yt9i",
          "score": 11,
          "body": "Your definition of free market is 'a monopoly defines who can and cannot compete and takes almost 100% of the profits of one industry'?",
          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la1yt9i/",
          "created": 1719239673,
          "depth": 1,
          "replies": [
            {
              "id": "la2giki",
              "score": 3,
              "body": "Apple doesn’t hold a monopoly in any industry, unless you also consider KFC to have a monopoly in the industry of “chicken within the boundaries of its own restaurant”",
              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2giki/",
              "created": 1719245698,
              "depth": 2,
              "replies": [
                {
                  "id": "la2hvto",
                  "score": 2,
                  "body": "It's a duopoly.",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2hvto/",
                  "created": 1719246153,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "la3e78m",
              "score": 2,
              "body": "This is fucking dumb as shit. Apple made iOS and made the App Store. People wanna sell their stuff on iOS — go through Apple.\n\nIf you wanted to sell smoothies at Whole Foods do you think you can just walk in and demand that you sell your stuff there, and if they don’t allow you to they’re being anti-competitive?",
              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la3e78m/",
              "created": 1719256828,
              "depth": 2,
              "replies": [
                {
                  "id": "la3nm8a",
                  "score": 0,
                  "body": "'This is fucking dumb. Oil is extracted exclusively by Standard Oil Company. If you do not want their oil just use a donkey to move your goods.'\n\n'This is fucking dumb. Windows is made by Microsoft. If you do not want to buy your games on the Windows Store instead of Steam, just use a Mac or Linux.'",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la3nm8a/",
                  "created": 1719259947,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la3uzsn",
                      "score": 2,
                      "body": "> This is fucking dumb. Oil is extracted exclusively by Standard Oil Company\n\nThis would be a fair argument if there weren’t lots of other phone options, OS options; and even open source OS options.\n\n> 'This is fucking dumb. Windows is made by Microsoft. If you do not want to buy your games on the Windows Store instead of Steam, just use a Mac or Linux.'\n\nSounds fair to me",
                      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la3uzsn/",
                      "created": 1719262368,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la5tysr",
                          "score": 2,
                          "body": "Fortunately, you don't work in an antitrust agency and you don't decide what to pursue or not.",
                          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la5tysr/",
                          "created": 1719290286,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "la8h923",
                              "score": 1,
                              "body": "Yeah, that sounds like an awful job. I agree that's fortunate.",
                              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la8h923/",
                              "created": 1719336482,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "la2i6jc",
              "score": 1,
              "body": "A free market is a company deciding what software can run on their platform. \n\nTheir os, their choice. \n\nIf you don't like it, get an android",
              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2i6jc/",
              "created": 1719246252,
              "depth": 2,
              "replies": [
                {
                  "id": "la2iirp",
                  "score": 3,
                  "body": "We are not in the 1910s anymore, antitrust agencies exist for a reason. \n\n'If you don't like oil from Standard Oil Company, well, keep using a donkey to transport goods'. Very nice argument.\n\nAlso, Android is doing the same exact shit, so nope.",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2iirp/",
                  "created": 1719246375,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la2ivtq",
                      "score": 3,
                      "body": "Android is not a donkey.",
                      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2ivtq/",
                      "created": 1719246494,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la2j8vz",
                          "score": 2,
                          "body": "Your objection would work in that case. Fortunately, we evolved in the matter and created antitrust agencies. Even if they are not as efficient as they should, they still make things better for everyone.\n\nAlso, as I said, Android is doing the same shit.",
                          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2j8vz/",
                          "created": 1719246616,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "la2l0pn",
                              "score": 2,
                              "body": "We evolved to have the Europeans try to extract money from American tech companies because they can't make their own global brands\n\nHonestly the US should put sanctions equal in value for all the shakedown fines the EU imposes.",
                              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2l0pn/",
                              "created": 1719247207,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "la2ljrg",
                                  "score": 3,
                                  "body": "EU is not the Wild West. If you want to sell your goods here, you have to fairly compete. If you don't fairly compete, but just try to strongarm your competition, well see you.",
                                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2ljrg/",
                                  "created": 1719247383,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "la2ma3e",
                                      "score": 3,
                                      "body": "Lol it's just a shakedown \n\nA company should definitely be allowed to say what apps run on their platform. Nothing \"unfair\" about that",
                                      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2ma3e/",
                                      "created": 1719247624,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "la2u2uj",
                                          "score": 2,
                                          "body": "Consumer interest >>>>>>>>> companies interest.",
                                          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2u2uj/",
                                          "created": 1719250186,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "la2iia2",
                  "score": 1,
                  "body": "We are not in the 1910s anymore, antitrust agencies exist for a reason. \n\n'If you don't like oil from Standard Oil Company, well, keep using a donkey to transport goods'. Very nice argument.\n\nAlso, Android is doing the same exact shit, so nope.",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2iia2/",
                  "created": 1719246370,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "la1zp6n",
              "score": -7,
              "body": "Companies/people choose to use the platform, they can go to another one if they don't like it. The funny thing is that government regulations regularly create de facto monopolies and stifle innovation.",
              "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la1zp6n/",
              "created": 1719239988,
              "depth": 2,
              "replies": [
                {
                  "id": "la2344o",
                  "score": 7,
                  "body": "No, they can't. That's why they are called gatekeepers, within the DMA.\n\n'You can die of starvation, if you want'. No, that's not a good argument.",
                  "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la2344o/",
                  "created": 1719241166,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "la24724",
      "score": -9,
      "body": "The EU creates and innovates nothing, so it makes sense all they can do is fine foreign companies.",
      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la24724/",
      "created": 1719241541,
      "depth": 0,
      "replies": [
        {
          "id": "la27hbf",
          "score": 1,
          "body": "Fine gatekeepers who make it impossible for other companies to compete in entire industries*\n\nCorrected for you.",
          "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la27hbf/",
          "created": 1719242663,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la1g2ql",
      "score": -11,
      "body": ">The regulators also said that the fees Apple charges developers for the initial acquisition of new customers via the App Store “go beyond what is strictly necessary.”\n\nEvil company seeks to profit from provided services.",
      "permalink": "/r/stocks/comments/1dnasfp/european_union_regulators_accuse_apple_of/la1g2ql/",
      "created": 1719232039,
      "depth": 0,
      "replies": []
    }
  ]
}