{
  "title": "Target taps Shopify to add sellers to its third-party marketplace ",
  "score": 42,
  "selftext": "Target is turning to Shopify to add new and trendier brands to its website.\n\nStarting Monday, the Minneapolis-based discounter said companies that work with Shopify can apply to join Target Plus, its third-party marketplace. Some of Shopify’s customers are smaller or up-and-coming brands that use the e-commerce platform to build and operate a website.\n\nTarget and Shopify did not disclose financial terms or the length of the deal.\n\nIn an interview with CNBC, Target Chief Guest Experience Officer Cara Sylvester said Shopify will help the retailer discover hot items and quickly make them available for Target’s online shoppers. She said Target plans to put some popular items discovered through the Shopify deal on store shelves.\n\nTarget’s marketplace creates a “halo” and is “an accelerant to the total business,” she said. Sylvester added that as the company expands its online assortment and adds eye-catching merchandise, customers tend to visit its website more frequently and buy from both marketplace sellers and Target’s own brands.\n\nThe big-box retailer is trying to get back to sales growth as consumers buy less discretionary merchandise, with the discounter lagging behind grocery competitors like Walmart. Target has posted four consecutive quarters of declining comparable sales, and its overall sales have fallen in three of the past four quarters.\n\nThe company has struggled to grow its e-commerce business, too. Target’s digital sales grew 1.4% in the first quarter, the first such increase in more than a year.\n\nCompany leaders said in May that the retailer is on track to return to sales growth in the second quarter, but that’s partially due to its weak performance year over year. For the full year, Target said it expects comparable sales will range from flat to up 2%, with adjusted earnings per share of $8.60 to $9.60. \n\nShares of Target have underperformed the broader stock market. As of Friday’s close, the company’s stock is up about 2% compared with the S&P 500′s nearly 15% increase. Its stock price of $146.13 is also well below the highs it hit during the Covid pandemic years, when it topped $260.\n\nShopify could also use a boost. Shares tumbled after its earnings report in May and are down about 17% so far this year.\n\nTarget Plus has only a tiny fraction of the revenue and sellers of other third-party marketplaces. Unlike Amazon, Walmart, eBay and others, Target allows brands to join by invitation only. It has more than 1,200 sellers, according to Target. Amazon counts about 2 million sellers and Walmart has about 135,000 sellers, according to estimates by Marketplace Pulse, a e-commerce research tracker.\n\nThrough the marketplace, Target’s website has carried items like the UnBrush, a detangling hairbrush that went viral on TikTok, and premium products, such as sunglasses from Ray-Ban and Coach. It offers more than 2 million products from brands including Crocs, Ruggable and Timberland. The assortment cuts across many categories including apparel, sporting goods and home decor.\n\nTarget said its marketplace has gained momentum. It said its seller and product count have more than doubled over the past calendar year.\n\nThe retailer doesn’t split out the revenue made through its third-party marketplace. Instead, it lumps it together in financial filings with “other revenue,” such as money made from credit card profit-sharing and its advertising business, Roundel. That other revenue totaled $388 million, accounting for less than 2% of its $24.53 billion of revenue that it reported in its most recent quarter, which ended May 4.\n\nYet Sylvester said Target Plus is “one of the fastest growing parts of Target’s business.”\n\nBrands that join Target Plus also become potential customers of Roundel. The advertising business grew by more than 20% in the most recent quarter. Sylvester would not say how much of that came from ads bought by Target Plus sellers.\n\nThird-party marketplaces have become a hot area in retail because they tend to drive higher profits. Instead of buying goods from suppliers, retailers rely on sellers that typically store and own the inventory. Those sellers also take on the financial risks if customers don’t want items or the products must be marked down.\n\nRetailers typically get a cut of sellers’ sales. Plus, they can charge for services, such as fulfilling a brand’s online orders or selling advertisements, like sponsored search results, for sellers’ products.\n\nTarget does not offer fulfillment services, instead relying on Target Plus sellers to store, pack and ship their own goods.\n\nWalmart, in particular, has ramped up its marketplace efforts as it tries to close the wide gap with Amazon and its dominant e-commerce platform. It has been recruiting sellers and offering new services, like the ability to ship bulky items like patio furniture or canoes. Sellers in Walmart’s U.S. marketplace grew 36% in the first quarter and it now has more than 420 million unique items, CEO Doug McMillon said on the company’s earnings call in mid-May.\n\nOther marketplaces, such as TikTok Shop and Temu, are growing rapidly, too.\n\nSource: https://www.cnbc.com/2024/06/24/target-taps-shopify-to-add-sellers-to-its-third-party-marketplace.html",
  "link_flair_text": null,
  "id": "1dnatlw",
  "num_comments": 12,
  "created_utc": 1719227111,
  "permalink": "/r/stocks/comments/1dnatlw/target_taps_shopify_to_add_sellers_to_its/",
  "comments": [
    {
      "id": "la1iyc7",
      "score": 48,
      "body": "Another site going to be plagued by chinese drop shipped junk\n\nRIP",
      "permalink": "/r/stocks/comments/1dnatlw/target_taps_shopify_to_add_sellers_to_its/la1iyc7/",
      "created": 1719233366,
      "depth": 0,
      "replies": [
        {
          "id": "la5zwtm",
          "score": 4,
          "body": "Right? Literally what I don’t want, and why I historically chose to use Target lol",
          "permalink": "/r/stocks/comments/1dnatlw/target_taps_shopify_to_add_sellers_to_its/la5zwtm/",
          "created": 1719293559,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la884av",
          "score": 5,
          "body": "The enshittification will continue until everything we can buy everywhere is trash",
          "permalink": "/r/stocks/comments/1dnatlw/target_taps_shopify_to_add_sellers_to_its/la884av/",
          "created": 1719333477,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la8i6nv",
          "score": 2,
          "body": "I already can't avoid seeing f-ing Temu on every ad on every app.",
          "permalink": "/r/stocks/comments/1dnatlw/target_taps_shopify_to_add_sellers_to_its/la8i6nv/",
          "created": 1719336785,
          "depth": 1,
          "replies": []
        },
        {
          "id": "litttj1",
          "score": 1,
          "body": "I really hope they don't go that route. I'm just starting the process as a 3rd party seller, with my small business jewelry brand and I'm praying they don't let the riff-raff in like Amazon and Walmart. It makes it so hard to compete with these manufacturers disguised as small businesses.",
          "permalink": "/r/stocks/comments/1dnatlw/target_taps_shopify_to_add_sellers_to_its/litttj1/",
          "created": 1724042965,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la1c91x",
      "score": 22,
      "body": "Only 15-20 years late to the game of third party sellers",
      "permalink": "/r/stocks/comments/1dnatlw/target_taps_shopify_to_add_sellers_to_its/la1c91x/",
      "created": 1719230138,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la2lstl",
      "score": 2,
      "body": "Step one for me when shopping is eliminating those third party options.... Maybe that's a contrarian move though, idk",
      "permalink": "/r/stocks/comments/1dnatlw/target_taps_shopify_to_add_sellers_to_its/la2lstl/",
      "created": 1719247466,
      "depth": 0,
      "replies": [
        {
          "id": "litu1k1",
          "score": 2,
          "body": "Don't do it quite yet! So far they are actually finding brands that are in line with their customers. :-)",
          "permalink": "/r/stocks/comments/1dnatlw/target_taps_shopify_to_add_sellers_to_its/litu1k1/",
          "created": 1724043088,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la3jon0",
      "score": 2,
      "body": "These deals are the kiss of death for legit small brands. It's becoming almost impossible to have an independent brand that isn't paying a sizeable cut to multiple gatekeepers.",
      "permalink": "/r/stocks/comments/1dnatlw/target_taps_shopify_to_add_sellers_to_its/la3jon0/",
      "created": 1719258657,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la5q1mc",
      "score": 1,
      "body": ">invitation only\n\nGood that they're going to at least try to keep scammers out.",
      "permalink": "/r/stocks/comments/1dnatlw/target_taps_shopify_to_add_sellers_to_its/la5q1mc/",
      "created": 1719288301,
      "depth": 0,
      "replies": []
    }
  ]
}