{
  "title": "I need major advice ",
  "score": 29,
  "selftext": "I am 43 years old and just started investing in March of this year. I am a low income earner. I opened a Roth IRA and have done a bit of trading. I have deposited $5000 into my IRA so far this year and was up about $1000 and felt I was doing pretty good. I have done my best to learn as much as possible but with the way the market is now I find myself losing a bit daily no matter what I do. I really wish I had started investing years ago to put my money to work but I feel with the way things are now it’s just not that safe to buy into anything. I find I will invest and be up for a couple of days and then go back to the negative. I owe around 60k on my house. I have an emergency savings but other than that I have nothing else. I am not in the best of health and I really hope to pay my house off by age 50. My house is 3% Interest so I thought playing the market may be the best way to go about things and also leave a bit behind just in case something were to happen to me. I do not mind being a tad aggressive but have recently become nervous. I am going to try and max out my IRA each year but I should be able to at least contribute 5k a year. My significant other would be able to just barely afford the house if something were to happen to me and my biggest fear is leaving her with nothing. I feel at this point I am even cautious buying into the S&P. As of now my money is parked in Fidelity Spaxx. Is there any advice you can give me?\n",
  "link_flair_text": null,
  "id": "1dnlngu",
  "num_comments": 70,
  "created_utc": 1719256294,
  "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/",
  "comments": [
    {
      "id": "la3u5d6",
      "score": 22,
      "body": "What you’ve been seeing for the past week, imo, is institutional end of quarter rebalancing. Most actively managed institutions have policies that want to limit exposure to various sectors to certain percentages. Notice that the tech sector, nasdaq, which has been ripping all quarter, is dropping the most over the past few days. At the same time the DOW, which is made up of very large blue chip stocks, which have been underperforming this past quarter, has been rising. Meanwhile the S&P 500, which contains all sectors, has only moved .01% in the last five days. This is all perfectly normal,healthy, and sets up the large institutions with a rebalanced portfolio going into the next earnings season that starts towards the end of next month. \n\nDon’t read too much into short term dips as it all becomes just a blip over the long term. FOMO buying at tops and then panic selling on dips is a losing strategy. Take emotions out of it and contribute every month, dollar cost averaging.",
      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3u5d6/",
      "created": 1719262090,
      "depth": 0,
      "replies": [
        {
          "id": "la40ola",
          "score": 2,
          "body": "I was doing great and am still ahead for the year but am definitely noticing the rebalancing. I am definitely going to rebalance and diversify a bit when I am able. I used to think buying high and selling low was stupid, yet here I am doing the same thing the past few days. Ugh.",
          "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la40ola/",
          "created": 1719264283,
          "depth": 1,
          "replies": [
            {
              "id": "la6kjvf",
              "score": 8,
              "body": "You sound as if you're trying to make a quick buck off the market and day trading instead of setting yourself up for the future. Put your money into some solid stocks and leave it there. Time in the market is better than timing the market. You can always borrow against your stock holdings if necessary. I'm no financial pro but I would stay away from meme stocks and options and such unless you really know what you are doing.",
              "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la6kjvf/",
              "created": 1719307844,
              "depth": 2,
              "replies": []
            },
            {
              "id": "la60y3n",
              "score": 2,
              "body": "You never lose if you hold.\n\nYou only lose if you sell. Just be patient.",
              "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la60y3n/",
              "created": 1719294180,
              "depth": 2,
              "replies": [
                {
                  "id": "la8r7rz",
                  "score": 1,
                  "body": "Bullshit. You can buy a bad stock that either gets delisted, goes bankrupt or simply enters a death spiral and never goes back up.\n\n\n\nYou'd still lose the money regardless if you sell or not. Not selling a worthless stock doesn't make your money magically return...",
                  "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la8r7rz/",
                  "created": 1719339728,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "laa5lly",
                      "score": 2,
                      "body": "I wasn't talking about some penny stock.\n\nI was meaning ETFs and blue chips. \n\nIf the guy is all in on gme or ffie God help his soul.... cause we can't help him. \n\nBut if he buys and holds VOO and QQQ - he will not lose unless he sells for a loss.",
                      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/laa5lly/",
                      "created": 1719356760,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lag426l",
                  "score": 1,
                  "body": "Oh you can lose by holding too lol. Ive been burned by a delisted penny stock before 😂 But if he's investing in etfs through an IRA he should just hold till retirement.",
                  "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/lag426l/",
                  "created": 1719446986,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "la3jipp",
      "score": 28,
      "body": "You got to think about long term plan, not short term. Where do you want your portfolio to be in the next five years?\n\nJust keep buying funds like $VOO every month and don't stress out about daily price changes. Been buying $VOO since 2017 and already made a lot of profit. If you look at the stock market today, lots of top stocks show volatility but $VOO is not as volatile.",
      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3jipp/",
      "created": 1719258603,
      "depth": 0,
      "replies": [
        {
          "id": "la3llf6",
          "score": -20,
          "body": "I started with FXAIX and then sold out to buy individual stocks. I was getting aggressive and doing really well. I felt if I could keep that up I could have the house paid off by 50. Now I feel the market has went downhill and I know you can’t time the market but at the same time if it’s going to drop more I wonder if waiting until after the election to buy in would be worthwhile.",
          "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3llf6/",
          "created": 1719259282,
          "depth": 1,
          "replies": [
            {
              "id": "la3rbye",
              "score": 33,
              "body": "Please stop worrying about paying off the house with a 3 percent loan.  If that bothers you just buy a little life insurance policy and ignore that house concern.",
              "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3rbye/",
              "created": 1719261160,
              "depth": 2,
              "replies": [
                {
                  "id": "la5b6l6",
                  "score": 1,
                  "body": "Not sure about the life insurance part, but agree that “paying” off something you are basically getting floated for free (3% interest) should not be an issue. Buy VTSAX or another broad ETF/Mutual. Hell, there are even high interest savings that pay 5%. Put your money there and don’t worry\nAbout the low mortgage rate.",
                  "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la5b6l6/",
                  "created": 1719281952,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "la3zjcc",
              "score": 8,
              "body": "There’s an old saying about time in the market being more important then timing the market that I think applies here. \n\nIt sounds like you don’t have quite enough capital to hold a diverse stock portfolio, so I think you should consider dumping the majority of your investing money into a low cost index fund, and just forget about it. You can put together a forecast as to where you will be in five years given some estimates for an anticipated rate of return. One of the advantages of taking this approach is that you shouldn’t worry about every up or down move. Just add to it regularly. \n\nIf you want to put a smaller amount into individual companies, then I’d recommend concentrating on sticking with the big and growing companies rather than swinging for the fences on high risk/high reward approaches. \n\nYou’ll also want to think about tax advantaged approaches and see if there’s any matching programs from your employer. I think you mentioned that you have $60k left on your mortgage that you don’t want to leave to your partner to pay off in case of an emergency. I’d recommend covering that possibility with insurance, since that will give you a known payout.",
              "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3zjcc/",
              "created": 1719263884,
              "depth": 2,
              "replies": [
                {
                  "id": "la419x8",
                  "score": 2,
                  "body": "Yeah I think I have been trying to diversify with what I have and have been leaning way more towards the tech sector. Definitely going to simplify and stop stressing. Thanks",
                  "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la419x8/",
                  "created": 1719264487,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la4a2ct",
                      "score": 1,
                      "body": "I balance between Amazon, voo, and a few high dividend paying stocks.  What you will see if you look at trending lines is you’ll maybe loose the $$$ in individual equities.  I think as others have stated is time in market and absence of volatility or as much might suit you as you are missing time in the market.  I mean if you want to gamble buy bitcoin fractionally and maybe lose it all or double it but even then you’re kinda late to the party",
                      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la4a2ct/",
                      "created": 1719267676,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la6nxx1",
                          "score": 1,
                          "body": "They all say that then it goes up over the years",
                          "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la6nxx1/",
                          "created": 1719310206,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "la4cv90",
              "score": 2,
              "body": "I have some in FXAIX, and the rest in individual stocks. I'll add to FXAIX when I add money to the account, otherwise I limit myself to adding to my individual stocks only by using realized gains. This helps me to maintain discipline, which it sounds like the OP needs to develop. It's no easy feat, I know. It's taken me years, and I still have my moments. If only SBUX would jump (for whatever reason) so I can drop that bag!",
              "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la4cv90/",
              "created": 1719268727,
              "depth": 2,
              "replies": [
                {
                  "id": "la4hk4j",
                  "score": 2,
                  "body": "This is my plan from here on out. Sticking to it!!",
                  "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la4hk4j/",
                  "created": 1719270499,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "la6vig7",
              "score": 2,
              "body": ">I was getting aggressive and doing really well.\n\nYou weren't doing really well, the market was.",
              "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la6vig7/",
              "created": 1719314768,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "la3slld",
      "score": 2,
      "body": "Doesn’t look like your doing too badly considering",
      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3slld/",
      "created": 1719261578,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la3ytuy",
      "score": 2,
      "body": "Congrats on getting started. It is never too late! Just learn as much as you can and keep at it.",
      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3ytuy/",
      "created": 1719263630,
      "depth": 0,
      "replies": [
        {
          "id": "la41ceq",
          "score": 1,
          "body": "Thank you",
          "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la41ceq/",
          "created": 1719264511,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laf66wa",
      "score": 2,
      "body": "So are you expecting a turn for the worse? Sorry to hear that if yes. I would get into CDs or other liquid items if your desire is SAFE. You can get a decent rate now and least you will not lose money. \n\nIf you want to be in the market go with companies that have been around a long time and are stable, like Walmart, Costco, etc. They usually hold up very well and don't swing a lot so pretty safe investments. \n\nFrom what I take away from this your best bet is safe investments to keep what you have and make some extra in case you are not around one day, so play it safe to ensure you have money for her.",
      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/laf66wa/",
      "created": 1719434863,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la44emg",
      "score": 3,
      "body": "Time in the market>timing the market. \n\nYou’ve got your money in; now, just let it sit. A ROTH is a long term account. You need to focus on performance over years. You’re not a day trader; you don’t need to focus on what happens every day.",
      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la44emg/",
      "created": 1719265600,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la3e5yo",
      "score": 3,
      "body": "These are my holdings currently as of today. Where they bounce from red to green. \n\nAmazon \nMeta\nTesla\nNVDA \nMicron Technology",
      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3e5yo/",
      "created": 1719256816,
      "depth": 0,
      "replies": [
        {
          "id": "la3jymp",
          "score": 17,
          "body": "I would just hold onto these stocks as they would grow more in the next five years and buy more stable funds like $VOO every month.",
          "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3jymp/",
          "created": 1719258749,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la3fblu",
          "score": 21,
          "body": "I wouldn’t mess with single stocks if I were you.  Just keep contributing to a low-cost S&P500 fund like $VOO.",
          "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3fblu/",
          "created": 1719257207,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la3qrwn",
          "score": 8,
          "body": "All of these are good choices even if you buy just a few shares.  I would also add WMT as a more conservative choice.  Just be patient.  Consider an S&P index fund.",
          "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3qrwn/",
          "created": 1719260976,
          "depth": 1,
          "replies": [
            {
              "id": "la3syu1",
              "score": 2,
              "body": "I had a large position of Walmart a month ago. Wish I had kept it, ha.",
              "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3syu1/",
              "created": 1719261698,
              "depth": 2,
              "replies": [
                {
                  "id": "la4iz02",
                  "score": 5,
                  "body": "So, you are circling all around success and just over trading.  I do that as well.  Some great successes have come from learning to add more on dips instead of selling.  The market wants to frustrate you and almost trick you into doing the wrong thing.  \nRather than what to buy, maybe we should be talking about graphing packages.  I could never trade if I could not see a graph with some history of the last year and last 20 or 30 days to actually see how the stock has been performing.  I never enter or exit without seeing the stock behavior so I can see if I am buying it low or at a recent high.  Many people use phones to trade and intuition but I simply cannot do that.  I must be able to see what is going on.  Everything goes up and down and being able to see how stocks behave over the last year or more is important.   Something to consider.",
                  "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la4iz02/",
                  "created": 1719271045,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "la4w9d1",
          "score": 3,
          "body": "Those stocks are fine, but you should probably be buying etfs going forward. If you want tech etfs there's vgt and xlk. Or you could always just go with voo.",
          "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la4w9d1/",
          "created": 1719276118,
          "depth": 1,
          "replies": [
            {
              "id": "la6yvzb",
              "score": 1,
              "body": "This is indeed a good suggestion.",
              "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la6yvzb/",
              "created": 1719316483,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "la3lgkv",
          "score": 3,
          "body": "You're concentrated into 1 single sector. And on top of that, NVDA and Micron are cyclical industries (guaranteed highs followed by guaranteed lows). What you're doing is dangerous at your age. You cannot take the same investing strategy as 22 year olds in this sub.\n\nHaving a good amount in tech is fine. However, I would think a simple portfolio like: 40% an ETF, 30% tech, 20% brk.b, 10% energy is much better for your situation. And even that is pretty concentrated. Instead of holding 100% tech at its all time high.",
          "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3lgkv/",
          "created": 1719259239,
          "depth": 1,
          "replies": [
            {
              "id": "la3m475",
              "score": 2,
              "body": "Thank you. I need to hear that. I go back and forth as I start loosing, I was doing SCHD and SCHG for a while. SCHD was lagging so I sold out. Now everyone is buying, ha. I keep thinking a Dividend fund would be good because the stocks they hold but now that everyone is buying in I feel I might also lose on that long term.",
              "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3m475/",
              "created": 1719259453,
              "depth": 2,
              "replies": [
                {
                  "id": "la3nukr",
                  "score": 7,
                  "body": "Quit bouncing in and out.   In your position, you should stay away from individual stocks, and stick with index funds.   If you do want to play with individual stocks, keep it at less than 5% of your total holdings.",
                  "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3nukr/",
                  "created": 1719260021,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la3o86m",
                      "score": 2,
                      "body": "Yeah I made a huge mistake by bouncing in and out. It was good when it was good but now I am learning, ha.",
                      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3o86m/",
                      "created": 1719260142,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "la3pqhz",
                  "score": 3,
                  "body": "You still have a good amount of time if you're planning to retire at 65. That's 23 years of compounding gains.\n\nI'm not one to advocate 100% SPY or VOO, because I think a simple portfolio like the one I listed out in my previous comment will outperform it. But it's a better strategy than going 100% tech at your age.\n\nSo go ahead and keep your tech positions if you wish. No need to sell them. But from here on out, start building your non-tech positions. If you're not interested in going 100% ETF, here are some very good non-tech bets to look into: BRK.B, CI, AXP, ACGL, BTI...",
                  "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3pqhz/",
                  "created": 1719260635,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la3tw22",
                      "score": 1,
                      "body": "Thank you, good advice. I do not necessarily think I can beat the market but do believe that tech stocks in the next few years could do really well. I do agree I need to diversify a bit though.",
                      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3tw22/",
                      "created": 1719262005,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "la4eov4",
                      "score": 1,
                      "body": "Maybe buy ABR for the dividends instead of BTI?",
                      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la4eov4/",
                      "created": 1719269408,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "la3ny1u",
              "score": 2,
              "body": "That is something I was attempting to do about a month ago but went a different way. If I had held I would be doing ok. I need to simply realize I am not a day trader, ha. Are there any certain funds you recommend for Tech and energy?",
              "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3ny1u/",
              "created": 1719260051,
              "depth": 2,
              "replies": [
                {
                  "id": "la3uztu",
                  "score": 1,
                  "body": "For tech, I would pick only 2 companies you have the highest conviction in and focus on those. I would personally go for GOOG and AMZN if I had to pick at the current valuations.\n\nFor energy, VLO. Despite being up so much in the past 5 years, it's trading at only 7x its average yearly free-cash-flow and is still a good buy.\n\nTAC is a good choice now too because management is turning the company around. I bought at the bottom this year. It's a 50% oil, 50% non-solar green energy Canadian company. It's even better value than VLO.",
                  "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3uztu/",
                  "created": 1719262368,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la3xdzu",
                      "score": 1,
                      "body": "I just recently bought in on Amazon and am already down a bit just today but it seems like a good buy. Will try to scale down on some others and diversify a bit. Thank you for the advice.",
                      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3xdzu/",
                      "created": 1719263145,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "la6ed0k",
          "score": 1,
          "body": "This is a pretty classic thing for new investors. Buy the shiny company that is hot. \"Everyone uses Amazon, so I'm sure they'll be fine.\" is the type of mentality for new investors. Realistically, you probably don't have the time, principal, or really the motivation to learn enough about individual stocks to actually invest in individual equities. Just VOO it up and ignore everything. A stable company to hold for the long term is great until it isn't. There's tons of valuation concerns with the companies listed, so long term if they can't grow into that valuation, then they will likely underperform. These are not issues you'd half to pay any attention to if you just bought the market and ignored everything else.",
          "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la6ed0k/",
          "created": 1719303324,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la40tuy",
      "score": 1,
      "body": "You are thinking about investing all wrong.   You shouldn't even be looking at your investments on a daily or weekly basis.   You should be thinking in terms of years.   If you are investing in stocks, you should really be thinking 5+ years at least, preferably 10+.   What happens today, tomorrow, next week, 6 months, or even 2 years, should not be a concern for you.   You invest in stocks because you believe (based on an incredible track record) that your investment will grow over a longer time span (at least 5-6 years, preferably a decade or more).    If you don't have that much time, you shouldn't be investing in stocks.\n\nAlso, when I say \"investing in stocks,\" I mean index funds like the FXAIX that you got out of.   Don't day trade, and don't try to chase winners - it's a good way to end up behind where you would be if you just bought and held things like FXAIX.   Arguably you should diversify even beyond FXAIX.   Seriously consider adding some international diversification, and also small and mid cap.\n\nIf you are risk averse, you should perhaps put more money into a bond fund, or things of that nature.\n\nA good simple way to achieve a good, all in one portfolio, is via a target date fund.   IT will have you diversified across the US market, and international, and will slowly add bonds as you get nearer to your target date, making your portfolio less volatile and more secure as you get closer to actually needing the money.\n\nAt any rate, any investment is going to have its ups and downs.   We are interested in long term trends.   Long term, if you invest in a diverse portfolio (things like FXAIX, or VTI, or VTI + VXUS, or VT), you can reasonably expect to earn about a 5% yearly return, on average (edit: real return, ie accounting for inflation).   Obviously you will not get rich quickly this way, but historically it is a pretty reliable way to build your wealth over a long time span (again, think 6+ years... ideally much more than that).\n\nMoney that is needed in a year or two probably should not be invested in stocks at all.  And again, don't pick individual stocks.   Doubly so if you dislike volatility!   Diversification is how you lower volatility!",
      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la40tuy/",
      "created": 1719264333,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la6ntlc",
      "score": 1,
      "body": "So first off make sure you have an emergency fund and I personally like 5 months of salary set aside (collecting interest) from there paying off any aggressive debt, but trying to leverage debt keeping it in a good range for if you need to make big purchases paying it off fairly quickly. From there the talk of investing, for the remainder consider investing, we are not in a wildly good environment to lump sum, if you have a set amount consider dollar cost averaging into a strong satellite portfolio, and once a week put 50ish or so dollars between them. You can up that amount to distribute it a bit quicker but remember a ira should be a safe haven with a little room for risk but not drastic. Best of luck",
      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la6ntlc/",
      "created": 1719310125,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la86odg",
      "score": 1,
      "body": "read \"traders traps\" then continue your investing strategies with what you learn. also read \"investing for dummies\" both are great beginner books.",
      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la86odg/",
      "created": 1719332999,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la9z7kb",
      "score": 1,
      "body": "\nHi everyone,\n\nI'm a single mom of two, and I'm reaching out for a bit of help. I just got out of an 11-year relationship and am going through a tough time financially. I have a job where I work three days a week, and I'm now adding another day to my schedule. My mom has agreed to watch my one-year-old so I can work more.\n\nDespite these efforts, I'm struggling to make ends meet until next month when things should stabilize. If anyone could spare even a dollar, it would mean the world to me and help us get through this challenging period. Thank you so much for your my cashap is Agatha B",
      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la9z7kb/",
      "created": 1719354393,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lag3kzz",
      "score": 1,
      "body": "Soooo What stocks, etfs or other funds are in your Roth Portfolio. \n\nKind of useful information to give someone if asking for advice. \n\nPersonally my 4 favorites are SPY, VOO, SPMO, AND VONG. \n\nBEST ADVICE....I can give is just don't touch it and make sure your portfolio is diversified. ETFs are my personal preference. Safer and less volatility than individual stocks.",
      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/lag3kzz/",
      "created": 1719446800,
      "depth": 0,
      "replies": [
        {
          "id": "lajx1pk",
          "score": 2,
          "body": "Amazon, Tesla, MU, Meta, NVDA were my  holdings. I put everything into FZROX Monday. I think Tuesday everything I was currently holding went up quite a bit. Ha.. ah well that’s the name of the game. Going to start mixing it up more now instead of buying all individual stocks.",
          "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/lajx1pk/",
          "created": 1719509697,
          "depth": 1,
          "replies": [
            {
              "id": "lajydp6",
              "score": 2,
              "body": "Definitely a good idea. I don't think any of those companies are risky but it's a safer bet using a broader approach.",
              "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/lajydp6/",
              "created": 1719510132,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "la3cy28",
      "score": 1,
      "body": "I was in FXAIX and did ok. I then started buying individual stocks and was doing much better. I am thinking about going back to FXAIX but wonder if this is a horrible time to buy back in.",
      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3cy28/",
      "created": 1719256404,
      "depth": 0,
      "replies": [
        {
          "id": "la3kpc9",
          "score": 4,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3kpc9/",
          "created": 1719258992,
          "depth": 1,
          "replies": [
            {
              "id": "la3mlkd",
              "score": 1,
              "body": "Def been thinking to simplify everything and just going all in on that. This back and forth as of late is starting to stress me out. I love the aspect of playing the game and I have learned a lot. I would love to play the game but the reality of my age is starting to set in.",
              "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3mlkd/",
              "created": 1719259612,
              "depth": 2,
              "replies": [
                {
                  "id": "la43g1y",
                  "score": 3,
                  "body": "I would give serious thought to a Boglehead 3 fund portfolio: US stock market, International stock markets (excluding US), and bonds.   There is a lot of thought that might go into how you allocate across these 3 things, but such a portfolio is meant to give you a humble but relatively stable return over a longer time period (decade +).   It is reasonable to expect perhaps 5% average real return in such a portfolio, over a longer period of time.    Much less volatile than individual stocks, or even individual stock markets (ie the US).   \n\nA reasonable starting point might be 60/20/20 (US/int/bond).   \n\nYou could achieve this with something like: VTI/VXUS/BND.   \n\nYou can substitute VOO or FXAIX for the US part of the portfolio.\n\nLook, something like this is not glamorous or exciting.   But it will outperform many folks who are doing like you are currently doing... buying individual stocks.    There is a reason why folks like Warren Buffet advocate for folks just buying the market - you are likely to do better than most stock pickers.\n\nAnd remember the famous study (I think Fidelity did it) which found that the best investors are the ones who either died or forgot their account password.   No joke, man.   Don't look at your stuff on a daily or weekly basis.   You aren't a big time Wall Street player.   You are a regular pleb like most of the rest of us.   Humble yourself and accept your 5% average yearly return and be happy - you'll most likely be better off this way.",
                  "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la43g1y/",
                  "created": 1719265250,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la4htiu",
                      "score": 2,
                      "body": "Thank you, I think I need to hear that.",
                      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la4htiu/",
                      "created": 1719270600,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "la3hmt4",
      "score": 0,
      "body": "The thrust of your situation is the need to pay off the house as soon as possible.  That is your goal.\n\nHow much do you owe on the property ?",
      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3hmt4/",
      "created": 1719257981,
      "depth": 0,
      "replies": [
        {
          "id": "la3ic4g",
          "score": 1,
          "body": "58k",
          "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3ic4g/",
          "created": 1719258215,
          "depth": 1,
          "replies": [
            {
              "id": "la3lu12",
              "score": 0,
              "body": "I would put a few dollars in an emergency fund monthly and put everything towards the mortgage.\n\nThe property can provide some protection for your wife in your situation.  It is a simple plan.",
              "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3lu12/",
              "created": 1719259361,
              "depth": 2,
              "replies": [
                {
                  "id": "la3n2xj",
                  "score": 1,
                  "body": "I have 5k in savings. Lately I have been thinking exactly that. Was thinking of not contributing to the Roth for a bit and letting it build up a bit more.",
                  "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3n2xj/",
                  "created": 1719259770,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la3wwr9",
                      "score": 2,
                      "body": "Also try to get some cheap term life insurance if you don’t have it. Through your job if it offers it. Not sure about your health situation but you might find a few companies that offer smaller policies without a physical exam. Some credit unions have agreements with insurance companies that start off with a few thousand dollars for free just for opening an account and signing up.",
                      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3wwr9/",
                      "created": 1719262987,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la3zz99",
                          "score": 2,
                          "body": "I manage a non profit crisis center and do not make that much money by todays standards. There are no benefits. Hopefully I can change that someday soon. Unfortunately we have a way to go. I have been looking around for health insurance for myself and my employees. Many ppl (that do not really know me) tell me to go find another job but I love what I do and it is a big need for the community. I have definitely sacrificed a bit by doing what I do but at this point it is my whole identity. The town I live in is fairly small and if it weren’t for volunteers I am not sure what I would do. It is important to me that I make a difference but I suppose I am reaching the age of being consumed with guilt and worry. I have tried to teach my children to do something that matters and thankfully they are all doing extremely well. I would die a bit more peacefully knowing there is a cushion for my significant other and to not put that burden on my children though.\n\nI will look into a cheap life insurance policy. It’s definitely better than nothing at all.",
                          "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3zz99/",
                          "created": 1719264039,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "la87956",
                              "score": 2,
                              "body": "I clicked this thread because it sounded a lot like myself. I started my 401k and IRA at 40. I feel like i’m way behind and need to take bigger risks then i should be at this age to “catch up”. I spent 3 years doing what you are with dismal results.\n\nThen i read the comment above. So, i similarly worked at a non-profit for ~10 years. I was making below the poverty level. Renting rooms in communal housing, barely paying bills, no savings. When i hit 40 I “sold out” and went corporate. I had $4k to my name. Now i have almost 1/2 a Mill across all my accounts. \n\nI had to give up the life where i felt i was making the greatest difference for the most people in need to focus on myself for awhile. I wish i would have made that choice earlier and maybe i could be a homeowner instead of a renter today. Just wanted to add my experience since it sounded like we were in the same spot.",
                              "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la87956/",
                              "created": 1719333191,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "la3gemc",
      "score": 0,
      "body": "VIGAX is a low cost Vanguard mutual fund that invests in mega cap growth companies",
      "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3gemc/",
      "created": 1719257570,
      "depth": 0,
      "replies": [
        {
          "id": "la3iz82",
          "score": 1,
          "body": "I was in SCHG for a bit and did ok but I feel like the mega caps are really taking a hit lately.",
          "permalink": "/r/stocks/comments/1dnlngu/i_need_major_advice/la3iz82/",
          "created": 1719258427,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}