{
  "title": "EU charges Microsoft with 'abusive' bundling of Teams and Office ",
  "score": 286,
  "selftext": "The European Union on Tuesday accused Microsoft of breaching antitrust rules with the “abusive” bundling of its Teams and Office products.\n\n“The European Commission has informed Microsoft of its preliminary view that Microsoft has breached EU antitrust rules by tying its communication and collaboration product Teams to its popular productivity applications included in its suites for businesses Office 365 and Microsoft 365,” the European Commission — the EU’s executive arm — said in a Statement of Objections, which is sent to inform companies of concerns raised against them.\n\nIf the Commission decides that an infringement has taken place once companies have responded, it can ban the conduct and fine the charged company up to 10% of its global revenue.\n\nMicrosoft took the pre-emptive step to unbundle Teams from Microsoft 365 in an effort to quash antitrust concerns by the EU. However, the Commission said in its Tuesday statement that the changes were “insufficient to address its concerns and that more changes to Microsoft’s conduct are necessary to restore competition.”\n\nMicrosoft said it would work to find solutions to address the additional Commission’s concerns. “Having unbundled Teams and taken initial interoperability steps, we appreciate the additional clarity provided today,” Microsoft Vice Chair and President Brad Smith said in a statement Tuesday. The company’s shares were broadly unchanged in pre-market trading Tuesday.\n\nThe EU opened its investigation into Microsoft — which remains ongoing — in July 2023 following a complaint by Salesforce-owned Slack, which has a rival chat service to Teams.\n\nThe Commission’s concerns are centered around the fact that, starting in around 2019, Microsoft tied Teams with its software-as-a-service — or SaaS — applications, such as Office. It notes that Microsoft is “dominant worldwide” in the SaaS market for professional productivity applications.\n\n“In particular, the Commission is concerned that Microsoft may have granted Teams a distribution advantage by not giving customers the choice whether or not to acquire access to Teams when they subscribe to their SaaS productivity applications,” EU regulators wrote, noting that the tech giant’s advantage may have been exacerbated by limitations of interoperability — the ability of two or more systems to work together — between Microsoft’s offerings and Teams’ competitors.\n\n“The conduct may have prevented Teams’ rivals from competing, and in turn innovating, to the detriment of customers in the European Economic Area,” the Commission said.\n\nSource: https://www.cnbc.com/2024/06/25/microsofts-abusive-bundling-of-teams-office-products-breached-antitrust-rules-eu-says.html",
  "link_flair_text": null,
  "id": "1do4yti",
  "num_comments": 105,
  "created_utc": 1719319064,
  "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/",
  "comments": [
    {
      "id": "la7yvb6",
      "score": 84,
      "body": "They should charge them rather for the poor software design.",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7yvb6/",
      "created": 1719330401,
      "depth": 0,
      "replies": [
        {
          "id": "labucd1",
          "score": 6,
          "body": "You mean the bloatware too right",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/labucd1/",
          "created": 1719384625,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lac7gsw",
          "score": 4,
          "body": "Man this is a fucking stupid take. Which part of Office is designed better by someone else? Which part of Teams is designed better by someone else? The answer is fucking neither. Teams is an absolutely amazing piece of software, with collaborative Excel built it for instance, and Office 365 is the pinnacle of work suites. Project, Visio etc. Show me something better. You can't, because they do not exist.",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/lac7gsw/",
          "created": 1719394034,
          "depth": 1,
          "replies": [
            {
              "id": "lac8y77",
              "score": 16,
              "body": "Teams is absolutely dogshit if you aren't in the organization. It's great for internal meetings though.\n\nThere are MANY better project management tools that are cleaner, easier to adopt, and less bloated than Project. It sounds like you just like what you've grown up using.",
              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/lac8y77/",
              "created": 1719395099,
              "depth": 2,
              "replies": [
                {
                  "id": "lac944n",
                  "score": 0,
                  "body": "Teams is not meant for people not in an organisation, much like the office suite. Tell me one better tool for project management...",
                  "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/lac944n/",
                  "created": 1719395212,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lacf5xu",
                      "score": 7,
                      "body": "And yet, it gets enforced on everyone else because once big companies buy Teams, they use it for all external meetings as well",
                      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/lacf5xu/",
                      "created": 1719399056,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lach16h",
                          "score": -1,
                          "body": "If you only need to join someone on a teams call you can use the web version or just join it’s not that hard.",
                          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/lach16h/",
                          "created": 1719400109,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ldan60u",
                              "score": 1,
                              "body": "IKR. It’s literally just a button to join the call for an interview or whatever the fuck and that’s it, what a dumb take to refute the OPs argument on Team being pretty good.",
                              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/ldan60u/",
                              "created": 1721053865,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lacafoo",
              "score": 5,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/lacafoo/",
              "created": 1719396101,
              "depth": 2,
              "replies": [
                {
                  "id": "laclb6y",
                  "score": 3,
                  "body": "Or evernote. It's a fine software, but $15/month?! You have to be tripping balls to pay that.",
                  "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/laclb6y/",
                  "created": 1719402319,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lbavx6g",
              "score": 1,
              "body": "All these idiots in 'tech' with their shitty little open source apps because their org can't afford real software like Office... suffering from Stockholm Syndrome.",
              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/lbavx6g/",
              "created": 1719936333,
              "depth": 2,
              "replies": [
                {
                  "id": "lbbez2t",
                  "score": 2,
                  "body": "It’s exactly that. We work in a Microsoft software house and I couldn’t imagine having to use most of the horrible free apps other people use. I use Office suite for productivity and Visual Studio (not fucking VS Code) for developing. Granted it costs a few thousand dollars per year per employee but it’s worth it.",
                  "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/lbbez2t/",
                  "created": 1719942480,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "la93dmd",
      "score": 35,
      "body": "Do the same for one drive and windows please",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la93dmd/",
      "created": 1719343721,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la790u1",
      "score": 80,
      "body": "I don't know how Microsoft got away with integrating Teams into Office. It is playbook example of dominance abuse.",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la790u1/",
      "created": 1719321093,
      "depth": 0,
      "replies": [
        {
          "id": "la7flzz",
          "score": 48,
          "body": "Does Google get away with it w/ (Workspace) Google Chat & Meet because there is a free consumer version?",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7flzz/",
          "created": 1719323679,
          "depth": 1,
          "replies": [
            {
              "id": "la7mv2f",
              "score": 36,
              "body": "Because it's not areas they are big enough on, but if they did it with search it would be another case",
              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7mv2f/",
              "created": 1719326317,
              "depth": 2,
              "replies": [
                {
                  "id": "la7tr3d",
                  "score": -1,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7tr3d/",
                  "created": 1719328682,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la8056g",
                      "score": 16,
                      "body": "Well look at Zoom or Slack. They are considered to be better than Teams, but many people would not use them just because Microsoft is using their dominance to bundle teams for free therefore potentially putting out of business two great products in the market. Noone is really happy about using Teams but it is free  and it is available already with your other services, that you are already using. \n\nBut let's pretend Teams was a different company than Microsoft, created by Facebook for example. It would not have the success it has today.\n\nThey are using the same tactics with Internet Explorer during the 90s.",
                      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8056g/",
                      "created": 1719330825,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la8q3sk",
                          "score": 2,
                          "body": "Zoom and definitely Slack are not better than Teams",
                          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8q3sk/",
                          "created": 1719339363,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "la8rsge",
                              "score": 3,
                              "body": "Slack has way more features than Teams in terms of as a messaging application. Teams is basically the poor man version.  \nZoom for telephony as well as web conferencing is more reliable. When you send a zoom link to a client, its more seamless from the client's view, there is less lag. When I say lag, not talking about the bandwidth lag, but Teams take a lot of resources to run, more than Zoom.\n\nZoom also has higher reliability which they back, Teams do not offer this if you go with them. Zoom also is much user friendly for a non-IT person. In terms of web conferencing, Zoom has way more features than Teams.",
                              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8rsge/",
                              "created": 1719339914,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "la97pur",
                              "score": -4,
                              "body": "Teams is a piece of unintuitive garbage. Their screen sharing technology is like recording something with Bandicam in 2007. Having to put everything under a team is a mess if you want to collaborate with 10 teams in the same time. In the same time you can't have chats under teams, only channels which makes you write posts. It's bad, really bad. If teams was a separate product from the MS suite, it would never survive alone.",
                              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la97pur/",
                              "created": 1719345135,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "la7qaio",
              "score": 9,
              "body": "it is about what you are allowed to do when you are dominant in a space *after* you become dominant.",
              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7qaio/",
              "created": 1719327497,
              "depth": 2,
              "replies": []
            },
            {
              "id": "la8d7i1",
              "score": -1,
              "body": "Google what? Even as an android user I can't say I ever use those, at least not that I know off. All while Teams has dominated hard ever since MS integrated it into office despite Zoom having a majority market share earlier...\n\n\n\nThey simply let you do it when you're ~~famous~~ a big company. Or perhaps not the EU, the one institution that remember that *competition is good for customers, and healthy for companies*",
              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8d7i1/",
              "created": 1719335151,
              "depth": 2,
              "replies": [
                {
                  "id": "la9gp0d",
                  "score": 3,
                  "body": "People use Google Workspace believe it or not.",
                  "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la9gp0d/",
                  "created": 1719348038,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lae7hhs",
                  "score": 2,
                  "body": "Look me straight in the face and tell me that Zoom is a good product.",
                  "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/lae7hhs/",
                  "created": 1719423570,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "la7olik",
          "score": 7,
          "body": "How so?\n\nYet another ecosystem like Googles or Apples",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7olik/",
          "created": 1719326917,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la7l31f",
          "score": 40,
          "body": "A textbook example of giving customers what they want and a regulator getting in the way.",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7l31f/",
          "created": 1719325686,
          "depth": 1,
          "replies": [
            {
              "id": "la7x3nt",
              "score": 15,
              "body": "I get the sentiment but on the other hand no one uses Teams because they want to. They use it because the C-Suite is lazy. ",
              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7x3nt/",
              "created": 1719329808,
              "depth": 2,
              "replies": []
            },
            {
              "id": "la80gmk",
              "score": 5,
              "body": "No way that customers would want Teams out of Teams Zoom and Slack if they were all priced the same lol and had the same amount of friction in terms of turning them on live in the work environments. lol",
              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la80gmk/",
              "created": 1719330932,
              "depth": 2,
              "replies": [
                {
                  "id": "lbaw38c",
                  "score": 1,
                  "body": "lol, whatever. I do, zoom and slack are awful.",
                  "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/lbaw38c/",
                  "created": 1719936390,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "la84tai",
                  "score": -7,
                  "body": "Then let the customer decide.",
                  "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la84tai/",
                  "created": 1719332383,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la875jh",
                      "score": 23,
                      "body": "That is what the EU is trying to do, letting customers decide. In order to truly give customers the ability to decide, you have to give all options a fair chance. When a large company bundles a new product for free, even if it is inferior, the decision is made for the customer by the large company.\n\n  \nHave you used all 3 products? Would you choose Teams if all 3 were paid the same, and if you had to download all 3 and install?\n\nI use Teams in both the current company and the previous company. Not because it is the best, it is actually the worst product on the market, but it is for free. The issue with this is that this free product is given by the largest company in the world and has high dominance over the area where it was even able to give this for free. Other companies are not able to even give their products for free like Microsoft did.\n\nNow think what would happen 10 years from now. The other companies with better products would die. Once that happens, actually Microsoft can jack up the price, even though their product was the inferior one, to a price that is more expensive than what the competitor was charging.\n\nIt is very dangerous when a large company gives something for free, because they can give something for free, and killing potentially innovation in the space. They are diverting profits from other parts of the business (since they are large) to this particular new space and killing the innovation and choices in it.\n\n  \nRemember that Microsoft Teams does not only represent messaging, but also potentially will dominate voip telephone. It will start charging higher once all the competitors have died.",
                      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la875jh/",
                      "created": 1719333157,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ladg0uh",
                          "score": 1,
                          "body": ">When a large company bundles a new product for free, even if it is inferior, the decision is made for the customer by the large company.\n\nI'm not sure if I'm following that logic... if you're trying to decide which cookie you want to buy for lunch, and I bake and deliver you one for free (even though you don't like my cookies), have I made any decision for you? Nobody is forcing you to eat my cookie.",
                          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/ladg0uh/",
                          "created": 1719414440,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ladj86u",
                              "score": 2,
                              "body": "Ok. What maps app do you use on your phone? Did you do a decision analysis as a customer when you used the maps app? Did you do this with every single basic app that you use? This includes messaging app, even the phone app. Did you know that there are other app alternatives out there for these basic apps?\n\nSome people probably made the active decision in actually looking out for the best of these apps, but for most people they just take it, because it was already there, therefore the choice was made for them. Do you understand why right? \n\n  \nIf you want to use the cookie example. This is a really bad example, because you started off with no cookie, and you are in the process of thinking of buying a cookie and then you decide and there are not much description of an influential entity outside of you have great sway in this decision. \n\n\n\nHere is a better example. Let's say you work, and your work has a cafeteria, they sell cookies there. The nearest place you can buy a cookie is 10 minutes drive. Now you are on your break and you want to buy a cookie, so you have to make a decision. Now, you can drive 10 minutes for a better cookie, or buy the cookie from the cafeteria. The cookie in the cafeteria is basically a 5/10 in quality, the one 10 minutes away is 10/10. Out of 100 employees that wants a cookie or a SNACK even, will most likely buy the one at the cafeteria. The choice of what cookie the employees buy, is not really up to the employee, it is made by the Food Manager of the Cafeteria. At any whim one day he can put Oreos and the next day a different cookie that he likes, the choices are up to him, and less up to each individual employee. Now imagine that this Food Manager not only have power over this cafeteria but all cafeterias in the world. In fact all 90% of office buildings in the world comes equipped with this cafeteria chain, and so this food manager dictates what 1 cookie is sold in this cafeteria. Now, your wife, wants to get into the cookie business, she makes a cookie that is 10/10. Can she compete with this Food Manager? She can probably compete at the supermarket as she can do cold calls to all the super market and try to get her cookies carried there. But how about if all supermarkets basically only carry 1 cookie and this food manager also controls that? lol Now she has only access to small shops. Do you think her 10/10 cookie has a high chance of survival?",
                              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/ladj86u/",
                              "created": 1719415507,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ladme5b",
                                  "score": 1,
                                  "body": ">What maps app do you use on your phone? Did you do a decision analysis as a customer when you used the maps app?\n\nGoogle Maps. The default which ships with my phone is Apple. So yes I did do a decision analysis, it's not really rocket science.\n\n> This includes messaging app, even the phone app\n\nIndeed. I use WhatsApp for messages, and generally don't use my phone as a phone unless it's an emergency so I don't really care about the phone app.\n\n>The cookie in the cafeteria is basically a 5/10 in quality, the one 10 minutes away is 10/10 ... Now imagine that this Food Manager not only have power over this cafeteria but all cafeterias in the world. \n\nSo what's your proposed solution? To ban this manager from ever selling cookies in his cafeterias? How about the rest of the cafeteria's food? Why should he be allowed to sell soup if there's a better local option down the street? Sounds like you're anti-Big-Cafeteria in general.\n\n>Do you think her 10/10 cookie has a high chance of survival?\n\nIf consumers actually want her 10/10 cookie, then yes they'll go out of their way to get it. I have plenty of friends who do exactly this.\n\nIf they don't care and just want any cookie, then no they won't. And I don't see a problem with that, considering everyone is happy with what they're getting. (except her since she apparently feels entitled to customers for some reason)",
                                  "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/ladme5b/",
                                  "created": 1719416558,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ladnrtf",
                                      "score": 1,
                                      "body": ">So what's your proposed solution? To ban this manager from ever selling cookies in his cafeterias? How about the rest of the cafeteria's food? Why should he be allowed to sell soup if there's a better local option down the street?\n\nUmm noone is asking Teams to be banned or App Store to be banned, etc. EU usually asks for other cookies to be able to be sold in the cafeteria for example, to make it fair.\n\n>If consumers actually want her 10/10 cookie, then yes they'll go out of their way to get it. I have plenty of friends who do exactly this.\n\nWell many people do buy Zoom and Slack over Teams yes, but this is not good for the overall market as many companies die like this, because their cost structure requires them to be able to hit a certain number of subscribers. While Teams is operated as a cost leader, meaning they lose money on this product to sustain the dominance of other products. \n\nIf the cookie business is like this, then eventually your wife will go out of business as she will need to be able to access other cookie markets fairly in order to survive. If 90% of the world's cookie store is controlled by 1 party, does not that make it unfair for an aspiring cookie business owner?",
                                      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/ladnrtf/",
                                      "created": 1719417011,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "ladsn47",
                                          "score": 1,
                                          "body": ">EU usually asks for other cookies to be able to be sold in the cafeteria for example, to make it fair.\n\nSo if this cafeteria also has their own cookie lineup, they should be forced to sell their competitors cookies in addition to their own? Who decides which cookies are or aren't mandatory to be available for sale? If someone else announces they have a new mediocre cookie they're selling for $100, is the cafeteria manager now forced to put it on sale? How many other competitors is this manager expected to support to be to sell his own cookies? Is 1 (his friend's cookies) enough? 2? 3?\n\nIn the meantime while all of that is being figured out, is the cafeteria still able to sell their own cookies or do they have to stop all cookie sales? Or are we back to the solution of the cafeteria not being allowed to sell cookies at all, since that's bad for competition?",
                                          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/ladsn47/",
                                          "created": 1719418615,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "la8k2y3",
                      "score": 2,
                      "body": "> Then let the customer decide.  \n\nYou mean let monopolies form? GTFO with the astroturfing.",
                      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8k2y3/",
                      "created": 1719337397,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "la8sapn",
              "score": 4,
              "body": "It sounds like you don't understand the bundling practice. Microsoft undercuts competitors by bundling a new tool with all their other products. They bundle all their products and subsidize any losses on development of any one product. Their products don't have to be great either because the convenience of getting an okay tool for a great price that comes packaged with everything else  you need wins out over better products in the enterprise world. So they use their dominance to ensure that they capture market share on all productivity tools. \n\nSomeone comes out with new innovative productivity tool. Microsoft copies it and bundles it for free with everything else it sells, thus destroying competition.\n\nThis is textbook anti competitive. I'm sure you would be happy with a future where one monopoly gives you everything you want but it's not great for capitalism or innovation.",
              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8sapn/",
              "created": 1719340080,
              "depth": 2,
              "replies": [
                {
                  "id": "la9ri5y",
                  "score": 1,
                  "body": ">the convenience of getting an okay tool for a great price that comes packaged with everything else you need wins out\n\nI think this is what you don't understand. With Microsoft, the convenience *is the product*. If something goes wrong, there's one and only one place you go to file your support ticket. You just create a ticket, \"The Micro Soft is broken again!!!\" and Microsoft takes care of it from there. If Teams isn't showing up as an option to schedule with your meetings in Outlook, you just ask Microsoft. If Zoom isn't showing up as an option in Outlook, is that a problem with Outlook, or a problem with Zoom? You file a ticket with one and get bounced between the two as they debate who should solve it.\n\nYeah all of Microsoft's products suck. And a lot of companies--especially ones who are more technical--don't use Microsoft's products because they suck so bad. But if you don't know anything about technology, Microsoft is great because they will take care of everything for you.",
                  "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la9ri5y/",
                  "created": 1719351618,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la9rmpx",
                      "score": 0,
                      "body": "That’s exactly what I’m trying to say.",
                      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la9rmpx/",
                      "created": 1719351663,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "labnoqa",
                  "score": 0,
                  "body": "Selling a product at a loss to encourage greater sales isn't a unique practice to MSFT.  Its a common sales practice in all companies.  Restaurants, groceries, etc.\n\nEhhh I'm drunk so I dont really care about this shit topic.  WTF cares MSFT agreed and unbundled.",
                  "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/labnoqa/",
                  "created": 1719380394,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "labogtz",
                      "score": 1,
                      "body": "This is an antitrust case. So it’s not the same thing as a loss leader in a restaurant or grocery store. Microsoft owns the platform and is using their dominance and scale to eliminate competing products on their platform.",
                      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/labogtz/",
                      "created": 1719380861,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "la7qrkd",
              "score": -2,
              "body": "yes, because of law and rules and fairness of the market. giving the customers what they want is not always lawful.",
              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7qrkd/",
              "created": 1719327658,
              "depth": 2,
              "replies": [
                {
                  "id": "la7r5xw",
                  "score": 20,
                  "body": "This is a great example of over regulation and why there is so little innovation from Europe - well except for making everyone on the planet clock useless cookie pop ups.",
                  "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7r5xw/",
                  "created": 1719327798,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la7s1zw",
                      "score": 11,
                      "body": "Bundling is short term good for users, long term terrible. It means they can degrade services of individual components and you can't get out as you still need other components.",
                      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7s1zw/",
                      "created": 1719328105,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la7s7pm",
                          "score": 4,
                          "body": "There are many other choices and very low barriers to entry. Not offering this would make the suite a sub par product given how easily available this functionality is. This is just regulators getting in the way of innovation and customer choice.",
                          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7s7pm/",
                          "created": 1719328158,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "la7sxbw",
                              "score": 5,
                              "body": "It's like you entirely glossed over the long term piece.  Enterprise changes are not simple swaps, and Microsoft effectively forces teams on you for free 1 year, precisely to make it hard to migrate your enterprise \n\nhttps://learn.microsoft.com/en-us/deployoffice/teams-install",
                              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7sxbw/",
                              "created": 1719328400,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "la7uaf1",
                                  "score": 6,
                                  "body": "Nobody has to use it. If they didn’t include it office would be a sub par offering. There are literally free alternatives. It would be like not offering text messaging on a phone. It doesn’t hurt competition at all. It actually adds more innovation to the space because more companies are working on it. \n\nAnyway it’s European consumers and business who suffer. Just one of the reasons the US economy is the strongest, most innovative economy in human history while Europe spends its time deciding which US products to ban.",
                                  "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7uaf1/",
                                  "created": 1719328862,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "la8aqfb",
                                      "score": 3,
                                      "body": "It's not about forcing people, it's that they are behaviorally trapping people.\n\nLet's remove the idea of a corporation - do you think it's good to have friends that manipulate you?",
                                      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8aqfb/",
                                      "created": 1719334339,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "la9qnq2",
                      "score": 2,
                      "body": "Won’t someone think of the poor trillion dollar company? I’m sure they have nothing but the consumer’s best interests at heart, why should anyone bother regulating their attempts to stifle competition?",
                      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la9qnq2/",
                      "created": 1719351327,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "la7rrqk",
                      "score": -2,
                      "body": "Found the MSFT employee",
                      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7rrqk/",
                      "created": 1719328007,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la7s1nf",
                          "score": 26,
                          "body": "Found the regulator who goes home at 2pm.",
                          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7s1nf/",
                          "created": 1719328101,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "la7sktf",
                              "score": 3,
                              "body": "Nah a consumer that likes choices and companies competing on merit vs throwing their weight around.",
                              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7sktf/",
                              "created": 1719328283,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "la7sptd",
                                  "score": 9,
                                  "body": "Do you think there is not sufficient choice in the video conference market? Slack. Zoom. Teams. Google meet. I have all 4.",
                                  "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7sptd/",
                                  "created": 1719328330,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "la8ka4r",
                          "score": -3,
                          "body": "Yeah, I'm convinced that's an astroturf account. Dude's going real hard to bat for the same company that got hit for the same shit back in the Internet Explorer days.",
                          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8ka4r/",
                          "created": 1719337461,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "la8yhhw",
                      "score": -1,
                      "body": "MSFT as an example of innovation?\n\n\nThe biggest rent seeker on the planet is innovation, and not a natural monopoly.",
                      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8yhhw/",
                      "created": 1719342093,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "la8siq7",
          "score": 4,
          "body": "To be honest the integration is pretty on point between Office and Teams and Outlook and SharePoint. It's one combined office productivity suite and all of the products work together, the current bundle model just makes sense.",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8siq7/",
          "created": 1719340151,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lab265w",
          "score": 1,
          "body": "Can you ELI5 why it's a bad thing they Integrated it? Now you get more apps for the same subscription right?",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/lab265w/",
          "created": 1719369644,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la8fe2x",
          "score": 1,
          "body": "Well teams is free so it’s a plus for the consumer",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8fe2x/",
          "created": 1719335873,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la7eqeb",
      "score": 16,
      "body": "I mean fair but there’s a stat of businesses only using I think it’s  20% of the Microsoft suite of apps. Some companies hire a full time employee to manage Microsoft licenses because there’s so much excess. \n\nComplaining about Teams and Office being linked is just the tip of the iceberg",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7eqeb/",
      "created": 1719323349,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la89le9",
      "score": 8,
      "body": "So what else can MSFT do beyond not bundling Teams with 365?",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la89le9/",
      "created": 1719333964,
      "depth": 0,
      "replies": [
        {
          "id": "la8lct1",
          "score": -9,
          "body": "Either sell Teams to a different company or pay kickbacks to European regulators. Gotta admire their boldness, however. In the US you have to pretend it's charitable donations, in the EU you can just call it a bribe.",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8lct1/",
          "created": 1719337812,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la8t2qu",
          "score": -9,
          "body": "Yes just stop bundling it. Or better yet stop creating a copy cat product to muscle out any competing innovators in productivity tools space. There are plenty of competing options. Their goal is to dominate any and all productivity tool and they use bundling to undercut competitors.",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8t2qu/",
          "created": 1719340332,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laekdmc",
      "score": 3,
      "body": "Same mistake when IE was bundled with Windows 20 years ago",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/laekdmc/",
      "created": 1719427787,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la77mcn",
      "score": 16,
      "body": "First Apple and now Microsoft.",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la77mcn/",
      "created": 1719320501,
      "depth": 0,
      "replies": [
        {
          "id": "la8fi33",
          "score": 3,
          "body": "Wish they would really focus on the worst eggs, meta",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8fi33/",
          "created": 1719335910,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la8dmzy",
          "score": 3,
          "body": "Yeah, almost as if the big companies have gotten so used to skirting laws and regulations they do it by default.\n\n\n\nThe only reason they don't get away with it in the EU is that our politicians aren't as easily bribed as American ones. Rolling over, pissing themselves and locking the boots of any CEO of a Fortune 500 company, begging on their bare knees for a handout...oh sorry, \"campaign donation\"",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8dmzy/",
          "created": 1719335295,
          "depth": 1,
          "replies": [
            {
              "id": "lac4g6a",
              "score": 7,
              "body": "lol EU is not the corruption free utopia you’re thinking of.\n\nVW diesel-gate, Qatar bribing EU officials, UEFA/FIFA corruption etc.",
              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/lac4g6a/",
              "created": 1719391833,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "laab8v8",
      "score": 24,
      "body": "The EU is unhinged. They have no innovation so what do they do? They create dumb ass regulations so they can tax and penalize US innovation, thereby stealing money from the US. Total scam.",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/laab8v8/",
      "created": 1719358890,
      "depth": 0,
      "replies": [
        {
          "id": "lad4jrh",
          "score": 3,
          "body": "Yeah. EU, the world' premiere exporter of bullshit rules and regulations.\n\nIt's our ***only*** export.\n\nBut if it's any consolation, we strangle, tax and penalize our own industries even worse then the US ones, making us poorer with flawless efficiency.\n\nGod I am pissed how mismanaged this continent is.",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/lad4jrh/",
          "created": 1719410419,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ladtfu2",
          "score": 1,
          "body": "Exactly. And they’re just hurting themselves since these tech companies will delay releases in their region. Slower to new tech and assuring lack of innovation for their future",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/ladtfu2/",
          "created": 1719418879,
          "depth": 1,
          "replies": []
        },
        {
          "id": "laaukmi",
          "score": -10,
          "body": "So it's okay for corporations to scam customers?",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/laaukmi/",
          "created": 1719366601,
          "depth": 1,
          "replies": [
            {
              "id": "labngo2",
              "score": 6,
              "body": "how is it a scam????",
              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/labngo2/",
              "created": 1719380260,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "la9kp6k",
      "score": 5,
      "body": "So EU want people to pay extra for it?",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la9kp6k/",
      "created": 1719349316,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la7b01m",
      "score": 15,
      "body": "This destroyed Zoom. \nZoom can't compete with package",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7b01m/",
      "created": 1719321894,
      "depth": 0,
      "replies": [
        {
          "id": "la7rpp1",
          "score": -2,
          "body": "Zoom isn't competing with teams 'directly', Slack is the MS team's competitor",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7rpp1/",
          "created": 1719327987,
          "depth": 1,
          "replies": [
            {
              "id": "la8ea54",
              "score": 16,
              "body": "No one knows what Slack is on my world wide company of 16000 people. But the. Again, we don’t have any developers.\n\nIt’s not as popular as you think and not a competitor to Teams at all",
              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8ea54/",
              "created": 1719335509,
              "depth": 2,
              "replies": [
                {
                  "id": "la8pav1",
                  "score": 6,
                  "body": "even before the pandemic? if I'm right, since O365 bundling lot of companies moved to teams from slack. Zoom isn't doing half a thing MS teams does. Teams just more than video conferencing. correct me if im wrong",
                  "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8pav1/",
                  "created": 1719339100,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "la8t3x4",
                      "score": 2,
                      "body": "Even before I had never heard of slack. Only on Reddit have I learned what it is. \n\nBefore Teams we used Lync, and before Lync it was Skype for business.",
                      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8t3x4/",
                      "created": 1719340342,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "la93lfy",
                          "score": 2,
                          "body": "oh so you guys running on full Microsoft stack, make sense. i wouldn't even go for something else when MS offers it for free",
                          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la93lfy/",
                          "created": 1719343791,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "la8tqe5",
                  "score": 4,
                  "body": "Slack has \\~40 million daily active users.",
                  "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8tqe5/",
                  "created": 1719340545,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "la890bz",
              "score": 3,
              "body": "I think it's always been mainly just developers who use Slack.\n\nMy team of mainly developers used to use Slack, but no one else in the company did, so we switched to Teams years ago.",
              "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la890bz/",
              "created": 1719333772,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "la87dy0",
      "score": 11,
      "body": "They should be charged for customer abuse by forcing OneDrive Malware on your PC.",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la87dy0/",
      "created": 1719333237,
      "depth": 0,
      "replies": [
        {
          "id": "ladgjga",
          "score": 3,
          "body": "I think you don't understand the difference between \"malware\" and \"bloatware\". \n\nOneDrive is at worst bloatware if you have no interest in using it, not malware.",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/ladgjga/",
          "created": 1719414613,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la8jw1y",
          "score": -3,
          "body": "Start at Windows - the real malware.",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8jw1y/",
          "created": 1719337334,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lab7orz",
      "score": 1,
      "body": "This seems a bit frivolous. A company can't bundle its own products together? That's abusive? \n\nCan movie theaters let me bring my outside drink in too?",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/lab7orz/",
      "created": 1719372035,
      "depth": 0,
      "replies": [
        {
          "id": "lacm3vd",
          "score": 3,
          "body": "They are taking advantage of their monopoly to push a product to users at the expense of a competitor. The bundling a product isn't a problem, so much as their abuse of their market dominance.",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/lacm3vd/",
          "created": 1719402707,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laai9ur",
      "score": 1,
      "body": "Recall next",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/laai9ur/",
      "created": 1719361604,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laaq0dt",
      "score": 1,
      "body": "You can buy every Office app and Teams separately.",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/laaq0dt/",
      "created": 1719364727,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lab6nno",
      "score": 1,
      "body": "🤦🏾‍♂️",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/lab6nno/",
      "created": 1719371576,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laecxvu",
      "score": 1,
      "body": "Microsoft doesn't get enough hate for arbitrarily deciding that a version of Office will not be supported. Office 2016 Pro on Windows 11? Nope, no more Office for you!\n\nThank goodness that it's fairly easy to pirate.",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/laecxvu/",
      "created": 1719425336,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lasy55w",
      "score": 1,
      "body": "I don't know no one the talks about Android and bundling all the Google stuff. Same with Apple. Compared to them Teams an office is nothing",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/lasy55w/",
      "created": 1719648800,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la97j8i",
      "score": 1,
      "body": "EU is a double edged sword, on one hand I applaud their initiative to defend our privacy rights from tech giant overlords. On the other hand this grasping at strings at \"supposed\" anti trust or monopoly laws is the reason why EU got left in the dust in the Tech innovation race 20 years go by USA .",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la97j8i/",
      "created": 1719345075,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la7bf47",
      "score": -2,
      "body": "I've still never really forgiven Microsoft for the redesign around 2013 that ruined everything about Office.",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7bf47/",
      "created": 1719322061,
      "depth": 0,
      "replies": [
        {
          "id": "la7ldmd",
          "score": 24,
          "body": "I don’t think they care.",
          "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la7ldmd/",
          "created": 1719325792,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lae0nf3",
      "score": 1,
      "body": "Charging up to 10% of GLOBAL REVENUE is so wildly absurd. Why stop there, why not just take the company?",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/lae0nf3/",
      "created": 1719421320,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la9ttsl",
      "score": 0,
      "body": "Please for the love of god I hope they also unbundle all the other office products. PowerPoint is a bane and blight on any company\n\nThe irony of these being called productivity tools",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la9ttsl/",
      "created": 1719352438,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la8b6si",
      "score": -1,
      "body": "Thought it was only a matter of time until Microsoft got in trouble with this.\n\nHave to hand it to Microsoft to have the gall.",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8b6si/",
      "created": 1719334488,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la8xjxn",
      "score": -2,
      "body": "Nothing about Azure being integrated right into windows, preventing competition in cloud computing?\n\n\nIts monopolistic in every industry and service.",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la8xjxn/",
      "created": 1719341795,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la9kp0v",
      "score": -3,
      "body": "Seriously fuck Teams. People who schedule meetings with Teams instead of Zoom are assholes.",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/la9kp0v/",
      "created": 1719349314,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ladkm6o",
      "score": 0,
      "body": "\"teams\"?  \n\nI have not found any company actually using teams.  do they?",
      "permalink": "/r/stocks/comments/1do4yti/eu_charges_microsoft_with_abusive_bundling_of/ladkm6o/",
      "created": 1719415971,
      "depth": 0,
      "replies": []
    }
  ]
}