{
  "title": "INTC and AMD",
  "score": 70,
  "selftext": "**Thesis: AMD ($AMD) and Intel ($INTC) are Undervalued Stocks**\n\nIn the dynamic and highly competitive semiconductor industry, AMD ($AMD) and Intel ($INTC) have demonstrated remarkable resilience, innovation, and market presence. Despite their solid fundamentals, both companies appear undervalued when considering their current market prices relative to their intrinsic value, future growth potential, and industry positioning. This thesis will explore the reasons behind this undervaluation, focusing on financial performance, strategic initiatives, market trends, and competitive advantages.\n\n### Financial Performance and Valuation Metrics\n\n1. **Price-to-Earnings (P/E) Ratios:**\n   - Both AMD and Intel have P/E ratios that are below the industry average, suggesting that the market has not fully recognized their earnings potential. AMD's forward P/E ratio is around 25, while Intel's is approximately 12, compared to the semiconductor industry average of 30-35.\n\n2. **Revenue and Earnings Growth:**\n   - AMD has exhibited robust revenue growth, driven by its strong product portfolio and increasing market share in both consumer and data center segments. The company's revenue grew by over 20% year-over-year in the last few quarters. Intel, despite facing competitive pressures, has maintained stable revenue streams, with significant contributions from its data center and Internet of Things (IoT) segments.\n\n3. **Cash Flow and Profitability:**\n   - Both companies generate substantial cash flows, supporting their ability to invest in R&D and return value to shareholders through dividends and buybacks. AMD's free cash flow margin stands at around 10%, while Intel's is approximately 20%.\n\n### Strategic Initiatives and Technological Advancements\n\n1. **Product Innovation:**\n   - AMD's Ryzen and EPYC processors have gained significant traction, challenging Intel's dominance in the CPU market. The company's advancements in 7nm and 5nm process technologies have positioned it as a formidable competitor in both consumer and enterprise markets.\n   - Intel has made strides in expanding its product lineup, with significant investments in AI, machine learning, and autonomous driving technologies. The introduction of its Alder Lake processors and advancements in 10nm and future 7nm nodes signal a robust product roadmap.\n\n2. **Strategic Acquisitions:**\n   - AMD's acquisition of Xilinx is expected to enhance its capabilities in adaptive computing and bolster its presence in key growth markets such as 5G, automotive, and aerospace.\n   - Intel's acquisition of Mobileye and investments in autonomous vehicle technology underscore its commitment to diversifying its revenue streams and capitalizing on emerging tech trends.\n\n### Market Trends and Competitive Landscape\n\n1. **Demand for Semiconductors:**\n   - The global semiconductor market is projected to grow significantly, driven by increasing demand for high-performance computing, artificial intelligence, and IoT applications. Both AMD and Intel are well-positioned to capitalize on these trends.\n\n2. **Competitive Positioning:**\n   - AMD's competitive pricing and performance advantages have enabled it to gain market share from Intel, particularly in the desktop and server CPU markets. Intel's extensive ecosystem and strong brand equity continue to make it a preferred choice for many enterprise customers.\n\n### Underappreciated Catalysts\n\n1. **Supply Chain Resilience:**\n   - Both companies have demonstrated resilience in navigating the global semiconductor supply chain challenges. AMD's partnerships with TSMC and Intel's plans to build new fabs in the US and Europe are strategic moves to mitigate supply risks and ensure capacity for future growth.\n\n2. **Expansion into New Markets:**\n   - AMD's foray into gaming consoles with partnerships with Sony and Microsoft, as well as Intel's advancements in the data center, networking, and edge computing, present substantial growth opportunities that are not fully reflected in their current valuations.\n\n### Conclusion\n\nIn conclusion, AMD and Intel are undervalued stocks, with market prices that do not fully reflect their intrinsic value, robust financial performance, strategic initiatives, and potential for growth in the rapidly evolving semiconductor industry. Investors should consider the compelling investment case for both companies, driven by their innovation, competitive positioning, and resilience in the face of industry challenges. As the global demand for semiconductors continues to rise, AMD and Intel are well-equipped to deliver sustained value, making them attractive opportunities for long-term investment.",
  "link_flair_text": "Discussion",
  "id": "1dobwi4",
  "num_comments": 39,
  "created_utc": 1719337256,
  "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/",
  "comments": [
    {
      "id": "la8jnkk",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 14 | **Previous Best DD** | \n**Account Age** | 8 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la8jnkk/",
      "created": 1719337259,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la8kfqi",
      "score": 32,
      "body": "[removed]",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la8kfqi/",
      "created": 1719337511,
      "depth": 0,
      "replies": [
        {
          "id": "la8z3uc",
          "score": 8,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la8z3uc/",
          "created": 1719342299,
          "depth": 1,
          "replies": []
        },
        {
          "id": "la8ml1l",
          "score": 3,
          "body": "How would you play that? What are your outlooks for INTL? And is there a sector rotation imminent out of tech companies, especially the cyclical semiconductor industry\n\nI’m Bearish short term for excessive CapEx but bullish long term for future profits, growth and easing of heavy CapEx after the AI picture and landscape becomes clearer. But I’m usually wrong about these things. Please enlighten me. Thank you",
          "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la8ml1l/",
          "created": 1719338210,
          "depth": 1,
          "replies": [
            {
              "id": "la8niug",
              "score": 3,
              "body": "[removed]",
              "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la8niug/",
              "created": 1719338512,
              "depth": 2,
              "replies": [
                {
                  "id": "la8od1e",
                  "score": 1,
                  "body": "Thank you",
                  "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la8od1e/",
                  "created": 1719338794,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "la8n15e",
          "score": 1,
          "body": "Fair sentiment. However, they are recruiting Nvidians. This is similar to the rotating personnel of the past between MSFT, AAPL, GOOGL, and AMZN. Very similar architecture with small variances due to time of personnel arrival.",
          "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la8n15e/",
          "created": 1719338353,
          "depth": 1,
          "replies": []
        },
        {
          "id": "laa5uqi",
          "score": 1,
          "body": "And TSMC isn’t? Their AZ fab is a dumpster fire.",
          "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/laa5uqi/",
          "created": 1719356857,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc5e58x",
          "score": 0,
          "body": "In other words they’re using government funds and multiple venture capital money deals to add billions in depreciable assets directly to their balance sheet.",
          "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/lc5e58x/",
          "created": 1720415120,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la8n7fu",
      "score": 6,
      "body": "I agree with much of this. You didn't even mention how Intel is the first foundry to actually have ASML's new High NA EUV Lithography machines!  \n\n\nThey skipped on regular EUV, and that hurt them, now they are balls deep in the latest in lithography! It's not even finished being developed, so when ASML makes a change, so does Intel to their machine.  \n\n\nBased on past performance, ASML will work out the kinks, and Intel will be the first to reap the benefits on their future nodes. Intel is investing hard into R&D again, like they used to (before they let a non-engineer/business guy be the CEO).  \n\n\nWhen they will reap the benefits is not clear, but it's a good long term buy anyway (especially considering the dividend)!",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la8n7fu/",
      "created": 1719338408,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la8oypv",
      "score": 15,
      "body": "bruv there is nothing you can do to convince me to buy INTC",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la8oypv/",
      "created": 1719338990,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laamkm9",
      "score": 9,
      "body": "INTC is at a multi year bottom They are absolutely undervalued and hated cause a lot of people lost money cause of the decline and treat this as still on the decline\n\nCEO didn’t play the quarter game\n\nHe has done everything needed to plant the correct seeds to make it a win for a decade.\n\nI do believe this is the absolutely floor and there is little risk of further downward motion\n\nBuy low and sell high\n\nWhat people miss this that once perspective changes others already went in and so they will pay for that from current price\n\nAll Intel needs is some super heavies like a buffet or Cathie wood to buy a large position and everyone else will follow\n\nI prefer to be here first\n\nI see Intel hitting 40 by end of year and 25% average return every year for next 5 years after that\n\nOnly question for the haters\n\nWould you rather buy at the bottom or wait for everyone else to buy the stock up before you get on the train\n\nI Have 5,000 shares and 1,000 shares of crm\n\nOnce crm hits my price target to sell (280)  I’m going to buy another 5,000 shares of Intel with that and enjoy watching the climb\n\nhttps://preview.redd.it/l5xqqag5et8d1.jpeg?width=1284&format=pjpg&auto=webp&s=ce82cb264e1fbe3c853471aa98b563616678e463",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/laamkm9/",
      "created": 1719363312,
      "depth": 0,
      "replies": [
        {
          "id": "le297y0",
          "score": 1,
          "body": "You still sticking to you thesis - my cost basis is at 31$, and a similar position to yours",
          "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/le297y0/",
          "created": 1721470176,
          "depth": 1,
          "replies": [
            {
              "id": "le2kuf2",
              "score": 1,
              "body": "I sold when it hit resistance at 35 and doubled my position on CRM \n\nI am hoping CRM pops so I can get back into Intel \n\nAt the moment i’m 100% CRM",
              "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/le2kuf2/",
              "created": 1721477288,
              "depth": 2,
              "replies": [
                {
                  "id": "le389a4",
                  "score": 1,
                  "body": "Gotcha - bit of an overreaction with Sbux Intc CRM  and NKE tbh\n\nYou reckon there is any upside with NKE? \nThinking of buying some calls",
                  "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/le389a4/",
                  "created": 1721487416,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "le3tdq8",
                      "score": 1,
                      "body": "I’m looking to get back into Intel at 30-31 after CRM gets back to 280\n\nNke mgmt is absolutely terrible and the problem isn’t even recognized yet \n\nGood luck with whatever u do",
                      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/le3tdq8/",
                      "created": 1721495128,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "la9g7zo",
      "score": 3,
      "body": "Revenue is just one side of a balance sheet right  Go read the other side to understand why Intel in particular is a dog with flees.",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la9g7zo/",
      "created": 1719347886,
      "depth": 0,
      "replies": []
    },
    {
      "id": "labk3nd",
      "score": 3,
      "body": "What’s with all the pro Intel posts?  Didn’t AMD already come out of nowhere and pass them in relevancy?  I swear I see multiple posts a week about them and they’re doing nothing to care to invest in.",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/labk3nd/",
      "created": 1719378307,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la8mnjm",
      "score": 4,
      "body": "Nice thesis, but I’m buying tsm ![img](emote|t5_2th52|4275)",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la8mnjm/",
      "created": 1719338233,
      "depth": 0,
      "replies": [
        {
          "id": "la8n9k2",
          "score": 2,
          "body": "Formed shovel vs. forming shovel. Less immediate risk, but less upside.",
          "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la8n9k2/",
          "created": 1719338427,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la90ntk",
      "score": 3,
      "body": "INTC can suck my 0.1 inch cock",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la90ntk/",
      "created": 1719342814,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la90opx",
      "score": 6,
      "body": "AMDs forward PE is not 25x. It's 47x.",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la90opx/",
      "created": 1719342823,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la973bj",
      "score": 5,
      "body": "Why the fuck there is so many DDs on Intel, are you regards on a payroll??![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271) A company that literally handed over the leadership by mis-executing time and time again.......how can you trust such a bottomless moneypit with your own money!!",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la973bj/",
      "created": 1719344934,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laai0ur",
      "score": 2,
      "body": "Intel has demonstrated remarkable innovation? Recently or decades ago?",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/laai0ur/",
      "created": 1719361505,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la8pr6z",
      "score": 3,
      "body": "This DD is outdated by like 6 years, \n\nThe only points that you got right are the FCF and PE numbers\n\nAll your other points about lithography, supply chain resilience and new market expansions is just abominable",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la8pr6z/",
      "created": 1719339249,
      "depth": 0,
      "replies": [
        {
          "id": "la8vtf1",
          "score": 6,
          "body": "Appreciate the support. Sorry it didn’t meet your standards. Feel free to point me towards your favorite DDs and I’ll see what I can do to pull better data.",
          "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la8vtf1/",
          "created": 1719341233,
          "depth": 1,
          "replies": [
            {
              "id": "laczcfs",
              "score": 1,
              "body": "Really OP? No need to be so passive aggressive with your response. They gave you such useful and insightful feedback like broadly saying your points are \"outdated\" and \"abominable\". What else could you possibly want them to say? Actual descriptive criticisms? Come on, get real.\n\n/s of fucking course",
              "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/laczcfs/",
              "created": 1719408455,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "laaw373",
      "score": 1,
      "body": "Fyi pretty sure Intel has deals with Brookfield and another PE where the money from the foundry is split 51/49 meaning the PE firms get half the profit from chips made in the the US fabs",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/laaw373/",
      "created": 1719367203,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laco3su",
      "score": 1,
      "body": "They both don't deserve a premium over PE. Esp. AMD should be valued at 25 $. I'm 1000 short at 145 and feel comfortable.",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/laco3su/",
      "created": 1719403671,
      "depth": 0,
      "replies": [
        {
          "id": "lbwtrtw",
          "score": 3,
          "body": "ouch",
          "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/lbwtrtw/",
          "created": 1720282917,
          "depth": 1,
          "replies": []
        },
        {
          "id": "le29x1m",
          "score": 1,
          "body": "Laisan al gaib",
          "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/le29x1m/",
          "created": 1721470665,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb7vl81",
      "score": 1,
      "body": "I’m buying leaps tomorrow for Jan 2025. I do think it’s the bottom as well. Hopefully 35 plus after earnings",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/lb7vl81/",
      "created": 1719883081,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la8z032",
      "score": 1,
      "body": "--->  \"demonstrated remarkable resilience, innovation, and market presence\"\n\nDid you actually say that and the mention Intel????\n\nI guess this is true if you define innovation as blowing a monopoly position in PCs and completely missing the AI build out.  \n\nIt takes some innovation to accomplish that!!",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la8z032/",
      "created": 1719342265,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la8x5ld",
      "score": 0,
      "body": " Im a sucker for AMD’s but its P/E is around 233??",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la8x5ld/",
      "created": 1719341666,
      "depth": 0,
      "replies": []
    },
    {
      "id": "la9c6tj",
      "score": 0,
      "body": "Intel might be a good investment if you’re willing to wait over 10 years. And then if so, why invest now and not in like 5.",
      "permalink": "/r/wallstreetbets/comments/1dobwi4/intc_and_amd/la9c6tj/",
      "created": 1719346585,
      "depth": 0,
      "replies": []
    }
  ]
}