{
  "title": "Waymo opens robotaxi service to all San Francisco users ",
  "score": 95,
  "selftext": "Waymo robotaxis are now open to all users in San Francisco, expanding the self-driving ride-hailing service, which has been available in the city to a limited number of riders.\n\nIn a blog post on Tuesday, Waymo said nearly 300,000 people have signed up for the service, called Waymo One, since the Alphabet-owned company opened its waitlist. The company began commercial passenger operations in August after a period of testing.\n\n“We’re committed to growing our service gradually and responsibly,” Waymo said in the post. “We work closely with city and state officials, first responders, and advocates for road safety to ensure our service helps local communities gain access to reliable, safe, environmentally friendly transportation and has a positive impact on mobility.”\n\nIt is the second citywide rollout for Waymo, following Phoenix in 2020. Waymo One also operates in limited capacity in Los Angeles and Austin, Texas. As of February, the company had approximately 700 vehicles in the Waymo One fleet, including about 300 cars as part of its San Francisco service.\n\nDriverless vehicles have faced some public backlash in recent months following collisions and other accidents. In October, General Motors’ Cruise autonomous vehicle unit paused all driverless operations after collisions led to investigations and a suspension of its licenses in California.\n\nHowever, Waymo has experienced less controversy. The company has a large public affairs operation and communicates closely with the National Highway Traffic Safety Administration and local first responders.\n\nIn total, the 15-year-old project, which became Waymo in 2016, has driven about 20 million fully autonomous miles and nearly two million paid ride-hail trips, Waymo said. The company said it has logged 3.8 million rider-only miles in San Francisco as of the end of March.\n\nSource: https://www.cnbc.com/2024/06/25/waymo-opens-robotaxi-service-to-all-san-francisco-users.html",
  "link_flair_text": null,
  "id": "1doe4tw",
  "num_comments": 45,
  "created_utc": 1719342788,
  "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/",
  "comments": [
    {
      "id": "laalk3c",
      "score": 39,
      "body": "Waymo is a 150+ billion dollar market for GOOGL. Will take time to scale it but could be huge long term",
      "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/laalk3c/",
      "created": 1719362903,
      "depth": 0,
      "replies": [
        {
          "id": "laanyu6",
          "score": 17,
          "body": "Yeah, hopefully they are not regulated so much by the government and that the cars don’t draw bad publicity from some freak accident that human drivers  do 1000 times more frequently.",
          "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/laanyu6/",
          "created": 1719363882,
          "depth": 1,
          "replies": [
            {
              "id": "laelzzv",
              "score": 4,
              "body": "I mean, look at how the world reacts to aviation accidents. One minor aviation incident where no one gets killed or seriously injured, and its a huge news story. Thousands of people lose their lives every month in car accidents, no one really thinks about it.",
              "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/laelzzv/",
              "created": 1719428328,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lsbqqyh",
          "score": 1,
          "body": "How did you come to the 150+ billion? I find it’s hard to guesstimate Waymo’s valuation, and how Waymo justifies the rumored 30billion valuation.",
          "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/lsbqqyh/",
          "created": 1729146433,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "la9b1ul",
      "score": 29,
      "body": "Exciting.    Waymo is way out in front in terms of providing a robot taxi service.\n\nI hope Alphabet IPOs Waymo pretty early.   Maybe in the next couple of years.   It and SpaceX are the two I am most looking forward.   Alphabet owns Waymo and does own a decent chunk of SpaceX.",
      "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/la9b1ul/",
      "created": 1719346216,
      "depth": 0,
      "replies": [
        {
          "id": "la9tq2h",
          "score": 16,
          "body": "wym IPO? isnt waymo owned by alphabet",
          "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/la9tq2h/",
          "created": 1719352402,
          "depth": 1,
          "replies": [
            {
              "id": "laa2b5q",
              "score": 4,
              "body": "It's been separated financially I believe",
              "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/laa2b5q/",
              "created": 1719355533,
              "depth": 2,
              "replies": [
                {
                  "id": "laanqt8",
                  "score": 4,
                  "body": "Where did you hear this? I have seen nothing of the sort, is this even true?",
                  "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/laanqt8/",
                  "created": 1719363790,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "laa3hpf",
                  "score": 2,
                  "body": "why -\\_\\_\\_\\_\\_\\_\\_- do we get shares if we hold alphabet shareholders?",
                  "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/laa3hpf/",
                  "created": 1719355975,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lab6s8q",
                      "score": 4,
                      "body": "Yes. An IPO would just be Google selling a piece of it to outsiders for $.",
                      "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/lab6s8q/",
                      "created": 1719371633,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lahexx7",
              "score": 2,
              "body": "Google will want to spin it out if it becomes very successful. The 2 businesses aren't very related and won't integrate well, which will just add bloat and pull attention of execs away from core businesses like search and cloud.",
              "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/lahexx7/",
              "created": 1719467986,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lad7e8e",
              "score": 0,
              "body": "They've also raised money from VC firms like a16z, so I believe the plan is to IPO.",
              "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/lad7e8e/",
              "created": 1719411445,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "laa3mwy",
          "score": 8,
          "body": "No thanks keep waymo internally no need to separate it.",
          "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/laa3mwy/",
          "created": 1719356028,
          "depth": 1,
          "replies": [
            {
              "id": "lacdbo3",
              "score": 8,
              "body": "It would generate a lot more value for Alphabet shareholders if they IPO Waymo.\n\nCurious why you do not want them to IPO?",
              "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/lacdbo3/",
              "created": 1719397961,
              "depth": 2,
              "replies": [
                {
                  "id": "lacgd8a",
                  "score": 5,
                  "body": "Bc i would prefer waymo to grow without needing to please shareholders and i would like alphabet to have a strong source of income other than ads and cloud. \n\nAlphabet is the AI business why would they give a segment of AI they lead up for what?",
                  "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/lacgd8a/",
                  "created": 1719399739,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lacgrj6",
                      "score": 2,
                      "body": "It would increase the overall value of Alphabet a lot more if it was spun out.\n\nWhy would that not be the goal?",
                      "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/lacgrj6/",
                      "created": 1719399963,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lacj2gc",
                          "score": 2,
                          "body": "Quite literally none of the companies alphabet have spun off increased its value any number that mattered. You aren’t gonna see alphabet gain anything by spinning waymo off at its current size. \n\nBetter to keep the company internally as it could be an uber one day. An uber like company contributing to alphabets bottom line is more better for alphabet. I as an alphabet shareholder would prefer that to a little quick return as a startup in the market.",
                          "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/lacj2gc/",
                          "created": 1719401197,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ladaq9t",
                              "score": -1,
                              "body": "Waymo is a valuable asset for Alphabet.  The way to maximize the value is by spinning it out and taking it public.\n\nWhich is exactly what they will do and every Alphabet shareholder should be very happy when they do.",
                              "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/ladaq9t/",
                              "created": 1719412620,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lagzjvb",
              "score": 2,
              "body": "Usually I would agree but we are talking transportation. This is very risky venture. People will get injured and die in time. Lawsuits will follow. The fallout can cascade across the entire brand. In this case, I probably would spin it off to avoid liability but not until its a lot bigger. Its still too early.",
              "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/lagzjvb/",
              "created": 1719459662,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "labapls",
          "score": 1,
          "body": "only 6% of SpaceX as far as I'm aware",
          "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/labapls/",
          "created": 1719373428,
          "depth": 1,
          "replies": []
        },
        {
          "id": "laannrx",
          "score": 0,
          "body": "Who owns a decent chunck of SpaceX, Google? I am confused. I would love to invest in SpaceX, but how do I?",
          "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/laannrx/",
          "created": 1719363754,
          "depth": 1,
          "replies": [
            {
              "id": "laaoavf",
              "score": 2,
              "body": "There is a stock fund called DXYZ that seems to own SpaceX stock, tho you wouldn’t be an owner but should be ok if you want exposure",
              "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/laaoavf/",
              "created": 1719364021,
              "depth": 2,
              "replies": [
                {
                  "id": "laaq138",
                  "score": 0,
                  "body": "How much do you think the fund would increase if SpaceX ever has an IPO? Also, would investing in SpaceX even be a worthwhile investment? How much profit do they bring in?",
                  "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/laaq138/",
                  "created": 1719364735,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "laat9s5",
                      "score": 4,
                      "body": "SpaceX is probably the most sought after private company in the world right now in terms of the general public wanting to invest.\n\nThey're a private company so financials is only available to large fund holders and banks.\n\nStarlink is expected to bring in $6.5 billion this year and is rapidly expanding. It should reach $10 billion in revenue in 2025.\n\nThe real value in SpaceX is how they are able to launch anything into space for much lower than any of their competitors. No one comes close which is why the U.S. government hands them billions in contracts. It's also how they are able to launch Starlink satelites into space. By 2030, Starlink will probably do $30 billion in revenue. That's just Starlink, not SpaceX.",
                      "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/laat9s5/",
                      "created": 1719366069,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "laav3b7",
                          "score": -2,
                          "body": "Sweet, how do I invest in them?",
                          "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/laav3b7/",
                          "created": 1719366807,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "labmxyr",
                              "score": 4,
                              "body": "Just read the thread you're replying to. It answers your question in great detail.",
                              "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/labmxyr/",
                              "created": 1719379953,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "la9xeb3",
          "score": -6,
          "body": "Waymo is way out in front **in the United States** (you can probably guess which country is really ahead in this industry)",
          "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/la9xeb3/",
          "created": 1719353728,
          "depth": 1,
          "replies": [
            {
              "id": "lah0dac",
              "score": 2,
              "body": "None because all the others are about 5-10 years behind unless we are talking about our own companies doing tests there. Just because some legalized it, doesnt mean it works well. For example, China, I think, gave Tesla the green light but we all know their FSD is not reliable and likely will never be good enough the way they do it.",
              "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/lah0dac/",
              "created": 1719460048,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "laaj8n5",
      "score": 12,
      "body": "And yet Tesla's share price goes up 10% every time Elon says the words robo taxis. I am pretty sure Waymo will be offering robo taxis nationwide before Tesla takes its first fully autonomous taxi ride. And just to be clear I don't think that's because Waymo is going to be rapidly expanding any time soon.",
      "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/laaj8n5/",
      "created": 1719361985,
      "depth": 0,
      "replies": [
        {
          "id": "lavnhxa",
          "score": 2,
          "body": "Which is funny because waymo if anything due to them losing so much $ waymo actually only detracts from Alphabet valuation. If the market was consistent, you'd think waymo, being the far and away leader in autonomous vehicle would contribute positively to the valuation instead of bringing it down, considering TSLAs absurd valuation. but it's pretty much the opposite",
          "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/lavnhxa/",
          "created": 1719691135,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lacmuig",
          "score": 1,
          "body": "\"Tesla's share price goes up 10% every time Elon says the words robo taxis\"\n\nWhen?",
          "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/lacmuig/",
          "created": 1719403064,
          "depth": 1,
          "replies": [
            {
              "id": "lacpvn1",
              "score": 6,
              "body": "May 17th 2023 and April 24th 2024 are two dates I could find in Google and Tesla did indeed spike up afterwards.\n\nWay bigger moves than 10%, though.",
              "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/lacpvn1/",
              "created": 1719404493,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "laansbt",
          "score": 0,
          "body": "Yes.",
          "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/laansbt/",
          "created": 1719363807,
          "depth": 1,
          "replies": []
        },
        {
          "id": "laasbkt",
          "score": -7,
          "body": "They aren't the same product but you do you.\n\nOne works in only a certain geofenced area.\n\nThe other is designed to work at almost any area.\n\nIf Tesla's goal was to have their vehicles driven only in San Francisco, don't you think their strategy would be different?\n\nAlso, Tesla stock has been down the year. Not sure where this narrative that it's been going up is coming from. I have FSD in NYC. Waymo will not be available any time soon. And it's just commercial vehicles. You don't have that technology in your own private car which makes a ton of difference.",
          "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/laasbkt/",
          "created": 1719365680,
          "depth": 1,
          "replies": [
            {
              "id": "lacq9ih",
              "score": 8,
              "body": "One works in only a certain geofenced area.\n\nThe other doesn't work.\n\nFTFY",
              "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/lacq9ih/",
              "created": 1719404667,
              "depth": 2,
              "replies": [
                {
                  "id": "lacs8bx",
                  "score": 2,
                  "body": "I laugh at the argument that Waymo is behind in self driving because of the geofencing. Waymo has the top minds of the AI field working on this problem, do they think Waymo has never heard of overfitting?",
                  "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/lacs8bx/",
                  "created": 1719405546,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ladik3d",
                  "score": 0,
                  "body": "I've got videos of me driving in NYC without touching the steering wheel for complete drives that I will gladly send to you.\n\nYou have zero experience using the product but comment on things you don't know.",
                  "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/ladik3d/",
                  "created": 1719415289,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ladiuug",
                      "score": 2,
                      "body": "Just saying one has robotaxis without drivers on the road and the other doesn't.",
                      "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/ladiuug/",
                      "created": 1719415386,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "laex0t6",
                          "score": 1,
                          "body": "Because they aren't the same product. You're not really understanding what is happening here.",
                          "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/laex0t6/",
                          "created": 1719431915,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "labohra",
              "score": 1,
              "body": "How well does FSD work in NYC?",
              "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/labohra/",
              "created": 1719380876,
              "depth": 2,
              "replies": [
                {
                  "id": "lae0t7v",
                  "score": 2,
                  "body": "It’s baaaad still not sure what he means he didn’t have to interfere but I had to interfere plenty even on a highway",
                  "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/lae0t7v/",
                  "created": 1719421373,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lab820a",
      "score": 3,
      "body": "Damn I can't wait to read another article talking about how TSLA is the leader in robotaxis",
      "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/lab820a/",
      "created": 1719372200,
      "depth": 0,
      "replies": []
    },
    {
      "id": "law9wxj",
      "score": 1,
      "body": "Is Waymo cheaper than taking an Uber or Lyft? I feel like it should be",
      "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/law9wxj/",
      "created": 1719699534,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laa7m23",
      "score": -4,
      "body": "Are you the forum mouthpiece for CNBC cut-n-copy ?",
      "permalink": "/r/stocks/comments/1doe4tw/waymo_opens_robotaxi_service_to_all_san_francisco/laa7m23/",
      "created": 1719357521,
      "depth": 0,
      "replies": []
    }
  ]
}