{
  "title": "How are people not more bullish on RDDT?",
  "score": 40,
  "selftext": "Look, I know it's hip to be contrarian and dunk on this platform around here but let's think with the correct head.\n\nReddit has 1/3 the market cap of Snap and Pinterest. Sure those companies are more mature and have much larger revenues but Reddit is soooo much a better investment. First, Reddit has no competition. Snap or Pinterest can easily get their lunch eaten by Tiktok or whatever next trendy app comes along. Meanwhile even the true regards over at r/RedditAlternatives have thrown in the towel and admit there's no alternative to Reddit. Of course reddit is never gonna compete with Insta or Tiktok due to low quality userbase (yeah I'm talking about you) and a medium less conducive to advertising. But it doesn't matter! Reddit only need to be 1/20th of meta for us to get rich.\n\nReddit is only gonna keep growing like the chode your wife loves so much. They got Google sending them giga traffic because of all the BS AI articles trying to game the search system. They got OpenAI about to start referencing reddit in their results. They got AI translation for their entire content to other languages for international expansion in testing.\n\nBest part is how bad the current advertising on Reddit is. Some people say this is a negative but it's not, that's what makes this such an opportunity. I've seen how dog water Reddit ads were targeted a few years ago. Now it's merely bad. You're telling me they can't at least make it decent after a while? When communities are already separated by topic?\n\nHalf the analysts I see talk about Reddit on TV have no idea what's going on or what the site is other than it's an old school forum that's bad at selling ads. This screams opportunity, 5x is much more likely than 50%.\n\nTldr more users more revenue per user ready for blastoff to Uranus\n\nPosition 1k shares",
  "link_flair_text": "DD",
  "id": "1dok3ph",
  "num_comments": 58,
  "created_utc": 1719358092,
  "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/",
  "comments": [
    {
      "id": "laa94u8",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/laa94u8/",
      "created": 1719358095,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laabgdt",
      "score": 110,
      "body": "Fuck off Steve, we're not pumping your shitstain\n bot-infested worthless social media ticker.\n\nYou should have left r/classic4chan alone.",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/laabgdt/",
      "created": 1719358970,
      "depth": 0,
      "replies": []
    },
    {
      "id": "labk2bd",
      "score": 28,
      "body": "I’d sooner give up FB than Reddit. Threw away SNAP years ago and grew tired of Twitter even before Elon shit the bed. No greater way to connect with other sports fans or fans of anything in general than Reddit in my opinion.\n\nTaking a new Rx? There’s a 100k subreddit for that. Looking for 1200 calorie meals? Better organized than IG and Pinterest via sort by most upvotes. Enjoy a TV series? No way you’d prefer a FB group over a subreddit. Have a detailed question about something? Zero f’ing chance you thought about posting it to Quora.\n\nIt’s thousands of die hard communities where people can find their tribe and are able to be themselves since it’s largely anonymous amongst users which is great from an advertiser’s perspective. Reddit communities are actually real, remember the fappening donations?\n\n-Bagholder",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/labk2bd/",
      "created": 1719378286,
      "depth": 0,
      "replies": [
        {
          "id": "lacarqg",
          "score": 5,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lacarqg/",
          "created": 1719396325,
          "depth": 1,
          "replies": [
            {
              "id": "lacelud",
              "score": 6,
              "body": "Yeah, it’s not gold EVERY day but I suppose my response would be, “would you be more likely to post a comment on a Southpark IG post or Reddit post? I’m gonna bet, if you’re like me, 1000x more likely on Reddit and advertisers see and want a platform with that kind of engagement.",
              "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lacelud/",
              "created": 1719398731,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lad2gtn",
      "score": 10,
      "body": "Reddit is the final form of the classic forum.\n\nDo you use it constantly, and get great value from it? It's a good investment.",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lad2gtn/",
      "created": 1719409652,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laaviiw",
      "score": 24,
      "body": "i think a lot of the value in the company is not really monetizable.\n\nlike you search up reddit recommendations for furniture or pc parts. the reason why reddit traffic is high is because the discussions are organic and vetted and subreddits reach strong consensuses driven by a smaller number of really knowledgable/dedicated/passionate users. showing a furniture ad or pc part ad on that page is not going to do shit. if you really want to get value out of this sort of thing you need to be paying for astroturfed content- ie pay someone to watch various subs for furniture or pc part discussions then get an early comment in and get botted upvotes on the thread and the comment. and then also boost the ranks on google. the problem ofc is that this stuff is easily observable unless it's done really really well, and individual moderators can also crack down and detect this stuff easily- so its very likely you might also have to bribe mods to get away with this- especially easy on smaller subreddits, much harder on big ones.\n\nreddit can't monetize this without becoming exactly like what it beat out, which is pay for play influencer blog content where you know the person shilling the content is doing so for money.\n\nif you wanted to drive traffic youd probably be better off paying a marketing team on a third party site that does shady astroturfing stuff than paying reddit for adspace. 100% without a doubt i believe this to be true. it would be far, far more effective. because itd also not be easy to integrate this sort of post in a way that isnt going to get shit on by users or blocked by subreddit mods and going to pick up traffic organically after posting, youd probably need someone who really sits on that specific sub/group of subs all day to really get maximum value and have the post actually fit in.\n\nlikewise reddit monetizes its huge source of knowledge on information. except 1. this is already available to webscrapers anyway, for free (well, less any efforts made to block scraping) and 2. part of the value in this is being able to get up to date knowledge. you see this for LLMs built on information for games that are updated constantly. you ask chatgpt about something regarding league of legends or runescape? it's not going to be accurate because information from 20219 is grossly inaccurate compared to today.\n\ni think reddit as a company got away with absolute robbery going public at its current valuation. the site its self is worthless, the only thing of value is the individual subs built off the back of free labor by the mod teams. each individual sub is effectively just its own indexed webform, people just consolidate on here because well, it's easier than building your own forum. back in the day people posted on bodybuilding dot com, the forums associated with each individual game etc but now those things simply become subreddits and discord groups without needing an individualized website. and as reddit attempts (my guess is unsuccessfully) to monetize the largest communities will splinter if they do it badly enough. or, if they don't well reddits valuation will drop long term because latestagecapitalism demands disgusting levels of monetization to make the stock go up. its going to have a twitter problem long term where yes sure, numbers go up, except for the number that matters which is ability to turn a profit.",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/laaviiw/",
      "created": 1719366975,
      "depth": 0,
      "replies": [
        {
          "id": "laboa6w",
          "score": 15,
          "body": "This was a bit hard to read but I agree and I've made similar points in the past. A few things work against Reddit here:\n\n\\- It's filled with many 'non-family friendly' degenerate content: we have subs for shoplifting, gambling, porn, cooking up drugs, guns, speculation, porn, piracy, more porn, jailbreaking, more drugs, you name it. Deep pocketed advertisers don't want to be associated with this.\n\n*When* (not if) Reddit cracks down on this, it's going to significantly destroy a big portion of the userbase in order to chase bigger advertising bucks. I'm expecting to see a big Tumblr-esque crackdown in 2025.\n\n\\- It's more \"organic\" post is in dialectic toward advertising unless you start doing paid/botted posting+upvotes which thereby decreases the reason why people even go on it. I do think it might be a matter of time before they start allowing advertisers to pay2post (and not in the ad-format) which will drive people away.\n\n\\- It's \"data\" is worthless because it's already been scrapped a million times over from everyone who wants it, and the API crackdown is very very very easy to bypass. Thanks to spez, we already know what the entire archive of 15+ years of data is worth if you wanted to pay for it: $50 million. Chump change. Also as the \"new\" data gets more polluted, it decreases it's value like how pre-atomic bomb steel was more valuable than post-atomic bomb steel.\n\n\\- It's anonymous and easy to keep making new accounts. This makes it vastly less profitable and desirable compared to LinkedIn/Nextdoor/Facebook where you have readily-accessible IRL data on everyone to hoover up and scam/target/advertise to.  You could start requiring people put in their real information but.....\n\n&#x200B;\n\nDisclaimer: I own $20k of Reddit at around IPO price lmao.  I expect it to blow up for no actual reason so I inversed myself.",
          "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/laboa6w/",
          "created": 1719380749,
          "depth": 1,
          "replies": [
            {
              "id": "laboa7k",
              "score": 1,
              "body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
              "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/laboa7k/",
              "created": 1719380749,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "laawrx0",
          "score": 4,
          "body": "like say you have a new mmo coming out. paying people to leave comments on say classic wow, osrs, runescape, black desert online etc in ways that are organic, or even getting promotional content mixed in? that would be very valuable. you could have say an osrs streamers clip on an osrs sub but have <new mmo advertisement> visible on their stream and have (paid) users discuss it in the comments on many subreddits without breaking the rules. like this would be a good example of reddit advertising where this sort of thing would drive a lot more organic traffic than just paying for an ignorable banner ad",
          "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/laawrx0/",
          "created": 1719367474,
          "depth": 1,
          "replies": []
        },
        {
          "id": "laavijo",
          "score": 5,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/laavijo/",
          "created": 1719366975,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ladtdzk",
          "score": 3,
          "body": ">i think reddit as a company got away with absolute robbery going public at its current valuation.\n\n  \nIt IPO at 2025 5x p/s, literally a steal for a company growing at 50% cagr. That's why the stock have pretty much doubled since.",
          "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/ladtdzk/",
          "created": 1719418862,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lab7pnw",
      "score": 6,
      "body": "If not for reddit, how else would we have loss porn?\n\n100$ by eoy",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lab7pnw/",
      "created": 1719372046,
      "depth": 0,
      "replies": []
    },
    {
      "id": "labi8q5",
      "score": 5,
      "body": "If Reddit found a way to grab some $$ off each OF link click I’d be all in!!",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/labi8q5/",
      "created": 1719377274,
      "depth": 0,
      "replies": []
    },
    {
      "id": "labjgyk",
      "score": 5,
      "body": "I'm fully invested with my one share I was able to get at the IPO",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/labjgyk/",
      "created": 1719377951,
      "depth": 0,
      "replies": []
    },
    {
      "id": "labj8q5",
      "score": 4,
      "body": "Another cash grab by a money obsessed CEO. I do think that it has more future than SNAP or PINS. It those two are dead man walking…",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/labj8q5/",
      "created": 1719377825,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lablwp1",
      "score": 3,
      "body": "Everything about reddit that isn't made by the users themselves is awful and those users are getting replaced by bots.",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lablwp1/",
      "created": 1719379345,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laav610",
      "score": 11,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/laav610/",
      "created": 1719366837,
      "depth": 0,
      "replies": [
        {
          "id": "lab045u",
          "score": 11,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lab045u/",
          "created": 1719368804,
          "depth": 1,
          "replies": [
            {
              "id": "labn5sj",
              "score": 2,
              "body": "I've noticed this a lot on a number of (albeit, more niche) subs that just seem to be... dying? Despite overall \"subscriber growth\" and a lot more bot activity (though mods are usually good at deleting those) than in years past, there seems like overall less posting. It's very strange\n\nGranted I don't read some of the front page stuff like /worldnews or whatever (because it's digital AIDS), so maybe those are more popular than ever before, I dunno.",
              "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/labn5sj/",
              "created": 1719380081,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lacfrdu",
              "score": 0,
              "body": "Too many psycho d!ckheads on WSB.",
              "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lacfrdu/",
              "created": 1719399398,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lab8w3j",
          "score": 3,
          "body": "You do realize that they were profitable the quarter just prior to their IPO and their first quarter as a public company that they were profitable when you take out their stock-based compensation that was as a result of their IPO (and also that stock-based compensation is all a paper expense, no cash is paid for that compensation)?",
          "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lab8w3j/",
          "created": 1719372580,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lac6738",
      "score": 3,
      "body": "As an Online Community, Reddit surves a pupose. \n\nAs a stock option business, *it shouldn't exist.*",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lac6738/",
      "created": 1719393109,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laab2we",
      "score": 6,
      "body": ">First, Reddit has no competition.\n\nReddit has tons of competition. The main problem with Reddit is that as a platform it lacks a strong identity so everything is it's competition. It's okay at everything it does but not the best at anything it does. Nudes? I guess. News? Sorta. Opinions? Meh. Chat? Bleh. Videos? Pft. It has a lot of niches but esp. after the restructure doesn't do any of them well.\n\n>Half the analysts I see talk about Reddit on TV have no idea what's going on or what the site is other than it's an old school forum that's bad at selling ads.\n\nI actually agree with them. Horrible > Bad is easier a transition than Bad > Decent. It's an exponential journey. Also the segmentation of Reddit is a major weakness; you have great targeted ads but no real base for anything else general so you've no interest from the real money.",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/laab2we/",
      "created": 1719358830,
      "depth": 0,
      "replies": [
        {
          "id": "laag0hf",
          "score": 4,
          "body": "Correct. Reddit has immense competition for ad dollars and is widely considered a second or third tier ad platform. It’s on the cheaper side, but if you talk to buyers many will tell you that it struggles to deliver down-funnel results.",
          "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/laag0hf/",
          "created": 1719360710,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lablabq",
      "score": 5,
      "body": "Couldn’t agree more! Reddit at a minimum should have a similar market cap such as Pinterest and or snap and they are at 30 Billion. WHEN reddit catches up to them they will be at $177 a share",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lablabq/",
      "created": 1719378984,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ladkvwe",
      "score": 4,
      "body": "Reddit is the weakest it's ever been. Been here 12 years.\n\nReddit was originally created for news. I Read It on Reddit was the origin of the name. Nowadays, I see articles on Google App and Instagram days before it's posted on Reddit.\n\nReddit discussion are the same repeat memes for the past 8 years. Literally can't tell done users apart from bots.\n\nReddit fucked its community with 3rd Party app decision.\n\nReddit Gold decision is being reversed. \n\nHobbies and businesses get more traction on IG and TT. \n\nThe most core Reddit users all use old.reddit and AdBlock. Forcing us to switch to new Reddit will just make us leave the platform. \n\nReddit has never had a profitable year.\n\nReddit has been reduced to nerds providing free tech support.\n\nTruly in the wsb spirit to invest in a company that doesn't make a profit",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/ladkvwe/",
      "created": 1719416061,
      "depth": 0,
      "replies": [
        {
          "id": "ladts3k",
          "score": 2,
          "body": "Caring about profits for a single digit billion growth company is simply not understanding how tech investments works.\n\nAlso number of users that's still on old.reddit is small, <5%",
          "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/ladts3k/",
          "created": 1719418991,
          "depth": 1,
          "replies": [
            {
              "id": "lafoep0",
              "score": -1,
              "body": "I've been following tech stocks and posting on wsb about AMD and NVDA since 2013. First got into AMD at $2.34 and had a position of $900 shares. \n\nI also got into BTC when it was $112.\n\nI liquidated all my crypto in 2016-18 to pay off credit card and some student debt. Much of my AMD was used to live during a few rough years. \n\nI was in early on TSLA too, but my memory on that one is a lil hazy\n\nI was a part of the BYND and SNAP IPOs. Made a few thousand and dipped\n\nI'm very familiar with tech stocks and it's the reason I got a finance degree and career\n\nOut of all social medias, Reddit users are the hardest to monetize. Ad rates depend upon clicks and clicks that lead to sales",
              "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lafoep0/",
              "created": 1719441067,
              "depth": 2,
              "replies": [
                {
                  "id": "laghpgp",
                  "score": 4,
                  "body": "If you’ve been in tech that early then you should know profit means Jack shit at this stage. The rule of 40 prevails and most company that maintains this will reward its investors in due time.",
                  "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/laghpgp/",
                  "created": 1719452231,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lajqlxd",
                      "score": 1,
                      "body": "Also, I want to note. You said reddit is a growth company. \n\nA few years ago Reddit was the 6th highest traffic site in the world. As of 2024 Reddit is now ranked 15th",
                      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lajqlxd/",
                      "created": 1719507608,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lasptzl",
                          "score": 2,
                          "body": "It makes no sense talking about global traffic when Reddit itself have very digestible growth it tells you directly on the prospectus and ER. It’s obviously not the fastest growing company in the world, but 36% yoy user growth is very impressive.",
                          "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lasptzl/",
                          "created": 1719643065,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "laaotb0",
      "score": 3,
      "body": "Monetization in the short term. It’s on my watchlist, but I’d like to see execution. Does anyone, ever, interact with the ads?",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/laaotb0/",
      "created": 1719364230,
      "depth": 0,
      "replies": [
        {
          "id": "lab34ue",
          "score": 8,
          "body": "Not on purpose",
          "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lab34ue/",
          "created": 1719370045,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lab7c00",
          "score": 5,
          "body": "Does anyone *ever* interact with ads?",
          "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lab7c00/",
          "created": 1719371874,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lab9i7f",
          "score": 2,
          "body": "There are ads?",
          "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lab9i7f/",
          "created": 1719372862,
          "depth": 1,
          "replies": []
        },
        {
          "id": "laau414",
          "score": 2,
          "body": "i dont",
          "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/laau414/",
          "created": 1719366412,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laak323",
      "score": 2,
      "body": "Grabbed some 65c 7/5 this afternoon. Up 56% already",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/laak323/",
      "created": 1719362318,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laccswh",
      "score": 1,
      "body": "Wallstreet wants to pump and dump reddit again",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/laccswh/",
      "created": 1719397638,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lachok4",
      "score": 1,
      "body": "With how bad the economy is, who actually has spare change to invest?",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lachok4/",
      "created": 1719400465,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ladckpn",
      "score": 1,
      "body": "Get ready to be annoyed.  \n\nHere come the ads!!!!",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/ladckpn/",
      "created": 1719413253,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laer9nx",
      "score": 1,
      "body": "It's a known secret that $RDDT isn't discussed openly on purpose on Reddit.",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/laer9nx/",
      "created": 1719430065,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbvzv8t",
      "score": 1,
      "body": "2024 Q1 Net loss was $575.1 million, as compared to $60.9 million in the prior year. This is driven by stock-based compensation expense. Can we know how much of these stock based compensation is expected to be paid by Reddit going forward? This really hinders the balance sheet and p&l.",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lbvzv8t/",
      "created": 1720271244,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzhakx",
      "score": 1,
      "body": "Aged like a sack of shite ",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lhzhakx/",
      "created": 1723589621,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laafvss",
      "score": 2,
      "body": "Because it's vaporware with a hard leaning (and very narrow) political bent.",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/laafvss/",
      "created": 1719360659,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laanf2v",
      "score": 1,
      "body": "Absolutely regarded and totally based take.",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/laanf2v/",
      "created": 1719363655,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lab9cnj",
      "score": 0,
      "body": "Ive been on reddit and I disagree",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lab9cnj/",
      "created": 1719372791,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lab77a7",
      "score": -2,
      "body": "Honestly Reddit is a toxic shithole, far worse than X.",
      "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/lab77a7/",
      "created": 1719371816,
      "depth": 0,
      "replies": [
        {
          "id": "labzh7o",
          "score": 0,
          "body": "generally less racist but that wholesomeness is delivered with a much lower iq",
          "permalink": "/r/wallstreetbets/comments/1dok3ph/how_are_people_not_more_bullish_on_rddt/labzh7o/",
          "created": 1719388229,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}