{
  "title": "Buying and Selling the Same Stocks",
  "score": 31,
  "selftext": "I have recently started investing. On my first sale, I made a good profit, and now the stock I made the sale on has dumped back down to lower than I initially bought for, and it got me wondering:\n\nDo you have one or two stocks you constantly buy and sell? They have a somewhat predictable range, and you can consistently depend on them to stay within that range. So you know if you buy at a certain price, it'll go up in a certain range, sell it, and then wait for it to drop again, rinse and repeat.\n\nI'm just wondering if most people are constantly going for new stocks all the time or if you kind of stay within a small group and just wait for prices you like on them and are just constantly buying and selling the same stocks.\n\n  \nEdit: Thanks all of you coming in with some serious and insightful replies with some strategies that I can research as I learn more about how to do this thing",
  "link_flair_text": null,
  "id": "1doos54",
  "num_comments": 41,
  "created_utc": 1719372099,
  "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/",
  "comments": [
    {
      "id": "labi7gb",
      "score": 50,
      "body": "It works well until it doesn't. Sometimes it goes down and stays down. This kind of strategy tends to work well in an up economy. If the economy is down, might not bounce back.",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/labi7gb/",
      "created": 1719377255,
      "depth": 0,
      "replies": [
        {
          "id": "lape3q9",
          "score": 2,
          "body": "There are always safe bets. For example, stock mildly crashing due to incels anti woke selling. Or banks doing good when rent is relatively high. Or medical doing good during a pandemic. Or the gold price always bouncing back up.\n\n\nBut in the end its always controlled betting.",
          "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/lape3q9/",
          "created": 1719593790,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "labbc51",
      "score": 14,
      "body": "Some people only trade one or two stocks and do quite well ",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/labbc51/",
      "created": 1719373722,
      "depth": 0,
      "replies": [
        {
          "id": "lb0fl94",
          "score": 3,
          "body": "I know a person who made 300M from 50K playing the same stock.",
          "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/lb0fl94/",
          "created": 1719771466,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lacsc9l",
      "score": 25,
      "body": "\"Has anyone ever considered buying a stock when it's low, then selling it when it's high? Almost seems like you could consistently do that multiple times and make a profit.\"\n\nIs this a bit?",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/lacsc9l/",
      "created": 1719405594,
      "depth": 0,
      "replies": [
        {
          "id": "laezwgi",
          "score": 6,
          "body": "Maybe it belongs at wallstreetbets?",
          "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/laezwgi/",
          "created": 1719432848,
          "depth": 1,
          "replies": [
            {
              "id": "laf18ez",
              "score": 8,
              "body": "Wrong, we buy high and sell low there",
              "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/laf18ez/",
              "created": 1719433270,
              "depth": 2,
              "replies": []
            },
            {
              "id": "laju9wx",
              "score": 2,
              "body": "No. The WSB strategy is buy at ATH, sell halfway to 52 week low, buy again at halfway back to ATH, then sell after a 3% gain. Then you say: \"I should have had diamond hands, that was my whole mistake. Next time I swear I'll never sell, but that's enough of this particular stock.\"",
              "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/laju9wx/",
              "created": 1719508802,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lagphy0",
          "score": 2,
          "body": "Come on now, we all started somewhere. At least he didn’t YOLO his life savings into 0DTE SPY calls. He’s just asking basic questions to get into investing which I’d hope this community would encourage since it isn’t WSB",
          "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/lagphy0/",
          "created": 1719455329,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "labb9in",
      "score": 11,
      "body": "I do this to stock that have decent fundamental, swing trade around 5-10%, each time around 4k, with atleast 4-8k to back up for averaging down (in case of going down without news).",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/labb9in/",
      "created": 1719373687,
      "depth": 0,
      "replies": [
        {
          "id": "lao6lyk",
          "score": 1,
          "body": "Look at NKE now. This play can be a month or 2. I bought some premarket at 79.8. I also have 2 more loads at the same amount of money to average down. Will see.",
          "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/lao6lyk/",
          "created": 1719578323,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lab8r8m",
      "score": 8,
      "body": "I like to buy stocks that I already have experience with, is somehow easier to have better profits maintaining few stocks than trading new ones. Of course that's my experience, I know people that always check new stocks to trade and have good profits.",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/lab8r8m/",
      "created": 1719372519,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lab9gnb",
      "score": 22,
      "body": "Some people do this for swing trading. It is easy to get over confident and mistime it and lose a fuck ton. Also, be mindful of triggering a wash sale.",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/lab9gnb/",
      "created": 1719372842,
      "depth": 0,
      "replies": [
        {
          "id": "labhxwn",
          "score": 4,
          "body": "I can the living proof",
          "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/labhxwn/",
          "created": 1719377111,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "labqjla",
      "score": 6,
      "body": "Yeah works for AT&T and the airline stocks. Norwegian cruiselines etc.\n\nJust a cycle of buy low sell high. Same stock so the DD is easy. Timing is the hard part unless you plan out your sell price ahead of time.",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/labqjla/",
      "created": 1719382143,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lacb07y",
      "score": 4,
      "body": "Yes, I cycle through three stocks, one I buy puts on and the other 2 I buy shares In because theta crush would kill the tiny profits I go for\n\nThe stock I buy shares in is so close to fundamental value I don’t have to worry about the share price dipping much more, the stock I buy puts is trading at an insane price ratio relative to its price and the third stock is a blue chip. \n\nBut I’m thinking about cycling in rivian puts into my golden trio.\n\nI’ve made 200-500 usd a day for the last week, no clue if it’s going to continue or not, but I’m almost break even with my portfolio from being down 20% 2 weeks prior\n\nI do cycle in companies who have earnings, just none have been interesting in the last two weeks for a recovery play\n\nIf you do this cycling just be careful you are fine holding the stock and doing covered calls or similar, and never invest your full cash pile so you can take advantage of other market moves. I only invest half my cash max in shares and 10-15% in any options move so I can hedge my postions if they blow up",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/lacb07y/",
      "created": 1719396478,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laczdl8",
      "score": 4,
      "body": "Sofi anyone? I swear that stock cycles down to $7ish a share and over 4-7 months cycles back up to $9ish and the cycles back down. It's seems like a legit play but I worry it will stay down the minute I try to make a move.",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/laczdl8/",
      "created": 1719408467,
      "depth": 0,
      "replies": [
        {
          "id": "lad4k0f",
          "score": 2,
          "body": "Although that's not the one I bought, it's definitely one of the ones that I've been researching lately that does actually seem to be pretty consistent in that regard",
          "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/lad4k0f/",
          "created": 1719410421,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ladpa23",
      "score": 3,
      "body": "I did that for a while with TQQQ but it didn't really work out.  I would have made a lot more if I just kept buying the dips.  That is what I mostly do now except not with TQQQ.  I start positions in something and keep dip buying until I eventually sell it.",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/ladpa23/",
      "created": 1719417506,
      "depth": 0,
      "replies": []
    },
    {
      "id": "labp3tx",
      "score": 2,
      "body": "If you have more than 100 shares look into the wheel option strategy to milk the capital out of a stock that trades within a predictable range.",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/labp3tx/",
      "created": 1719381248,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lad26zq",
      "score": 2,
      "body": "It's better to pick a specific market sector than an individual stock, like AI for example. You can focus all your attention on semi-conductors, data centres, chip producers, etc. Some companies are going to have breakthroughs while others setbacks and you'll get to know which are short term vs long term, what kind of effect earnings have, which companies are pulling ahead/falling behind, etc. \n\nIf you pick one stock that has a few bad months while others are gaining you're sitting there watching it trade sideways or losing value.",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/lad26zq/",
      "created": 1719409550,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ladrb0a",
      "score": 2,
      "body": "Do this with ETFs instead of stocks.  I like to use SOXL because it's leverage creates more movement. I'm also a scrub tho",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/ladrb0a/",
      "created": 1719418180,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laduer8",
      "score": 1,
      "body": "> I have recently started investing.... Do you have one or two stocks you constantly buy and sell?\n\nThat is not *\"investing\"*. Nothing inherently good/bad about what you are doing, just be conscious and aware of what you are doing, and that it's not investing.\n\nGood luck.\n\n> Edit: Thanks all of you coming in with some serious and insightful replies with some strategies that I can research as I learn more about how to do this thing\n\nJust go to EdX and search for classed on \"Investing\" and \"Portfolio Management\", and similar.",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/laduer8/",
      "created": 1719419196,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laeng2b",
      "score": 1,
      "body": "Lichello might be for you.",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/laeng2b/",
      "created": 1719428803,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lafbb72",
      "score": 1,
      "body": "This is usually done during a volatile period in stocks which is presently where we are at now. It's common for investors to buy low and sell high on stocks they have been studying for a long period of time. Just wait for the stock to hit the support line for the last month buy in if it goes 5% below the support and sell when it is hitting the resistance line. A lot of day traders do this. Typically they wait for it to hit the resistance and reverse before selling to make sure it doesn't break through the resistance because sometimes that means it's a bull run if it makes a major break through the resistance.",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/lafbb72/",
      "created": 1719436528,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lag76qd",
      "score": 1,
      "body": "Not advice!!!\n\nMARA has been jumping up and down the last month, been making some good profit, getting 15% or more. Usually takes two to three days to rise from a drop. It’s been around the 18-21 range.",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/lag76qd/",
      "created": 1719448180,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lakkih1",
      "score": 1,
      "body": "Yes. The actual securities may change each week/ month/ quarter due to timing but DJT for example I have swing traded several times now. I also do the SOFI shuffle, buy as low as possible in the 6’s sell around 7.50- 8 when it gets rejected and starts to crash back down, maybe one day it will break into 9-10 again, and happy surprise if it does.\n\nYou do you, but I just bought back into MSOS as I think it’s headed back to $10 plus in the coming weeks. I’ve traded this security several times this year to the same result",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/lakkih1/",
      "created": 1719517310,
      "depth": 0,
      "replies": []
    },
    {
      "id": "layx0l1",
      "score": 1,
      "body": "Yep, CSCO. I buy it every time it goes back down to $42.42 🤷‍♂️",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/layx0l1/",
      "created": 1719750906,
      "depth": 0,
      "replies": []
    },
    {
      "id": "labrgj2",
      "score": 0,
      "body": "Very common thing. Is called scalping or day trading. Not always working unfortunately otherwise everyone else will do it",
      "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/labrgj2/",
      "created": 1719382724,
      "depth": 0,
      "replies": [
        {
          "id": "lacd0y4",
          "score": 3,
          "body": "No I don't think they're talking about scalping. I think the timeline of the trades is likely in the 3-4 week range as a minimum.",
          "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/lacd0y4/",
          "created": 1719397776,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lacq7v2",
          "score": 1,
          "body": "Otherwise everyone else will do it scared the sht out of me ❤️",
          "permalink": "/r/stocks/comments/1doos54/buying_and_selling_the_same_stocks/lacq7v2/",
          "created": 1719404647,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}