{
  "title": "FedEx shares jump after hours as massive cost-cutting measures kick in ",
  "score": 76,
  "selftext": "FedEx shares soared more than 15% after hours Tuesday after the company reported results that topped analysts’ estimates in both earnings and revenue.\n\nHere’s how the company did in its fiscal fourth quarter compared with what Wall Street was anticipating, based on a survey of analysts by LSEG:\n\nEarnings per share: $5.41 adjusted vs. $5.35 expected\n\nRevenue: $22.11 billion vs. $22.07 billion expected\n\nThe company reported net income for the three-month period that ended May 31 of $1.47 billion, or $5.94 per share, compared with $1.54 billion, or $6.05 per share, a year earlier.\n\nRevenue rose to $22.1 billion, up slightly from $21.9 billion a year earlier. For the full fiscal year, revenue was $87.7 billion, down from $90.2 billion.\n\nFedEx reported that capital spending for fiscal 2024 was $5.2 billion, down 16% from $6.2 billion in fiscal 2023 and less than the $5.7 billion it forecasted in its fiscal 2024 guidance last year.\n\nFor fiscal 2025, the company said it expects low to mid-single-digit revenue growth year over year, driven in large part by e-commerce and low-inventory levels, FedEx Chief Customer Officer Brie Carere said on the company’s earnings call.\n\n“We think e-commerce is going to outpace the B2B growth,” Carere said. “We like the fundamentals from an e-commerce perspective that will help us here in the United States and around the world.\n\nThe capital spending decline comes as the company amps up its cost-cutting measures as part of a sweeping commitment to cut $4 billion by the end of fiscal 2025.\n\nFollowing weak freight demand, FedEx enacted its DRIVE transformation program to cut costs and consolidate the business.\n\n“DRIVE continues to change the way we work at FedEx. We achieved our target of $1.8 billion in structural costs out in fiscal year ’24,” CEO Raj Subramaniam said on the call.\n\nSubramaniam said the company is firmly on track to achieve the $4 billion cost-cutting goal and further expects another $2 billion from the company’s plans to consolidate its air and ground services.\n\nAs part of the DRIVE initiative, FedEx announced in April 2023 that it will be consolidating its delivery companies Express, Ground, Services and others into a unified Federal Express Corporation, operating under the FedEx brand and alongside the company’s Freight segment which will continue to exist separately. The company said at the time that it expects the combined delivery business to handle all deliveries starting June 2024.\n\nThe newly combined segments are expected to be the larger driver of fiscal year 2025 adjusted income and margin improvement, finance chief John Dietrich said on the call.\n\nFedEx further expects the demand environment to moderately improve through the next fiscal year, according to Carere.\n\nInvestor’s eyes are also on the company’s largest segment Express, which has been struggling with margin growth the past year. The segment’s margins ended the fourth quarter at 4.1%, unchanged year over year. Its operating margin for fiscal 2024 was 2.6%, up slightly from 2.5% last year.\n\nSubramaniam said improving performance of the Express segment is a “top priority” for the company.\n\nWhile the company hiked its quarterly dividend by 10% earlier this month, investors do foresee headwinds, particularly after the company lost its U.S. Postal Service contract to rival United Parcel Service n April.\n\nUPS will become the primary air cargo provider for USPS starting Sept. 30, after FedEx’s contract expires. USPS was the largest customer for the company’s Express segment. The company shared that it expects a $500 million headwind from the loss in fiscal 2025.\n\nSource: https://www.cnbc.com/2024/06/25/fedex-fdx-earnings-q4-2024.html",
  "link_flair_text": null,
  "id": "1dould7",
  "num_comments": 31,
  "created_utc": 1719394823,
  "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/",
  "comments": [
    {
      "id": "ladtw0z",
      "score": 19,
      "body": "Being that FedEx is so bad at the thing it was once so good at- delivering packages- cost cutting causes the stock to jump? \n\nI’ve just stopped or not even completed a purchase solely because the vendor used FedEx. \n\nCutting Cost is going to improve that??",
      "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/ladtw0z/",
      "created": 1719419026,
      "depth": 0,
      "replies": [
        {
          "id": "lafc0y1",
          "score": 3,
          "body": "They should turn into a credit card company like everyone else",
          "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lafc0y1/",
          "created": 1719436765,
          "depth": 1,
          "replies": [
            {
              "id": "lafxej7",
              "score": 1,
              "body": "Don't jinx it",
              "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lafxej7/",
              "created": 1719444418,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lad2w8d",
      "score": 78,
      "body": "FedEx just delivered an expensive package to the wrong house and now I'm stuck waiting for them to do an \"investigation\".\n\nWhat good is a proof of delivery photo that doesn't show the actual home address?\n\nTheir service is already shit, cost cutting is only going to make it worse.",
      "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lad2w8d/",
      "created": 1719409811,
      "depth": 0,
      "replies": [
        {
          "id": "laddoco",
          "score": 13,
          "body": "That photo is absolutely geofenced which I think is the more important part of it",
          "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/laddoco/",
          "created": 1719413634,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lae8r18",
          "score": 14,
          "body": "It’s a race to the bottom with all third party delivery services. Fuck them all. USPS ftw. When given an option, I will literally never choose UPS and will actively prefer USPS over fedex, dhl, or anyone else. Ironically the Amazon delivery guys who don’t speak any English are way better at their jobs than the UPS and FedEx folks who ignore my delivery instructions 9 times out of 10.",
          "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lae8r18/",
          "created": 1719423984,
          "depth": 1,
          "replies": [
            {
              "id": "lafbvyb",
              "score": 2,
              "body": "Idk USPS has been pretty awful to me recently. I’ve sent three packages through them in the last year and all three were fucked up in some way. One got lost entirely, had to claim insurance, one I had to submit a bunch of inquiries and a missing mail ticket just for it to finally be delivered a month late, and one just disappeared for two weeks (was supposed to take 3-5 days) in between my local office and the recipients house, no tracking whatsoever. It still says it’s “moving through our network” when I put in the tracking number, which is funny.\n\nNot saying other shippers are better. I have family and friends all over the place and have shipped a lot of shit. I’ve had issues with all of them. Is it just me or shipping packages significantly less reliable in general than it was like 5-10 years ago?",
              "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lafbvyb/",
              "created": 1719436719,
              "depth": 2,
              "replies": [
                {
                  "id": "lafirus",
                  "score": 8,
                  "body": "I mean republicans have been actively trying to destroy and privatize USPS for as long as I’ve been alive. Under Trump they succeeded in a great degree of sabotage. Hard to blame USPS for this.",
                  "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lafirus/",
                  "created": 1719439065,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lag4mtm",
                      "score": 2,
                      "body": "Why?",
                      "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lag4mtm/",
                      "created": 1719447208,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lag63y8",
                          "score": 8,
                          "body": "Because they don’t like government, so they like to practice what is known as regulatory capture. They worked to make government look more incompetent and less efficient so they can point at it and say look “how inefficient it is!” All while pushing for privatization and taking increasingly large donations from lobbyist industries. So in the case of USPS you have people like Dejoy, a Trump appointee, who actively want to dismantle it from the inside so it looks like a failing agency so they can shut down USPS under the pretense of less government spending and the free market being more efficient. Just then put more money in the pockets of those lobbyist industries turn around to put more money in the pockets of the politicians through political campaign, donations, and deals after the politicians are no longer public policy making. It’s basically a revolving door of legalized bribery, the Supreme Court just made easier today. So far this is without even mentioning how Trump and Republicans wanted to cause USPS to fail in order to sabotage mail in voting, since left-leaning citizens are more likely to utilize mail and voting then Republicans due to Republicans’ own rhetoric and republicans can’t win a fair election without gerrymandering, ballot purging, voter intimidation, and other anti-democratic behaviors they love.\n\nI also haven’t mentioned up until now how the USPS is the only profitable arm of the US government, even after being sabotaged by Republican ratFuckery and being forced to pre-fund its employees pensions, making it the only government agency required to do so.\n\nSo this is just USPS, but Republicans are doing this in every industry, all of the time. They say it’s for efficiency and cut government spending and taxation, but really this only benefits corporations and the one percent. For everyone else, they are just pissing on your leg and telling you it’s raining.",
                          "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lag63y8/",
                          "created": 1719447770,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lbaunrd",
                              "score": 1,
                              "body": "This is such a mess of a comment. Total disregard for reality.",
                              "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lbaunrd/",
                              "created": 1719935919,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lbbtf33",
                                  "score": 1,
                                  "body": "lol we lived through it so if anyone is disregarding reality it’s the person who is denying the lived experience I’ve shared and that is painstakingly documented across media, government documents, policy decision.. etc.\n\nTo deny this is to be living in denial. I don’t listen to people who are living in denial because they aren’t psychologically healthy and can’t be reasoned with so take your nonsense elsewhere. It holds no water with me. \n\nNow we’ll all watch while you double down and name call and act a fool.",
                                  "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lbbtf33/",
                                  "created": 1719947148,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lbbtlip",
                                      "score": 1,
                                      "body": "The irony.",
                                      "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lbbtlip/",
                                      "created": 1719947206,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lbaufzk",
                      "score": 1,
                      "body": "Well, the DMVs in my area were privatized and they are awesome. What used to be at least an hour wait and some cranky idiot messing stuff up is now a 20min visit at max and the employees are nice and friendly. Privatization is not a bad idea.",
                      "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lbaufzk/",
                      "created": 1719935850,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ladotuq",
          "score": 6,
          "body": "I’m really curious how this works financially if sellers have to eat the cost of a replacement item so frequently yet they keep signing contracts with FedEx. UPS, Amazon, and USPS are all great in my area. FedEx delivers to the wrong building in my large apartment complex 50% of the time, so ordering anything from a seller who uses them is a gamble I avoid whenever possible.",
          "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/ladotuq/",
          "created": 1719417358,
          "depth": 1,
          "replies": [
            {
              "id": "lae8vw0",
              "score": 2,
              "body": "They are insured against this kind of shrinkage. Its all priced in",
              "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lae8vw0/",
              "created": 1719424027,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "laj8pfy",
          "score": 1,
          "body": "They already cut costs with ground by contracting them out. Theyre all underpaid, overworked(and have to work 6 days a week), and get 0 benefits. They hire pretty much anyone and have a ridiculously high turnover rate. Not surprised that this happened.",
          "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/laj8pfy/",
          "created": 1719501798,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laczjrz",
      "score": 26,
      "body": "I avoid FedEx whenever I get the chance. I will just not buy something if the only delivery option is FedEx. \n\n\n\nI’m sure cost cutting will improve their service. This is a short term boost to a bad company.",
      "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/laczjrz/",
      "created": 1719408534,
      "depth": 0,
      "replies": [
        {
          "id": "laelizd",
          "score": 3,
          "body": "“Will improve”???",
          "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/laelizd/",
          "created": 1719428176,
          "depth": 1,
          "replies": [
            {
              "id": "lafczex",
              "score": 2,
              "body": "/s",
              "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lafczex/",
              "created": 1719437086,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lacebyi",
      "score": 4,
      "body": "With the lose of USPS, this is a show me story and I will wait for next earnings release.  I have my doubts.",
      "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lacebyi/",
      "created": 1719398568,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ladpen0",
      "score": 4,
      "body": "So this is what the top of the ⛰ looks like",
      "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/ladpen0/",
      "created": 1719417548,
      "depth": 0,
      "replies": [
        {
          "id": "ladph71",
          "score": 2,
          "body": "🗻",
          "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/ladph71/",
          "created": 1719417571,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laelcvr",
      "score": 4,
      "body": "So they’re gonna make the worst mail delivery service completely unusable? Lmfao. I sent a package for work a couple months ago and when it showed up destroyed at the destination there were 2 completely different packages not addressed to me inside the box. How is it possible to be that fucking incompetent? Just another day at fedex though.",
      "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/laelcvr/",
      "created": 1719428123,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ladza47",
      "score": 3,
      "body": "Fed Ex failed me this past week on a flower delivery to a friend in WA (I’m in CA). In April a simple order was rerouted to two different facilities one being 100miles further from the other. May’s delivery zero issues. My delivery date for Monday got delayed and yesterday got the flowers and she had already left for camp for a week Argh\n\nI’m like why all the rerouting one day the other days not ? Argh",
      "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/ladza47/",
      "created": 1719420862,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lac9g0m",
      "score": 2,
      "body": "Might finally be a boost for transports that haven't done well this year (ODFL, etc.)",
      "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lac9g0m/",
      "created": 1719395440,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ladct4o",
      "score": 2,
      "body": "Good read through for Amazon.",
      "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/ladct4o/",
      "created": 1719413333,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laeq98r",
      "score": 2,
      "body": "I suspect cost cutting is going to be the #1 corporate message going forward.   In pretty much every industry.",
      "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/laeq98r/",
      "created": 1719429731,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lagyq02",
      "score": 1,
      "body": "Service bad? No dump…\nCost cutting? Sure pump",
      "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lagyq02/",
      "created": 1719459278,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lahdddv",
      "score": 1,
      "body": "FedEx is so bad. They delay and not deliver on time for their own convenience.",
      "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lahdddv/",
      "created": 1719467040,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lazo1r9",
      "score": 1,
      "body": "Fedex has been losing my packages. The worst delivery service ever",
      "permalink": "/r/stocks/comments/1dould7/fedex_shares_jump_after_hours_as_massive/lazo1r9/",
      "created": 1719761896,
      "depth": 0,
      "replies": []
    }
  ]
}