{
  "title": "These are the stocks on my watchlist (6/26) ",
  "score": 234,
  "selftext": " \n\nHi! I am an ex-prop trader who trades equities.\n\nThis is a daily watchlist for trading.\n\nI might trade all the stocks on here, or none of them, on any given day. I might trade stocks that do not appear on here! I hold no positions in any stocks long-term but Amazon/Mag7/general broad market indices. (unless otherwise noted in these tickers). If you are on old reddit, click “show images” at the top to see all the charts quickly.\n\nI usually make these watchlists premarket, but can be delayed if I am trading the open. These are not mean to be taken as gospel or any recommendation to buy/sell.\n\nMany stocks I post are <$500M market cap. These are potentially good candidates to day trade; I have no opinion on them as investments. PLEASE ask specific ones. Questions like “Thoughts on \\_\\_\\_\\_\\_?” will be ignored unless you add detail to the question. “Is \\_\\_\\_ a good investment?” will be ignored. I will block you if you are a troll.\n\n**News:**  [Yen’s Tumble to Weakest Since 1986 Boosts Risk of Intervention](https://www.bloomberg.com/news/articles/2024-06-26/yen-weakens-beyond-key-160-level-raising-risk-of-intervention)\n\n**RIVN-** Lands Volkswagen as a major partner, to invest up to $5B into RIVN.\n\n**LCID-** Moving also likely due to the RIVN news.\n\n**WHR-** German engineering group Robert Bosch is weighing a bid for WHR, possible takeover offer for $4.8B.FDX-           \n\n**FDX-** Reported revenue and earnings beat, $5.41 vs $5.35 expected, and revenue of $22.11B vs $22.07B expected, with a drop in capital spending.\n\n**NVDA-**We saw a decent bounce yesterday after the 3 day selloff, could see that continue today as well. Watching the $125 level in addition to the $130 if we get up there today.\n\n**Earnings today**: MU",
  "link_flair_text": null,
  "id": "1doyj8b",
  "num_comments": 57,
  "created_utc": 1719408236,
  "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/",
  "comments": [
    {
      "id": "lad2oc4",
      "score": 72,
      "body": "thanks for doing this everyday. I have been following you. It's always interesting to see how your analysis lines up with mine and the market. If nothing else it's a nice flex of discipline and I enjoy these reads. Thanks again!",
      "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lad2oc4/",
      "created": 1719409730,
      "depth": 0,
      "replies": [
        {
          "id": "lad300f",
          "score": 39,
          "body": "Thank YOU for being a reader! It means a lot to me :) best of luck in the markets!\n\n  \nIt's funny you say it's a flex of discipline, I think I'm the least disciplined person I know haha.",
          "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lad300f/",
          "created": 1719409849,
          "depth": 1,
          "replies": [
            {
              "id": "laegez3",
              "score": 7,
              "body": "I also enjoy seeing what you post.\n\nTrying to learn here as I go.",
              "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/laegez3/",
              "created": 1719426481,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ladihl0",
              "score": 4,
              "body": "and yet we have come to expect (and you deliver) on the daily reads. keep it going!",
              "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/ladihl0/",
              "created": 1719415266,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ladly1d",
          "score": 2,
          "body": "Who is this guy and why should we care what they’re watching every single day",
          "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/ladly1d/",
          "created": 1719416412,
          "depth": 1,
          "replies": [
            {
              "id": "lae6s5b",
              "score": 26,
              "body": "Hiya, I worked at a proprietary trading firm working as a trader in equities- one of my job duties was to write a watchlist for the traders. These are traders that are new, developing traders, and traders that make 6/7/8 figures- ALL of them read a watchlist in the morning. It's a good primer for the trading day to be aware of stocks that are active and the reasons WHY they are active, so it can aid in the decision making process.\n\nBTW, it's completely fair to ask this question and I don't begrudge anyone that does unless they're a jerk about it- there's so many scammers in the trading sphere that it's GOOD to have doubt.",
              "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lae6s5b/",
              "created": 1719423340,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ladtyqn",
              "score": 12,
              "body": "just a random guy man - like every one on reddit (including you). I just happen to think he has good sensibilities.",
              "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/ladtyqn/",
              "created": 1719419051,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lba5yb2",
              "score": 0,
              "body": "Hey, I'm all for someone giving some type of insight or guidance towards trading. Believe it or not it actually helps to see what others are looking at compared to what you've been watching. ",
              "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lba5yb2/",
              "created": 1719927353,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ladc10p",
      "score": 5,
      "body": "Do you think Paramount will bounce back?",
      "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/ladc10p/",
      "created": 1719413064,
      "depth": 0,
      "replies": [
        {
          "id": "ladc7g5",
          "score": 6,
          "body": "With the deal off the table, nope.",
          "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/ladc7g5/",
          "created": 1719413126,
          "depth": 1,
          "replies": [
            {
              "id": "ladd0ts",
              "score": 2,
              "body": "Was thinking of buying the dip and just forget about the stock for bout 18 months",
              "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/ladd0ts/",
              "created": 1719413407,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "laeptnw",
      "score": 5,
      "body": "I’ve been debating buying Rivian for a while. I know it just went up a bit from $10/share was what I last saw it at. Still worth it to buy? And how much would you do?",
      "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/laeptnw/",
      "created": 1719429590,
      "depth": 0,
      "replies": [
        {
          "id": "lahuy5q",
          "score": 3,
          "body": "Been buying it up for the last few months, going to probably 10x my investment into it before the next earnings.\n\nReasons:\n\n* New factory in progress + nearly a billion in tax incentives for the old one\n* New investments\n* New vehicles with more planned, R2 has more reservations than their total yearly production\n* They can sell trucks to more partners\n\nBut besides the obvious ones, here's some to notice:\n\n* They were bleeding cash and on the verge of \\_won't last a year\\_. Leadership did the following:paused work on new factories, cut costs by a ton on each car produced, paused production to implement cost reducing changes, got amazon to let them sell more vans to others, paused construction on the new factory, got the tax incentives for the government AND in the meantime announced and toured new vehicles. So what does this all mean? It means leadership is strong, decisive and knows how and when to make the right moves.\n* The sentiment around it's trucks is mostly positive and people are giant fans. The complaints mostly are the lack of autonomy and the repair costs. Their software is steadily improving and the repair costs are going to be way down with the new gens.\n* They are turning into making a base platform + addons, which you'll notice most large companies are doing.\n* Their R&D is in Serbia, reducing costs by a large margin compared to US/UK/Germany etc.\n* The sentiment around it's vans is killing it. Most drivers riding their vans love it and wouldn't trade it for anything in the world, they're quite thought out and make their jobs a lot easier.\n* The end of year is when we'll see gross profit, which will probably bump the stock to 20-25 levels. I expect them to be at about 50 same time next year, with >100 after R2 numbers start coming in.",
          "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lahuy5q/",
          "created": 1719478909,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lagmmof",
          "score": 1,
          "body": "Curious if you got an answer…I’m right there with you. Rivian is looking very interesting",
          "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lagmmof/",
          "created": 1719454176,
          "depth": 1,
          "replies": [
            {
              "id": "lah9ibh",
              "score": 2,
              "body": "I’ve been watching it for a month and decided they were probably going to need to dilute in the next year and I’d reevaluate after that. The Volkswagen news caught me off guard but after reading the details it’s basically a planned/staged dilution imo. Good because it alleviates concerns about Rivian running out of cash but it’s still dilution so I think the price will die down a bit in the coming months unless there is other surprise news or they start turning a profit earlier than I expect.\n\nBasically, I’m just watching for now as I think the price will fade again and I’m still not convinced it’s a long term winner.\n\nAlso, if I bought a week ago at $10.50 or whatever it was I would have sold this morning and waited again like I am now.",
              "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lah9ibh/",
              "created": 1719464798,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "laduehc",
      "score": 9,
      "body": "I see these posts almost everyday and have not understood the point of them. Can you explain to me what you mean when you are saying you are watching NVDA at the $125 and the $130 level? Isn’t everyone who is invested in them watching these levels? Or are you talking about something else?",
      "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/laduehc/",
      "created": 1719419193,
      "depth": 0,
      "replies": [
        {
          "id": "lae2jj2",
          "score": 16,
          "body": "Sure- for certain stocks there are levels that are worth watching- obviously these aren't typically firm because there are so many market participants, but they are levels where I think the stock is most interesting and make further moves from there.\n\nFor example, today I was interested in NVDA today mostly at $125 (we didn't get close to $130 after the open) because that's where likely the stock will do something interesting, depending on a lot of different factors- how the rest of the market is doing, how NVDA's competitors is doing, how overextended it is, what events there are (like the shareholder meeting today).\n\nNVDA moved from 128-> 125 today in under 20 minutes- those are the moves I'm interested in, and the level made the stock stand out. These things shouldn't be viewed in a vacuum alone, but are one of many factors that influence my trading/decision-making. (This is the most important one to me in that moment though)\n\nIf I told you- hey, take into account the market is FLAT today, AMD and INTC are DOWN today, we recently fell from 140, it's the MOST valuable company in the world right now, they have a SHAREHOLDER MEETING today, and we're in the middle of an AI BULL RUN, and its in the MAG 7, then this watchlist would take a massive amount of time to make each morning and you'd be flooded with a lot of extra details that have minimal benefit to you. It's why I try to keep the watchlist short, I write with the assumption that you already know most of these marginal details.\n\nThe average person who is \"invested\" usually doesn't look at their portfolio every day, they're more longterm focused. Also, these levels I'm interested in are worth watching even as an equity trader (I am an equity trader), I rarely trade options but I want to bring value to people who trade options as well because options are just a derivative of equities (obviously).",
          "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lae2jj2/",
          "created": 1719421950,
          "depth": 1,
          "replies": [
            {
              "id": "laf7ia9",
              "score": 3,
              "body": "Thanks for explaining that makes a lot of sense! There are lots of little factors at play (that more experienced traders are probably aware of) that you are basing these lists on.",
              "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/laf7ia9/",
              "created": 1719435291,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ladvwy2",
          "score": 3,
          "body": "He is referring to options. He's a trader, not an investor (ie short term trades with options, not holding for the long term)",
          "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/ladvwy2/",
          "created": 1719419693,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ladki2n",
      "score": 5,
      "body": "NVDA shareholders meeting today too. No telling how tomorrow opens",
      "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/ladki2n/",
      "created": 1719415933,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laf3nkz",
      "score": 2,
      "body": "GOAT",
      "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/laf3nkz/",
      "created": 1719434048,
      "depth": 0,
      "replies": [
        {
          "id": "lafm0o3",
          "score": 2,
          "body": "BAAAAAAAA",
          "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lafm0o3/",
          "created": 1719440214,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lafmgg2",
      "score": 2,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lafmgg2/",
      "created": 1719440371,
      "depth": 0,
      "replies": [
        {
          "id": "lafnsak",
          "score": 0,
          "body": "What do you think ?",
          "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lafnsak/",
          "created": 1719440844,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laiueqg",
      "score": 2,
      "body": "With the debate tonight I got back into DJT. After being on the sidelines past few weeks (thankfully)",
      "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/laiueqg/",
      "created": 1719496916,
      "depth": 0,
      "replies": [
        {
          "id": "laius5n",
          "score": 2,
          "body": "I didn't watch the debate, was it interesting?",
          "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/laius5n/",
          "created": 1719497054,
          "depth": 1,
          "replies": [
            {
              "id": "laixx8y",
              "score": 2,
              "body": "It will be tonight. So it's Def a gamble, But seeing it regain traction earlier this week has me hopeful !",
              "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/laixx8y/",
              "created": 1719498166,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "laddzb6",
      "score": 3,
      "body": "BB earnings after market close.",
      "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/laddzb6/",
      "created": 1719413747,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ladiadk",
      "score": 2,
      "body": "What happened to AVGO recently..",
      "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/ladiadk/",
      "created": 1719415201,
      "depth": 0,
      "replies": [
        {
          "id": "ladm3on",
          "score": 4,
          "body": "stocks go up and down",
          "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/ladm3on/",
          "created": 1719416463,
          "depth": 1,
          "replies": [
            {
              "id": "laduo88",
              "score": 1,
              "body": "I know! Just wanted to understand deeper : because they sometimes go down due to performance, sometimes due to profit taking and such",
              "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/laduo88/",
              "created": 1719419282,
              "depth": 2,
              "replies": [
                {
                  "id": "ladzdpb",
                  "score": 1,
                  "body": "Looking at past charts it's done this before - big spike followed with a decent sell off. Id imagine it will start to bottom out and then start growing again.",
                  "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/ladzdpb/",
                  "created": 1719420895,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lafnxn6",
          "score": 1,
          "body": "Agriculture needs rate drop for new equipt. financing.",
          "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lafnxn6/",
          "created": 1719440897,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lads3ev",
      "score": 1,
      "body": "Why not invest in ISGR and Lilly that a more room to grow?",
      "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lads3ev/",
      "created": 1719418438,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laedhpa",
      "score": 1,
      "body": "What will MU report?  I have a bad feeling only because they went up like AI, but only a small percentage of their business is in AI",
      "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/laedhpa/",
      "created": 1719425519,
      "depth": 0,
      "replies": [
        {
          "id": "laee4t0",
          "score": 2,
          "body": "6 pm est.",
          "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/laee4t0/",
          "created": 1719425732,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laedk7r",
      "score": 1,
      "body": "Thank you",
      "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/laedk7r/",
      "created": 1719425543,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laikewj",
      "score": 1,
      "body": "I’d get into trouble watching an options trader.",
      "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/laikewj/",
      "created": 1719493056,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laddiyj",
      "score": 0,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/laddiyj/",
      "created": 1719413580,
      "depth": 0,
      "replies": [
        {
          "id": "ladq3i2",
          "score": 2,
          "body": "did you even read his post",
          "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/ladq3i2/",
          "created": 1719417775,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lae6m02",
      "score": -4,
      "body": "Was this list available anywhere yesterday? These things popped at open, would have been helpful to get this yesterday before close….",
      "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lae6m02/",
      "created": 1719423284,
      "depth": 0,
      "replies": [
        {
          "id": "lafo9c4",
          "score": 4,
          "body": "You are getting a list for free on Reddit and you have complaints about timeliness ?\n\nThere are a lot of newsletters, daily sheets  available for cash.  Pay up for better and timely info.",
          "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lafo9c4/",
          "created": 1719441014,
          "depth": 1,
          "replies": [
            {
              "id": "lafqqvv",
              "score": 0,
              "body": "Yes. There’s an epidemic on here of people posting after a run up. It’s either farming for upvotes, a pump and dump, or someone who doesn’t know any better and they need to be told.",
              "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lafqqvv/",
              "created": 1719441925,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lae81jh",
          "score": 7,
          "body": "If I could tell you how these stocks on the watchlist would move yesterday before close then I'd be able to see the future lol.",
          "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lae81jh/",
          "created": 1719423752,
          "depth": 1,
          "replies": [
            {
              "id": "lafquuj",
              "score": 1,
              "body": "Sorry man, there’s just a real problem on here of people posting after a run up.",
              "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lafquuj/",
              "created": 1719441967,
              "depth": 2,
              "replies": [
                {
                  "id": "lai1ein",
                  "score": 1,
                  "body": "You can usually tell when people are trying to boost a stock and can check if it has ran already. This info is good information on companies that are in the headlines. Always do your own due diligence. Thanks Op for the info.",
                  "permalink": "/r/stocks/comments/1doyj8b/these_are_the_stocks_on_my_watchlist_626/lai1ein/",
                  "created": 1719483324,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}