{
  "title": "Levi's shares drop 12% as jeans maker's sales disappoint despite denim craze ",
  "score": 182,
  "selftext": "Denim is having a moment with consumers, but it hasn’t led to a major sales boost at Levi Strauss. \n\nThe jeans creator on Wednesday posted fiscal second-quarter revenue that fell just short of Wall Street’s expectations at a time when shoppers are stocking their wardrobes with denim dresses, skirts and ultra low-rise baggy pants. \n\nLevi’s posted better-than-expected earnings as its direct sales to consumers and cost cutting continue to bear fruit. The company raised its dividend by 8% to 13 cents per share, its first increase in six quarters.\n\nStill, shares fell about 12% in extended trading.\n\nHere’s how Levi’s performed during the quarter compared with what Wall Street was anticipating, based on a survey of analysts by LSEG:\n\nEarnings per share: 16 cents adjusted vs. 11 cents expected\nRevenue: $1.44 billion vs. $1.45 billion expected\nThe company’s reported net income for the three-month period that ended May 26 was $18 million, or 4 cents per share, compared with a loss of $1.6 million, or zero cents a share, a year earlier. Excluding one-time items, Levi’s posted earnings of $66 million, or 16 cents per share. \n\nSales rose to $1.44 billion, up about 8% from $1.34 billion a year earlier. However, the sales jump was coming off of an easier comparison.\n\nIn the year-ago period, sales were down 9% after Levi’s shifted its wholesale shipments from its fiscal second quarter into its fiscal first quarter. The shift reduced sales last year by about $100 million, the company said previously. Excluding the shift, as well as the exit of Levi’s Denizen business, sales would have been up by only about 1% in its most recent quarter compared to the year-ago period. \n\nFinance chief Harmit Singh attributed the sales miss to unfavorable foreign exchange conditions and weak sales at Docker’s. During the quarter, the khaki and chinos brand saw $82.4 million in sales, up 8.6% from $75.8 million in the year ago period. It’s not clear how sales at Docker’s were affected by the timing of Levi’s wholesale orders. \n\n“People are generally cautious,” Singh told CNBC in an interview. “It’s not necessarily an environment where people are buying a lot, people are cautious.”\n\nWhile Levi’s posted a strong earnings beat, it only reaffirmed its full-year guidance, which was in line with estimates. The company continues to expect full-year earnings per share to be between $1.17 and $1.27, which now includes a 5-cent hit coming from the company’s new distribution and logistics strategy. \n\nLevi’s said it is transitioning from a primarily owned-and-operated distribution and logistics network in the U.S. and Europe to one that relies more on third parties. \n\n“In the near term, these changes require the parallel operation of new and old facilities for the rest of 2024, resulting in a transitory increase in distribution costs,” the company said. \n\nThe change allows Levi’s to shift the responsibility of final mile delivery to third parties. The denim maker noted that it has new terms with its supplier that result in Levi’s taking ownership of inventory closer to the point of shipment rather than its eventual destination. Levi’s distribution network was built for a business that primarily sold to wholesalers, and now it needs to change into one that’s more focused on selling directly to consumers.\n\nThe changes are necessary because nearly half of Levi’s sales these days are coming from its own website and stores.\n\nDirect-to-consumer sales jumped 8% during the quarter, representing 47% of overall sales. Online sales increased 19%.\n\n“Our transformational pivot to operating as a DTC-first company is yielding positive results around the world, giving me great confidence that we will achieve accelerated, profitable growth for the rest of the year and beyond,” CEO Michelle Gass said in a statement. \n\nDuring the quarter, wholesale revenue grew 7%, but excluding the shift in timing of wholesale orders, sales in the channel decreased 4%. Singh noted that wholesale revenue improved on a sequential basis, but the company has a “conservative” view of the channel’s growth moving forward.\n\nBy building out its own direct channels, Levi’s enjoys higher profits, better data on its consumers and less reliance on shaky wholesalers like Macy’s and Kohl’s, which are continuing to shrink and fall out of favor with consumers. \n\nHowever, selling directly can also be more expensive, and can come with unexpected hiccups that can impact sales and drain profits. For example, when someone buys a pair of Levi’s from Macy’s and wants to return them, Macy’s typically bears that cost. Under a direct model, that responsibility, including the cost and logistics, would fall on Levi’s. \n\nNike has come to be known as a cautionary tale for retailers long reliant on wholesalers that try to expand direct sales. \n\nFor a while, Nike’s focus on direct sales boosted revenue and profits, but some critics said the strategy shift led to a slowdown in innovation, and ultimately, market share losses. \n\nRecently, the company acknowledged that it erred when it cut off so many of its wholesale partners and said it has since “corrected” that. \n\nSource: https://www.cnbc.com/2024/06/26/levi-levi-earnings-q2-2024.html",
  "link_flair_text": null,
  "id": "1dpb3ip",
  "num_comments": 59,
  "created_utc": 1719439841,
  "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/",
  "comments": [
    {
      "id": "lafx9f9",
      "score": 189,
      "body": "huh. what craze lol",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lafx9f9/",
      "created": 1719444365,
      "depth": 0,
      "replies": [
        {
          "id": "lagt1cp",
          "score": 41,
          "body": "17% yoy in the Americas... thats pretty impressive though not surprising honestly. Trends come and go all the time after all.\n\nBut the issue is there is only so much growth to be had in the Americas. For LEVI to get to another level, they need international to grow and that doesnt seem to be working.",
          "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lagt1cp/",
          "created": 1719456779,
          "depth": 1,
          "replies": [
            {
              "id": "laifwbd",
              "score": 13,
              "body": "Because they are expensive and lose the market share to cheaper alternatives, even local manufacturing.\n\nI have the jeans I'm wearing right now for 5 years and they're not Levi's.",
              "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/laifwbd/",
              "created": 1719491110,
              "depth": 2,
              "replies": [
                {
                  "id": "laiwl7w",
                  "score": 15,
                  "body": "Their overall quality seem to be really inconsistent. Some pair holds long, some break immediately, all cost the same.",
                  "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/laiwl7w/",
                  "created": 1719497703,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lak6qd7",
                  "score": 1,
                  "body": "I've seen a fair bit more on the flip side, premium denim. Like hundreds of dollars for one item denim.",
                  "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lak6qd7/",
                  "created": 1719512835,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lahm7vx",
          "score": 7,
          "body": "Go get your new Denim underwear before it’s sold out",
          "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lahm7vx/",
          "created": 1719472689,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lahrc5k",
          "score": 3,
          "body": "Short answer? Beyoncé put out a country inspired album and some people think there is going to be a cowboy-esque fashion renaissance",
          "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lahrc5k/",
          "created": 1719476332,
          "depth": 1,
          "replies": [
            {
              "id": "lai8wj9",
              "score": 5,
              "body": "Yea people are already over that album ",
              "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lai8wj9/",
              "created": 1719487734,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lah0o64",
      "score": 59,
      "body": "Quality is awful now.  My most recent ones lasted about 6 months before the crotch ripped out",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lah0o64/",
      "created": 1719460192,
      "depth": 0,
      "replies": [
        {
          "id": "lahjc44",
          "score": 17,
          "body": "Ok I thought I was the only one with this issue until this thread, it’s crazy how fast they go out.",
          "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lahjc44/",
          "created": 1719470775,
          "depth": 1,
          "replies": []
        },
        {
          "id": "laid17l",
          "score": 1,
          "body": "I’ve never purchased a pair of Levi’s. My gf grandma got me a pair for Christmas and I hate them. Lee, wrangler, and urban pipeline are much better jeans imo",
          "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/laid17l/",
          "created": 1719489777,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lak8w10",
          "score": -1,
          "body": "maybe it is not jean's fault ;)",
          "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lak8w10/",
          "created": 1719513530,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lagids4",
      "score": 68,
      "body": "I’ve worn Levi’s for decades. The last pair of Red Tag Levi’s jeans I bought are absolute garbage. Never again. Quality is gone. I hope their stock collapses. Someone else buys the company and brings back quality, made in the USA jeans. Very disappointing.",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lagids4/",
      "created": 1719452497,
      "depth": 0,
      "replies": [
        {
          "id": "lahizap",
          "score": 13,
          "body": "Yep, I confirm, only wore Levi’s, until 3-4 years ago, when a pair would never last longer than 6 months. It has the same quality as the cheap fast fashion at Zara.",
          "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lahizap/",
          "created": 1719470542,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lalxt6m",
          "score": 1,
          "body": "Ok I have worn their 511 model and I agree the quality is shit now but I haven’t found a good replacement for the fit. Any ideas?",
          "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lalxt6m/",
          "created": 1719534658,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lafpj3q",
      "score": 74,
      "body": "I thought I was joking but now I see that all you do is cut-n-paste CNBC every day .",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lafpj3q/",
      "created": 1719441481,
      "depth": 0,
      "replies": [
        {
          "id": "lafq4n4",
          "score": 47,
          "body": "Better than people asking the same stupid questions like \"what stonk will go up\" constantly.",
          "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lafq4n4/",
          "created": 1719441700,
          "depth": 1,
          "replies": [
            {
              "id": "lafroe7",
              "score": 29,
              "body": "CAN WE PLEASE TALK ABOUT INTEL AND/OR PAYPAL PLZ THO, WILL IT COME BACK??",
              "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lafroe7/",
              "created": 1719442268,
              "depth": 2,
              "replies": [
                {
                  "id": "lafseir",
                  "score": 24,
                  "body": "What's funny is those threads get hundreds of comments, but the one sincere post with DD is 30% upvoted, gets 5 comments, and is then removed",
                  "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lafseir/",
                  "created": 1719442536,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lagi0ep",
                      "score": 5,
                      "body": "That's more of a reflection of the mentality of the average poster in here 😂",
                      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lagi0ep/",
                      "created": 1719452351,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lai2ipl",
              "score": 4,
              "body": "THESE ARE MY DAILY STOCK PICKS",
              "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lai2ipl/",
              "created": 1719484039,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lafrv0u",
          "score": 7,
          "body": "At least hook us up with the paid articles OP",
          "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lafrv0u/",
          "created": 1719442335,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lahu0e0",
          "score": 1,
          "body": "How do we know this isn't an employee of CNBC?",
          "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lahu0e0/",
          "created": 1719478243,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lah8z0w",
      "score": 10,
      "body": "The quality, fit and comfort has gone to shit compared to others.",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lah8z0w/",
      "created": 1719464493,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lag8wyg",
      "score": 14,
      "body": "I guess their transition into “lifestyle” brand is not going great.",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lag8wyg/",
      "created": 1719448843,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lagdbqe",
      "score": 5,
      "body": "Just rebrand to SuperLevis",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lagdbqe/",
      "created": 1719450520,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lafo4t3",
      "score": 10,
      "body": "Beyond Yoga revenue for the quarter was $33 million. I'm sure Lululemon is shaking, quivering, and trembling in their boots! /s",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lafo4t3/",
      "created": 1719440968,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lagog67",
      "score": 3,
      "body": "It's called people want what they can't afford, the question is why can't they afford it...",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lagog67/",
      "created": 1719454905,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lahgvgm",
      "score": 4,
      "body": "Fast fashion is a doomed sector. We produce enough textiles for 6 generations, and the demand depends on over consumerism",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lahgvgm/",
      "created": 1719469185,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laigjfe",
      "score": 4,
      "body": "Yep, modern levis are not good. Vintage USA made levis on the other hand, are the best.",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/laigjfe/",
      "created": 1719491398,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lafs7m0",
      "score": 7,
      "body": "Levi is a good name and has not been entirely destroyed, quality at a fair price is where they came from and need to get back to.",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lafs7m0/",
      "created": 1719442464,
      "depth": 0,
      "replies": [
        {
          "id": "lag9fyv",
          "score": 32,
          "body": "oh no their jeans are garbage now. They were great 15 years years ago - used to last forever - but now they fall apart in a year",
          "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lag9fyv/",
          "created": 1719449043,
          "depth": 1,
          "replies": [
            {
              "id": "lage40e",
              "score": 12,
              "body": "Agreed, that’s the whole “get back” to part…they need to recover or go away but those rayon mixed jeans have got to go.",
              "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lage40e/",
              "created": 1719450827,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "laiy7dm",
      "score": 2,
      "body": "I bought a pair a few days ago. A belt loop tore off after one (1) day of wearing them. They’ve very clearly decided to let the quality go to zero. I’m not paying $250 for a pair from their top of the line jeans that only gets stocked in high end department stores- $100 is way enough for “base” model already. No more.\n\nSee: RayBan and Luxotica",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/laiy7dm/",
      "created": 1719498264,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajgb6l",
      "score": 2,
      "body": "Can find better quality from other brands nowadays",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lajgb6l/",
      "created": 1719504288,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajzsq9",
      "score": 2,
      "body": "I’ve worn Levi’s for fourty years . I’m done the quality is horrible. I can buy good quality made in Oklahoma jeans for fifty bucks . It makes me sad but I hope Levi’s goes broke",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lajzsq9/",
      "created": 1719510595,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laghxxm",
      "score": 2,
      "body": "Had a huge run, up 2X off the lows. Corrections are normal",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/laghxxm/",
      "created": 1719452324,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lalxtke",
      "score": 1,
      "body": "Ok I have worn their 511 model and I agree the quality is shit now but I haven’t found a good replacement for the fit. Any ideas?",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lalxtke/",
      "created": 1719534663,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lawfzq2",
      "score": 1,
      "body": "Their jeans are like $100 now. I wait for sales and even then, I wait for the sale to become a sale. They've gone nuts on pricing.",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lawfzq2/",
      "created": 1719701984,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lagb55k",
      "score": -14,
      "body": "Craze? Barely any one wears denim anymore",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lagb55k/",
      "created": 1719449689,
      "depth": 0,
      "replies": [
        {
          "id": "lagi6k6",
          "score": 18,
          "body": "How old are a lot of you saying this? Because practically everyone who's fit and under 25 that's into image and fashion does. That's the majority of the worldwide audience. They aren't targeting 50-year-old fat people or permanent introverts that don't leave their apartment",
          "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lagi6k6/",
          "created": 1719452418,
          "depth": 1,
          "replies": [
            {
              "id": "lago93d",
              "score": 8,
              "body": "Denim never really goes out of style - just different cuts seem to come and go. People been wearing denim over 100 years now.",
              "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lago93d/",
              "created": 1719454826,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lagw639",
              "score": -1,
              "body": "How big is that group since you have a lot of qualifiers. I don't know many under 25 granted, but over 30 jeans are harder to come by. For those into image/fashion pants look better. For those who are into comfort pretty much anything else works better then jeans.\n\nWhen you look at women, jeans don't seem to exist at all anymore.",
              "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lagw639/",
              "created": 1719458121,
              "depth": 2,
              "replies": [
                {
                  "id": "lajir9e",
                  "score": 3,
                  "body": "This is so hilariously out of touch😂\n\nDenim is super popular globally right now with the y2k baggy denim trend\n\nAlso if your jeans aren’t comfortable you need to buy better quality jeans.",
                  "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lajir9e/",
                  "created": 1719505082,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lajjwkh",
                      "score": 0,
                      "body": "Or where I live clothing trends are different.",
                      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lajjwkh/",
                      "created": 1719505453,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lajkeue",
                          "score": 2,
                          "body": "Trends are global now. Go on any fashion subreddit and you will see lots of denim.\n\nAlso you just argued against your original comment lol",
                          "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lajkeue/",
                          "created": 1719505614,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lah1sp1",
                  "score": -1,
                  "body": "It's a global market. You also have seasonal cyclicality. Wasn't that long ago this stock was 12 bucks. Got up to 24 or so. I mean that's a 100% gain full stop \n\nSells off a little bit, we will see where it goes, it's a great company to pick up on weakness. Typically I accumulate under 15. Between 15 and 20 is kind of the yellow zone. It's not really a great enough deal to make me want to buy it nor a high enough deal to make me want to sell it but it works really well in an add / reduce strategy \n\nWhat got them to sell off after hours was the statement about consumers being generally cautious and they aren't spending a lot on discretionary items. 100% true but that goes way beyond jeans. There's a pretty reasonable chance that we're in a recession right now and 6 months from now they will tell us about it. Everyone from realtors to small businesses to just general spending seems down and before long it should show up in the data. The question on everyone's mind is will the Fed preemptively start cutting next month being aware of this because if I know it, they certainly do. If they wait until September when it's blatantly obvious. Stocks might not have the best time and at least personally speaking. I would want a good deal of bond exposure especially as good of a deal as TLT is right here. The rapid gains in that can feed good deals in stocks because like I said if they wait until September or they wait until it's blatantly obvious. They aren't doing 25 point cuts it's going to be like 50 to 100 and panic mode, oops what happened s&p is down 20%. Hopefully we don't get to that point",
                  "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lah1sp1/",
                  "created": 1719460735,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lagk2w8",
              "score": -2,
              "body": "How heavy are your denim bags?",
              "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lagk2w8/",
              "created": 1719453168,
              "depth": 2,
              "replies": [
                {
                  "id": "lagkpvn",
                  "score": 3,
                  "body": "Hopefully heavier, I've traded around this position since ipo. Very cyclical stock. Short in the money calls on the few hundred shares I have. Those are going to expire in January, also short $15 January puts. Would love to load up there again. This is actually one of my favorite companies to trade because there is good volatility in the options You have this slightly upward trending range bound behavior on the weekly. You sell it when it rallies and you buy it when it plummets. There's a lot of volatility to be had. I kind of doubt it's going to get back to the $15 range in the next few months but if it does that would be amazing",
                  "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lagkpvn/",
                  "created": 1719453417,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lahwd6d",
          "score": 2,
          "body": "You can not go anywhere where I live without seeing someone in jeans",
          "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lahwd6d/",
          "created": 1719479943,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laftiwp",
      "score": -39,
      "body": "Levi’s once covered the masses of asses in this country. Need to move the corporate HQ out of San Fran, and hire some non woke executives! Another iconic American company destroyed by liberals. I bet Levi Strauss is rolling in his grave.",
      "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/laftiwp/",
      "created": 1719442953,
      "depth": 0,
      "replies": [
        {
          "id": "lag29ay",
          "score": 1,
          "body": "Oh shit I didn’t realize Levi’s went woke. What did they do?",
          "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lag29ay/",
          "created": 1719446288,
          "depth": 1,
          "replies": [
            {
              "id": "lagtiag",
              "score": 7,
              "body": "They did nothing worth mentioning. I find it hilarious how sensitive all these so called, straight alpha males are. Everything seems to hurt their feelings. They might as well be 5 year old girls. \n\nEvery time you hear that word come out of a mouth, you can pretty much assume the owner of said mouth has a lower IQ than my left testicle.",
              "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lagtiag/",
              "created": 1719456978,
              "depth": 2,
              "replies": [
                {
                  "id": "lamom8i",
                  "score": 1,
                  "body": "That may be true but I don’t want my jeans to be political or anything :/",
                  "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lamom8i/",
                  "created": 1719546325,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lagfboz",
          "score": -1,
          "body": "You know that Levi would be doing today if he was alive don’t you?",
          "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lagfboz/",
          "created": 1719451299,
          "depth": 1,
          "replies": [
            {
              "id": "lal6ybo",
              "score": 1,
              "body": "Do tell!",
              "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lal6ybo/",
              "created": 1719524702,
              "depth": 2,
              "replies": [
                {
                  "id": "lalupbb",
                  "score": 1,
                  "body": "Knocking on the coffin lid",
                  "permalink": "/r/stocks/comments/1dpb3ip/levis_shares_drop_12_as_jeans_makers_sales/lalupbb/",
                  "created": 1719533447,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}