{
  "title": "Walgreens cuts profit guidance on 'challenging' pharmacy, consumer environment",
  "score": 52,
  "selftext": "Walgreens on Thursday reported fiscal third-quarter earnings that fell short of expectations and slashed its full-year adjusted profit outlook, citing a “challenging” environment for pharmacies and U.S. consumers.\n\nThe retail pharmacy giant now expects fiscal 2024 adjusted earnings of $2.80 to $2.95 per share. That compares with the company’s previous outlook of between $3.20 and $3.35 per share.\n\n″’We assumed.. in the second half that the consumer would get somewhat stronger” but “that is not the case,” Walgreens CEO Tim Wentworth told CNBC. \n\nHe added that “the consumer is absolutely stunned by the absolute prices of things, and the fact that some of them may not be inflating doesn’t actually change their resistance to the current pricing. So we’ve had to get really keen, particularly in discretionary things.” \n\nStill, Walgreens topped revenue estimates for the quarter on strong performance in its health-care segment. The company views that business division as critical to its ongoing push to transform from a major drugstore chain into a large health-care company. \n\nThe results come as Walgreens works to slash costs after a rocky last year marked by low pharmacy reimbursement rates, weakening demand for Covid products and a challenging macroeconomic environment. \n\nThe company on Friday said it is simplifying its U.S. health-care portfolio and finalizing plans to close underperforming U.S. stores over multiple years, among other ongoing cost-cutting efforts. \n\n“75% of our stores drive 100% of our profitability today,” Wentworth said. “What that means is the others we take a hard look at, we are going to finalize a number that we will close…”\n\nHere’s what Walgreens reported compared with what Wall Street was expecting, based on a survey of analysts by LSEG:\n\nEarnings per share: 63 cents adjusted vs. 68 cents expected\n\nRevenue: $36.4 billion vs. $35.94 billion expected\n\nWalgreens booked sales of $36.4 billion for the quarter, up 2.6% from the same period a year ago. \n\nThe company reported a net income of $344 million, or 40 cents per share, for the quarter. That compares with a net income of $118 million, or 14 cents per share, for the same period a year ago.\n\nExcluding certain items, adjusted earnings were 63 cents per share for the quarter. \n\nWalgreens did not provide a new revenue forecast for the fiscal year. The company has not offered that guidance since October, when it said it expected $141 billion to $145 billion in sales. \n\nStrong performance in health-care division \n\nWalgreens reported growth across its three business divisions in the fiscal third quarter. But the company’s U.S. health-care unit stood out, as sales jumped 7.6% compared with the same period a year ago. \n\nRevenue for the segment came in at $2.13 billion. Analysts had expected sales of $2.08 billion, according to estimates compiled by FactSet. \n\nThe company said the higher sales reflect primary care provider VillageMD and specialty pharmacy company, Shields Health Solutions. Shields saw sales jump 24% during the period, driven by growth within existing partnerships.\n\nSpecialty pharmacies are designed to deliver medications with unique handling, storage and distribution requirements, often for patients with complex conditions such as cancer and rheumatoid arthritis.\n\nThose results come one quarter after Walgreens posted a steep net loss as it recorded a hefty nearly $6 billion charge related to the decline in value of its investment in VillageMD. The company now plans to shutter 160 VillageMD clinics, executives announced during the company’s fiscal second-quarter earnings call in March. \n\n“We are working with their management team to ultimately still be an investor, but meaningfully reduce our investment as well as gain some liquidity so that we can invest back in the retail pharmacy business that represents our future,” Wentworth told CNBC of the company’s investment in VillageMD.\n\nWalgreens’ U.S. retail pharmacy segment generated $28.5 billion in sales in the fiscal third quarter, an increase of 2.3% from the same period last year. Analysts had expected sales of $28.34 billion, according to estimates compiled by FactSet. \n\nThat segment operates more than 8,000 drugstores across the U.S., which sell prescription and nonprescription drugs as well as health and wellness, beauty, personal care, and food products.  \n\nThe company said that sales growth came entirely from comparable pharmacy sales and partially offset by a decline in retail revenue.\n\nWalgreens said pharmacy sales for the quarter rose 4.4% and comparable pharmacy sales increased 5.7% compared to the year-earlier period due to price inflation in brand medications and prescription growth. \n\nTotal prescriptions filled in the quarter including vaccines totaled 306.4 million, a 0.5% increase from the same period a year ago. \n\nRetail sales for the quarter fell 4% from the prior-year quarter, and comparable retail sales declined 2.3%. The company pointed to a “challenging” retail environment, among other factors. \n\nWalgreens’ international segment, which operates more than 3,000 retail stores abroad, posted $5.73 billion in sales in the fiscal third quarter. That’s an increase of 2.8% from the year-ago period.\n\nSource: https://www.cnbc.com/2024/06/27/walgreens-wba-earnings-q3-2024.html",
  "link_flair_text": null,
  "id": "1dpon89",
  "num_comments": 30,
  "created_utc": 1719486468,
  "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/",
  "comments": [
    {
      "id": "laiqcx2",
      "score": 13,
      "body": "Expensive products, slow employees, annoying checkout, the only benefit they have over the likes of Walmart is their pharmacy, which Walmart can easily fix. Walmart neighborhood markets essentially end the need for Walgreens. \n\nA company selling the same shit as dollar general for 25-100% the price is not sustainable. I don't like that they tried to put this on the consumer so their shareholders can pretend management is not the issue. They need to make big changes to compete now but they're running off the same business model when the environment is changing.",
      "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laiqcx2/",
      "created": 1719495409,
      "depth": 0,
      "replies": [
        {
          "id": "lan1x9v",
          "score": 2,
          "body": "They usually have like 2 employees working at a time",
          "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/lan1x9v/",
          "created": 1719553580,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laix8gw",
      "score": 23,
      "body": "I hate this whole segment as stocks:\n\nPharmacy - doesn't make much, if any money. Huge regulatory hurdles and risks. Rise of online pharmacies with same day delivery limiting their market.\n\nRetail - Younger consumers are eschewing the corporatized, sterile, often strip mall setting of these chains. For their urban stores, they are targets of theft, and don't provide the consumer with any real benefit compared to bodegas/corner stores etc. Prices are largely not competitive with grocery stores.\n\nI see this whole model of business as a dinosaur.",
      "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laix8gw/",
      "created": 1719497928,
      "depth": 0,
      "replies": [
        {
          "id": "lajct6u",
          "score": 1,
          "body": "I hate it, too. Except I am employed in it, so I have to take an active interest.",
          "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/lajct6u/",
          "created": 1719503152,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laig6w2",
      "score": 12,
      "body": "expansion worry normal gold spoon edge knee fear bewildered gaping\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
      "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laig6w2/",
      "created": 1719491239,
      "depth": 0,
      "replies": [
        {
          "id": "lajcisb",
          "score": 3,
          "body": "I believe they own two PBMs so have some pricing power in this environment. They appear to be the strongest of the group.",
          "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/lajcisb/",
          "created": 1719503057,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laidvg5",
      "score": 5,
      "body": "I’ll be the optimist:  Higher revenue than expected. Recognizing that you can cut cost and kill dead stores(mentioned 100% of profits come from 75% of stores). \n\nWe’ve been saying for years that eventually consumers will be tapped out and we’ve now heard multiple retail, food, etc CEOs say we’ve seemingly hit that point so if you’ve been expecting that then this news checks out. \n\nVillageMD outperformed. Sales projected goals still look obtainable. I’m not saying it’s the strongest stock in the world, but I think it’s worth a look at this new price. It can’t all be Microsoft 😂",
      "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laidvg5/",
      "created": 1719490176,
      "depth": 0,
      "replies": [
        {
          "id": "laiehok",
          "score": 6,
          "body": "Infinitely cutting costs is what got them in this mess",
          "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laiehok/",
          "created": 1719490465,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lai863t",
      "score": 3,
      "body": "Dumpster fire with a lot of debt",
      "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/lai863t/",
      "created": 1719487345,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laic3bm",
      "score": 3,
      "body": "Hopefully they got bought by a bigger company, but still a good price to buy in and even with negative yearly growth that dividend is still worthwhile",
      "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laic3bm/",
      "created": 1719489326,
      "depth": 0,
      "replies": [
        {
          "id": "laj474g",
          "score": 6,
          "body": "A stock that has been on a downfall since 2015, with only a 6% dividend is not worthwhile, especially with bills hovering around 5%. It is absolutely terrible to buy this company.",
          "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laj474g/",
          "created": 1719500302,
          "depth": 1,
          "replies": []
        },
        {
          "id": "laii11l",
          "score": 5,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laii11l/",
          "created": 1719492053,
          "depth": 1,
          "replies": [
            {
              "id": "lajobhm",
              "score": 2,
              "body": "CVS will be allowed if it's between bankruptcy or acquisition. Some of the large healthcare companies like Cigna and UNH have pharmacies, and maybe they want to create the same pipeline as CVS has.",
              "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/lajobhm/",
              "created": 1719506871,
              "depth": 2,
              "replies": [
                {
                  "id": "lakac87",
                  "score": 1,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/lakac87/",
                  "created": 1719513996,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lalwr3k",
                      "score": 1,
                      "body": "They'll close down a ton, sell of a few others, integrate some, ect. It's gonna be a lot getting shut down, or all getting shut down. Pick your poison really.",
                      "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/lalwr3k/",
                      "created": 1719534247,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lajqp3x",
              "score": 1,
              "body": "I'd be thinking Amazon as well if it really becomes an aquisition target. They are slowing rolling out store concepts, and could quickly gain 8000+ locations. They would modify them to an Amazon Health concept with a onside pharmacy. Offer same day prescriptions pick-up to people that already use Amazon for their prescriptions.",
              "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/lajqp3x/",
              "created": 1719507637,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "laifkjf",
          "score": 4,
          "body": "Until they cut it further which they already did...",
          "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laifkjf/",
          "created": 1719490962,
          "depth": 1,
          "replies": []
        },
        {
          "id": "laiu2jc",
          "score": 0,
          "body": "a bigger company? they're #27 in the fortune 500\n\nalso what competition would there be for pharmacies in the US if they did?",
          "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laiu2jc/",
          "created": 1719496790,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lajj5eq",
      "score": 1,
      "body": "Walgreens sucks",
      "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/lajj5eq/",
      "created": 1719505208,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lan1ppu",
      "score": 1,
      "body": "There’s a Walgreens by my house next to a Latino supermarket.  90% of the generics things I would get from walsgreens are 1/3 the price in the supermarket.   ¯\\_(ツ)_/¯",
      "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/lan1ppu/",
      "created": 1719553464,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laol7xs",
      "score": 1,
      "body": "Their pharmacies absolutely suck. It’s the last place I’d send my meds if I needed to have them.",
      "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laol7xs/",
      "created": 1719584051,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laij0k4",
      "score": 1,
      "body": "I wonder if that’s because they’re ABSOLUTE DICKS about scripts?",
      "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laij0k4/",
      "created": 1719492476,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lailj46",
      "score": 1,
      "body": "So why did this bring down CVS? You’d think it would be the opposite",
      "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/lailj46/",
      "created": 1719493515,
      "depth": 0,
      "replies": [
        {
          "id": "laiq05x",
          "score": 4,
          "body": "Consumer pullback affects all stores. Were starting to see belt tightening",
          "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laiq05x/",
          "created": 1719495274,
          "depth": 1,
          "replies": [
            {
              "id": "laiqtmp",
              "score": 2,
              "body": "I’m not sure about Walgreens, but I think the physical store business of CVS isn’t the majority of their business",
              "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laiqtmp/",
              "created": 1719495584,
              "depth": 2,
              "replies": [
                {
                  "id": "laivrh3",
                  "score": 2,
                  "body": "Walgreens has that too. But physical store business is an element of their business. Also it looks pretty red across the board today. Might just be one of those days",
                  "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laivrh3/",
                  "created": 1719497408,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "laiui4x",
          "score": 0,
          "body": "Imagine you have Pepsi and Coke, two huge brands of soda, millions and billions of sales. They are competing to have the sugar loaded diabetes can.\n\nPepsi says in their meeting, \"consumers arent buying Pepsi anymore\"\n\nIt's not hard to speculate that because Coke has a similar product, internally, they are having the same results.",
          "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laiui4x/",
          "created": 1719496951,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laiqpkk",
      "score": 1,
      "body": "> “75% of our stores drive 100% of our profitability today,” Wentworth said. \n\nIn other words 25% of their stores are losing money, but they want to put lipstick on a pig so that it doesn't sound quite as bad.\n\n> He added that “the consumer is absolutely stunned by the absolute prices of things, and the fact that some of them may not be inflating doesn’t actually change their resistance to the current pricing. So we’ve had to get really keen, particularly in discretionary things.” \n\nSo they have no pricing power, and can't pass their extra costs onto consumers. Ouch.\n\nI just checked their stock chart, they're down 21.52% today as of this writing, and they're down 52% YTD! Absolutely dreadful performance. \n\nTheir net income charts also look dreadful, alternating from barely any net incoming some quarters, to losing billions in net income other quarters.\n\nI can't find anything to like about this dreadful stock and dreadful business. I'm definitely staying far away from it.",
      "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laiqpkk/",
      "created": 1719495541,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laj8wbo",
      "score": 1,
      "body": "prices are up \\~20% and sales increased only 1.3%.  therefore shoppers purchased 18% less from walgreens than in the previous year.",
      "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laj8wbo/",
      "created": 1719501861,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajbnnz",
      "score": 1,
      "body": "\"We assumed ..... the consumer would get somewhat stronger\"\n\nErm OK. Most of the population can't even afford a BigMac now. Get with the programme!",
      "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/lajbnnz/",
      "created": 1719502759,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laioq2m",
      "score": 0,
      "body": "CVS and Walgreens should join forces and just sell weed, alcohol and every drug on the planet.\n\n\nI'm too smart  for these people though",
      "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/laioq2m/",
      "created": 1719494778,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajo2ur",
      "score": 0,
      "body": "Meanwhile CVS's pharmacy just pulled in record revenue and profit last quarter. Not a tough environment, just a really poorly ran company.",
      "permalink": "/r/stocks/comments/1dpon89/walgreens_cuts_profit_guidance_on_challenging/lajo2ur/",
      "created": 1719506794,
      "depth": 0,
      "replies": []
    }
  ]
}