{
  "title": "Walgreens plans store closures as CEO says consumers 'stunned' by prices",
  "score": 643,
  "selftext": "The pharmacy chain's stock has seen steady declines for nearly a decade.\n\nWalgreens is planning potentially sweeping store closures as it faces what its CEO called a “challenging” environment for pharmacies and U.S. consumers.\n\nThe pharmacy chain on Thursday morning announced quarterly earnings that fell short of Wall Street expectations. Walgreens' stock dropped more than 20% just minutes into the trading day.\n\nIn an interview with CNBC, CEO Tim Wentworth said the company now forecasts weaker consumer spending for the rest of the year.\n\n″We assumed...in the second half that the consumer would get somewhat stronger” but “that is not the case,\" Wentworth said. \n\n\"The consumer is absolutely stunned by the absolute prices of things, and the fact that some of them may not be inflating doesn’t actually change their resistance to the current pricing,\" he added. \"So we’ve had to get really keen, particularly in discretionary things.\"\n\nLast month, Walgreens, following Target's lead, announced plans to slash prices on some 1,300 items in response to better serve customers it said were increasingly under \"financial strain.\"\n\nWentworth didn't state an exact number of closures, but implied it could be as much as 25% of the chain's approximately 8,600 stores. \n\nhttps://www.nbcnews.com/business/business-news/walgreens-plans-store-closures-ceo-says-consumers-stunned-prices-rcna159208",
  "link_flair_text": null,
  "id": "1dpsgb0",
  "num_comments": 290,
  "created_utc": 1719498043,
  "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/",
  "comments": [
    {
      "id": "laj3bzo",
      "score": 741,
      "body": "They need to become a pharmacy with a convenience store attached and not the other way around, these multiple thousand square foot buildings in expensive areas just don’t make sense",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj3bzo/",
      "created": 1719500013,
      "depth": 0,
      "replies": [
        {
          "id": "laj6e0d",
          "score": 226,
          "body": "You're right about the size of their stores. I've never thought about how big a Walgreens actually is compared to how little I buy when I go in. Also, when I take a look over at posts and comments in the r/walgreensstores sub, I'm far less surprised by the news.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj6e0d/",
          "created": 1719501034,
          "depth": 1,
          "replies": [
            {
              "id": "lajjzlm",
              "score": 110,
              "body": "Bee line right to the pharmacy. Once or twice a year I’d grab a birthday card and gift card",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajjzlm/",
              "created": 1719505480,
              "depth": 2,
              "replies": [
                {
                  "id": "lajxi72",
                  "score": 98,
                  "body": "Bee line right to the pharmacy. Once or twice a year I’d grab a birthday card and gift card\"\n\n\nCorrect!! I have no reason to be in a walgreens other than thr pharmacy. I'm not there to spend $12 on a 12pck of coke or $10 for a box of cereal .....",
                  "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajxi72/",
                  "created": 1719509846,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lakbemy",
                      "score": 16,
                      "body": "I do a decent amount of shopping there but only because of my wife's employee discount! Even with that things come out almost the same as other stores!\n\nGlad I told my wife not to participate in their ESPP, I don't think we could sell fast enough to make the 10% discount worth it!",
                      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakbemy/",
                      "created": 1719514340,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lajrcm5",
                  "score": 9,
                  "body": "Or to get my pictures printed but that’s really it",
                  "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajrcm5/",
                  "created": 1719507849,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lalqrj6",
              "score": 4,
              "body": "The closest Walgreens to me is absolutely tiny and it's only a pharmacy. They sell nothing other than medicine and various medical things.",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lalqrj6/",
              "created": 1719531968,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lalqgwz",
              "score": 2,
              "body": "I mean isn't this why they have the drive thru?\n\n\nWhen I'm picking up medicine I only use the drive-thru and I figured that's what most people did. ",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lalqgwz/",
              "created": 1719531857,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lajr85s",
          "score": 38,
          "body": "The first question that pops into my mind, as I'm ignorant to the profit margins, is this: are Walgreens/CVS set up the way they are because the profit margin on filling prescriptions is super thin? In other words, are they they similar to gas stations in that the money is made off selling the convenience goods, not the gas?",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajr85s/",
          "created": 1719507809,
          "depth": 1,
          "replies": [
            {
              "id": "lalx129",
              "score": 9,
              "body": "[https://finviz.com/quote.ashx?t=WBA&p=d&ty=rv](https://finviz.com/quote.ashx?t=WBA&p=d&ty=rv)\n\nYou can see here that retail accounts for \\~25% of their revenue.\n\nThough pharmacy is 61.68%.\n\nFor [CVS](https://finviz.com/quote.ashx?t=CVS&p=d&ty=rv) their front store is only 6.28% revenue.",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lalx129/",
              "created": 1719534356,
              "depth": 2,
              "replies": [
                {
                  "id": "lamdeot",
                  "score": 6,
                  "body": "I think the q is profits though ",
                  "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lamdeot/",
                  "created": 1719540850,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lalcq33",
              "score": 3,
              "body": "Absolutely",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lalcq33/",
              "created": 1719526744,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lak44wx",
          "score": 19,
          "body": "Walgreens has destroyed their pharmacy business in my area. The pharmacy was the point of their existence as far as I could tell, yet they made the choice to screw that up to save money. There were signs up in my doctor's and dental offices that said they will no longer send prescriptions to Walgreens. They cut the pharmacy staff and pharmacists and techs who will still work there are overworked. I switched my prescriptions to the grocery store. Walgreens used to be THE place to get any prescriptions, but no longer. They still carry the best candy assortment, but I don't really need any candy.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak44wx/",
          "created": 1719512003,
          "depth": 1,
          "replies": [
            {
              "id": "lamd7i5",
              "score": 6,
              "body": "Yep. I switched away from Walgreens a couple years ago because after years of them sucking, I'd finally had to find another pharmacy when I did IVF and kept needing things to happen on time without pharmacists inserting their personal beliefs about whether or not I need a medication in the process.",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lamd7i5/",
              "created": 1719540764,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lale52w",
              "score": 9,
              "body": "I have a sign in my office that states that we will not send prescriptions to Walgreens or CVS. They both suck. My patients hate them and I hate them. It takes forever to speak with a pharmacist about a complicated patient, and they are usually rude. I hope they close the one near my office so that the area independent pharmacies can thrive - because the independents are great about taking care of their customers' needs. Many of my colleagues have similar signs posted.",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lale52w/",
              "created": 1719527246,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lak6xsb",
          "score": 15,
          "body": "With one employee who also has to work the register, shits crazy",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak6xsb/",
          "created": 1719512902,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lajs5y7",
          "score": 25,
          "body": "But hear me out... What if we put the pharmacy on the OPPOSITE corner of the store as the entrance???! That way customers have to walk by all of our other convenience store products with huge markups?",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajs5y7/",
          "created": 1719508115,
          "depth": 1,
          "replies": [
            {
              "id": "lakaeu5",
              "score": 7,
              "body": "That's exactly how it's done in Canadian pharmacies/convenience stores a la \"shoppers drug Mart\"",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakaeu5/",
              "created": 1719514019,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lajphwv",
          "score": 10,
          "body": "Most of the stores, the pharmacy accounts for at least 70% of the revenue which is probably not surprising. The other is just oh I can go get my script and pay a larger premium since I’m already here. Partially why cvs is shifting into the minute clinics and what not. I used to manage CVS in a very busy market and was stunned why they didn’t just expand the pharmacy more and just have it running like a well oil machine. Most of it was just sunk cost into large retail space I feel",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajphwv/",
          "created": 1719507253,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lak59qy",
          "score": 14,
          "body": "Not to mention literally every Walgreens around me (socal suburb) felt mismanaged. They were never pleasant places to shop compared with competitors (who aren't exactly luxury experiences either). They always seemed a little dirty and poorly merchandised. They haven't been nice places to be, by and large.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak59qy/",
          "created": 1719512370,
          "depth": 1,
          "replies": [
            {
              "id": "lakbxol",
              "score": 18,
              "body": "Yeah they do kinda feel like dollar stores ie nobody at the register the cashier is stocking shelves, your looking around like is anywhere here",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakbxol/",
              "created": 1719514512,
              "depth": 2,
              "replies": [
                {
                  "id": "lakzelw",
                  "score": 8,
                  "body": "Too busy stocking because they decided to turn mine into a grocery store.  And 'stocking' is mostly replacing expired stuff, because I never see anyone shopping in the grocery section.   Could be all that thrown out expired stuff.   That's OK, I'm sure they'll blame it on non-existent wild bands of thieves.",
                  "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakzelw/",
                  "created": 1719522126,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lalc40l",
              "score": 2,
              "body": "Yep every time I go to a Walgreens there are always bums or weirdos just loitering around. Maybe bums have a sixth sense where they can sense failing businesses",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lalc40l/",
              "created": 1719526528,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lakarp5",
          "score": 5,
          "body": "They do 99 year long leases on those stores so their leasing prices never go up.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakarp5/",
          "created": 1719514134,
          "depth": 1,
          "replies": [
            {
              "id": "lal8m5e",
              "score": 2,
              "body": "They are at way above market rents for 50 years.  Stupid move on Walgreens part.  It’s been that way since the 1990’s.  Overpaying for real estate.",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lal8m5e/",
              "created": 1719525288,
              "depth": 2,
              "replies": [
                {
                  "id": "lalhe4p",
                  "score": 3,
                  "body": "Or are they using that to pass money to wealthy investors?",
                  "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lalhe4p/",
                  "created": 1719528448,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lak93jt",
          "score": 4,
          "body": "Become a good pharmacy, and I avoid their pharmacy. It's a shitshow at my Walgreens.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak93jt/",
          "created": 1719513597,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lajcl8t",
          "score": 27,
          "body": "The smaller the convenience store part, the higher prices will get due to small batch ordering. They just need to drop the convenience store aspect all together, I've never understood it at all. I only ever go in for a prescription and then immediately leave.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajcl8t/",
          "created": 1719503081,
          "depth": 1,
          "replies": [
            {
              "id": "lajimew",
              "score": 20,
              "body": "Volume of sale isn't necessarily linked to size of store if they focus on a smaller range of inventory with the things that sell well ordering amount shouldn't be a big change, unless you count expired product, which is a loss anyway.\n\nIf anything you have less shipping, electricity, storage , and property overhead with a smaller building and targeted products. \n\nEven if they cut store sizes down and lose sales volume if they have proper regional distribution systems in place they're probably getting the same or very similar deals on big batch orders because you'd be ordering for multiple stores.",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajimew/",
              "created": 1719505039,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lajtiru",
              "score": 7,
              "body": "They can go back to a small convenience store section.  Some of these locations have an essentially a full on grocery store sans the fish and deli counter.",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajtiru/",
              "created": 1719508555,
              "depth": 2,
              "replies": []
            },
            {
              "id": "laji7ys",
              "score": 10,
              "body": "Walgreens is already expensive lol",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laji7ys/",
              "created": 1719504909,
              "depth": 2,
              "replies": []
            },
            {
              "id": "laju8ca",
              "score": 8,
              "body": "Conversely, I only go there for convenience store stuff. Last time I used the pharmacy there was 3 years ago for a COVID shot.",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laju8ca/",
              "created": 1719508788,
              "depth": 2,
              "replies": [
                {
                  "id": "lal0cre",
                  "score": 4,
                  "body": "You are just throwing money away.",
                  "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lal0cre/",
                  "created": 1719522432,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lalgfho",
                      "score": 8,
                      "body": "Convenience stores are for convenience, not good prices.",
                      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lalgfho/",
                      "created": 1719528094,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lakb9c0",
              "score": 2,
              "body": "I think if you use coupons and points there must be some savings as I regularly see people with carts full of sale items",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakb9c0/",
              "created": 1719514292,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lajimi4",
              "score": 2,
              "body": "The same principle as my usual liquor store adding rows of snacks and foot items between the booze and checkout. The convenience store shelves are added revenue. It probably worked at the time when prices were reasonable and shrinkage wasn't dragging down the bottom line.",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajimi4/",
              "created": 1719505040,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lakdx0i",
          "score": 2,
          "body": "They started this 2 years ago. My Walgreens was a test case.   They it closed and was listed for sale and they built a new store next to it much closer to the road and without 100 parking spots. \n\nIt’s 20% of the size.  Like 12 parking spaces and a drive through pharmacy. \n\nMostly just a pharmacy.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakdx0i/",
          "created": 1719515155,
          "depth": 1,
          "replies": []
        },
        {
          "id": "laktxsz",
          "score": 2,
          "body": "Their pharmacy business has been slowly dying for a long time thanks to express scripts and CVS/Caremark.\n\nMost long term medications via private insurance are mail order and those are the money… regular customers.\n\nAnd those two monsters account for a huge chunk of the business.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laktxsz/",
          "created": 1719520342,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lalll1g",
          "score": 2,
          "body": "What? Don't you need to buy shampoo and legos and get a prescription filled immediately?",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lalll1g/",
          "created": 1719530020,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lamd0y3",
          "score": 2,
          "body": "The Walmart pharmacy is typically closer to the store entrance than the Walgreens pharmacy.  ",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lamd0y3/",
          "created": 1719540687,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laj69sn",
      "score": 147,
      "body": "Walgreens is always twice as expensive for the same stuff I can get at the local grocer. I never waste my money there.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj69sn/",
      "created": 1719500995,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajidvr",
      "score": 98,
      "body": "“Everything in our store is 50% more expensive than it is across the road at the grocery store. Weird nobody is giving us any money…”",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajidvr/",
      "created": 1719504962,
      "depth": 0,
      "replies": [
        {
          "id": "lajohgb",
          "score": 48,
          "body": "\"Also, we're now open the same hours as that grocery store and we have only one employee.\"",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajohgb/",
          "created": 1719506926,
          "depth": 1,
          "replies": [
            {
              "id": "lamt86j",
              "score": 11,
              "body": "Yeah the big draw of the Walgreens used to be that it was open 24 hours! But if I can't go by at 11 pm - AND it is closed from like 1-3 - what is even the point",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lamt86j/",
              "created": 1719548935,
              "depth": 2,
              "replies": [
                {
                  "id": "lamyei9",
                  "score": 7,
                  "body": "Yeah, the only time I ever went to Walgreens was for those 1 am nyquil runs. Or when the dog got happy tail at midnight and needed bandages. And I'd pick up some overpriced snacks and stuff while there.\n\nMaybe they should have just invested in an assortment of vending machines accessible at night instead of those dumb screen display fridges. They could have loaded them up with common otc medications, drinks, and snacks.",
                  "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lamyei9/",
                  "created": 1719551635,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "laj2e1l",
      "score": 152,
      "body": "Whether it’s Walgreens or CVS anything non-prescription is simply more there than online or other stores. Sometimes ya pay for it for convenience factor, but in general they are a terrible place to shop. \n\nMaybe they should just be a pharmacy like the rest of the world has their medicine dispensaries and call it a day.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj2e1l/",
      "created": 1719499695,
      "depth": 0,
      "replies": [
        {
          "id": "lajphvf",
          "score": 53,
          "body": "It's not even that convenient in nyc anymore. Everything is behind locks, even the ice cream lol",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajphvf/",
          "created": 1719507252,
          "depth": 1,
          "replies": [
            {
              "id": "lajtqi4",
              "score": 5,
              "body": "problem is it's much cheaper to get your pharmacy orders in different areas. i went to walgreens for years until i found out my local grocery store charged me tons less for my prescriptions. So even if they make it about the pharmacy they better hope people are still willing to pay more to walk into a place less packed",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajtqi4/",
              "created": 1719508626,
              "depth": 2,
              "replies": [
                {
                  "id": "lakga0t",
                  "score": 5,
                  "body": "They won't be able to compete with the grocery stores/Walmart who (if they're doing it correctly) make it far too convenient for one to do all their grocery shopping and then slip by to pickup their scripts too.",
                  "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakga0t/",
                  "created": 1719515928,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lakxo2l",
                  "score": 3,
                  "body": "Also with mail order pharmacy like the one that Mark Cuban started that doesn't take insurance and sell to you at cost +5%, some meds are cheaper than with insurance.",
                  "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakxo2l/",
                  "created": 1719521552,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lakc7lf",
          "score": 9,
          "body": "I went there last month because all I needed was toothpaste. Cheapest tube they had was $5",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakc7lf/",
          "created": 1719514599,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lakss81",
          "score": 3,
          "body": "and near our area anyplace you find a CVS or Walgreens there is a Dollar Store or similar usually in view and that to me is what caught these large format drug stores off guard.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakss81/",
          "created": 1719519972,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laj5p2i",
      "score": 41,
      "body": "Maybe if it didn't take 30 minutes at the checkout line...",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj5p2i/",
      "created": 1719500804,
      "depth": 0,
      "replies": [
        {
          "id": "lajk7vu",
          "score": 47,
          "body": "They are doing this weird thing where the entire store is staffed by 1 maybe 2 people.  Literally the dollar general model with 10x the price on everything.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajk7vu/",
          "created": 1719505554,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lam59jj",
          "score": 2,
          "body": "So true and what's worst is if a customer can't find an item that's on sale in the weekly ad, the sole cashier in the store will go and help that customer leaving the other customers in line behind. This causes huge delays when there are no other cashiers. The negative experience at checkout leads to lost business for what's become a glorified convenience store. There not as expensive as CVS, but the affordable convenience they used to offer, especially in suburban areas is gone. \n\n\nUnless they shrink the retail part of the store, have clinics inside plus the pharmacy, then they will go the way of Rite Aid. The horrible reviews from pharmacists and pharmacy techs is telling that's why so many have quit and service is poor. Stock is trash, no better than a small cap.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lam59jj/",
          "created": 1719537628,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laizq49",
      "score": 271,
      "body": "Maybe actually cut prices then? I’m not going to pay $10 for a toothbrush that should cost $5",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laizq49/",
      "created": 1719498789,
      "depth": 0,
      "replies": [
        {
          "id": "laj1jbs",
          "score": 65,
          "body": "I think what’s actually killing them are the reimbursement from PBMs but they don’t like to mention that",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj1jbs/",
          "created": 1719499406,
          "depth": 1,
          "replies": [
            {
              "id": "laj8qsx",
              "score": 29,
              "body": "Yes, prescriptions that they dispense actually makes a loss. They rely on services such as jabs and retail sales to make up the shortfall. They need to have an ultimatum with the PBMs.",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj8qsx/",
              "created": 1719501810,
              "depth": 2,
              "replies": [
                {
                  "id": "lajrozj",
                  "score": 8,
                  "body": "Ok, this seems to feed into my suspicion, which I [posted elsewhere](https://www.reddit.com/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajr85s/). Pharmacy is, at least potentially, either a loss leader or a razor-thin profit margin.",
                  "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajrozj/",
                  "created": 1719507962,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lakcrss",
                      "score": 7,
                      "body": "It's razor thin.  Reimbursement from pbms has been stupid low, which is why they push for vaccines, which have a better reimbursement rather, and 3 month supply since it takes a tech a few seconds more to fill than a 30, which saves cost in the long run. Retail pharmacy is just a bad business to be in",
                      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakcrss/",
                      "created": 1719514782,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "laj79ij",
              "score": 14,
              "body": "whats pbm?",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj79ij/",
              "created": 1719501324,
              "depth": 2,
              "replies": [
                {
                  "id": "lajdlt0",
                  "score": 37,
                  "body": "they're one of the primary reasons medication is so expensive in america, pharmacy benefit managers.\n\nhttps://content.naic.org/insurance-topics/pharmacy-benefit-managers",
                  "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajdlt0/",
                  "created": 1719503414,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lajefpd",
                      "score": 24,
                      "body": "...and now that Amazon and Cost Plus are moving into that space to compete, everyone is feeling the pressure. \n\nI had the chance to sign up for Amazon and snap did it. My meds delivered right to my door. No going to the pharmacy where the counter is way in the back corner behind a maze of grocery store items. No dealing with some shitty brat behind the counter who feels today is the day she makes a political statement. My meds come straight to my door. Easy peasy.\n\nThey are going to wipe out that middleman to the benefit of all of us.",
                      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajefpd/",
                      "created": 1719503681,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lajj8n4",
                          "score": 17,
                          "body": "My issue with that is pharmacists are highly trained professionals that act as a safeguard between doctors and patient.\n\nThey're very needed to avoid improper prescription. If online retailers don't have pharmacists reviewing prescriptions properly  it could be a real health and safety issue.",
                          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajj8n4/",
                          "created": 1719505238,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lajoqbl",
                              "score": 12,
                              "body": "…and there is a nationwide shortage of pharmacists and nobody wants to pay them more money",
                              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajoqbl/",
                              "created": 1719507007,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lajry1w",
                                  "score": 4,
                                  "body": "The anecdotes that I've heard are many pharmacists are also facing significant burn-out? \"This deal keeps getting worse all the time.\"",
                                  "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajry1w/",
                                  "created": 1719508044,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "laka17m",
                                      "score": 8,
                                      "body": "I mean in a lot of retail pharmacy settings the pharmacist went to school for 6-8 years just to end up managing a team of high school graduates with pharmacy tech certifications.",
                                      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laka17m/",
                                      "created": 1719513898,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lakct4j",
                                          "score": 13,
                                          "body": "And having to be a public facing medical professional during a period of time where such people were demonized by a portion of society.\n\nMy buddy was a pharmacist at a rural grocery store. Emphasis on “was.” The shit he had to deal with from people who needed his help was ridiculous, he now works in a non public facing role and is miles happier.",
                                          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakct4j/",
                                          "created": 1719514794,
                                          "depth": 9,
                                          "replies": []
                                        },
                                        {
                                          "id": "lal56ny",
                                          "score": 2,
                                          "body": "> high school graduates\n\nDon't even need to do that in some areas.",
                                          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lal56ny/",
                                          "created": 1719524082,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "lakdayx",
                                      "score": 6,
                                      "body": "Covid was a horrible time for any pharmacist in a public store. My buddy worked as one in a rural grocery store and the stories he told were ridiculous. People coming in to berate him as if he was the reason Covid restrictions existed.\n\nPharmacists are one of the few medical professionals that people can just kinda walk up to and talk at without needing an appointment or having to pay. They had to deal with all the crazies and Covid frustration, and they are so over dealing with people’s shit.",
                                      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakdayx/",
                                      "created": 1719514954,
                                      "depth": 8,
                                      "replies": []
                                    },
                                    {
                                      "id": "lak01ze",
                                      "score": 2,
                                      "body": "A couple of years ago, all the pharmacies were properly staffed. Now you have signs up telling you when they will be going on breaks. Help wanted ads with nobody applying. \n\nAmazon and Cost Plus will eat them alive here. Having no customer interaction in an age of rude people is a major plus in terms of work environment.",
                                      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak01ze/",
                                      "created": 1719510678,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lakct3d",
                                          "score": 3,
                                          "body": "Remote pharmacies like Amazon still need pharmacists.  Walgreens has remote centers that fill prescriptions and send them to the store the next day for customers face don’t need service that day.  Those centers still need pharmacists to review and fill.  They just aren’t interacting one on one in person.",
                                          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakct3d/",
                                          "created": 1719514793,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "laoyss0",
                                  "score": 2,
                                  "body": "That's basically the core reason for any nationwide shortage of people in specific sectors.",
                                  "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laoyss0/",
                                  "created": 1719588706,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lajlde6",
                              "score": 10,
                              "body": "Sorry, what does that have to do with a couple people making a big pile of money? /s",
                              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajlde6/",
                              "created": 1719505923,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lajlxaz",
                                  "score": 10,
                                  "body": "You're right! As long as its cheaper to let people die than hire pharmacists there's no point in safety!",
                                  "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajlxaz/",
                                  "created": 1719506100,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lajokm9",
                                      "score": 2,
                                      "body": "Freedom!",
                                      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajokm9/",
                                      "created": 1719506954,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "laj84hu",
                  "score": 9,
                  "body": "Peanut Butter Men.  So the real question then becomes what is a Peanut Butter Man?",
                  "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj84hu/",
                  "created": 1719501608,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "laj8v7u",
                      "score": 7,
                      "body": "While “Peanut Butter Men” is an acceptable answer, in this case it’s referring to “Pharmacy Benefit Managers” — essentially middlemen between drug companies, insurers, and pharmacies.",
                      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj8v7u/",
                      "created": 1719501850,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lajbd8w",
                      "score": 3,
                      "body": "I am a peanut butter man and I'm tired of pretending I'm not",
                      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajbd8w/",
                      "created": 1719502665,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lajiwan",
              "score": 6,
              "body": "Safer and easier to blame “consumers”.  Last few quarters, it was “shrinkage” (as if they have no control whatsoever); before that, it was Covid fear or mask mandates.  They’re terrible.",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajiwan/",
              "created": 1719505126,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "laj642a",
          "score": 11,
          "body": "seriously, the price of toothbrushes is just stupid at this point. CVS has some going for $20+",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj642a/",
          "created": 1719500942,
          "depth": 1,
          "replies": [
            {
              "id": "lajj5qx",
              "score": 10,
              "body": "And you can pick up a years supply at Costco for less than that.  Walgreens will be gone in five years.  Or will just sell snacks, booze, and cigarettes.",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajj5qx/",
              "created": 1719505211,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "laj18sd",
          "score": 50,
          "body": "It's not that simple\n\nHow will the executive team make $100+ million a year selling toothbrushes for $3?",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj18sd/",
          "created": 1719499308,
          "depth": 1,
          "replies": [
            {
              "id": "laj8wgc",
              "score": 12,
              "body": "They also wrote down $6bn in the failed Village MD project. That will be a shed load of toothbrushes to shift.",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj8wgc/",
              "created": 1719501862,
              "depth": 2,
              "replies": [
                {
                  "id": "lajexgc",
                  "score": 6,
                  "body": "That was a disaster everyone saw coming from a mile away. Whose bright idea on Wall St was it to have pharmacies move into the clinic space when the buildings are not configured for that duty?",
                  "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajexgc/",
                  "created": 1719503838,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lalhr15",
                  "score": 3,
                  "body": "Idk how these MBAs think that there’s any fast easy money left to milk in healthcare..margins are thin and hospitals are cutting service lines like crazy. Look at the decline in Obstetrics and pediatrics especially in rural hospitals? KKR wrote down their Envision investment. Walmart shut down their clinics. Walgreens had to close their VillageMD. ",
                  "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lalhr15/",
                  "created": 1719528578,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lajf7pe",
          "score": 9,
          "body": "Also the advent of Walmart+ is absolutely going to crush Walgreens and corner drug stores.\n\n\nI live in a very big city where finding a local Walmart wasn't possible, so intercity Walgreens/cvs was a good option. Now I have Walmart+ with my credit card and have stopped visiting corner stores completely. Everything just gets delivered from the Walmart in the suburbs.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajf7pe/",
          "created": 1719503930,
          "depth": 1,
          "replies": [
            {
              "id": "lar0eom",
              "score": 2,
              "body": "i gave walmart+ a spin when amazon started charging more fees for fresh (i hate grocery shopping).  absolutely love it.  so much cheaper and they are always adding member benefits for all sorts of services.",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lar0eom/",
              "created": 1719614279,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lajq889",
          "score": 6,
          "body": "A toothbrush should cost $2.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajq889/",
          "created": 1719507487,
          "depth": 1,
          "replies": [
            {
              "id": "lakjv1e",
              "score": 3,
              "body": "Granted I'm not from the US but still, I bought a 6-pack of Oral-B toothbrushes for about $4.5 USD. That's less than 80 cents per brush. $2, $5 and $10 per brush is wack.",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakjv1e/",
              "created": 1719517098,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lavpt3x",
          "score": 2,
          "body": "I can get 5 for $10 online.  They aren't even close",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lavpt3x/",
          "created": 1719691996,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laj8sk4",
      "score": 32,
      "body": "I was recently in a Walgreens and I happened to need milk.  I took one look at the price of a gallon ($5-$6) and drove to a place I knew I could get one for $2.50.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj8sk4/",
      "created": 1719501826,
      "depth": 0,
      "replies": [
        {
          "id": "lakcu45",
          "score": 5,
          "body": "They dont even carry cream or half and half which is the one thing I would run to them for just because they're close",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakcu45/",
          "created": 1719514802,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laj5pcy",
      "score": 64,
      "body": "It's nice how consistent Walgreens are. No matter where I go in the country, I have the confidence that whenever I walk into one, it's going to be a rundown shithole.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj5pcy/",
      "created": 1719500807,
      "depth": 0,
      "replies": [
        {
          "id": "lakq9hk",
          "score": 5,
          "body": "I mean I don’t own any WBA stock but this has not been my experience at all. Quite the opposite. I never buy anything because it’s too expensive but whenever i’m in one it’s a fine experience ",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakq9hk/",
          "created": 1719519165,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lajazl9",
      "score": 16,
      "body": "They definitely have too many stores. I've seen small towns that have more than one, and in cities they're as common as 7-11s. \n\nBut the other problem is their pharmacies are always understaffed. Like they'll tell you a prescription will be ready in an hour, and you show up two hours later and they haven't filled it. They promise you they'll prioritize it and have in ready in thirty minutes, so you run over to the grocery store and come back in forty-five minutes and they still haven't done it. Or you show up at 4:00 in the afternoon, and the pharmacy is shut down because they don't have a pharmacist on duty,",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajazl9/",
      "created": 1719502541,
      "depth": 0,
      "replies": [
        {
          "id": "lajq0dq",
          "score": 3,
          "body": "There’s like 8 of them within 20 miles of me near Boulder, CO",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajq0dq/",
          "created": 1719507418,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lajh6iu",
      "score": 13,
      "body": "Wait until he finds out how stunned consumers are with his salary. Then we’ll see what really matters to him.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajh6iu/",
      "created": 1719504572,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laj7thd",
      "score": 23,
      "body": "Man if only they didn’t waste all that money on fancy glass fridge doors that tells you whats behind the glass instead of letting you look through the glass to see whats behind the glass…",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj7thd/",
      "created": 1719501507,
      "depth": 0,
      "replies": [
        {
          "id": "lajfpqa",
          "score": 5,
          "body": "That is the new marketing technique for surge pricing.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajfpqa/",
          "created": 1719504092,
          "depth": 1,
          "replies": [
            {
              "id": "lajg0so",
              "score": 3,
              "body": "Obviously its why i stopped shopping there lol, hope that works out for them though lolol, walmart is about to do this too",
              "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajg0so/",
              "created": 1719504193,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lajjfj5",
          "score": 7,
          "body": "They’ve actually already abandoned that nonsense.  They have no vision or plan. “Just react” should be their motto.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajjfj5/",
          "created": 1719505299,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lakk2ew",
          "score": 3,
          "body": "LMAO I saw that the other day. Such an incredible waste of funds.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakk2ew/",
          "created": 1719517165,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lakmq9m",
      "score": 10,
      "body": "I have worked for both major pharmacy chains and I can list everything that is wrong and I COULD HAVE LISTED THE EXACT SAME THINGS 10 YEARS AGO and they would still hold true.\n\nCVS and Walgreens are not in competition, they are in cahoots. Same board members. Same everything.\nNeither is willing to update their ancient software. I used to change prices on a computer with a phosphor green screen.\n\nNeither rewards their stores for reducing shrink or surpassing goals or anything like that.\n\nThere are no rewards unless you are a store manager, in which case you get bonuses when you cut labor and refuse to reward raises.\n\nThe district managers get fired and scrambled and downsized so much that districts are MASSIVE and you may see the current district manager for 5-10 minutes once a year. That person never has good news, can never help you, and traditionally only exists to show up one day and do a mass firing.\n\nToxic leadership has built a toxic company.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakmq9m/",
      "created": 1719518026,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laj0b60",
      "score": 36,
      "body": "Why do I need to go to Walgreens anymore. Walmart has my cold meds, photos, toys, and snacks. Only time I shop a Walgreens is when I’m in a big city and want a drink out snack and 7-11 is too far. Walgreens is over priced. \n\nLast time I shopped a Walgreens was to get eye drops while on vacation and they wouldn’t sell them to me because there was a recall (they said) yet they were all on the shelf. I walked across the street to target and got the same thing for a couple dollars less but had to wait on a longer line.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj0b60/",
      "created": 1719498990,
      "depth": 0,
      "replies": [
        {
          "id": "laj2fuo",
          "score": 20,
          "body": "It's funny that they seem to usually be right next door to a grocery store that sells the same stuff for 20-50% less. The busiest Walgreens locations I've been to were near residential areas where the bigger stores were more of a drive and locals are willing to pay for the convenience. But they just don't seem to pick that type of location very often.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj2fuo/",
          "created": 1719499712,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lajbhq9",
          "score": 6,
          "body": "The only reason I go to Walgreens is because it happens to be at the most convenient location to pick up a prescription for me. My life would hardly change if they shut down",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajbhq9/",
          "created": 1719502705,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lajujrm",
          "score": 3,
          "body": "I have 1 within 1/2 mile of my house, problem is there’s a Safeway across the streets diagonally and a Walmart Supercenter 1/4 mile down the road. I actually walked to Walgreens the other week. For some exercise and just for fun, to search for a battery for a headlamp. The only one they had was a Kodak brand for a camera and it was $23… For a single battery. I walked my happy ass across the road to Safeway and got 2 for $9",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajujrm/",
          "created": 1719508891,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lajuddg",
      "score": 7,
      "body": "I don't know why they keep complaining that the consumer is in shock when they are straight up fleecing customers. I had to pain lycodaine patches and bought them from Costco. 15 strips for $14. At Walgreens they sold $12 for 3. Fuck them and their greed. I'll keep shopping at Costco as long as they have it available",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajuddg/",
      "created": 1719508834,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajd8bl",
      "score": 7,
      "body": ">\"The consumer is absolutely stunned by the absolute prices of things, and the fact that some of them may not be inflating doesn’t actually change their resistance to the current pricing,\" he added.\n\nThese kinds of stores have always charged premium pricing comparably, relying on consumers paying extra for convenience.  It's not like they're the low price leader and consumers are still rethinking purchases.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajd8bl/",
      "created": 1719503291,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajdhp7",
      "score": 5,
      "body": "Maybe they shouldn’t have blown all that money on video screen refrigerator doors…",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajdhp7/",
      "created": 1719503377,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajflhr",
      "score": 5,
      "body": "In some cities, safety is a huge concern that prevents me from shopping there. ",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajflhr/",
      "created": 1719504053,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajk4zp",
      "score": 4,
      "body": "Instead of lowering prices, companies will just close stores. That is ridiculous",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajk4zp/",
      "created": 1719505528,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laji1aw",
      "score": 18,
      "body": "hmm all the vultures decided to raise prices to an insane degree while the real estate vultures also decided to up our housing costs by about 100%\n\n  \nWhere do these vultures think we will get money from? \n\nThis thing is like a race to the bottom where only a few companies will be alive because no one will have money except capitalists",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laji1aw/",
      "created": 1719504850,
      "depth": 0,
      "replies": [
        {
          "id": "lak0tb1",
          "score": 6,
          "body": "This is it. The companies with the most capital are the ones waiting this out and seeing how far the consumer can be pushed. It’s going to get worse before it gets better.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak0tb1/",
          "created": 1719510925,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lajbn6a",
      "score": 4,
      "body": "Not stunned just, 😒. Everything you can get at Walgreens can be bought down the street for $1-4 less",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajbn6a/",
      "created": 1719502754,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajoqux",
      "score": 5,
      "body": "Maybe they shouldn’t sell sunscreen for $30 that you can get at target for $8",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajoqux/",
      "created": 1719507011,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajux45",
      "score": 8,
      "body": "Why is it that when stores increase costs of their products so much, and don’t see enough sales, their first instinct is to close stores as opposed to maybe try and drop prices?",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajux45/",
      "created": 1719509011,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laj6rle",
      "score": 6,
      "body": "Walgreens has taken advantage of those in need of something urgent or who are sick by charging ridiculous prices on over the counter items. They’re getting what they deserve for being greedy.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laj6rle/",
      "created": 1719501160,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajf1p3",
      "score": 3,
      "body": "Let’s see they say they’re going to slash prices…what to what they were before or still inflated, just less so?\n\nAnd how about exec compensation…how’s that been going?\n\nConsumer always gets the shaft on this stuff, and the blame.\n\nHey but the closures will up unemployment, which they need to have happen to push wages lower, which they also want.\n\nNever mind the whole PBM thing which they won’t address either.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajf1p3/",
      "created": 1719503876,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajgfim",
      "score": 3,
      "body": "Other than prescriptions is there any reason to step into a Walgreens. And anytime I am forced to, it is instant regret and a complete disbelief stores like this still exist.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajgfim/",
      "created": 1719504328,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajtgdy",
      "score": 3,
      "body": "Guess it's not just a \"vibesession\", huh?",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajtgdy/",
      "created": 1719508533,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lak222o",
      "score": 3,
      "body": "″We assumed...in the second half that the consumer would get somewhat stronger” but “that is not the case,\" Wentworth said.\n\nLOL - \"assumed\".\n\n\"The consumer is absolutely stunned by the absolute prices of things, and the fact that some of them may not be inflating doesn’t actually change their resistance to the current pricing,\" he added. \"So we’ve had to get really keen, particularly in discretionary things.\"\n\nYet other companies are thriving.  Could it be the billions that Walgreens had to pay out for filling bogus opiod prescriptions?  Maybe accept responsibility for doing a lousy job and resign.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak222o/",
      "created": 1719511327,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lak3v18",
      "score": 3,
      "body": "Walgreens ceo making like $25mil a year be like…”nothin we can do about these prices” 🤷‍♂️",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak3v18/",
      "created": 1719511915,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajjrwv",
      "score": 2,
      "body": "Most food at those stores is almost 2x the price. Milk, ice cream, eggs, etc. I will drive out of my way to pick any of those items up at an actual grovery store",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajjrwv/",
      "created": 1719505411,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajnurq",
      "score": 2,
      "body": "With the rise of mail order pharmacies, add in Amazon just opened a pharmacy, and insane convenience store prices on everything… including drugs…\n\nAnd you get a terrible business model that hasn’t adapted.\n\nPersonally the only reason I’d go to a Walgreens is for an urgent care script that I need today… and even then, I’d probably still consider Kroger or Walmart.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajnurq/",
      "created": 1719506723,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajo8yd",
      "score": 2,
      "body": "The Walgreens near me seems to actively push customers away. Until recently they had several people at the counter to wait on a constant stream of customers. Then they switched as many customers as they could to automatic refills by mail, cutting floor traffic significantly. Then they reduced the counter staff to less than one full time, resulting in no one wanting to fill a prescription there the first time, causing floor traffic to be reduced to near zero. They created a situation where no one has a reason to go to their store.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajo8yd/",
      "created": 1719506848,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajpmx9",
      "score": 2,
      "body": "They do make nice photo reprints. But don’t use the web to upload, it’s awfully slow to transmit, it won’t be ready when they say. Use the app instead.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajpmx9/",
      "created": 1719507298,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajpqtn",
      "score": 2,
      "body": "They used to have good deals . Not anymore so we don’t go there much now",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajpqtn/",
      "created": 1719507332,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajqy90",
      "score": 2,
      "body": "CVS will buy them up and become an even bigger monopoly",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajqy90/",
      "created": 1719507719,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajuktd",
      "score": 2,
      "body": "The Walgreens closest to me has had bare shelves since the beginning of the pandemic, literally every other item not in stock. \n\nEarlier this year, they locked everything up, but I spoke to the manager about it when they were unlocking fucking sunscreen for me and he said he didn’t know why they spent so much money on it because they didn’t have a loss problem, but he did say they fired their security guard at the same time. \n\nThe store hours went from 8-8 to 10-6pm, 7pm in summer. The pharmacy is open from 10-1130, and then 1-3.\n\nAnd there’s always a line and only 1 cashier.\n\nThis store have slowly been being killed, and there’s always a line like 5-10 people long in the store. So customers aren’t a issue",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajuktd/",
      "created": 1719508900,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajwsif",
      "score": 2,
      "body": "There is a Walgreen near where I live, and beside it, a nationwide supermarket with a pharmacy in it. What I have found is that similar products at Wallgreen is consistently more expensive, and they don't even have as many products as the supermarket.\n\nWalgreen can't beat supermarkets with a pharmacy in it.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajwsif/",
      "created": 1719509615,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajx5mg",
      "score": 2,
      "body": "Worth a look AFTER they cut their dividend. Until then, this has more to fall.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajx5mg/",
      "created": 1719509732,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lak2xoy",
      "score": 2,
      "body": "If they close the stores in locations with heavy looting or where shoplifting is not prosecuted, they might be ok.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak2xoy/",
      "created": 1719511615,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lak5yva",
      "score": 2,
      "body": "I mean every product in drug stores has been insanely marked up for years. This is a problem they created and contributed to",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak5yva/",
      "created": 1719512592,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lakfg1d",
      "score": 2,
      "body": "Consumers aren’t strained they’ve just been robbing people for years. Went into a Walgreens recently and 4-AA batteries were $14.\n\nWalgreens and CVS have been the worst consumer experience for years and only worth going into if it’s past midnight and the only thing open.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakfg1d/",
      "created": 1719515654,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lakhz4n",
      "score": 2,
      "body": "When I was last on holiday in the us we used a walgreens locally to buy snacks and cans of beer etc, didn’t realise it was supposed to be a pharmacy 😄😂",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakhz4n/",
      "created": 1719516480,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lakmcgj",
      "score": 2,
      "body": "This is what deflation looks like\n\nVery slippery slope though",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakmcgj/",
      "created": 1719517905,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajaduh",
      "score": 1,
      "body": "Have they even changed anything about their business strategy over the last couple decades? I can’t remember anything new or innovative from them since I was a child",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajaduh/",
      "created": 1719502341,
      "depth": 0,
      "replies": [
        {
          "id": "lajf80e",
          "score": 5,
          "body": "There was the ill fated entanglement with Theranos.\n\nAs others above have noted, if you need a medication *today* and they happen to be the only one local that stocks it, then there's a reason for them to exist.\n\nOtherwise, Grocery/Big Box stores have pharmacies or there's online ordering.",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajf80e/",
          "created": 1719503932,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lajavgl",
      "score": 1,
      "body": "Maybe Walgreens needs to learn about apps and register receipts with endless coupons. \n\nIf you can stand to sort through the coupons, then the prices might approach superstore prices.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajavgl/",
      "created": 1719502503,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajetw0",
      "score": 1,
      "body": "I barely wanna go to Tacobell when I'm hungry this year, I haven't seen Walgreens, CVS,",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajetw0/",
      "created": 1719503806,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajji1k",
      "score": 1,
      "body": "I'm gonna bet that the majority of these closures will be in Texas. HEB has topped the pharmacy game all over the state, and they're (almost) everywhere in the state. Houston, San Antonio, the Valley, Central Texas, the coastal prairie. There's just no room for a Walgreens in these areas. And wherever HEB isn't, then Walmart is filling the gap.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajji1k/",
      "created": 1719505322,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajraxp",
      "score": 1,
      "body": "CVS, Walgreens convenience store prices can not compete with regular grocery stores or Wal-Mart. Front of store purchases only make sense when products are on sale.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajraxp/",
      "created": 1719507835,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajrvun",
      "score": 1,
      "body": "Walgreens has always been expensive af compared to my other grocery options. Same with dollar stores. ",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajrvun/",
      "created": 1719508024,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajt1ii",
      "score": 1,
      "body": "i mean there prices are ridiculous usually",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajt1ii/",
      "created": 1719508399,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajuh6v",
      "score": 1,
      "body": "I shopped at Walgreens yesterday for the first time in years because it was my only option at the time. \n\nI wish I looked at the price tags on everything. Children’s melatonin gummies, and 2 sodas and 2 candy bars for my wife and I. \n\n$27. I wish I wasn’t so non-confrontational I would have put it all back. I will never be going to Walgreens again if I can help it.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajuh6v/",
      "created": 1719508867,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lajynlj",
      "score": 1,
      "body": "The guy who said they need to work on being a pharmacy first and a convenience store second is 100% right. More so, they need to circle the wagons around their most profitable areas. Basically only do things that would keep the company floating. I'm just not sure how they pull that off because all their locations are in these 5000 plus square foot buildings that are the size of actual grocery stores. They need to be more like the size of a Sherwin-Williams and get away from trying to compete on hair conditioner to offering the best drug prices, maybe photo development, maybe some other services and knick knacks, they know what sells, just focus on that and dump everything else",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lajynlj/",
      "created": 1719510224,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lak1qo2",
      "score": 1,
      "body": "I haven't shopped at Walgreens in ten years and I have no reason to start now. They're terrible. Same with Rite Aid and CVS. I might fill a script at CVS out of necessity, but I'm not happy about it. It's my only option where I live.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak1qo2/",
      "created": 1719511227,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lak1rlh",
      "score": 1,
      "body": "I keep voting for Walgreens to sell Boot but they don't sell it.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak1rlh/",
      "created": 1719511234,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lak2pu1",
      "score": 1,
      "body": "I mean when you either charge the same or more but get way less of said product what do you fucking expect people to do except not buying shit they don't need.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak2pu1/",
      "created": 1719511544,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lak3mx4",
      "score": 1,
      "body": "My Shop-Rite pharmacy is cheaper than Walgreens! And I can go food shopping at the same time.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak3mx4/",
      "created": 1719511840,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lak3v3f",
      "score": 1,
      "body": "Maybe having one pharmacist on staff at most locations responsible for their own job, drive through and administrating vaccines while paying them some of the lowest salaries they wouldn’t have people switching their scripts to other stores.\n\nLike a lot of other client facing business they got greedy during covid and thought it was ok to cut labor because people were gracious and understanding, but the pandemic is over and these greedy fucks need to get their shit together.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak3v3f/",
      "created": 1719511915,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lak6d9i",
      "score": 1,
      "body": "Walgreens can fade away- their recent stand on not dispensing abortion medication was a poor stand for them to take. I don’t shop there any longer.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak6d9i/",
      "created": 1719512718,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lak8oty",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak8oty/",
      "created": 1719513466,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lak8y48",
      "score": 1,
      "body": "I only go on Christmas because i like to get gift cards the morning of and occasionally to the pharmacy to get plan b lmaoooooo but they are over priced on everything else",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak8y48/",
      "created": 1719513549,
      "depth": 0,
      "replies": [
        {
          "id": "laks335",
          "score": 2,
          "body": "dudes raw dogging are keeping walgreens alive",
          "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laks335/",
          "created": 1719519750,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lak9fab",
      "score": 1,
      "body": "They are obsolete. I've been having medications mailed to me for years. It's more convenient and it's cheaper.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak9fab/",
      "created": 1719513702,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lak9zcy",
      "score": 1,
      "body": "I’m not buying anything in Walgreens because it’s 4 times more expensive than anywhere else …",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lak9zcy/",
      "created": 1719513881,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lakbe45",
      "score": 1,
      "body": "Walgreens is overpriced like Ace Harware",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakbe45/",
      "created": 1719514335,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lakbjxr",
      "score": 1,
      "body": "The only place still open 24/7",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakbjxr/",
      "created": 1719514388,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lakdrr0",
      "score": 1,
      "body": "All the bad choices of the retail RX corporations/grocery/Walmart 30 years ago has finally set the industry into a free fall.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakdrr0/",
      "created": 1719515107,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lakeckc",
      "score": 1,
      "body": "I was stunned back in 2009 the last time I entered a walgreens",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakeckc/",
      "created": 1719515297,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lakf5iy",
      "score": 1,
      "body": "Stop taking RX insurance, cash only! \n\nOur profession was an all cash business until early 90’s,\n\nour ignorant stupid RX leaders allowed the slow destruction of our profession, also pharmacy works for PBM’s and insurance for free, what a dumb decision. \n\nPharmacists could save thousands from suffering and death if allowed to do our jobs for a fee, but nooooo. \n\nThe money pie is already cut, and who got screwed? \nThe patients and pharmacists who is only paid for mundane repetitive jobs. SMH.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakf5iy/",
      "created": 1719515559,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laklcif",
      "score": 1,
      "body": "The most bland store that was famous for building a new store everyday, always at street intersections, has suddenly found that after making a boatload from a pandemic is now just back to being the place where people line up for their medications and ignore the junk on the shelves for the most part.\n\nWhy did they think continuous growth was realistic?",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laklcif/",
      "created": 1719517581,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lakmh59",
      "score": 1,
      "body": "Consumer's money (M1 in macroeconomic lingo) isn't infinite and there is only so much price gorging by these big companies before the dominoes falls. M1 started falling in 2022 and the fastest since 1930's, generally it takes about 2 years before it affects the broader market and we are seeing its effect now, crossing into negative territories for USA bank's deposits since early of 2024.\n\nIt is a little too late to change prices when companies already lost consumers confidence and shopping habits.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakmh59/",
      "created": 1719517946,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laktdb7",
      "score": 1,
      "body": "I went to local Walgreens to get passport photos taken. I went down one of the aisles and spotted their clearance section. There was a single 30 - 60 page spiral notebook...$9, some cheap summer toys, a little motorcycle racer...$12.  I know that things are priced based on convenience but those prices were just ridiculous.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laktdb7/",
      "created": 1719520158,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laku54a",
      "score": 1,
      "body": "They’re price gouging sick people. They should absolutely go out of business.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laku54a/",
      "created": 1719520409,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lakwo1d",
      "score": 1,
      "body": "No no no. We are stunned by how rude the pharmacy is on a daily basis. The customer service is bottom of the bottom. This is corporates fault. The employees are obviously miserable and judging by their misery I would guess they lost all good employees and only the worst remain. I refuse to do any business with Walgreens and everyone I know also agrees. Most have taken their prescriptions to Amazon and just have it shipped. When you have an issue the customer service is quick, no long hold times like Walgreens, and no unwarranted attitude. Fuck Walgreens. I hope their bankruptcy comes fast and they are quickly a forgotten name.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakwo1d/",
      "created": 1719521229,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lakyjnr",
      "score": 1,
      "body": "From what I've seen in my area, they are a bit overbuilt.   \n\nThey are more like convenience stores than pharmacies.    \n\nThey built when insurance paid for drugs so price didn't matter.  Now insurance stopped paying for drugs by pushing high deductible plans,  people shop around for drugs on price, and that's not Walgreens because they have to pay for all those buildings and extraneous staff.    Drugs are cheaper at bigger stores where the drugs aren't their primary deal.\n\nOn the most prescribed drug, Atorvastatin , Walmart has it for $16, Walgreens has it for $21.  #2  Metformin is $4 at Walmart, $14 at Walgreens.  Kids these days are into the Fluoxetine, that's $26 at Walgreens, $4 at Walmart.  Seratraline, $26 at Walgreens, $12 at Costco.  \n\nGovernment pay might still be ok with Walgreens, and yeah, that's 60% of the market, but that other 40% of the market is becoming increasingly price conscious for drugs, and a store on the corner is about convenience vs. price.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lakyjnr/",
      "created": 1719521840,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lal164b",
      "score": 1,
      "body": "That sucks, because I actually like Walgreens quite a bit.  There is one by my house, and it is a pleasure to shop there.    If this is happening to them, I expect to see this soon in other similar businesses.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lal164b/",
      "created": 1719522698,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lal18c2",
      "score": 1,
      "body": "Walgreens CEO appears to be shocked by something everyone knows!",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lal18c2/",
      "created": 1719522718,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lal2axx",
      "score": 1,
      "body": "I can't wait for $8.99 item to be sLaShEd to $8.49 despite that item being $4 everywhere else. \n\n(yes yes, I know these businesses have increased costs because its a \"convenience\" store and people shop there when they are in a hurry, but I can bet that even their \"slashed prices\" are still going to be too expensive)",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lal2axx/",
      "created": 1719523083,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lalafav",
      "score": 1,
      "body": "I only go to Walgreens for the ATM.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lalafav/",
      "created": 1719525930,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laleelo",
      "score": 1,
      "body": "Nobody gonna say anything about theft?",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laleelo/",
      "created": 1719527340,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lalg0zh",
      "score": 1,
      "body": "Their pricing is such a mess-ordering online and navigating their stupid coupons can save you a lot of money, but it's a clunky system. It also shows how overpriced the in store pricing is, so i always feel ripped off if i just walk in and buy something off the shelf without coupons. Makes me avoid the place now unless it's an emergency.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lalg0zh/",
      "created": 1719527934,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lalinzd",
      "score": 1,
      "body": "some more cut-n-paste",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lalinzd/",
      "created": 1719528917,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laljjmm",
      "score": 1,
      "body": "They also need to actually have pills and enough people working to fill prescriptions. Every time I go in there to fill something it’s a half hour or longer wait or “We don’t have this in stock” even when it’s something I order every month that is in their system to auto refill. \n\nHow their system wasn’t programmed to track stock amounts against automatic refills and flag shit to order is goddamn mind boggling.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/laljjmm/",
      "created": 1719529246,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lalnbzn",
      "score": 1,
      "body": "Haven't stepped foot in a CVS or Walgreens in years! Rude employees. WAY too high prices and takes a ridiculous amount of time to get a prescription filled. Changed to a locally owned mom & pop pharmacy with free delivery (within an hour), prices cheaper than even my copay with BCBS. Pharmacists are kind and enjoy their job and their customers. Total eye opener. Sometimes, it gives me \"Mayberry\" vibes. \n\nIf all Walgreens operate like those near me, I doubt many people will be sad about them closing. I know I won't.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lalnbzn/",
      "created": 1719530686,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lalo43i",
      "score": 1,
      "body": "close the ghetto stores and the remainder can charge reasonable prices without having to carry the shrinkage",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lalo43i/",
      "created": 1719530969,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lalrev1",
      "score": 1,
      "body": "I use to love Walgreens but they took price hikes to a new and crazy level",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lalrev1/",
      "created": 1719532209,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lalthlb",
      "score": 1,
      "body": "It will be closer to half as the expire over the next few years",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lalthlb/",
      "created": 1719532980,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lalu2rf",
      "score": 1,
      "body": "Every Walgreens I’ve shopped at in Nashville has been a shit hole for the last 10 years, and it’s only gotten worse.\n\nI’ve avoided it for the miserable, painfully slow checkout experience alone.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lalu2rf/",
      "created": 1719533204,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lalxtni",
      "score": 1,
      "body": "I don’t even go to their pharmacy anymore either. They’re no reliable and then most of the staff is  rude at that. I started getting mine filled at a more expensive pharmacy that is actually reliable and don’t act like snotty inconvenienced turds.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lalxtni/",
      "created": 1719534664,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lam3cvw",
      "score": 1,
      "body": "The place has been on fire for years and finally someone notices.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lam3cvw/",
      "created": 1719536875,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lamdq0v",
      "score": 1,
      "body": "Maybe they would sell more product if we could see it instead of all those damn sale tags.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lamdq0v/",
      "created": 1719540983,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lamerwy",
      "score": 1,
      "body": "Yes, your pricing is far too agressieve.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lamerwy/",
      "created": 1719541435,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lammn1c",
      "score": 1,
      "body": "Ever gone to a Walgreens pharmacy? Always a terrible experience. Easily the worst customer service of any place I frequent. This isn’t surprising.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lammn1c/",
      "created": 1719545266,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lan2t5k",
      "score": 1,
      "body": "Walgreens is typically the highest for prescriptions on GoodRX. I’m not a Wal-Mart fan but the neighborhood market pharmacy is pretty quick and reasonable. \n\nWalgreens used to be the go to for cold/flu medicine but since delivery services if I’m sick it’s getting delivered from Walmart or Target and it’s still cheaper than Walgreens",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lan2t5k/",
      "created": 1719554086,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lan9lcg",
      "score": 1,
      "body": "Europe here. Can someone summarize why pharmacies walgreens/cvs havibg a hard time. \n\nWho are they competing with, that makes it so difficult to make money?",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lan9lcg/",
      "created": 1719558220,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lanbcms",
      "score": 1,
      "body": "This is what happens when you hire people who have zero connection with their customers.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lanbcms/",
      "created": 1719559375,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lanbla7",
      "score": 1,
      "body": "Walgreens are just big stores that consumers see as expensive, and they're full of all sorts of junk and random shit besides the marked up medicine. I",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lanbla7/",
      "created": 1719559534,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lany9ui",
      "score": 1,
      "body": "Go to a pharmacy in Europe…it’s a pharmacy…not a mini mart with a high paid cashier.",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lany9ui/",
      "created": 1719574360,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lao96s5",
      "score": 1,
      "body": "Fucking incompetence of the people on top never fails to surprise me",
      "permalink": "/r/stocks/comments/1dpsgb0/walgreens_plans_store_closures_as_ceo_says/lao96s5/",
      "created": 1719579424,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "Walgreens plans to close stores due to a challenging environment and weaker consumer spending, leading to a 20% drop in its stock.",
    "companies": [
      "Walgreens",
      "Target"
    ],
    "tickers": [
      "WBA",
      "TGT"
    ],
    "main_ticker": [
      "WBA"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Walgreens is planning store closures and has announced a quarterly earnings report that fell short of expectations, leading to a significant drop in stock price.",
    "stock_recommendations": "The user is not explicitly recommending to buy or sell Walgreens stock.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": "none",
    "sentiment_summary": "The sentiment is neutral as the post provides information about Walgreens' earnings and strategic plans without giving explicit stock recommendations.",
    "sentiment": "neutral"
  }
}