{
  "title": "Headline, core PCE inflation both ease in May, as expected",
  "score": 65,
  "selftext": "May PCE Price Index: **+0.0%** M/M vs. +0.0% consensus and +0.3% in April.\n\n**+2.6%** Y/Y vs. +2.6% expected and +2.7% prior.\n\nCore PCE Price Index, which excludes volatile food and energy costs, edged up **0.1%** vs. +0.1% expected and +0.3% prior (revised from +0.2%). Federal Reserve policymakers prefer to focus on the core measure because it measures what consumers are actually spending.\n\n**+2.6%** Y/Y vs. +2.6% expected and +2.8% prior.",
  "link_flair_text": "Broad market news",
  "id": "1dqitmc",
  "num_comments": 33,
  "created_utc": 1719578847,
  "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/",
  "comments": [
    {
      "id": "lao7tf5",
      "score": 1,
      "body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/lao7tf5/",
      "created": 1719578848,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laodqbf",
      "score": 52,
      "body": "Remember 2 years ago when inflation reports were met with wild market swings and hundreds of frenzied comments about impending doom?  And now....*crickets*.\n\nGood times, good times",
      "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laodqbf/",
      "created": 1719581259,
      "depth": 0,
      "replies": [
        {
          "id": "laop54l",
          "score": 24,
          "body": "I mean 2 years ago we were right in the middle of the heyday when chaos was unfolding and the future was uncertain.\n\nNow things have stabilized so the reaction is more... stable.",
          "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laop54l/",
          "created": 1719585433,
          "depth": 1,
          "replies": [
            {
              "id": "lapr2yz",
              "score": 3,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/lapr2yz/",
              "created": 1719598121,
              "depth": 2,
              "replies": [
                {
                  "id": "laqgwri",
                  "score": 2,
                  "body": "why wouldnt i be outraged",
                  "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laqgwri/",
                  "created": 1719607058,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lardmcp",
                  "score": 1,
                  "body": "The economy is crashing and we’re spiraling to death while at the same time we’re going into stagflation and hyperinflation and every stock will go to 0- average /r/stocks analyst \n\nYes",
                  "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/lardmcp/",
                  "created": 1719619458,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lap76tt",
          "score": 4,
          "body": "That's because the pce can be estimated fairly accurately once you have CPI and PPI. The only new info would be consumer spending,  but some of that is also known ahead via retail sales (goods spending), so only services spending is new info in this report.",
          "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/lap76tt/",
          "created": 1719591498,
          "depth": 1,
          "replies": [
            {
              "id": "laqhi5w",
              "score": 0,
              "body": "[removed]",
              "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laqhi5w/",
              "created": 1719607263,
              "depth": 2,
              "replies": [
                {
                  "id": "laqjn8n",
                  "score": 2,
                  "body": "actually the CPI + PPI released 2 weeks ago pumped SP500 up almost 2% I believe to all time high, and that's with the whisper that it's gonna come in low.",
                  "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laqjn8n/",
                  "created": 1719608012,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "laolnec",
          "score": 2,
          "body": "This always happens when inflation is elevated, we also usually get into a euphoria, then we near the end of inflation and there is a recession and we see whose swimming naked.\n\n\nThere's always a spike in rates, a plateau and a lull, then a crash.",
          "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laolnec/",
          "created": 1719584204,
          "depth": 1,
          "replies": [
            {
              "id": "laqhs9s",
              "score": 3,
              "body": "[removed]",
              "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laqhs9s/",
              "created": 1719607361,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "laogdxn",
          "score": 0,
          "body": "That was when the market was a casino, now we gotta check DD to make sure we don't lose any money.",
          "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laogdxn/",
          "created": 1719582281,
          "depth": 1,
          "replies": []
        },
        {
          "id": "laqabom",
          "score": 0,
          "body": "Weekly 2008 vs 2022 charts when people should’ve been loading the boat during a bear market",
          "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laqabom/",
          "created": 1719604761,
          "depth": 1,
          "replies": []
        },
        {
          "id": "laqgvix",
          "score": -1,
          "body": "cuz its going down as expected and actually not going down as much because its the sticky inflation now",
          "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laqgvix/",
          "created": 1719607046,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laoik4m",
      "score": 25,
      "body": "Inflation is down because consumers are spending less, which will lead to a reduction in company earnings, so to want to be buying stocks on this news doesn’t seem right. The “record earnings” came from gouging consumers, but companies like Target and Walmart and McDonalds are cutting prices which means their earnings will likely fall…\n\nNevermind that *at some point* everybody who wants NVidia GPUs will have them.",
      "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laoik4m/",
      "created": 1719583087,
      "depth": 0,
      "replies": [
        {
          "id": "laokfcr",
          "score": 6,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laokfcr/",
          "created": 1719583768,
          "depth": 1,
          "replies": [
            {
              "id": "laomye2",
              "score": -5,
              "body": "It sucks because they will become the new Intel, iterating very slowly until AMD or another poses a serious threat. Then all of a sudden they will “find” a 50% performance improvement over the previous generation. In the meantime, they can charge whatever they want for 5 year old tech",
              "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laomye2/",
              "created": 1719584665,
              "depth": 2,
              "replies": [
                {
                  "id": "laopk63",
                  "score": 7,
                  "body": "Blackwell has been announced with “significant earnings” planned for *this* year, what are you talking about?",
                  "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laopk63/",
                  "created": 1719585580,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lau1s2e",
                      "score": 1,
                      "body": "This year and next year are already priced in. What do they have for 2026.",
                      "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/lau1s2e/",
                      "created": 1719670198,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lau3q6i",
                          "score": 1,
                          "body": "You want them to announce the next next gen before even releasing the next gen?? They’ve stated they’re on about a 1 year cadence while AMD/intel/whoever else are 2++ years",
                          "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/lau3q6i/",
                          "created": 1719670946,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "laoo5i8",
          "score": 4,
          "body": "While that's the case the basic stock price formula is underpinned by the risk free rate which is dictated by interest rates. The stock market is also dominated by tech which is less sensitive to the consumer demand you mention.",
          "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laoo5i8/",
          "created": 1719585086,
          "depth": 1,
          "replies": []
        },
        {
          "id": "laoquzo",
          "score": -1,
          "body": "Uh, the rate of price increases slowing does not mean people are spending less. The opposite, in fact. They're just increasing their spending at a slower pace now.\n\nConsumer spending is its own metric and can be seasonally volatile. Don't read too much into one data point.",
          "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laoquzo/",
          "created": 1719586029,
          "depth": 1,
          "replies": [
            {
              "id": "laotv6g",
              "score": -1,
              "body": "Supply and demand, no?",
              "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laotv6g/",
              "created": 1719587060,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lao9g2k",
      "score": 10,
      "body": "core PCE last month revised up to 0.3% from 0.2%. Consumer spending last month also revised down to 0.1% from 0.2%",
      "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/lao9g2k/",
      "created": 1719579531,
      "depth": 0,
      "replies": [
        {
          "id": "laqifb7",
          "score": 1,
          "body": "[removed]",
          "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laqifb7/",
          "created": 1719607587,
          "depth": 1,
          "replies": [
            {
              "id": "laqk2ju",
              "score": 2,
              "body": "No actually starting next month, core PCE YoY will likely go up. That's because the second half of 2023 had core PCE come in unusually low, over-exaggerated due to incorrect seasonal adjustment. As we start next month, those low inflation numbers will get removed from the YoY, and the new inflation numbers are at best the same, or likely higher than 2H last year\n\nThis is why the Fed raised their 2024 core PCE projection to 2.8% from 2.6% even though they knew this month was likely gonna bring YoY down to 2.7%, or 2.6% confirmed today. Even if we get 1.9% annualized for the rest of this year, YoY number is still gonna stay flat at 2.6%",
              "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laqk2ju/",
              "created": 1719608162,
              "depth": 2,
              "replies": [
                {
                  "id": "laqktu0",
                  "score": 1,
                  "body": "[removed]",
                  "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laqktu0/",
                  "created": 1719608426,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "laqlzrb",
                      "score": -4,
                      "body": "No I said core PCE YoY will likely go up by the end of the year. For core PCE YoY to stay at 2.6% by the end of the year, the monthly core PCE needs to come in average at 0.16% every month for the rest of this year. That's a very high bar to do. If you don't understand this concept, I suggest you look up base effect.\n\nCPI has completely different base effect than PCE. The Fed cares about PCE, so I don't know why you're bringing up CPI. The only reason why CPI is relevant for the Fed is because it gets released 2 weeks before PCE, so it gives forecasters an idea of what PCE will come in at.\n\nI don't think any economist has given out a forecast for what core PCE released next month will be. Not all of them have even given out a nonfarm payroll forecast yet, a data released next Friday.\n\nHere's the thing about inflation number. Some companies only raise prices in the beginning of the year. So if you only look forward, monthly, STARTING in the second half of the year, it looks like inflation is improving. And then once you start a new year, companies raise prices, inflation comes in hot, and looks like your \"progress\" gets reset. Happened twice already, 2023 and 2024.\n\n[https://x.com/EconBerger/status/1806673281682112771/photo/1](https://x.com/EconBerger/status/1806673281682112771/photo/1)\n\nCheck the link for where core PCE YoY will end up for various future monthly numbers. 0.19% monthly just to hit 2.8% core PCE YoY",
                      "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laqlzrb/",
                      "created": 1719608843,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "laqy28o",
                          "score": 1,
                          "body": "[removed]",
                          "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/laqy28o/",
                          "created": 1719613366,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lar5gfy",
                              "score": -2,
                              "body": "well you first brought up core PCE YoY, so I specifically outlined core PCE YoY going up, and yet twice you specifically said you anticipate the YoY to go down.\n\nWhen economists anticipate inflation going down, they are talking about MoM, not YoY. When they are talking about \"stalling\" inflation, they are saying roughly >0.25% or higher MoM core PCE, annualizing to 3.0% or higher. That's actually not acceptable to the Fed, and if that lasts for 6 months (we got 3 months), the Fed will likely hike rate next year. So no, it doesn't need to go back to 0.4% every month for it to be a problem. Many of these \"respected economist\" also thought the inflation fight was over last year, famously Krugman, and told the Fed to cut or stop hiking rate. 1 year later and core PCE YoY is still around 2.7%. If you follow them closely, you'll see a lot of inconsistencies in their thinking and how much gymnastic they do to trim the data and make it look like inflation is near the Fed's target.\n\nMy view is actually not that outlier. If Trump wins and he does tariffs, for sure inflation will come back next year and the Fed will hike rate. Whenever crude goes to $75, I'm getting oil stock for inflation and selling if crude goes above $90. Otherwise, I was in utilities stock for defensive before it became an AI play. Now looking for companies that are actually AI implementer, not enabler like NVDA and data centers, but frankly barely any are seeing anything concrete on their earnings.",
                              "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/lar5gfy/",
                              "created": 1719616253,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "larcxsb",
      "score": 3,
      "body": "Inflation stable YoY and MoM. But I think people are really discounting how much inflation has increased since covid, like these are still absolutely insane price levels and why a large population is struggling",
      "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/larcxsb/",
      "created": 1719619185,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lap1tnh",
      "score": 3,
      "body": "According to the Table 2.4.4U under Prices in today's [PCE report](https://www.bea.gov/news/2024/personal-income-and-outlays-may-2024), Housing for the past 12 months to May relentlessly inflated from 127.454 to 134.511, that's up 5.5 percent.\n\nBecause the elected people in power don't want to enact builder incentives to intentionally overbuild to make the record low [vacancy rates](https://fred.stlouisfed.org/series/RHVRUSQ156N) increase to drive down the prices of all types of housing and rentals, this housing inflation is going to cause the US economy to slowly go into stagnation. The Fed can't help us.  Lowering interest rates would only make the price of housing go up faster as stagflation continues to infect the whole economy. Enabling more subprime lending would only drive up prices in the fierce competition for the limited number of houses.  I guess the US will get what it votes for.\n\nEdit: fierce competition",
      "permalink": "/r/stocks/comments/1dqitmc/headline_core_pce_inflation_both_ease_in_may_as/lap1tnh/",
      "created": 1719589710,
      "depth": 0,
      "replies": []
    }
  ]
}