{
  "title": "IS 2025 the Time for Solar Stocks ?",
  "score": 46,
  "selftext": "In the past two years, solar energy stocks have seen a lot of ups and downs. 2021 was a great year for these stocks because the demand for renewable energy was high. But in 2022, things got tougher due to supply chain issues and rising costs. Source: [https://www.nasdaq.com/articles/solar-energy-stocks-make-a-comeback-but-will-it-last-2024-05-29](https://www.nasdaq.com/articles/solar-energy-stocks-make-a-comeback-but-will-it-last-2024-05-29)\n\n\n\nLooking ahead to 2025, analysts are optimistic. They believe that new technologies, supportive government policies, and growing awareness about the environment will boost the solar sector.  Source: [https://markets.businessinsider.com/news/stocks/7-solar-stocks-that-could-be-millionaire-makers-may-edition-2024-05](https://markets.businessinsider.com/news/stocks/7-solar-stocks-that-could-be-millionaire-makers-may-edition-2024-05)\n\nAs of June 2024, the stocks are close to yearly lows and a day after the US presidential debates, it seems more unlikely that the next president  (likely Trump) will prioritize renewable energies and there is also economic commentaries on the potential negative effect on inflation and interest rates. Two very important factors for Solar Energy.\n\nDo you think Solar will rebound despite the economic and political risks or is it doomed to sleep a ew more years until governments take the issue of global warming and green policies seriously agin ?\n\nAre there stocks that you are watching and believe will be able to grow ?",
  "link_flair_text": null,
  "id": "1dqjcjt",
  "num_comments": 60,
  "created_utc": 1719580417,
  "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/",
  "comments": [
    {
      "id": "laodugt",
      "score": 59,
      "body": "I mostly stayed out of the previous EV / Renewables bubble because I didn't think I would know when to get out on the right time.  \n\n\n\n\nBut I did track some tickers and checked in them later. It seems to me it is a sector full of crash and burns. Picking a ticker in solar or renewables in general is a minefield.  \n\n\n\n\nAnd the sector as a whole seems to me to have a lot of the downsides traditional energy sector has (commodity cycles, political risk over what guy gets elected and public moods, complex capex investment, etc.) without (for now at least) the good parts - the super meaty and reliable cash flows of traditional energy companies.  \n\n\nI think if you are getting on solar use a sector ETF unless you really, really know what you are looking at when checking a company.  \n\n\n\n\nMost stocks from the EV bubble still have \"copium\" subreddits where if you check posts from 2 years ago it's hilarious (or depressing). Stuff that was going to revolutionize everything and now trades at 0.003 USD, everyone rambling about conspiracy theories and how its such a bargain now and will go up. Granted it was far worse on the hydrogen and battery tech side of things than pure solar plays but still.  \n\n\n\n\nSolar energy is here to stay. But something becoming a staple of society/industry does not necessarily mean good companies from an investment POV. Plenty of sectors are critical to society but don't give you good returns on investment.",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laodugt/",
      "created": 1719581304,
      "depth": 0,
      "replies": [
        {
          "id": "laor9kz",
          "score": 19,
          "body": "In general, mass adopted manufactured goods are terrible investment returns. Great for society, bad for investors unless you pick the 5% of companies that succeed. \n\nWhether it’s 1800’s railroads, early 20th century automobiles, 70’s airlines, 90’s Internet, 00’s telecommunications, or 00/10’s cell phone companies, they all were massively adopted, and lost more people money than they made.",
          "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laor9kz/",
          "created": 1719586169,
          "depth": 1,
          "replies": [
            {
              "id": "laqc1uz",
              "score": 3,
              "body": "A lot of those “investors” are horizontal allocators as in they would rather look for the next Tesla out there than pay the premium on a company that has already crossed the finishing line. You simply have a better odds making money with an industry leader than to find where the next paradigm shift is going to take place.\n\nSo yes if you wanna scoop some solar now is the time to reward the winners. Historically this is when they assert their dominance by grabbing the market shares of the failed names.",
              "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laqc1uz/",
              "created": 1719605360,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "laoev9l",
          "score": 5,
          "body": "Very good points on the EV crashes and the fact good markets don't always translate into growth of investment. Looking at companies like ENPH and CSIQ, they appear very solid financially but the political and economic risks are overshadowing that. More risk should equal more potential return but it's very hard to tell with solar.",
          "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laoev9l/",
          "created": 1719581703,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laonqdn",
      "score": 15,
      "body": "Interest rates are a huge impact for solar. Most.of the costs come from installation, both for commercial and residential. As a result, interest rates have a big impact on the cost of solar projects. \n\nOdd lots did a great episode on this, link [here](https://open.spotify.com/episode/2qiQCoAOofnh9r8RiS8A47?si=bjxwAsWvQsu05zOKF6Ja6g). \n\nSo a bet on solar is sort of a bet on how low interest rates will go.",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laonqdn/",
      "created": 1719584937,
      "depth": 0,
      "replies": [
        {
          "id": "laqofuw",
          "score": 9,
          "body": "Another major consideration is that state/local policy has been very unfriendly towards residential solar. States are siding with utility companies and eroding benefits that residents would realize for installing this stuff; not getting compensated for supplying excess back to the grid, not requiring scheduling deadlines for utilities to inspect/approve installations. They're making it less desirable for homeowners.",
          "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laqofuw/",
          "created": 1719609732,
          "depth": 1,
          "replies": [
            {
              "id": "lasp3x6",
              "score": 2,
              "body": "Satellite map pictures show which cities in the hot desert sun don't have any solar.\n\nIs there anything we can do about it? We need a new political party that will solve the problems and represent the people.  It may require a constitutional amendment to get more houses built and have good quality construction.  I'm not sure if the way to go is build many large solar energy plants and upgrade the power grid, or have solar panels on every rooftop.",
              "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/lasp3x6/",
              "created": 1719642595,
              "depth": 2,
              "replies": []
            },
            {
              "id": "latm3p9",
              "score": 2,
              "body": "Very interesting. The benefits you mention such as selling back to the grid is a big advantage. I had a colleague who installed solar in Europe and after a few years he even got back on his investment as selling to the grid and accumulating his own energy made it totally covered for him. I wonder if those were State support or simply what the company offered.",
              "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/latm3p9/",
              "created": 1719663357,
              "depth": 2,
              "replies": [
                {
                  "id": "latswry",
                  "score": 3,
                  "body": "Northeast has good solar incentives and states force the utilities to buy back power, but the cost of the panels and installation is insane like 25-50k depending on the size of the house and your needs. Other issue I came across is a lot of these local businesses that install the panels or roofs own the warranties and many have gone out of business within the last 5 years leaving homeowners stranded. The rates increase didn’t help .",
                  "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/latswry/",
                  "created": 1719666522,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lapcdq3",
          "score": 4,
          "body": "In addition to interest rates, the slowing homes sales will also limit sales of solar installations.  The shortage of housing prevents housing prices from declining. If the Fed lowers rates, prices will only go up faster and then fewer people will be buying homes.\n\nThe only thing that would help solar at this time is for the government to enact builder incentives so builders can intentionally overbuild to increase the vacancy rates that could drive down the prices of housing.  But neither power in the USA wants prices of housing to decline. And the voters seem to be happy with things the way they are.\n\nI believe in the long term that stagflation will cause people to learn to share housing with friends and relatives or become homeless living in shanty towns or Biden boxes. Then the next cyclical down turn would cause both housing prices and mortgage rates to fall in the start of the next cycle of home construction about 5 or 10 years from now.",
          "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/lapcdq3/",
          "created": 1719593225,
          "depth": 1,
          "replies": [
            {
              "id": "laqombf",
              "score": 3,
              "body": "Another problem is the states that are building lots of new homes are red states that have enacted policies unfriendly to solar and beneficial to incumbent utility companies.",
              "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laqombf/",
              "created": 1719609797,
              "depth": 2,
              "replies": [
                {
                  "id": "latmg6j",
                  "score": 2,
                  "body": "Good point. Especially with such technology non-savvy populations, having a \"default\" that benefits such expansion of renewables is a big thing. It's unfortunate that there is so much wasted opportunity. I wonder if there is a logistical limit to that or if companies could serve these opportunities if supported by policies. Sad to see that often political ideologies stand in front of logic and progress.",
                  "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/latmg6j/",
                  "created": 1719663529,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "latv30t",
          "score": 2,
          "body": "You're absolutely right.  Same with financials, and many other sectors.  \n\nThese stocks are beaten down really bad and seem juicy.  I wouldn't put too much of my portfolio in this but looking in the mirror this is where you go I should never have or I should have put it all in (which nobody should ever do).  \n\nEnergy has been a gargantuan bullish factor - look at uranium stocks, which are now high and yours truly missed it all.  I\"m now bullish on natural gas, watching the dash board there is a lot of summer use now and there is scheduled to be much more.  Of course if oil skyrockets thats bearish for gas... \n\nIn other words, energy, energy energy.  And copper has drawn back tremendously and what a good time to get into mining with solid companies in good districts.  It won't be a NVIDIA sugar rush but long term nothing to worry about.",
          "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/latv30t/",
          "created": 1719667461,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laoe725",
      "score": 7,
      "body": "considering where \n\n(a) interest rates are in an industry that heavily relies on debt financing \n\nand \n\n(b) the cost of inputs for competing generators of electricity (e.g. natural gas prices over the last year - [West Texas basis prices were fucking ***negative*** for a big chunk of 2024 YTD](https://imgur.com/a/MNKJ9bP), tbh sort of shocked I never saw this mentioned on /r/stocks at all.....)\n\nI would say that your question firmly falls under the header of \"probably not\"",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laoe725/",
      "created": 1719581440,
      "depth": 0,
      "replies": [
        {
          "id": "laqhs4w",
          "score": 1,
          "body": "do you know why its negative",
          "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laqhs4w/",
          "created": 1719607360,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laorhhv",
      "score": 7,
      "body": "Make money on a product that gets cheaper each year? I don’t see it happening.\n\n#RantOn  \nIt’s criminal that rooftops of new build McMansions across the USA sunbelt don’t all have solar panels atop their roofs, that those same new-builds aren’t oriented towards maximum solar collection, that domestic solar hasn’t spurred innovation like your hot water tank and fridge/freezer also taking DC inputs to store solar electricity as heat or cold respectively, etc., but energy is so cheap in the contiguous 48 and political will is eroded by big oil purchasing our politicians.\n\nNice to see domestic rooftop solar in Hawai’i, Australia, Europe (even damp overcast UK), so it can happen economically.  \n#RantOff",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laorhhv/",
      "created": 1719586245,
      "depth": 0,
      "replies": [
        {
          "id": "lave8db",
          "score": 2,
          "body": "The biggest barrier to wider adoption is that at least in many markets installation is ridiculously overpriced. I've gotten two quotes on installation where one was roughly 10x the cost of materials and another where it was \"only\" 4x (though they wouldn't admit it). The installation is a one day job and should be priced that way, but probably due to lack of competition it frequently isn't.",
          "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/lave8db/",
          "created": 1719687733,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lappkax",
      "score": 3,
      "body": "Not if 45 becomes 47",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/lappkax/",
      "created": 1719597609,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lap41ra",
      "score": 3,
      "body": "I’m watching FLNC rn. Worried about the downward momentum but if willing to take the risk I think the upside is pretty good",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/lap41ra/",
      "created": 1719590444,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laq0q2b",
      "score": 3,
      "body": "The problem with solar is it needs the government to prop it up",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laq0q2b/",
      "created": 1719601416,
      "depth": 0,
      "replies": [
        {
          "id": "lazxvzo",
          "score": 2,
          "body": "They are propping it up significantly but it’s not on the surface. Look into Section 48 of the Investment Tax Credit and what it does for companies that build commercial projects. It’s more of the same crooked methods in which valuation is subjective. The ITC revision is 30% of the property but the appraisers can/will place a value upwards of double the initial contract. For example, I have a project closing that took nearly $4M to build but has been appraised north of $10M. The initial construction price will be washed due to the ITC but the owner of the project will generate pure profits (almost) immediately once power comes on. So, the gov’t is pumping money into solar through subsidies and tax credits but it’s the corporations cleaning up, not the consumers/home owners like it was promised. If you invest in solar, do it through the companies that own solar farms.",
          "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/lazxvzo/",
          "created": 1719765382,
          "depth": 1,
          "replies": [
            {
              "id": "lb09auv",
              "score": 1,
              "body": "Thanks for shining a light on the details",
              "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/lb09auv/",
              "created": 1719769296,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lawiho5",
      "score": 3,
      "body": "Looked like a genuine buying enphase stock in 2020 now it’s the same price as when I bought it. But I’m still holding on!",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/lawiho5/",
      "created": 1719703007,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laohftd",
      "score": 2,
      "body": "I think there's a valid question in terms of parts of green energy (residential solar a primary one) where the level of reliance on low rates has to be considered and we are not likely going back to ultra low rates. \n\nCommercial solar doing reasonably well. EV theme has slowed materially and it should be clear at this point that the automotive industry has - with a couple of exceptions, never been a good industry to invest in and EVs don't change that. The infrastructure needed to appeal to a broader audience/expand the TAM isn't being built (https://www.washingtonpost.com/climate-solutions/2024/03/28/ev-charging-stations-slow-rollout/, \"Biden’s $7.5 billion investment in EV charging has only produced 7 stations in two years\") and you're getting to a point where the early adopters have adopted - incrimental growth beyond here becomes more difficult. \n\nJust ask this list of EV companies, a number of which have either went bankrupt or are close (and most of those went public in 2020/21...) https://pbs.twimg.com/media/GQvwk3Xa0AAXDO9?format=jpg&name=large\n\nThere is a name in Europe called Alfen that went up about 1000% between 2018 and 2022 on hopes for ev charging, energy storage and other green efforts. The stock is down 85% from the high and was down 40% the other day after a disasterous earnings report.",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laohftd/",
      "created": 1719582674,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laoj0og",
      "score": 2,
      "body": "Solar companies will struggle to be profitable when the market is wide open and cheap panels are being over-produced worldwide (and even over-installed in some countries that are having to deal with too much solar power being generated). Unless there's some unforeseen issue down the road that will limit the ability to make solar panels (a silver shortage maybe, but some companies are having success with copper-based photovoltaics) it's a race to the bottom for price with no compelling investment case for profit.",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laoj0og/",
      "created": 1719583254,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laom8mf",
      "score": 2,
      "body": "The economist had some interesting analysis recently that basically there's massive oversupply in the market, mostly caused by state support:\n\n>Yet the rapid growth of Chinese capacity, which has outpaced global demand, has also squeezed much of the profit out of the industry. Polysilicon, wafers, cells and finished modules now sell below their average production cost. Collapsing prices caused Chinese solar export revenues to fall by 5.6% last year, according to Wood Mackenzie, even as volumes soared. longi’s share price has slumped by some 60% since the start of 2023. \n\n>In March the company said it would fire 5% of its workers, citing an “increasingly complex and competitive environment”. The share prices of other Chinese solar giants, including Trina Solar, ja Solar and Jinko Power, have also been battered\n\n>State support for the industry is contributing to the supply glut. For decades leaders of municipal and provincial governments in China have sought to build local solar industries that hire from their populations and contribute taxes. \n\n>Support comes in a variety of forms, including free land, free electricity, interest-free loans and access to cutting-edge technologies, notes Usha Haley of Wichita State University. She reckons all this adds up to about 35% of a solar company’s costs, on average, but could be as high as 65% in some cases.\n\nSo yeah personally I wouldn't go near the solar market.\n\nYes there's going to be booming demand for a long time and a huge amount of panels sold, and no one will be making money on them.",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laom8mf/",
      "created": 1719584415,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lapbo3r",
      "score": 2,
      "body": "Get ready to be burned",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/lapbo3r/",
      "created": 1719592992,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lapd3zl",
      "score": 2,
      "body": "GE Vernova is a good stock for electric. And GE aerospace to they just announced recently they are working on electric commercial airplanes.",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/lapd3zl/",
      "created": 1719593465,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lapmfne",
      "score": 2,
      "body": "Lmao, funny you posted this right after the debates",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/lapmfne/",
      "created": 1719596565,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laqgdz8",
      "score": 2,
      "body": "Solars are like Intel: always seem a bargain",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laqgdz8/",
      "created": 1719606877,
      "depth": 0,
      "replies": [
        {
          "id": "latllbg",
          "score": 2,
          "body": "Intel has had questionable management, strategy and financials. Some solar companies have had the opposite, doing really well until last year. The main issue seems to be capital costs of expansion and uncertain demand/political support.",
          "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/latllbg/",
          "created": 1719663102,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laqtjbp",
      "score": 3,
      "body": "Why think in 2025  terms.. think long term. Do you see long term the world moving to solar .. how does the grid change to accommodate distributed unreliable prosumer based power generation... Buy those stocks and then wait and watch... It might be 2025 but it is most likely growth over the years",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laqtjbp/",
      "created": 1719611617,
      "depth": 0,
      "replies": [
        {
          "id": "latnowc",
          "score": 2,
          "body": "It seems like a no-brainer the expansion of solar installation and moving to such a shared grid. Bu the resurgence of the far right across the world, nothing is certain anymore.\n\nIt's also the logical investor question: is it worth buying now hoping for a boom in 4 years or can I get something else that will rise more in that timeline ? Although many analyst expect a boom end of 2025 as explained in post.",
          "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/latnowc/",
          "created": 1719664131,
          "depth": 1,
          "replies": [
            {
              "id": "latzvho",
              "score": 2,
              "body": "Far right in not all countries are anti science... I think only in this country... Europe Asia China etc are very much pushing for solar... \nYes political stuff will impact in short term.. no doubt... Trump winning will decimate solar perhaps... But I think in a long term perspective it's a blip... You can dca .. to let the averages work out for you.",
              "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/latzvho/",
              "created": 1719669443,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "larjnjx",
      "score": 2,
      "body": "Too many cheap competitors from overseas and too fragmented ",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/larjnjx/",
      "created": 1719621902,
      "depth": 0,
      "replies": []
    },
    {
      "id": "latsvwb",
      "score": 2,
      "body": "I think it'll take a long time for solar to be truly independent of state policy. As such I'll stay away from individual stocks. I've chosen the World Momentum ETF instead to maybe catch some of the stocks with momentum from that sector.",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/latsvwb/",
      "created": 1719666512,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lau31qu",
      "score": 2,
      "body": "If US goes red this election season, solars gonna have a real tough road.",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/lau31qu/",
      "created": 1719670688,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laupug7",
      "score": 2,
      "body": "Solar companies aren’t making money with copious subsidy under a blue gov as it is… after the debate this week I wouldn’t be confident enough to put my money that the office will stay blue either. \n\nLook at solar company stock charts surrounding elections, especially when there’s a party shift. Not where I’d put my dollar.",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laupug7/",
      "created": 1719678764,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb5wfr5",
      "score": 2,
      "body": "Yeah. This depends on what happens on November 5th and who is in the Oval office, totally independent of technology imho",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/lb5wfr5/",
      "created": 1719857973,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laoge52",
      "score": 3,
      "body": "i own a roofing business and will tell you from experience-\n\nwhile solar is a great idea in a vacuum it’s absolutely excited horribly in real life. constant problems, the shelf life is horrible on all products, it is not a very promising unit to bet on.",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laoge52/",
      "created": 1719582283,
      "depth": 0,
      "replies": [
        {
          "id": "laovrbc",
          "score": 1,
          "body": "Putting them on a roof on a lease contract never made any sense to me.",
          "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laovrbc/",
          "created": 1719587698,
          "depth": 1,
          "replies": [
            {
              "id": "lap9p4d",
              "score": 2,
              "body": "we don’t. \n\nwe don’t even work with solar companies because it *that* bad",
              "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/lap9p4d/",
              "created": 1719592333,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lap6mgr",
      "score": 2,
      "body": "TAN p/e is under 10. AI needs energy. TAN should double from here if it had a regular p/e multiple. \n\nThe reality is that these stocks are shorted massively by hedge funds and they won't go up unless the hedge funds stop shorting them.",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/lap6mgr/",
      "created": 1719591309,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laqa519",
      "score": 2,
      "body": "There is the increased risk of tariffs on Chinese solar panels, given a Trump presidency. The green argument doesn’t work anymore especially when Biden shut the doors for Chinese EVs. Otherwise energy is usually a good bet during inflationary periods.",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laqa519/",
      "created": 1719604697,
      "depth": 0,
      "replies": [
        {
          "id": "lazzorv",
          "score": 1,
          "body": "The good thing, for solar anyways, is that both sides of the aisle benefit from commercial solar. Construction costs will vary but tax credits and incentives are easily manipulated to reduce overhead and in some cases, like section 48 of the ITC, wash the initial construction costs away the following tax year. That creates nearly 30 years of ridiculous profits if the site was built correctly.",
          "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/lazzorv/",
          "created": 1719766007,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laojhoe",
      "score": 1,
      "body": "Are you asking: “Is 2025 their time for basking in the sun?”",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laojhoe/",
      "created": 1719583429,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laq1l5j",
      "score": 1,
      "body": "Until solar is cheap enough to make sense for everyone, no, no it’s not time",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laq1l5j/",
      "created": 1719601719,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laqfltf",
      "score": 1,
      "body": "Only tesla… they got roof, storage and solars. They are making serious progres each year and people still think this is car company. They will increase their dominance in solar faster then people think 📈✨",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laqfltf/",
      "created": 1719606600,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lar6c0e",
      "score": 1,
      "body": "Maybe more A/C manufacturers?",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/lar6c0e/",
      "created": 1719616595,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laswwb8",
      "score": 1,
      "body": "FSLR",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laswwb8/",
      "created": 1719647903,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbdk9nv",
      "score": 1,
      "body": "  F.p6m      \n..",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/lbdk9nv/",
      "created": 1719969498,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laok3hv",
      "score": 1,
      "body": "After the debate, Trump's chances of being president again have gone up. Another trump presidency will kill green energy projects. So depending on what happens in November, solar will either stay on an upward trajectory or be shelved for the next decade.",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laok3hv/",
      "created": 1719583649,
      "depth": 0,
      "replies": [
        {
          "id": "laonurr",
          "score": 2,
          "body": "Now, that's what'd you'd generally think, but I'd keep an open mind.\n\n\nI'll repeat what I've said recently a couple times, hot take: I'd sell any oil stocks that aren't related to drilling by January 2025 (I'm not someone you can discuss the drilling part with though) in the event of a Trump win. Yes, the GOP is viewed as being favorable to oil, but the thing is, it's so favorable that oil probably comes down. \n\n\nIt's possible solar is tied more to rates now.",
          "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laonurr/",
          "created": 1719584981,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laohpho",
      "score": 0,
      "body": "pump it!",
      "permalink": "/r/stocks/comments/1dqjcjt/is_2025_the_time_for_solar_stocks/laohpho/",
      "created": 1719582774,
      "depth": 0,
      "replies": []
    }
  ]
}