{
  "title": "Why is Disney stock only going down after Q1 report, which were good?",
  "score": 158,
  "selftext": "Man, I just don't understand stock market, Disney has good Q1 earnings, Disney+ finally turns profit,  it has major releases this year, so it takes -10% for last month.  \n  \nIn other turn, TESLA is burning pile of garbage, literally every product has flaws, their cars are withdrawn because of major safety issues and they don't deliver features which they previously promoted (isn't that fraud?), so naturally it's +10% for last month.\n\nCan someone explain this? How does it work? Is whole market just \"bigger fool\" or gambling on \"potential growth\" now?",
  "link_flair_text": "Company Question",
  "id": "1dqn1hh",
  "num_comments": 189,
  "created_utc": 1719590221,
  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/",
  "comments": [
    {
      "id": "lap66a5",
      "score": 315,
      "body": "Idk anything about Disney specifically, but when the stock moves opposite to the earnings report it may seem counterintuitive but it's just this: the stock is moving relative to expectations, not relative to their last earnings report. It doesn't matter if a company crushes earnings if the market was expecting it to crush earnings even harder.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lap66a5/",
      "created": 1719591159,
      "depth": 0,
      "replies": [
        {
          "id": "lapqu3o",
          "score": 100,
          "body": "In simpler words:future guidance is more important than present profits.",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapqu3o/",
          "created": 1719598039,
          "depth": 1,
          "replies": [
            {
              "id": "lasohf8",
              "score": 13,
              "body": "Yup — people aren’t always thinking long term for the company. They’re thinking long term of their money.\n\nIf a company crushes earnings and then its expected things slow down, people wanna maximize. Even if it isn’t their full position, they’ll wanna move it somewhere because to them this is as high as it gets",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lasohf8/",
              "created": 1719642198,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lat6t5p",
              "score": 11,
              "body": "Or in other other words: Disney is down 30% over the last 5 years, 90 bil revenue, 1 bil net income. Current P/E = 107. It's not even about guidance",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lat6t5p/",
              "created": 1719654581,
              "depth": 2,
              "replies": [
                {
                  "id": "latoy19",
                  "score": 13,
                  "body": "The nerds have abandoned them. And the princesses grew up.",
                  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/latoy19/",
                  "created": 1719664721,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lapc1x0",
          "score": 63,
          "body": "This is the correct answer. And you're probably not dealing with the expectations of the general population. It's likely a few hedge funds that have shifted their holdings, but since their holdings are massive, it can cause the stock to move down. \n\nMany people think a business's stock performance acts according to the business's performance. This may have been loosely true in the beginning of the stock market, but the gamesmanship involved in trading between hedge funds and holding companies makes it only occasionally true. This is how some folks end up feeling a stock's value might be \"detached\" from the reality on the ground.\n\nThis is why stocks like NVIDIA scare me. The market has priced its stock such that the company needs to be almost beyond perfect for the foreseeable future. If the market gets a whiff that AI isn't going to be 100% as impactful as currently believed, it could cause the next recession.",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapc1x0/",
          "created": 1719593116,
          "depth": 1,
          "replies": [
            {
              "id": "laqffy1",
              "score": 20,
              "body": "There are single funds that have billions and tens of dollars and when wealth is that concentrated, insider trading laws don't matter. A retirement fund for state workers can make or break just about any stock short term if they really want to.",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqffy1/",
              "created": 1719606544,
              "depth": 2,
              "replies": []
            },
            {
              "id": "laqphlq",
              "score": 6,
              "body": "I think every hedge fund and their Grandma jumped on the stock. Meme stock meets band wagon meets legit company. Everyone is just cashing out now.",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqphlq/",
              "created": 1719610119,
              "depth": 2,
              "replies": [
                {
                  "id": "lasc6p9",
                  "score": 4,
                  "body": "Meme stocks don't have earnings like Nvidia.",
                  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lasc6p9/",
                  "created": 1719634875,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "latc6wi",
                      "score": 2,
                      "body": "I mean the concept of a meme stock. Jumping on all at once from non traditional investors",
                      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/latc6wi/",
                      "created": 1719657997,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "latds4f",
                          "score": 1,
                          "body": "Traditional investors? \n\nHow many shares do you have in a water powered flour mill? \n\nThose Newspaper stocks just quite return what they used to huh? :)  \n\n\nThese new fangled refrigerators will be the death of the daily ice truck mans living..  \n\n\n:D",
                          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/latds4f/",
                          "created": 1719658942,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "latee0j",
                              "score": 2,
                              "body": "It's a DIY wind mill in fact. I'll have an IPO soon for my A to Z mil and bakery.",
                              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/latee0j/",
                              "created": 1719659300,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "latgvkd",
                                  "score": 2,
                                  "body": "Lol..",
                                  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/latgvkd/",
                                  "created": 1719660679,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "laqgo4l",
              "score": 7,
              "body": ">  it could cause the next recession.\n\nThat's a little hyperbolic, to be fair. It could certainly put the market into bear country for a time, but there's isn't really a feasible mechanism for even an overly concentrated, bubbled up market to cause much more than a brief blip in economic growth. Recessions aren't based on the markets, but on the economy, which isn't fundamentally changed by the stock prices of a few companies.",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqgo4l/",
              "created": 1719606976,
              "depth": 2,
              "replies": [
                {
                  "id": "laqlemy",
                  "score": 9,
                  "body": "It boils down to the combination of NVIDIA's outsized impact on the SP500 (accounting for like 30% of it's growth this past calendar year) and the pervasiveness of investments being made beyond chips in advance of the AI future everyone is expecting (ex: data centers). \n\nAnd I wholly disagree that the markets don't trigger recessions. The economy grows based on investments, and if big-time investors sour, the health of the economy sours. The construction industry didn't come to a screeching halt in 2008 for lack of wood and nails.",
                  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqlemy/",
                  "created": 1719608633,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lar7xo4",
                      "score": 3,
                      "body": "with or without crazy advancements in AI chips are going to be a sector as important to our society as agriculture and energy.",
                      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lar7xo4/",
                      "created": 1719617220,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "larabpj",
                          "score": 6,
                          "body": "I mean that’s true, but NVIDIA’s meteoric rise is exclusively due to their AI chip production.",
                          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/larabpj/",
                          "created": 1719618156,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lapjqd2",
          "score": -1,
          "body": "But didn't general public expect for Disney to basically die after 2023 compared to previous years? Like fall of marvel and decline of subscription platforms",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapjqd2/",
          "created": 1719595668,
          "depth": 1,
          "replies": [
            {
              "id": "lapprin",
              "score": 28,
              "body": "> But didn't general public expect for Disney to basically die after 2023 compared to previous years?\n\nYou're referring to the company that's worth $230bn in enterprise value that's existed for the last century, right? Just want to make sure we're talking about the same ticker here....",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapprin/",
              "created": 1719597677,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lapq54u",
              "score": 14,
              "body": "The general public are incredibly dumb and have no understanding of financial markets.\n\nI have an MBA that I don’t use that I feel that I have a C+ understanding of the stock market. I’m saying that to explain pure humility.\n\nI have been through financial valuation of companies and discounting cash flows.",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapq54u/",
              "created": 1719597805,
              "depth": 2,
              "replies": [
                {
                  "id": "lascbn0",
                  "score": 0,
                  "body": ">The general public are incredibly dumb\n\nThen goes on to claim humility, lol.",
                  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lascbn0/",
                  "created": 1719634948,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "laqab39",
              "score": 11,
              "body": "It doesn’t matter what the general public thinks. It matters what investors think. Disney is facing systemic risks on a number of fronts. Traditional TV is dying so the Disney Media Networks division is in decline. 2023 and 2024 so far have been the worst box office flops for Disney in decades. They managed to kill three beloved franchises in the space of a few short years. Customer park sentiment is waning on the back of complaints of poor maintenance, overcrowding, long wait times, and nickel and diming. They had to shelve a billion dollar Star Wars hotel after just a year because of poor attendance and reviews. To top it all off, for reasons unknown, they started a war with the governor of Florida and ended up losing independent provincial legal status for Disney World.\n\nThese risks require outsized returns to justify investment. Disney is not delivering that. There is a reason their stock price has only gained an average of less than 1% per year over 10 years.",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqab39/",
              "created": 1719604756,
              "depth": 2,
              "replies": [
                {
                  "id": "lar2jx7",
                  "score": 5,
                  "body": "Sometimes the customer isn’t always right. But investors do care about what the general public thinks. Especially for a direct to consumer brand. The public perception of the brand is important",
                  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lar2jx7/",
                  "created": 1719615112,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lapr89n",
              "score": 1,
              "body": "> But didn't general public expect for Disney to basically die after 2023 compared to previous years?\n\nIf they did expect that then the share price of Disney would have already cratered from the current levels.\n\nThis is oversimplified, but essentially: the price of the stock reflects how the public collectively thinks the company is doing and is going do in the future.",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapr89n/",
              "created": 1719598172,
              "depth": 2,
              "replies": [
                {
                  "id": "laqkg88",
                  "score": 8,
                  "body": "General public perspective although, Disney parks  have some amazing experiences.  Visiting the parks in an off season just prior to Covid you’re waiting 3.5 + hours in line for one ride.  Luckily you can bring food in, the cost of food is over the top.  You’re paying restaurant prices for really bad takeaways and watered down soda.  It’s not affordable to the average person.   The experience is definitely magical but it isn’t enough to bring me back to do it again. \n\nAlso coming back from the parks, Post Covid I would say Disney has not released any movies of note that I would be prepared to pay money for in a cinema, it’s also got to the point where I have cancelled my Disney plus.  I can purchase all the classics that I love on CD, the new films are really not relatable and seem to be all caught up in political ideologies.  I prefer not to be apart of this movement.  They’re following populist trends, which are often not supported by the silent majority who will open their wallets elsewhere.",
                  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqkg88/",
                  "created": 1719608293,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "laqnq6i",
              "score": 1,
              "body": "There is a political issue to Disney sales and stock performance that is separate from financials. Certain individuals and groups are very anti-Disney and preach that they'll die off due to the politics of Disney. Disney was a bit concerned for a little bit, then many people discovered that those boisterous individuals and groups were generally not Disney customers to begin with. \n\nSome mistakes were made with Disney+ short term that may profit longer-term. Disney often looks ahead more than most and invests for a longer term profit, and sometimes lucks out longer term than shorter term.",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqnq6i/",
              "created": 1719609472,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "laqks7i",
          "score": 0,
          "body": "Also shorts",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqks7i/",
          "created": 1719608410,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lap68bi",
      "score": 27,
      "body": "> Can someone explain this? How does it work? Is whole market just \"bigger fool\" or gambling on \"potential growth\" now?\n\nOn a day to day, week to week and even month to month basis, yeah, kind of.\n\nWhen you start looking on the scale of years and, especially, decades, a lot of the dumb behavior falls away and bends toward the realities of the various businesses.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lap68bi/",
      "created": 1719591178,
      "depth": 0,
      "replies": [
        {
          "id": "largnzr",
          "score": 8,
          "body": "\"In the short run, the market is a voting machine but in the long run it is a weighing machine.\" - Benjamin Graham",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/largnzr/",
          "created": 1719620684,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lap4xhb",
      "score": 40,
      "body": "Leftovers from the proxy fight. Selling their positions. I'm holding during the buyback.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lap4xhb/",
      "created": 1719590740,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lape051",
      "score": 9,
      "body": ">Can someone explain this? How does it work? Is whole market just \"bigger fool\" or gambling on \"potential growth\" now?\n\nWelcome to the reality of trading.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lape051/",
      "created": 1719593757,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lasiyo5",
      "score": 5,
      "body": "Disney is such a waste of capital. You can get better returns even with slow S&P lol",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lasiyo5/",
      "created": 1719638760,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lapc9m4",
      "score": 10,
      "body": "It initially went down because they hinted during the earnings call that there may be softness at the parks this quarter. Don't get me wrong the parks will still do well but just not as good as some analysts were expecting.  Its probably down today because other consumer stocks have had some weak results, such as Nike.  The concern is a slowdown in consumer spending will hit Disney's earnings also.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapc9m4/",
      "created": 1719593186,
      "depth": 0,
      "replies": [
        {
          "id": "laqd037",
          "score": 2,
          "body": "This is what I don’t understand.\n\nWhat does Nike have to do with Disney- a company that has tons of IP, a streaming service, theme parks, and a cruise line? \n\nDisney sells experiences. Nike sells shoes. They’re in totally different markets. \n\nYes both Nike shoes and Disney products are bought with US dollars but the idea that these companies are somehow related seems ludicrous to me.",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqd037/",
          "created": 1719605693,
          "depth": 1,
          "replies": [
            {
              "id": "lar3npq",
              "score": 9,
              "body": "Consumer discretionary is a category",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lar3npq/",
              "created": 1719615541,
              "depth": 2,
              "replies": [
                {
                  "id": "larbvyd",
                  "score": 0,
                  "body": "Kelloggs is in the consumer discretionary category too. Along with Royal Caribbean. Do you honestly think those companies should trade together?",
                  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/larbvyd/",
                  "created": 1719618770,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "larkiz4",
                      "score": 3,
                      "body": "You can quantify the correlation. And it’s not just 1 or 0",
                      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/larkiz4/",
                      "created": 1719622261,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lasi5rv",
                      "score": 2,
                      "body": "Actually Kelloggs is in the Consumer Staples division.",
                      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lasi5rv/",
                      "created": 1719638277,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "latw5zi",
                      "score": 2,
                      "body": "Kelloggs is a non-cyclical business, which means it is a consumer staple and not a consumer discretionary product.",
                      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/latw5zi/",
                      "created": 1719667920,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "latvjbc",
              "score": 1,
              "body": "The relation is to the spending power of the consumer. As things stand right now there is a concern that people are putting less money towards discretionary spending.",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/latvjbc/",
              "created": 1719667652,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lapd5mf",
      "score": 10,
      "body": "It is the psychology of buying and selling. Fundamentals doesn't matter when the company expectations is higher, moreover certain aspects of this company isn't doing well.  That said Disney has gained over 10% since start of year although it is far from pre-pandemic prices at ~$130\n\nTesla has a lot of hype which agrees with their pockets, thus making the stock price ridiculously higher. \n\ntldr; \"Market can stay irrational longer than you can stay solvent\"",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapd5mf/",
      "created": 1719593480,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laplh7z",
      "score": 18,
      "body": "Teslas doing just fine. I think a lot of people out there would rather have all their money in Tesla than Disney.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laplh7z/",
      "created": 1719596248,
      "depth": 0,
      "replies": [
        {
          "id": "laqbel6",
          "score": 13,
          "body": "Well, over the last 10 years, Tesla is up 1,240%. Disney is only up 10% during the same period. In total.",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqbel6/",
          "created": 1719605137,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lasd06r",
          "score": -2,
          "body": "I was in Tesla and think Musk is one of the great geniuses that has ever lived. ..and I got out of Tesla when I realized he's also PT Barnum.",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lasd06r/",
          "created": 1719635320,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laqfi1w",
      "score": 15,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqfi1w/",
      "created": 1719606563,
      "depth": 0,
      "replies": [
        {
          "id": "lascohl",
          "score": 8,
          "body": ">maybe you guys aren't that smart as you think, huh?\n\nOh.. that arrogance of redditors is off the chart.  What happens when everyone is anonymous and can't be tracked down like they can on FB.",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lascohl/",
          "created": 1719635140,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lasn9xb",
          "score": 3,
          "body": "The market can remain irrational longer than Redditors can remain solvent.",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lasn9xb/",
          "created": 1719641431,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lapn0lj",
      "score": 4,
      "body": "Big drops in the linear networks and a bad guidance for Q3 DTC",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapn0lj/",
      "created": 1719596760,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lapi9rl",
      "score": 11,
      "body": "Great company that's made some mistakes. I'll load up if it gets into the 80s again.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapi9rl/",
      "created": 1719595186,
      "depth": 0,
      "replies": [
        {
          "id": "laq82bf",
          "score": 6,
          "body": "Exactly. Bro is talking about a pullback but conveniently omits the run up from 80 to about 120",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laq82bf/",
          "created": 1719603977,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lau09gf",
          "score": 4,
          "body": "Calling it some mistakes is the understatement of the decade. \n\nDisney+ was a technical trainwreck. They practically assassinated the Marvel and Star Wars franchises. Their theme parks are hemorrhaging visitors faster than a sinking ship.\n\nThey seem keener on poking their noses into politics and pandering to political correctness than, you know, actually making money.",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lau09gf/",
          "created": 1719669600,
          "depth": 1,
          "replies": []
        },
        {
          "id": "laqis4h",
          "score": -4,
          "body": "Some mistakes? Their obsession with the woke agenda ruins the Company ",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqis4h/",
          "created": 1719607711,
          "depth": 1,
          "replies": [
            {
              "id": "laqk0to",
              "score": 5,
              "body": "I don't agree an iconic brand like Disney is ruined. Agree they've made some poor decisions, but believe our grandkids will be enjoying Disney material.\n\nDon't invest based on your political views. Invest to make $.",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqk0to/",
              "created": 1719608145,
              "depth": 2,
              "replies": [
                {
                  "id": "laqkkzs",
                  "score": 10,
                  "body": "To me it Shows their Management is disconnect from the audience and pushing an Agenda is More Important than producing Quality Content. Acolyte is another testiment to that. Just terrible leadership ",
                  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqkkzs/",
                  "created": 1719608339,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lasn1l7",
                      "score": 0,
                      "body": "That's what I like about the stock (for a reasonable price). Stupid managment has run it down, creating opportunity.",
                      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lasn1l7/",
                      "created": 1719641279,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "laqurso",
                  "score": 5,
                  "body": "People will still be enjoying Disney content,  Kind of like people still buy Elvis songs, they will buy the classics.  \n\nI agree with this poster that they're not in touch with their core traditional customers.\n\nIt is a very narrow view to say don't invest based on your political views, if there is a large base of your customers actively giving feedback that don't agree with the direction you're taking as a company then those views matter.  \n\nDisney plus is probably the most affordable, interface into Disney for the average person.  The steady decline in Disney plus reflects the view of the average person.",
                  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqurso/",
                  "created": 1719612084,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lar2xi2",
                      "score": 6,
                      "body": "They don’t even have to be your own political view. If you have an objective look at the market, it’s evident that the Disney brand has changed and it’s turned off swaths of people",
                      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lar2xi2/",
                      "created": 1719615261,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lapfnuo",
      "score": 30,
      "body": "Yikes if you're getting all your news about TSLA on Reddit. Try reading different news sources or even look at people's opinions on X. Redditors were so damn sure Elon wouldn't get the approved pay package but boy were they wrong...again. It's completely wild how people think different outside of Reddit. Or even hop onto Tesla Model 3 or Y subreddits and see what owners think about the product, instead of just saying \"EVERY PRODUCT HAS FLAWS\"....based on your own assumption?🤷🏻‍♂️",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapfnuo/",
      "created": 1719594312,
      "depth": 0,
      "replies": [
        {
          "id": "laq55w0",
          "score": 13,
          "body": "Reddit = uncompromisingly idealistic and naive ",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laq55w0/",
          "created": 1719602968,
          "depth": 1,
          "replies": [
            {
              "id": "lasdbi2",
              "score": 4,
              "body": "Reddit = arrogant and (at times) vicious, sociopaths.  \n\n\n..it seems my experiences differ from yours :)",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lasdbi2/",
              "created": 1719635493,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lapumm4",
          "score": 1,
          "body": "I don't know why redditors hate Tesla and Elon Musk, what is their problem?.",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapumm4/",
          "created": 1719599316,
          "depth": 1,
          "replies": [
            {
              "id": "lapzxg3",
              "score": 5,
              "body": "The hate for Musk, which was while he was a darling of the left, started as hit pieces by organizations through news outlets to try to cause Tesla stock price problems.  However, once Musk reached a certain point of popularity little things started to add up like the cave diving thing, but even that didn't sink him.\n\nUltimately what turned the hate to him as the majority was his opinions on Covid during the pandemic, everything after that including buying twitter were post Elon hate times and just amplified even more.  When someone is listed as the richest person and don't say what people like they become evil and vilified regardless of who they are.  It becomes a Halo/Horns effect where regardless of whether something is objectively good/bad to a person (meaning if they applied their logic, perception, etc equally) they still see that person with that halo or horn.\n\nMost rich people sit behind the scenes (rich families do this) and public ones have many lawyers and PR that carefully coordinate the correct and socially acceptable talking points so as not to inflame the mobs.\n\nHow does this affect stocks?  These are emotional responses, getting people riled up if you want something like Tesla stock to go up or down, and affect legislative or executive policy, then all you have to do is get the mob to light their fires and get their pitchforks.  Ultimately, any time Elon is mentioned there is an NPC-like reflex that you can count on for comments no matter where on reddit it might be.  \n\nMany of them are the same factually incorrect information that has been corrected many times but the comforting lie continues.  This doesn't just apply to Musk either, I'm sometimes browse a conspiracy sub and 90% have become rageclickbait headlines or images of a dumb tweet that is completely incorrect or the poorest logic possible.  Nuance is dead online for the most part and if I left my house I may be afraid it is lost out there too.",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapzxg3/",
              "created": 1719601141,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lataycm",
              "score": 1,
              "body": "Because LITERALLY EVERY product has flaws?!?!",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lataycm/",
              "created": 1719657240,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "laqdydr",
          "score": -1,
          "body": "Compared to other websites, reddit is pretty good.",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqdydr/",
          "created": 1719606024,
          "depth": 1,
          "replies": [
            {
              "id": "laqht1z",
              "score": 9,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqht1z/",
              "created": 1719607369,
              "depth": 2,
              "replies": [
                {
                  "id": "lasdd2v",
                  "score": 1,
                  "body": "You missed out the overly arrogant part too..",
                  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lasdd2v/",
                  "created": 1719635517,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "laqiv3v",
                  "score": 0,
                  "body": "you're not trying hard enough then",
                  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqiv3v/",
                  "created": 1719607740,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lar3axr",
                      "score": 6,
                      "body": "The collective hive mind of Reddit gets certain things wrong",
                      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lar3axr/",
                      "created": 1719615405,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lapwx0z",
      "score": 7,
      "body": "Star wars",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapwx0z/",
      "created": 1719600101,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lapn6nh",
      "score": 3,
      "body": "We're back in a mode market wise where we're not really trading off fundamentals, so I don't think comparing and contrasting off fundamentals to TSLA is very useful right now.\n\nIn hindsight, we really shouldn't be surprised even if the Nasdaq got back to a record via mostly other names other than AAPL and TSLA, as I was saying earlier this year that it was strange it was this hot with nothing from AAPL and TSLA slumping hard (and really, still in a slump). Now AAPL broke its ATH and TSLA woke up a little, so there you have it.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapn6nh/",
      "created": 1719596816,
      "depth": 0,
      "replies": [
        {
          "id": "lar3huw",
          "score": 1,
          "body": "When can you even say there’s a time period that we were?",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lar3huw/",
          "created": 1719615478,
          "depth": 1,
          "replies": [
            {
              "id": "lar8s68",
              "score": 1,
              "body": "2022 for a minute.\n\nNah, in reality, 2023 wasn't that bad. It's only really getting crazy this year, although we may be forgetting how crazy bubbles can get.",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lar8s68/",
              "created": 1719617553,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lappofw",
      "score": 3,
      "body": "For a lot of companies it's not enough to just have good earnings. A lot of the times people's expectations are simply too high. They're expecting the most growth out of those companies when most of them are so big it's hard to maintain rapid growth rate. So whenever investors feel they're slowing down, they pull out.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lappofw/",
      "created": 1719597648,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lapsz1v",
      "score": 3,
      "body": "its about buyer sentiment. many are bearish at the direction disney has been going, where many are bullish in the direction tesla is heading. short term profits and issues dont always affect larger macro trends in the economy. for example, many expect tesla to release their robo taxi service soon, and their AI infrastructure and tools are getting stronger which plays into the AI narrative that is fueling the market hysteria now.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapsz1v/",
      "created": 1719598761,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laqi5fp",
      "score": 3,
      "body": "Earnings can beat expectations, but if the company revises guidance for its next earnings report downward, the stock will fall anyway.\n\nTesla only ever claims the moon in its guidance.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqi5fp/",
      "created": 1719607490,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lask0z2",
      "score": 3,
      "body": "Pretty reasonable thing to ask until I saw the comments about tesla. If you could read and find out all those negative things about tesla, I don't see how you couldn't for Disney. This guy definitely have shares in disney",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lask0z2/",
      "created": 1719639400,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lap7248",
      "score": 12,
      "body": "All legacy media is doing poorly right now. TV (the traditional cable bundle) is dying faster than expected and streaming gains aren’t enough to offset the declines. The only saving grace for tv, live sports is becoming more and more expensive to maintain the right for (see nba). The biggest engine for Disney, which are its theme parks, are also showing signs of a post Covid decline. That being said, the declines in Disney isn’t as bad as other the other legacy media companies (see paramount)",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lap7248/",
      "created": 1719591454,
      "depth": 0,
      "replies": [
        {
          "id": "laq3n8x",
          "score": 6,
          "body": "I frequent the parks a lot since I live in the area. Those parks are madhouses. I saw something they they have authorization to build another park. Hopefully they actually go through with that. I've been tempted to buy Disney for a while now but haven't pulled the trigger.",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laq3n8x/",
          "created": 1719602436,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laq68rv",
      "score": 10,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laq68rv/",
      "created": 1719603348,
      "depth": 0,
      "replies": [
        {
          "id": "laqtkdz",
          "score": 5,
          "body": "[removed]",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqtkdz/",
          "created": 1719611628,
          "depth": 1,
          "replies": [
            {
              "id": "laraf4w",
              "score": 2,
              "body": "Well, activism and business are two different things. So if they have a clue, they’re just going to war with cultural icons. To destroy them. It doesn’t work in business. The CEO and Board of Directors do not get to play evil, totalitarian dictator with the market. ",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laraf4w/",
              "created": 1719618194,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lar60ny",
      "score": 4,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lar60ny/",
      "created": 1719616473,
      "depth": 0,
      "replies": [
        {
          "id": "latwr39",
          "score": 0,
          "body": "They've been doing message-first storytelling basically forever though?\n\nEvery Disney princess film, The Lion King, Brother Bear etc. Don't tell me there was no messaging going on.",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/latwr39/",
          "created": 1719668167,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "larvt08",
      "score": 5,
      "body": "Cause The Acolyte sucks",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/larvt08/",
      "created": 1719627000,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lapr1uu",
      "score": 9,
      "body": "You're betting on a turn around story.  \n\nIn the medium term, Disney will remain a value trap.  When the street decides it's investible the stock will rise again.  \n\nStart reading what buffett wrote and said.  Everything.  Your answer is right there.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapr1uu/",
      "created": 1719598111,
      "depth": 0,
      "replies": [
        {
          "id": "laqe7ls",
          "score": -4,
          "body": "Lol the turn around story is rn disney is far from a value trap",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqe7ls/",
          "created": 1719606113,
          "depth": 1,
          "replies": [
            {
              "id": "laqofts",
              "score": 6,
              "body": "I'll happily wait for accumulation and a break out, not gamble my savings away. \n\nI agree at some point it will turn around.  It is in my watch list, and boy I'm not a buyer yet.",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqofts/",
              "created": 1719609732,
              "depth": 2,
              "replies": [
                {
                  "id": "laqv7j9",
                  "score": 0,
                  "body": "Its Your lose this time next year you will regret",
                  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqv7j9/",
                  "created": 1719612252,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "larbzl5",
                      "score": 0,
                      "body": "Your poor grammar aside, no I won't lose out.  The breakout will be very apparent.  Timing a bottom and waiting for a technical breakout what wins?  The latter wins more than the former.",
                      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/larbzl5/",
                      "created": 1719618809,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lars8gt",
                          "score": 1,
                          "body": "This comment will age terribly poor grammar aside",
                          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lars8gt/",
                          "created": 1719625490,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "larzb91",
                              "score": 1,
                              "body": "Thats the wonderful thing about investing isn't it?  Contrarian plays are great.\n\nOn the flip side, Cramer said to buy Disney.  Go figure.  That guy is a maroon.  I'd take stock advice from a reddit stranger over that twit and zero investigation on company fundamentals.",
                              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/larzb91/",
                              "created": 1719628539,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lau0gwt",
                                  "score": 1,
                                  "body": "Don't listen to cramer it's okay. You can try Time the market. Personally, if I see a company that is clearly undervalued, I buy and hold for the long term I'm in rush.",
                                  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lau0gwt/",
                                  "created": 1719669682,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "laro9nx",
                          "score": 0,
                          "body": "Surely technical analysis will give us all perfect gains. lmfao.",
                          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laro9nx/",
                          "created": 1719623829,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "larzhcc",
                              "score": 1,
                              "body": "No but it tells you when to get in at the bottom after a thorough analysis of the company.",
                              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/larzhcc/",
                              "created": 1719628617,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lapdtdg",
      "score": 5,
      "body": "The market hasn’t been especially rational for a while, don’t expect everything to behave according to fundamentals.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapdtdg/",
      "created": 1719593696,
      "depth": 0,
      "replies": []
    },
    {
      "id": "las3gal",
      "score": 5,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/las3gal/",
      "created": 1719630451,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lasbs07",
      "score": 5,
      "body": "Idk ..people over their wokeness? In need of some good solid movies to regain the publics confidence?",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lasbs07/",
      "created": 1719634653,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laqikv1",
      "score": 2,
      "body": "risk free rate of return vs risk rate of return. If the risk free rate remains high then everything else has to discount prices until they get back in line. Disney will be fine either way. \n\nFor everyone not watching the bond markets and related news please take the time to look at the Japanese carry trade. There is a high likelihood we are going to see bonds do stuff and the stock market will react to that more than actual performance of the underlying business. \n\nBasically if the carry trade in Japan is unwound even a little bit there will be hundreds of billions or perhaps several trillion dollars worth of assets getting dumped on the market at a discount. So supply of lower risk assets will surge and demand for higher risk assets (equities) will decline. Prices have to go down to make those higher risk assets have enough return to make it worth the while of anyone buying. \n\nToss on top of that the issues with CRE debt and the associated banks and bonds. The more the unrealized losses become realized the more the liquidity problems will grow. The more that problem grows the lower equity prices will go.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqikv1/",
      "created": 1719607640,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lar5zje",
      "score": 2,
      "body": "Earnings reports are backward looking. Stock prices are based on future expectations so guidance trumps earnings.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lar5zje/",
      "created": 1719616461,
      "depth": 0,
      "replies": []
    },
    {
      "id": "larb6az",
      "score": 2,
      "body": "Expectations vs performance. It doesn’t matter how a company did, it matters what the consensus was that they would and will do.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/larb6az/",
      "created": 1719618489,
      "depth": 0,
      "replies": []
    },
    {
      "id": "latu75o",
      "score": 2,
      "body": "Two things:\n\n1. Disney ruined Star Wars and they can't make a good movie or TV show. If they switched industries and started selling the unbreakable shovels they use to dig the hole they've found themselves in, then perhaps the company could turn around.  \n2. The market does what the market wants, charts, research, or reality be damned.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/latu75o/",
      "created": 1719667083,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lau03t8",
      "score": 2,
      "body": "Tesla had the best selling car in the world. \nThat news would be my guess on why recent bump.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lau03t8/",
      "created": 1719669536,
      "depth": 0,
      "replies": [
        {
          "id": "lau3wm2",
          "score": 0,
          "body": "Which one? Certainly not cybertruck, and previous one is almost decade old",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lau3wm2/",
          "created": 1719671014,
          "depth": 1,
          "replies": [
            {
              "id": "lau4tld",
              "score": 3,
              "body": "[Model Y](https://www.statista.com/statistics/239229/most-sold-car-models-worldwide/#:~:text=Best%2Dselling%20car%20models%20worldwide%20in%202023&text=The%20Tesla%20Model%20Y%20was,closely%20by%20the%20Toyota%20Corolla)",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lau4tld/",
              "created": 1719671362,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lau3ykh",
      "score": 2,
      "body": "Hugely overvalued. Stock trades at 100x earnings. \nDisney is mostly an amusement parks company.  Their margins are terrible and after having been to a park recently, I doubt they can raise their prices.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lau3ykh/",
      "created": 1719671035,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lau5dnq",
      "score": 2,
      "body": "Think about how bad of a dumpster fire the cyber truck is in your imagination. \n\nNow consider the fact that nearly every piece of Star Wars media Disney has put out has been an even bigger dumpster fire than that. Yet they spent $180 million on that shit heap the acolyte which has 12 viewers total. \n\nIf Disney properly capitalized on their franchises they would be unstoppable.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lau5dnq/",
      "created": 1719671568,
      "depth": 0,
      "replies": []
    },
    {
      "id": "launuwy",
      "score": 2,
      "body": "You have to leave your bias at the door when investing. For the two companies that you brought up, I’d ask how their consumer base feels about the products, are they hitting their marks and is there any contention within the company?",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/launuwy/",
      "created": 1719678058,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lautujl",
      "score": 2,
      "body": "It's obvious. If a company has a P/E ratio over 100, clearly, massive earnings growth is priced-in. When said growth doesn't materialise, the price crashes.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lautujl/",
      "created": 1719680192,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lav0xz6",
      "score": 2,
      "body": "Positioning.\n\nYes the results were good and this new movie is a blockbuster.\n\nTheir parks and cruises are also full.\n\nI think DIS is over $120 by year end.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lav0xz6/",
      "created": 1719682739,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laq49qe",
      "score": 5,
      "body": "Tesla has a growth path which I don’t think you understand. They are simply trying to make everyone own a Tesla and then sell their subscriptions to the mass public like the self driving feature. \n\nDisney lost the streaming war. Breaking even isn’t good enough and they should get Netflix like margins, but they won’t.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laq49qe/",
      "created": 1719602653,
      "depth": 0,
      "replies": [
        {
          "id": "lasdlyd",
          "score": 1,
          "body": "Tesla's future lies in licensing self drive to other manufacturers.",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lasdlyd/",
          "created": 1719635654,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lap6r8u",
      "score": 5,
      "body": "It carries a very rich valuation and their media output has been less than stellar",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lap6r8u/",
      "created": 1719591352,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lapgv47",
      "score": 3,
      "body": "Nelson Peltz is probably the primary reason. Lost his proxy fight, sold and who knows who else followed him. I still like Disney long, but there probably won't be much upwards momentum until they release a good catalyst.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapgv47/",
      "created": 1719594715,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lapuo7p",
      "score": 3,
      "body": "Stock is about the future, the past can give you some idea about what will happen but stock prices is not based on past performance.   DIS revenue disappointed investors.   If the economy continues to trend down, I'd expect people to cut back on fun activities which will hurt their bottom line.  Disney+ turning a profit is nice but they've lost to Netflix on the streaming side and their future in this space is far from certain.  Furthermore, the content they create is no resonating with audiences.  Why would I invest in an entertainment company who 1) is bad at creating content.  2) is facing a headwind due to the economy.\n\nTesla, on the other hand, has a bright future.  You may not like their product but our government has effectively eliminated their biggest competition with tariff.   Aside from perhaps Rivian, doesn't look like any domestic/Japan/SK/Europe car maker can compete with them.   If I am to invest, why wouldn't I put money on TSLA instead of DIS.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapuo7p/",
      "created": 1719599331,
      "depth": 0,
      "replies": [
        {
          "id": "lat537a",
          "score": 2,
          "body": "Actually, the thing people do in bad economies is they seek cheaper fun. Like maybe they don't go out every week for dinner but go to the movies instead. Or hang onto the Tesla for longer and buy a nice new shirt instead. Streaming might actually benefit from this.\n\nThat said, I think Disney and all movie companies have big problems about the sheer volume of competition. Not only from Netflix but rising global competition in entertainment, funny clips on YouTube and TikTok, gaming, even just from how accessible the whole library of movie entertainment from history is.",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lat537a/",
          "created": 1719653430,
          "depth": 1,
          "replies": [
            {
              "id": "latb2o5",
              "score": 1,
              "body": "Movies and streaming may get a boost from people \"downgrading\" their entertainment choice like you said, but their parks and cruise will take hits under the same circumstance.",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/latb2o5/",
              "created": 1719657312,
              "depth": 2,
              "replies": [
                {
                  "id": "latgoyj",
                  "score": 1,
                  "body": "Yes, fair point.",
                  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/latgoyj/",
                  "created": 1719660579,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "latntgs",
              "score": 1,
              "body": "WSJ just had an article about how Great Wolf Lodge was stealing meaningful ticket sales from Disney with Millineal Parents who want something close by they can drive to with the kids and relatively cheap by comparison. A trip to a Disney park must set a family of four back 5 grand. Great Wolf is a couple hundred bucks. ",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/latntgs/",
              "created": 1719664191,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lapharm",
      "score": 7,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapharm/",
      "created": 1719594860,
      "depth": 0,
      "replies": [
        {
          "id": "lapnrr6",
          "score": 11,
          "body": "\"  Netflix is taking over sports, which puts ESPN in a bind. Netflix produces better shows, which is catastrophic for a 'media entertainment' studios company that has had a stronghold for decades\" \n\n\nI tune out of Reddit when I see something as dumb as this statement.  \n\n\n1. Disney has FX, the Bear and Shogun are better than anything Netflix has put out.  \n\n\n2. Disney is a parks company, that's their bread and butter. There is no \"Netflix world\". People still love going to Disney parks even with their high mark ups.  \n\n\nYou say slow subscriber growth for Disney but they literally just said they're near profit on Disney +. It took Netflix a lot longer to gain a profit.  \n\n\nESPN still King of sports as much as we all hate it too. They have the main college football playoffs games and are gaining more NFL. ESPN has UFC, Netflix has WWE; ESPN has the greater product of TKO. ",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapnrr6/",
          "created": 1719597013,
          "depth": 1,
          "replies": [
            {
              "id": "lapsdg5",
              "score": 5,
              "body": "Disney is a huge company. I'm not disputing that. The basis of this discussion is whether Disney is worth a $200+ billion market cap. No, I don't see it. I see them losing a lot of leverage that they once had in films and studio. The parks are great, no question. But it's not a huge growth driver. It's not AI or tech. It's just.... a park with rides for kids. Hence, why would I buy Disney when I can buy a company that actually has a chance to return 10x my ROI?\n\nWe are talking about a company that is worth less than it was worth one decade ago. That's not by chance. Investors clearly do not have faith in Disney as a company. Regardless of whether you call it an opportunity or not, do you really think folks can't read basic charts? There's a reason people are not buying Disney stock which therefore, reduces the price of shares. It's just not an attractive investment. People can shout \"It's a buying opportunity\"! all they want. This isn't the early 2000's. It's easy to see which company is undervalued/overvalued with the source of information at our disposal whether it's easy access to financial reports or updated news on a company through our smartphone.\n\nSlow subscriber growth =/= profitability. Netflix took longer because they had zero IP and had to license content from companies such as Disney. At it's beginning, Netflix was just a platform where they paid film studios money to have their shows/movies on their platform. Disney is inhouse so how long they took to be profitable is a very poor comparison considering they can just publish their content onto Disney+ with minimal cost.\n\nESPN being the king of sports is much like news. People still watch it because they've been the leading source of that industry but you have Spotify, YouTube, TikTok, etc., all taking market share because sports journalists do NOT need ESPN to report on sports. It's quite obvious Netflix is moving into sports. The recent WWE deal was huge for both of them. UFC is reportedly considering moving onto Netflix as well. Considering both brands fall under TKO and have the same sponsorships and network deals since being sister brands, it's very likely UFC takes their content to Netflix as well.\n\nI'll just be honest here, I get Disney+ and Netflix for free. The last time I watched Disney+ was when Andor came out. That's the only time I ever tune into Disney+. The content is just lacking. It's mostly kids shows whereas Netflix is geared towards the entire demographic. I don't see it as competition. Disney+ just seems like a supplement to Netflix at this point. Brushing all of this aside, Disney shares being worth less today than it was one decade ago isn't an accident. Again, the company is clearly one of the most distinguished brands out there. But is it worth over $200b? I don't see it. Do I want to invest in Disney when I can put my money into SAFER companies with higher ROI such as Microsoft, Apple, Meta, etc.? No. And that is precisely why Disney has low support as an investment and whenever bad reports come out, the remainder holding flee and the stock price underwhelms.",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapsdg5/",
              "created": 1719598559,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lapv2ul",
              "score": 2,
              "body": "He seems to be another Disney Hater for no reasons.",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapv2ul/",
              "created": 1719599469,
              "depth": 2,
              "replies": [
                {
                  "id": "laqfiib",
                  "score": 2,
                  "body": "They’ve got that I’m smarter than the average Redditor energy while being the average Redditor",
                  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqfiib/",
                  "created": 1719606568,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lapg232",
      "score": 7,
      "body": "Go woke go broke?",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapg232/",
      "created": 1719594444,
      "depth": 0,
      "replies": [
        {
          "id": "lapk07l",
          "score": 0,
          "body": "No it’s not that. Market makers and institutions is what moves the market and they don’t give a shit about that.",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapk07l/",
          "created": 1719595759,
          "depth": 1,
          "replies": [
            {
              "id": "laps0pk",
              "score": 7,
              "body": "They actually do care very much. Why? Well, to be fair, it’s not so much the “wokeness”\nthat bothers Wall Street, It’s the loss of Disney’s mission. Disney needs to focus on creating great content, characters, franchises, entertainment\nand parks. They need to innovate. They need to generate new IP. Or they need to accept that they are just another legacy media company and cut spending immediately. Either way, the company is lost and hemorrhaging cash on failed project after failed project.",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laps0pk/",
              "created": 1719598439,
              "depth": 2,
              "replies": [
                {
                  "id": "lapwigv",
                  "score": 6,
                  "body": ">Well, to be fair, it’s not so much the “wokeness” that bothers Wall Street\n\nSo we are in agreeance.",
                  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapwigv/",
                  "created": 1719599962,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lapq70x",
      "score": 3,
      "body": "Disney is a mess.  Burning cash, unprofitable, mounting debt, dwindling cash reserves, IP expiring, no good new content,  unique content, no new franchises, no growth, skyrocketing prices on merch and at the parks, placing social initiatives over the wellbeing of the company and consumer, no innovation and their most recent attempts at it have all failed (from the star wars hotel to the Brianna ride, to streaming). . . Imagineers and imagination made Disney great — from the media content to the parks. They have strayed too far. Without some major innovation, it will take years to repair the Disney brand. The current management/employees are simply not capable of righting the ship and people are starting to see that. Disney is quickly becoming another dog of a legacy media company, and so its valuation will reflect that. A PE of 15-17 would be more appropriate. And they need to either show some innovation, or cut spending and turn a profit — they can’t continue to operate like a tech company when they have proven to be totally incompetent in that regard. \n\nDisney just built a new ride that’s universally hated and using animatronics from the 80’s, a streaming platform with awful content, and a star wars hotel that no one liked. Meanwhile, Elon has humanoid robots building cars, batteries that dwarf the competition, self driving cars with integrated AI, a massive charging network, first in class solar technology, and he continues to innovate and iterate at an unrivaled pace. People will pay a premium for innovation and unrelenting focus. We discount companies who have totally lost their way. Business 101, have a clear mission & vision, and a roadmap to get there. Disney is lost. Tesla is hyper focused.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapq70x/",
      "created": 1719597822,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laplm72",
      "score": 2,
      "body": "The market is not rational",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laplm72/",
      "created": 1719596294,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laqqlcd",
      "score": 2,
      "body": "Disney makes bad movies. Idk about Tesla. They used to be the only EV maker, but now their cars are questionable.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqqlcd/",
      "created": 1719610527,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lar6t78",
      "score": 2,
      "body": "Have you even been watching any of their content or gone to the parks? Severe deterioration in entertainment quality.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lar6t78/",
      "created": 1719616782,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lap81y2",
      "score": 4,
      "body": "The acolyte is all over the place place as being trash and getting cancelled. How are you suprised?",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lap81y2/",
      "created": 1719591784,
      "depth": 0,
      "replies": [
        {
          "id": "lapziep",
          "score": 10,
          "body": "Yup. Acolyte is a disaster. Total cringe fest.",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapziep/",
          "created": 1719600997,
          "depth": 1,
          "replies": []
        },
        {
          "id": "laphkz3",
          "score": 4,
          "body": "lol at reddit downvoting",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laphkz3/",
          "created": 1719594955,
          "depth": 1,
          "replies": [
            {
              "id": "laqjcxf",
              "score": 7,
              "body": "[removed]",
              "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqjcxf/",
              "created": 1719607912,
              "depth": 2,
              "replies": [
                {
                  "id": "lase7qx",
                  "score": 3,
                  "body": "Never mind being woke, the writing is just absolutely moronic, as if they just got some 20 year old intern that majors in genders studies to lead the writing team. I genuinely do not fucking care if black queer people are in a movie or if a mermaid is black, but for fucks sakes just put the story and the writing first and make it MAKE SENSE. \n\nLike why not just make new content instead of shoehorning social justice topics into every existing intellectual property? Just look at the dumpster fire that was Willow. It’s basically just subversion for subversions sake. \n\nBut let’s be real, any press is good press and Disney knows this, rage watching is better than no watching.",
                  "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lase7qx/",
                  "created": 1719635992,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lap8m9e",
      "score": 0,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lap8m9e/",
      "created": 1719591970,
      "depth": 0,
      "replies": [
        {
          "id": "lap8unx",
          "score": 0,
          "body": "[removed]",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lap8unx/",
          "created": 1719592049,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laq1dy5",
      "score": 1,
      "body": "maybe good is not enough?",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laq1dy5/",
      "created": 1719601648,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lar6gm9",
      "score": 1,
      "body": "This is a buying opportunity. I don’t have any money.  I may buy some after the first of the month maybe. \n\nI don’t know what I am doing.  ",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lar6gm9/",
      "created": 1719616646,
      "depth": 0,
      "replies": []
    },
    {
      "id": "larj87o",
      "score": 1,
      "body": "Just ask yourself “how can Disney grow?”   Then watch what they invest in and who they invest in.    If they set themselves up for the future economy, invest. If not, don’t.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/larj87o/",
      "created": 1719621728,
      "depth": 0,
      "replies": []
    },
    {
      "id": "las4dw1",
      "score": 1,
      "body": "Desantis effect (just kidding, I don’t know).",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/las4dw1/",
      "created": 1719630903,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lase99t",
      "score": 1,
      "body": "I just feel like stocks like Disney or stocks where there’s no other “potential” for example airline stocks or any one dimensional company has no future of the stock skyrocketing like any of the tech stocks where they’re revolutionizing the way the world works therefor investors don’t invest in those companies. For example, the Disney stock price in 2011 was 34 dollars and now it’s 2024 and it’s at 99. If I had 30000 dollars I would have made a lot more in an ETF or even a CD account just getting an average steady annual return. People invested in TSLA for its potential, where if you bought back when the company started 30000 of stock is now worth 700,000 etc like nvda, amzn where those companies made you rich if you invested early. What else can Disney possibly do besides theme parks or movies?",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lase99t/",
      "created": 1719636015,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lasn6pf",
      "score": 1,
      "body": "The Acolyte",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lasn6pf/",
      "created": 1719641372,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lat20oq",
      "score": 1,
      "body": "The stock market is a combination of past and future earnings , supply and demand with human emotions and logic impacting on that … that’s why it’s called a market!",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lat20oq/",
      "created": 1719651372,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lat2cem",
      "score": 1,
      "body": "Always remember that company performance does not guarantee stock performance, and always remember that for every share bought, someone is selling that same share. It’s a transaction. The price is dictated by who is willing to give *very slightly* more/less to the other party in the transaction. \n\nConsider as well the element of sentimentality.\n\nWhen a company is out of favor for a long time, it becomes more difficult to overcome that sentimentality and break through the recent price barrier that buy transactions haven’t been able to clear. It usually takes more than just good performance within the realm of what was expected - a company often needs to do the unexpected (in a positive sense) and fundamentally alter their perception in the eye of investors. Disney hasn’t been able to do that lately. \n\nThey’re playing a game we’re too familiar with and no one wants to insert more coins into the arcade until they show us they have some new secret levels we had no idea about - especially when you only have so many coins on hand and the arcade games next to it are flush with new and exciting ideas that are too tempting to pass up.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lat2cem/",
      "created": 1719651589,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lat46v7",
      "score": 1,
      "body": "Go woke, go broke.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lat46v7/",
      "created": 1719652825,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lat5xnx",
      "score": 1,
      "body": "I'm still wary of old movie and TV. I think competition is just so hot compared to say, 20 years ago. Plus I think things like CG animation has hit a peak, the rendering got cheaper and everyone is out there making stuff that wows as much as Disney (like The Last Wish).\n\nThat said, it's always worth noting the effects of both hype and also fear. Something bad happens with a stock and it crashes, people are wary to buy, even when the numbers are really good.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lat5xnx/",
      "created": 1719654001,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lat6mvl",
      "score": 1,
      "body": "Disney has been under delivering for years. IDK if they recently managed to lower expectations, but they certainly didn't do so well compared to the competition as far as I know.\nTSLA has a lot of hype and a lot of people just buy it anyway. I don't own TSLA but I don't think it is a pile of garbage. Don't just look at the car business, TSLA may very well become some sort of domotica business with a fully integrated ecosystem. They build their own batteries so there's scope for high margins due to vertical integration. \n\nAnyway the market is about expectations and human behavior. The second one is what it is and right now nobody cares about Disney.\n\n\nI went to check the stock after writing the comment above, bro, Disney is a piece of shit, barely profitable and P/E 107 after dropping 30% over the past 5 years. I would never touch it unless they had a credible major restructuring plan or some magic move to start making 15-20 billion out of those 90.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lat6mvl/",
      "created": 1719654467,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lat704z",
      "score": 1,
      "body": "I think that peltz is selling after he lost the dispute with the board",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lat704z/",
      "created": 1719654707,
      "depth": 0,
      "replies": []
    },
    {
      "id": "latc2cq",
      "score": 1,
      "body": "Because they are clearly not learning their lesson based on star was fiasco\n\nI was in at $82 sold last week",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/latc2cq/",
      "created": 1719657922,
      "depth": 0,
      "replies": []
    },
    {
      "id": "latd7o1",
      "score": 1,
      "body": "Stocks aren't meant to bought and sold in the expectation of price movements within a one month time horizon. Prices are stochastic in the short term, sometimes it takes a very long time for the market to price efficiently. TSLA is down - 20 YTD but it can move very fast because it has memestock like qualities. \n\n\nI look at DIS and:\n\n\nIt's still superficially expensive (PE 24).\nIt has had a string of underperforming theatre releases and a number of it's major IPs are underperforming\nIt attracts a lot of controversial media attention \nOverall revenue growth hasn't been good\n\n\nYou could still be right, though. I see a number of one of costs in their accounts that may be hiding higher financial performance. But the market overall may be waiting to see more before the stock rerates.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/latd7o1/",
      "created": 1719658605,
      "depth": 0,
      "replies": []
    },
    {
      "id": "latnm58",
      "score": 1,
      "body": "Leadership of Disney is terrible. There is no creativity anymore over there. Is full of suits and social science graduates that make \"art\" to push an agenda rather than art for the sake of art. They keep milking old stories created by truly creative people and run them dry.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/latnm58/",
      "created": 1719664094,
      "depth": 0,
      "replies": []
    },
    {
      "id": "latped6",
      "score": 1,
      "body": "It's because they are ruining there long term clients with the joke star wars shit",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/latped6/",
      "created": 1719664934,
      "depth": 0,
      "replies": []
    },
    {
      "id": "latvcru",
      "score": 1,
      "body": "I’m not gonna get into a debate on Tesla’s valuation. \n\nYour understanding of Disney’s valuation is flawed. D+ was *close* to making a profit and that was only because they combined it with Hulu(already profitable) and have cut back on content production on D+. Disney gets the bulk of its cash from Parks and Cruise lines and last quarter attendance was soft. Further, they gave guidance that this quarter attendance would also be soft.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/latvcru/",
      "created": 1719667577,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lav0h73",
      "score": 1,
      "body": "I think Jenny Nicholson might have killed them.\n\nI would not even be surprised if she's effecting the stock price now.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lav0h73/",
      "created": 1719682562,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lapdyai",
      "score": 1,
      "body": "So it seems you have learned to not trust the narrative. \n\nIf you see everyone shitting on something, it doesn't mean that it is shit, it's just the bandwagon. Tesla, a burning pile of garbage? Every product has flaws? Every time I've been in one, it was great. But hey, the CEO is a crazy man, and it's cool to hate the company, so that's all you read. \n\nI've lost count the number of times when things shot up when the sentiment was at it's absolute worst.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapdyai/",
      "created": 1719593740,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lapvneg",
      "score": 1,
      "body": ">Man, I just don't understand stock market\n\nI always find these posts interesting because OP will realize they don't know something, but then so confidently express assured opinions in the next few sentences.  It takes a certain lack of self awareness and unwarranted confidence.\n\n>TESLA is burning pile of garbage\n\n*perhaps it isn't?*\n\n>literally every product has flaws, their cars are withdrawn because of major safety issues and they don't deliver features which they previously promoted \n\n*perhaps they don't, haven't been, and aren't? again, just food for thought.*\n\n>so naturally it's +10% for last month.\n\n*proof is in the pudding, as they say.*\n\n>Can someone explain this? How does it work? Is whole market just \"bigger fool\" or gambling on \"potential growth\" now?\n\nYea, that's it champ. You got it all figured out this time, it's just gambling.  Who could possibly foresee declining interest in Disney products and a beat down stock rebounding?  Obviously only gambling fools. \n\nJust keep putting more money in that robinhood account, daddy needs a bigger beach house :)",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapvneg/",
      "created": 1719599665,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lar68iw",
      "score": 1,
      "body": "I agree with you that DIS is a buy at this price. It will come back I’m just not able to say when but around 90-105 it’s always a strong buy in my eyes. \n\nWas just at Disney World and wanted to be a hater but actually had an amazing time. We got a budget room and used the extra cash for Genie + but I swear that place is a goldmine… they invested heavily in Disney Plus just at the wrong time but if they were really investing in programming we should start to see some of that quality churning out in 2026, so I believe in he mission.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lar68iw/",
      "created": 1719616559,
      "depth": 0,
      "replies": []
    },
    {
      "id": "larhuct",
      "score": 1,
      "body": "It’s a combination of expectations and what’s already priced in \n\nI don’t understand TSLA myself. It’s a hype train",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/larhuct/",
      "created": 1719621165,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lash98t",
      "score": 1,
      "body": "Disney is satan. It’s going back to where it came from!",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lash98t/",
      "created": 1719637739,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laqilrw",
      "score": 0,
      "body": "Im Just Sick of Disney and their political Agenda. Acolyte is Not Just Bad, Its a literal insult to All Star wars Fans",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laqilrw/",
      "created": 1719607649,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lapinke",
      "score": -1,
      "body": "Disney has been putting out a lot of shit content over the last several years, and because of that they are losing a lot of subscribers. It’s really not that shocking given that a lot of their growth in the last decade came as a result of Disney+, therefore losing subscribers isn’t a good look for long term investors.\n\nAs far as Tesla goes whether you like the company or not it has a huge devoted fan base that couldn’t care less about what Elon does so they just keep buying their cars even if they are shit. \n\nStocks are companies, if company get money then line go up.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapinke/",
      "created": 1719595312,
      "depth": 0,
      "replies": [
        {
          "id": "laurbm2",
          "score": 1,
          "body": "You can downvote me all you want these are just facts",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/laurbm2/",
          "created": 1719679287,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lapipkh",
      "score": 0,
      "body": "A company’s stock price doesn’t always reflect its true value of the company. \nI actually see Disney with at least a 20% gain from here by year end.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapipkh/",
      "created": 1719595330,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lar1uz2",
      "score": 0,
      "body": "Simply put look at the debate last night and see that the president is senile and the people are still defending him.\n\nHow does this happen? We have a ton of very old and very young people in the country.  Old people don’t go to disney and young people thinks it for people with kids",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lar1uz2/",
      "created": 1719614842,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lapkyco",
      "score": -3,
      "body": "Disney has a 100x P/E ratio with 5% growth. \n\nTesla has a 50x P/E ratio with 20% growth.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapkyco/",
      "created": 1719596075,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lapf1ke",
      "score": 0,
      "body": "Funds/institutions with bigger stacks than you pushing stocks around at their will and trying to break you using human psychology for their profit.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapf1ke/",
      "created": 1719594102,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lapgk36",
      "score": 0,
      "body": "Ask MU",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapgk36/",
      "created": 1719594613,
      "depth": 0,
      "replies": [
        {
          "id": "lapk44s",
          "score": 2,
          "body": "How would they answer this question about Disney",
          "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapk44s/",
          "created": 1719595796,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lapjao8",
      "score": 0,
      "body": "Disney might finally turn a profit but they couldn't capitalize on their biggest bet which is their streaming service during a time where everyone had to stay inside and stream television. If it took this long for a company that big to get on their feet imagine what forward guidance would look like, they regurgitate IP and don't innovate within the entertainment industry. Their biggest money makers in Star Wars and Marvel look like they hit brick walls. \n\nTesla is a completely different sector. As fas as I can tell, EV's are the future and Tesla is still the most popular EV brand. They have been beated down for years since the speculation bubble for them popped and now they can recover and reforge their lineup. I'm not a big fan of them either but they're further under their 52 week range than Disney is and have some upside even without changing anything. That's just how I see it.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lapjao8/",
      "created": 1719595525,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lar1isp",
      "score": 0,
      "body": "Cause Igar sucks",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lar1isp/",
      "created": 1719614712,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lasxyh2",
      "score": 0,
      "body": "D+ is a dumpster fire.  They are murdering their intellectual property.  They call their fans bigots and sexist and the likes.  The fact that people still go to there theme park is shocking.  It's only a matter of time if they don't drop the woke BS.  \n\n\nSide note Tesla is less of a car company and more of a data miner.  The self driving car beta test.",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lasxyh2/",
      "created": 1719648669,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lap9s0x",
      "score": -5,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/lap9s0x/",
      "created": 1719592360,
      "depth": 0,
      "replies": []
    }
  ]
}