{
  "title": "[deleted by user]",
  "score": 128,
  "selftext": "[removed]",
  "link_flair_text": null,
  "id": "1dqqcox",
  "num_comments": 74,
  "created_utc": 1719598568,
  "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/",
  "comments": [
    {
      "id": "lapuciy",
      "score": 118,
      "body": "It's not a business that interests me, but you should look into why, in a duopoly, one company can't capitalize on the other's difficulties.",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lapuciy/",
      "created": 1719599223,
      "depth": 0,
      "replies": [
        {
          "id": "laqdfmu",
          "score": 49,
          "body": "Yea how about you tell us what you apparently know?",
          "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqdfmu/",
          "created": 1719605843,
          "depth": 1,
          "replies": [
            {
              "id": "laqf9lb",
              "score": 113,
              "body": "There are multiple reasons but in the case of Airbus and Boeing I think the most obvious reason is that both of them are limited by their manufacturing capacity. \n\nIt costs a lot of money to produce airplanes and the entire business model isn't easily scalable. Even if Boeing disappeared tomorrow, Airbus still wouldn't be able to take their business, they're capped already anyways",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqf9lb/",
              "created": 1719606482,
              "depth": 2,
              "replies": [
                {
                  "id": "lasccyk",
                  "score": 3,
                  "body": "thanks",
                  "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lasccyk/",
                  "created": 1719634968,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "laqgppf",
              "score": 12,
              "body": "[removed]",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqgppf/",
              "created": 1719606991,
              "depth": 2,
              "replies": [
                {
                  "id": "laqiqf3",
                  "score": 6,
                  "body": "China decided this long ago and have been working on it for a while now.",
                  "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqiqf3/",
                  "created": 1719607694,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "laqhmyy",
              "score": 9,
              "body": "I know nothing. What’s happening to Boeing should be easily to find out yet Airbus is still under producing so that’s what a potential investor should research. I’m not one.",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqhmyy/",
              "created": 1719607309,
              "depth": 2,
              "replies": []
            },
            {
              "id": "laqeu34",
              "score": 4,
              "body": "Have you not seen Boeing repeatedly shoot themselves in the face?",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqeu34/",
              "created": 1719606331,
              "depth": 2,
              "replies": [
                {
                  "id": "laxkmbl",
                  "score": 1,
                  "body": "The United states will never let Boeing fail, it is a matter of national security.",
                  "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laxkmbl/",
                  "created": 1719719987,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "laxw7ml",
                      "score": 2,
                      "body": "Doesn’t mean they can force the stock price to go up",
                      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laxw7ml/",
                      "created": 1719726353,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lazlufq",
                          "score": 1,
                          "body": "Which has no effect on Airbus.",
                          "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lazlufq/",
                          "created": 1719761094,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lb22r55",
                      "score": 1,
                      "body": "It'll get to a point where other countries don't allow Boeing's into their airspace.\n\nIt's plainly dangerous now and as you infer, the US can't be trusted to regulate them properly.",
                      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lb22r55/",
                      "created": 1719793735,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "latwbdj",
              "score": 1,
              "body": "I think part of it is that the customers know that if they engage too much/only with one of the the two they effectively remove the only competition this manufacturer has and hence allow them to charge whatever they want. \nSo the customers have the power to decide over their own future prices and won't play themselves due to this",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/latwbdj/",
              "created": 1719667983,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "laqd0zy",
          "score": 3,
          "body": "I would like to know more but don't know how to look up something like that",
          "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqd0zy/",
          "created": 1719605702,
          "depth": 1,
          "replies": [
            {
              "id": "latksye",
              "score": 0,
              "body": "It was mentioned in the news here. They are buying the engines and the engine manufacturer can't deliver enough.",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/latksye/",
              "created": 1719662712,
              "depth": 2,
              "replies": []
            },
            {
              "id": "laqi0xe",
              "score": -3,
              "body": "For this specific case: Listen to the last earnings call as a primary source, go to Bloomberg, CNBC and Yahoo finance to check what they said as secondary source from media and institutional investors and then look up commentary on YouTube or Reddit for retail investor perspective.",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqi0xe/",
              "created": 1719607446,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lasuhz9",
          "score": 1,
          "body": "If you see the order book, any new plane purchased today is delivered 6+ years from now. How do you expect airlines to move orders from Boeing when they will have to wait even more if orders start flooding Airbus. And their supply chain is really complex.",
          "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lasuhz9/",
          "created": 1719646203,
          "depth": 1,
          "replies": []
        },
        {
          "id": "laqknmi",
          "score": 2,
          "body": "Not quite a duopoly that one. Sure they are the only ones to make the largest planes, but there are others making planes comparable to 737 and a320 which are their respective bestsellers.\n\nAnd in both cases, half their business is defence and space for completely different governments, not airliners.\n\nBoeing is not doing good at all. It is losing plane sales and airbus will fill most of them. Airbus will of course not get US government spending, but a dominant position on airliner market is nothing to sniff at.",
          "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqknmi/",
          "created": 1719608364,
          "depth": 1,
          "replies": [
            {
              "id": "laqloat",
              "score": 10,
              "body": "The two make out 75% of the commercial airplane market. It’s a textbook duopoly.",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqloat/",
              "created": 1719608730,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lar8opy",
          "score": 1,
          "body": "Right, Intel having difficulties making good CPUs certainly hasn't helped AMD.\n\n\n\nAnd Radeon (AMD) struggling to make GPUs certainly hasn't meant a walk home victory for nVidia.\n\n\n\nHeck, even if we look at PCs the abyssmal sales of Macs hasn't made life easy for Microsoft to utterly dominate the desktop world of PCs. /s",
          "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lar8opy/",
          "created": 1719617515,
          "depth": 1,
          "replies": [
            {
              "id": "larmynv",
              "score": 3,
              "body": "That’s exactly why I said someone needs to look into why Airbus can’t utilize the moment. My comment should be a question he should look into not a statement.\n\nThat being said those are bad examples as the market share of Amd vs Nvidia is/was not split fair before Nvidia took of and Microsoft PC has always been having a higher market share…",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/larmynv/",
              "created": 1719623280,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lapudec",
      "score": 14,
      "body": "I think you might have just convinced me to take a position on Airbus....\n\nManufacturing takes time to expand, but, it can be done - I suspect the recent Boeing issues may help Airbus too.",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lapudec/",
      "created": 1719599231,
      "depth": 0,
      "replies": [
        {
          "id": "lapxtx7",
          "score": 21,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lapxtx7/",
          "created": 1719600418,
          "depth": 1,
          "replies": [
            {
              "id": "laq3cvi",
              "score": 8,
              "body": "Airbus also has a large military arm. They produce aircraft, helicopters, drones, for military uses. They arnt like Boeing with things like missles and part of joint contracts with Lockheed and Northrop",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laq3cvi/",
              "created": 1719602336,
              "depth": 2,
              "replies": [
                {
                  "id": "laqnxzu",
                  "score": 1,
                  "body": "MBDA is partially owned by Airbus and produces plenty of missiles.",
                  "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqnxzu/",
                  "created": 1719609550,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "laqep89",
              "score": 5,
              "body": "Airbus also do space tech. If I remember correctly they are building the service module for the lunar lander",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqep89/",
              "created": 1719606283,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lara8gx",
          "score": 1,
          "body": "Backlog is over 5 years and considering margins of 15% I dunno if expanding or increasing output is the safest use of money… plus with dividend payouts and increased scrutiny due to Boeing issues airbus isn’t going to suddenly make more planes… people already know they maxed out capacity so if sudden capacity increase… I would worry airbus is cutting corners… which even if they aren’t sudden increases will make me question them… since also some issues is also from supply chain… airbus would be smarter to scrutinized their own workflow…inventory… supply chains…",
          "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lara8gx/",
          "created": 1719618119,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lapwu6v",
      "score": 23,
      "body": "China is about to start producing their own passenger aircraft, if they haven't begun already. This will likely crush the China market share of Boeing and Airbus, and will cause further disruption if they begin exporting them. \n\nThe days of the airbus/Boeing duopoly are numbered outside of western markets.\n\nEdit: added link\n\nhttps://www.google.com/amp/s/amp.cnn.com/cnn/2024/02/19/business/china-comac-c919-international-debut-intl-hnk",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lapwu6v/",
      "created": 1719600075,
      "depth": 0,
      "replies": [
        {
          "id": "laq0qsl",
          "score": 14,
          "body": "I really don’t see this happening anytime soon.  The US and Europe will let Chinese airlines possibly fly and land them, but not their own airlines buy them.\n\nProof?  Look at the automotive industry. China is still struggling to get any entry point, especially with EV’s and no signs that tariffs will be backed off.\n\n Chinese planes are a bigger threat to Boeing and Airbuses used market. Some poorer countries might choose a new Chinese plane over a used Boeing or Airbus because of fuel efficiency and thus total cost of ownership. This might reshape how airlines keep airplanes and their lifecycle.  But given how strong airfreight is, I think you’ll just see younger aircraft turned into air freighters earlier.",
          "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laq0qsl/",
          "created": 1719601423,
          "depth": 1,
          "replies": [
            {
              "id": "lates9z",
              "score": 2,
              "body": "Well we have Volvo that's Chinese owned and still selling in the US market.",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lates9z/",
              "created": 1719659526,
              "depth": 2,
              "replies": [
                {
                  "id": "latjq06",
                  "score": 3,
                  "body": "There’s a difference between owned and built.\n\nChina owns a substantial part of almost everything in America.",
                  "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/latjq06/",
                  "created": 1719662171,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "laqg1tz",
              "score": 3,
              "body": "The automotive industry is a little different... The tariffs put in place are there to \"create American jobs\" by encouraging automakers to open factories in the US. Plane makers do not usually have dozens of different factories like car manufacturers do - meaning if a plane manufacturer established a plant in China, it would likely be one of maybe 5-10 worldwide. Ford on the other hand has around 65 facilities worldwide.   \n  \nI think it would be difficult for the US to put high tariffs on China-made planes because then politicians would basically be saying they'd rather use lower-quality planes that are \"made in Merica\". For cars they can get away with it because it doesn't matter if your car isn't peak quality. For planes, low-quality means putting people lives at risk.",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqg1tz/",
              "created": 1719606757,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lasxuks",
              "score": 1,
              "body": "I think you're underestimating the stupidity of European politics to protect and develop their own industries. BYD will get a solid market entry and so will the Chinese aircraft once they can scale them (and one thing the Chinese can do is copy and scale).",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lasxuks/",
              "created": 1719648590,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lapyj3d",
          "score": 9,
          "body": "COMAC has issues with production speed at the moments due to them being a young new player in the aerespoace sector, a good percentage (more than half) of their components are sourced in the west and due to the distrust of chinese companies with industrial espionage COMAC's planes are very fuel inneficient confronted to AIR's and BA's counterparts, add to this waitimes comperable to AIR's waitimes, i dont see COMAC stepping up for another decade at least\n\nCOMAC's production is also narrow and sluggish in picking up pace\n\nI wrote this a few weeks ago in a similar post on this subreddit, i belive this still stands, COMAC is not to be taken lightly but at the same time not to be overestimated, still, a very important factor to take  \n(full disclosure i have 5500 shares of RR and 175 shares of AIR so i might be a bit biased)",
          "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lapyj3d/",
          "created": 1719600661,
          "depth": 1,
          "replies": [
            {
              "id": "laq32lg",
              "score": 12,
              "body": "I think the larger issue is the maintenance of the planes. Airbus and Boeing have extreme amounts of service centers and spare parts at every airport for common things. \n\nCOMAC will take a very very long time to build out the infrastructure to support their planes for wide use. It being a Chinese company and into today environment I doubt a lot of countries are going to want to build out infrastructure for their planes.\n\nThe only places I see it are china’s neighbors like Russia, North Korea, maybe some African nations as well.",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laq32lg/",
              "created": 1719602236,
              "depth": 2,
              "replies": []
            },
            {
              "id": "laqy1zq",
              "score": 3,
              "body": "The C919 is only 3-5% less fuel efficient and that difference is diminished on regional flights versus long distance. Furthermore, it’s being built at roughly 50% the cost.",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqy1zq/",
              "created": 1719613364,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lapxnaq",
          "score": 2,
          "body": "They did. And have 1000 orders roughly, so far from China only. At least until they certify it in europe. Yeah, china will most definitely be a key player in the future.",
          "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lapxnaq/",
          "created": 1719600355,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laqmp3a",
      "score": 2,
      "body": "I have been holding AIRp for some time because of their research focused on environmental friendly flight in the future, specifically hydrogen. I think whoever cracks that nut is going to win. So far AIRp has not delivered, but I’m holding.",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqmp3a/",
      "created": 1719609098,
      "depth": 0,
      "replies": [
        {
          "id": "lat9ize",
          "score": 1,
          "body": "Is that even possible? I've read a lot of articles on it and as of now sounds like green propaganda and in reality its a while away.",
          "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lat9ize/",
          "created": 1719656355,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laqnqxi",
      "score": 2,
      "body": "Boeing has misfired. But the overall slowing global economy is way bigger of a concern. \n\nChina, and to a lesser extend, US, have been the powerhouse of global growth, China's economy is entering a slowing stage and US is not showing much signs of defying the inevitable slowing. \n\nIf times are good, Airbusnwould have capitalized on Boeings repeated blunder, just like Boeing did years back when airbus was in a funk. But the global economic trend is just way too big, especially to commercial airline industry.",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqnqxi/",
      "created": 1719609480,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lar1e3f",
      "score": 2,
      "body": "I'm a long time Boeing hold. Bought when covid hit and then watched the government bail them out. They could murder all the whistle blowers and I wouldn't sell. I'm not claiming it's a great stock just that it's a safe one.",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lar1e3f/",
      "created": 1719614660,
      "depth": 0,
      "replies": [
        {
          "id": "lat56yv",
          "score": 1,
          "body": "[removed]",
          "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lat56yv/",
          "created": 1719653501,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lat9pdb",
          "score": 1,
          "body": "Unfortunately I sold after I made about 60-70% after covid. How far do you see Boeing drop until its a good value buy again?",
          "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lat9pdb/",
          "created": 1719656467,
          "depth": 1,
          "replies": [
            {
              "id": "lfwb6do",
              "score": 1,
              "body": "I don't I ended up selling... I re did everything into conventional funds didn't want to pay attention for a while",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lfwb6do/",
              "created": 1722469801,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lar2vtl",
      "score": 2,
      "body": "They are subject to political pressures from European governments, especially with 1/4 of their shares owned directly by European govts.\n\nI prefer RTX (aka Raytheon).  Through Pratt & Whitney, half of their business is civilian aerospace, while the other half is defense.  This gives me exposure to expanding demand for commercial air travel, and a steadily increasing demand for defense systems.",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lar2vtl/",
      "created": 1719615242,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lapv7cp",
      "score": 3,
      "body": "I wouldn't be bullish over the long-term because I just don't think the long-term returns for the company since IPO have been all that compelling and short/medium-term if we do run into the economy slowing this wouldn't be something I'd want to be in and the market will try to anticipate that. Could I see an oversold bounce? Sure. \n\nLong-term if I wanted aerospace exposure I'd much rather get and forget TDG or HEI, both of which are superbly managed companies that have delivered - particularly in the case of the latter being up about 118,000% since IPO  - for shareholders consistently over time.",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lapv7cp/",
      "created": 1719599511,
      "depth": 0,
      "replies": [
        {
          "id": "laqvpci",
          "score": 5,
          "body": "Something something past returns",
          "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqvpci/",
          "created": 1719612447,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lard26y",
          "score": 2,
          "body": "Both TDG and HEI have seen significant multiple expansion over the past decade. Future returns will almost certainly be significantly lower.",
          "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lard26y/",
          "created": 1719619235,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "laqyv2l",
      "score": 1,
      "body": "I like it, have a position for some years now and still in the green. It's  a great business and within its sector fairly diversified though obviously planes are main money maker.\nThey own shares in a lot of aerospace joint ventures under different names and are good to spread out exposure to defense and space.\n\n\n\nThere is a dividend trickling in as well and you know company isn't going anywhere because its strategic.\nGermany, France, Spain and UK govts combined own like 30%.\n\n\nAs a stock, I don't see it as competition to Boeing. The sector will always exist and they share it, if anything buy stock of both. I am thinking of adding some since it dropped.",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqyv2l/",
      "created": 1719613679,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lar5oki",
      "score": 1,
      "body": "No.  Buy Rycey. \n\n\nI rode Airbus from $14 to 40 but it's a union dog",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lar5oki/",
      "created": 1719616343,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lar9rwz",
      "score": 1,
      "body": "Bullish but it’s an airline stock and they hardly fucking move.",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lar9rwz/",
      "created": 1719617939,
      "depth": 0,
      "replies": []
    },
    {
      "id": "larmgy5",
      "score": 1,
      "body": "If airline industry is complex,  I can’t even say a word of plane manufacturing at this point of time.",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/larmgy5/",
      "created": 1719623071,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lasd93z",
      "score": 1,
      "body": "To be honest if you look at the trajectory of the stock price for the last 10 years the gains are dismal, buying a stock at 15 dollars and it being 30 dollars 10 years later is not a good return. You’re better off putting your money in an ETF or a CD account generating a steady annual return.",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lasd93z/",
      "created": 1719635455,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lasiz5g",
      "score": 1,
      "body": "Any company in satellite manufacturing is lined up to ride the space train, but it's a slow old prime dragged by its main business so who knows.",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lasiz5g/",
      "created": 1719638768,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lasjl33",
      "score": 1,
      "body": "Is Airbus a French co? Listed as an ADR?",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lasjl33/",
      "created": 1719639134,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lasli2q",
      "score": 1,
      "body": "Airbus is extremely safe. Global aviation runs on Airbus and Boeing.\n\nI wouldn’t be even remotely be concerned about the company. However, whether it can deliver big returns is something you need to assess.\n\nI keep an eye on Boeing as it’s one leg of the commercial duopoly, Government supported, and in defence as well.\n\nAirbus is objectively a better company, though!",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lasli2q/",
      "created": 1719640309,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lasqm9r",
      "score": 1,
      "body": "I’m extremely bullish on airbus, great company. Currently there is political turmoil in France so it will be hit even hard . Great buying opportunity I already have some and will buy more",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lasqm9r/",
      "created": 1719643581,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lat3zwe",
      "score": 1,
      "body": "Did they announce anything ai related? Otherwise no. /s",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lat3zwe/",
      "created": 1719652694,
      "depth": 0,
      "replies": []
    },
    {
      "id": "late5aa",
      "score": 1,
      "body": "The crash was not due to the lower number of aircraft delivered. The reason for this were delivery problems from suppliers. But that was already taken into account. No, it was another division that was causing major concerns and was responsible for the share price crash: the aerospace and defense division.\n\n>Within two years, the value adjustments in this area will add up to 1.5 billion euros. Airbus has just announced that after 600 million euros for 2023, a further 900 million euros will be written off. In the aerospace division, a restructured management team has taken another close look at all projects and found further problems instead of positive surprises. Airbus CEO Guillaume Faury did not give any details to analysts, referring only to telecommunications, navigation and earth observation satellites in general.\n\n>It is clear from his comments that the space problems are not directly linked to the new giant Ariane 6 rocket, which is due to take off on its maiden flight on July 9. However, the general contractor ArianeGroup, in which Airbus holds a half share, posted losses last year. There is currently a lot of unrest in the space sector. Elon Musk's market leader SpaceX is putting the industry under pressure with technological leaps. New satellite developments are also changing business models.\n\n>The Airbus armaments and space division is becoming a major cause for concern with the new value adjustments - because Airbus has hardly been able to benefit from the armament of the European armies.",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/late5aa/",
      "created": 1719659159,
      "depth": 0,
      "replies": []
    },
    {
      "id": "latwd49",
      "score": 1,
      "body": "I don’t own shares of airbus but following the recent drop I would start to have a look at the company…I have no doubts about this company’s future",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/latwd49/",
      "created": 1719668002,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lawow9u",
      "score": 1,
      "body": "The FAA is investigating Boeing and Airbus because they may have used counterfeit Titanium and faked documentation...It's in the news.",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lawow9u/",
      "created": 1719705689,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laxazu3",
      "score": 1,
      "body": "I’ve flown on a lot of planes and like Airbus better",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laxazu3/",
      "created": 1719715405,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb5w6qf",
      "score": 1,
      "body": "Embraer ($ERJ) is fairly exciting. Their regional jet products are in high demand, comfortable and they aren't completely overleveraged in manufacturing. Their core business (like the Phenom line of private jets) is also an excellent backstop.\n\nThe stock made a pretty cool run this spring, too.",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lb5w6qf/",
      "created": 1719857892,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lnr3vf1",
      "score": 1,
      "body": "Yes, quality compounder stock in a duopoly... only issue is China is spending big to break in to this field and is heavily Government-backed and you know they will have a tonne of advantages when it comes to supply-chain efficiency and can probably do things cheaper than Airbus long-term which could potentially impact profitability.",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lnr3vf1/",
      "created": 1726675610,
      "depth": 0,
      "replies": []
    },
    {
      "id": "laqx2nz",
      "score": 0,
      "body": "$PLTR helped them fix their engine problems a while back, so at least they outsource to quality companies.",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laqx2nz/",
      "created": 1719612978,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lapx80w",
      "score": -2,
      "body": "AIR is up because BA is down. Long term doesn’t look promising for AIR at this level.",
      "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/lapx80w/",
      "created": 1719600208,
      "depth": 0,
      "replies": [
        {
          "id": "laq0wo1",
          "score": 1,
          "body": "Ba down? My puts are suffering bc BA NOT DOWN after really bad news",
          "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laq0wo1/",
          "created": 1719601481,
          "depth": 1,
          "replies": [
            {
              "id": "laq8lfu",
              "score": 3,
              "body": "Buying puts on anything in a bull market is just hurting your odds. Even on shit companies.",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laq8lfu/",
              "created": 1719604163,
              "depth": 2,
              "replies": []
            },
            {
              "id": "laq11ll",
              "score": 3,
              "body": "BA up 3% on fkn bad news",
              "permalink": "/r/stocks/comments/1dqqcox/deleted_by_user/laq11ll/",
              "created": 1719601529,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}