{
  "title": "Meta accused of breaching EU antitrust rules over ad-supported subscription service ",
  "score": 76,
  "selftext": "Facebook parent company Meta was on Monday accused by EU regulators of failing to comply with the bloc’s landmark antitrust rules over its recently introduced ad-supported social networking service.\n\nThe Commission labelled the ad-supported subscription option a “pay or consent” model — which means users have to either pay to use Meta’s platforms ad-free, or consent to their data being processed for personalized advertising. The service was introduced for Facebook and Instagram in Europe last year.\n\n“In the Commission’s preliminary view, this binary choice forces users to consent to the combination of their personal data and fails to provide them a less personalised but equivalent version of Meta’s social networks,” regulators said in a statement Monday.\n\nCNBC has reached out to Meta for comment. The company separately told Reuters in a statement that its ad-supported subscription model “follows the direction of the highest court in Europe and complies with the DMA.”\n\nMeta introduced the new model in response to a ruling from the European Court of Justice, the EU’s top court, last year that a company may offer an “alternative” version of its service that does not rely on data collection for ads. Meta has previously pointed to this ruling as a reason for introducing the subscription offer.\n\nSource: https://www.cnbc.com/2024/07/01/meta-accused-of-failing-to-comply-with-eu-antitrust-rules.html",
  "link_flair_text": null,
  "id": "1dsqkd7",
  "num_comments": 66,
  "created_utc": 1719832969,
  "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/",
  "comments": [
    {
      "id": "lb58qmq",
      "score": 27,
      "body": "The EU is making great strides in regulatory innovation. No tech companies, no problem, the US has plenty for the EU to regulate.",
      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb58qmq/",
      "created": 1719850312,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb695g2",
      "score": 20,
      "body": "We (Europeans) are decadent and selfsufficient af. Yes, we ruled the world for a few hundred years several centuries ago and apparently can’t get out of our mind that we are always right about everything. \n\nSure, we’re within our right to legislate inside Europe as we see fit, but we think too much of ourselves. We’re like 9% of the world’s population and make up 15% of the world’s GDP. But looking at projected number for 2050, it’s more like 3 and 6 percent respectively. \n\nNow, how easy do we think ig would be for foereign tech companies to simply ignore Europe? Very easy. \n\nHeck, even today the following has already happened: \n\n- Meta launched Threads, but not in Europe due to mad legislation. \n\n- Apple announced Apple Intelligence later this year, but not in Europe due to mad legislation. \n\nI fear it will only beclme worse, and meanwhile we try to make old car companies compete with Tesla, BYD and Xpeng. \n\nWish us luck.",
      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb695g2/",
      "created": 1719862135,
      "depth": 0,
      "replies": [
        {
          "id": "lb83ixb",
          "score": 4,
          "body": "Yup, Canada and Australia are doing stupid shit too with their news media vs tech companies.",
          "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb83ixb/",
          "created": 1719886215,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb8jq3v",
          "score": 3,
          "body": "The numbers change a bit when you consider that most of these companies are not able to operate in China. EU makes 25% of Meta's revenue.\n\nIt’s fair to criticize the EU but this law presented some time ago and Meta was well aware of it. They should have had a good enough legal team to come up with a solution which is in line with the guidance.",
          "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb8jq3v/",
          "created": 1719893307,
          "depth": 1,
          "replies": [
            {
              "id": "lb91eo4",
              "score": 1,
              "body": "Yes, I know and it was also a more general and long-term rant. I worry that in the long run, Europe will be avoided as we will geadually take up a smaller and smaller portion of the economy. For instance in 2050 and not only thinking about US the companies.",
              "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb91eo4/",
              "created": 1719903729,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lb9y4kx",
          "score": 3,
          "body": "meta launched threads in eu later, due to legislation and imo it's good it existed considering how much data meta collects. Apple announced apple intelligence but not in EU, while Google/Samsung/MSoft managed to launch their ai tools. Again, if others managed to do this, it's not a problem of EU legislation, it's a problem of apple not wanting to comply, like they maliciously complied with dma act. We don't try to make old car companies compete with others. We don't own these companies, we are not ceo's of those companies. Their decisions is totally up to them, if they/some chose to become irrelevant long term, that's their problem.",
          "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb9y4kx/",
          "created": 1719924139,
          "depth": 1,
          "replies": [
            {
              "id": "lbc0sa0",
              "score": 1,
              "body": "It’s the pattern that decadent minds come up with that worries menlong term. I don’t care about neither Threads nor Apple Intelligence as isolated cases.",
              "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lbc0sa0/",
              "created": 1719949533,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lb6oyvs",
          "score": 2,
          "body": "Every country \"thinks\" they are right, there's nothing exclusively European about it. It's clear that the EU performs worse than the US in economic terms, but it does better in other aspects. Legislation such as this one may get in the way of big tech companies, but it has positive outcomes. Forcing Apple to use a standard charger was a good thing. Forcing telecoms to eliminate roaming was too. Trying to prevent the monopolistic practices of Microsoft or Google is, in my opinion, positive as well.\n\nThe 15% of the EU may not seem very impressive, but it's still significant. Keep in mind China is completely closed to many Western companies, and so is Russia to a large extent. Even with what you call \"mad legislation\" (which, again, is a matter of opinion), companies try their best to operate in a region that remains relatively very rich.\n\nAs far as I know, Threads launched in Europe, but later than in other countries. Apple Intelligence may not, but in any case Apple's revenue doesn't depend on it -- it's an easy decision to make.",
          "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb6oyvs/",
          "created": 1719867217,
          "depth": 1,
          "replies": [
            {
              "id": "lb6tzm7",
              "score": 0,
              "body": "True, it’s not all bad abd no one knows the future. I hope you’re right, and fear that I am.",
              "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb6tzm7/",
              "created": 1719868870,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lb49z7z",
      "score": 31,
      "body": "Pretty outrageous ruling from the EU. Essentially they want to force Meta to offer its services for free with sub-optimal monetization. \n\nIn every other market, Meta’s value proposition to advertisers is they can create hyper targeted ad campaigns to convert at much higher rates than on less targeted and less scaled platforms. Here, the EU wants to turn Meta’s ad offering into the internet equivalent of roadside billboards - no targeting, no conversion tracking, and therefore much less pricing power for Meta, and, critically, much less value delivered to e-commerce brands in the EU. \n\nMeta is a social network and as such places extremely high value on having as many users as possible on its platforms, but the EU is providing enough reason for Meta, imo, to consider leaving the market.",
      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb49z7z/",
      "created": 1719837582,
      "depth": 0,
      "replies": [
        {
          "id": "lb4azdn",
          "score": -4,
          "body": "then it should leave if they don't like the rules. good riddance.",
          "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4azdn/",
          "created": 1719838035,
          "depth": 1,
          "replies": [
            {
              "id": "lb4do1x",
              "score": 17,
              "body": "Right, I agree. My point is that the EU’s rules are restrictive enough here that they might in fact consider leaving. I don’t think the EU has realistically considered that possibility (and same applies for Apple with the recent DMA rulings).\n\nAnd you say good riddance, but the reality is that many millions of people use (and like) Meta’s products. If that is bad for society’s well-being, then the EU should pass a law restricting or banning it on those grounds, not some extremely expansive antitrust regulation that, for whatever reason, compels a business to offer its product for free.",
              "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4do1x/",
              "created": 1719839197,
              "depth": 2,
              "replies": [
                {
                  "id": "lb4gdcv",
                  "score": 3,
                  "body": "Apple? DMA rulings? Apple is the one with the least amount of reasons to complain. They are utterly toxic, even though I, admittedly, use their ecosystem. They are doing everything they can to play around the DMA, thinking the EU is gonna be like the US and accept legal loopholes.\n\nTheir Core Technology Fee is the biggest BS I have ever seen in my life. And wanting to dictate and evaluate which third party stores can get into the iPhone ecosystem is another ridiculous move. It's like Windows and Android suddenly blocking any .exe/.apk file from being added to and run on their OS unless specifically approved by them. The fact you can't run emulators on your phone unless Apple approves it is absurd. Out of all gatekeepers, I seriously hope Apple gets fined over and over until they either leave the market or start respecting the laws.\n\nThese laws are as simple as it gets. As for Meta, yeah, I think the EU ruling is quite stupid. Meta should be able to offer its services for a price.",
                  "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4gdcv/",
                  "created": 1719840321,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lb4k445",
                      "score": 4,
                      "body": "I totally agree re: the App Store. It is highly extractive and monopolistic and needs to be regulated for anti trust concerns in some way. I am glad the EU is taking steps there and my main complaint would be that they should more proactively communicate their requirements w Apple rather than wait for Apple to release some policy and then accuse them of violations ex post. \n\nMy specific point about Apple and the DMA was the cross platform compatibility requirements. At WWDC, Apple announced new features allowing you to control your iPhone from your Apple computer. They are NOT releasing this in the EU, specifically bc they are worried about the cross platform compatibility requirements. If you read the requirements strictly, they suggest that Apple must release this feature for non-Mac computers as well as Mac computers. I think it goes without saying that that sort of integration is much harder and slower to implement than an integration between solely Apple devices. \n\nThe DMA is targeting vertical integration. There are indeed antitrust upsides to be had from limiting vertical integration, but consumers also generally *like* vertical integration (when a consumer buys an Apple thing they know it works with all their other Apple things). There is a trade-off and you are seeing both sides of that trade-off with the App Store policies but also the cross platform compatibility requirements.",
                      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4k445/",
                      "created": 1719841798,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lbdxsat",
                      "score": 1,
                      "body": "> They are utterly toxic, even though I, admittedly, use their ecosystem. \n\nWhy don’t you have an android?",
                      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lbdxsat/",
                      "created": 1719975024,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lbkvovq",
                          "score": 1,
                          "body": "Cuz it sucks? lol",
                          "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lbkvovq/",
                          "created": 1720090169,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lb4vmb8",
                      "score": 2,
                      "body": "They are a company not a charity. You want cutting edge tech - they need to be able to make money.",
                      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4vmb8/",
                      "created": 1719845934,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lb9zgyn",
                          "score": 3,
                          "body": "yes, and ppl did pay for the product. They do have huge margins for iphone. Opening the bootloader/alt stores doesn't mean apple will become a charity, it means you as a user will get the freedom to install another os/ app store, on a device \\_you\\_ own, for which \\_you\\_ did pay and for which \\_apple\\_ did make money. You may not want to use this freedom and it's ok, like many others don't want to bother, but having this freedom doesn't mean apple will become a charity. Google is not a charity. Samsung is not a charity. And don't suggest me to buy android, bc I already have one, I have both and I would like to have the freedom on both even if I will not use it in 20 years one ever(like I have the freedom to install another app store/OS on my pixel, I don't want to, but I can and if I'll want to - I'll be able to do this). And if you ask about other companies (like game consoles) - yes, ideally those should follow the same rules",
                          "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb9zgyn/",
                          "created": 1719924720,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lbdxyxx",
                              "score": 1,
                              "body": "You think apple makes money from selling phones?",
                              "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lbdxyxx/",
                              "created": 1719975103,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lbel23x",
                                  "score": 1,
                                  "body": "I don't think, I know. biggest source of revenue is Iphone sells, basically 2/3 of _all_ their revenue, gross profit being estimated around 40% if not more. A simple google search will lead you to this",
                                  "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lbel23x/",
                                  "created": 1719987034,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lbmnm0u",
                              "score": 1,
                              "body": "Does this open the door for PlayStation to have a digital store on a Nintendo console or vice versa?\n\nAlso does having  3rd party stores on an iPhone make the iPhone less secure?",
                              "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lbmnm0u/",
                              "created": 1720115941,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lbmzoga",
                                  "score": 2,
                                  "body": "1- ideally it should, but for now dma doesn't treat sony/nintendo as gatekeepers  \n2- imo no. The default would still be app store, so ppl not willing to make a change will not make it. The sideload still requires additional confirmations, and alternative stores may be more ore less secure based on their rules. Considering appstore has tons of malware and it's a closed system, some can argue that in fact it's not secure since it can't be audited directly like open source projects, but it's a subject for another debate. Imo, considering appstore is still default store application, users would hardly feel a difference and only those that do need more will install other stores. Also, in theory, apple could pull a trick like when buying an iphone asking buyers if they want to use only appstore or not and depending on answer turn on some additional protection to not allow installing other stores unless the phone is reset. In this case the decision is still made by the user, but apple can frame the question in their favor",
                                  "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lbmzoga/",
                                  "created": 1720120225,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lba1sfk",
                          "score": 1,
                          "body": "They have a profit margin of 50% I think they make enough",
                          "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lba1sfk/",
                          "created": 1719925688,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lb4z3cb",
                          "score": -5,
                          "body": "Controlling an OS and dictating what gets into my phone and what doesn’t isn’t their right. They are just trying to find a way to monopolize the entire thing. I didn’t rent my phone, I bought it. I should be able to choose what I want to install. And yes, I could have bought an Android, but I don’t like the OS, despite the freedom it offers. That, and the fact I prefer Apple’s ecosystem. But nothing stops it from letting it be like the Mac.",
                          "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4z3cb/",
                          "created": 1719847108,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lb51twc",
                              "score": 5,
                              "body": "So Google has what you want but you don’t “prefer” that one so instead Apple has to build an OS that aligns with your “rights”? I’m starting to understand why EU doesn’t make any consumer electronics anybody wants.",
                              "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb51twc/",
                              "created": 1719848020,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lb67cpu",
                                  "score": 0,
                                  "body": "Uh, no? I am not demanding anything, but if the EU decides to force them to do that, I will just defend it, since it's something I want, lol. Right now, they are breaking EU law, and they keep trying to play around it, just to stick to their ideals (that have no real justification), so it's their fault. Overall, what's your problem, exactly? You have a dire need to simp for a trillion dollar company that's build on a toxic monopoly?\n\nIt's kinda hilarious how you criticize the EU for demanding something that doesn't necessarily affect ANYBODY, including those inside the EU. All you gotta do is just keep using Apple's stuff. Stay in the App Store, lol. The EU is so \"wrong\" that even Japan's passing a law that's pretty much identical to it. Hopefully the rest of the world follows suit and puts a stop to their ideocracy.\n\nPS: The EU doesn't have a competitive electronics market because of strict law regulations, worker rights and too much bureaucracy. That's something completely unrelated to this matter, because the biggest issue is on the tax system and the super strict work rights. The US has a much more flexible system, entirely outlined just to appeal to big corporations.",
                                  "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb67cpu/",
                                  "created": 1719861544,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lb6mr3i",
                                      "score": 0,
                                      "body": "I disagree on toxic monopoly premise. Consumer-liked products that dominate their market are not toxic. Especially when alternatives exists (plenty of phone makers, plenty of social networks) yet EU wants to focus on the big dawgs as if someone is forcing consumers to use them somehow. Don’t like the privacy of Facebook? Don’t use it! I’ve long deleted my Facebook account for that very reason. \n\nJapan’s new law is a complete joke given that Nintendo and Sony were exempted. Japan says Apple must open App Store - okay let’s see Nintendo and PlayStation do that! (That’s absolutely never, ever going to happen.)\n\nI agree on that last part - it is a different topic. \n\nMy issue is that all this stuff about “consumer rights” is really just a way to force American companies out, or extort them, even though American tech products are market leaders.",
                                      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb6mr3i/",
                                      "created": 1719866491,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lb9yjgc",
                  "score": 1,
                  "body": "society's wellbeing may actually be better without meta's social media and it's not like meta can't show ads, they are just limited in amount of collected data and ways to use it",
                  "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb9yjgc/",
                  "created": 1719924318,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lba1nkm",
                  "score": 1,
                  "body": "You think companies are going to leave the EU because they have slightly lower profit margins? Sound like bs to me.",
                  "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lba1nkm/",
                  "created": 1719925633,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lba3t6z",
                      "score": 2,
                      "body": "I think if they cannot do personalized ads, their margins will be significantly lower, not slightly lower.\n\nAdditionally, more unique requirements for the EU means more resources (engineering, legal, marketing) that they need to invest into their EU platform to comply with rules, build the features and safeguards, and market them effectively to advertisers.\n\nHigher costs + lower profit in a region that was $8.4bn in Q1 revenue (23% of global revenue), a potential fine as noted in this article of over $13bn, and a regulator that does not give clear guidance.\n\nI don't think Meta is going to leave the EU tomorrow, but I do think they will start asking the question internally soon (if they aren't doing so already).",
                      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lba3t6z/",
                      "created": 1719926508,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lb4f9bp",
                  "score": 1,
                  "body": "Meta and Apple's profit margin are huge. You are saying they make it mandatory to give for free when it's clear that they can cut a lot more into their profit margin until they get to be a \"free product\". \n\nI understand that the EU here gets a lot of hate because people have stock in this companies. I also have stock in them. But I am with the EU on this one.",
                  "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4f9bp/",
                  "created": 1719839867,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lb4ius8",
                      "score": 12,
                      "body": "Their margins are huge bc they have built compelling products that customers are willing to pay for and cannot find alternatives to easily elsewhere. \n\nIf the goal of a regulatory body is to capture some of a corporation’s margin, they should impose a tax. If the goal of a regulatory body is to protect users from some harm, they should pass a law outlawing that harm. \n\nWhat is the “antitrust” violation here, and why is remedy to compel Meta to provide its product for free, which if anything would expand its market dominance compared to a competitor?",
                      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4ius8/",
                      "created": 1719841311,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lb4ht5u",
                      "score": 6,
                      "body": "Apple and META are both private run businesses and I really fail to see what their profit margins have to do with anything. What next? Are we going to fix the prices of Apple’s products — so it doesn’t make “too much money?”\n\nAt the end of the day, customers don’t need to buy an iPhone. They can buy any other smartphone. They don’t need to use META’s app. Instagram is not a basic human right. If you don’t like the terms set by these private run businesses — just don’t use their service.\n\nInstead, you want to complain that they’re very good at what they’re meant to do (make great products and services that make them a lot of money)?\n\nYou do realise that this exact mentality is why European tech is in the dustbin? If we keep this up, China will soon be the only place where innovation can thrive.",
                      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4ht5u/",
                      "created": 1719840897,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lba232b",
                          "score": 2,
                          "body": "Follow the local laws or leave",
                          "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lba232b/",
                          "created": 1719925811,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lb847tl",
                          "score": 1,
                          "body": "> Apple and META are both private run businesses\n\nThey are public.",
                          "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb847tl/",
                          "created": 1719886499,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lb4fcxf",
              "score": 14,
              "body": "This anti-META crusade is so tiring ffs.\n\nWhy should it be META to leave?\n\nThe rules are bullshit.\n\nMETA is not a charity. It’s a service that costs META money. It’s its offering users to pay for that service through either their data and being served ads — or through a subscription. Sounds completely fair.\n\nPerhaps… it’s unhappy users who should leave META if they don’t like the terms and conditions. You know having an Instagram account is not a basic human right, right?\n\nThis smells a lot like EU’s accusation that Apple was being anti-competitive by not releasing A.I. features in the EU. It’s the same weird ass logic.",
              "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4fcxf/",
              "created": 1719839908,
              "depth": 2,
              "replies": [
                {
                  "id": "lb4h164",
                  "score": 16,
                  "body": ">You know having an Instagram account is not a basic human right, right? \n\nGive the EU a few years and it just might become one.",
                  "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4h164/",
                  "created": 1719840586,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lb4pi35",
                      "score": 7,
                      "body": "Pretty sure, yea. They’ll probably nationalise it, make it completely free, and still demand META pay for it.",
                      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4pi35/",
                      "created": 1719843798,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lb51uft",
                  "score": 3,
                  "body": "Meta is used as the scapegoat because people like the comment you replied to feel more at ease when they can blame one sole entity. The funny thing is meta isn’t even the biggest player when it comes to ads.. spoiler alert: it’s the “good” guy player who knows how to manipulate optics (google)",
                  "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb51uft/",
                  "created": 1719848025,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lb4o5xx",
                  "score": 4,
                  "body": "Because it's just simple democracy? Because people in countries vote for political parties and then the elected politicians make rules on behalf of the people. Businesses can choose whether they want to operate within those (democratically decided) rules, outside of those rules and get fined, or not operate in that market. \n\n\nWhy should meta be able to do whatever they want without the consent of regulating bodies? If you don't like the rules within a particular market then go elsewhere.",
                  "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4o5xx/",
                  "created": 1719843319,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lb9zrb8",
                  "score": 1,
                  "body": "meta will still make (tons of) money without targeted ads, just not as much. It doesn't mean Meta/apple will become a charity, just that they'll f\\*\\*\\* up our privacy less",
                  "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb9zrb8/",
                  "created": 1719924843,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lba8wg6",
              "score": 1,
              "body": "Meta can decide to leave or stay within the rule.\n\nHowever, other people can criticize or praise the rule.\n\nSaying \"they should leave if they don't like the rule\" is kinda pointless in a discussion thread about the rule itself.",
              "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lba8wg6/",
              "created": 1719928476,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lb58b8l",
              "score": 1,
              "body": "They should leave so the europoors have a meltdown",
              "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb58b8l/",
              "created": 1719850168,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lb9ydn6",
          "score": 1,
          "body": "if they can't operate a platform with less targeted ads, maybe they should gtfo?",
          "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb9ydn6/",
          "created": 1719924249,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb6hvg9",
          "score": 0,
          "body": "EU regulatory decisions on tech are all thinly veiled protectionism for the most part. Lots of insane decisions there.",
          "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb6hvg9/",
          "created": 1719864894,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb4vc70",
          "score": 0,
          "body": "I think multiple American tech companies may make a stand and possible suspend operations. Eventually the political atmosphere will change and they can continue.",
          "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4vc70/",
          "created": 1719845838,
          "depth": 1,
          "replies": [
            {
              "id": "lba2f54",
              "score": 1,
              "body": "Yeah they gone ditch 25% of their profits sure.",
              "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lba2f54/",
              "created": 1719925949,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lb4nyfo",
      "score": 4,
      "body": "I still hold a ton of both META & AMZN that I bought in late 2022.  Huge gains.  \n\nTo me they're forever holds except for one thing which is a government/regulation interruption of their business models.  Up to & including (however small the chance) full monopolistic breakup.  \n\nThe businesses themselves are strong and led by incredibly competent and forward-thinking execs. \n\nIt's annoying to have to worry about that element as a long-term investor in both.",
      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4nyfo/",
      "created": 1719843244,
      "depth": 0,
      "replies": [
        {
          "id": "lb4ygxg",
          "score": 6,
          "body": "I’m of the firm belief that METAs parts are worth more than the company. The ad supported side of the company is making all the money and yet at the same time reducing trust in the other parts of the company.",
          "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4ygxg/",
          "created": 1719846899,
          "depth": 1,
          "replies": [
            {
              "id": "lb68ese",
              "score": 1,
              "body": "IMO the problem with Facebook long term is the law of large numbers is limiting how much more growth they can really get without breaking into another industry.\n\ni.e. at this point a lot of their user growth can only come from stealing users from other Facebook owned apps, due to their dominance of social media sites. And when you hit market saturation in terms of time those users are willing to spend on the apps, and the amount of money advertisers are willing to pay, how else can they keep growing, let alone growing at the rates they have in the past?",
              "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb68ese/",
              "created": 1719861892,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lb4gnuj",
      "score": -1,
      "body": "It really speaks to how much value there is in harvesting people's data when Meta are able to say \"Pay to use our service or don't pay but we can use your data\".\n\n\nIt's two different questions. Meta can either charge people to use their service and do or don't have ads. Or don't charge people to use your service and do or don't have ads. \n\n\nIt's a different question entirely about what Meta can or should be allowed to do with people's data. People don't understand the value of their personal data and that's why it's being made a choice by Meta. They know its value.\n\n\nPersonalised ads are definitely getting more intrusive and specific. I get ads not just for things I search about online but things I speak about out loud. These companies definitely have systems that record what we all say in order to \"help us\". \n\n\nI get it can be hard for companies to comply with laws but equally Meta wants to have its cake and eat it.",
      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4gnuj/",
      "created": 1719840439,
      "depth": 0,
      "replies": [
        {
          "id": "lb4v6p5",
          "score": 9,
          "body": "> I get ads not just for things I search about online but things I speak about out loud. These companies definitely have systems that record what we all say in order to \"help us\".\n\nThis is just flat out false.",
          "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4v6p5/",
          "created": 1719845787,
          "depth": 1,
          "replies": [
            {
              "id": "lb68ws3",
              "score": 3,
              "body": "Depends on the product/company.\n\nI've definitely read accusations about Amazon Alexa where people talk about something, and then soon see ads related to the thing they talked about. But because of what the Alexa does it obviously has to be listening constantly in case you give it a command.",
              "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb68ws3/",
              "created": 1719862056,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lb6ifjn",
              "score": 1,
              "body": "If any corrupt company were to do it it would be meta, that being said they don’t really need to since most put everything they think about online and let their Trojan horse app suck every bit of data out of their phone. I’ve no idea why anyone would install a meta app on their phone!",
              "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb6ifjn/",
              "created": 1719865079,
              "depth": 2,
              "replies": [
                {
                  "id": "lb6uk2w",
                  "score": 1,
                  "body": "> If any corrupt company were to do it it would be meta\n\nDon't believe things just because you want something to be true. Exercise critical thinking. Read others' posts on why this makes zero sense for meta to do.",
                  "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb6uk2w/",
                  "created": 1719869064,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lb6x06d",
                      "score": 1,
                      "body": "Zero sense like it would be to hack tens of millions of phones, yet that is exactly what they done",
                      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb6x06d/",
                      "created": 1719869890,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lb4xw91",
              "score": -5,
              "body": "No it isn't. ",
              "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb4xw91/",
              "created": 1719846705,
              "depth": 2,
              "replies": [
                {
                  "id": "lb59nzb",
                  "score": 7,
                  "body": "If they really have \"systems that record what we all say\", then they'll need:\n\n* Microphone permission to use it on your phone in the first place.\n* Continuously monitor your microphone, which would probably drain your entire phone battery in an hour or two. You would also be able to see the icon which says your microphone is active.\n* Either send all the data to the cloud, or process it with local AI:\n* If they process it locally, they would need a neural network orders of magnitude smaller and more powerful than any current known cutting-edge solutions. And enough processing power on your phone to use it, which means both hardware (go check which devices will support Apple Intelligence) and again ludicrously high continuous battery usage.\n* If they process it in the cloud, they would need to upload massive amounts of data which you would also be able to see.\n\nDo you have one shred of evidence to support your claims about any of that?",
                  "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb59nzb/",
                  "created": 1719850614,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lb5e6ck",
                      "score": 3,
                      "body": "In addition, people who have access to the OS (Apple, Google, and jailbreakers) can easily prove that the microphone is recording by intercepting API calls but they haven’t. And it is in all their best interest to.",
                      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb5e6ck/",
                      "created": 1719852084,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lba13lx",
                      "score": 1,
                      "body": "or they can create a small NN that will be triggerend only for a small subset of things and encode&compress that sampled data and send it. Much less hassle, data communication and processing requirements. Not saying they are doing this, but you don't need to send massive data nor have huge NN to do such stuff. It's not even a requirement to do this real time. You don't speak all day, nn can filter out /detect only the speaking sound. You don't need to store the sound in high quality, they have models&published papers to heavily reduce audio size while preserving important info. On device voice recognition is a thing, google already pushed it on pixels some years ago and it worked real time, for non realtime - the performance requirements are even smaller. On that recognized text you may run some small nn(or even not nn, there are classic ml statistic models that are good enough) to extract relevant embeddings for which meta saves/needs info and send only those.\n\nAgain, not saying meta/others are doing this, more likely they are just tracking your searches/network requests and can make predictions on them, but creating targeting info based on audio isn't such a hard task, I guess even a student can make a basic version of it, esp for a company like meta/google",
                      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lba13lx/",
                      "created": 1719925401,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lb6vyu9",
                      "score": -1,
                      "body": "Yes",
                      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb6vyu9/",
                      "created": 1719869540,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lb5d9w2",
                      "score": -4,
                      "body": "> You would also be able to see the icon which says your microphone is active.\n\nLol",
                      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb5d9w2/",
                      "created": 1719851794,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lb5ef8l",
                          "score": 7,
                          "body": "So in addition to the above, you think META has found a back door in the OS to disable that automatic icon on microphone activation and apple is okay with it?",
                          "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb5ef8l/",
                          "created": 1719852165,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lb5f6ju",
                              "score": 6,
                              "body": "Nonono you see, it's actually all part of the big conspiracy they're all secretly involved in! Must be part of the \"deep state\" or something, idk I don't really follow these things. (/s)",
                              "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lb5f6ju/",
                              "created": 1719852407,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lbt3zpt",
      "score": 1,
      "body": "Fuck the EU then.\n\nThey want free service? Nah dawg, it doesn't work that way.",
      "permalink": "/r/stocks/comments/1dsqkd7/meta_accused_of_breaching_eu_antitrust_rules_over/lbt3zpt/",
      "created": 1720216583,
      "depth": 0,
      "replies": []
    }
  ]
}