{
  "title": "Boeing agrees to buy fuselage maker Spirit AeroSystems in $4.7 billion deal ",
  "score": 132,
  "selftext": "Boeing said Monday that it will buy back its struggling fuselage maker Spirit AeroSystems in an all-stock deal that the planemaker has said will improve safety and quality control.\n\nIt said it agreed to pay $37.25 a share in Boeing stock for Spirit, giving the aerospace company an equity value of $4.7 billion. Including Spirit’s debt the deal has a transaction value of $8.3 billion Boeing said. Spirit’s shares closed Friday at $32.87 a share, giving it a market capitalization of about $3.8 billion.\n\nBoeing in March disclosed that it was in talks to acquire the Wichita, Kansas-based company, weeks after a fuselage panel blew out midair from a nearly new Boeing 737 Max 9 on an Alaska Airlines flight, sparking a fresh crisis for Boeing. Spirit makes the fuselages for the 737 and other parts, including sections of Boeing’s 787 Dreamliners.\n\nIn 2005, Boeing spun off operations in Kansas and Oklahoma that became the present-day Spirit AeroSystems. Boeing accounted for about 70% of Spirit’s revenue last year, while roughly a quarter came from making parts for Boeing’s main rival, Airbus, according to a securities filing.\n\nCEO Dave Calhoun, who has said he will step down at the end of the year, on Monday said bringing Spirit in-house will “fully align” the companies’ production systems and workforces.\n\n“Among the many actions we’re taking as a company, this is one of the most significant in demonstrating our unwavering commitment to strengthen quality and make certain that Boeing is the company the world needs it to be,” Dave Calhoun said in a message to employees.\n\nHe said he expects the deal to close mid-2025, subject to approval by regulators, Spirit shareholders and the sale of Spirit’s operators dedicated to Airbus planes.\n\nSpirit’s CEO Pat Shanahan is considered a possible replacement for Calhoun.\n\nAirbus, meanwhile, said Monday it has reached an agreement with Spirit so that the European aircraft manufacturer is compensated $559 million by Spirit to acquire its manufacturing lines dedicated to Airbus planes. Those include operations in Belfast, Northern Ireland, where the wings and mid-fuselage of the A220 is produced, A220 pylons in Wichita, Kansas, and A350 fuselage sections in North Carolina.\n\nMounting pressure\n\nA preliminary report from the National Transportation Safety Board into the Jan. 5 accident said it appeared the bolts that hold the door plug in place weren’t attached to the Max 9 when it left Boeing’s factory and was handed over to Alaska Airlines months before the accident.\n\nThat was the most serious of a host of production problems on Boeing planes, which also included Spirit-made fuselages that had misdrilled holes and misconnected fuselage panels.\n\nThe crisis stemming from the door-plug blowout on the Alaska flight has slowed Boeing’s deliveries of new planes to airlines, and has driven financial hits for both Spirit and Boeing. Boeing’s CFO in May said the company would burn, rather than generate cash this year—about $8 billion in the first half of 2024. Boeing’s shares are down more than 30% this year.\n\nOne way Boeing has tried to improve quality is to accept only fuselages without defects so that repairs or additional manufacturing steps won’t have to be made out of sequence, reducing the changes of errors.\n\nThe Federal Aviation Administration has said it won’t let Boeing expand production until it is satisfied with its production lines.\n\nCalhoun was skewered by lawmakers in a June Senate hearing over the company’s safety record and what some Senators lamented was a lack of improvement in the wake of two deadly Max crashes.\n\nSource: https://www.cnbc.com/2024/07/01/boeing-to-buy-spirit-aerosystems.html",
  "link_flair_text": null,
  "id": "1dsqlu5",
  "num_comments": 35,
  "created_utc": 1719833121,
  "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/",
  "comments": [
    {
      "id": "lb4ffrl",
      "score": 42,
      "body": "Wonder if anyone will buy SAVE out of confusion",
      "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb4ffrl/",
      "created": 1719839940,
      "depth": 0,
      "replies": [
        {
          "id": "lb4lje0",
          "score": 11,
          "body": "I'll admit to checking SAVE's ticker for movement when first seeing the headline...",
          "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb4lje0/",
          "created": 1719842345,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb5xje1",
          "score": 2,
          "body": "Aladdin will, just to make sure",
          "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb5xje1/",
          "created": 1719858334,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbm3ade",
          "score": 2,
          "body": "People are doing it. The stupid OTM calls I have on SAVE are moving in price ($22.5 0719.)",
          "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lbm3ade/",
          "created": 1720108810,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb51dzj",
          "score": 1,
          "body": "I thought it was that for a second honestly. I hope it does, I gambled on the merger the courts struck down and I wouldn't mind making some of that back.",
          "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb51dzj/",
          "created": 1719847872,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb5k03x",
      "score": 39,
      "body": "Poor quality company buys poorer quality company to “improve”, and considers their CEO as a new CEO for the whole mess? Somebody tell me where’s the upside",
      "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb5k03x/",
      "created": 1719853974,
      "depth": 0,
      "replies": [
        {
          "id": "lb5wl20",
          "score": 9,
          "body": "At a guess: fundamentally it is easier to build xyz assembly yourself than to pay someone else to build the assembly and then still need to check that it was done correctly and install it into the larger assembly. \n\nThere also might be a kind of tone shift to this: one of the main moves after the McDonald merger was to sell off this kind of operation so bringing it back means a return to an older culture.",
          "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb5wl20/",
          "created": 1719858021,
          "depth": 1,
          "replies": [
            {
              "id": "lb9hip2",
              "score": 2,
              "body": "As a sub for a boeing prime, there is not a single entity in the universe worse at managing government contracts than boeing.\n\nSo yea hopefully them acquiring this company will streamline something",
              "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb9hip2/",
              "created": 1719915263,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lb4g3nc",
      "score": 20,
      "body": "If you want to make money out of Boeing...  buy shares in Duct Tape ;)",
      "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb4g3nc/",
      "created": 1719840212,
      "depth": 0,
      "replies": [
        {
          "id": "lb50xs2",
          "score": 6,
          "body": "But not bolts or wrenches, they are using those a lot less often nowadays I've heard.",
          "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb50xs2/",
          "created": 1719847724,
          "depth": 1,
          "replies": [
            {
              "id": "lb5e97g",
              "score": 2,
              "body": "Every penny counts. ",
              "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb5e97g/",
              "created": 1719852110,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lb4y141",
          "score": 4,
          "body": "I was going to say buy AirBus but duct tape works to ",
          "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb4y141/",
          "created": 1719846750,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb4lnsm",
      "score": 5,
      "body": "Does anyone else see long-term value for Boeing?",
      "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb4lnsm/",
      "created": 1719842390,
      "depth": 0,
      "replies": [
        {
          "id": "lb527cr",
          "score": 12,
          "body": "Well it’s down ~50% from its high which is a good start. The question is has all the bad news been priced in yet? I have my doubts personally ",
          "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb527cr/",
          "created": 1719848143,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb4ytce",
          "score": 6,
          "body": "Look at the  backlog. Isn't changing anytime soon.",
          "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb4ytce/",
          "created": 1719847015,
          "depth": 1,
          "replies": [
            {
              "id": "lb61k36",
              "score": 1,
              "body": "The problem is with such a long backlog more customers are turning to Airbus.",
              "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb61k36/",
              "created": 1719859641,
              "depth": 2,
              "replies": [
                {
                  "id": "lb6l56y",
                  "score": 7,
                  "body": "have you seen airbus's backlog? youd be going from one backlog to going behind an even longer backlog. its a duopoly for a reason.",
                  "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb6l56y/",
                  "created": 1719865963,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lb9co3q",
                  "score": 3,
                  "body": "It really doesn't matter tbh. Both Boeing and Airbus are in a position where every plane they make will sell instantly to a long list of customers. The name of the game is increasing how many planes you're actually able to make.",
                  "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb9co3q/",
                  "created": 1719911871,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lb7ng9a",
          "score": 5,
          "body": "Yes absolutely… The USA is not a capitalist country, it’s a corporate welfare economy. As long as the US remains a corporate welfare country there will always be long term value in garbage conglomerates, because the USA will always bank roll them no matter how bad it gets. Boeing could literally crash 100 planes into the 100 tallest buildings in the world and the US would still prop it up at the expense of taxpayers.",
          "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb7ng9a/",
          "created": 1719879817,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbcz4vp",
          "score": 1,
          "body": "if you're invested in BA or thinking about it, the third comment from top caught my eye. I have some shares but kind of interesting info.\n\nhttps://www.reddit.com/r/boeing/s/HxYrxHBR05",
          "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lbcz4vp/",
          "created": 1719961218,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb4ycnj",
          "score": -3,
          "body": "Yes, there is absolutely long term value for Boeing. Boeing is just going through a rough patch of misinformed media and problematic quality issues. Their core business is extremely strong.",
          "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb4ycnj/",
          "created": 1719846858,
          "depth": 1,
          "replies": [
            {
              "id": "lb5dmv8",
              "score": 12,
              "body": "Misinformed media, lol. They are in the middle of an actual shitstorm of their own making. ",
              "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb5dmv8/",
              "created": 1719851910,
              "depth": 2,
              "replies": [
                {
                  "id": "lb5dw5d",
                  "score": 1,
                  "body": "That’s the case for some things definitely, hence why I said problematic quality issues. \n\nBut all the media stuff about Starliner being “stranded” at the ISS? Absolutely not true.",
                  "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb5dw5d/",
                  "created": 1719851993,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lb5fo7y",
                      "score": 1,
                      "body": "It's not 'stranded', it's just a crew whose return flight is indefinitely delayed due to Boeing's shitty quality control and corner cutting, same as with their aircraft division.\n\n\nDo you hear yourself? \n\n\nI wouldn't sit on a kitchen table Boeing designed. ",
                      "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb5fo7y/",
                      "created": 1719852564,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lb5ghhr",
                          "score": 5,
                          "body": "You are mistaken. Starliner can leave whenever they need to. It’s up there to learn more about the systems. It’s a TEST flight. \n\nStranded implies it can’t leave. \n\nJust the other day there was a shelter in place incident on the ISS, and astronauts took cover in Starliner in case they needed to evacuate. \n\nOnce again, Starliner is perfectly capable of returning to earth. \n\nWhy wouldn’t they use the time to learn more about the spacecraft, it’s a test flight after all. \n\nThe problematic part is part of the service module, which is discarded before re-entry. Therefore, they need to take the time to learn about any issues while it’s up there, since it cannot be recovered after the fact.",
                          "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb5ghhr/",
                          "created": 1719852826,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lb4syim",
      "score": 5,
      "body": "Picking Pat Shanahan for CEO would be the nail in the coffin for these clowns",
      "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb4syim/",
      "created": 1719845019,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb6ff8a",
      "score": 2,
      "body": "Oof, lot of new staff buying up double deadbolts for their windows..",
      "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb6ff8a/",
      "created": 1719864148,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb61c9w",
      "score": 3,
      "body": "What did they sell the company for in the first place?",
      "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb61c9w/",
      "created": 1719859571,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb66ikz",
      "score": 3,
      "body": "Even Boeing could not be stupid enough to promote the CEO of Spirit to be it’s CEO. Irrespective of the guy’s capabilities, the optics are so braindead",
      "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb66ikz/",
      "created": 1719861263,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb82npf",
      "score": 1,
      "body": "Boeing is just an absolute crap show. I know they are one of the two big players in the market but they are just begging to be replaced by the Chinese",
      "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb82npf/",
      "created": 1719885868,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb4iwd2",
      "score": 0,
      "body": "Woow",
      "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb4iwd2/",
      "created": 1719841328,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb55hec",
      "score": 0,
      "body": "Should I buy or SPIRIT Aerosystems or not?",
      "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lb55hec/",
      "created": 1719849229,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lboq5hs",
      "score": 1,
      "body": "Boeing is paying Spirit shareholders in worthless Boeing stock. This is like selling your house for Chuck E Cheese tokens.",
      "permalink": "/r/stocks/comments/1dsqlu5/boeing_agrees_to_buy_fuselage_maker_spirit/lboq5hs/",
      "created": 1720145743,
      "depth": 0,
      "replies": []
    }
  ]
}