{
  "title": "Thoughts on Uranium and Nuclear energy stocks?",
  "score": 74,
  "selftext": "With the aim capturing a possible trend for the next few years, what do you think of the uranium and nuclear energy sector?\n\nI see more political parties globally leaning on the idea of increasing/going back to nuclear energy to meet the energy demand and reduce dependency on fossil fuels, but this might meet the resistance of the majority of the people, so I am not sure how fast the adoption of nuclear energy can be. Thoughts?",
  "link_flair_text": null,
  "id": "1dswoba",
  "num_comments": 105,
  "created_utc": 1719849799,
  "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/",
  "comments": [
    {
      "id": "lb577k9",
      "score": 1,
      "body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb577k9/",
      "created": 1719849800,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb59guk",
      "score": 109,
      "body": "The majority of the people now realize that the anti nuclear lobby were lying through their teeth.",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb59guk/",
      "created": 1719850550,
      "depth": 0,
      "replies": [
        {
          "id": "lb5j73v",
          "score": 38,
          "body": "The anti nuclear lobby is vast and well funded. Ranging from the oil/gas companies to many environmental groups. Add in NIMBY, and it becomes very difficult to build nuclear power stations in the west.",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb5j73v/",
          "created": 1719853711,
          "depth": 1,
          "replies": [
            {
              "id": "lb7frj1",
              "score": 34,
              "body": "Turkey creek in south Florida been taking hurricanes to the face since my dad was born…. Surrounded by swamp and beach and Florida man.\n\nThere is no excuse a real progressive state isn’t trying to at least start the process of creating a modern facility in a more stable area… like Colorado or some shit.\n\nFlorida has more than just one nuclear plant and you NEVER hear any issues even after dozens of state of emergency and FEMA deployments.\n\nWhoever builds the next generation nuclear plants will be a powerhouse of energy 24 - 7 and the excess energy can be used for desalination or electrolysis for hydrogen production. \n\nMake america great again? Start with actual shit that made us great. Like tech and manufacturing",
              "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb7frj1/",
              "created": 1719876816,
              "depth": 2,
              "replies": [
                {
                  "id": "lb7mhns",
                  "score": 9,
                  "body": "I second that. We need some people in office that will focus on innovative solutions and infrastructure upgrades. We keep falling for the same old trick with the race politics of today playing us all like puppets against one another while never actually doing anything to benefit society as a whole. It’s always about sex, religion, guns, race, taxes, or scare tactics. We really need more than a dog and pony show with a pacifier.",
                  "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb7mhns/",
                  "created": 1719879436,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lb7tozs",
              "score": 3,
              "body": "The speed at which China build renewables compared to the speed it builds nuclear makes it clear that nuclears issues are not solely caused by western NIMBYism. It's just an inherently expensive technology compared to solar/wind/batteries. ",
              "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb7tozs/",
              "created": 1719882315,
              "depth": 2,
              "replies": [
                {
                  "id": "lb8k6c1",
                  "score": 7,
                  "body": "They put nuclear plants on submarines, it’s really not that complex of a technology and I really believe that in 50 or 100 years we’ll be looking back at this era and being like ‘what were they even thinking, this nuclear stuff is easy’ and Netflix will release a documentary on all the shady stuff oil and gas did to suppress nuclear.\n\nIt is a miraculous form of energy.",
                  "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb8k6c1/",
                  "created": 1719893538,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lb8qukp",
                      "score": 2,
                      "body": "It's not \"easy\"... on the contrary, compared to renewable it's complicated to the max. Guess why it's so expensive, ask the Brits about their new power plant. It costs 50 billion for a reason and that's definitely not because it's an easy tech",
                      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb8qukp/",
                      "created": 1719897146,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lb8qlvn",
                  "score": 1,
                  "body": "I'm with you, it's just to expensive. You don't find investors for a 50 billion plant which takes 10+ Yeats to build, when there are renewables that are way cheaper and faster to install and with way less risk... makes zero sense to me at the moment to invest in that tech.",
                  "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb8qlvn/",
                  "created": 1719897008,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lb65yln",
              "score": 2,
              "body": "Yep",
              "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb65yln/",
              "created": 1719861078,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lb78k2b",
          "score": 5,
          "body": "Maybe on Reddit. In the real world, I’m not so sure about that.",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb78k2b/",
          "created": 1719874057,
          "depth": 1,
          "replies": [
            {
              "id": "lba6c2j",
              "score": 1,
              "body": "Agreed. In just the last few years I've read about several nuclear plants in the US that are scheduled to be shutdown and not replaced with another nuclear plant. In one of those cases the nuclear plant was scheduled to be shutdown at least 15 years earlier then planned when it was initially built, due to all the public opposition to it which the politicians who regulate the plant decided to listen to.\n\nIMO reddit is pretty clearly a pro-nuclear bubble that doesn't match the real world.",
              "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lba6c2j/",
              "created": 1719927502,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lb76na5",
          "score": 2,
          "body": "Bullshit.",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb76na5/",
          "created": 1719873342,
          "depth": 1,
          "replies": [
            {
              "id": "lb9b8bf",
              "score": 6,
              "body": "Yeah OK in Germany many lefties still believe!\n\nThey bought into the lies spread by Gerd Gazprom Schroder and Joschka[ RWE](https://www.zeit.de/online/2009/28/fischer-berater-gas) Fischer.\n\nBoth those left wing anti nuclear politicians got paid via cushy jobs in the oil and gas industry.",
              "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb9b8bf/",
              "created": 1719910819,
              "depth": 2,
              "replies": [
                {
                  "id": "lb9dee5",
                  "score": -3,
                  "body": "Bullshit2",
                  "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb9dee5/",
                  "created": 1719912403,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lb5tg9g",
      "score": 19,
      "body": "The margins for uranium producers in the long term contract market are very healthy now. Even at current demand it's a seller's market. South Korea are building new reactors all over the world. Japan are extending and restarting (including the people who ran Fukushima). The US has done a 180 on nuclear after the tech billionaires started mentioning it as something they want. Their ban on Russian-enriched fuel will create bottlenecks in processing, and bottlenecks mean more raw lbs needed. One of Bill Gates' companies just broke ground on an SMR project.\n\nFrance's national uranium company are having problems now with Niger threatening to take one of their next mines from them (and give it to Russia). The Kazakhstan company responsible for 40% of the world's uranium can't get enough acid to expand production further. It's a good time to get into the producers as short another meltdown the term prices can't go down for the foreseeable. I suspect a lot of investors are getting confused looking at the spot price and don't realise that's a small % market of mostly traders rather than activity between the producers and consumers.\n\nI have positions in Kazatomprom, UEC and Denison Mines.",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb5tg9g/",
      "created": 1719856998,
      "depth": 0,
      "replies": [
        {
          "id": "lb7gmz2",
          "score": 2,
          "body": "What was your entry specs and return on those tickers? You beating spy?",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb7gmz2/",
          "created": 1719877157,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb8rswy",
          "score": 2,
          "body": "Why not own HURA instead, or at least include CCJ/CCO to the stock picks? Just curious.",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb8rswy/",
          "created": 1719897697,
          "depth": 1,
          "replies": [
            {
              "id": "lb98p78",
              "score": 7,
              "body": "I don't buy ETFs for small sectors. You pay fees to dilute the good stocks with junk or unattractively priced companies. I don't mind doing a bit of work to narrow the field, hopefully it works out for me.\n\nCameco look overpriced to me in direct comparison with Kazatomprom (higher market cap despite lower revenues and margins). They've already run up a lot, so I prefer the emerging players in the NA space who have cash on hand, projects near production, and physical stockpiles they can use to secure long-term contracts at current prices. Potential for bigger moves and rerating once up to speed. NexGen is another very popular one I'm avoiding for now as they don't have a permits let alone a production date, and have had to take out a massive loan to buy a stockpile. Sponsoring a Formula 1 team doesn't seem like an efficient use of capital in 2024.",
              "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb98p78/",
              "created": 1719908965,
              "depth": 2,
              "replies": [
                {
                  "id": "lba8y5i",
                  "score": 5,
                  "body": "I appreciate your insight. Thanks for taking the time to reply!",
                  "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lba8y5i/",
                  "created": 1719928494,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lbnnybp",
                  "score": 1,
                  "body": "I like UEC long term",
                  "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lbnnybp/",
                  "created": 1720129092,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lb8z24g",
          "score": 2,
          "body": "URNM did me well for a while. BOE (ASX) did me well for a while ..been looking at CCJ.",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb8z24g/",
          "created": 1719902172,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb5o7wc",
      "score": 16,
      "body": "Long CCJ",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb5o7wc/",
      "created": 1719855325,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb5m2yv",
      "score": 26,
      "body": "Cameco but you are late to the party",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb5m2yv/",
      "created": 1719854640,
      "depth": 0,
      "replies": [
        {
          "id": "lkio15v",
          "score": 1,
          "body": "why late? what about etf's like URNM for example?",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lkio15v/",
          "created": 1724945710,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb67gh0",
      "score": 10,
      "body": "I own Cameco, Denison mines, Uranium Royalty Corp, Nexgen energy and ASP Isotopes, so you can guess what my thoughts are...",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb67gh0/",
      "created": 1719861578,
      "depth": 0,
      "replies": [
        {
          "id": "lb7e1kr",
          "score": 3,
          "body": "> ASP Isotopes\n\nAs a fellow investor, my condolences",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb7e1kr/",
          "created": 1719876150,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb59j45",
      "score": 14,
      "body": "Ura etf offers a batch of uranium companies. Down about 10% from past few weeks now would be a decent time to buy",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb59j45/",
      "created": 1719850570,
      "depth": 0,
      "replies": [
        {
          "id": "lb5p7ik",
          "score": 9,
          "body": "Any thoughts on URA versus URNM?",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb5p7ik/",
          "created": 1719855643,
          "depth": 1,
          "replies": [
            {
              "id": "lb8z80s",
              "score": 3,
              "body": "I did nicely from URNM ..pulled out for the dip, keeping my eye on it to get back in.",
              "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb8z80s/",
              "created": 1719902278,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lb5e6i9",
      "score": 17,
      "body": "they are in theory one of the best types of energy as they're very clean and last ages.\n\n\nhowever nuclear plants take a ton of investment and are still feared by the public. I saw some DD mentioning that nuclear power would need to be used to run all the AI farms, but still I think public outcry outweighs it's benefits.",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb5e6i9/",
      "created": 1719852086,
      "depth": 0,
      "replies": [
        {
          "id": "lb5zswe",
          "score": 15,
          "body": "the heck you mean public outcry outweighs its benefits. The alternative is literally to keep burning fossil fuels, just exponentially more",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb5zswe/",
          "created": 1719859072,
          "depth": 1,
          "replies": [
            {
              "id": "lb68ivk",
              "score": 3,
              "body": "yes I know, you know, but the general public is going to keep fearing disasters like Chernobyl, Three Mile Island, or Fukushima. While nuclear power is one of the most clean and efficient ways of producing power, it has a negative public image.\n\nfossil fuels, while horrible for the environment, are cheap to obtain for now, and have a proven track record. Other renewables are good as well, but vary in different regions of the world and also have a hefty initial investment.\n\nhonestly this image of scary nuclear power is probably from the fossil fuel industry too, just look at a past campaign they had against windmills saying they killed too many birds.",
              "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb68ivk/",
              "created": 1719861929,
              "depth": 2,
              "replies": [
                {
                  "id": "lbaa1ky",
                  "score": 1,
                  "body": "well, any politician who's more afraid of public outcry than the overall good isn't a good politician, simple as",
                  "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lbaa1ky/",
                  "created": 1719928900,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lb8zgr0",
              "score": -2,
              "body": "Nuclear is great to cheer for its clean operation ..until you spill it.\n\nFossil fuels will erode the planet over centuries, nuclear fallout will destroy the planet for a millennia. Humans make mistakes ..nuclear power plant workers make mistakes.    \n\n\nCoal or Nuclear for energy production is between a rock and a hard place ..between a yellow rock and a black rock.",
              "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb8zgr0/",
              "created": 1719902439,
              "depth": 2,
              "replies": [
                {
                  "id": "lbaaj1z",
                  "score": 3,
                  "body": "so you'd rather cheer for actively destroying the planet rather than attempting to reduce the destruction? Doesn't make any sense. Both are not perfect but one is clearly less bad",
                  "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lbaaj1z/",
                  "created": 1719929082,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbadbts",
                      "score": 0,
                      "body": ">so you'd rather cheer for actively destroying the planet rather than attempting to reduce the destruction?\n\nAnd I said that when?\n\nLess bad how? If coal steadily pollutes the planet we can monitor its effect and pull back on the coal usage and stop if we have to. \n\nI we have a nuclear disaster there is no turning back from it. Fucked is fucked; forever.\n\nWhich is the worse of the two evils? Arguments on both sides.",
                      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lbadbts/",
                      "created": 1719930092,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lba2vkf",
                  "score": -1,
                  "body": "The other problem with nuclear is the more you engage in a risky activity (i.e. building more nuclear plants) the greater the chances that something very bad will happen at at least one of those plants, because that's how statistics work.",
                  "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lba2vkf/",
                  "created": 1719926134,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbaac7x",
                      "score": 2,
                      "body": "it's literally the same logic for every goddamn decision you make bruh",
                      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lbaac7x/",
                      "created": 1719929010,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "loexkye",
                      "score": 1,
                      "body": "I think you mean probability...",
                      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/loexkye/",
                      "created": 1727034569,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lba4unj",
          "score": 1,
          "body": "Not to mention nuclear energy tends be more expensive for the end consumer then other sources of energy, and it takes MUCH longer and MUCH more money to build a nuclear plant then the alternatives.\n\nLong story short, while some have said that we need to build nuclear plants to fight climate change, the fact of the matter is it would take way too long to do any good, and would give us far less energy per dollar spent then other green options like renewables. If your main goal is just to avert climate change and nothing else matters then it would be cheaper and quicker to just invest in renewables and battery storage.",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lba4unj/",
          "created": 1719926918,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb65wyh",
      "score": 9,
      "body": "Look up u/3STmotivation posts",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb65wyh/",
      "created": 1719861063,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb5r6eg",
      "score": 5,
      "body": "Ura has cheeper fees, preforms better, and i think it has more holding, so i went for that one.",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb5r6eg/",
      "created": 1719856276,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb6dxe1",
      "score": 6,
      "body": "I am all in. Checkout the thesis on u/UraniumSqueeze and checkout a podcast by Uranium Market Minute on YouTube. Justin really knows his stuff and will tell you all you need to know about the Bull case.",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb6dxe1/",
      "created": 1719863695,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb72h8v",
      "score": 5,
      "body": "In terms of nuclear, we're not quite there without subsidies to have the reactors be commercially viable to survive and thrive short term market pressures. However, uranium corps have heightened prospects because excitement over some state-owned reactors being built around the world are boosting interest in the largest uranium suppliers.\n\nDespite this big step in favor of nuclear, the fearmongering by Big Fossil, misguided environmentalists, and simply uninformed citizenry still sway policy in the US and wider western world against nuclear fission.\n\nThis may all change if the USA adopts fast breeder reactors and can make a more efficient processing of MOX fuel. The Russians did this as part of the Plutonium Management and Disposition Agreement which dictated the US and Russia should reduce weapons grade plutonium by turning it into unusable, civilian-only MOX fuel for reactors. The US dropped out since it was too expensive but Russia kept doing it (costing them $2 billion or so a year) but it's a great boon in the long term once they recoup losses on initial investments. If the USA can go beyond Russia's basic, costly system, it would finally make nuclear cost-competitive at a significantly faster rate.\n\nNow, all this is moot if commercially viable fusion makes energy dirt cheap for everyone or if solar and battery tech innovations divert us down a path of Dyson Sphere inevitability but I wouldn't discount nuclear fission. Many nations have already come around to it again and may see it as a tried and true backstop on the path to a clean and energy-abundant world.",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb72h8v/",
      "created": 1719871796,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb5l1lk",
      "score": 8,
      "body": "RYCEY and OKLO are positioning themselves in the small scale nuclear reactor market with the later developing recycling of spent fuel from previous technology reactors",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb5l1lk/",
      "created": 1719854308,
      "depth": 0,
      "replies": [
        {
          "id": "lb5qamg",
          "score": 2,
          "body": "What do you think about OKLO?",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb5qamg/",
          "created": 1719855992,
          "depth": 1,
          "replies": [
            {
              "id": "lb5qofn",
              "score": 2,
              "body": "I've got a moderate position that's down 12% right now but I'm holding long term in my IRA.",
              "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb5qofn/",
              "created": 1719856115,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lb5sdhd",
      "score": 2,
      "body": "a lot of hype and years to any new reactors will be completed.",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb5sdhd/",
      "created": 1719856652,
      "depth": 0,
      "replies": [
        {
          "id": "lb8zxww",
          "score": 1,
          "body": "Existing reactors are being refurbed to extend their lifes..",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb8zxww/",
          "created": 1719902753,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb65sn3",
      "score": 2,
      "body": "SMR, OKLO, SO with their Vogel plant now online.",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb65sn3/",
      "created": 1719861023,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb6qpex",
      "score": 2,
      "body": "I recently invested some money into Vaneck’s nuclear and uranium mining ETF and I’ve been pretty satisfied so far. Nuclear energy is the most viable option for renewable energy right now. By far the most efficient.",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb6qpex/",
      "created": 1719867786,
      "depth": 0,
      "replies": [
        {
          "id": "lqakdd9",
          "score": 1,
          "body": "Ticker?",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lqakdd9/",
          "created": 1728046387,
          "depth": 1,
          "replies": [
            {
              "id": "lqatl7n",
              "score": 1,
              "body": "NLR. Hasn’t done what I wanted it to since I posted this, but I still believe in the space. Long term play",
              "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lqatl7n/",
              "created": 1728049847,
              "depth": 2,
              "replies": [
                {
                  "id": "lqbzq51",
                  "score": 1,
                  "body": "yea im trying to figure out how much i want to put into this",
                  "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lqbzq51/",
                  "created": 1728063519,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lqc71eu",
                  "score": 1,
                  "body": "how did you decide to go with NLR?",
                  "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lqc71eu/",
                  "created": 1728065862,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lqhbljc",
                      "score": 1,
                      "body": "I asked around for insight on Vaneck and if they were trust worthy. I was basically told they are a little expensive from a fee perspective but are on top of their shit. I also did some digging into the largest holds of the ETF and liked what I saw.",
                      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lqhbljc/",
                      "created": 1728147180,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lb7j29c",
      "score": 2,
      "body": "Anyone playing NXE?",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb7j29c/",
      "created": 1719878093,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbeu4e9",
      "score": 2,
      "body": "Nuclear is very much on the table in Australia and so is Uranium.  The actual reactors will be state owned but the opportunity is uranium.  It is increasing in price but there are shit loads of deposits particularly in Australia that is untouched.  It will depend on how fast supply comes on.",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lbeu4e9/",
      "created": 1719993089,
      "depth": 0,
      "replies": [
        {
          "id": "lbev95d",
          "score": 1,
          "body": "In general when it comes to any commodity, I'd rather invest in the actual commodity rather than in the manufacturer, so I am conflicted not only if investing in the sector, but also between uranium only or uranium and nuclear stocks. I can't decide due to the political risks and how much margin will get captured by investors.",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lbev95d/",
          "created": 1719993891,
          "depth": 1,
          "replies": [
            {
              "id": "lbgld4d",
              "score": 1,
              "body": "I  think investing in uranium itself could lose value though if more countries started recycling it. I know the US originally quit recycling uranium because of a pact with USSR.",
              "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lbgld4d/",
              "created": 1720022719,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lc088pn",
          "score": 1,
          "body": "IF the conservatives get voted in next year (and it’s still a big IF) they will have to win with enough support to get the nuclear power plants off and running. This SHOULD spark Australia into mining uranium more for obvious benefits given the worlds biggest deposits of unmined Uranium is in Australia. It could definitely be good to invest in uranium mining companies but it’s kind of a big gamble as a lot can happen before the Australian election",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lc088pn/",
          "created": 1720333289,
          "depth": 1,
          "replies": [
            {
              "id": "lc4a310",
              "score": 1,
              "body": "I wasn’t thinking about Australia using it, more so export.",
              "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lc4a310/",
              "created": 1720397354,
              "depth": 2,
              "replies": [
                {
                  "id": "lc4pal4",
                  "score": 1,
                  "body": "I know and that’s what I’m driving at, IF Australia gets in the game of using nuclear power they will likely then have to take advantage of mining what’s domestically available in great quantity so perhaps a company that gets involved with mining it and has plans to enter the Aus market or Aus based company might be good to keep an eye on",
                  "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lc4pal4/",
                  "created": 1720403536,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lb6aegz",
      "score": 3,
      "body": "They take years to build, there’s nuclear expertise labor shortages, there’s uranium shortage, and they face a lot of public opposition and a well funded anti-nuclear lobby. \n\nSolar is the cheapest way to produce energy and faces the least amount of public and regulatory opposition. The only thing stopping it from being the de facto baseline energy source is its variability, which will be addressed by the grid scale storage systems that are starting to come online. I think grid scale storage + solar will win the clean energy race. \n\nOur dumbasses shot and sank the nuclear boat and never had to be in this climate mess in the first place, but oh well.",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb6aegz/",
      "created": 1719862550,
      "depth": 0,
      "replies": [
        {
          "id": "lb6slid",
          "score": -3,
          "body": "Solar is inefficient.",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb6slid/",
          "created": 1719868426,
          "depth": 1,
          "replies": [
            {
              "id": "lb6tsoz",
              "score": 2,
              "body": "Right. Call it off because 80% of the free and infinite potential energy doesn’t get used.",
              "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb6tsoz/",
              "created": 1719868806,
              "depth": 2,
              "replies": [
                {
                  "id": "lb6u619",
                  "score": -5,
                  "body": "Inefficient.",
                  "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb6u619/",
                  "created": 1719868932,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lb6ubl1",
                      "score": 2,
                      "body": "You make compelling arguments. By all means go all in on nuclear.",
                      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb6ubl1/",
                      "created": 1719868984,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lb6uh6a",
                          "score": -1,
                          "body": "[removed]",
                          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb6uh6a/",
                          "created": 1719869037,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lb6uov9",
                              "score": 3,
                              "body": "Okay",
                              "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb6uov9/",
                              "created": 1719869108,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lbafc3e",
              "score": 4,
              "body": "They hated you because you told the truth. Solar is piss waste of precious resources",
              "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lbafc3e/",
              "created": 1719930801,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lb7a6z2",
      "score": 2,
      "body": "Value is based on scarcity, the more nuclear we have the less profitable it will be",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb7a6z2/",
      "created": 1719874673,
      "depth": 0,
      "replies": [
        {
          "id": "lb8zw61",
          "score": 2,
          "body": "Not if your a miner.",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb8zw61/",
          "created": 1719902720,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb7aseq",
      "score": 2,
      "body": "Nuclear energy is the only sustainable and efficient technology or source we have right now. \n\nHowever, it’s a terrible investment. It’s a commodity business or a price competitive business where the low cost leader wins. And that’s not a very durable advantage. A plant in New York was recently closed because it could not compete on price with natural gas. Folks care about the price of their bill, and are not paying more for their energy to come from a clean source. PG&E has tried that tactic in its regions by selling power from their own solar farms, and it’s failed with a low participation rate because people simply care about the impact on their pockets.\n\nHigh capital expenditures with low returns on capital (often limited or restricted by state legislation) means less cash flow in owners pockets, and shoddy growth prospects. Likely capital expenditures would be met through a lot of debt, government subsidies, and shareholder dilution. \n\nThis is a highly regulated business, and as such that comes with costs and responsibilities. But the cost burdens are what is onerous to the owners especially with legislative changes and requirements.\n\nAt the end of the day, it’s a low margin, low return sort of business. And while it’s the technology and type of energy that is the key to the energy grids sustainability in the future, and energy is a necessity, that doesn’t exactly make it a rewarding business for owners. \n\nI’d seek out opportunities with high operating margins, low costs, limited competition, and consistently high returns on capital. Something that can swim against the current when the tide changes and doesn’t have to resort to lowest price to differentiate.",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb7aseq/",
      "created": 1719874900,
      "depth": 0,
      "replies": [
        {
          "id": "ljtgy8a",
          "score": 1,
          "body": "What opportunities do you think are on the horizon?",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/ljtgy8a/",
          "created": 1724564680,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb84hc0",
          "score": 1,
          "body": "Honestly this sounds like a thesis for the nationalization of the energy market. ",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb84hc0/",
          "created": 1719886608,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb69r9w",
      "score": 1,
      "body": "Robust and growing demand (contrary to popular belief) and a supply side that is persistently underperforming, you are looking in the right place with regards to investing in uranium",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb69r9w/",
      "created": 1719862336,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb73ak9",
      "score": 1,
      "body": "Meh",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb73ak9/",
      "created": 1719872096,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb7741d",
      "score": 1,
      "body": "Been in and out of miner stocks… it’s very volatile… long term thesis is good. Miners are learning and consolidated over the cheaper yellow cake days… like most of commodity but war and tension will mean USA needs a safer line to uranium… also China and India will want to get into this clean energy space… USA and Europe will have to follow to stay competitive and safe… the argument is good to make that in long term country that develop cutting edge clean energy will win… and long term clean energy that’s super cheap for base load demand is super important for computers and for clean water",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb7741d/",
      "created": 1719873518,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb7u1xy",
      "score": 1,
      "body": "I have invested in RYCEY and BWTX and have my eyes on Cameco and Brookfield. One of the big movements in nuclear energy is Small Modular Reactors (SMRs).",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb7u1xy/",
      "created": 1719882461,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb8axdl",
      "score": 2,
      "body": "I have a fat stack of NLR and will continue to grow it as a small part of my portfolio. Time will tell if it pays or not.",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb8axdl/",
      "created": 1719889230,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb8yt2j",
      "score": 1,
      "body": "Its going to go bonkers. ..and I'm waiting for the signals to put money into it.",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb8yt2j/",
      "created": 1719902006,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lba9hg4",
      "score": 1,
      "body": "good for the world, not for your portfolio",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lba9hg4/",
      "created": 1719928693,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbog7cf",
      "score": 1,
      "body": "Are there any etf that focus on this and or which companies do you look at for this I've been saying for years if they want clean energy nuclear is the way to go",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lbog7cf/",
      "created": 1720141015,
      "depth": 0,
      "replies": [
        {
          "id": "lcuvhaj",
          "score": 1,
          "body": "URA is what i'm looking at",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lcuvhaj/",
          "created": 1720801770,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "llul6j3",
      "score": 1,
      "body": "[https://www.alternateuniverse.io/p/invest-in-uranium](https://www.alternateuniverse.io/p/invest-in-uranium)",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/llul6j3/",
      "created": 1725653457,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loa384o",
      "score": 1,
      "body": "No need to guess which nuclear company will succeed just buy LEU, the company used for Haleu in the US. All the bigs use it, bill gates private new terraform uses them, they have new locked in long term deals, and it’s P/E is lower than 8, and is priced lower than the intrinsic value of the company currently.  It could easily hit $65 by the end of the year. A 45% gain and a great long term hold.",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/loa384o/",
      "created": 1726958736,
      "depth": 0,
      "replies": [
        {
          "id": "lok461c",
          "score": 1,
          "body": "Up 12% since this post!",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lok461c/",
          "created": 1727113504,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb6a6gm",
      "score": 1,
      "body": "I’ve got a large part of my portfolio invested in enCore energy.\nIt’s AI generated, but still.. here you go:\n\nenCore Energy Corp (EU) Stock Overview\nCompany Performance and Prospects:\nenCore Energy Corp is an emerging player in the uranium sector, positioning itself as a key contributor to America's clean energy transition. The company operates two uranium processing plants and has been actively involved in expanding its resource base through acquisitions and exploration efforts. Recent activities include providing updates on the South Texas Alta Mesa and Rosita in-situ recovery (ISR) uranium central processing plants​ (Simply Wall St)​​ (MarketBeat)​.\n\nStock Performance:\nThe stock has been subject to volatility, with a target price range of $6.00 to $7.50, suggesting a potential upside of 71.3% from its current levels. Analysts have given the stock a \"buy\" rating, indicating confidence in its future prospects​ (MarketBeat)​.\n\nFinancial Health:\nDespite its growth potential, enCore Energy has faced financial challenges. The company reported a net loss of $22.39 million, and its pretax margin stands at -66.56%. However, the company's current and quick ratios are relatively strong at 5.14 and 4.61, respectively, indicating good short-term liquidity​ (MarketBeat)​.\n\nExpansion and New Mines:\nenCore Energy is actively expanding its operations by opening new mines and enhancing its existing facilities. The company has been working on refurbishing its Rosita and Alta Mesa processing plants, and it has announced significant progress in its drilling programs at these sites. Additionally, enCore has received uranium production licenses for new projects, such as the Dewey Burdock project in South Dakota, further solidifying its position in the uranium market​ (Simply Wall St)​.\n\nInvestment Considerations in Uranium Energy\nMarket Potential:\nThe uranium market is gaining traction due to the growing emphasis on clean energy and the increasing recognition of nuclear power as a reliable and low-carbon energy source. This trend is expected to benefit companies like enCore Energy, which are well-positioned within the uranium production sector.\n\nRisks:\nInvesting in uranium stocks like enCore Energy comes with inherent risks. These include regulatory challenges, market volatility, and potential financial instability. enCore Energy has shown some signs of financial strain, and recent insider activities such as the sale of stock by key executives could be a red flag for potential investors​ (Simply Wall St)​.\n\nI expect this company to grow exponentially in the coming years",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb6a6gm/",
      "created": 1719862477,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb5xugg",
      "score": 1,
      "body": "I had this same question last week, but decided to not go for it. Since it is to new. And only bill gates has come forward with nuclear",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb5xugg/",
      "created": 1719858434,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb5bcs2",
      "score": -2,
      "body": "Too risky... if you compare the prices for solar and wind plants/parks with the cost and time that needs to be covered to build a nuclear plant (see UK), I would not invest for the long run. My money is on battery storage suppliers, especially ones that focus on long term storage and with alternative technologies besides Li-Io",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb5bcs2/",
      "created": 1719851166,
      "depth": 0,
      "replies": [
        {
          "id": "lb5famp",
          "score": 2,
          "body": "So Tesla? They re did a big part of the company’s roadmap last investors meeting. What’s ur thoughts?",
          "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb5famp/",
          "created": 1719852444,
          "depth": 1,
          "replies": [
            {
              "id": "lb5nadd",
              "score": -2,
              "body": " To my understanding they only have second live battery storage systems in their portfolio which use old e-car batteries, which are Li-Io and cannot be used for long term storage. There are several suppliers in the US and Europe which have solutions for long term storage, but lack the technology readiness level... yet. It is a gamble, but one I'm willing to take the risk for.",
              "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb5nadd/",
              "created": 1719855025,
              "depth": 2,
              "replies": [
                {
                  "id": "lb5t0ux",
                  "score": 1,
                  "body": "Tesla are one of the key manufacturers of grid scale batteries.\n\nAnd they don’t use second life car batteries no.\n\nhttps://www.tesla.com/blog/introducing-megapack-utility-scale-energy-storage",
                  "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb5t0ux/",
                  "created": 1719856859,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lb6ps2a",
      "score": 0,
      "body": "In the very long run, great idea for society, great idea for energy, too many moving pieces to figure out if you're going to make money investing in it though. There is a setup that I have went over in my mind where I see more nuclear power being built, clean energy, the problem is I've already died. I've already died of old age. I think there's likely to be a solid future in this industry, I just don't know how you handicapped the odds to actually make money investing in it",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb6ps2a/",
      "created": 1719867478,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb5d9fj",
      "score": -6,
      "body": "horrible investments......and are speculative at best .",
      "permalink": "/r/stocks/comments/1dswoba/thoughts_on_uranium_and_nuclear_energy_stocks/lb5d9fj/",
      "created": 1719851789,
      "depth": 0,
      "replies": []
    }
  ]
}