{
  "title": "$RL Ralph Lauren EZ Dip Buy Off Disastrous NKE Earnings",
  "score": 35,
  "selftext": "Hello Degens, I understand most of you buy your clothes from Supreme, Walmart, and Goodwill but I come to you with a fashion DD for a brand with strong momentum in an increasingly fraught segment of consumer discretionary luxury fashion. The stock market regularly fucks up on consumer trends that are staring them in the face because fund managers are old ass white dudes who could care less about what Zoomers are wearing. This market inefficiency is easily exploited if you just walk around college campuses and big cities and pay attention. This is why I've made racks off Abercrombie & Fitch and Crocs while Wall Street and you basement dwellers could only scratch your heads as to why Tik Tok Americans are buying this crap.\n\nI come to you with this next fashion trade: a quintessential American brand focused on old WASPy aesthetics and aspirational wealth made available to the average consumer. For a long time, RL was languishing as the only people buying their gaudy sportwear were software engineers and sysadmins who wear too much cologne. Finally, this brand has leaned into its classic and refined designs and is appealing to a new base of consumers who are conscious of fashion brands ripping them off with poor quality design and materials. Zoomers grow tired of their Shein hauls lasting 4-5 wears before falling apart and are now seeking quality. For this they turn to RL. [The Polo Bear](https://www.tiktok.com/@the_real_lin_shady/video/7337744810003975466?q=polo%20bear&t=1719855313784) and [American Flag](https://www.tiktok.com/@lindigoff/video/7247314494374890794?q=ralph%20lauren%20flag&t=1719855347065) sweaters have taken off in recent quarters, and their newly launched [Olympics merch](https://www.ralphlauren.com/women-clothing-sweaters/team-usa-graphic-cotton-sweater/0077505337.html?utm_source=CSE&utm_medium=GooglePLA__21396036850_&utm_source=CSE&utm_medium=GooglePLA__21396036850_&gad_source=1&gclid=CjwKCAjwp4m0BhBAEiwAsdc4aPScu0NhB1xCuOjCCJRfBT1kh_GxKqOrM3gELc3rwJ1dELvEbSYo9hoCZqMQAvD_BwE&gclsrc=aw.ds) will continue propelling the brand forward. Many have been wrong about this stock in the past, [including this guy who yolo'd earnings puts that expired OTM](https://www.reddit.com/r/wallstreetbets/comments/1c6nm1w/rl_ralph_lauren_10_bagger_20/), and I'm going to clear the confusion about this stock's recent momentum and place within larger fashion trends in America and worldwide.\n\n# Why 🌈🐻 Are Wrong\n\nFollowing Nike's disastrous earnings RL has continued a downward trend from ATH finding support at \\~$170. Many assume that RL trades in the same group as companies like NKE and LULU, these are all luxury fashion brands of course, but RL is positioned differently. Athleisure is dead. If you walk around big cities like New York, regardless of time of day, fewer women are wearing the full LULU yoga set. The market for athleisure is saturated and being disrupted by cheap brands like Alo and Shein. Another trend fund managers fail to understand is Return to Office Fashion. You have an entire generation of young women who have never had a real job - and if they did it was a remote internship during the scamdemic - now asking on Tik Tok: \"How do I dress for the office\"? [Ralph is a favorite brand](https://www.tiktok.com/@sx.ash/video/7324422099257347360?is_from_webapp=1&sender_device=pc&web_id=7340732515428959790) for these [office girlies](https://www.tiktok.com/@mrsinkeduk/video/7314567769750523168?q=Ralph%20Lauren%20office&t=1719855177692) still figuring out what they're to be wearing. NKE and LULU make fund managers think that the American consumer is faltering, but this is not the case. They are simply terrible at managing trends. Look at Nike's product offerings. The [Adidas Samba](https://www.google.com/url?sa=i&url=https%3A%2F%2Fwww.adidas.com%2Fus%2Fsamba-og-shoes%2FB75806.html&psig=AOvVaw0q5eapOvTD7lqAqoakYuB-&ust=1719941639846000&source=images&cd=vfe&opi=89978449&ved=0CBEQjRxqFwoTCOD42YSwhocDFQAAAAAdAAAAABAE) is the hottest sneaker right now for young men and women, coming off of the dominance of New Balance's suede casual sneakers. Nike makes only 1 or 2 sneakers ([Killshot](https://www.nike.com/t/killshot-2-womens-shoes-3z3Nnb/FZ5630-100) and Cortez) that have this classic casual, white leather look that consumers are looking for. Instead they focus only on athleisure and workout segments rather than fashion.\n\n# Consumer Trends\n\nIn fashion, all of these mid level mall brands are trying to reposition themselves as \"luxury\" for the simple reason that they can charge more for each garment. However, many are doing this wrong. They are selling the same plastic crap for higher prices with more marketing. This has not been working great for Zara, Uniqlo, H&M, and others. This has worked out very well for Abercrombie & Fitch, Wall Street's current fashion darling, A&F has pivoted to selling clothes that are on trend with minimal branding and a commitment to quality. [A $50 shirt from A&F](https://www.abercrombie.com/shop/us/p/long-sleeve-rugby-polo-53491348?seq=01&source=googleshopping&cmp=PLA:EVG:20:A:D:US:X:GGL:X:SHOP:X:X:X:X:x:A%26F+Adults_Google_Shopping_PLA_US_Tops_All+products_PRODUCT_GROUP&gad_source=1&gclid=CjwKCAjwp4m0BhBAEiwAsdc4aKoAbCRC5Ox_imUloA2HQ9JoIj4d8l92rJcS5INAYK3sD6vmshmrZxoCpo0QAvD_BwE&gclsrc=aw.ds) uses high quality cotton that you can feel will last while Uniqlo keeps trying to market its $50 polyester shirts as \"office tech wear\" or some crap. RL is uniquely positioned with its brand placement historically to offer high quality items for high prices, and the consumer knows these garments will last for years. In addition, these looks are \"classic Americana\" and won't go out of style as quickly as these [Shein microtrends](https://www.tiktok.com/@catyaps/video/7353318659533622570?q=microtrends&t=1719855637194). The consumer has more confidence buying an RL garment that they are getting their money's worth for a quality garment.\n\nI mentioned that walking around New York City you do not see athleisure, but you do see RL's biggest sellers everywhere. Gay guys love the Polo Bear: wearing it on sweaters and tshirts. Women love the American Flag sweater as an \"Old Money Fashion\" statement piece. I frequently see dupes from[ Shein or other Chinese crap](https://us.shein.com/American-Flag-Pattern-Drop-Shoulder-Sweater-p-21875906-cat-1734.html) companies of the American Flag sweater. This is probably bearish, but imitation is the highest form of flattery I guess? The trend is growing and has staying power if other companies want to swoop in.\n\nOff the backs of these trendy items, RL has recently launched its Olympics Team USA collection which incorporates many designs from the brand's classic Americana past. This is already generating [social media buzz](https://x.com/fetacheesepls/status/1807467583035089004), and as we approach the Olympics this will create brand momentum. The opening ceremony and the team's clothing will likely generate additional buzz. We are 25 days out from the Olympics, this should be a great window to build a short term trade with the stock currently at support.\n\n# Fundamentals\n\nFor a quick look at fundamentals, let's do a Peer comparison:\n\n|Ticker|PE|TEV/EBIDTA|Debt/EBITDA|Gross Margin PCT|\n|:-|:-|:-|:-|:-|\n|LULU|24.0|11.9|0.5|58.3%|\n|NKE|20.2|14.0|1.5|44.6%|\n|LEVI|53.6|8.2|2.0|58.0%|\n|ANF|22.2|8.1|0.9|64.1%|\n|**RL**|**18.0**|**7.2**|**1.6**|**66.8%**|\n\nAs we can see, RL is a leader among its peers in margin while trading at a discount relative to some of the biggest players in the space. RL carries some higher debt levels, but for a brand with this kind of momentum it is good to see them investing in current trends. This will pay off long term. If RL were trading at the median PE of its peer group the stock would see a 27% gain. If it were trading at median Price/Revenue we would see a 22% gain. My long term price target for RL is thus a 25% gain putting us at about $212/share.\n\nA quick look at the balance sheet. EPS is up 28% YoY with Revenue mostly flat at 2.9% increase YoY. Interestingly, the street estimates that 2025 Revenue will only increase 2.35%. I believe analysts are missing the trend and growing momentum behind RL. Increased sales volume will lead a surge in revenue growth, and assuming margin improvements persist you will see a much greater increase in EPS.\n\n# Technicals\n\nhttps://preview.redd.it/u2olfdnx3y9d1.png?width=1596&format=png&auto=webp&s=1f3ed3329f935ac14abfa193a34433eae15d15fb\n\nFor a quick look at technicals, RL's monster earnings in February broke them out of a long term channel and price has been volatile since. The earnings pump sold off only to pump on their earnings again in late May. The stock is finding support at a long term Fibonacci level around $170. Momentum looks shit right now, it is on the lower end of the bollinger bands and looking oversold on the stochastic. I'm looking to buy around the $170 Fibonacci and psychological support and will continue to buy down to $160.\n\n# Positions\n\n$15k in shares across various accounts, holding long term (majority in at $135, been holding since Dec 2023 and will continue to do so)\n\n$2k in 8/16 $180 calls for Olympics pump\n\n ",
  "link_flair_text": "DD",
  "id": "1dszc83",
  "num_comments": 41,
  "created_utc": 1719856372,
  "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/",
  "comments": [
    {
      "id": "lb5ri70",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 22 | **Previous Best DD** | \n**Account Age** | 2 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb5ri70/",
      "created": 1719856377,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb5rhjn",
      "score": 9,
      "body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
      "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb5rhjn/",
      "created": 1719856372,
      "depth": 0,
      "replies": [
        {
          "id": "lb5sj7z",
          "score": 12,
          "body": "https://preview.redd.it/5juwci8z4y9d1.png?width=1600&format=png&auto=webp&s=fbd39e662560d841885ccd9b7d56262a5703c215",
          "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb5sj7z/",
          "created": 1719856702,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb71c6f",
      "score": 14,
      "body": "Are young people actually buying Ralph Lauren clothes from Ralph Lauren? My gf and I wear a lot of it, but it is all thrifted.\n\n\nUnfortunately, their clothes are so timeless and high quality that you can find an abundance of it at Goodwill.",
      "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb71c6f/",
      "created": 1719871378,
      "depth": 0,
      "replies": [
        {
          "id": "lb7ltdd",
          "score": 2,
          "body": "Yes look at the earnings lmao",
          "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb7ltdd/",
          "created": 1719879172,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb5ryu8",
      "score": 10,
      "body": "this is so bad i wont even inverse",
      "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb5ryu8/",
      "created": 1719856522,
      "depth": 0,
      "replies": [
        {
          "id": "lb72ejv",
          "score": 2,
          "body": "I’m new to this and I don’t want to be annoying but can you explain why?",
          "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb72ejv/",
          "created": 1719871770,
          "depth": 1,
          "replies": [
            {
              "id": "lb7lv6d",
              "score": 6,
              "body": "He thinks I’m gay (real)",
              "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb7lv6d/",
              "created": 1719879191,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lb8vcnx",
      "score": 5,
      "body": "In Copenhagen now. You are absolutely right about those American sweaters. Women love those. However this is a stock you hold shares in. This is WSB where people are looking to pump and dump",
      "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb8vcnx/",
      "created": 1719899818,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb7maf2",
      "score": 8,
      "body": "Love how I can post an 800 word DD and get 7 upvotes while “idk i been to chipotle and the portions are big now so buy puts” gets 200 upvotes lmao I hate this shit",
      "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb7maf2/",
      "created": 1719879356,
      "depth": 0,
      "replies": [
        {
          "id": "lblb85t",
          "score": 2,
          "body": "People just wanna talk shit more than anything else most of the time, you came with logic not bullshit to stir the pot. You want clicks, entertain the dipshits",
          "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lblb85t/",
          "created": 1720098225,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb5w13v",
      "score": 1,
      "body": "she looks like shit at the end, calls is the play",
      "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb5w13v/",
      "created": 1719857839,
      "depth": 0,
      "replies": [
        {
          "id": "lb7mv0j",
          "score": 1,
          "body": "The title is “buy the dip” short term momo is gonna be shit",
          "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb7mv0j/",
          "created": 1719879582,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb6rmwc",
      "score": 1,
      "body": "You seems to know what you are talking about in fashion stock so I have one question: Why is Guess stock so down ?",
      "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb6rmwc/",
      "created": 1719868098,
      "depth": 0,
      "replies": [
        {
          "id": "lb7mg9x",
          "score": 3,
          "body": "I ain’t heard of guess since the 90s lol",
          "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb7mg9x/",
          "created": 1719879420,
          "depth": 1,
          "replies": [
            {
              "id": "lb7ssrq",
              "score": 2,
              "body": "Oh shit, I didn’t even know guess had a stock. I’m jumping on the put train",
              "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb7ssrq/",
              "created": 1719881960,
              "depth": 2,
              "replies": [
                {
                  "id": "lb93mf5",
                  "score": 2,
                  "body": "You jinxed it. Selling my puts first thing tomorrow",
                  "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb93mf5/",
                  "created": 1719905259,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lb7noaw",
          "score": 1,
          "body": "I actually sold my puts today was in at the 21 and 20 strike.. the volume is insanely low this past week and half. They just got demoted from the Russell 3000. Earnings are expected to be lower than guidance.. however everyone has a price target or 24 - 37… I kind think it’s at its bottom and if they come in beating earnings this could fly back to 24",
          "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb7noaw/",
          "created": 1719879905,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb8b8jq",
      "score": 1,
      "body": "Might want to throw Aritzia in there.  Went long on that crap after their shite quarter last year, I'm happy.",
      "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb8b8jq/",
      "created": 1719889360,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbb67un",
      "score": 1,
      "body": "Athleisure is dead? Crazy claim to make lol",
      "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lbb67un/",
      "created": 1719939671,
      "depth": 0,
      "replies": [
        {
          "id": "lbb9ypm",
          "score": 3,
          "body": "Dead/dying yes. As you are a gamer you might not be realizing it.",
          "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lbb9ypm/",
          "created": 1719940876,
          "depth": 1,
          "replies": [
            {
              "id": "lbbayug",
              "score": 1,
              "body": "Dead is different than dying lol\n\nLike many waves, it may be on the decline, but it has become a staple for at home usage. I doubt we will see the end of the trend until the international appeal goes away.",
              "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lbbayug/",
              "created": 1719941199,
              "depth": 2,
              "replies": [
                {
                  "id": "lbbdb2u",
                  "score": 1,
                  "body": "Right but if people just buy athleisure to stay home in, take the trash out, or go to the gym that obviously shrinks the market as it becomes unstylish to wear a sports bra to a restaurant. \n\nThere is a lot going on with shifts in silhouette and fast fashion exhaustion that is leading consumers more to Abercrombie than Lululemon. You can see it in the financial reports. Abercrombie notably does not sell athleisure.",
                  "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lbbdb2u/",
                  "created": 1719941949,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbbhfoc",
                      "score": 1,
                      "body": "I guess my point is that 6 months ago athleisure was pricing in overhype as you have said, but by now its down at a more sustainable price point for the actual level of growth we're talking about.",
                      "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lbbhfoc/",
                      "created": 1719943264,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lb7tme4",
      "score": 1,
      "body": "I was at the Orlando outlet malls today and the malls in general were packed.  Very few parking spots.  Ralph Lauren was empty.",
      "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb7tme4/",
      "created": 1719882287,
      "depth": 0,
      "replies": [
        {
          "id": "lb8vmzp",
          "score": 1,
          "body": "Known fashion hotspot Orlando Florida\n\nFor my own anecdote I was at Woodbury Commons Outlet Mall in NY state around the holidays and RL was packed. They were sold out of everything that had an American Flag or Bear on it. Into early spring Ralph’s coffee at the flagship New York location has had a line around the block and gone viral on Tik Tok as a foodie destination for some reason. Store traffic is not a problem as evidenced by the last two quarters of growth. The trend is not over and has momentum.",
          "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb8vmzp/",
          "created": 1719899994,
          "depth": 1,
          "replies": [
            {
              "id": "lb9snxv",
              "score": 1,
              "body": "Oh, sorry.  I didn’t know we were talking about fashion.  I thought we were talking about Ralph Lauren, my grandparents’ favorite shirts. 😂",
              "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb9snxv/",
              "created": 1719921581,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lb8y6bq",
      "score": 1,
      "body": "Why are you grouping NKE and LULU to make your point on RL? NKE is not growing and forecasting declining revenues, they are also talking about weak China. LULU is growing, forecasting double digit growth and expecting their China branch to continue to outperform. Your thesis is shit if you can’t even get these fundamental details right. Just because both share prices are down doesn’t mean the underlying businesses are the same.",
      "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb8y6bq/",
      "created": 1719901599,
      "depth": 0,
      "replies": [
        {
          "id": "louuocj",
          "score": 1,
          "body": "wow im goated",
          "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/louuocj/",
          "created": 1727273095,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb8yva2",
          "score": 0,
          "body": "Lulu is not growing - at least not as much as the market expected - and the athleisure trend is dying that’s why the stock is down. Simple as",
          "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb8yva2/",
          "created": 1719902046,
          "depth": 1,
          "replies": [
            {
              "id": "lb8z963",
              "score": 2,
              "body": "And both statements are bullshit and not backed by any numbers from their past reports or their future guidance. It’s just talking out your ass. Show me any proof that LULU is not growing. And I will take back my statement and apologise for talking bullshit.\n\nEdit: Poster above edited his statement, and added „at least(…)“ after realising that it’s bullshit.",
              "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb8z963/",
              "created": 1719902298,
              "depth": 2,
              "replies": [
                {
                  "id": "lb8zl7r",
                  "score": 0,
                  "body": "lol learn how the market works. LULU was trading at a high valuation because investors expected extremely high growth. Their most recent earnings they came below EPS and revenue growth estimates so the stock fell. There is less demand for athleisure as the trend is not as popular as it once was and Lulu’s moat is being eaten by cheap Chinese competitors. This is to say nothing of the C-Suite drama at the company.\n\nYou are too late to a trend that no longer has momentum. Keep coping.",
                  "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb8zl7r/",
                  "created": 1719902518,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lb90dwx",
                      "score": 3,
                      "body": "„LULU is not growing“ that was your statement, still haven’t provided any proof for that. Just opinions and share price speculation. No facts or numbers. Also it’s not correct that they came below earnings estimates. Earnings was a beat, guidance fell short, not the actual numbers. And still guidance forecasting growth. You haven’t provided any single evidence for your statement, that they are not growing. It’s just opinions and bullshit.",
                      "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb90dwx/",
                      "created": 1719903048,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lb90lvl",
                          "score": 1,
                          "body": "Im up 18% ytd and you’re down 40, all I need bossman lol",
                          "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb90lvl/",
                          "created": 1719903197,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lb915ta",
                              "score": 3,
                              "body": "That’s also Bullshit and opinion. Not actual fact. You are assuming I bought the top, and that it’s my only position. That’s your thing right? Talking bullshit out of your ass without any factual evidence. LULU has 16 consecutive quarters of growth and is projecting further growth, and here your are „LULU isn’t growing“. And now that it’s more than clear that you have no competence and knowledge about anything you are talking, you switch to different topics, with a ridiculous attempt to compare YTD returns.",
                              "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb915ta/",
                              "created": 1719903565,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lb918hs",
                                  "score": 2,
                                  "body": "https://preview.redd.it/qnasapjg02ad1.jpeg?width=800&format=pjpg&auto=webp&s=1f6ad076aee2b5bd38016a8d9fead8852179e2d6",
                                  "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb918hs/",
                                  "created": 1719903613,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lb65op3",
      "score": -4,
      "body": "Positions or ban",
      "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb65op3/",
      "created": 1719860987,
      "depth": 0,
      "replies": [
        {
          "id": "lb7lx5i",
          "score": 2,
          "body": "These AIs cant even read anymore smh",
          "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lb7lx5i/",
          "created": 1719879213,
          "depth": 1,
          "replies": [
            {
              "id": "lbaduhw",
              "score": 1,
              "body": "👍🏼 🤡",
              "permalink": "/r/wallstreetbets/comments/1dszc83/rl_ralph_lauren_ez_dip_buy_off_disastrous_nke/lbaduhw/",
              "created": 1719930276,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}