{
  "title": "Paramount hunts for a streaming partner, could kick off a wave of deals ",
  "score": 76,
  "selftext": "Paramount Global is holding talks with other entertainment companies about merging its Paramount+ streaming service with an existing platform. If it reaches a deal, it may kick off a new wave of streaming partnerships that could put the entire media industry on firmer footing.\n\nParamount Global leadership is having active discussions with other media and tech company executives to determine if a structure makes sense for both parties where Paramount+ can be merged with another streaming entity and potentially co-owned, according to people familiar with the matter, who asked not to be named because the discussions are private.\n\nOne of the companies that has expressed a desire to reach a deal is Warner Bros. Discovery, according to people familiar with the matter. Combining Max and Paramount+ could strengthen both services by allowing them to better compete with Netflix and Disney’s suite of platforms (Disney+, Hulu and ESPN) for eyeballs and future content.\n\nWarner Bros. Discovery held preliminary merger talks for a deal for all of Paramount Global earlier this year, but talks didn’t escalate.\n\nParamount Global is also considering partnering with a technology platform, the company’s co-CEO Chris McCarthy said at an employee town hall on June 25.\n\n“What they don’t have is our scale of content, and together we will make for a very powerful combination to drive more minutes and greater profits,” McCarthy said of a potential tech partner at the town hall, according to a transcript of the event obtained by CNBC.\n\nA merged streaming service would mitigate churn by giving customers more diverse programming and fewer reasons to cancel each month, and it could take Paramount+ losses off Paramount Global’s balance sheet by giving it new ownership.\n\nWhile a structure for a hypothetical joint venture with Warner Bros. Discovery hasn’t been discussed in detail, ownership likely wouldn’t be a 50-50 split given the existing natures of the streaming assets and their finances, according to people familiar with the discussions.\n\nWarner Bros. Discovery’s direct-to-consumer business made $103 million in annual adjusted EBITDA in 2023 after losing $2.1 billion the year before. Paramount Global reported a loss of $1.67 billion in direct-to-consumer operating income before depreciation and amortization in 2023, narrower than its $1.8 billion loss a year prior.\n\nMax has about 100 million global subscribers, with 52.7 million based in the U.S. Paramount+ ended its first quarter with 71 million subscribers.\n\nComcast’s NBCUniversal has also expressed interest in a joint venture with Paramount+, as The Wall Street Journal first reported earlier this year. The talks didn’t progress and never got particularly far, according to people familiar with the matter.\n\n“The sheer volume of hit content that we could offer together would be tremendous across TV, film and sports, and would attract millions of viewers,” McCarthy said during the town hall in reference to a potential partnership with an existing subscription streaming service like Max or Peacock. “Plus, we would share in all other non-content expenses.”  \n\nSpokespeople for Warner Bros. Discovery, NBCUniversal and Paramount Global declined to comment.\n\nStreaming 2.0\n\nSince late 2019, traditional media companies including Paramount Global, Disney, NBCUniversal and Warner Bros. Discovery have all launched streaming services that have hemorrhaged billions of dollars in losses.\n\nThere’s long been consensus in the industry that there are too many streaming services relative to the number of total paying customers. Many executives have speculated that just four or five global services can likely survive and flourish. The others would need to be consolidated or folded into existing platforms.\n\n“There may be some combination of Paramount, Peacock and Max,” said Peter Chernin, former CEO and chairman of Fox Group, in an interview with CNBC last year.\n\nIf Paramount reaches an agreement on a joint venture with either Max or Peacock, there would be added pressure on whichever service is left out to do a deal of its own.\n\nMedia companies are now focused on better monetizing streaming content through bundles and partnerships. Disney and Warner Bros. Discovery have recently become more willing to license some of their content to rival streaming services, such as Netflix, to better monetize shows that aren’t adding a lot of new subscribers to their streaming services.\n\nComcast recently introduced a bundle of Peacock, Netflix and Apple TV+ for its cable, broadband and mobile customers for $15 a month.\n\nDisney and Warner Bros. Discovery announced they plan to bundle their streaming services beginning in the summer. While the companies haven’t yet announced a price for the package, which will include Disney+, Hulu and Max, the discount will be “significant,” according to one of the people familiar with the matter.\n\nBetter windowing\n\nAnother hot topic of current discussions revolve around windowing movies and TV series through different streaming services at different price points.\n\nThis idea was something considered by Skydance Media, which nearly acquired Paramount Global before talks broke down last month.\n\nSkydance’s plan for Paramount included merging Paramount+ with another streamer to create new streaming services which would better rationalize the assets, according to people familiar with the matter.\n\nFor example, Paramount’s Showtime library could be combined with another company’s prestige dramas to create a stand-alone ad-free service.\n\nA different ad-supported service could then contain live sports and windowed prestige originals, which could appear on the second service after a certain amount of time. The services could be bundled together, such as how Disney bundles Disney+, Hulu and ESPN+.\n\nA representative for Skydance declined to comment.\n\nOne app experience\n\nThere’s a widespread shared sentiment among traditional media leadership that better packaging of existing content can be more lucrative for the entire industry.\n\nThe downside to more bundling or windowing of content is customer confusion. Increased mix-and-match offers between streaming services can easily lead to customer frustration rather than satisfaction.\n\nSeveral media executives said privately they expect Peacock, Paramount+, Max and Disney could ultimately team up their programming within one application to alleviate confusion and compete with Netflix, which dominates the subscription streaming industry with about 270 million global subscribers.\n\nTwo executives said Disney would be the most likely company to own the application, given its relative dominant position in the entertainment streaming industry. Any media company who contributed content to the streaming application could share in the revenue, similar to how cable economics work today, they added.\n\nStill, company rivalries and tensions may make such a product difficult to put together. While Max and Disney have struck a bundling deal, Comcast and Disney have long had a strained relationship. The two parties are currently trying to unwind a joint venture — Hulu — to give Disney full control over the service that was initially co-owned by NBCUniversal, Fox and Disney.\n\nSource: https://www.cnbc.com/2024/07/01/paramount-streaming-merger-talks.html",
  "link_flair_text": null,
  "id": "1dtbq74",
  "num_comments": 27,
  "created_utc": 1719889532,
  "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/",
  "comments": [
    {
      "id": "lb9iefq",
      "score": 32,
      "body": "Should have done this a few years ago. Would have saved all that capex creating PARA's own streaming service and made their partner a lot more successful too.",
      "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lb9iefq/",
      "created": 1719915843,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbacypj",
      "score": 19,
      "body": "Paramount canceled the workaholics movie 2 weeks before they were due to start shooting it. Paramount is super loose butthole.",
      "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lbacypj/",
      "created": 1719929962,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb8ikdm",
      "score": 7,
      "body": "\"Paramount Global leadership is having active discussions with other media and tech company executives to determine ~~if a structure makes sense~~  new ways to screw Paramount shareholders and drive the stock into the ground.\"",
      "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lb8ikdm/",
      "created": 1719892727,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb8lv65",
      "score": 13,
      "body": "Para+ = champions league. It’s a must have for me and family.",
      "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lb8lv65/",
      "created": 1719894417,
      "depth": 0,
      "replies": [
        {
          "id": "lb9kdxp",
          "score": 1,
          "body": "Lol, I thought I was the only one. It’s the sole reason I signed up",
          "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lb9kdxp/",
          "created": 1719917090,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lba5u1q",
      "score": 2,
      "body": "Just license it",
      "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lba5u1q/",
      "created": 1719927306,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbd5yyu",
      "score": 2,
      "body": "Honestly shocked this many people subscribe to Paramount+",
      "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lbd5yyu/",
      "created": 1719963840,
      "depth": 0,
      "replies": [
        {
          "id": "lbgka2l",
          "score": 1,
          "body": "Get it free with Walmart+, which I get free from an Amex card.",
          "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lbgka2l/",
          "created": 1720022360,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbfg158",
          "score": 0,
          "body": "Better than peacock",
          "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lbfg158/",
          "created": 1720007227,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb8lzxy",
      "score": 2,
      "body": "Didnt ever bother with these stocks idk why but now im thinking about them",
      "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lb8lzxy/",
      "created": 1719894489,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb8odnk",
      "score": 4,
      "body": "Wondering what this deal would look like, kinda a Hulu deal? Maybe a 70:30 split, leading to WBD eventually buying paramounts stake out? Either way consolidation seems bullish for those that are surviving, like it for WBD increasing their catalog.",
      "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lb8odnk/",
      "created": 1719895770,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbe9dcu",
      "score": 1,
      "body": "whoever bought calls yesterday will be deep green tomorrow lmao",
      "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lbe9dcu/",
      "created": 1719980432,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb8ggj4",
      "score": -29,
      "body": "Does anyone actually watch any of these streaming platforms other than Netflix and Disney+?",
      "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lb8ggj4/",
      "created": 1719891713,
      "depth": 0,
      "replies": [
        {
          "id": "lb8hicl",
          "score": 35,
          "body": "Yes? Max has 100 million subscribers and P+ has 71 million. Says so right there in the post. Max has more subscribers in the US than Disney+ does. ",
          "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lb8hicl/",
          "created": 1719892212,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb8kqk8",
          "score": 14,
          "body": "I have just about all of them and watch Max the most.",
          "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lb8kqk8/",
          "created": 1719893826,
          "depth": 1,
          "replies": [
            {
              "id": "lb91he9",
              "score": 4,
              "body": "Same",
              "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lb91he9/",
              "created": 1719903782,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lb8ku1o",
          "score": 3,
          "body": "I also watch Paramount +",
          "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lb8ku1o/",
          "created": 1719893877,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb8o5xd",
          "score": 2,
          "body": "I watch movies on Max all the time and I loved Last of Us",
          "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lb8o5xd/",
          "created": 1719895653,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb9x1qg",
          "score": 2,
          "body": "Yes, Max is very popular as others have said. Max and Netflix are the only ones I keep year around. Others, such as paramount and apple, I shsbricbe for specific shows and then cancel ",
          "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lb9x1qg/",
          "created": 1719923659,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb8hjjg",
          "score": 1,
          "body": "Yes.",
          "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lb8hjjg/",
          "created": 1719892227,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb9xt81",
          "score": 1,
          "body": "Peacock has a good collection of auto racing",
          "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lb9xt81/",
          "created": 1719924000,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbab82c",
          "score": 1,
          "body": "I still have Dinsey+ but haven't watched it in a year.\n\nNetflix is actually the last place I check for something to watch -- their catalogue of grade B and foreign movies (that they cynically call \"Netflix Originals\") is just not my cup of tea.",
          "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lbab82c/",
          "created": 1719929335,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lban4q8",
          "score": 1,
          "body": "A lot of people get free Paramount Plus accounts with Walmart plus, so they have a decent number of accounts but not sure if people actually watch it. \n\nAmex gives free Walmart plus too with their credit cards, so that's gets you free P+ too",
          "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lban4q8/",
          "created": 1719933448,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbd6do4",
          "score": 1,
          "body": "I find Max to have much more compelling content than Disney+ so yes",
          "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lbd6do4/",
          "created": 1719964001,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb8na4r",
          "score": 1,
          "body": "Paramount+ and Peacock are must have for me…\n\nI’ve never used Disney+ and haven’t opened Netflix in years",
          "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lb8na4r/",
          "created": 1719895176,
          "depth": 1,
          "replies": [
            {
              "id": "lb8nibn",
              "score": 6,
              "body": "Complete opposite for me, never use anything other than YouTube or Netflix. We get Disney for free but don’t really watch it other than the kids.\n\nNot sure about others but I recently went to a hotel with over 100 different programming and I was exhausted, this is what it must feel like to watch these streaming providers, lots of low quality sub par content.",
              "permalink": "/r/stocks/comments/1dtbq74/paramount_hunts_for_a_streaming_partner_could/lb8nibn/",
              "created": 1719895299,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}