{
  "title": "Salesforce shareholders reject compensation plan for CEO Marc Benioff, top execs ",
  "score": 408,
  "selftext": "Salesforce investors voted against the company’s compensation plan for top executives, after shareholder advisory groups raised concerns about equity awards granted to CEO Marc Benioff.\n\nAccording to a regulatory filing on Monday, the resolution to approve the compensation received 339.3 million votes in favor and 404.8 million against at the annual meeting held on Thursday.\n\nThe board had urged shareholders to vote in favor of the resolution. But two shareholder advisory firms, Glass Lewis and Institutional Shareholder Services, both recommended that investors vote down the measure.\n\nFor the 2024 fiscal year, Benioff received $39.6 million in total pay, up from $29.9 million in the prior year. While Benioff’s salary was flat at $1.55 million, he received additional stock and option awards and nonequity incentive plan compensation, according to the proxy statement. The most recent sum also included security fees that had not previously been invoiced to the company.\n\nIn January, the board’s compensation committee gave Benioff a second long-term equity award worth $20 million, in recognition of the company’s “successful transformation actions and strong financial performance in the fiscal year,” among other factors.\n\nGlass Lewis wrote in its recommendation that “shareholders may reasonably be wary of the substantial discretionary equity grants” issued to Benioff in January, adding that there was a “lack of a fully convincing rationale” behind the grants.\n\nBenioff was already among the largest holders of Salesforce, with a stake of over 2% valued at close to $6 billion. Glass Lewis said in its proxy paper that the additional performance-based restricted stock units and stock options were “unwarranted” because his interests were already aligned with that of shareholders.\n\nThe vote from the annual meeting is nonbinding.\n\n“Our Compensation Committee, which is responsible for designing and administering our executive compensation program, values the opinions expressed by our stockholders and will consider the outcome of this vote when making future executive compensation decisions,” Salesforce’s board said in the company’s proxy statement.\n\nThe company declined to comment.\n\nSalesforce shares rose 67% in the 2024 fiscal year ended Jan. 31, the strongest performance since 2011.\n\nNet income jumped to $4.1 billion in the fiscal year from $208 million a year earlier, while revenue increased 11% to $34.9 billion from $31.4 billion. In January 2023, Salesforce announced plans to lay off 10% of employees, after activist investors began buying up stakes and demanding a better mix of profit and growth. Salesforce said in February it would begin paying a dividend to shareholders.\n\nSalesforce shares are off 2.6% year to date.\n\nSource: https://www.cnbc.com/2024/07/01/salesforce-shareholders-vote-against-compensation-for-top-executives.html",
  "link_flair_text": null,
  "id": "1dtbnef",
  "num_comments": 54,
  "created_utc": 1719889281,
  "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/",
  "comments": [
    {
      "id": "lb904j6",
      "score": 199,
      "body": "I think with 6 billion in existing shares, yeah, his interests are already aligned and he doesn't need another $20m to make or break that.\n\nHe can make significantly more wealth simply by making Salesforce go up another 10%.",
      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lb904j6/",
      "created": 1719902876,
      "depth": 0,
      "replies": [
        {
          "id": "lba3d0a",
          "score": 72,
          "body": "Tell that to tesla shareholders",
          "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lba3d0a/",
          "created": 1719926329,
          "depth": 1,
          "replies": [
            {
              "id": "lbb36b2",
              "score": 19,
              "body": "The offer is that Marc gets no money until he 10x the company? \n\nSalesforce investors will take that offer up.",
              "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbb36b2/",
              "created": 1719938696,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lban71s",
              "score": 16,
              "body": "Salesforce would probably be fine granting generous compensation if he 10xes the stock.",
              "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lban71s/",
              "created": 1719933470,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lbxyc1a",
              "score": 1,
              "body": "Me being Tesla shareholder voted against executive compensation",
              "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbxyc1a/",
              "created": 1720297157,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lbae41j",
          "score": 15,
          "body": ">He can make significantly more wealth simply by making Salesforce go up another 10%\n\nJeeze, you’d think other CEOs would push the “Increase valuation by 10%” button more often….",
          "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbae41j/",
          "created": 1719930370,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbcprmx",
          "score": -8,
          "body": "Why the hell is this getting upvoted on stocks subreddit? If people don't need to get compensation anymore just because they already have a lot of stock, why would any hundred-millionaire/billionaire need to be paid at all? Just because you earned shares in the past, doesn't mean you should be working for free.\n\nIf you're not willing to compensate him, why wouldn't he just start a new company and let someone run this business instead? How is that in the shareholders' favour?",
          "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbcprmx/",
          "created": 1719957767,
          "depth": 1,
          "replies": [
            {
              "id": "lbd2ulf",
              "score": 11,
              "body": "He makes 1.55 million in salary, we must have a very different definition of “working for free”",
              "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbd2ulf/",
              "created": 1719962638,
              "depth": 2,
              "replies": [
                {
                  "id": "lbfpdhv",
                  "score": 0,
                  "body": "The person I responded to was arguing that his current ownership should be enough incentive to keep working at the company.\n\nSo the problem is not the compensation. It's the salary.",
                  "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbfpdhv/",
                  "created": 1720011448,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbfqp31",
                      "score": 3,
                      "body": "Yes, he shouldn’t need additional stock compensation. He makes 1.55m a year, and owns 6 billion in shares. That’s precisely what they said, so I still don’t know how you think that’s working for free?",
                      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbfqp31/",
                      "created": 1720011991,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lbg8tmk",
                          "score": 0,
                          "body": "The argument made was \"he owns X% of the company, so he shouldn't need additional incentive to work\", not \"he owns X% **and earns Y in salary**\". If it was the latter, I would agree with you.",
                          "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbg8tmk/",
                          "created": 1720018592,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lbg9jpp",
                              "score": 3,
                              "body": "Precisely why context is king. The major reason for stock comp is to align interests of executives with that of the company and its shareholders. If he already owns 6bil of shares, his interest are already aligned and his salary is sufficient compensation. That was the argument being made, sorry you need each part of a debate clearly outlined for you",
                              "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbg9jpp/",
                              "created": 1720018837,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lbi3vcd",
                                  "score": 0,
                                  "body": "I'd argue the opposite. Aligned are not black and white. The more you align incentives with the shareholders, the better. He should earn $0 in salary (he already has enough money to live comfortably forever), but he should get a massive stock comp package if the stock does well.",
                                  "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbi3vcd/",
                                  "created": 1720040714,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lbj1rpp",
                                      "score": 1,
                                      "body": "I’m not against the concept, but aligned is fairly black and white when we’re talking 6 billion of value. Realistically what is the difference from benioffs perspective of 6b vs 7b? It’s not wealth he would use in his lifetime, so what is the incremental benefit of additional shares? At that point just pay salary to cover yearly expenses and existing stock covers everything else lol",
                                      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbj1rpp/",
                                      "created": 1720053762,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lbmj4b9",
                                          "score": 1,
                                          "body": "We're on a stocks reddit, so I assume you understand that no business person with over a 100M in wealth is looking to get richer. They're looking to increase their wealth so they either have more means to build businesses to improve the world, or gather influence, or a combination thereof.\n\nYou can build a pretty great business for $1B.",
                                          "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbmj4b9/",
                                          "created": 1720114380,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lbfqvym",
                      "score": 0,
                      "body": "Think you might just have a problem understanding how comments and context go hand in hand lol",
                      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbfqvym/",
                      "created": 1720012068,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lb8ja4q",
      "score": 97,
      "body": "They voted nohana",
      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lb8ja4q/",
      "created": 1719893083,
      "depth": 0,
      "replies": [
        {
          "id": "lbbfl65",
          "score": 5,
          "body": "I’m doing my part!",
          "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbbfl65/",
          "created": 1719942677,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb910ph",
      "score": 120,
      "body": "As someone who has had the unfortunate experience of using Salesforce, I question why he gets paid at all.",
      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lb910ph/",
      "created": 1719903470,
      "depth": 0,
      "replies": [
        {
          "id": "lb9lm6o",
          "score": 9,
          "body": "What is the issue with their product?",
          "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lb9lm6o/",
          "created": 1719917827,
          "depth": 1,
          "replies": [
            {
              "id": "lb9mxky",
              "score": 45,
              "body": "They pretend to be a \"custom and flexible solution to your customer management\", but in reality, they are an expensive and not particularly good solution, which costs an enormous amount of money to modify as your business requirements change. Only finance people and sales people think it's a good product. So they convince the boards that it's a good solution, and as soon as something changes they end up spending 10 times the money on contractors to completely rebuild everything.",
              "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lb9mxky/",
              "created": 1719918586,
              "depth": 2,
              "replies": [
                {
                  "id": "lb9sbr0",
                  "score": 68,
                  "body": "> Only finance people and sales people think it's a good product.  \n\nThese are the primary people who use it.",
                  "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lb9sbr0/",
                  "created": 1719921414,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lb9obfd",
                  "score": 12,
                  "body": "Totally not true. I know many people in operations of all kind that like using salesforce. It’s much better than the alternatives like dynamics or zendesk when built correctly",
                  "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lb9obfd/",
                  "created": 1719919347,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lb9pdb4",
                  "score": 23,
                  "body": "If that was true then 99% of the F500 wouldn’t be using the product.",
                  "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lb9pdb4/",
                  "created": 1719919909,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lb9prub",
                      "score": 27,
                      "body": "That could have been a description for half the software F500 uses. It's all a pain in the ass to swap over to new business processes at that scale though, it's not unique to Salesforce.",
                      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lb9prub/",
                      "created": 1719920121,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lbafa87",
                          "score": 11,
                          "body": "I say this all the time with Microsoft. Slack is objectively a better messaging/collab partner than Teams. Every startup I've seen uses it, but more legacy like companies that adopted Microsoft products will likely never swap out because it's a major pain.",
                          "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbafa87/",
                          "created": 1719930782,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lbb86h5",
                              "score": 10,
                              "body": "If you have the O365 suite of products it literally makes no sense to have anything else but Teams.",
                              "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbb86h5/",
                              "created": 1719940300,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lbbbzxo",
                                  "score": 3,
                                  "body": "What I'm saying is most startups don't use O365 suite. I see many with Google suite + Slack messaging. Google sheets/docs is easier to use than Excel for companies with a modern tech stack.",
                                  "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbbbzxo/",
                                  "created": 1719941528,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lbbcls4",
                                      "score": 3,
                                      "body": "Got you. I work at an MSP with 300+ clients and would actually agree with your assessment on startups/smaller businesses using Google stack. They all switch eventually though. \n\nBut take it with a grain of salt because I’m not sure how much of that has to do with our organization pushing O365. But we essentially have a 100% success rate in transitioning them.",
                                      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbbcls4/",
                                      "created": 1719941724,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lbarw7v",
                          "score": 9,
                          "body": "I was involved with quoting an SAP migration to S/4 Hana for Shell oil some years ago. We quoted them 1.1 billion dollars and a 10 year time line.",
                          "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbarw7v/",
                          "created": 1719935025,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lbc1uds",
                              "score": 1,
                              "body": "lol",
                              "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbc1uds/",
                              "created": 1719949877,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lbdrx8t",
                      "score": 3,
                      "body": "When it comes to Enterprise software, there’s software that people hate and there’s software that people don’t buy",
                      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbdrx8t/",
                      "created": 1719972578,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lbb5sk8",
                      "score": 1,
                      "body": "Eh. A lot of companies used same time and no one is saying that was good",
                      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbb5sk8/",
                      "created": 1719939535,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lbdxp9t",
                      "score": 1,
                      "body": "I worked at one of the largest insurance companies in the nation who had plenty of money and Salesforce was dog shit. I’m so glad I don’t have to use it anymore.",
                      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbdxp9t/",
                      "created": 1719974988,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lbem2k7",
                      "score": 1,
                      "body": "lmao 😂💀",
                      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbem2k7/",
                      "created": 1719987682,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lb9unig",
                      "score": 1,
                      "body": "It’s true. They have aggressive sales tactics and once an executive has converted their company their career depends on other executives not realizing how bad of an idea it was. So they do whatever they need to to cover it up",
                      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lb9unig/",
                      "created": 1719922551,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lbdpg2r",
                  "score": 2,
                  "body": "I've never met a sales person who enjoys their product",
                  "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbdpg2r/",
                  "created": 1719971576,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lbkhmed",
                  "score": 2,
                  "body": "Do we work for the same company? Sounds exactly like my experience.\n\nI’m in a tech role but support global ops teams and as a result, do need to interact with SF frequently. Commercial teams drove the switch from another similar product (which everyone seemed to like) to SF. It’s clunky and missing essential features that we have to seemingly move the earth for in order to implement.\n\nEinstein “AI” also tarnishing the good professor’s name. Cases often don’t hit the right queues or are incorrectly classified. \n\nI don’t look at it and think, the company behind this must be valued at a quarter of a trillion dollars…",
                  "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbkhmed/",
                  "created": 1720080493,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lbb6dul",
                  "score": 1,
                  "body": "This is the most vague answer lol",
                  "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbb6dul/",
                  "created": 1719939723,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lb9rq9k",
                  "score": 1,
                  "body": "Lmao that's exactly what I've lived in my current company that switched to Salesforce",
                  "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lb9rq9k/",
                  "created": 1719921117,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lbb5ye0",
          "score": 15,
          "body": "This is entirely dependent on how well a company implements it, just like any SaaS product. Just because you worked for companies that did a shit job of implementing doesn’t mean it’s a shit product.\n\nSalesforce is the most advanced CRM, and it’s not even close. Dynamics is at least 5 years behind in features and functionality, Zendesk is a decent service desk option but scales horribly for enterprises, and the rest aren’t even considered by fortune 500s (other than dinosaurs still using Oracle).\n\nIn general, Salesforce is wildly misunderstood by non-technical senior leaders, which is why it quickly gets out of control and leads to negative impressions. Obviously Salesforce is partially at fault for this considering their marketing efforts make it seem like anyone can implement it, but they care more about their sales numbers than end user impressions.\n\nThe other reason why people sometimes hate is that it means they actually have to follow processes and record data correctly instead of using some janky google sheets solution. I’ve seen it all over the years and I can tell you that while Salesforce isn’t perfect, it is an insanely capable product that enables massive companies to run its business.",
          "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbb5ye0/",
          "created": 1719939586,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbc2son",
          "score": -1,
          "body": "Agreed. The Salesforce platform is terrible to use",
          "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbc2son/",
          "created": 1719950180,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lb8tb1m",
      "score": 55,
      "body": "I d voted No solely because the name Benioff have me ptsd for Game of Thrones Season 8",
      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lb8tb1m/",
      "created": 1719898583,
      "depth": 0,
      "replies": [
        {
          "id": "lb95pq5",
          "score": 36,
          "body": "This Benioff and that Benioff are cousins actually",
          "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lb95pq5/",
          "created": 1719906784,
          "depth": 1,
          "replies": [
            {
              "id": "lbcpy2c",
              "score": 5,
              "body": "I'd never trust anyone related to that Benioff. Fair play for voting no on this guy. He'd probably 100x the stock only to make it go bankrupt out of nowhere in year 7 and 8.",
              "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbcpy2c/",
              "created": 1719957830,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lba7rq9",
      "score": 12,
      "body": "About time. The money belongs to the shareholders. It's their's to allocate as they see fit. C-suite compensation has been out of control for twenty years. It won't stop until enough shareholders revolt against it to get noticed.",
      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lba7rq9/",
      "created": 1719928052,
      "depth": 0,
      "replies": [
        {
          "id": "lbc077h",
          "score": 3,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbc077h/",
          "created": 1719949345,
          "depth": 1,
          "replies": [
            {
              "id": "lbfd1f5",
              "score": 1,
              "body": "Why? Isn’t the company owned by shareholders? ",
              "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbfd1f5/",
              "created": 1720005691,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lb8ij1h",
      "score": 8,
      "body": "He is a pig",
      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lb8ij1h/",
      "created": 1719892709,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbcfnsz",
      "score": 2,
      "body": "What’s the point in issuing shares to someone who is always mercilessly selling anyway? Just pay him massive cash comp to prevent the dilution",
      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbcfnsz/",
      "created": 1719954301,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbbwddi",
      "score": 0,
      "body": "Do you have to be registered and living in the USA to vote? Im holding and had no idea there was a vote.",
      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lbbwddi/",
      "created": 1719948106,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb8ggta",
      "score": -19,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lb8ggta/",
      "created": 1719891717,
      "depth": 0,
      "replies": [
        {
          "id": "lb8piy3",
          "score": 16,
          "body": "Doubt it",
          "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lb8piy3/",
          "created": 1719896397,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb9eqg1",
          "score": 6,
          "body": "LOL he’s not Elon, no one gives AF who the CEO of CRM is, shareholders just care about results.",
          "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lb9eqg1/",
          "created": 1719913354,
          "depth": 1,
          "replies": [
            {
              "id": "lb9ifdd",
              "score": 2,
              "body": "True, but he’s delivered results big time to shareholders over the years.",
              "permalink": "/r/stocks/comments/1dtbnef/salesforce_shareholders_reject_compensation_plan/lb9ifdd/",
              "created": 1719915860,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ],
  "stockTickers": {
    "post_summary": "Salesforce shareholders voted against the company's compensation plan for top executives, including CEO Marc Benioff.",
    "companies": [
      "Salesforce",
      "Glass Lewis",
      "Institutional Shareholder Services"
    ],
    "tickers": [
      "CRM"
    ],
    "main_ticker": [
      "CRM"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Salesforce shareholders voted against the compensation plan for CEO Marc Benioff and top executives due to concerns about equity awards.",
    "stock_recommendations": "The post does not recommend buying or selling Salesforce stock.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": null,
    "sentiment_summary": "There is a neutral sentiment as the post does not provide any advice related to buying or selling Salesforce stock.",
    "sentiment": "neutral"
  }
}