{
  "title": "TSLA: \"Between two major growth waves\" means \"low growth\" or actually \"no growth\"?",
  "score": 82,
  "selftext": "2024Q2\n\nProduction: 410,831 (-14.35% YoY)\n\nDelivery: 443,956 (-4.75% YoY) but beating WS estimates at 438,019\n\nIndeed, the delivery number had been declining for two consecutive quarters, yet it has beaten the  market consensus, resulting to another \\~5% pump in the pre-market.\n\nThat being said, no growth is \"still\" acceptable? LOL \\~ typical TSLA!\n\n*PS:Historical P/E (July 2023 to June 2024) goes above 100x today, good show.*\n\n&#x200B;\n\n**Tesla Vehicle Production & Deliveries and Date for Financial Results & Webcast for Second Quarter 2024**\n\n[https://ir.tesla.com/press-release/tesla-vehicle-production-deliveries-and-date-financial-results-webcast-second-quarter-2024](https://ir.tesla.com/press-release/tesla-vehicle-production-deliveries-and-date-financial-results-webcast-second-quarter-2024)\n\n*In the second quarter, we produced approximately 411,000 vehicles and delivered approximately 444,000 vehicles. We deployed 9.4 GWh of energy storage products in Q2, the highest quarterly deployment yet.*\n\n*Tesla will post its financial results for the second quarter of 2024 after market close on Tuesday, July 23, 2024. At that time, Tesla will issue a brief advisory containing a link to the Q2 2024 update, which will be available on Tesla’s Investor Relations website. Tesla management will hold a live question and answer webcast that day at 4:30 p.m. Central Time (5:30 p.m. Eastern Time) to discuss the Company’s financial and business results and outlook.*\n\n&#x200B;\n\n**Tesla reports 443,956 deliveries in second quarter, a 4.8% decrease from last year**\n\n[https://www.cnbc.com/2024/07/02/tesla-tsla-q2-2024-vehicle-delivery-and-production-numbers.html](https://www.cnbc.com/2024/07/02/tesla-tsla-q2-2024-vehicle-delivery-and-production-numbers.html)\n\n*Tesla shares jumped on Tuesday after the company posted second-quarter vehicle production and deliveries numbers that beat analyst expectations.*\r  \n*Analysts expected Tesla deliveries to hit 439,000 in the three months ending June 30, according to a consensus of estimates compiled by FactSet StreetAccount. The total number of deliveries in the second quarter fell 4.8% from 466,140 a year earlier but rose 14.8% from the first quarter.*\r  \n*The stock rose more than 9% Tuesday in midday trading. Before the report, Tesla shares were down 16% in 2024.*\n\n&#x200B;\n\n**Tesla's quarterly deliveries fall less than expected; shares rally**\n\n[https://www.reuters.com/business/autos-transportation/teslas-second-quarter-deliveries-beat-estimates-price-cuts-boost-sales-2024-07-02](https://www.reuters.com/business/autos-transportation/teslas-second-quarter-deliveries-beat-estimates-price-cuts-boost-sales-2024-07-02)\n\n*Tesla on Tuesday reported a smaller-than-expected 5% drop in vehicle deliveries in the second quarter, as the electric carmaker's price cuts and incentives helped mitigate cooling demand.*\n\n*Shares of the world's most valuable automaker rallied more than 10% on Tuesday, hitting the highest level in nearly six months.*\n\n*The higher-than-expected deliveries data \"greatly assuages concerns regarding softening EV demand,\" CFRA Research analyst Garrett Nelson said. \"The stock continues to ride a wave of positive momentum following its annual meeting in mid-June in which shareholders re-approved Musk’s 2018 compensation plan,\" he said, referring to CEO Elon Musk.*\n\n&#x200B;\n\n\\-----------------------------------------------------------------------------------------\n\n&#x200B;\n\nEverything below this line was written before the release of P&D numbers \\~\n\n&#x200B;\n\nTSLA is going to release its 2024Q2 P&D numbers in the next couple of hours, WS analysts think that total delivery could reach 438,019 (vs 466,140, i.e. around 6% YoY drop).\n\nIn my opinion, 438K is still far too high based on continuous checking shared by a lot of non-WS analysts - which is supported by the data regularly released in Mainland China, Europe and the United States. The educated estimates should be ranging from 415K to 420K, implying at least 9% YoY decline.\n\nRecall in January 2024's investor call that Mr. CEO was saying TSLA is between two major growth waves while no further guidance was provided (very tricky to be honest), does it mean \"low growth\" or actually \"no growth\"?\n\nMore information will be followed post the release of 2024Q2 numbers ...\n\n&#x200B;\n\n**Tesla deliveries set to fall for second straight quarter**\n\n[https://www.reuters.com/business/autos-transportation/tesla-deliveries-set-fall-second-straight-quarter-2024-07-01](https://www.reuters.com/business/autos-transportation/tesla-deliveries-set-fall-second-straight-quarter-2024-07-01)\n\n*Tesla's June-quarter deliveries likely fell 6%, the first time the top EV maker is set to post two straight quarters of decline, as it deals with stiff competition in China and slow demand due to a lack of affordable new models.*\n\n*The company is expected to deliver 438,019 vehicles for the April to June period, according to an average estimate based on forecasts from 12 analysts polled by LSEG, seven of whom slashed their expectations in the past three months. The EV maker is expected to announce the results on Tuesday.*\n\n*Tesla has hit a speed bump after years of rapid growth that helped make it the world's most valuable automaker. It warned in January that deliveries growth in 2024 would be \"notably lower\" as a boost from months-long price cuts wanes.*\n\n&#x200B;\n\n**Tesla's June China-made EV sales down 24.2% y/y**\n\n[https://www.reuters.com/business/autos-transportation/teslas-june-china-made-ev-sales-down-242-yy-2024-07-02](https://www.reuters.com/business/autos-transportation/teslas-june-china-made-ev-sales-down-242-yy-2024-07-02)\n\n*Tesla's June sales of China-made electric vehicles fell 24.2% from a year earlier to 71,007, data from the China Passenger Car Association (CPCA) showed on Tuesday.*\n\n*Deliveries of the U.S. automaker's China-made Model 3 and Model Y vehicles fell 2.2% from May levels.*\n\n*Chinese rival BYD with its Dynasty and Ocean lineups of EVs and plug-in hybrids, sold 340,211 passenger vehicles in June, up 35.2% year on year.*",
  "link_flair_text": "Company News",
  "id": "1dti4bf",
  "num_comments": 118,
  "created_utc": 1719914413,
  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/",
  "comments": [
    {
      "id": "lb9xbi1",
      "score": 60,
      "body": "This is quickly becoming a meme stock, imo. That said, it’s a bad idea to bet against meme stocks. They can float up on air for long periods of time.",
      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9xbi1/",
      "created": 1719923781,
      "depth": 0,
      "replies": [
        {
          "id": "lba3sjp",
          "score": 51,
          "body": ">becoming",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba3sjp/",
          "created": 1719926501,
          "depth": 1,
          "replies": [
            {
              "id": "lba6cm4",
              "score": 10,
              "body": "Haha…fair. Good catch.",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba6cm4/",
              "created": 1719927508,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lbbdx7l",
          "score": 8,
          "body": "> This is quickly becoming a meme stock, imo\n\nIt's not a meme stock, it's a cult stock.",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbbdx7l/",
          "created": 1719942145,
          "depth": 1,
          "replies": [
            {
              "id": "lbbglwy",
              "score": 6,
              "body": "What’s the difference?",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbbglwy/",
              "created": 1719942999,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lbao3ye",
          "score": 8,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbao3ye/",
          "created": 1719933773,
          "depth": 1,
          "replies": [
            {
              "id": "lbap02i",
              "score": 3,
              "body": "Today is proof. Sales falling a lot YoY and just because they aren’t falling as fast as anticipated, we go up 9%. It’s insanity. You can’t bet against it though because it could very well keep going. The rug pull can’t be predicted.\n\nRepublicans don’t want EVs and Democrats hate Musk. It is what it is.",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbap02i/",
              "created": 1719934070,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lbuaxc5",
          "score": 1,
          "body": "There is nothing meme about Tesla. It’s putting everything in place to become the biggest cash generator we’ve ever seen.",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbuaxc5/",
          "created": 1720234523,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbcnf2d",
          "score": 1,
          "body": "TSLA was one of the original meme stocks I thought",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbcnf2d/",
          "created": 1719956936,
          "depth": 1,
          "replies": [
            {
              "id": "lbdc6f5",
              "score": 1,
              "body": "Certainly an argument to be made.",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbdc6f5/",
              "created": 1719966271,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lbaadv7",
      "score": 48,
      "body": "You have to put it in perspective of the wider car market. How are Ford and GM doing with making EVs?\n\nInterest rates are also hampering Tesla and it's taking more time than expected for people to adopt electric.\n\nHowever in the long run everyone is going electric, it's just a matter of when.\n\nTesla energy is surging.\n\nAnd ultimately the stock is pricing in about a 10% chance of FSD and Bot actually happening, which is about fair value imo. \n\nThat's where you can get alpha as an investor, they are priced like that because no one is sure if they will work, however if FSD works Tesla is going to absolutely moon and 10 bag from here.\n\nI'll take my downvotes because this sub only has 1 opinion on Tesla, and that's fine, investing isn't about being right on the internet, it's about putting your money where your mouth is and getting paid what your opinion is worth.",
      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbaadv7/",
      "created": 1719929027,
      "depth": 0,
      "replies": [
        {
          "id": "lbavz26",
          "score": 14,
          "body": "Tesla Energy was absurd this past quarter. 9.4GWh deployed is nuts. They are maxed out on deployment until they can get their Chinese megapack factory up and running.",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbavz26/",
          "created": 1719936351,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbaxmbr",
          "score": 10,
          "body": "Don’t forget the Optimus robots too.  If they can actually make that happen this shit is going up like crazy.  I’m glad I reversed Reddit sentiment and loaded up on TSLA when it was down.  People just love to hate Elon on here",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbaxmbr/",
          "created": 1719936893,
          "depth": 1,
          "replies": [
            {
              "id": "lbbzt0f",
              "score": 7,
              "body": "True ... three weeks ago ... we were told 100 millions humanoid robots will be sold annually by Tesla ... but let's not forget back in 2020 ... we were told that TSLA aspired to sell 20 million vehicles by the end of the current decade.\n\nWhere is the 20 million now?\n\n&#x200B;\n\n*In a scenario described by Musk, the market demand for humanoid robots — such as Tesla’s Optimus — would reach onebillion units per year, with Tesla capturing about 10% of that market. The CEO also reaffirmed that the Optimus robots will eventually be made for less than a car, about $10,000, and priced at between $20,000 and $30,000.*\r  \n\r  \n*At a $20,000 price tag and 100 million units sold annually, Musk said Tesla could make $1 trillion in profit each year, adding between $20 trillion and $25 trillion to Tesla’s market capitalization. The robots aren’t expected to go on sale until the end of 2025, although Tesla has said there are at least two deployed in its factories.*",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbbzt0f/",
              "created": 1719949216,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lbdmoli",
              "score": -1,
              "body": "If you really think Tesla is going to produce functionally useful human robots, I have a bridge to sell you.\n\n\nTheir early model they revealed was, at best, a straight copy of what was being produced decades ago.  Meanwhile, many other companies are making actually useful robots that do useful things and not making an obvious Barnum and Bailey show out of it.",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbdmoli/",
              "created": 1719970472,
              "depth": 2,
              "replies": [
                {
                  "id": "lbedtsk",
                  "score": 3,
                  "body": "They literally showed two working in the factory doing simple tasks.  Just give it a couple years",
                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbedtsk/",
                  "created": 1719982789,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbek6s0",
                      "score": -2,
                      "body": "Ah yes, slowly putting things in a crate or slowly folding a shirt.\n\n\nMeanwhile everybody else has made robots that do thing efficiently and effectively, at a level that is actually useful.\n\n\nOptimus is a joke and a meme, with little actual use.",
                      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbek6s0/",
                      "created": 1719986491,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lbevncu",
                          "score": 2,
                          "body": "Buy puts then. Sounds like you’re just jealous you didn’t buy TSLA in the dip",
                          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbevncu/",
                          "created": 1719994176,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lbfoo0i",
                              "score": -1,
                              "body": "I never buy puts for many reasons, and I'm not jealous in the least.  Good for you for making money.  Make it while you can, but don't get wrapped up in cult mentality.",
                              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbfoo0i/",
                              "created": 1720011155,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lbe4hs9",
                  "score": 2,
                  "body": "Ok, where's the bridge and how much?",
                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbe4hs9/",
                  "created": 1719978034,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbepvoa",
                      "score": 2,
                      "body": "golden gate, a measly cheap 1 million! youd make your money back within a year!",
                      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbepvoa/",
                      "created": 1719990171,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lbbr00q",
          "score": 2,
          "body": "good solid analysis and understanding of the market is not welcome with the tesla bears",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbbr00q/",
          "created": 1719946367,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbbyv9h",
          "score": -1,
          "body": "Think how much better GPT4o is than the original chatGPT3 in a year. FSD will definitely work.",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbbyv9h/",
          "created": 1719948911,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbept9e",
          "score": 0,
          "body": "10 bag??? you're saying tesla will go to 7 TRILLION if their fsd works??\n\n  \nalso making money on memes is great but don't flatter your opinions",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbept9e/",
          "created": 1719990126,
          "depth": 1,
          "replies": [
            {
              "id": "lbewx62",
              "score": 2,
              "body": "Clear your mind and genuinely ask yourself: how much is a robotaxi company worth?\n\nLike on the assumption the tech works really well and there's a car that happily works as a taxi or food or package delivery driver 16 hours a day 350 days a year ... How much money does that car bring in for the company that owns and operates it?",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbewx62/",
              "created": 1719995096,
              "depth": 2,
              "replies": [
                {
                  "id": "lbeyson",
                  "score": 2,
                  "body": "Please tell us. And then also don't forget the regulatory hurdles, probably oversight needed for many years to come from a person inside the car instead of it being allowed on its own and potential taxation on these things, the added vandalism and cleaning needed with people messing with these cars, how these cars are going to bring the food up to the door of an apartment building (guess a Tesla robot is sitting in the car and will bring it up?), etc etc.\n\nIt all sounds nice. When you put it in practice, you find tons of issues that become important that you can't easily fix and replace what a human is doing now.",
                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbeyson/",
                  "created": 1719996449,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbf0zaj",
                      "score": 1,
                      "body": "I agree I think there's a lot of operational hurdles to get over to make a smooth service. \n\nInterior cameras and credit card on file is pretty good against vandalism. \n\nIf the car is genuinely safer than humans regulators should be fine with it. I don't see why they'd have higher taxes than taxis?\n\nAnd yeah it's fine to ask people to come to the vehicle to collect their food. It's less good but if it's cheaper then they'll do it.",
                      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbf0zaj/",
                      "created": 1719998019,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lbf4rm7",
                          "score": 1,
                          "body": "So how much is it worth then?\n\nIt already starts again with it needs to be cheaper. So how cheap, and how much of your potential cut costs goes away already due to needing to provide a cheaper price because the product offered is in some ways inferior.",
                          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbf4rm7/",
                          "created": 1720000690,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lbf76hu",
                              "score": 1,
                              "body": "Well the product is only inferior in some ways.\n\nFor instance for women at night being able to ride without a creepy driver would be worth paying a premium for. Especially for sending adolescents if you can track the vehicle and watch from an interior camera to check they are ok.\n\nAnd it depends, if someone coming to the door rather than being in the vehicle is worth like $1 to people then just take it off the price. And if it's worth $5 for people then yeah it's a really good use case to start out with optimus and people might pay extra at first to get to see a robot deliver their food.",
                              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbf76hu/",
                              "created": 1720002278,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lbf867d",
                                  "score": 1,
                                  "body": "You're really just replacing the cost of the driver with all kinds of other costs at that point. I wonder how much additional profit that would generate in the end. I think it might end up in a disappointing amount.",
                                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbf867d/",
                                  "created": 1720002899,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lbf95xq",
                                      "score": 1,
                                      "body": "Well yeah this is investing and how it works. You make your model for robotaxi revenue and discount in into the present.\n\nI think there's tonnes of premium journeys, like taking business people to the airport at 3am, which would be worth loads and are easy and barely have any costs.\n\nAnd yeah that's my favourite thing about investing, we all put our money where out mouths are and get paid for the value of our opinions.",
                                      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbf95xq/",
                                      "created": 1720003496,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lbjyene",
                  "score": 2,
                  "body": "just remember if Tesla solves fsd then many others would too and it will be a commodity",
                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbjyene/",
                  "created": 1720068713,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbkcxj2",
                      "score": 1,
                      "body": "Well to solve fsd using Tesla's method you need a giant fleet of cars to collect data, a giant server farm to process it, millions of specialised in car computers and a really good team of software engineers. \n\nWaymos approach can't scale. \n\nGoogle and Microsoft would have the tech but not the cars.\n\nFord, GM, VW etc have the cars and not the tech. \n\nI agree with you others will make competing systems. However it's an incredibly hard project which would take years.",
                      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbkcxj2/",
                      "created": 1720077325,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lbp2ci6",
                          "score": 1,
                          "body": "You are underestimating big tech and especially Chinese competition. Once the problem has been solved, there would be numerous fast followers.",
                          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbp2ci6/",
                          "created": 1720151667,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lba5ifw",
      "score": 11,
      "body": "Another \"growth stock\" like Apple that isn't actually growing. Future growth is purely speculative and based largely on wishful thinking. Sales are falling, margins are falling and profit will probably be non-existent. The only thing that's going to the moon is the P/E\n\nTsla's not been a normal stock since the pre \"funding secured\" days, it reacts to the quantity of news releases not their content and frequently jumps 10% for no reason (surprised the SEC doesn't show more interest in this - lol jk, Gary's a Tesla fanboi), but recent price action has been even weirder than normal. It's effectively just a crypto token now, totally divorced from the underlying company.\n\nWhat a mockery of the whole point of public markets. Number Must Go Up!",
      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba5ifw/",
      "created": 1719927179,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb9n2n8",
      "score": 24,
      "body": "meh, a lot of other car makers are making EVs now. TSLA isn't so special now.",
      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9n2n8/",
      "created": 1719918664,
      "depth": 0,
      "replies": [
        {
          "id": "lb9nuuk",
          "score": 29,
          "body": "bUt ITs NoT ACAr CoMPaNy!!",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9nuuk/",
          "created": 1719919095,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lba5gx9",
          "score": 10,
          "body": "Are you saying, the competition is coming?",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba5gx9/",
          "created": 1719927162,
          "depth": 1,
          "replies": [
            {
              "id": "lbbrcjo",
              "score": 2,
              "body": "haven't heard that before lol",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbbrcjo/",
              "created": 1719946480,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lbai4wh",
          "score": 9,
          "body": "What are their margins per unit compared to Tesla. \n\nSales numbers and simply producing EVs doesn’t prove a point or tell a story for investment purposes.",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbai4wh/",
          "created": 1719931767,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbaqfff",
          "score": 5,
          "body": "Toyota just completely abandoned its EV division",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbaqfff/",
          "created": 1719934544,
          "depth": 1,
          "replies": [
            {
              "id": "lbb9yaf",
              "score": 3,
              "body": "Really?\n\nhttps://www.reuters.com/business/autos-transportation/toyota-launch-first-ev-with-advanced-self-driving-system-china-2025-2024-06-28/",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbb9yaf/",
              "created": 1719940873,
              "depth": 2,
              "replies": [
                {
                  "id": "lbbss5j",
                  "score": 1,
                  "body": "That almost seems to prove that they abandoned it more. They're only testing an EV for autonomous use in China, not for mass scale EV production lol. How's their bZ4X doing?",
                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbbss5j/",
                  "created": 1719946940,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbbtpig",
                      "score": 3,
                      "body": "The person was not saying anything about how well its selling. The person said they abandoned their EV division which obviously isnt true.",
                      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbbtpig/",
                      "created": 1719947243,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lbbwig7",
                          "score": 2,
                          "body": "I'm saying the article you posted basically proves their point. They are only producing EVs to test autonomy...so they are going to make what...100? Maybe 1000? That's basically abandoning EV production. They are not producing EVs at the rate they produce any of their best selling cars.",
                          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbbwig7/",
                          "created": 1719948151,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lbksdtk",
                              "score": 1,
                              "body": "No it doesn't. The poster claimed that they was stopping their EV departement.  It wasn't an argument that their EVs didnt sell well or that they were focusing on other areas.\n\nIt was that they are scrapping their EV department. Thst is obviously false",
                              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbksdtk/",
                              "created": 1720088032,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lbloyqp",
                                  "score": 1,
                                  "body": "agree to disagree",
                                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbloyqp/",
                                  "created": 1720103731,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lbbpeh6",
          "score": 1,
          "body": "But their EV's are shitty and/or have negative margins.",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbbpeh6/",
          "created": 1719945852,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lb9tbr9",
          "score": -8,
          "body": "They still have the best efficiency of any other electric car. Smaller battery needed, lighter car. Effectively they have the best battery tech.\n\nI hope the race for efficiency starts soon because at the moment it doesn't really matter",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9tbr9/",
          "created": 1719921909,
          "depth": 1,
          "replies": [
            {
              "id": "lb9vkm6",
              "score": 9,
              "body": "This is a false perception that has been going around for too long. It needs to end.\n\nIf you own a Tesla and other eV's, you will note the Tesla range is insanely inaccurate compared to other eV's like the Mach-E or Lightning. I hate Ford for their bait and switching but somehow they figured out how to calculate range properly to almost no error while Teslas cant even do that right. Teslas (M-Y and M-3) are always higher than reality by a good 4-5%. The entire bit about Tesla having better battery is false.\n\nWhat Tesla does is tune the range to a much wider error range making it look like they get more miles at high charges. But when you actually drive them, they always get like 15 miles LESS than advertised after full charge. This doesnt happen in the mach-e or lightning driving the same roads and distances. How Tesla hasnt figured out the proper calculation should tell us all we need to know about their \"tech.\"",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9vkm6/",
              "created": 1719922980,
              "depth": 2,
              "replies": [
                {
                  "id": "lba5ldn",
                  "score": 9,
                  "body": "This is not about the range they show you, this is about miles per kWh, and Tesla beat everyone. Nobody shows accurate range in the car, but Tesla can achieve similar range to it's competitors, with a smaller battery. That's the efficiency they have.\n\nLook up range tests on youtube, it's not about how far they go, it's about how well they use their battery and it's size relative to that.\n\nHere's an example: https://www.autoexpress.co.uk/company-cars/363005/tesla-model-3-vs-its-five-biggest-rivals\n\nScroll down a bit to see the table, second smallest battery pack, highest efficiency, which means they can do more with a smaller battery.",
                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba5ldn/",
                  "created": 1719927213,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lba308s",
                  "score": 4,
                  "body": "Using independent 70 mph range tests, Tesla's efficiency is still top notch.",
                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba308s/",
                  "created": 1719926185,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lba4v28",
                      "score": 2,
                      "body": "MPH test? How can you tell when the range itself is wrong? Thats my point. \n\nI know for a fact, by virtue of driving said cars for about 2 years now around SoCal, that the Tesla range is \"loose\" (aka wrong) by about 5%. I have yet to note anyone that refutes this. If you consider that its off by that much, does the test still hold up? If you are aware of someone who can refute it by driving the cars from full to low charge (when Teslas finally clam up and tell the truth), then point me to said study. Otherwise you cant tell because the range is not accurate.",
                      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba4v28/",
                      "created": 1719926923,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lba5jml",
                          "score": 2,
                          "body": "Look at InsideEVs 70 mph range tests or Bjorn’s tests.",
                          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba5jml/",
                          "created": 1719927193,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lbahpa9",
                              "score": -1,
                              "body": "Thanks, ill take a closer look but just glancing at the charts from 2023, it looks like they are echoing what i said above. Teslas are off when it comes to range. According to them, they are far worse than even the 5% I stated above. Looking at his chart for various cars, it looks like Teslas perform about 10%-12% worse than reported EPA range. While the Mach-E almost nails it and even under reports it sometimes (this is my experience as well). I think the discrepancy is that the dashboard doesnt just give you EPA but rather Teslas own halfassed calculation, which might be a little better but still off.\n\nAlso I dont think any of these charts indicate that \"Tesla batteries\" are better but rather the car design itself gets better efficiency. Teslas tend to be bare bone... Further, if the charts are to be believed, then it looks like both Lucid and Hyundai are better than Teslas and those guys have been making eVs for how long?\n\nIll keep reading but just based on those charts alone, it seems to indicate (to me at least) that the efficiency is due to car design rather than tech. Aero + weight + tires + etc. Basically the same reason why a Geo used to get 50 mpg without even before we had hybrid engines. Same reason why the Prius today gets 50 mpg. The engines havent changed, but the car design is meant for better range but you give up other things in the process.",
                              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbahpa9/",
                              "created": 1719931619,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lb9vu33",
                  "score": 2,
                  "body": "Isn't that false advertisement?",
                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9vu33/",
                  "created": 1719923103,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lbbpu4t",
                  "score": 1,
                  "body": "It seems that you don't know anything about Teslas or EV's.",
                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbbpu4t/",
                  "created": 1719945993,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lb9nf9y",
          "score": -15,
          "body": "Except for having  the highest range EV with best charging networ for the most adorable price. Good luck matching a Tesla with your Nissan leaf",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9nf9y/",
          "created": 1719918858,
          "depth": 1,
          "replies": [
            {
              "id": "lb9nzsp",
              "score": 14,
              "body": "Is this a joke?",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9nzsp/",
              "created": 1719919169,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lba4faf",
              "score": 3,
              "body": "Imagine still thinking other car manufacturers are still making Nissan Leaf like EV’s.",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba4faf/",
              "created": 1719926749,
              "depth": 2,
              "replies": [
                {
                  "id": "lbbqeh3",
                  "score": 1,
                  "body": "Nissan still makes the Leaf. Sure, there are better ones on market but Teslas give the best bang for your buck and have healthy margins.",
                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbbqeh3/",
                  "created": 1719946174,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lb9rra6",
      "score": 22,
      "body": "This stock isn’t about cars anymore, it’s about how Elon will manipulate the stock",
      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9rra6/",
      "created": 1719921132,
      "depth": 0,
      "replies": [
        {
          "id": "lbaqhsx",
          "score": 1,
          "body": "And robotics, ai, and transportation",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbaqhsx/",
          "created": 1719934566,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lba8hwm",
          "score": -7,
          "body": "You copied this comment from somewhere… is this a popular line to be used against Tesla/Musk?",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba8hwm/",
          "created": 1719928326,
          "depth": 1,
          "replies": [
            {
              "id": "lba8mjy",
              "score": 8,
              "body": "I did?  It’s pretty obvious to most",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba8mjy/",
              "created": 1719928374,
              "depth": 2,
              "replies": [
                {
                  "id": "lbacneu",
                  "score": -4,
                  "body": "Word for word?",
                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbacneu/",
                  "created": 1719929849,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lba1xww",
      "score": 13,
      "body": "Ah yes r/stocks with their intelligent takes on growth companies",
      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba1xww/",
      "created": 1719925752,
      "depth": 0,
      "replies": [
        {
          "id": "lbaa7xj",
          "score": 6,
          "body": "Is the growth company in the room with us right now?",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbaa7xj/",
          "created": 1719928966,
          "depth": 1,
          "replies": [
            {
              "id": "lbavioi",
              "score": 7,
              "body": "Energy deployment is up 132% QoQ. That’s some serious growth. 9.4GWh",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbavioi/",
              "created": 1719936201,
              "depth": 2,
              "replies": [
                {
                  "id": "lbayqqs",
                  "score": 0,
                  "body": "What's that in dollars though? I thought energy was quite a small part of its business.",
                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbayqqs/",
                  "created": 1719937257,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbb3g6w",
                      "score": 6,
                      "body": "Billions of dollars in revenue in just 1 quarter.\n\nThe estimate is 3 billion for Q2 but we won’t know for sure until July 23",
                      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbb3g6w/",
                      "created": 1719938783,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lbd66rx",
      "score": 2,
      "body": "What is the reasoning behind \"between two major growth waves\"?  Seems like Tesla is coming under a lot of pressure lately from increased competition, as their first mover advantage fades.   What is supposed to cause this upcoming growth wave?",
      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbd66rx/",
      "created": 1719963926,
      "depth": 0,
      "replies": [
        {
          "id": "lbex6ol",
          "score": 1,
          "body": ">What is supposed to cause this upcoming growth wave?\n\nMr. CEO ![gif](emote|free_emotes_pack|joy)",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbex6ol/",
          "created": 1719995288,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lba5i9x",
      "score": 5,
      "body": "Just shows how crazy the market is. If a stock market is moving only by hype and speculation there is no economical point in such stock market.",
      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba5i9x/",
      "created": 1719927178,
      "depth": 0,
      "replies": [
        {
          "id": "lba6624",
          "score": 3,
          "body": "Fundamental does not work for TSLA - most of the time \\~",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba6624/",
          "created": 1719927438,
          "depth": 1,
          "replies": [
            {
              "id": "lbbrksj",
              "score": 2,
              "body": "its never worked for Tesla not sure why people suddenly want it too now",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbbrksj/",
              "created": 1719946554,
              "depth": 2,
              "replies": [
                {
                  "id": "lbbw43x",
                  "score": 1,
                  "body": "TSLA is kinda good for entertainment \\~",
                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbbw43x/",
                  "created": 1719948023,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbbwurk",
                      "score": 1,
                      "body": "i prefer TSLL",
                      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbbwurk/",
                      "created": 1719948262,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lb9nbg1",
      "score": 3,
      "body": "There's still quite a bit of growth happening in the energy sector. The lull in growth is in the car sector.",
      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9nbg1/",
      "created": 1719918800,
      "depth": 0,
      "replies": [
        {
          "id": "lb9uxsc",
          "score": 5,
          "body": "Better buy an energy company for energy sector \\~ ![gif](emote|free_emotes_pack|sunglasses)",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9uxsc/",
          "created": 1719922684,
          "depth": 1,
          "replies": [
            {
              "id": "lbavo1v",
              "score": 4,
              "body": "Isn’t 132% growth QoQ good for Tesla energy? Like billions of dollars of energy revenue in one quarter is not insignificant.",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbavo1v/",
              "created": 1719936250,
              "depth": 2,
              "replies": [
                {
                  "id": "lbcn704",
                  "score": 2,
                  "body": "Billions in low margin revenue isn’t significant either. This isn’t Nvidia doing 78% gross margin.",
                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbcn704/",
                  "created": 1719956858,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lb9xw7r",
              "score": -8,
              "body": "Tesla is an energy company. They just started out with cars because that's where the 'easy' profit is. Of course you can buy stocks in some other company doing energy storage, too...but those are almost exclusively chinese.",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9xw7r/",
              "created": 1719924037,
              "depth": 2,
              "replies": [
                {
                  "id": "lb9zkag",
                  "score": 5,
                  "body": ">Tesla is an energy company.\n\nMr. CEO said that it is an AI company \\~ probably your understanding is not correct ... lol",
                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9zkag/",
                  "created": 1719924759,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lba1265",
                      "score": -6,
                      "body": "I think you're not listening to what Musk is saying/doing. He was even prepared to take the AI part *out* of Tesla. So Tesla is clearly not simply an AI company to him. He's a first principles guy and the first principle he's always quoting is energy.",
                      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba1265/",
                      "created": 1719925385,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lba3b7d",
                          "score": 9,
                          "body": "AI has to be stayed with TSLA after his pay package ... lol ... at least for a little while \\~",
                          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba3b7d/",
                          "created": 1719926308,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lba2utc",
                          "score": 7,
                          "body": "Must be nice to sell snake oil to willing consumers 🤡\n\nI gotta learn how to be a cult leader",
                          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba2utc/",
                          "created": 1719926125,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lb9htx2",
      "score": 1,
      "body": "The stock rised 6.5% today",
      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9htx2/",
      "created": 1719915470,
      "depth": 0,
      "replies": [
        {
          "id": "lb9j7vy",
          "score": -3,
          "body": "Last | 6:32 AM EDT\r  \n205.83 -4.03 (-1.92%)\r  \nVolume: 683,243",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9j7vy/",
          "created": 1719916368,
          "depth": 1,
          "replies": [
            {
              "id": "lba5se8",
              "score": 4,
              "body": "Up 4.67% now",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba5se8/",
              "created": 1719927289,
              "depth": 2,
              "replies": [
                {
                  "id": "lba8lwx",
                  "score": 3,
                  "body": "6.67 right now",
                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba8lwx/",
                  "created": 1719928368,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lba9k57",
                      "score": 2,
                      "body": "![gif](emote|free_emotes_pack|joy)what a good show \\~ where to buy more popcorn?",
                      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba9k57/",
                      "created": 1719928721,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lbc3egv",
                          "score": 2,
                          "body": "Finished at 10",
                          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbc3egv/",
                          "created": 1719950373,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lbex3ut",
                              "score": 1,
                              "body": "will buy more popcorn if it rises another 10% today ![gif](emote|free_emotes_pack|grin)",
                              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbex3ut/",
                              "created": 1719995230,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lbocv3b",
      "score": 1,
      "body": "Is it finna go up still",
      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbocv3b/",
      "created": 1720139502,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lba4n0l",
      "score": 0,
      "body": "the mag7 that wasn't flying before is now flying. glad i bought another 50 shares yesterday so i have no FOMO today.",
      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba4n0l/",
      "created": 1719926834,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbbo4p9",
      "score": 1,
      "body": "Negative growth is still growth.  Sort of.",
      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbbo4p9/",
      "created": 1719945440,
      "depth": 0,
      "replies": [
        {
          "id": "lbbwasy",
          "score": 2,
          "body": "This is \"tricky\" lol",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbbwasy/",
          "created": 1719948083,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbgbrlw",
      "score": 1,
      "body": "I don’t know but Pelosi sold her TSLA shares",
      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbgbrlw/",
      "created": 1720019599,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb9ymn2",
      "score": 0,
      "body": "The bet is that tesla FSD will enable a fleet of driverless taxis. Undercutting all competition as there is no driver to really split the profit. \n\nAnd also their new factory robots.",
      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9ymn2/",
      "created": 1719924357,
      "depth": 0,
      "replies": [
        {
          "id": "lba702y",
          "score": 4,
          "body": "People who say this have absolutely no idea how the taxi industry works. The driver doesn't just drive, he cleans, maintains, refuels/charges, provides storage at off peak times and generally does all the other things that running a small business requires.\n\nEven without a driver you will still need to pay someone to do all the other things and the profit is pretty meagre anyway. And you are assuming the cost of the software/hardware replacement is going to be nearly free, which would be a shock the Microsoft and rest of the tech crew.\n\nRobotaxis aren't going to happen because there is no economic incentive for them to happen.",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba702y/",
          "created": 1719927760,
          "depth": 1,
          "replies": [
            {
              "id": "lbdqwcv",
              "score": 1,
              "body": "Thanks for your opinion, I'm just telling you why the valuation is high.",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbdqwcv/",
              "created": 1719972161,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lbad4eo",
              "score": 1,
              "body": "The profit will be much higher without needing to pay a human being to sit in the car 24 hours and drive.\n\nY'all are so short sighted.",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbad4eo/",
              "created": 1719930018,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lba5aoz",
          "score": -5,
          "body": "Their robots are made in Japan or in China 😂😂",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba5aoz/",
          "created": 1719927093,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbanahs",
      "score": 0,
      "body": "Elon musk is two men:\n\n1. Creative genius; off the chart.\n2. Reincarnation of P.T.Barnum.\n\nI love what he's done for mankind ..but he's too good at pumping stocks for me to get involved.",
      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbanahs/",
      "created": 1719933501,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lb9jtm2",
      "score": -8,
      "body": "So? Buy more, be long.",
      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9jtm2/",
      "created": 1719916744,
      "depth": 0,
      "replies": [
        {
          "id": "lb9keb2",
          "score": 3,
          "body": ">So? Buy more, be long.\n\nwise man makes wise decisions",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9keb2/",
          "created": 1719917096,
          "depth": 1,
          "replies": [
            {
              "id": "lba38a3",
              "score": 5,
              "body": "Did you short TSLA?",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba38a3/",
              "created": 1719926276,
              "depth": 2,
              "replies": [
                {
                  "id": "lba507l",
                  "score": 1,
                  "body": "LOL ... genius if shorting under hype (a lot of people are profit taking though)",
                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba507l/",
                  "created": 1719926978,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lb9k5u5",
      "score": -16,
      "body": "Most investors of TSLA are in it for another 10+ years, so a period of no growth or even declining gross does not matter. Just a good opportunity to accumulate shares at this current price. \n\nThe needle won’t move meaningfully until the $25-30k model is released, and robotaxi and Optimus are bringing in revenue.",
      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9k5u5/",
      "created": 1719916953,
      "depth": 0,
      "replies": [
        {
          "id": "lb9nzfx",
          "score": 6,
          "body": "...famous last words",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9nzfx/",
          "created": 1719919164,
          "depth": 1,
          "replies": [
            {
              "id": "lb9r06c",
              "score": -9,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9r06c/",
              "created": 1719920750,
              "depth": 2,
              "replies": [
                {
                  "id": "lb9trkr",
                  "score": 6,
                  "body": "What growth?",
                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9trkr/",
                  "created": 1719922123,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lba3689",
                      "score": -5,
                      "body": "Look at a 5 year CAGR.",
                      "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba3689/",
                      "created": 1719926252,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lba5qny",
                          "score": 3,
                          "body": "Intel once grew a lot too. When does the decline stop for Teslas when do they already growing again, and by how much?",
                          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lba5qny/",
                          "created": 1719927270,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lbbvkkf",
                              "score": 1,
                              "body": "They grew quite strongly QoQ.\n\nQ2 2022 was 255k, 2023 was 476k, and this year is 444k. This result is higher than the amount in Q1 and Q3 last year.\n\nModel 3 refresh is still ramping up, Cybertruck is ramping up, and next year Tesla Semi is going to ramp too. Model Y will refresh at some point coming up, and new models launch next year. They may still have YoY growth this year, and certainly will have it next year barring a major economic recession.",
                              "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbbvkkf/",
                              "created": 1719947848,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lbc0uya",
                                  "score": 2,
                                  "body": ">They grew quite strongly QoQ.\n\nIsn't Q1 the slow one? And revenue and profit is struggling more than unit volume as ASPs have fallen.",
                                  "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lbc0uya/",
                                  "created": 1719949556,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lb9kb8u",
          "score": 1,
          "body": ">Most investors of TSLA are in it for another 10+ years\n\nHopefully it is \\~",
          "permalink": "/r/stocks/comments/1dti4bf/tsla_between_two_major_growth_waves_means_low/lb9kb8u/",
          "created": 1719917046,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}