{
  "title": "Only interrupt compounding, unless it's absolutely necessary.",
  "score": 68,
  "selftext": "So I hope you are all doing fine with your portfolios. I checked my YTD performance due to mid-year. I am up 21% (30th June) vs the S&P's about 14%. I just realized something I never really thought of before, because I was not a huge seller so far. My performance would have been much better without taking tax hits from selling stocks.\n\nI am from Europe, tax hit is about 26% on all gains above 1000€(annually) when selling. I mean, I knew it before, but I just realized it this year, as my tax hits are 4 figures now. I do understand more and more why Warren B. says “If you aren't thinking about owning a stock for ten years, don't even think about owning it for ten minutes.” The most important part is really to not interrupt compounding.\n\nTake for example AAPL. €10k invested in AAPL in January would be +17% €11.7k. You would have beaten the market when holding. If you sell: €1.7k gains 26% taxed left about €11.25k left. You would be up only up about 11% and been beaten by the index after selling. Index-funds have the big advantage, that they get taxed only at the very end, that way you don't interrupt compounding. I mean this is no rocket science and I am dumb to realize this only now, but the recent tax hits really opened my eyes.\n\nTo end this post with something useful: How is your portfolio doing? Have you beaten the S&P? What's your % YTD?\n\nTLDR: Tax on my investments is destroys my gains. Never interrupt compounding, unless it's absolutely necessary.",
  "link_flair_text": null,
  "id": "1dto192",
  "num_comments": 56,
  "created_utc": 1719932653,
  "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/",
  "comments": [
    {
      "id": "lbbq7wx",
      "score": 42,
      "body": "Unfortunately in Germany you have to pay tax on the unrealized gains on funds (including ETFs), the \"Vorabpauschale\".",
      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbbq7wx/",
      "created": 1719946116,
      "depth": 0,
      "replies": [
        {
          "id": "lbbwcs1",
          "score": 31,
          "body": "How does that work? What happens when you pay the tax on unrealized gains and the next year it turns to unrealized losses?",
          "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbbwcs1/",
          "created": 1719948101,
          "depth": 1,
          "replies": [
            {
              "id": "lbfnck0",
              "score": 0,
              "body": "Then you do not pay that tax next year",
              "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbfnck0/",
              "created": 1720010602,
              "depth": 2,
              "replies": [
                {
                  "id": "lbh4mp8",
                  "score": 1,
                  "body": "Do you have to pay tax again when you sell?",
                  "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbh4mp8/",
                  "created": 1720028969,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lbbyteh",
          "score": 41,
          "body": "I swear our German tax laws are completely out of control. They want us to save for our retirement and build wealth to not be dependent on the social system, but they also take every chance to fuck our compounding.",
          "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbbyteh/",
          "created": 1719948894,
          "depth": 1,
          "replies": [
            {
              "id": "lbdmgob",
              "score": 18,
              "body": "Do they pay you when your investments lose money?",
              "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbdmgob/",
              "created": 1719970383,
              "depth": 2,
              "replies": [
                {
                  "id": "lbewo1k",
                  "score": 2,
                  "body": "No.",
                  "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbewo1k/",
                  "created": 1719994911,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lbghyqm",
              "score": 7,
              "body": "At least y'all made the big-brain economic move of shutting down all nuclear power to replace it with low-grade coal. Thanks for the dramatic increase of radioactive atmospheric nuclei and courageous embrace of inefficient and outdated energy generation!",
              "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbghyqm/",
              "created": 1720021625,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lbcmkug",
          "score": 17,
          "body": "Is it not inherently unfair to be taxed on unrealized gains? What if you had a tax bill due just before the covid19 stock collapse for example? Seems wrong.",
          "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbcmkug/",
          "created": 1719956645,
          "depth": 1,
          "replies": [
            {
              "id": "lbcvlay",
              "score": 17,
              "body": "Tax grandma out of her house",
              "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbcvlay/",
              "created": 1719959905,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lbeyd13",
              "score": 7,
              "body": "Yes it is, Dutch Supreme Court decided a few weeks ago that taxing unrealized gains is  a breach of property rights. But our tax authorities can't change the system because of outdated software. Now we get taxed with a fixed percentage and if you don't agree you have to object, insofar you didn't miss the time limit.\n\nThing is however that if you meet or beat S&P500 gains the Dutch pre-fixed tax rate was a pretty sweet deal at 2%, because you don't pay any capital gains tax.  \n\nThere must be a German somehwere (Schwaben?)  that went to court about the Vorabpauschale?",
              "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbeyd13/",
              "created": 1719996132,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lbf2e5d",
          "score": 5,
          "body": "That is absolutely mental",
          "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbf2e5d/",
          "created": 1719999035,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbeolws",
          "score": 1,
          "body": "Same in New Zealand if you have more than 50K invested overseas. We call it the FIF. Foreign investment fund tax.",
          "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbeolws/",
          "created": 1719989330,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbf8j1s",
          "score": 1,
          "body": "To be fair, you just tax a small amount of it. Stupid, but not a total fuck up.",
          "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbf8j1s/",
          "created": 1720003115,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbpajvn",
          "score": 2,
          "body": "Biden is also trying to do that in the us",
          "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbpajvn/",
          "created": 1720156191,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbc2gkr",
      "score": 22,
      "body": "Luxembourg: no tax on capital gains if you hold the stocks for more than 6 months",
      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbc2gkr/",
      "created": 1719950074,
      "depth": 0,
      "replies": [
        {
          "id": "lbd9vhp",
          "score": 2,
          "body": "Thinking about just moving there as resident only from Czechia. I’m sure the same tax rules apply to non-citizens",
          "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbd9vhp/",
          "created": 1719965365,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbawpah",
      "score": 23,
      "body": "Good realization.\n\nIn Canada they bumped up the portion of capital gains that gets sent to income tax, from 50% to 66% for gains over 250k.\n\n\nSo many people were talking about selling everything to reset cost basis before the change date, because \"on 1M in gains, 750k at the new rate is 495 vs 375 heading into income taxes, and in the 50% bracket, I'll save over 60k in taxes!\"\n\n\nWhich makes a lot of sense if you don't move money often. But if you do, all you can think about is \"my holdings will shrink by nearly 20% for this pleasure\", which for the portfolio mainstays with no divesting in sight (which are likely the largest gainers, too), is quite a hit to the compounding.\n\n\nBuffetts wisdom is very correct here - I mean, why bother owning anything if you feel like you will need to micromanage the position to come out ahead? Most wealth is made from long holds, not clever trades... and you just need to spot 1 or 2 correct long holds in a lifetime to build a fortune.\n\n\nI think you have a typo though, ~~only~~ -> never, or ~~,unless~~ -> if",
      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbawpah/",
      "created": 1719936591,
      "depth": 0,
      "replies": [
        {
          "id": "lbby925",
          "score": 8,
          "body": "Wow, that Canada story is crazy! They make it very difficult for us to create wealth. But yeah, it changed my mind completely and how I will chose future companies! It's all about the long hold!\n\n  \nThanks for correcting my grammar. You are completely right, I wanted to say \"never\" and \"unless\".",
          "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbby925/",
          "created": 1719948712,
          "depth": 1,
          "replies": [
            {
              "id": "lbcnozz",
              "score": 2,
              "body": "It's amounts over $250k in capital gains in a single year. No normal investor will ever be affected by that tax change. All it takes is simple planning to avoid it.",
              "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbcnozz/",
              "created": 1719957032,
              "depth": 2,
              "replies": [
                {
                  "id": "lbcw085",
                  "score": 0,
                  "body": "It's also only 50% of them that are taxed anyways. And this is outside of things like a TFSA which is what middle class people use.",
                  "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbcw085/",
                  "created": 1719960057,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbdnvus",
                      "score": 1,
                      "body": "Right! My portfolio is over $1.6 million and I started investing before TFSAs and have considerable capital gains. Between my wife and I, we could sell all of our positions in one year and each still be under $250k in capital gains.\n\nThe fact that conservative operatives (e.g. the National Post) have (financially-stunned) middle class folks simping for the rich on this issue is just so pathetic.",
                      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbdnvus/",
                      "created": 1719970955,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lbdp6eu",
                          "score": 0,
                          "body": "It's literally one of like three good things Justin did in 8 years, the simping for elites by our media is fucking wild",
                          "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbdp6eu/",
                          "created": 1719971468,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lbd3p1v",
          "score": 2,
          "body": "Lol, I am on Twitter and there are people from the States complaining about 15% cap. gains tax being a lot on their long-term hold (>1 year) is hilarious.",
          "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbd3p1v/",
          "created": 1719962962,
          "depth": 1,
          "replies": [
            {
              "id": "lbe3tut",
              "score": 2,
              "body": "The rule in Canada is that 66% of the gains are considered taxable, not a 66% tax rate. You’re comparing apples to oranges my friend.",
              "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbe3tut/",
              "created": 1719977723,
              "depth": 2,
              "replies": [
                {
                  "id": "lbe62rc",
                  "score": 1,
                  "body": "Yea, true.",
                  "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbe62rc/",
                  "created": 1719978793,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lbe25pd",
              "score": 0,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbe25pd/",
              "created": 1719976955,
              "depth": 2,
              "replies": [
                {
                  "id": "lbe2qhd",
                  "score": 1,
                  "body": "That's very short-sighted...and lower taxes for what?  Trump is going to tank the economy anyway so whatever tax savings will be offsetted by job losses because Americans will lose jobs again under him. [https://www.factcheck.org/2021/10/trumps-final-numbers/](https://www.factcheck.org/2021/10/trumps-final-numbers/)",
                  "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbe2qhd/",
                  "created": 1719977217,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbmp2mv",
                      "score": 0,
                      "body": "The job losses were because state legislatures implemented lockdowns during CoViD. It had nothing to do with Trump.",
                      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbmp2mv/",
                      "created": 1720116456,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lbb7v8j",
      "score": 10,
      "body": "This is an example of why most investment advice don’t register until the investor is knee deep into a situation.\n\nLet them/yourself make the mistakes, then it’ll resonate. Hopefully the mistakes aren’t so costly.",
      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbb7v8j/",
      "created": 1719940198,
      "depth": 0,
      "replies": [
        {
          "id": "lbbz1u1",
          "score": 4,
          "body": "You are completely right, that's why I always recommend to play with real money instead of paper money or something. You only learn if it's real. No theory or advice will be as effective as pain.",
          "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbbz1u1/",
          "created": 1719948971,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbf45yo",
      "score": 5,
      "body": "I am from Europe, but in my country you have special investment accounts where you only have to pay tax if you take it out of the investment account, however if you to transactions within that, you don't have to. And you have to take out more than you put in, in order for tax system to be triggered.\n\nAlso I'm pretty sure you might be misunderstanding \"If you aren't thinking about owning a stock for ten years, don't even think about owning it for ten minutes.\" - this has nothing to do with the tax. It's about whether you believe the company will perform well in the long run since otherwise you are just day trading according to random walk in the market.",
      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbf45yo/",
      "created": 1720000281,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbeq3wu",
      "score": 3,
      "body": "Holding and not triggering tax events is fine.  Enjoying compounding interest is fine.  However… there seem to be more and more frequent “resets” lately.  Giant ones.  Bubbles bursting and most recent Covid.  Taking 1-2 years for full recovery.  Essentially volatility has not only increased in frequency but also in magnitude.  “Holding” positions with significant gains through these periods just crushes your gains and you have to wait for it to regain… that’s if you don’t panic sell.  It’s a good thing to watch out for these events and slowly unload if you think there is one approaching.  Outside of being a US Senator with inside information… we’ve learned a lot about what sort of things trigger these events… I do believe one is on the horizon.  Don’t you?",
      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbeq3wu/",
      "created": 1719990326,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbaoqht",
      "score": 8,
      "body": "Tax is only important in terms of how it influences the price of the underlying asset, i.e. distortions. I'd not hold something to avoid paying CGT.",
      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbaoqht/",
      "created": 1719933983,
      "depth": 0,
      "replies": [
        {
          "id": "lbaqaan",
          "score": 5,
          "body": "I agree with your final sentence, I wouldn't hold a stock if I knew it was going to lose the coming years. Better to take the tax hit. But I don't generally agree, that tax is only important in how it influences the stock. To take a tax hit your stock should be really on the downtrend to sell. The tax hit could be bigger, than the stock lagging the index for 2-3 years.",
          "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbaqaan/",
          "created": 1719934497,
          "depth": 1,
          "replies": [
            {
              "id": "lbgjf9j",
              "score": 0,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbgjf9j/",
              "created": 1720022089,
              "depth": 2,
              "replies": [
                {
                  "id": "lbgn22b",
                  "score": 2,
                  "body": "„I am from Europe“",
                  "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbgn22b/",
                  "created": 1720023270,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbmpskq",
                      "score": 1,
                      "body": "You can do the same in a Stocks and Shares ISA. Or if you live in a different country in Europe, they probably have an equivalent.",
                      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbmpskq/",
                      "created": 1720116711,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lbbi1rg",
      "score": 4,
      "body": "Because of this I always try to take (more or less) exactly 1000€ in gains every year even if I don’t need it and then reinvest it. It‘s not a big saving but 250€ a year for only a few minutes of work is too good to pass up.",
      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbbi1rg/",
      "created": 1719943464,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbe3ebv",
      "score": 2,
      "body": "I'm down 18% on the year, sucks",
      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbe3ebv/",
      "created": 1719977522,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbl06t8",
      "score": 2,
      "body": "Yes. Be a long term investor.\n\nSelling is just a form of transfer from one asset type to another and there’s a cost for doing that. \n\nDon’t fall for cash for no reason. Sell only when there’s a reason to own cash.",
      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbl06t8/",
      "created": 1720092801,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbcggh7",
      "score": 2,
      "body": "Tldr taxes hurt",
      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbcggh7/",
      "created": 1719954565,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbftvml",
      "score": 1,
      "body": "It kind of depends on where you are in your journey.  I have a 401k, and that is my invest and forget account.  However, my goal is to retire early, in 3 years.  I need my brokerage account to fund my living until I have to take my RMDs.  I can't risk a 30%-50% market correction in that brokerage account right now.  So, I take profits and look for new entry points.  So far, I'm beating what I would get in a CD.  \n\nBut yes, if you're 5-7+ years out from needing the money, then aboslutely don't touch it.",
      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbftvml/",
      "created": 1720013252,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbh1vwt",
      "score": 1,
      "body": "Are you up YTD in performance or just dollar sense?\n\nSome apps only show the dollar change. Which is deposits and gains together. \n\nYou need to find your true YTD performance if this is the case.",
      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbh1vwt/",
      "created": 1720028079,
      "depth": 0,
      "replies": [
        {
          "id": "lbh4lq2",
          "score": 1,
          "body": "YTD in performance.",
          "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbh4lq2/",
          "created": 1720028960,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbauqgr",
      "score": -14,
      "body": "This is the benefit of living in dubai :D no capital gains tax, no income tax. So nice to not have to worry about taxes.",
      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbauqgr/",
      "created": 1719935943,
      "depth": 0,
      "replies": [
        {
          "id": "lbax56g",
          "score": 14,
          "body": "Or human rights.",
          "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbax56g/",
          "created": 1719936736,
          "depth": 1,
          "replies": [
            {
              "id": "lbaxrq7",
              "score": -19,
              "body": "Ahhh yes the classic uninformed, sheep response",
              "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbaxrq7/",
              "created": 1719936941,
              "depth": 2,
              "replies": [
                {
                  "id": "lbb2oyn",
                  "score": 11,
                  "body": "[https://cdn.walkfree.org/content/uploads/2023/11/14130735/gsi-country-study-uae.pdf](https://cdn.walkfree.org/content/uploads/2023/11/14130735/gsi-country-study-uae.pdf) - Modern Slavery In the UAE 2023",
                  "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbb2oyn/",
                  "created": 1719938542,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbf4spq",
                      "score": 1,
                      "body": "But slavery is for other people and not I.",
                      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbf4spq/",
                      "created": 1720000709,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lbb5hp1",
                      "score": -18,
                      "body": "Sooooo, what I just said",
                      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbb5hp1/",
                      "created": 1719939438,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lbaxwn7",
                  "score": 4,
                  "body": "Did your slaves write that response for you?",
                  "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbaxwn7/",
                  "created": 1719936985,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbaz4kw",
                      "score": 0,
                      "body": "Seriously though, where have you heard this? The news? Have you been to the country? The government has done a great job introducing fair laws and resources for workers. Your claims are simply wrong. I employ people within the country. There are some bad companies that do shady stuff but this is not the country itself doing these things.",
                      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbaz4kw/",
                      "created": 1719937381,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lbbc9hq",
                          "score": 8,
                          "body": "Graham, I have been and lived there. Do you know why you haven’t heard of all that? Because you form part of the privileged immigration (pretty sure you call yourself “expats”). Do you know who suffers the consequences the other redditor is talking about? The “browner” immigrants that you don’t see in your social circles. \n\nI know when you live in there it’s easier to convince yourself of how great it is (you get the same from “expats” living in KSA… ffs). But come on… using ANY of the gulf countries as an example of respect to human rights it’s so ridiculous that probably better to just laugh about it instead of thinking you truly believe it.",
                          "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbbc9hq/",
                          "created": 1719941614,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lbcwh3q",
                          "score": 0,
                          "body": "I've been to the country (went to visit Abu Dhabi and Dubai where my dad was working). There's literally 'definitely-not-slave' apartments right outside the city. tf you on?",
                          "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbcwh3q/",
                          "created": 1719960229,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lbdb764",
      "score": 0,
      "body": "This and last year were crazy. I'm up 41% ytd but I would sell things and did sell things if I find a better investment opportunity. Of course this doesnt count for my boring AW Etf.",
      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbdb764/",
      "created": 1719965883,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbf1rb8",
      "score": -1,
      "body": "I’m up 42% on trailing one year. Doing well but just wish I had had more money to invest 1-2 years ago 😅. I have bought my home so no need to stop the compounding anymore",
      "permalink": "/r/stocks/comments/1dto192/only_interrupt_compounding_unless_its_absolutely/lbf1rb8/",
      "created": 1719998577,
      "depth": 0,
      "replies": []
    }
  ]
}