{
  "title": "Investing in Snowflake stock now?",
  "score": 46,
  "selftext": "What do you guys think of buying snowflake here? I haven't invested in growth stocks in a long time, but i was looking at snowflake as a good new opportunity to reinvest. I work in Cloud Computing sector and snowflake is really really big in big multinational companies i also see many people migrating their data to snowflake. Just some anecdotal evidence, so this is where my interest is coming from in addition to the \"low\" price. So i'm wondering what you people think about investing in snowflake here?",
  "link_flair_text": null,
  "id": "1dtropu",
  "num_comments": 54,
  "created_utc": 1719941693,
  "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/",
  "comments": [
    {
      "id": "lbbex73",
      "score": 32,
      "body": "So funny how price action always leads sentiment. Did you feel this way when it was at 124 a week ago? I’ve been buying in the 130s and 120s for an average price of 131. If you truly believe and can stomach the volatility I think long term it’s a good bet for various reasons. But ask yourself why you interested after a rally to understand your inner thought process.",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbbex73/",
      "created": 1719942463,
      "depth": 0,
      "replies": [
        {
          "id": "lbbh24l",
          "score": 8,
          "body": "I know what you mean, but it wasn’t like that. It was just coincidence, because i sold my nvidia position last week or so and before i had no intend to look up new stocks because i was fully invested over the last years… so i get your notion but not the case in this case",
          "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbbh24l/",
          "created": 1719943143,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbgg5ix",
          "score": 3,
          "body": "I went in at 180, doubled down at 170, and added a little at just under 130 so my cost basis is 160.\n\nLittle jeal :)",
          "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbgg5ix/",
          "created": 1720021042,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbbhwda",
      "score": 12,
      "body": "As a longer term investor... some large holders   \nBuffet $874m, Sands Capital $734m, Baillie Gifford $436m, Ken Griffin $76.9m with some of their average buy price over $200, except Buffet.",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbbhwda/",
      "created": 1719943415,
      "depth": 0,
      "replies": [
        {
          "id": "lp518q4",
          "score": 3,
          "body": "Buffet sold Snow completely right?",
          "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lp518q4/",
          "created": 1727412789,
          "depth": 1,
          "replies": [
            {
              "id": "lu55sap",
              "score": 1,
              "body": "did he?",
              "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lu55sap/",
              "created": 1730101688,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lbbdt0w",
      "score": 40,
      "body": "Where on earth is this stock cheap / low in price? I just don’t get this market anymore.\n\nIf you like the business model go for it, but I see a market cap of 48bn with revenues below 3bn and losses every year.\n\nMight be that their tech is incredible and they will become a giant, but right now this stock is horrifically expensive, overpriced and pricing in hundreds of percents or growth over the next years. \n\nDefinitely possible, but if they do not perform they can easily go -90% to -95% within a short period if they miss earnings.",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbbdt0w/",
      "created": 1719942108,
      "depth": 0,
      "replies": [
        {
          "id": "lbcp3yq",
          "score": 5,
          "body": "Multinational companies just starting to shift towards it. Basically a whole new service being rolled out. Everyone is pushing it like crazy. \n\nI don't know what is going to happen, but I see how they think it is the future... At least at my workplace",
          "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbcp3yq/",
          "created": 1719957530,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbet0r7",
          "score": 7,
          "body": "15x sales is normal for a high growth cloud stock. Look at CRM and NOW historically.",
          "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbet0r7/",
          "created": 1719992318,
          "depth": 1,
          "replies": [
            {
              "id": "lbexd69",
              "score": 1,
              "body": "And now what?\n\nThe argument was not, that it’s impossible to live up to valuation. But it’s definitely not cheap and involves high risk, because the company needs to 10x their revenues and start making money, otherwise the Stockprice will implode.",
              "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbexd69/",
              "created": 1719995416,
              "depth": 2,
              "replies": [
                {
                  "id": "lbf2b0x",
                  "score": 5,
                  "body": "NOW (ServiceNow the company). If SNOW cut their r&d spend to zero they would be profitable already. Yes it's not cheap but people are willing to pay a premium for leading cloud companies with high margins, moats and large TAM.",
                  "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbf2b0x/",
                  "created": 1719998973,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lbfzfmh",
                  "score": 3,
                  "body": "Microsoft is at similar similar levels of EV/REVENUE with slower revenue growth and almost identical gross margin. \n\n\nNot saying that snow is cheap but it is not that outrageously overpriced as you think it is",
                  "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbfzfmh/",
                  "created": 1720015337,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lbhwpf2",
                  "score": 1,
                  "body": "Profitability might be a concern but price to sales multiple is in line with market. It has huge gross margin so it might be overpriced a bit but not outrageous as others have pointed it out. I was buying in $130s",
                  "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbhwpf2/",
                  "created": 1720038310,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lbbh8kz",
          "score": 6,
          "body": "That’s what the double quotes are for: “low”",
          "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbbh8kz/",
          "created": 1719943201,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbbxc2i",
      "score": 9,
      "body": "Ive added when it hit 129. Its like 10 times ntm revenue for  30% rev growth and > 30% fcf margin?  \n\nIts had a 15% runup since then so i dont know short term\n\nIf u work in the space what r ur thoughts on databricks or big tech like msft as competitors.",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbbxc2i/",
      "created": 1719948418,
      "depth": 0,
      "replies": [
        {
          "id": "lbcu4rx",
          "score": 8,
          "body": "Databricks is their biggest threat imo. The base tech is similar enough. Snowflake is trying to expand into the same sort of integrated developement and data product pipeline space that databricks is in more aggressively. I don't see much competition from big tech.",
          "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbcu4rx/",
          "created": 1719959365,
          "depth": 1,
          "replies": [
            {
              "id": "lbdm2ne",
              "score": 3,
              "body": "My plan is to buy databricks whenever it ipos. \n\nMy concern with big tech is their willingness to offer a cheaper alternative at a loss to tie companies into their eco system.  And companies willing to go with a slightly more mediocre product because it streamlines things.",
              "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbdm2ne/",
              "created": 1719970226,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lbhny72",
              "score": 2,
              "body": "For what it’s worth at my company we use both but for different use cases",
              "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbhny72/",
              "created": 1720035351,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lbdkff0",
          "score": 3,
          "body": "I think the pie is growing faster than either of them",
          "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbdkff0/",
          "created": 1719969563,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbed60p",
      "score": 9,
      "body": "-Huge, rapidly growing TAM\n\n-LLM catalyst that is just now starting to show up in SaaS\n\n-World class dollar net retention\n\n-Relationships with nearly all F500\n\n-Independent player to allow enterprises to avoid “vendor lock” from the major cloud providers\n\n-Genius CEO perfectly positioned to navigate the company through the AI revolution\n\nThis company has a decade long hyper growth phase ahead. Once it’s optimized for FCF generation it will be a money printing machine. 10 bagger in 10 years if they execute.\n\nMy second largest holding (9%) after AMZN.",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbed60p/",
      "created": 1719982432,
      "depth": 0,
      "replies": [
        {
          "id": "lshba9n",
          "score": 1,
          "body": "Oof has not aged well. Ur portfolio doing ok",
          "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lshba9n/",
          "created": 1729226586,
          "depth": 1,
          "replies": [
            {
              "id": "lujteh5",
              "score": 1,
              "body": "I bought in today I think a lot of positive tailwinds for this company",
              "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lujteh5/",
              "created": 1730307612,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lw9f203",
              "score": 1,
              "body": "The guy gave u a thesis for a decade of growth and you come here to thump him on the nose for a 10% loss in 3 months... if anyone is poor it's your angry butt lol",
              "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lw9f203/",
              "created": 1731166599,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lbf2crl",
      "score": 5,
      "body": "My opinion is that Snowflake will decline within the industry.  Open source table formats such as Apache Iceberg are gaining wide adoption and compatibility with tools. You no longer need a data warehouse and data lake. \n\nDatabricks is also catching up and just bought Tabular few weeks ago (leading Iceberg managed service). \n\nI'm not saying Snowflake will die tomorrow, but it will be a slow burn. People want control of their data, not sticking it in Snowflake managed data stores. I would stay away from Snowflake.",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbf2crl/",
      "created": 1719999008,
      "depth": 0,
      "replies": [
        {
          "id": "lbnkqko",
          "score": 5,
          "body": "I'm not super familiar with the data management so correct me if I'm wrong, but isn't there a rather large capital investment that comes along with being able to store your own data as a company. Like servers, real estate, extra employees etc... I would think some companies would and will always just rather outsource to snowflake or data bricks.",
          "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbnkqko/",
          "created": 1720127861,
          "depth": 1,
          "replies": [
            {
              "id": "lw9fgg2",
              "score": 1,
              "body": "Yup, same reason facebook uses zoom, while microsoft and google waste money on failed video platforms... its always a smart move to outsource what you don't have expertise on... any company wasting money to house their own data will lose when their competitors use snowflake for 1/3rd the price",
              "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lw9fgg2/",
              "created": 1731166733,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lbcugzz",
      "score": 3,
      "body": "I have also been accumulating shares the past 60 days. Valuation is obviously still high, but if you're buying this stock it's based on future growth potential and TAM, not on P/E like your average DOW stock. \n\n\nI remember 18 months ago when everyone on here was freaking out about Crowdstrike's valuation until the company executed and valuation came down. ",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbcugzz/",
      "created": 1719959491,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbdw4oh",
      "score": 3,
      "body": "Snowflake had a brilliant head start on a market with a limited moat. Now that the big3 clouds have caught up (with Redshift, Fabric/Synapse, BQ and Databricks in all of them), the argument to migrate to SF is slowly dissipating. Why spend on a platform that only does warehousing when you can stay inside clouds that do warehousing + everything else?\n\nI still think they’re a strong player in one of the most important spaces in the market right now, but IMO their biggest excess returns are behind them.",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbdw4oh/",
      "created": 1719974329,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbdsp88",
      "score": 2,
      "body": "It's interesting how price action always leads sentiment. Did you feel the same way when it was at 124 a week ago? I've been buying in the 130s and 120s, averaging at 131. If you genuinely believe in it and can handle the volatility, I think it's a good long-term bet for various reasons. But ask yourself why you're interested after a rally to understand your inner thought process.",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbdsp88/",
      "created": 1719972896,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbf7iac",
      "score": 2,
      "body": "AVGO will be a somewhat similar price after the upcoming split and you would be investing in a growing company that pays a healthy growing dividend and makes a massive profit already.\nI believe the growth for AVGO has just started but it's a company almost no one talks about.",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbf7iac/",
      "created": 1720002484,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbf80g5",
      "score": 2,
      "body": "I'm a big proponent of investing in what you know, and what you enjoy as a consumer.\n\nHowever, I see a company with increasing current liabilities and decreasing current assets, I see increasing R&D costs wiping out margins, I see big share repurchases with the little cash they have, decreasing net income YoY, decreasing EPS TTM, with an EPS miss in Q1.\n\nI don't know shit about cloud computing, but I don't like this company at all after looking at their 10-K and 10-Q. They have been unhinged this year in particular.",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbf80g5/",
      "created": 1720002799,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgm0wm5",
      "score": 2,
      "body": "Well sometimes the market provides opportunities, bought some initial position today let's see how it plays out.",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lgm0wm5/",
      "created": 1722867705,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbewa07",
      "score": 1,
      "body": "Why did you sell Nvidia ?",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbewa07/",
      "created": 1719994632,
      "depth": 0,
      "replies": [
        {
          "id": "lbexcdu",
          "score": 5,
          "body": "I just felt like it’s time to sell after 300% profit. Last cycle i bagholded stocks like this so wanted to learn from my mistakes",
          "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbexcdu/",
          "created": 1719995400,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbxdv39",
      "score": 1,
      "body": "Should have went last week when it was 20 dollars cheaper per share.",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbxdv39/",
      "created": 1720289830,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg3hwzz",
      "score": 1,
      "body": "Supporting AI is a game changer in the sense that there isn't a product out there that fits the need so there is going to be a lot of disruption in the storage space.\n\nYeah you can store AI data in Snowflake, but when you need to start tracking 10,000 plus decision trees everything out there starts to crack..\n\nAsk an AI to pick which baseball game to go to.. with your preferences like what teams you like, weather that day, traffic conditions, what pitcher will be starting, etc..\n\nThe amount of data vectors needed to train AI and the results of AI training is pretty massive and new storage formats are needed.\n\nA good example is going to the super market to buy ingredients to bake a cake. The supermarket could easily stock flour, sugar, milk and eggs.. But it is a lot more challenging to store prepackaged cake mixes for 20 different types of cakes or operate a bakery that makes cakes so you don't have to..\n\nPeople just want their cake and the faster the better..",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lg3hwzz/",
      "created": 1722576404,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbejzxx",
      "score": 1,
      "body": "I will never invest in a company which has been reporting consistent losses for last 4 years.",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbejzxx/",
      "created": 1719986373,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbdas5q",
      "score": -1,
      "body": "No thanks. I have always thought Palantir will be the winner in this space",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbdas5q/",
      "created": 1719965718,
      "depth": 0,
      "replies": [
        {
          "id": "lbdh85b",
          "score": 8,
          "body": "Are they in the same space?",
          "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbdh85b/",
          "created": 1719968274,
          "depth": 1,
          "replies": [
            {
              "id": "lbdkg1q",
              "score": 16,
              "body": "Not at all",
              "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbdkg1q/",
              "created": 1719969570,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lbdy583",
              "score": 9,
              "body": "Snowflake\n- **Primary Focus**: Cloud-based data warehousing and analytics.\n- **Key Features**: \n  - Data storage, processing, and analytics\n  - Scalability and performance for large datasets\n  - Seamless data sharing and collaboration\n  - Integration with various BI tools\n  - Data governance and security\n- **Target Users**: Data engineers, data analysts, businesses looking for scalable data storage and analytics solutions.\n\n### Palantir\n- **Primary Focus**: Data integration, analytics, operational intelligence, and AI-driven insights.\n- **Key Features**: \n  - **Palantir Foundry**: Data integration, management, and analytics platform.\n  - **Palantir Gotham**: Designed for government agencies and large enterprises for intelligence and operations.\n  - **Palantir AIP (Artificial Intelligence Platform)**: Provides advanced AI capabilities to help organizations build, deploy, and manage AI models.\n    - Integration of AI/ML models into workflows\n    - Real-time data processing and decision-making\n    - Enhanced data analytics and insights\n    - Support for custom AI applications\n- **Target Users**: Government agencies, large enterprises, organizations with complex data integration, analytics, and AI needs.\n\n### Overlap\n- **Analytics and Insights**: Both Snowflake and Palantir (with AIP) offer robust analytics capabilities. Snowflake provides a strong foundation for data storage and basic analytics, while Palantir’s AIP enhances these capabilities with advanced AI/ML functionalities.\n- **Data Integration**: Palantir’s platforms, particularly Foundry, excel in integrating disparate data sources, which can complement Snowflake's data warehousing.\n- **Customer Base**: Both target large enterprises and organizations needing sophisticated data solutions, but Snowflake is more focused on modernizing data infrastructure, while Palantir, with AIP, emphasizes advanced AI-driven decision-making and operational intelligence.\n\n### Competition\n- **Analytics and Insights**: Both platforms compete in providing data analytics, but Palantir’s AIP adds a layer of advanced AI/ML capabilities that Snowflake does not inherently possess.\n- **AI and Machine Learning**: Palantir AIP provides tools to build, deploy, and manage AI models, giving it an edge in organizations looking for integrated AI solutions. Snowflake, while powerful in data analytics, often relies on integrations with other AI/ML tools rather than providing built-in AI capabilities.\n- **Data Integration and Management**: Palantir's strength in integrating various data sources and enabling complex data analytics through its platforms (Foundry, Gotham, AIP) can be seen as complementary to Snowflake's data warehousing.\n\n### Complementary Aspects\n- Organizations might use Snowflake for its robust data warehousing and basic analytics while leveraging Palantir AIP for more advanced AI/ML analytics and operational intelligence.\n- Snowflake’s scalable and performant data storage could serve as the foundation upon which Palantir’s AI and operational intelligence capabilities are built.\n\nIn summary, while there is a competitive aspect between Snowflake and Palantir, especially with the introduction of Palantir's AIP, they also have complementary strengths. Snowflake provides powerful data warehousing and analytics, whereas Palantir, particularly with AIP, offers advanced AI capabilities and sophisticated data integration and operational intelligence solutions.",
              "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbdy583/",
              "created": 1719975178,
              "depth": 2,
              "replies": [
                {
                  "id": "lq8u76i",
                  "score": 2,
                  "body": "nice chatgdp",
                  "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lq8u76i/",
                  "created": 1728011089,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lm3rpvg",
          "score": 1,
          "body": "Not at all.   *an echo",
          "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lm3rpvg/",
          "created": 1725799002,
          "depth": 1,
          "replies": [
            {
              "id": "lm4cg71",
              "score": 1,
              "body": "Let's talk about how PLTR just got added to the s&p500 and snow is.....?",
              "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lm4cg71/",
              "created": 1725806351,
              "depth": 2,
              "replies": [
                {
                  "id": "lm4kg8h",
                  "score": 1,
                  "body": "I dont need to talk about PLTR since I own a lot more PLTR vs SNOW  but still surprised SNOW has stumbled so much... but they are not in the same space..at all..",
                  "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lm4kg8h/",
                  "created": 1725808877,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lbd5747",
      "score": 0,
      "body": "God no, unless you wamt to be exit liquidity for institutions. There's a reason that they did an ipo",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbd5747/",
      "created": 1719963540,
      "depth": 0,
      "replies": [
        {
          "id": "lbesswa",
          "score": 2,
          "body": "It IPO'd nearly four years ago...",
          "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbesswa/",
          "created": 1719992164,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbddfjn",
      "score": 0,
      "body": "Nope.",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lbddfjn/",
      "created": 1719966767,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lberkis",
      "score": 0,
      "body": "Its too late if ur asking. Gotta get in before people talk about it.",
      "permalink": "/r/stocks/comments/1dtropu/investing_in_snowflake_stock_now/lberkis/",
      "created": 1719991308,
      "depth": 0,
      "replies": []
    }
  ]
}