{
  "title": "Porsche holding extremly undervalued?",
  "score": 61,
  "selftext": "Most of us probably know that Porsche is somehow involved in owning itself through Volkswagen. For those who don’t know (I don’t really understand it either), there are two kinds of Porsche stocks.\n\nThe first one is the manufacturing company, Porsche AG, with the ticker symbol $P911, which is primarily owned by Volkswagen.\n\nThen there is another Porsche stock, $PAH3, which is a holding company that owns the majority of Volkswagen stock.\n\nPorsche Holding is extremely undervalued with a P/E ratio of 2.53, which is even lower than the P/E ratio of Volkswagen and much lower than the P/E of $P911.\n\nCan someone explain to me why Porsche Holding is so cheap? When buying this stock, it essentially means buying the Porsche manufacturing company at a 30-40% discount, plus you also get the other stocks that Volkswagen owns.\n\nTL;DR: $PAH3 is extremely cheap, or I’m highly regarded (maybe both).\n",
  "link_flair_text": "Discussion",
  "id": "1dtun9j",
  "num_comments": 28,
  "created_utc": 1719949055,
  "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/",
  "url_overridden_by_dest": "https://i.redd.it/vf6n5a9lr5ad1.jpeg",
  "comments": [
    {
      "id": "lbbzbwn",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 2 months ago\n**Total Comments** | 3 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbbzbwn/",
      "created": 1719949061,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbc2y98",
      "score": 26,
      "body": "[removed]",
      "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbc2y98/",
      "created": 1719950230,
      "depth": 0,
      "replies": [
        {
          "id": "lbcwtu6",
          "score": 6,
          "body": "idk man they just legalised the good stuff, we’re one magic eye away from po",
          "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbcwtu6/",
          "created": 1719960357,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbddh86",
          "score": 2,
          "body": "You’re legally not allowed to show a graph of a stock hockeysticking in DE so all companies need to make sure they don’t",
          "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbddh86/",
          "created": 1719966784,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbd1h2o",
      "score": 15,
      "body": "3 seperate companies.\nThe reason Porsche Holdings SE is priced 1/10 Of their actual book value and has a very low pe is simply Because Of low shareholders returns. The majority owners is the Porsche family, who apperantly prefers being rich this way while maintaining power as They have more Than 50% Of the voting rights Of Volkswagen,  instead Of being rich on paper. \nMight be a strategy to avoid high inheritance taxes too, who knows.",
      "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbd1h2o/",
      "created": 1719962113,
      "depth": 0,
      "replies": [
        {
          "id": "lbd1xyu",
          "score": 6,
          "body": "I should add that by Low shareholder returns I mean that they are litteraly spending Almost the entire cashflow They bring in, and the remaining money goes to paying down debt that They have. So no real shareholder returns in the near future years, unless They stop the spending, or randomly decides to liquidate the company or buy their own shares (which is what I think They should do, makes the most sense since their stock is so cheap).\n\nThey do have a dividend tho, mostly from Volkswagen which isn’t exactly the most future proof company right now, atleast by the markets opinion, so all in all the lack Of returns, risky with VW, and owners with non-Financial interested with the company makes it hard to buy, hence the rebate",
          "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbd1xyu/",
          "created": 1719962293,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbc2e9x",
      "score": 7,
      "body": "You said it yourself: it owns different companies. Maybe check assets of the holding more, then come back?\n\n[www.porsche-se.com/en/company/investments](https://www.porsche-se.com/en/company/investments)\n\nOther factors may include:\n\n1) Investor deterring effect of the complex ownership, as investors would prefer simpler structures.\n\n2) Holding company discount which occurs when a holding has companies under its umbrella, the sum of individual companies can be higher than value of holding company due to inefficiencies. (Not sure if it would apply here)",
      "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbc2e9x/",
      "created": 1719950054,
      "depth": 0,
      "replies": [
        {
          "id": "lbc41mz",
          "score": 7,
          "body": "I know about holding company discout, but i understand it usually happens when holding company owns multiple stocks in multiple different ereas, but here porsche holding has stake only in other car companies",
          "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbc41mz/",
          "created": 1719950579,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbc3ido",
          "score": 4,
          "body": "Why is that a problem? More stocks more money, just kiding.",
          "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbc3ido/",
          "created": 1719950408,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbcy8si",
      "score": 3,
      "body": "Because VW is one of those companies that does not care about its shareholders or stock price at all.",
      "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbcy8si/",
      "created": 1719960882,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbf2393",
      "score": 3,
      "body": "The spin-out Porsche AG is the interesting one. They're a leader in EV with the most green patents submitted and accepted over the last few years out of any car company. They're also the co-owners of Rimac and Bugatti.\n\nThe Rimac Nevera is arguably the best EV on the market and it's the current record holder for almost every performance record a car can have.\n\nThe Porsche Taycan is the best EV on the market that is mass produced.\n\nThe hybrid tech that went into the new 911 GTS is what hybrids should have been in the first place. It perfectly fills the performance gaps of the ICE. And we will see this approach maximized in the Bugatti Tourbillon, which will likely smash the performance records of the Nevera and stay at the top until the energy density of batteries improves further. \n\nJust the fact they were able to make these hybrids lighter and consume the same amount of fuel or less is a testament to their engineering brilliance. \n\nThe future is bright. \n\nI have the same reservations about the holding btw. The way the Piech and Porsche families cling to power with their special shares that guarantee them minority control of the company is very unappealing.",
      "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbf2393/",
      "created": 1719998818,
      "depth": 0,
      "replies": [
        {
          "id": "lbfkh0d",
          "score": 3,
          "body": "I think that EVs are overpriced and the sentiment is soon going to change. IMO hybrids are the best solution in the near future and as mentioned above porsche makes great hybrids and also great EV but also great ICEs.\nPorsche holding is a great way to gain exposure to porsche AG for a lot cheaper",
          "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbfkh0d/",
          "created": 1720009340,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lg684da",
      "score": 3,
      "body": "I went through the same thought process. I was looking at Volkswagen stock, its recent drop looks interesting if you're looking to buy undervalued. Already with the mindset that Volkswagen and Porsche are two bookmark companies that will stay around for a while, I just found it even more profitable to buy Porsche SE (OTC:POAHY). Even if the book value gap is ignored, I still think that Volkswagen and Porsche as companies have a lot of upside. In my opinion, too much negativity has been thrown at the automotive sector and people sell from the fear. I guess we'll see where this goes.",
      "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lg684da/",
      "created": 1722620202,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbeiy5l",
      "score": 2,
      "body": "China is their growth market, but is down 12% for 2023 (significantly worse if you look at H2 alone, since H1 was up 8%). There are signs this is more structural than transient, they could be in real trouble (too early to tell).\n\n\nThe days of having performance bragging rights for expensive cars is over, when you can make BEVs with absurd performance for pretty cheap.",
      "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbeiy5l/",
      "created": 1719985746,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbf0zr4",
      "score": 2,
      "body": "It should be said a lot of people think Porsche is the most valuable car company, and considering the level of their cars it can be argued that that’s true considering their halo car the 911 can be bought and sold as an appreciating asset , as opposed to a regular car being a depreciating asset",
      "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbf0zr4/",
      "created": 1719998029,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leov5tu",
      "score": 2,
      "body": "I am -20% on PAH3. I regret ever getting into this story.",
      "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/leov5tu/",
      "created": 1721819496,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbejm1c",
      "score": 1,
      "body": "The ADR that you can buy in the US is $POAHY. I’m all in on this",
      "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbejm1c/",
      "created": 1719986140,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbfy8am",
      "score": 1,
      "body": "its also on the OTC Pinks.. Weirdly enough. No Options on the OTC.",
      "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbfy8am/",
      "created": 1720014903,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu9rdgq",
      "score": 1,
      "body": "![img](emote|t5_2th52|4640)",
      "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lu9rdgq/",
      "created": 1730161883,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbcchwc",
      "score": 1,
      "body": "how come porche market cap is more valuable than VW market cap; when porche own only 30% of VW ? i don't get it.",
      "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbcchwc/",
      "created": 1719953290,
      "depth": 0,
      "replies": [
        {
          "id": "lbciwjw",
          "score": 2,
          "body": "because Porsche owns other things too...",
          "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbciwjw/",
          "created": 1719955384,
          "depth": 1,
          "replies": [
            {
              "id": "lc5ogy0",
              "score": 2,
              "body": "i think all the other holdings in their website don't amount to 1B, while VW alone is worth 50B, it's safe to say the other holdings are negligible",
              "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lc5ogy0/",
              "created": 1720421465,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lbell46",
          "score": 2,
          "body": "Idk where you’re getting your numbers from but $VWAGY is 58b EUR, $POAHY is 6.4b EUR. Porsche SE $POAHY also owns 12.5% of Porsche AG which makes the actual cars, it has 5.7b EUR of net debt. This comes out to Porsche SE currently trading at 38% of its net asset value.",
          "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbell46/",
          "created": 1719987371,
          "depth": 1,
          "replies": [
            {
              "id": "lc5o91f",
              "score": 1,
              "body": "P911 (porche) is $70.16 B ad VOW3 (VW) is $59.87 B",
              "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lc5o91f/",
              "created": 1720421324,
              "depth": 2,
              "replies": [
                {
                  "id": "lekaluq",
                  "score": 1,
                  "body": "P911 is porsche AG, this post is about porche SE which owns VW which owns porsche AG",
                  "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lekaluq/",
                  "created": 1721751069,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lbexx0l",
      "score": -2,
      "body": "Sometimes things are cheap for a reason. Germans lost northstream and are out of energy, in addition cars with big gasoline engine are getting replaced by EV, which is not the speciality of germans. Investing in any German stocks - specifically the car manufacturers - is extremely risky for me (and I mean risky in the way you are almost sure to lose, not the usual may win may lose way).",
      "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbexx0l/",
      "created": 1719995812,
      "depth": 0,
      "replies": [
        {
          "id": "lbfhori",
          "score": 2,
          "body": "Porsche specifically makes if not the best EV on the market, then one of the very best, it's just expensive; and they also interestingly make a profit off it, something many manufacturers struggle to do (ofc, with the prices of a Taycan, you know).\n\nVW has their ID EV platform which is now in it's second iteration delivering some nice EVs, and I see an increasing number of them around my city these days, as well as EV Audis (also VW owned), and with a 25K fully featured EV with a decent battery size supposed to be released next year.\n\nImo the price of the holding company reflects a level of negativity towards VW / Porsche which is excessive and that's where I see an opportunity.",
          "permalink": "/r/wallstreetbets/comments/1dtun9j/porsche_holding_extremly_undervalued/lbfhori/",
          "created": 1720008034,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}