{
  "title": "Paramount shares pop 9% on news of preliminary Skydance Media deal ",
  "score": 38,
  "selftext": "Paramount shares surged 9% in after-hours trading Tuesday after reports emerged that David Ellison’s Skydance had reached a preliminary deal to acquire the media company’s controlling shareholder, National Amusements, and thus control of Paramount.\n\nThe preliminary agreement, reported by The New York Times and the Wall Street Journal, would mark a rapid resurrection of a previously failed deal between Skydance and National Amusements, which is controlled by Shari Redstone.\n\nThe specific terms of the deal could not be learned by the Journal or the Times.\n\nThe previous deal between the two would have given Redstone $2 billion, with Skydance buying out roughly half of Paramount’s controlling shares for $4.5 billion, along with a $1.5 billion cash payment to go towards Paramount’s balance sheet, CNBC reported earlier.\n\nA spokesperson for Paramount declined to comment. Representatives for Skydance and National Amusements, which is controlled by Redstone, did not immediately return a request for comment.\n\nNational Amusements, the Redstone family’s holding company, has referred the deal to the Paramount special committee, which is tasked with reviewing bids for the company, the Journal reported citing people familiar with the matter. Other interested bids included a joint effort from private equity firm Apollo and Sony, as well as a recent entreaty from Barry Diller, chairman of media conglomerate IAC as well as a former Paramount executive.\n\nRedstone abruptly ended negotiations between Skydance and National Amusements last month, just as the two sides were near the finish line. The winding deal process had already led to the departure of CEO Bob Bakish earlier this year, leaving in place a three-headed office of the CEO to run the company.\n\nSource: https://www.cnbc.com/2024/07/02/paramount-shares-pop-9percent-on-news-of-preliminary-skydance-media-deal.html",
  "link_flair_text": null,
  "id": "1dtzu13",
  "num_comments": 4,
  "created_utc": 1719962689,
  "permalink": "/r/stocks/comments/1dtzu13/paramount_shares_pop_9_on_news_of_preliminary/",
  "comments": [
    {
      "id": "lbdfrae",
      "score": 14,
      "body": "Couple of teases these two are...",
      "permalink": "/r/stocks/comments/1dtzu13/paramount_shares_pop_9_on_news_of_preliminary/lbdfrae/",
      "created": 1719967686,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbea3nk",
      "score": 6,
      "body": "Ellison has now agreed bought National Amusements which controls 77% of Paramount Global.\n\n[LA Times: David Ellison agrees to buy Redstone family firm that controls Paramount](https://www.latimes.com/entertainment-arts/business/story/2024-07-02/david-ellison-agrees-to-buy-redstone-family-firm-national-amusements-paramount)",
      "permalink": "/r/stocks/comments/1dtzu13/paramount_shares_pop_9_on_news_of_preliminary/lbea3nk/",
      "created": 1719980804,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbdqrp2",
      "score": 5,
      "body": "Maybe now they can afford to make an app that isn't a total piece of shit. Bought all of the Star Trek physical media so I wouldn't have to deal with it anymore.",
      "permalink": "/r/stocks/comments/1dtzu13/paramount_shares_pop_9_on_news_of_preliminary/lbdqrp2/",
      "created": 1719972107,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbfnu0j",
      "score": 2,
      "body": "\"The winding deal process had already led to the departure of CEO Bob Bakish earlier this year, leaving in place a three-headed office of the CEO to run the company.\"\n\nA company whose stock has gone nowhere for decades replacing an absurdly overpaid one with three co-CEOs certainly has the best interests of the shareholders in mind, I'm sure lol. They should have let Diller buy National Amusements although I'm sure IAC shareholders wouldn't be thrilled.",
      "permalink": "/r/stocks/comments/1dtzu13/paramount_shares_pop_9_on_news_of_preliminary/lbfnu0j/",
      "created": 1720010806,
      "depth": 0,
      "replies": []
    }
  ]
}