{
  "title": "Ford sales edge 1% higher in the second quarter, led by trucks ",
  "score": 66,
  "selftext": "Ford sales rose 1% during the second quarter over the year-earlier period, led by a 5% gain in truck sales, the automaker said Wednesday.\n\nFord truck sales, which include pickups and vans, totaled 308,920 vehicles during the period, the company’s best second-quarter performance for the category since 2019, Ford said. Sales in its F-Series totaled 199,463 vehicles.\n\nSales of Ford electric vehicles totaled 23,957 during the second quarter, up 61%. The automaker said its EVs, in particular the Mustang Mach-E and F-150 Lightning, are drawing new customers to the company.\n\nMeanwhile, sales of hybrid vehicles totaled 53,822, an increase of 56% and a new quarterly sales record for Ford since it began offering hybrid models more than 20 years ago, it said. Automakers including Ford have been leaning on hybrids to ease the EV transition and help achieve tightening federal fuel efficiency standards.\n\nThe update comes a day after Ford’s crosstown rival General Motors reported second-quarter sales that rose 0.6% from a year earlier. GM said total sales of 696,086 made for its highest quarterly sales mark since the fourth quarter of 2020.\n\nEven modest sales increases for both Ford and GM outpace expectations for the overall market. Auto industry forecasters including Cox Automotive and Edmunds expect second-quarter sales industrywide to be roughly flat year over year.\n\nSource: https://www.cnbc.com/2024/07/03/ford-sales-q2-2024.html",
  "link_flair_text": null,
  "id": "1duhbjq",
  "num_comments": 16,
  "created_utc": 1720020870,
  "permalink": "/r/stocks/comments/1duhbjq/ford_sales_edge_1_higher_in_the_second_quarter/",
  "comments": [
    {
      "id": "lbgibb2",
      "score": 36,
      "body": "They gotta count trucks and EVs delivered to a dealership as a sale regardless if it’s actually sold to an actual buyer or not. Every dealership has tons of inventory and days on market are insanely high. Especially in non fleet vehicles. Unless someone drastic changes those vehicles will continue to sit and inventory will continue to get higher. It’s a huge house of cards with shady accounting.",
      "permalink": "/r/stocks/comments/1duhbjq/ford_sales_edge_1_higher_in_the_second_quarter/lbgibb2/",
      "created": 1720021736,
      "depth": 0,
      "replies": [
        {
          "id": "lbhcy6h",
          "score": 9,
          "body": "I think most brands except toyota has many weeks of supply sitting at dealers. Too bad I want a hybrid rav4 which I think is like the most poplar hybrid suv. Lol maybe toyota will eventually have this problem and I can buy one under msrp",
          "permalink": "/r/stocks/comments/1duhbjq/ford_sales_edge_1_higher_in_the_second_quarter/lbhcy6h/",
          "created": 1720031676,
          "depth": 1,
          "replies": [
            {
              "id": "lbhm68l",
              "score": 2,
              "body": "I haven’t followed Toyota as much as the other manufacturers but from what I’ve seen, even they at least have vehicles on the lot now. Not as bad as the big three though.",
              "permalink": "/r/stocks/comments/1duhbjq/ford_sales_edge_1_higher_in_the_second_quarter/lbhm68l/",
              "created": 1720034749,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lbgj5bc",
          "score": -2,
          "body": "Almost time for another bailout...",
          "permalink": "/r/stocks/comments/1duhbjq/ford_sales_edge_1_higher_in_the_second_quarter/lbgj5bc/",
          "created": 1720022001,
          "depth": 1,
          "replies": [
            {
              "id": "lbgo7cx",
              "score": 7,
              "body": "EV subsidy is basically cash for clunkers already, wouldn't be surprised to see it extended to all vehicles. Regular hard-working Americans buying $90k F-150s are struggling and they need government help.",
              "permalink": "/r/stocks/comments/1duhbjq/ford_sales_edge_1_higher_in_the_second_quarter/lbgo7cx/",
              "created": 1720023641,
              "depth": 2,
              "replies": [
                {
                  "id": "lbhaber",
                  "score": 9,
                  "body": "Is this sarcasm? The solution is not to buy $90k trucks. I drove past a Toyota dealership and a TACOMA IS $70K. No way, I’ll keep driving my Accord.",
                  "permalink": "/r/stocks/comments/1duhbjq/ford_sales_edge_1_higher_in_the_second_quarter/lbhaber/",
                  "created": 1720030815,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbhgpba",
                      "score": 4,
                      "body": "Jesus also drove an Accord but the bible says he never spoke of it.",
                      "permalink": "/r/stocks/comments/1duhbjq/ford_sales_edge_1_higher_in_the_second_quarter/lbhgpba/",
                      "created": 1720032917,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lbgjqfo",
              "score": 0,
              "body": "My belief is this was their plan when they signed that terrible contact with the union. They knew they would do this to inflate sales figures with artificially high prices, to pump the stock price and then when sales inevitably fall off this coming quarter or the one after, they file for bankruptcy and/or renegotiate with the union. If sales don’t drop off even with the astronomically high prices then it’s a win for them too.",
              "permalink": "/r/stocks/comments/1duhbjq/ford_sales_edge_1_higher_in_the_second_quarter/lbgjqfo/",
              "created": 1720022188,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lbimb9d",
              "score": 1,
              "body": "You mean ford that was not bailed out as i remember?",
              "permalink": "/r/stocks/comments/1duhbjq/ford_sales_edge_1_higher_in_the_second_quarter/lbimb9d/",
              "created": 1720047498,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lbhbq2r",
      "score": 4,
      "body": "There is a shocker.......we cut almost our entire car line up, and now trucks are leading us.....",
      "permalink": "/r/stocks/comments/1duhbjq/ford_sales_edge_1_higher_in_the_second_quarter/lbhbq2r/",
      "created": 1720031270,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbi483w",
      "score": 2,
      "body": "the lightning is bad ass. if you're in the market for a truck, and can set up a charging station at your home, go test drive one.",
      "permalink": "/r/stocks/comments/1duhbjq/ford_sales_edge_1_higher_in_the_second_quarter/lbi483w/",
      "created": 1720040836,
      "depth": 0,
      "replies": [
        {
          "id": "lbj7b5o",
          "score": 0,
          "body": "Last I heard, their tow range was incredibly low. Something like 15% of their regular range.",
          "permalink": "/r/stocks/comments/1duhbjq/ford_sales_edge_1_higher_in_the_second_quarter/lbj7b5o/",
          "created": 1720056100,
          "depth": 1,
          "replies": [
            {
              "id": "lblv6aw",
              "score": 0,
              "body": "Where did you hear that statistic?",
              "permalink": "/r/stocks/comments/1duhbjq/ford_sales_edge_1_higher_in_the_second_quarter/lblv6aw/",
              "created": 1720105974,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lbj5fe2",
      "score": 0,
      "body": "The competition is coming right boys?",
      "permalink": "/r/stocks/comments/1duhbjq/ford_sales_edge_1_higher_in_the_second_quarter/lbj5fe2/",
      "created": 1720055301,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbj16cy",
      "score": -4,
      "body": "Their trucks are junk . Six guys in our company drive fords . Brand new truck alternator goes out after six months . Another one has 45,000 on it and it sounds like a diesel when you start it . The guy that had the nicest one had to trade it cause ford couldn’t fix the death wabble . They get recall notices all the time",
      "permalink": "/r/stocks/comments/1duhbjq/ford_sales_edge_1_higher_in_the_second_quarter/lbj16cy/",
      "created": 1720053516,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbn0r0t",
      "score": 1,
      "body": "Love the div. ",
      "permalink": "/r/stocks/comments/1duhbjq/ford_sales_edge_1_higher_in_the_second_quarter/lbn0r0t/",
      "created": 1720120610,
      "depth": 0,
      "replies": []
    }
  ]
}