{
  "title": "SoftBank stock hits its first record high in 24 years — Arm and AI helped it get there  ",
  "score": 48,
  "selftext": "SoftBank Group shares hit a record high on Thursday, just as the company’s massive tech investment arm shows signs of recovery and its outspoken founder Masayoshi Son emerged back into the public spotlight to align the Japanese giant to a future in artificial intelligence.\n\nThe firm has also been helped by the public market success of British chip designer Arm, in which Softbank has a majority stake.\n\nShares of the Japanese giant closed at a record high of 11,190.00 Japanese yen on Thursday — a far cry from the dotcom crash of the early 2000s and a more recent downturn for the company during the tech market troubles of 2021 and 2022.\n\nSoftBank’s journey to the peak\n\nSon founded SoftBank in 1981, back when the company distributed software. It went public in Japan in 1994, and, amid the internet boom, made a $2 million investment in Yahoo in the middle of that decade.\n\nThat started off the company’s tech investments.\n\nThe rise of the internet and of Yahoo pushed SoftBank’s stock to a peak closing price of 10,111.1 yen on Feb. 18, 2000. Three days prior, the firm’s shares had hit an intraday high of 11,000 yen.\n\nAs internet stocks came crashing down, so too did SoftBank’s share price, which at one point sank more than 90% below its dotcom peak.\n\nIt wasn’t until nearly 21 years later, on Feb. 16, 2021, that SoftBank exceeded its previous record-high close.\n\nVision Fund\n\nThe recent rise to a share price peak has been volatile since Son positioned SoftBank as a visionary pioneer with the 2017 launch of a massive technology investment arm — the Vision Fund.\n\nSoftBank made dozens of bets on tech companies across the world, some of which turned sour. Office sharing startup WeWork was perhaps among the highest-profile names. But some of SoftBank’s investments in Chinese firms also took a hit after Beijing kicked off its crackdown on the domestic tech sector at the end of 2020.\n\nAfter lingering near then-record highs in March 2021, SoftBank’s stock fell sharply, alongside other global tech stocks. The Vision Fund posted then-record financial losses in 2022. Son said that SoftBank would go into “defense” mode and be more conservative with its investments. He changed tack shortly after the Vision Fund posted a record $32 billion loss in 2023, saying that the company would now shift into “offense,” because he was excited about the investment opportunities in AI.\n\nSoftBank’s share price began a recovery from around May 2023, and the Japanese titan’s Vision Fund more recently posted better financials amid broader tech stock recoveries.\n\n“Softbank Vision Fund had to write down various investments due to a combination of equity values declining and a tougher private financing environment. It looks like the write down cycle is mostly done, and there is a good chance that the IPO market will be more constructive going forward, especially for AI related investments,” Oliver Matthew, head of Asian consumer research at CLSA, told CNBC by email.\n\nArm chip boost\n\nSeveral analysts attributed SoftBank’s recent share price bump of around 78% in the year to date to the IPO success of Arm, which it acquired in 2016.\n\nSoftBank owns roughly 90% of Arm even after the listing. Arm shares are up nearly 124% alone this year, as of the close on July 3.\n\n“SoftBank Group’s investment strategy and focus has long included the development of an AI ecosystem portfolio, long before the LLM (large language model)-driven bull cycle in AI-related names over the last 18 months or so,” Paul Golding, senior U.S. lifestyle and payments analyst at Macquarie U.S. equity research, told CNBC by email.\n\n“This vision, in our view, likely drove some of the investment decision in 2016 to acquire Arm, giving SoftBank Group direct exposure to semiconductor market dynamics and ownership of intellectual property around semiconductor design well ahead of broader progress in AI use-cases and platforms.”\n\nSoftBank shares “have been benefitting from this vis-à-vis well-publicized” uses for Arm intellectual property, such as in the automotive industry or cloud data center, Golding added.\n\nDo investors believe the SoftBank story?\n\nOver the years, investors have focused on whether SoftBank Group’s valuation fairly reflects the assets it is invested in or holds.\n\nFor example, SoftBank’s valuation is around $101.5 billion. Arm’s market capitalization is around $176 billion — meaning that SoftBank’s 90% stake is equivalent to about $158 billion of that figure. That alone is significantly above SoftBank Group’s overall valuation, without taking into account the company’s other holdings and businesses, such as its telecommunications arm.\n\nAnalysts cite this as a reason why SoftBank’s share price does not reflect its fair value.\n\nDan Baker, senior equity analyst at Morningstar, said a lot of SoftBank’s price appreciation comes down to Arm.\n\n“I’m not sure that investors are convinced by the SoftBank story again,” Baker told CNBC by email, adding that this year’s share gain is “primarily” because Arm stock has risen, while the Japanese yen has weakened. Baker said it is worth looking at the so-called sum-of-the-parts (SOTP) valuation, which ascribes value to the various parts of SoftBank’s holdings to figure what the company is worth. Baker said the SOTP valuation remains just under 50% this year, meaning SoftBank’s stock does not truly reflect the value of its various businesses and investments.\n\n“So I’m not sure that investors are ‘buying the SoftBank story’ but investors are certainly buying the ARM story,” Baker said.\n\nInvestors have also cheered the fact that SoftBank has sold practically all of its shares in Alibaba, the Chinese e-commerce giant that Son backed in 2000.\n\nSoftBank has also likely been helped by a recent broader rise in Japanese stocks, with the Nikkei 225 Index up 22% this year alone as of Thursday.\n\nArtificial super intelligence\n\nBut can Son’s focus on AI boost SoftBank’s value further and close the discount to its basket of assets?\n\nThe SoftBank founder, who has been out of the public spotlight in the last year, recently spoke about his excitement over the future of AI and how SoftBank can be at the center of this technology with its investment in companies like Arm.\n\nSon last month laid out his vision for a world featuring what he dubbed as artificial super intelligence, or ASI, which would be 10,000 times smarter than humans.\n\nIt comes at a time when investors are feverishly looking at how to play the AI boom, with the parabolic rise of Nvidia’s stock price underscoring the excitement around the technology.\n\nCLSA’s Matthew said SoftBank’s discount could reduce, going forward, thanks to some of the company’s early AI investments.\n\n“Softbank has been absolutely consistent about its investment direction; they were among the earliest investors behind the AI theme, and in some ways too early so many investors thought they were overpaying, or buying into certain companies where it wasn’t clear how AI was related,” Matthew said.\n\n“As a result, Softbank Group shares trade at a surprisingly wide discount to its fair value, and we believe this discount will narrow in the future.”\n\nSource: https://www.cnbc.com/2024/07/04/softbank-shares-hit-record-high-after-24-years-on-arm-and-ai-boost.html",
  "link_flair_text": null,
  "id": "1dv8hml",
  "num_comments": 7,
  "created_utc": 1720103951,
  "permalink": "/r/stocks/comments/1dv8hml/softbank_stock_hits_its_first_record_high_in_24/",
  "comments": [
    {
      "id": "lbpagy1",
      "score": 5,
      "body": "Oh, so ARK must be back up as well, due to AI?\n\n\nOh, no its still at 1/3 its peak.",
      "permalink": "/r/stocks/comments/1dv8hml/softbank_stock_hits_its_first_record_high_in_24/lbpagy1/",
      "created": 1720156144,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbnaazg",
      "score": 3,
      "body": "I see 50 as it's all time high and it's last close was 33.35",
      "permalink": "/r/stocks/comments/1dv8hml/softbank_stock_hits_its_first_record_high_in_24/lbnaazg/",
      "created": 1720124077,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbpxyc9",
      "score": 2,
      "body": "It took 24 fking years you believe this shit",
      "permalink": "/r/stocks/comments/1dv8hml/softbank_stock_hits_its_first_record_high_in_24/lbpxyc9/",
      "created": 1720171638,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbuzw47",
      "score": 2,
      "body": "Masayoshi San. This guy. Ugh.\nTell him Newman called, he wants to buy WeWork back.",
      "permalink": "/r/stocks/comments/1dv8hml/softbank_stock_hits_its_first_record_high_in_24/lbuzw47/",
      "created": 1720248219,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbncnk5",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1dv8hml/softbank_stock_hits_its_first_record_high_in_24/lbncnk5/",
      "created": 1720124922,
      "depth": 0,
      "replies": [
        {
          "id": "lbnm0dm",
          "score": 0,
          "body": "/s?",
          "permalink": "/r/stocks/comments/1dv8hml/softbank_stock_hits_its_first_record_high_in_24/lbnm0dm/",
          "created": 1720128347,
          "depth": 1,
          "replies": [
            {
              "id": "lbnv9g0",
              "score": 2,
              "body": "You’ve deleted your comment while I typed this up but let’s address your questions in order: 1. Why not just buy a ETF? You’re on the /r/Stocks subreddit, if you see no value in picking individual stocks, you’re in the wrong place.  2. The purpose of buybacks are generally not to cash in on a low valuation, but a tool to redistribute profits. In the case of SoftBank, the potential profits are not yet realized, hence the speculation portion of the post.  3. Nvidia is not the only listed company with “pricing power”. It’s an odd comparison but let’s consider it. ARM currently holds a near monopoly of commercial processor architecture with no competition in sight, while nvidia has a current market lead in its own field but with wealthy potential competitors edging closer each day. In my view, based on current offerings and competitors, ARM is more likely to retain their monopoly in the long run, and is much less reliant on the success of AI",
              "permalink": "/r/stocks/comments/1dv8hml/softbank_stock_hits_its_first_record_high_in_24/lbnv9g0/",
              "created": 1720131995,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lca26x7",
      "score": 1,
      "body": "The funny thing about softbank is a lot of the money they blew through was evil Saudi blood money. I'm surprised the Saudis have allowed Son to live.",
      "permalink": "/r/stocks/comments/1dv8hml/softbank_stock_hits_its_first_record_high_in_24/lca26x7/",
      "created": 1720485313,
      "depth": 0,
      "replies": []
    }
  ]
}