{
  "title": "Duolingo is worth buying",
  "score": 40,
  "selftext": "The language learning market leader has a lot of competitive advantages.\n\nIt has a network effect and virtuous circle from its Learning and Investment Flywheels. \n\nDUOL's market leadership in language learning will continue to propel its growth, faster than rivals Rosetta Stone and Babbel. \n\nThe company's business model of gamifying education and leveraging social media are unique.\n\nDuolingo has very strong operational leverage, throwing up gobs of cash. \n\nDuolingo's adjusted earnings are growing at a very rapid rate making it attractive even at at a stock price of $195.\n\nMy average price is around $198, and I continue to add on declines.",
  "link_flair_text": "Company Discussion",
  "id": "1dw229w",
  "num_comments": 97,
  "created_utc": 1720196984,
  "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/",
  "comments": [
    {
      "id": "lbrwlwt",
      "score": 233,
      "body": "I‘ve used it for 400 days. It’s good for learning random vocabulary, not for actually learning the language.",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbrwlwt/",
      "created": 1720201719,
      "depth": 0,
      "replies": [
        {
          "id": "lbslb4q",
          "score": 68,
          "body": "yup - to learn a language you gotta be immersed in it. Theres youtube channels like Dreaming Spanish which are much better at teaching spanish just by watching people talk in basic spanish and mime what they're saying.",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbslb4q/",
          "created": 1720210011,
          "depth": 1,
          "replies": [
            {
              "id": "lbso5ae",
              "score": 9,
              "body": "Thanks for the channel recommendation! Will check it out!",
              "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbso5ae/",
              "created": 1720210975,
              "depth": 2,
              "replies": [
                {
                  "id": "lbxnhch",
                  "score": 3,
                  "body": "De nada mijo",
                  "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbxnhch/",
                  "created": 1720293200,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbzpekn",
                      "score": 3,
                      "body": "¿Papá? ¿Volviste de comprar leche y cigarrillos? 🥹",
                      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbzpekn/",
                      "created": 1720322853,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lbs346d",
          "score": 26,
          "body": "The founder of Duolingo has also said that you aren't gonna be fluent off just using Duolingo, that's not necessarily their goal",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbs346d/",
          "created": 1720203876,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbv69g7",
          "score": 7,
          "body": "Duolingo only teaches you how to choose from a word Bank. I found that the best resource to learn language is something like Pimsleur, where you hear audio in the native language at your level, and also your language to explain what is talking about. Basically comprehensive input.",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbv69g7/",
          "created": 1720252581,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbzbft6",
          "score": 2,
          "body": "the muskrat favors the elders in the battle of wyoming is not a sentence I ever needed to learn.   \nIt seriously gives the most random shit lol. Babel is so much better. Pimsleur is good and if you have the cash preply is nice for a tutor.",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbzbft6/",
          "created": 1720316634,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc0dsk3",
          "score": 1,
          "body": "It's decent as a supplemental tool that you use for ten minutes whilst waiting for a train or sitting on the toilet. My Norwegian teacher said she noticed some improvement when I started using it.\n\nLike you say, you'll never learn a language using it exclusively.",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lc0dsk3/",
          "created": 1720337030,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbsillt",
      "score": 18,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbsillt/",
      "created": 1720209085,
      "depth": 0,
      "replies": [
        {
          "id": "lbxg18v",
          "score": 3,
          "body": "Also will be excited to see what they can do with generative ai models so that a person can immerse themselves with the language.",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbxg18v/",
          "created": 1720290573,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbsuowy",
      "score": 11,
      "body": "I have been seeing alot of middle aged people using it and are stick with it. Even younger people are using it. Might be a good buy, maybe a little risky.",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbsuowy/",
      "created": 1720213239,
      "depth": 0,
      "replies": [
        {
          "id": "lbt2mjo",
          "score": 2,
          "body": "I agree with this.",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbt2mjo/",
          "created": 1720216090,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbv6c8y",
      "score": 6,
      "body": "Trading at 14x sales, growing revenue at 20%, operating margin under 17% and that's non-GAAP, and *success means a customer doesn't need them anymore*.  \n\nI'll pass, thanks.",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbv6c8y/",
      "created": 1720252638,
      "depth": 0,
      "replies": [
        {
          "id": "lbz8l5y",
          "score": 2,
          "body": "*Great* point on success.",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbz8l5y/",
          "created": 1720315412,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc0e6hc",
          "score": 2,
          "body": ">*success means a customer doesn't need them anymore*\n\nThe same issue that the dating apps have.",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lc0e6hc/",
          "created": 1720337297,
          "depth": 1,
          "replies": [
            {
              "id": "lc0fbvi",
              "score": 2,
              "body": "Yeah and it's an even stronger effect because people aren't likely break up with or cheat on the first new language they learned.",
              "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lc0fbvi/",
              "created": 1720338110,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lbryqaw",
      "score": 30,
      "body": "I tried increasing my German fluency with Duolingo. Waste of time. Then I just bought all 7 Harry Potter books in German and spent a couple months reading them. Went to Germany to work for 3 months. Bam, I was deemed as a fluent German speaker afterwards. ",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbryqaw/",
      "created": 1720202416,
      "depth": 0,
      "replies": [
        {
          "id": "lbtcvn3",
          "score": 20,
          "body": "What did you do when you didn’t know a word in German while reading Harry Potter?",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbtcvn3/",
          "created": 1720220032,
          "depth": 1,
          "replies": [
            {
              "id": "lbtg8wr",
              "score": 26,
              "body": "I knew some German. I was at a B1 proficiency or something at that point from high school German class. \n\n\nI was still clueless about halfway through the first book. Started making some sense by the end. By the fourth book I was familiar with almost every word. \n\n\nThat's what reading is. That's how I learned English as a child, just by picking up books that were too difficult for me and going for it. Same practice in German. Familiarity breeds understanding in the long-run. ",
              "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbtg8wr/",
              "created": 1720221382,
              "depth": 2,
              "replies": [
                {
                  "id": "lbua4n1",
                  "score": 5,
                  "body": "That's f*cking beautiful.",
                  "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbua4n1/",
                  "created": 1720234158,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbwbuvf",
                      "score": 2,
                      "body": "Charity shop, and books for primary school kids. I bought a load of Swedish comic books so the picture helps guide me along then moved to proper books later. Same with things like food packaging you have some clues to the context of what you’re trying to read so you can stumble through it faster",
                      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbwbuvf/",
                      "created": 1720276275,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lbwt8e5",
                  "score": 1,
                  "body": "Thank you for your comment. Did you read Harry Potter the first time in English? I think if you know the plot then that helps quite a bit as you piece things together, just as you said.\n\nSince you had a B1 foundation it gave you a good base to understand the missing parts. I think B1 is semi fluent? C1 is basically fluent.",
                  "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbwt8e5/",
                  "created": 1720282718,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbwzxlp",
                      "score": 2,
                      "body": "Yeah I was at C1 by the end of it. A little past after I dated a German guy for a few months who filled in all the cultural gaps and helped with my speaking/listening ability. I did read Harry Potter quite a lot as a child so the plot was quite familiar beforehand. \n\n\nBest way to learn a language fluently though imo. I had a Kindle paperwhite with a dictionary on it from like 2018 or something, so I would occasionally click on the word if I saw it very frequently. But I definitely didn't click on all the words I didn't understand. Maybe 1/10 of them. ",
                      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbwzxlp/",
                      "created": 1720285119,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lbtzob6",
          "score": 13,
          "body": "This works if you are already somewhat fluent in it. Person with zero German knowledge would benefit more from Duolingo",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbtzob6/",
          "created": 1720229579,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbwp4aw",
          "score": 1,
          "body": "Was considering doing just that for Spanish. Glad to see it works!",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbwp4aw/",
          "created": 1720281212,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbrz1f1",
      "score": 30,
      "body": "Duolingo subscriber here (yes I pay for it, and yes it works, kind of). The gamification isn't compelling for me and I don't find the social network effects very strong. The only psychology thing they do that compels me is the streak. I've got 305 days in a row. \n\nAn obvious risk to them is that they really, really push a specific social agenda; like way outside the usual demographics of western society. This is probably not going to be attractive to non western customers (most of the world). Another risk is that once a customer is finished learning they're gone permanently, which is completely different than other investment opportunities like amazon or MSFT (as examples, not advice)\n\nI've never used the competitors, so I can't speak to that.\n\nI have no idea what \"investment flywheels\" and \"virtuous learning\" means. Are you making this up, or is that something they are saying?\n\nYou can't just say \"EPS goes up so its a buy\". Also, what is the \"rapid rate\" of increase. Perhaps throw in a % for plebs like me.\n\nI don't understand what \"operational leverage throwing up gobs of cash\" means. Are you trying to say \"strong free cash flow\"?\n\nHow do you know 198 is a good price? A hunch? What stops it going to $50?",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbrz1f1/",
      "created": 1720202521,
      "depth": 0,
      "replies": [
        {
          "id": "lbtcrct",
          "score": 4,
          "body": "EPS can be pushed up while ROIC deteriorates which means the quality of the business is actually going down.",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbtcrct/",
          "created": 1720219985,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbs8ojt",
          "score": 0,
          "body": "You do realize the Streaks feature is gamification, right?",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbs8ojt/",
          "created": 1720205695,
          "depth": 1,
          "replies": [
            {
              "id": "lbsn55n",
              "score": -6,
              "body": "My point is that the gamification isn't that effective on ME. I'm aware the streak is gamification, I care about the streak because language learning requires daily effort and it helps keep me going every day.",
              "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbsn55n/",
              "created": 1720210633,
              "depth": 2,
              "replies": [
                {
                  "id": "lbsptff",
                  "score": 11,
                  "body": "My point is is that what you say makes no sense. You are admitting gamification is the reason you use Duolingo daily and then say gamification isn't that effective on you. You either don't understand what gamification is or you are just in denial.",
                  "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbsptff/",
                  "created": 1720211555,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbt0xtu",
                      "score": 8,
                      "body": "Sounds like effective gamification to me :)",
                      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbt0xtu/",
                      "created": 1720215476,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lbts9yx",
                          "score": 1,
                          "body": "It's textbook gamification. Highly effective. Especially when the user has convinced themselves that the action that is being gamified is actually beneficial to them so they will happily spend 400+ days in a row tying their value and dopamine loop to using the app. Even after they do stop using the app, months or years later when their body is looking for something \"positive\" to do they are way more likely to use duolingo once again because their body remembers the feel good hits it got from using the app.",
                          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbts9yx/",
                          "created": 1720226373,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lk1s4pi",
                              "score": 1,
                              "body": "Hey that's why I went back to MMO's in my late 30s!",
                              "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lk1s4pi/",
                              "created": 1724695622,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lbsuz2s",
                      "score": 2,
                      "body": "Big fan of gamification? You’re maybe being a bit precious.\n\nThere is a lot more gamification in the app: score boards, prizes, boosts. All insignificant to me (and seemingly others).\n\nI agree with the point they are trying to make - the streak is the only part that keeps me using it and engaged. Once I’ve done my lesson for the day, I’m done.",
                      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbsuz2s/",
                      "created": 1720213338,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lbsz8j5",
                      "score": 1,
                      "body": "Look, this isn't hard. You're the only person struggling with this.\n\nDuolingo Gamification is not a compelling investment thesis for me. Any of their competitors can replicate this feature tomorrow. Its not a moat.\n\n We're talking about investing here not whether I'm in denial.\n\nI'm not going to respond anymore. Have a nice day.",
                      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbsz8j5/",
                      "created": 1720214862,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lbtm702",
                          "score": 1,
                          "body": "I’m not struggling with anything. I’m just trying to educate you on what gamification is but you are all up in your feelings.  ",
                          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbtm702/",
                          "created": 1720223805,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lbt3u5s",
      "score": 4,
      "body": "I use Duo but i more often use Babbel Live, AI can't replace having legit conversations with people in the language you want to learn with a teacher willing to correct you and teach you local slang and vocabulary",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbt3u5s/",
      "created": 1720216527,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbtjvct",
      "score": 4,
      "body": "I think there’s going to be two types of people. Those who rely on AI to speak and understand a language and those who don’t.\nIf you think the value of learning a language and being able to speak it will be wiped because of AI, I think you’re wrong.\n\nPeople still and will prefer to connect more with those who understand a language by themselves even in the coming AI era. \nFor work or short term interactions, using AI is totally fine. But if you ask people if they want to become a friend with someone that requires AI help all the time to communicate, I don’t think many people will say yes. \n\nIn fact I believe being able to speak a language will be a more important ability and status once realtime and continuous interpretation becomes a thing and everyone has access.\n\nI could be dead wrong, it’s just a guess :))",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbtjvct/",
      "created": 1720222853,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lby691t",
      "score": 4,
      "body": "These guys are bullish on Duolingo $DUOL since it was at $177 levels with a 'Buy' rating and a $219 target - [https://baptistaresearch.com/product/duolingo-inc/](https://baptistaresearch.com/product/duolingo-inc/) ... Quite a detailed report but mostly focuses on how they'll grow through Max tier subscriptions and personalized learning focus through Gen AI to grow top-line",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lby691t/",
      "created": 1720300053,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbwzmle",
      "score": 3,
      "body": "The goal is to propel learning. I used it for about 2 and a half months before coming to Florence Italy with no Italian on a university trip. Its helped me greatly! Being here and applying it is where I find the language sticking, but this case is the case for all forms of learning. Duolingo shouldn’t be frowned upon at all, but it will not solely allow fluency",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbwzmle/",
      "created": 1720285011,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbrpyny",
      "score": 18,
      "body": "Duolingo is going to be put out of business with AI",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbrpyny/",
      "created": 1720199476,
      "depth": 0,
      "replies": [
        {
          "id": "lbrsuml",
          "score": 10,
          "body": "Can you elaborate? It seems like a business that’s not that threatened by AI. Most people aren’t going to go prompt an AI for a language learning program.",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbrsuml/",
          "created": 1720200459,
          "depth": 1,
          "replies": [
            {
              "id": "lbtczt1",
              "score": 6,
              "body": "He won’t elaborate. It’s a superficial comment about AI",
              "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbtczt1/",
              "created": 1720220078,
              "depth": 2,
              "replies": [
                {
                  "id": "lbv2vlb",
                  "score": 3,
                  "body": "No need to elaborate.  AI is the perfect solution for everything.  Don't believe me?  AI.",
                  "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbv2vlb/",
                  "created": 1720250221,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lby8rwm",
                  "score": 1,
                  "body": "Something like Talkpal.ai is already miles better and more useful than Duolingo. Engaging & fun. Roles option is just amazing ",
                  "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lby8rwm/",
                  "created": 1720300991,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lbrw53u",
              "score": 8,
              "body": "it will once Ai can have conversations in that language",
              "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbrw53u/",
              "created": 1720201564,
              "depth": 2,
              "replies": [
                {
                  "id": "lbs5j9f",
                  "score": 16,
                  "body": "Actually in Duolingo they already have a “video call with Lily” feature that lets you do exactly this. You can have conversations with a character in the app.",
                  "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbs5j9f/",
                  "created": 1720204676,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbwogmk",
                      "score": 1,
                      "body": "Is it good? Does the AI answer fast? Not useful if it takes 5 secs to talk back no?",
                      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbwogmk/",
                      "created": 1720280972,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lc0gd1g",
                          "score": 4,
                          "body": "The AI answers pretty fast and I have no problem with the reaction time at all. However, it’s lacking in other areas. You can’t go back to review the conversation later. You can’t save new words etc. The feature is lacking in other ways.",
                          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lc0gd1g/",
                          "created": 1720338829,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lc71gur",
                              "score": 1,
                              "body": "I think ChatGPT is working on this 'memory' element, which is that the AI remembers past conversations you ask them, and so it becomes and more fine-tuned to you over time.",
                              "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lc71gur/",
                              "created": 1720448383,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lby95vf",
                  "score": 1,
                  "body": "You can have conversation with AI already. I am using talkpal.ai and you can have conversation about anything, have certain roles etc",
                  "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lby95vf/",
                  "created": 1720301136,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lbz8j0r",
              "score": 1,
              "body": "How is it \\*not\\* threatened by AI? AI can already translate almost any language, in speech, nearly instantaneously. There's no need to learn new languages when everyone is carrying around a universal translator. I actually like DuoLingo and their mission, but to me it's dead in the water with emerging tech.",
              "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbz8j0r/",
              "created": 1720315385,
              "depth": 2,
              "replies": [
                {
                  "id": "lk21noc",
                  "score": 1,
                  "body": "There isn't any emerging tech where you're going to get a language chip implant into your brain where AI autotranslates for you. Google translate already exists for what you're describing on a casual basis and none of that touches on actual language learning and why people do it.\n\nIn fact, Duo as an online tool with a very well known cast of characters that can be used in conjunction WITH AI makes them much more likely to utilize AI to improve their business not the other way around",
                  "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lk21noc/",
                  "created": 1724698718,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lbrufka",
              "score": -1,
              "body": "They will because then it becomes personal. The program can be tailored to your level, interests, using techniques effective for you, and narratives you can relate to. Every human is different, why should they all learn the same way?",
              "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbrufka/",
              "created": 1720200996,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lbrv0ct",
              "score": -11,
              "body": "Because two people can now just talk with their phone as the middle man translator. Its still a new technology but watch ChatGPT4 translator videos. I dont think as many people will bother trying to learn new languages when their phone can translate way faster with virtually no effort",
              "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbrv0ct/",
              "created": 1720201187,
              "depth": 2,
              "replies": [
                {
                  "id": "lbs2qiw",
                  "score": 10,
                  "body": "Google translate has already existed for ages",
                  "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbs2qiw/",
                  "created": 1720203751,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lbrwxqx",
                  "score": 0,
                  "body": "Google Translate has been around longer than Duolingo and that hasn’t stopped DUO so far. What you’re describing also requires the user to actively create their own conversation with ChatGPT instead of passively playing a game that teaches them a new lesson. Maybe I’m missing something here though",
                  "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbrwxqx/",
                  "created": 1720201826,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbrxmyy",
                      "score": -1,
                      "body": "Google translate isnt nearly as efficient as the new software thats out there but i dont care where you put your money. Im just informing OP of whats out there",
                      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbrxmyy/",
                      "created": 1720202058,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lbrynda",
                          "score": 4,
                          "body": "But people actually want to learn the language.  I don’t think there’s as many people using duolingo currently purely so they can communicate with someone, but rather to embrace a culture whether their own or another.  You don’t sign up for duolingo cus ur going to France next year and you wanna speak French",
                          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbrynda/",
                          "created": 1720202389,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lbs14kp",
                              "score": -1,
                              "body": "Ive never met a single person who has used duolingo and is fluent in another language. I know plenty who “use” it but cant hold any type of convo in the language they practice. But go ahead and invest in duolingo, id bet my left nut it doesn’t beat the market after 5 years",
                              "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbs14kp/",
                              "created": 1720203228,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lbskb0b",
                                  "score": 1,
                                  "body": "You are missing the point. I’m not arguing about the stock, I won’t invest in it.  You just clearly don’t understand the target market or why someone would use it / why AI isn’t a replacement for it.  Similar to how AI won’t be a replacement for the arts.",
                                  "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbskb0b/",
                                  "created": 1720209666,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lbslx2d",
                                      "score": 0,
                                      "body": "Youre clearly missing the point of this being a stock subreddit. My point still stands of duolingos business model going down due to future innovations",
                                      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbslx2d/",
                                      "created": 1720210218,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lbsnm9s",
                                          "score": 0,
                                          "body": "I need to personally invest in the stock to comment on its business model?  You can’t comprehend its target market, therefore I pointed it out.  You also clearly can’t comprehend my argument.",
                                          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbsnm9s/",
                                          "created": 1720210795,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lbs7m2h",
          "score": 5,
          "body": "Duolingo is already using AI in the app and will continue to do so. Is it possible for another company to create a better language learning app with AI? Of course, but as a language learning enthusiast, I haven’t seen any serious contenders yet. As a daily user who likes the app, I’ll keep an eye on the competition but I’ll hold the stock for now.",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbs7m2h/",
          "created": 1720205344,
          "depth": 1,
          "replies": [
            {
              "id": "lby9ltv",
              "score": 2,
              "body": "Talkpal.ai is a decent competitor ",
              "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lby9ltv/",
              "created": 1720301302,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lbw8wkz",
          "score": 2,
          "body": "Duolingo utilizes AI for some of its features, it’s not going to be put out of business by AI.  But that said, the P/E is 200, which sounds way overpriced to me.",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbw8wkz/",
          "created": 1720275119,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbv3cy0",
          "score": 0,
          "body": "Wrong",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbv3cy0/",
          "created": 1720250549,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbupkey",
      "score": 5,
      "body": "I used it a lot some years ago and it was great.\n\n\nUnfortunately the current version is trash: over-gamified, too many interruptions about streaks and bets and shops and gems and PLEASE BUY PREMIUM. \n\n\nSince I never spent a cent on it while using it for hours many years back, I wanted to give something back and went and tried the paid version. Also garbage, it just replaces some nagging with different nagging. Unsubscribed & uninstalled. \n\n\nI would not recommend 2024 Duolingo to anybody, not as a stock and not as a language learning app. I guess it got destroyed by the need to monetize, marketing professionals replacing passionate people, founders cashing out - just the usual enshittyfication.",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbupkey/",
      "created": 1720241878,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbv3h0q",
      "score": 2,
      "body": "People here saying it doesn't work: maybe it's you? Duolingo is based on an academic method paid for and promoted by the EU for learning languages. This isn't some BS some random person came up with.",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbv3h0q/",
      "created": 1720250628,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbtjh1j",
      "score": 1,
      "body": "no, it isnt going to grow",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbtjh1j/",
      "created": 1720222688,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbv8koj",
      "score": 1,
      "body": "This is about the stock. We need to understand the numbers. Why are so many people discussing duolingo as an app? \n\nAs long as the numbers are good, we can contemplate buying.",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbv8koj/",
      "created": 1720254234,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbvdglt",
      "score": 1,
      "body": "I used it for two weeks a year ago and never again. Good luck. ",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbvdglt/",
      "created": 1720257713,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbvsl4p",
      "score": 1,
      "body": "Not a good experience. I wouldn’t touch it.",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbvsl4p/",
      "created": 1720267610,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbwo8ct",
      "score": 1,
      "body": "I'm still waiting for a ChatGPT-like tutor. Something like seen in the movie 'Her' or in 'Iron Man'.  \nThe user experience should be like meeting a human teacher who's also a buddy:  \n- 'hi buddy, what did are we studying today?'  \n- 'Can we redo some of the conversations of yesterday? I don't feel I grasped them well'  \n- 'I'm traveling soon, please let's focus on travel and tourism related questions'",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbwo8ct/",
      "created": 1720280888,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbyox2m",
      "score": 1,
      "body": "Duolingo is great until you’re too lazy or too tired or realized you’re just good to have one second language",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbyox2m/",
      "created": 1720307359,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbz1mbh",
      "score": 1,
      "body": "Nah",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbz1mbh/",
      "created": 1720312489,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbrsj3q",
      "score": 1,
      "body": "The people I know who used the service have dropped it specifically because of the AI.",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbrsj3q/",
      "created": 1720200354,
      "depth": 0,
      "replies": [
        {
          "id": "lbruowi",
          "score": 1,
          "body": "What do you mean? Is there any AI used in Duolingo?",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbruowi/",
          "created": 1720201083,
          "depth": 1,
          "replies": [
            {
              "id": "lbryqwh",
              "score": 5,
              "body": "There is. There’s some exercises where you just have a conversation. You can say whatever and AI just carries on a conversation with you.\n\nAnd sometimes when you get something wrong AI can tell you in more detail what concept you’re struggling with rather than just a generic “your answer is wrong and here’s the correct answer.”\n\nBoth of those seem like weird reasons to stop using Duolingo. And both are only available if you pay for the most expensive subscription package.",
              "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbryqwh/",
              "created": 1720202422,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lbrw3qn",
              "score": 1,
              "body": "Yeah they laid off some people for it.",
              "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbrw3qn/",
              "created": 1720201551,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lbsp7tt",
      "score": 1,
      "body": "Good app, but not worth 8B",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbsp7tt/",
      "created": 1720211347,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbt5ov3",
      "score": 1,
      "body": "Duolingo sucks, it’s too curated when some flexible prompts for ChatGPT can teach you grammar, vocabulary and most importantly context",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbt5ov3/",
      "created": 1720217224,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbs5klt",
      "score": 0,
      "body": "If you write this in a language you learnt for\n It I’ll buy 10000 shares",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbs5klt/",
      "created": 1720204688,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbtoy0o",
      "score": 0,
      "body": "Isn't it free how does it make money",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbtoy0o/",
      "created": 1720224960,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbsmt84",
      "score": -4,
      "body": "I think it's a stupid buy. LLMs and technology are advanced enough that all you need is a smartphone to communicate with with any common language in the world",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbsmt84/",
      "created": 1720210520,
      "depth": 0,
      "replies": [
        {
          "id": "lbtd9yn",
          "score": 2,
          "body": "Of course translators and interpreters already exist but those don’t put the language skills in your head",
          "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbtd9yn/",
          "created": 1720220191,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbsaalx",
      "score": -5,
      "body": "Naaaaa, with the rise of LLMs, I do not think it is a good idea. One can replace duolingo with easy prompts in chatgpt.",
      "permalink": "/r/stocks/comments/1dw229w/duolingo_is_worth_buying/lbsaalx/",
      "created": 1720206234,
      "depth": 0,
      "replies": []
    }
  ]
}