{
  "title": "[deleted by user]",
  "score": 186,
  "selftext": "[removed]",
  "link_flair_text": null,
  "id": "1dwwkrt",
  "num_comments": 58,
  "created_utc": 1720291671,
  "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/",
  "comments": [
    {
      "id": "lby3zn3",
      "score": 230,
      "body": "Is anyone really surprised by this? I expect Indian companies to be as sound of an investment as Chinese companies. Their goal is not to generate shareholder value, but rather for the insiders and managers to extract as much money from the public as possible.",
      "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lby3zn3/",
      "created": 1720299230,
      "depth": 0,
      "replies": [
        {
          "id": "lbyegl2",
          "score": 39,
          "body": "Ahhthe old popcorn maneuver, clever girl.",
          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbyegl2/",
          "created": 1720303166,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbydiq5",
          "score": 41,
          "body": "uh... i'm not sure if this is deliberately ironic, but most \"shareholders\" are institutions, c-suite, and \"insiders,\" who, in American companies, are very much actively just trying to extract value from the public since our government refuses to acknowledge that century old regulations and deregulation don't work in the digital age.",
          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbydiq5/",
          "created": 1720302796,
          "depth": 1,
          "replies": [
            {
              "id": "lbyimqs",
              "score": 22,
              "body": "Can you explain to me how an institution that owns shares in a company extracts value from the public? I’m curious the details I’ve never heard about this :(",
              "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbyimqs/",
              "created": 1720304833,
              "depth": 2,
              "replies": [
                {
                  "id": "lbyqmhu",
                  "score": -19,
                  "body": "how much time you got?",
                  "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbyqmhu/",
                  "created": 1720308047,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbyr5sr",
                      "score": 22,
                      "body": "Enough. Go on please",
                      "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbyr5sr/",
                      "created": 1720308267,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lbzd27i",
                          "score": 9,
                          "body": "“Wealthy investors are just clipping coupons.”\n\nJ Biden",
                          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbzd27i/",
                          "created": 1720317331,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lbyt25y",
                          "score": 5,
                          "body": "Buy low, sell high. Collect dividends in between.",
                          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbyt25y/",
                          "created": 1720309039,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lbz4vae",
                      "score": 11,
                      "body": "Oh I’m all ears bud I can’t wait like u/saynotobrooms said - hit us with it baby. I’m ready to learn",
                      "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbz4vae/",
                      "created": 1720313818,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lbzaeb4",
                          "score": -5,
                          "body": "got distracted hosting at my place but i'll come back to this...\n\nI'm honestly just weirdly shocked multiple people don't know how predatory capitalism works in the U.S. on this sub of all places. We literally gamble on it weekly",
                          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbzaeb4/",
                          "created": 1720316189,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lbzelt9",
                              "score": 13,
                              "body": "If it’s so easy just explain  it :)",
                              "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbzelt9/",
                              "created": 1720318008,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lbzz4e5",
                                  "score": 18,
                                  "body": "Until the late 90’s, the standards for a company’s stock being listed on the exchanges were significantly tighter. A track record of profitability, solid leadership, manageable debt, etc. Things that proved that your money was really being invested, not speculated. \n\nThat practice shifted over time as investment banks like Goldman Sachs and Morgan Stanley started focusing on taking companies public. Because being part of that early syndicate is WILDLY profitable, and involves fewer clients (cost) than something like retail banking. As other firms saw the profitability of taking riskier companies public, they also started dropping their requirements so they could get in on the action. \n\nFast forward 30 years, and the result has been a gradual, but notable decline in quality of what hits the market. $DJT is at best a legal bribe, and more likely a money laundering scene to avoid campaign finance laws. $UBER would never have gone public in the 80’s, and god knows how many meme stocks would have been delisted by now. \n\nBut nobody cares. Because it’s not the company’s profitability, or earnings reports, or Sharpe ratio that drives investors to buy a stock anymore…it’s future growth. Not earnings, not dividends, just growth. Hype. These companies don’t sell products, they sell share prices. It’s why executives will lay off employees after a good, but not stellar quarter, or EVERY company starts throwing out the hottest buzzwords at the same time (.com, quantum, machine learning, blockchain, AI…);  because the analysts expect them to. Doesn’t matter if the quarterly reports still showed profits or not, companies always have to be promising future growth, or else the analysts will change their outlook. And that’s everything to corporate leadership. Stock packages make up the majority of how the executives are paid, so it’s in their interest to make the number go up, even if it harms the company’s product and profitability in the long run ($GE is a PERFECT case study for this).\n\nIt’s turned the entire market into a greater fool’s game, with everyone playing hot potato with overpriced securities. And with wealth management companies like BlackRock and Vanguard making it easy for trillions in client’s retirement money to be invested for them, companies just stopped caring; after all, it’s not THEIR money at risk. Not really. \n\nBut how does this practice “extract value from the public?” For starters, with the erosion of things like pensions and Social Security, and the subsequent rise of 401ks and IRA’s, the shift of responsibility for retirement has moved from employers to the employees. Trillions of dollars worth of retirement savings have been reallocated from bonds and Treasuries to riskier investments like equities, and in some cases, options. \n\nIn a nutshell, corporations “extract value from the public” by literally taking a cut at every step. Investment banks take their percentage when taking companies public, who then sell to mutual fund companies who take THEIR cut in management fees, who contract with retirement plans who charge fees of their own; all while the underlying companies their portfolios are based on are fighting every day to make their share price go up so that the executives can cash out in a few years, or gain a few more years of burn before the company goes bankrupt. \n\nAnd this whole dance is based upon some 35 year old middle manager in Ohio being forced to buy into a retirement plan because his company’s pension was dissolved 30 years ago.",
                                  "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbzz4e5/",
                                  "created": 1720327820,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lc16y3t",
                                      "score": 6,
                                      "body": "Isn't Uber a real company? They make a useful product, don't they? That's not to say all real companies should be on stock exchanges but it seems like a good thing if stock exchanges can support long-term investments that take a long time to turn a profit. Amazon for instance is pretty cool, it wasn't profitable for ages.",
                                      "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lc16y3t/",
                                      "created": 1720356277,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lc17tz5",
                                          "score": 3,
                                          "body": "NOW they do. And even their recent profitability may be due more to their investments doing well than revenue. But at IPO they were hemorrhaging money in the billions per year. Their IPO was also the first time in US history a stock LOST value, not gained.\n\nAmazon is also a great thing to point out, since they were among the first round of companies to go public with “bad” financials. Sure, it worked out unbelievably well for those who bought in first - and that’s a crazy understatement - but for every Amazon, there were also companies like Theranos trying to go public.",
                                          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lc17tz5/",
                                          "created": 1720356716,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "lc09emf",
                                      "score": 2,
                                      "body": "Everything you said is true except you’re romanticizing pensions. For private sector workers they were a mixed bag and unfit for people who moved companies. On top of this pension plan managers were some of the biggest morons who were routinely outfoxed by Wall Street.\n\n\nThe only pension plans worth a damn are for public (or quasi public like railroads/utilities) service workers because they are backed the state and won’t fail. 401ks are better for many people.",
                                      "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lc09emf/",
                                      "created": 1720334054,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lc14cvp",
                                          "score": 1,
                                          "body": "That’s fair! They were before my time, and the only people i run into with them are the ones whose pensions actually work.",
                                          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lc14cvp/",
                                          "created": 1720354950,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "lc18xhv",
                                      "score": 3,
                                      "body": "So it’s all a scam bc some IPOs aren’t good? \n\nThis is not a new problem btw. The intelligent investor talks about it back in the fucking 60s, that companies IPO when it’s good for THEM not you, and that when lots of companies are IPOing in a year it sometimes can be an indicator that there’s a market bubble \n\nBut I hardly find this convincing evidence of some defrauding of the public. Most investors probably don’t even buy IPOs they just DCA into retirement accounts buying indexes. Some of the companies you brought up aren’t even listed in indexes.\n\nUber was only slated to join S&P until basically start of this year, and as you noted in a comment below they are a real company now with a real product. \n\n\nSo I find this wholly unconvincing, that IPOs are some huge problem of wealth extraction from the public. Kinda old stale and boring take ngl.",
                                      "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lc18xhv/",
                                      "created": 1720357243,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lc1dgk7",
                                          "score": 0,
                                          "body": "I never said it was defrauding the public. Yes, that happens, but that wasn’t at all the point of my comment. \n\nIf you really want to get into the weeds of how companies - public or not - take advantage of the general populace, we can do that for days. I gave you AN example, not THE perfect answer. We never even touched on lobbying, GAAP, taxation on profits vs revenue, corporate bailouts using taxpayer money, Citizens United, PPP loans, stock buybacks instead of dividends, “supply chain inflation,” child labor, wage stagnation… the list goes on. And quite frankly, I don’t think I will spend any more time on you after this, because you’re not engaging in good faith with anyone. I don’t feel like talking to a wall. \n\nTo say a company ISN’T trying to extract value from the public is disingenuous. That’s their entire purpose, to make money from… anywhere they can. Is it all bad? No, as another commenter pointed out, 401ks are better for some people, because they don’t have to start their retirement over if they change jobs. There’s also a broader degree of flexibility of what you can invest in. American companies are more likely to take risks and innovate, because we’re more likely to be compensated for it.\n\nBut it comes at a cost. John Deere recently announced they’re shifting more production to Mexico, even after earning billions, just because it’ll cut down a little more on labor expenses. We’re seeing single family housing being bought at elevated rates by REITs, contributing towards supply shortages across the country. We have an entire section of the Midwest now referred to as “The Rust Belt” because it’s a hollow shell of the manufacturing giant it used to be. There are now subscriptions for fucking *calculator apps*, and we’re not seeing protections against any of this getting stronger at all. Instead, we’re watching in real time as good old fashioned neoliberal greed is slowly turning entire countries into a plutocratic nightmare. \n\nIt’s a mixed bag. I work for a Fortune 500 company, and I need the money and benefits. But it’s not hard to look at the economy of the 50’s and compare it to the economy of today and find glaring examples of things just plain being *worse*. And all of it being fueled by the mandate that the line goes up.",
                                          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lc1dgk7/",
                                          "created": 1720359304,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "lbzuqqi",
                                  "score": -2,
                                  "body": "i.... literally will... but i'm drunk now.\n\nand as i asked the other guy\n\n\n*how much time do you have*\n\nbecause fundamentally breaking down shit like years of zero interest leverage and 401k sociocultural influence on equity value over direct dividend returns and stock buyback's varying awful influence over equity-tied position decisions is not like... well, it's introduced by this paragraph but untangling that gordian knot is not a 10-drinks-in-and-gotta-clean-up task",
                                  "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbzuqqi/",
                                  "created": 1720325499,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lbyrb2g",
          "score": 16,
          "body": "Comparing the Indian markets that have a CAGR of ~12% since 2014 to the failing Chinese market is laughably ignorant lmao",
          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbyrb2g/",
          "created": 1720308326,
          "depth": 1,
          "replies": [
            {
              "id": "lc174fn",
              "score": 6,
              "body": "China produces just about everything, very little is made in India. IIRC Vietnam has more manufacturing exports. Results speak for themselves.",
              "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lc174fn/",
              "created": 1720356366,
              "depth": 2,
              "replies": [
                {
                  "id": "lc17z96",
                  "score": -2,
                  "body": "That's why India's GDP growth rate beat China's in the last 5 years (and Vietnam? Really?)",
                  "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lc17z96/",
                  "created": 1720356788,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lbytr17",
              "score": -1,
              "body": "India ETF's are substantially underperforming the SP500. Terrible place to passively invest",
              "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbytr17/",
              "created": 1720309319,
              "depth": 2,
              "replies": [
                {
                  "id": "lbz1qo8",
                  "score": 24,
                  "body": "lol that is false...indias main market index nifty50 has massively outperformed both sp500 and nasdaq100 over last 25 years. That holds true even after you adjust for currency. In the comparison below, sp500 has a 7 year headstart so the outperformance is even bigger. Indy is not nifty, its a etf by blackrock...most of the international etfs from blackrock are garbage. you will be better off investing in the underlying indexes of the countries than investing in a blackrock etf. \n\nhttps://preview.redd.it/wuv74e1srzad1.png?width=713&format=png&auto=webp&s=73d9433bf1a4408c2d5166cb7e500581d6c647dd",
                  "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbz1qo8/",
                  "created": 1720312540,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lce1ukg",
                      "score": 1,
                      "body": "By that metric you could invest in turkish lira and get similar results",
                      "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lce1ukg/",
                      "created": 1720549922,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lbzqx5r",
                      "score": -14,
                      "body": "Just means crazy how much more gains American companies would have if it wasn’t for governance and exploiting the public even further",
                      "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbzqx5r/",
                      "created": 1720323586,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lbzspgj",
                          "score": 4,
                          "body": "I am almost certain you don’t have any clue about how governance works in india but somehow have a strong opinion that india has weak governance. Do you think there is no governance issue in american companies where sec has a revolving door with wallstreet and big banks? Alot of governance issues in us gets swept under the rug and only gets exposed when the economy goes to shit..like the lehman and other banks during 2008 financial crisis or enron, worldcom after dotcom burst.",
                          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbzspgj/",
                          "created": 1720324467,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lbyuim4",
                  "score": 12,
                  "body": "1. If you put $100,000 in SPY and NIFTY50 in the last 5 years you'd be up nearly $30,000 more in the Indian ETF\n2. Your original comment was saying how Indian stocks were \"just as bad\" as China's markets which have been failing which is evidently not true (see point 1), now you're comparing them to US ETFs (re: see point 1)",
                  "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbyuim4/",
                  "created": 1720309633,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lbywiwo",
                      "score": 17,
                      "body": "No you wouldn't. INDY is underperforming SPY. Stop looking at returns in native currencies.",
                      "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbywiwo/",
                      "created": 1720310463,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lbyyvn3",
                          "score": -11,
                          "body": "You probably shouldve clarified in your parent comment that you're only talking about foreigners investing in India because it couldn't be more wrong for Indians investing. Also I do like how you keep avoiding acknowledging how wrong you were about comparing Indian and Chinese markets lmaoo",
                          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbyyvn3/",
                          "created": 1720311388,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lc0oxqe",
                              "score": 9,
                              "body": "It's true for anyone. If you converted INR to USD and bought SPY, due to both currency appreciation and market growth you would be better served with SPY.",
                              "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lc0oxqe/",
                              "created": 1720345026,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lc02mb9",
          "score": 8,
          "body": "I have higher trust in Chinese companies",
          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lc02mb9/",
          "created": 1720329819,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc058md",
          "score": 1,
          "body": "And from foreign investors",
          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lc058md/",
          "created": 1720331404,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc0zo5k",
          "score": 0,
          "body": "Entire India is setup this way not just big ones everyone wants investors to point up funds so the businesses show nothing and make money",
          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lc0zo5k/",
          "created": 1720352321,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lby2p37",
      "score": 35,
      "body": "*Laughs in SEC.*",
      "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lby2p37/",
      "created": 1720298749,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbywhbt",
      "score": 60,
      "body": "The Hindenburg was almost 90 years ago; talk about old news being priced in.",
      "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbywhbt/",
      "created": 1720310445,
      "depth": 0,
      "replies": [
        {
          "id": "lbzd4si",
          "score": 4,
          "body": "They had twitter back then?",
          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbzd4si/",
          "created": 1720317363,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lby4f4t",
      "score": 18,
      "body": "If you are interested in some advice on bonds, Hindenburg will refer you to his fixed income specialist Titanic.",
      "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lby4f4t/",
      "created": 1720299387,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lbzqrqp",
      "score": 19,
      "body": "Every governance body is India is deeply corrupted, the courts are absolutely terrible",
      "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbzqrqp/",
      "created": 1720323513,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc0516g",
      "score": 15,
      "body": "In accounting, especially the top 4 audit and tax forms, a lot of work is outsourced to India. Fortune 500 confidential information. It’s an incredible breach of security and we just don’t talk about it.",
      "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lc0516g/",
      "created": 1720331274,
      "depth": 0,
      "replies": [
        {
          "id": "lc65cck",
          "score": 1,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lc65cck/",
          "created": 1720433086,
          "depth": 1,
          "replies": [
            {
              "id": "lc70she",
              "score": 1,
              "body": "Interns and associates with seniors and managers reviewing. Now the hiring in the us has basically been 40% of what it once was and the seniors are swamped because the work India sends over for review is dogshit with minimal coming up pipeline. There will likely be a huge fraud coming up as a result of this and people signing off to meet quarterly reporting deadlines.",
              "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lc70she/",
              "created": 1720448139,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lbxzrlo",
      "score": 11,
      "body": "How can an entity be that incompetent?",
      "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbxzrlo/",
      "created": 1720297685,
      "depth": 0,
      "replies": [
        {
          "id": "lby24dy",
          "score": 32,
          "body": "It is called corruption :)",
          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lby24dy/",
          "created": 1720298537,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lbz7uko",
          "score": 4,
          "body": "Guessing you've never been to India or Africa",
          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbz7uko/",
          "created": 1720315093,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc102v9",
          "score": -2,
          "body": "Cos it is to serve the will of political party in power, nothing else matters",
          "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lc102v9/",
          "created": 1720352562,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lbxj87e",
      "score": 2,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 9 months ago\n**Total Comments** | 15 | **Previous Best DD** | \n**Account Age** | 11 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lbxj87e/",
      "created": 1720291674,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc13s50",
      "score": -2,
      "body": "Another Shortseller nothingburger.\n\nHow are these scammers still allowed to operate? (Fake research for stock market manipulation)\n\nEdit: It was really nice when these turds tried to fuck with AMD, with their totally made up nonsense, and got a very bloody nose.",
      "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lc13s50/",
      "created": 1720354643,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc1nf9b",
      "score": -2,
      "body": "Adani paid off the regulators? Lets Go!!! 🚀🚀🚀",
      "permalink": "/r/wallstreetbets/comments/1dwwkrt/deleted_by_user/lc1nf9b/",
      "created": 1720363308,
      "depth": 0,
      "replies": []
    }
  ]
}