{
  "title": "Diversification",
  "score": 33,
  "selftext": "Will it eventually pay off?\n\nI have had a very well diversified portfolio for over 20 years, and looking at my returns, they’ve all come from my S&P allocation, not real estate, not bonds, not international, not small or mid caps.\n\nMy question is whether diversification still has benefits?\n\nTaking it to its logical conclusion would a 100% allocation to the best performing sector (US large Cap growth) outperform a perfectly diversified portfolio, rebalanced regularly, over time?.",
  "link_flair_text": null,
  "id": "1dxhd1l",
  "num_comments": 28,
  "created_utc": 1720361311,
  "permalink": "/r/stocks/comments/1dxhd1l/diversification/",
  "comments": [
    {
      "id": "lc1pjq4",
      "score": 76,
      "body": "You diversify to reduce risk, less risk also means less potential gains",
      "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc1pjq4/",
      "created": 1720364092,
      "depth": 0,
      "replies": [
        {
          "id": "lc85rrf",
          "score": 2,
          "body": "This is the most concise way to explain it. It's beautiful!",
          "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc85rrf/",
          "created": 1720461705,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc1k82o",
      "score": 21,
      "body": "IMO, you diversify for protection when a particular sector/market you're also invested in corrects or crashes. If in early 2020 you had 20% of your portfolio in pharma, you would've had a pretty nice cushion over the following 6-8 months.",
      "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc1k82o/",
      "created": 1720362082,
      "depth": 0,
      "replies": [
        {
          "id": "lc29smc",
          "score": 6,
          "body": "Like you buy insurance hoping you never need it.",
          "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc29smc/",
          "created": 1720371258,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc1n8u5",
      "score": 21,
      "body": "The truth about diversification is you have to be kind of active for it to pay off\n\nLike say you are in VXUS. When it out performs the S&P you probably should sell it. same with commodities if you do any of that. They should be sold when they are out performing. Same with REITs. Probably same with bond funds. \n\nBc these assets long term don’t really go anywhere. So when they spike up they probably should be sold.",
      "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc1n8u5/",
      "created": 1720363241,
      "depth": 0,
      "replies": [
        {
          "id": "lc499fn",
          "score": 2,
          "body": "Excellent point.  Sectors and country ETFs go in and out of favor and are great candidates for covered calls to juice returns.  That also forces you out when they spike.",
          "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc499fn/",
          "created": 1720397024,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc29rpi",
      "score": 14,
      "body": "You don't diversify to maximize growth.\n\nYou diversify to maximize safety. \n\nSleeping at night when the stock market crashes is a luxury that a lot of people can't afford.",
      "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc29rpi/",
      "created": 1720371249,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc2a4r1",
      "score": 7,
      "body": "The more diversified you are does not mean your returns are better.....you can reach a inflection point where more diversification can hurt the returns more than it offers downside protection.  You don't need to be in every single asset class and their mother.",
      "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc2a4r1/",
      "created": 1720371379,
      "depth": 0,
      "replies": [
        {
          "id": "lc2b7lc",
          "score": 1,
          "body": "My portfolio looks like this:\n34% large cap US\n10% small cap\n22% REITS\n24% international \n10% Bonds\n\nI rebalance monthly\n\nAm I over allocated in international and REITs?",
          "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc2b7lc/",
          "created": 1720371760,
          "depth": 1,
          "replies": [
            {
              "id": "lc2iaoa",
              "score": 5,
              "body": "i'm the wrong person to ask.  I have no idea your age, your risk tolerance and your financial picture.\n\nI can tell you that in my portfolio I have 0% international and 0% bonds....but my time horizon is well over 20 years and my risk tolerance is probably one of the highest.\n\nMy thought process on why i have zero international is because international you buy the ETF in USD but the ETF buys the stocks in local currency.  The companies pay out in local currency and then convert to USD.  Which means you are subject to both stock fluctuation and currency.  Look at Japan for example their markets been going wild, but the yen has been dropping vs a dollar.  So if you had an ETF you would be up around 5%.  If you had a japan etf hedged for currency then you would be up around 20%.  I don't like to play forex (currency markets).  Plus the S&P500 now gets around 62% of its revenue from international markets and companies imo are more efficient both tax and inflation wise in converting currency than an rules based ETF.  So if i own the S&P500 then i'm getting 62% exposure to the world markets.\n\nI also have very few small caps, my thought process is that the US economy has tilted further towards large cap both economically and politically.  They have more money to tilt policy in their favor so i hold mostly large cap growth. \n\nMy strategy even if its thought out, is inherently risky and I wouldn't recommend it to most people since it carries sector and country concentration risk, however I think that over the past few years I have been compensated for taking that risk and my view of the markets going forward that i will continue to be.  I typically look at my strategy every 5-10 years to see if my opinion of the markets still holds true.",
              "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc2iaoa/",
              "created": 1720374254,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lc4covs",
              "score": 3,
              "body": "My opinon, and my opinion only:  REITs are a specialty sector so they are the odd man out here.  They can benefit somewhat from real estate pricing but beyond market oddities like the post 2020 boom, their main business is collecting rent on invested capital, so they are essentially a kind of specialty bond.  With current bond rates, I am not convinced that most general real estate funds will give enough alpha to compensate for sector specific risk.\n\nThis also means you've got essentially 32% in bonds.  Is that what you are looking to achieve?  There will be greater stability but lower return.  Is there something special about real estate where you think it's going to do well in the future?\n\nI think your international allocation is ok.  Note that international companies tend to be more industrial/manufacturing oriented than US funds which are more technology heavy, which is why they have been underperforming in recent years. But that can always turn around.\n\nPersonally I have been conflicted about small cap.  I always heard small cap is historically been higher risk, higher growth, but they have been underperforming large cap quite a bit for the last ten or fifteen years it seems.  So small cap hasn't done well in a good economy with low cost of money, but if there's a recession I don't think small caps are going to outperform large cap either.  I'm asking myself, what is the advantage then?  For this reason I've dumped most of my small cap recently and just put it in large cap, I'm not feeling good about their chances if things turn south.\n\nAlso imho monthly rebalance feels a little too often to me, but it depends on what kind of changes you want to capture.",
              "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc4covs/",
              "created": 1720398409,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lc3ggr7",
              "score": 1,
              "body": "What are you expecting from the REITs that could justify such a high allocation? They very rarely outperform and seem better suited to someone near or at retirement where the dividend is a big selling point.",
              "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc3ggr7/",
              "created": 1720386225,
              "depth": 2,
              "replies": [
                {
                  "id": "lc3qhhz",
                  "score": 1,
                  "body": "I based it on the David Swenson portfolio.  Basically, high uncorrelated returns, historically similar to equities, especially during stock market drawdowns, improving the overall sharpe ratio.   But that’s not held up over the past several years as stocks haven’t drawn down.",
                  "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc3qhhz/",
                  "created": 1720389852,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lc1oxsn",
      "score": 16,
      "body": "Diversification is an edge against ignorance. It helps preserve wealth while concentration is better to create wealth.",
      "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc1oxsn/",
      "created": 1720363867,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc27zbm",
      "score": 5,
      "body": "Have been guilty of same....over-diversification! Lg cap growth is a good choice if you have some yrs before retirement......when that comes, start working away from it. Real estate sucks, bonds are finally interesting after many yrs not and intl is the same mixed bag its always been......Japan being a great example!",
      "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc27zbm/",
      "created": 1720370617,
      "depth": 0,
      "replies": [
        {
          "id": "lc29fik",
          "score": 1,
          "body": "I’m thinking of reallocating from VEU to HEFA for my international allocation.   It hedges out currency risk, and explains almost all the under performance interestingly enough.",
          "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc29fik/",
          "created": 1720371130,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc2a2f2",
      "score": 3,
      "body": "Large Cap Growth outperformed over the last 20 years, but historically small cap value outperformed.  Also bonds are cheap because we’re likely at the peak of a rate hike cycle.",
      "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc2a2f2/",
      "created": 1720371356,
      "depth": 0,
      "replies": [
        {
          "id": "lc2aeer",
          "score": 2,
          "body": "In other words odds are against you if you concentrate your portfolio after 20 years of massive US large cap outperformance, you’re likely to lose on the way up and again on the way down.",
          "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc2aeer/",
          "created": 1720371474,
          "depth": 1,
          "replies": [
            {
              "id": "lc2bjqn",
              "score": 2,
              "body": "If you concentrate your portfolio into the winning sectors, then you might lose.  Instead of doing what everyone else says and buying winners and selling losers, I do the opposite.  I rebalance out of the winning sectors and into the losing ones.  Institutions also do this , and it’s been working so far.",
              "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc2bjqn/",
              "created": 1720371878,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lc2bvcu",
      "score": 5,
      "body": "The sp500 is diversified.\n\nhttps://images.app.goo.gl/DqMtm8vbr9Q5nVWm8",
      "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc2bvcu/",
      "created": 1720371989,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc4esn3",
      "score": 2,
      "body": "Diversification won't make you rich, it will make sure that you aren't broke.\n\nIf your goal is to beat the market average return, you need to: \n\nA) have a portfolio which is diversified yet also packed with best of sector names which will hopefully yield the most returns of their respective sector, thus beating the average. \n\nB) be overweight in a sector/sectors which you believe will do better than the rest of the market.\n\nA) requires some luck and assumes a relatively equal weighted market (unlike rn where tech is killing it)\nB) requires you to pick the right companies in one sector. If that sector rotates out of favor, you may under perform the market.\n\nThe alternative would be to load up on VOO, occasionally trade or invest in 1 or 2 names, and ride it out.",
      "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc4esn3/",
      "created": 1720399258,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc37j77",
      "score": 4,
      "body": "SPY is absurdly diverse. If SPY fails, everything else will fail. \n\nMost calls for ‘diversification’ beyond this absurdly diverse index (SPY) are really about manufacturing complexity and uncertainty so we pay underperforming managers massive fees to have inferior sharpe ratios to SPY. \n\nReal estate and bonds are awesome. But you need to own them directly. The publicly traded ETPs tend have absurdly high fees and illiquid high turnover. The managers/issuers/market makers capture most of the economics. \n\nLook at VNQ vs the case-schiller over the past 20 years. Keep in mind that the case-schiller isn’t even counting rental income. Look at TLT vs just buying a 30 year bond 20 years ago. \n\nDon’t conflate diversification with diworsification.",
      "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc37j77/",
      "created": 1720383136,
      "depth": 0,
      "replies": [
        {
          "id": "lc4esvp",
          "score": 6,
          "body": "No...I don't think you've checked on the situation recently.  This might have been true before, but I strongly suggest you look at this more closely.\n\nThe S&P is a cap weighted index.  Do you realize that the \"Mag 7\" companies are almost 30% of the S&P's cap now?  And what percentage of the Mag 7 is in the technology sector?  If you count Tesla as a technology company then that number would be 100%.\n\nSo a third of the S&P is currently invested in a single sector with the highest risk/reward profile.  This is not \"absurdly diverse\" in any stretch of the imagination.  I'm not saying that it is wrong to have your money in that index fund, but I *am* saying that you need to think carefully about what exactly people are telling you versus what you actually know to be true.  Having 30% of your money in Apple et al is great if you believe technology will be producing the lion's share of returns from here on out, but it is dangerous to think that the current S&P equally represents all of the different sectors that the 500 stocks encompass.  It does not.",
          "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc4esvp/",
          "created": 1720399261,
          "depth": 1,
          "replies": [
            {
              "id": "ldyypoj",
              "score": 1,
              "body": "Let’s say the top 10 companies at 30% weight declined 33%, that would be a 10% hit to SPY - a garden variety correction. That would return the top 10 companies’ weight to 20%, modestly below the LT average. \n\nThe “magnificent 7”, a group with three or four names and many different tickers since I’ve been in stocks, will likely still have 20-40% cap share in 2035 or 2055, if not higher, but likely won’t be comprised of more than one or a few of the current tickers.\n\nThere are companies that have ~20bps index weight, or haven’t been founded yet, that will dominate the index at some point in 20-30 years. Similar to AAPL, NVDA, NFLX, META, and GOOG in 2000 vs today. \n\nWhen companies are successful they will take share of the index. When they fail they will be removed, and that pro-momentum stance is what makes the top 500 ticker S&P index so powerful over time. The “pastnificient 8” of 2000 (MSFT, GE, CSCO, WMT, XOM, INTC, C, and IBM) ex MSFT have stagnated/imploded while new blood took their place. \n\n500 tickers, 500 chances at LT exponential compounding, is absurdly diverse.",
              "permalink": "/r/stocks/comments/1dxhd1l/diversification/ldyypoj/",
              "created": 1721414943,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lc4y3yd",
      "score": 1,
      "body": "You can be over diversified. I think most people are.\n\nThe S&P500 has real estate exposure. It also has international exposure since 40% or more of sales are from over seas.\n\nMarket cap is another thing. The problem with it is small and mid cap have different industry sectors that dominate. Often these are financials and oil and gas producers.",
      "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc4y3yd/",
      "created": 1720407261,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc1kta9",
      "score": 1,
      "body": ">Taking it to its logical conclusion would a 100% allocation to the best performing sector (US large Cap growth) outperform a perfectly diversified portfolio, rebalanced regularly, over time?\n\nHow is anyone supposed to know? All we know is that historically it didn't.",
      "permalink": "/r/stocks/comments/1dxhd1l/diversification/lc1kta9/",
      "created": 1720362314,
      "depth": 0,
      "replies": []
    }
  ]
}