{
  "title": "[DD] Invest in Cyberpunk Dystopia with Electric Quadcopters. Urban Air Mobility Sector set to take off.",
  "score": 44,
  "selftext": "edit: in case my dystopian joke opening was toooo pithy, the rest of the post does have a serious thesis.\n\nA review of near-future science fiction media (Westworld, Bladerunner, Cyberpunk 2077, etc) reveals that electric VTOL aircraft capable of maneuvering and landing in tight urban airspaces will be in great demand and common use for corporate overlords and quasi-fascist law enforcement organizations. Fortunately, these aircraft actually exist! Now is the time to invest in them to be oligarchs instead of serfs in our future dystopia!\n\nElectric Vertical Aircraft (eVTOL) is a speculative tech sector that is gaining momentum for an explosive breakout. I suspect it will soon follow a pattern like satellite comms (ASTS, GSAT), AI, Fintech, Cloud everything, Cybersecurity, and EVs, with extreme valuation fluctuations as companies push from speculative to operational, and some “winners” emerging by 2026 with sustained major value increases.\n\nHuman-piloted and fully AI-piloted eVTOLs will land at “vertiports” in cities, on airport, skyscraper, and resort helipads, and rapidly deploy QRFs to quell rebels dissenting against corporate feudalism. eVTOLs aim to greatly expand the use of “Air Taxis” and regional/urban air transport options for small cargo, people, and other tasks.\n\n*Disclaimer: obviously, I might be an idiot since I post here, so consider that before buying anything based on this analysis. Also I wrote this before seeing someone else posted about this today.*\n\n*Also, I'm using \"EVTOL\" here to avoid the Electric Vertical Aircraft acronym from triggering as a banned ticker.*\n\n&nbsp;\n\n**BLUF: Main Thesis**\n\n*The eVTOL and particularly the UAM sector is primed to be re-valued from high-risk speculation to operational, revenue generating business. Valuations currently depressed by fear due to significant schedule uncertainty and technology questions will rise rapidly into speculative hype as clear timelines emerge and probability of successful operations increases.*\n\n* While eVTOL future is uncertain, options gamblers should love this as a month-long play with high potential to break out, even if we see retracing afterwards.\n\n* Multiple companies spiked on announcements last summer, but retraced as dilution and timeline risk re-emerged.\n\n* This summer, companies have provided more concrete timelines and test successes, and announced an end to dilution as they have cash or revenue to sustain until full operations.\n\n* Getting in now will front-run the overall sector value increase as risk-averse investors become willing to buy. In the short term, continued milestone achievements will bring immediate hype (10-baggers?) through summer ERs and EOY, and set the stage for sustainable operations over the next 2-3 years.\n\n* Segment analysis has CAGR between 25-50% from now through the next decade, depending on the exact parameters and time of analysis.\n\n* EVTOLs are marketed as \"green\" aviation and may become part of the push away from fossil fuels as battery and engine efficiency continues to increase.\n\n* Hype-wise, financial and general articles about the segment have ramped up considerably over the last month. Getting in now will also front run my suspicion that one or more eVTOL startups will go on a \"meme\" run before the end of summer. \n\n* AI-piloted eVTOL are unlikely to run you into highway barriers at full speed, unlike FSD, as there are fewer things to hit in the sky.\n\n* This post is already long AF and I cut out a ton of supporting research and ticker-specific analysis so I could meme about dystopias and autopilot. Will post more details and information on request.\n\n&nbsp;\n\n**BLUF: Archer Aviation ($ACHR) calls are the “I can’t read, what do I buy” play**\n\nYeah you’re not here for a sector DD, don’t care about buying shares of multiple companies, wen lambo?!…\n\n**If you want to pick one gambling play, I would go with ACHR 4.5 or 5c, expiry 8/15 (extreme risk due to thin volume) or 10/18 (better volume).** ACHR closed at ~$4.4 on Friday, up from $3.46 on Monday. Next ER is 8/8.\n\nArcher is on a major upswing, trading higher on about double its average volume over the last week. They’ve announced they have sufficient cash to achieve FAA Type certification for their “Midnight” airframe *(no more dilution!),* have other relevant certs in place, and confirmed their first market is rich San Francisco. Last summer ACHR went to $7.22/share before retracing on uncertain certification timeline and cash risks, issues which are now resolved. Market size, concrete business plans, an outrageously large OI of more than 100,000 calls for 10/18 5c, and current trajectory mimicking last summer suggest a return to at least that level soon. As a previous SPAC, early ~~investors~~ bagholders (me lol) get ROI at a price above $10/share and PT average is $8.1, so institutions and major holders shouldn’t begin profit-taking until those marks. I don’t think short interest is relevant but FWIW if it helps you hype yourself up, it's quite high at 26% of float, due to the high risk speculative nature of the company.\n\nAs with all plays that cover an ER, I would **strongly** consider selling or at least rolling up to extract profits pre-ER if the price continues to rise and you are sitting on good profits.\n\nI'd also caution against only trying one play here, as ACHR is currently running but may not be \"the play\" by EOY still.\n\n&nbsp;\n\n**Sector Brief: Startups/Majors/Up/Downstream in UAM**\n\nI own, or will soon buy shares or long dated options across all mentioned startups, Bell, and air mobility.  I think buying a spread of shares in IRA/Retirement ports across the segment is a good idea. Note I've dropped the tickers from small-caps to avoid getting a slap from VisualMod, but you should be able to find them by name.\n\n* **Publicly traded startups:** Archer Aviation (ACHR), JOBY, Vertical Aerospace (UK), Lilium, EHANG (EH, Chinese), and EVEX (Embraer spinoff)\n\n* **Major Aerospace:** Bell/Textron (TXT) who acquired Pipistrel, and Airbus (EADSF)\n\n* **Upstream Suppliers:** “pick and shovel” investments (Batteries, Infrastructure) are not likely to experience significant effects from the eVTOL market yet. The ground EV market is already significantly bigger and more impactful to suppliers.\n\n* **Downstream:** “Air Mobility” companies that offer helicopter services may experience bumps as they expand and market new more affordable eVTOL services to a wider audience. Blade Air Mobility (US) and Bristow Group (UK) are publicly traded.\n\n* **ETFs** I have not found a dedicated ETF for this sector. BATW and (uh oh) ARKX have the highest exposure, but percentages are too small for them to mimic the sector as a whole.\n\n* **Private Startups** Volocopter, Beta, and Wisk have good sales pipelines and revenue commitments. Keep an eye out for IPO or merger.\n\n* Finally, some major players like Boeing may be active in spaces more related to military/niche segments that are harder to isolate by ticker or project eVTOL-specific gains.\n\n&nbsp;\n\n**Upcoming Calls on ERs for Mansion or GUH**\n\nThe next round of ERs occurs from very late July to August, but Option Volume is thin for dates other than quarterly expiration (mostly October).  These are the 3 most advanced startups, plus Bell Helicopter:\n\n* ACHR as described above (4.5 or 5c 8/16 or 10/18)\n\n* **JOBY 8/2 5c or 6c (extreme risk, thinly traded) or 10/18 7c (better volume/time).** JOBY is the most mature of the startups and has operating contracts in Dubai. They acquired Uber's attempt at eVTOL service several years ago.\n\n* **EH 8/16 16c or 17c (Chinese company, extremely risky ER play, they have a 29 PT though).** It's Chinese, could do anything.\n\n* **TXT 7/19 95c (very risky ER play, but they have a 100 PT).** Established, major Helicopter manufacturer, bought an eVTOL startup to jump ahead on production.\n\n**Longer Dated high risk, high reward options plays (through Jan ’25 or beyond)**\n\n* Vertical Aerospace 1/17/2025 2.5c.  Vertical had a flight test crash last summer that the valuation hasn’t recovered from. Good news before EOY should multiply the stock price.\n\n* Lilium 10/18 1c or Jan ’25 1c. Really risky because Lilium’s Jet is still very early in design, but they’re actively publishing successful tests which could push these ITM as the sector valuation goes up across the board. Might be a sleeper smash hit for mid '25.\n\n* EVEX – bad options chain, but consider 8/16 2.5c to play their ER as they may announce they will not do any more equity dilution after the current equity offer at $4/share and leverage the increase from the current 3.3 price to the $4 equity offering price.\n\n&nbsp;\n\n**Drawbacks/counterpoints**\n\n* Certification may still take much longer than predicted. A Risk-averse FAA, failures during flight tests, and other issues may suddenly and unexpectedly push back viability by years.\n\n* The predicted market may not emerge. The eVTOL use cases have a high-risk combination of needing to take share from fossil fuel helicopters and generate significant increases in the general usage of point-to-point “Air Taxi” service.\n\n* Risk-averse institutional investors may wait until 2026 to pour in cash, when startups have proven operations and revenue streams.\n\n* Major players like Textron/Bell and Airbus, privately held companies like Volocopter, and market share staying diffuse amongst many competitors may mean value increases are small for any given company.\n\n* The sector may not generate the same hype as other speculative techs, causing no “meme” spikes in the short term.\n\n**Positions** yeah they’re not huge but my gambling port and individual investment IRA are deliberately smaller to keep me from losing everything.\n\nACHR –30 8/16 4.5c, 10 10/18 5c, 100 Shares, 1 Jan 25 10c (bought when it dropped in Jan of 23)\n\nVertical Aerospace – 275 Jan 25 5c (in my defense I got them for .05 each way back in February), 100 shares\n\nJOBY – 100 Shares, 3x Jan ’25 7.5c\n\nLlilum - 100 Shares\n\nTXT – 25 Shares\n\nFWIW I also threw another ~$3k in these accounts that hasn’t hit yet while researching this that will likely be used 100% to plus up options positions across these plays.",
  "link_flair_text": "DD",
  "id": "1dxlz3o",
  "num_comments": 32,
  "created_utc": 1720373590,
  "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/",
  "comments": [
    {
      "id": "lc2gfmt",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 11400 | **Previous Best DD** | \n**Account Age** | 9 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lc2gfmt/",
      "created": 1720373600,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc2tdwk",
      "score": 40,
      "body": "WSB: \"why doesn't anybody post wacky speculative DDs so i can get a 10 bagger?\"\n\nAlso WSB: total lack of engagement with a wacky speculative DD with upcoming options plays.",
      "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lc2tdwk/",
      "created": 1720378146,
      "depth": 0,
      "replies": [
        {
          "id": "lc3ww5m",
          "score": 9,
          "body": "I think I saw ASTS somewhere in there, calls it is.",
          "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lc3ww5m/",
          "created": 1720392244,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc2lfmu",
      "score": 10,
      "body": "I don't really see a use case for them?",
      "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lc2lfmu/",
      "created": 1720375352,
      "depth": 0,
      "replies": [
        {
          "id": "lc2o1lb",
          "score": 14,
          "body": "The best I can envision is a ferry for humans across rivers, and in high pop density areas. Very limited use cases I think. The post is clear about it though.",
          "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lc2o1lb/",
          "created": 1720376265,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc48xtz",
          "score": 7,
          "body": "Every major police department in USA is gonna want one",
          "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lc48xtz/",
          "created": 1720396895,
          "depth": 1,
          "replies": [
            {
              "id": "lc4idfc",
              "score": 10,
              "body": "Yeah police and medevac gonna love these things.\n\nMaxTac and Trauma Team IRL",
              "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lc4idfc/",
              "created": 1720400701,
              "depth": 2,
              "replies": [
                {
                  "id": "lc4m4qj",
                  "score": 3,
                  "body": "Hah. There's plenty of worse investment strategies than investing in case a dystopian future becomes reality. World looks more and more like those movies predicted, so why not get into some robotics, AI, megacorporations etc.",
                  "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lc4m4qj/",
                  "created": 1720402223,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lc40bdp",
      "score": 10,
      "body": "Cathie owns it and for that reason, I am out",
      "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lc40bdp/",
      "created": 1720393541,
      "depth": 0,
      "replies": [
        {
          "id": "lc40g37",
          "score": 7,
          "body": "honestly, fair take.",
          "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lc40g37/",
          "created": 1720393590,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc3ncdh",
      "score": 3,
      "body": "I’ve had ACHR and JOBY on watchlist for awhile. I rejected the latter as I couldn’t tell if insider selling was due to stock options or taking profit during hype. I’ve definitely noticed a lot more being written about the space. I considered 2026 LEAPS, but don’t think ACHR is there yet (and went big into ASTS already.)\n\nIt looks like OI on 10/18 5c is ok, and IV appears undervalued. I’ll join you on the position and plan to sell in a hopeful run up and volatility before 8/8. I’m thinking 10 or 20 contracts, so nothing huge. \n\nGreat write up! Thanks and good luck with the hellscape!",
      "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lc3ncdh/",
      "created": 1720388698,
      "depth": 0,
      "replies": [
        {
          "id": "lc3td1m",
          "score": 2,
          "body": "yeah i wouldn't be surprised to see this summer be another surge-and-retrace if they don't really keep hammering optimism. But i'm not sure we go any *lower* on front runners, even though revenue streams look to be 2026. \n\nAt any rate, If last summer's run-up on even less news is any indication, ACHR should keep moving at least until ER.\n\nJOBY should be a legitimate company, they absorbed Uber Elevate and have exclusive rights in Dubai, which is at least theoretically be lucrative.\n\nI'm really annoyed Vertical can't get their shit together after i projected a major recovery back in February, buuuut they are supposed to test flight their new design soon, so... fingers crossed.\n\n&nbsp;\n\nInstitutions also seem to be buying, ACHR is net up recently, although Cathy \"Death Knell\" Woods is buying so there's that...",
          "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lc3td1m/",
          "created": 1720390924,
          "depth": 1,
          "replies": [
            {
              "id": "lc3vrtf",
              "score": 2,
              "body": "Haha! Great. Thanks for the heads up on JOBY. I’ll revisit that. I agree that ACHR has room to run more. And also will treat it as a short term trade, for now. I’ll keep all on the radar and hope to hit lucky timing again by buying LEAPS as revenue and profitability improve. I look forward to your gain porn!",
              "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lc3vrtf/",
              "created": 1720391825,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lca21h3",
      "score": 3,
      "body": "Joby is manufacturing their own parts in house (which require FAA certification). They also received a huge investment from Apple (not an aviation company so doesn’t hold a lot of water with me).\n\nArcher is using already FAA approved parts from vendors. Archer also already got a head nod from the FAA for airworthiness. They have contracts with United Airlines already, a company in UAE, and are in the works of setting up air taxi service in San Francisco area. Basically the ability to travel from one end to the other of the Bay Area. This will allow the ability to skip traffic. Archer seems to be going to market first. There are also tons of videos of them flight testing their aircraft on the YouTube. They have the ability to fly completely autonomous right now, but they know this will make people feel uneasy so they will have pilots. But their end state is essentially flying cars. And it is a very redundant system making them extremely safe. Basically a civilian version of a V-22 osprey with additional rotors and lots of batteries that can take over in case of an incident. \n\nNot to mention all the government infrastructure money that will need to pour in to set up air taxi landing zones and charging stations. Still a very early play but definitely something to watch. I’m very long on this one.",
      "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lca21h3/",
      "created": 1720485253,
      "depth": 0,
      "replies": [
        {
          "id": "lca5seh",
          "score": 1,
          "body": "> Joby is manufacturing their own parts in house (which require FAA certification\n\nah i don't think i've grasped this difference in reading both the JOBY and ACHR releases. I always got the impression based on the \"stages\" that they had comparable timelines.\n\nMy understanding is that Joby intends to have live service in Dubai by 2026, which might be a shade later than Archer's 2025 target for SF if all goes well...\n\n&nbsp;\n\noverall, I agree ACHR has the best bull case for the next 18 months of publicly traded Western startups.\n\nEHang is a bit of a wildcard being chinese (they claim to be actively flying and fully paid for their first 30 vehicles). They might push some really optimistic numbers in their ER.\n\n&nbsp;\n\n> Not to mention all the government infrastructure money that will need to pour in to set up air taxi landing zones and charging stations\n\nI've only found one company (Ferrovial?) that seems to be public and build the \"vertiport\" type infrastructure. Other than general ETFs like BATW do you know any good companies that might specifically come into focus as infrastructure spend comes up in 2026 or later?",
          "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lca5seh/",
          "created": 1720486711,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc5vpbs",
      "score": 2,
      "body": "LOL\n\n  \nDont touch this crap, its 20 years away, none of these companies will do anything.",
      "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lc5vpbs/",
      "created": 1720426379,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcc75r5",
      "score": 2,
      "body": "Is there any eVTOL publicly traded companies that are planning a one person or two vehicle that will be affordable to masses because if so I want in. I have a 100 ACHR shares but it’s just for holding for shits and giggles",
      "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lcc75r5/",
      "created": 1720526464,
      "depth": 0,
      "replies": [
        {
          "id": "lcc88bh",
          "score": 2,
          "body": "publicly traded? I'm not sure. EHang's Falcon B might be close, but, Chinese company too.\n\nI doubt any literal aircraft are ever going to be made widely available to the public.\n\n&nbsp;\n\nThat said [this article](https://robbreport.com/motors/aviation/gallery/one-person-electric-aircraft-flown-without-pilots-license-1235478660/unknown_d64480/) does detail several vehicles that are supposedly to be available \"without a pilot's license\" but none from a company i recognize (but might be worth double checking).\n\nTerrafugia is/was also developing something very close to a literal flying car (iirc it's designed to be road-legal).\n\n&nbsp;\n\nThat article isn't comprehensive either. Can't remember which company, but there's definitely a few others making low-altitude hover-bike-like stuff out there.",
          "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lcc88bh/",
          "created": 1720526975,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc464vr",
      "score": 1,
      "body": "Quell rebels?!     Lmao.     Altered Carbon reference?",
      "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lc464vr/",
      "created": 1720395787,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc5qwiw",
      "score": 1,
      "body": "Wait until the first billionaire craters into the ground on one of these things. The safety record on these things is going to be slightly better than helicopters. If you scale it up to commercial aviation, people are going to die regularly.",
      "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lc5qwiw/",
      "created": 1720423053,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc5raac",
      "score": 1,
      "body": "Those are highly unstable, unreliable and have a horrible autonomy. It could be used to maybe carry very valuable cargo like an human organ during emergency but not in a city! You forgot to include A.I, Quantum Computing, and NVDA in your post. \n\nReminds me of Uber trying to hype their stock saying they will offer drone rides. Unmanned helicopter and drones, lol. ",
      "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lc5raac/",
      "created": 1720423307,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc5w5h9",
      "score": 1,
      "body": "This is good confirmation bias",
      "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lc5w5h9/",
      "created": 1720426692,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcu4pin",
      "score": 1,
      "body": "It's printing, good call OP",
      "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lcu4pin/",
      "created": 1720792974,
      "depth": 0,
      "replies": [
        {
          "id": "lcu4xl1",
          "score": 1,
          "body": "Yeah, JOBY yesterday, ACHR today.  Pretty happy with my port atm lol",
          "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/lcu4xl1/",
          "created": 1720793054,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ld1yn1k",
      "score": 1,
      "body": "If I haven’t already, or even if I have: thank you! I did my DD and decided to scale into ACHR calls. They are doing well. I will sell them off. I’m starting to stack cash right now, but will keep JOBY and Archer on my watchlist. Will buy in with shares as further milestones are reached. Thank you! (I thought eVTOL a total joke at the time…)",
      "permalink": "/r/wallstreetbets/comments/1dxlz3o/dd_invest_in_cyberpunk_dystopia_with_electric/ld1yn1k/",
      "created": 1720909693,
      "depth": 0,
      "replies": []
    }
  ]
}