{
  "title": "Financial YouTubers",
  "score": 80,
  "selftext": "[removed]",
  "link_flair_text": null,
  "id": "1dxw0gh",
  "num_comments": 55,
  "created_utc": 1720400254,
  "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/",
  "comments": [
    {
      "id": "lc4jui4",
      "score": 136,
      "body": "Financial youtubers need to create new videos to earn a living.\n\nGood financial concepts don't need continuous content.\n\n\"Top 10 stocks for 2024\" attracts viewers with zero knowledge and even those with some knowledge. Appeals to people hoping to get rich. Easy to continue to make content. \n\nThis means that \"financial youtubers\" are 99% scummy.\n\nIndex funds require 1 video and smart people are done watching after that.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4jui4/",
      "created": 1720401304,
      "depth": 0,
      "replies": [
        {
          "id": "lc4sde8",
          "score": 9,
          "body": "also a majority of their revenue comes from sponsorships. so they are both driven to get more views as well as more sponsors with less than ideal vetting.",
          "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4sde8/",
          "created": 1720404822,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc57l4r",
          "score": 15,
          "body": "To be honest I follow a couple of financial Youtubers (honorable shoutout to Ben Felix) that do advice index funds and do none of the shenanigans\n\n\nThey make like 1 vid a month to either emphasize again, based on research, why index funds are the go-to or they make videos on how to allocate funds in different hypothetical scenarios.\n\n\nHowever, I guess this is not enough to make a living out of it and it is just a side gig that they enjoy doing.",
          "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc57l4r/",
          "created": 1720411674,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc53qy8",
      "score": 54,
      "body": "Stay away from Grahm Stephen.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc53qy8/",
      "created": 1720409816,
      "depth": 0,
      "replies": [
        {
          "id": "lc5ygba",
          "score": 6,
          "body": "I knew he was a fraud from over 5 years ago with his “traditional 401k vs Roth IRA” video where he essentially compared a traditional ira and a roth ira, and didnt even seem to be aware that ira and 401k were different. How he got to be such a big financial youtuber is such a mind fuck for me.",
          "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc5ygba/",
          "created": 1720428300,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc4xm2y",
      "score": 23,
      "body": "Investopedia > all youtubers",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4xm2y/",
      "created": 1720407047,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc4j698",
      "score": 18,
      "body": "I know at least two of those people are in a lawsuit. But yeah, much like what other people have done in the past they say it isn’t financial advice. Here’s the thing though, even financial advisors can be shitty.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4j698/",
      "created": 1720401028,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc4q541",
      "score": 8,
      "body": "From what I can understand based on a Plain Bagel video, which I can’t link due to auto mod, these YT channels actually do have some protections when it comes to giving investment advice. However, they’re not completely exempt from obvious pump and dump schemes.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4q541/",
      "created": 1720403892,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc4qxbz",
      "score": 15,
      "body": "Here is the basic advice I would give anyone wanting to know more about investing:\n\n1. Go to a bookstore and find a book that has been reprinted or had multiple editions and was originally printed quite a number of years ago. Avoid any with pictures of the author on the cover and avoid authors who have many books. \n\n2. If nothing else invest in a broad based etf with low fees. sp500 etfs are popular and generally get good returns. Fees are usually low. \n\n3. The first step in investing is getting money flowing into your investments. If you dont have a budget and dont have solid finances its a struggle to invest. Work on that. If you are barely scraping by you either need a better job, need to move to a better situation, or need to shack up with someone because you cant scrape by and get ahead. \n\n4. Investing is a long journey. You will have great wins and some moments that will stress you out if you are watching it happen. Dont panic when down, and dont sell everything when up. Unless you have a really good reason generally just chill out and wait. \n\n5. If you do watch the youtube financial videos please realize that most of them are trying to sell you something and the majority of the facts they provide are free and their advice is more often than not just barely above useless. Save your money and invest it instead. \n\n6. Most people who lose money in the markets do it in one of three ways. They fidget when they should wait. They buy options and gamble. They fomo into something with large amounts of their investing dollars. None of those things will doom you in small amounts, but in large amounts they can easily set you back years. So generally unless you really know something special dont do it.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4qxbz/",
      "created": 1720404221,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc4hurp",
      "score": 24,
      "body": "Five magic words “This is not financial advice”",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4hurp/",
      "created": 1720400491,
      "depth": 0,
      "replies": [
        {
          "id": "lc4jqpf",
          "score": 15,
          "body": "Those words don't mean anything. They don't protect you from any kind of legal liability, they don't make pushing a pump&dump scheme legal. It just means nothing and is pointless to say.\n\nAnd you can be sure that anyone who does say that is fucking clueless because they think it does mean something when it does not. So it's safe to ignore anyone who says \"not financial advice!\"",
          "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4jqpf/",
          "created": 1720401261,
          "depth": 1,
          "replies": [
            {
              "id": "lc564q4",
              "score": 5,
              "body": "CNBC should be taken immediately off the air yet they just cry when anyone in retail makes money.",
              "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc564q4/",
              "created": 1720410958,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lc4pb1j",
              "score": 7,
              "body": "Its not pointless to say it. They know quite a few people will believe it and not bother to seek legal actions against them even when action would have results.",
              "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4pb1j/",
              "created": 1720403541,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lc4l8ws",
          "score": 1,
          "body": "So that enables them to present themselves as “financial experts”, sell “financial/wealth building courses” that cost hundreds even thousands of dollars, and release a 20 minute video on why you should buy this stock or put your money in this bank? Like what the actual f.",
          "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4l8ws/",
          "created": 1720401873,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc5ilfj",
      "score": 5,
      "body": "Millennial Money. Look that shit up. Those people tried to delete everything.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc5ilfj/",
      "created": 1720417718,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc4mkk4",
      "score": 5,
      "body": "I wish YouTube can do something about it as well. I saw the video about Graham saying he owns a bank now and how it helps plain folks like us. thankfully I didn't follow through with it . I found another YouTuber that I liked more.. where he did analysis of the stocks and why this stock is a good buy and shares his profolio from time to time. ",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4mkk4/",
      "created": 1720402404,
      "depth": 0,
      "replies": [
        {
          "id": "lc4o2jq",
          "score": 4,
          "body": "I haven’t watched a single Graham video since the whole BlockFi and FTX scandal. Him and all the others I mentioned promoted BlockFi. When BlockFi went down the toilet both Graham and Andrei were somehow able to miraculously predict to withdraw all their money a couple of days before the collapse. Hmmmmm…….. yeah I see what you did there and at that point you’re just a trashy scumbag that should probably be in prison. \n\nTbh I never engaged with any sponsorship on any YouTubers channel ever cause I hear stuff about this crap. You just really don’t know what to trust. I only ever put money on the platform one time. It was direct to Operator Starsky. He is a soldier in the Ukrainian army and he was doing a fundraiser to raise money to buy some drones and I did donate to that. Other than that I never engaged with sponsorships or donations on the platform cause you just don’t know what to trust. Cause crap like this happens all the time.",
          "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4o2jq/",
          "created": 1720403024,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc4p8kq",
      "score": 3,
      "body": "I got fooled by the Shift pushers",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4p8kq/",
      "created": 1720403512,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc4u1n5",
      "score": 5,
      "body": "Check out ClearValueTax for good info.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4u1n5/",
      "created": 1720405524,
      "depth": 0,
      "replies": [
        {
          "id": "lc506k7",
          "score": 3,
          "body": "The best on YouTube that I've found. No click baiting BS, just info.",
          "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc506k7/",
          "created": 1720408176,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc4mma4",
      "score": 2,
      "body": "Youtube should give you more tools to do your own due diligence on a channel if they're going to have finance content.  Instead they seem to be moving in the opposite direction.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4mma4/",
      "created": 1720402423,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc4s93a",
      "score": 2,
      "body": "The only one I really take seriously is Patrick Boyle",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4s93a/",
      "created": 1720404772,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc4lbnl",
      "score": 3,
      "body": "About 5 years ago I started taking investing seriously. The first results I got doing research were these finfluencers. I was very intrigued by what they said, but I'm also inherently cautious. I started investing with a small amount of money, just a few hundred dollars, to begin explorijg it. I also did the math on a lot of what they were saying. I actually did my own research, and it just didn't add up. As I kept going down the rabbit hole, I started finding the \"real\" financial experts in YouTube, like The Plain Bagel. Then I started realizing what real investing was like and pivoted towards it. I've had huge amounts of success ever since.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4lbnl/",
      "created": 1720401903,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc4so76",
      "score": 1,
      "body": "YouTube and other social media platforms struggle with terms of service, the First Amendment, regulations, and content ownership. Social media is the Wild West in many ways, even though it’s becoming a mature media source by now. Advertising makes it all worse, IMO.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4so76/",
      "created": 1720404946,
      "depth": 0,
      "replies": [
        {
          "id": "lc56l7c",
          "score": 1,
          "body": "And yet  people are still struggling if they should elect an old dude known for scamming people and not paying them who also stacked the courts that would enable people to scam people on social media, because the other guy who would do the opposite supported by an administration who would also do the opposite happens to be  slightly older.",
          "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc56l7c/",
          "created": 1720411181,
          "depth": 1,
          "replies": [
            {
              "id": "lc58dzd",
              "score": 0,
              "body": "Yes.",
              "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc58dzd/",
              "created": 1720412078,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lc4zkqg",
      "score": 1,
      "body": "Benzinga has several awesome morning shows every morning,",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4zkqg/",
      "created": 1720407907,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc5g5bp",
      "score": 1,
      "body": "Make sure they are certified financial advisors.\n\nThe Compound and The Money Guys  are two of my favorite channels for financial podcast and they’re all certified financial advisors and generally give excellent advice and aren’t trying to push scams or pump stocks.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc5g5bp/",
      "created": 1720416260,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc5iyuc",
      "score": 1,
      "body": "Invest With Henry is the only YT channel I watch, this dude changed my life by explaining things in an understandable manner without charging me, all freely on YT. He taught me about covered calls first!",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc5iyuc/",
      "created": 1720417943,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc5mbcm",
      "score": 1,
      "body": "I remember having gotta for a moment, pulled my money out when they started the T-Bill nonsense.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc5mbcm/",
      "created": 1720420060,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc5sz1x",
      "score": 1,
      "body": "All the best money managers in the world manage money for a fee.\n\nIf you need to make money from YouTube or from publishing Books or running a class, then you are not very good in investing or managing money. \n\nThink about it: do you really trust a guy on money management if he makes money from selling some fictitious books about rich dads and currently owes the bank a 1billion?\n\nIndian trading classes start the day with a prayer and a chant. How do you even top that :)",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc5sz1x/",
      "created": 1720424472,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc63tuq",
      "score": 1,
      "body": "Content makes Google money.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc63tuq/",
      "created": 1720432070,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc69hzb",
      "score": 2,
      "body": "Money & Macro, Plain Bagel, Patrick Boyle. These guys help me make sense of the big picture.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc69hzb/",
      "created": 1720435745,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc6e4v3",
      "score": 1,
      "body": "Eh. Its entertainment. I actually watch mt k\\*n for some of his analysis of fed documents and company earnings/balance sheets. He seems to know what to look for in those, and whats important - as well as understanding the meaning of the precise words used by the fed. I'm not stupid enough to buy his courses or sponserships - I take whats valuable and leave the rest. Doesn't cost me anything.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc6e4v3/",
      "created": 1720438369,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc6gzns",
      "score": 1,
      "body": "Ben felix and the plain bagel are all you need.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc6gzns/",
      "created": 1720439830,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc6jni0",
      "score": 1,
      "body": "Financial content is a bit paradoxical, if anyone is good with investing, he would already be long retired with his millions if not billions.\n\nIf you had all the money in the world, would you spend thousands upon thousands of hours looking things up, writing scripts and most importantly editing videos? Do you know how insanely long does it take to produce youtube videos?\n\nIts obvious that they don't earn their share of money by investing, they earn it by producing content or selling courses or other scams. In that sense someone dropping a video once a year is already more trustworthy.\n\nYou don't really get any better content that stupid reddit comments, with reddit at least there is a chance that someone successful had a free day and decided to browse shit on internet and leave a comment, but they won't stay around for that long as well.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc6jni0/",
      "created": 1720441119,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc4k8l2",
      "score": 2,
      "body": "How is creating a video any different (better or worse) than writing a post on Reddit?",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4k8l2/",
      "created": 1720401464,
      "depth": 0,
      "replies": [
        {
          "id": "lc5i34v",
          "score": 3,
          "body": "Who said it is?",
          "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc5i34v/",
          "created": 1720417411,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc5xtn8",
          "score": 2,
          "body": "It's not but r/wallstreetbets is real entertainment",
          "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc5xtn8/",
          "created": 1720427865,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc4nq2w",
      "score": 1,
      "body": "My understanding is that Yotta has money in an FDIC insured bank, it’s just that bank is failing. Presumably the FDIC will eventually get everyone’s money back. I hardly see how that’s “financially manslaughter”.\n\nYouTube doesn’t act because they have no reason, legal or financial to do so.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4nq2w/",
      "created": 1720402880,
      "depth": 0,
      "replies": [
        {
          "id": "lc4oi0v",
          "score": 0,
          "body": "Everything you said there is wrong",
          "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4oi0v/",
          "created": 1720403202,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc4p0pu",
      "score": 1,
      "body": "They only stop scammers if they scam rich people.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4p0pu/",
      "created": 1720403421,
      "depth": 0,
      "replies": [
        {
          "id": "lc4t47y",
          "score": 2,
          "body": "What are the odds of a guy with a net worth of 1m searching “Top ten stocks in 2024” on YouTube?",
          "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4t47y/",
          "created": 1720405132,
          "depth": 1,
          "replies": [
            {
              "id": "lc4zi1v",
              "score": 1,
              "body": "He won’t have a net worth of a million for long 😂",
              "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4zi1v/",
              "created": 1720407875,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lc5d9u4",
      "score": 1,
      "body": "Joseph Carlson is the only good one I've found so far",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc5d9u4/",
      "created": 1720414633,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc4mgz8",
      "score": 1,
      "body": "More likely to take YouTube to court for allowing scammers to peddle on their platform.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc4mgz8/",
      "created": 1720402362,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc5iud6",
      "score": 1,
      "body": "You cant protect people from being absolute stupid. Who on the f-ing earth would base their financial decisions on a bunch of 20-30 aomethings indluencers? Like for real...",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc5iud6/",
      "created": 1720417868,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc5t2el",
      "score": 0,
      "body": "The Compound, Joseph Carlson Show, and Unrivaled Investing. Used to love Hamish Hodder too.\n\nStay away from Everything Money and Sven Carlin",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc5t2el/",
      "created": 1720424538,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc5axlf",
      "score": -1,
      "body": "they also have to live, dont they? :)\n\nkinda dissap by graham s....",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc5axlf/",
      "created": 1720413390,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc543ey",
      "score": -3,
      "body": "Haha yeahhh bro. Get you some of that higher education from your youtube bros bro. Make them decisions from some bro you don’t know bro. He’s lookin out for you bro. Gettin ahead in life bro. Yeah bro.",
      "permalink": "/r/stocks/comments/1dxw0gh/financial_youtubers/lc543ey/",
      "created": 1720409979,
      "depth": 0,
      "replies": []
    }
  ]
}