{
  "title": "Paramount agrees to merge with Skydance ",
  "score": 48,
  "selftext": "Paramount Global will merge with Skydance, capping off a months-long negotiation that included various twists and turns, and will see the Redstone family step away from control of the storied movie studio and media company.\n\nParamount’s special committee agreed to the merger on Sunday, days after Shari Redstone’s National Amusements, the controlling shareholder of Paramount, once again reached a preliminary agreement with Skydance. A deal had weeks earlier been stopped in its tracks.\n\nThe latest iteration of the deal will see the buying consortium, which includes RedBird Capital Partners and KKR, invest more than $8 billion into Paramount and to acquire National Amusements. The deal gives National Amusements an enterprise value of $2.4 billion, which includes $1.75 billion in equity.\n\n“It’s a new Paramount, it’s not just a catchphrase,” said RedBird’s Jeff Shell, the former NBCUniversal CEO, on a call with investors Monday. “We think it’s going to be a new day for these combined assets.”\n\nEllison will lead the combined company as CEO, while Shell will serve as president.\n\nThe merger is subject to regulatory approval. It also includes a 45-day “go-shop period,” in which the Paramount special committee can solicit other offers.\n\nA completed Skydance merger would mark a major shift for the ownership of Paramount, as well as for Hollywood as a whole.\n\nThe Redstone family has long controlled the movie studio — known for films such as “The Godfather,” “Top Gun,” and “Forrest Gump” — as well as the CBS broadcast network and cable TV networks like MTV and Nickelodeon.\n\nThe merger will also put David Ellison, the founder of the production company Skydance and son of Oracle founder and billionaire Larry Ellison, at the helm of a major movie studio and among Hollywood’s elite.\n\nParamount’s shares were trading at roughly $12 per share premarket Monday.\n\nThe stock has been on a roller coaster in the last year as the legacy media giant faced a weak advertising market and the continued bleeding of cable TV customers. Its flagship streaming platform, Paramount+, is also yet to reach profitability.\n\nReaching a deal\n\nLate last year Paramount began deal discussions with interested buyers, including, at the time, Warner Bros. Discovery. On top of the industry headwinds, Paramount is strapped with a hefty debt load of nearly $15 billion.\n\nSkydance and Paramount inched closer to a deal in recent months, during which time Bob Bakish stepped down as CEO of Paramount and was replaced by a trio of company leaders.\n\nThe parties first agreed to terms of a deal in early June, only to see the deal stopped in its tracks by Redstone a week later.\n\nShortly after, Paramount’s so-called “Office of the CEO” — CBS CEO George Cheeks, Paramount Media Networks CEO Chris McCarthy and Paramount Pictures CEO Brian Robbins — set out on their plan to restructure the company by cutting debt and finding a streaming joint venture partner.\n\nDuring recent weeks, other interested bidders have surfaced, including media mogul Barry Diller.\n\nSource: https://www.cnbc.com/2024/07/08/paramount-skydance-merger.html",
  "link_flair_text": null,
  "id": "1dy83ov",
  "num_comments": 14,
  "created_utc": 1720442952,
  "permalink": "/r/stocks/comments/1dy83ov/paramount_agrees_to_merge_with_skydance/",
  "comments": [
    {
      "id": "lc6rujw",
      "score": 18,
      "body": "Can't imagine the stock price will go up much more",
      "permalink": "/r/stocks/comments/1dy83ov/paramount_agrees_to_merge_with_skydance/lc6rujw/",
      "created": 1720444706,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc6rgkk",
      "score": 23,
      "body": "Terrible industry, poorly managed company and all the way down value investooors talking about the value of \"the IP!\" who are then surprised when bad management barely manages to do the deal that none of the shareholders wanted. Stock is up a mere 1.4% pre market after the deal was announced.\n\nEdit: aaaand opens down. Edit II: Now -5%",
      "permalink": "/r/stocks/comments/1dy83ov/paramount_agrees_to_merge_with_skydance/lc6rgkk/",
      "created": 1720444547,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7341n",
      "score": 7,
      "body": "Down 5.4% so far on the news. Do people think the deal won't be approved?",
      "permalink": "/r/stocks/comments/1dy83ov/paramount_agrees_to_merge_with_skydance/lc7341n/",
      "created": 1720448967,
      "depth": 0,
      "replies": [
        {
          "id": "lc7u0mn",
          "score": 15,
          "body": "There's maybe a little of that but I think more than anything it's just not a good deal/not what shareholders at all wanted. Not everyone is getting the $15 and some people are selling rather than \"I may get $15, I may get a company I don't want anything to do with if it's not getting bought entirely.\" Ronsenblatt apparently valued new Paramount at $9 in a note this AM.\n\nBuffett is already out of PARA and admitted he made a mistake. “I was 100% responsible for the Paramount decision,” Buffett said at Berkshire’s annual shareholder meeting. “It was 100% my decision, and we’ve sold it all and we lost quite a bit of money.” (https://www.cnbc.com/2024/05/04/buffett-says-berkshire-sold-its-entire-paramount-stake-we-lost-quite-a-bit-of-money.html)",
          "permalink": "/r/stocks/comments/1dy83ov/paramount_agrees_to_merge_with_skydance/lc7u0mn/",
          "created": 1720457922,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc8wy9z",
          "score": 6,
          "body": "$400 million separation clause. If Redstone backs out again, Paramount shareholders lose $400 Million in value. If the deal gets blocked by a lawsuit, $400 Million lost.\n\nUpside is 30% at most, assuming you can cash out all your shares at $15. And that's on a deal that's more than a year from closing. But the downside is much scarier. If the deal falls through the stock is going to $9.",
          "permalink": "/r/stocks/comments/1dy83ov/paramount_agrees_to_merge_with_skydance/lc8wy9z/",
          "created": 1720470524,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc7hxs7",
          "score": 2,
          "body": "Just flushing out the longs with stops. Algos can sniff em all out. Just been buying more on the dip.",
          "permalink": "/r/stocks/comments/1dy83ov/paramount_agrees_to_merge_with_skydance/lc7hxs7/",
          "created": 1720453979,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc76vr9",
          "score": 0,
          "body": "This is so strange…",
          "permalink": "/r/stocks/comments/1dy83ov/paramount_agrees_to_merge_with_skydance/lc76vr9/",
          "created": 1720450281,
          "depth": 1,
          "replies": [
            {
              "id": "lc8d0ex",
              "score": 3,
              "body": "Not really. It’s a partial buyout. Everyone will elect to get the cash and get pro-rated.  It’s effectively pricing 43% payment in cash of $15 per share and 57% ownership in the new merger company. Which the market thinks is a lot less than $15 per share. \n\nAt least that’s what it would be pricing if there was a 100% chance of a smooth merger, which there most certainly isn’t.  Shareholders will argue, probably rightly, Shari is getting a better deal than the common and sue, which will bog the whole deal down.",
              "permalink": "/r/stocks/comments/1dy83ov/paramount_agrees_to_merge_with_skydance/lc8d0ex/",
              "created": 1720464051,
              "depth": 2,
              "replies": [
                {
                  "id": "lc8p29y",
                  "score": 1,
                  "body": "Actual payment is 69%.  If we assume new shares are worth zero then each share should be worth $10.35?",
                  "permalink": "/r/stocks/comments/1dy83ov/paramount_agrees_to_merge_with_skydance/lc8p29y/",
                  "created": 1720467984,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lc7bsiq",
      "score": 2,
      "body": "So it sounds like National Amusements is getting a premium, as it only holds 10% of Paramount.\n\nIf true, there may be lawsuits from other shareholders arguing that everyone should be paid equally.",
      "permalink": "/r/stocks/comments/1dy83ov/paramount_agrees_to_merge_with_skydance/lc7bsiq/",
      "created": 1720451944,
      "depth": 0,
      "replies": [
        {
          "id": "lc8rbp0",
          "score": 4,
          "body": "It's accepted that National Amusements will get some sort of premium, equally will never happen.\n\nWith that said, there will undoubtedly be a lawsuit over how much premium.",
          "permalink": "/r/stocks/comments/1dy83ov/paramount_agrees_to_merge_with_skydance/lc8rbp0/",
          "created": 1720468712,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc7zuth",
      "score": 2,
      "body": "Does anyone know what's being paid out per share class?",
      "permalink": "/r/stocks/comments/1dy83ov/paramount_agrees_to_merge_with_skydance/lc7zuth/",
      "created": 1720459810,
      "depth": 0,
      "replies": [
        {
          "id": "lc8c5df",
          "score": 5,
          "body": "Paramount's **class A shareholders will receive $23 apiece in cash or stock**, while class B stockholders will receive $15 per share, equating to a cash consideration totaling $4.5 billion available to public shareholders. (Source CNBC)",
          "permalink": "/r/stocks/comments/1dy83ov/paramount_agrees_to_merge_with_skydance/lc8c5df/",
          "created": 1720463767,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}