{
  "title": "Is Nike a no brainer buy right now??",
  "score": 918,
  "selftext": "Lowest it's been in 5 years. Bought a 76$ call on the 5th. It seems like such a good deal to pass up. Trying to get some thoughts and opinions on this since there seems to be no in-between. People either think it's going to plummit all year or it's going to rebound.",
  "link_flair_text": "Discussion",
  "id": "1dyazsy",
  "num_comments": 871,
  "created_utc": 1720450683,
  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/",
  "comments": [
    {
      "id": "lc782we",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc782we/",
      "created": 1720450688,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7bdl6",
      "score": 3417,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7bdl6/",
      "created": 1720451804,
      "depth": 0,
      "replies": [
        {
          "id": "lc7gf0n",
          "score": 1080,
          "body": "Take that blasphemy over to the stock sub\n\nEdit: stocks only go up\n\nEdit 2: stonks only go up",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7gf0n/",
          "created": 1720453478,
          "depth": 1,
          "replies": [
            {
              "id": "lc8q3um",
              "score": 358,
              "body": "I bought INTC about a 10-15 years ago due to the similar rationale: It was near 5-10 year lows. It's since gone lower. Stocks can always go lower or crab for forever.\n\n1. Intel literally had a duopoly on chips and a monopoly on top down vertical CPU production from design, to research, to testing, to fabs, etcetc. \n\n2. Intel has had a low P/E for like a decade and even lower now. It pays a dividend and has massive insider buying instead of selling like NVDA. \n\n3. Chips are now deemed as \"strategically important\" by the US military/geopoliticals so now INTC will get bailed out if there is a massive recession just like autos/airlines/banks did in the GFC/2020. \n\n4. Also Intel is getting tens of billions of dollars from the US government to build fabs. \n\n5. They can use being a fab to steal tech of other designers since they so fucking far behind (working on 7nm when others are not at 5nm but going down to <3nm).\n\n6. Everyone from AAPL, GOOG, MSFT, META, TSLA, etcetetc all literally begging for ANYONE to give them ANY sort of alternative to NVDA since Jensen has them all by the balls.\n\nYet INTC still eating shit. Things can ***ALWAYS*** get worse.",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8q3um/",
              "created": 1720468321,
              "depth": 2,
              "replies": [
                {
                  "id": "lc8s6k7",
                  "score": 78,
                  "body": "You forgot to mention the nice dividends. I sold it for a loss and never looked back.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8s6k7/",
                  "created": 1720468989,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lc90dtr",
                      "score": 43,
                      "body": "that a part of the prob imo; i guess they're since (new ceo) reduced it some...but a tech company being known as a \"dividend stock\" is juxtaposition imo.",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc90dtr/",
                      "created": 1720471634,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lc9apg8",
                  "score": 53,
                  "body": "On the contrary, I think INTC is just too cheap to ignore, so last week I bought $35 calls (26 JUL 24, post-earnings) for $0.42 (10 contracts). I think it's going to surprise some people. It dipped to $0.36 last week and now sits @ \\~$1.00. And it's up after hours. I think it continues to climb and then pops with earnings. No way INTC lets this AI gold rush slip through its fingers forever.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc9apg8/",
                  "created": 1720475084,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lc9dote",
                      "score": 63,
                      "body": "!RemindMe 3 weeks\n\nBeen burned too many times to count. \n\nAt this point I'm so burned out with INTC that I'm long past the \"buy the dip and invest for the long term\" point (10+ fucking years). \n\nI'm past that to the \"accepted it will dip only AFTER earnings\" point. \n\nEven further past that I'm past the \"I ain't even going to give a shit about the earnings because it dips every time so I don't even bother to sell covered calls before the earnings because it's better to sell put options AFTER earnings cause VIX spikes when INTC shits the bed AGAIN\".\n\nNonononono, I'm past the \"I don't even want to hear about the PoS 🤡 company since it's such a fucking waste of time it doesn't even have good premium for me to sell options on\". \n\nNah, I'm past the \"I don't even give a fuck about the earnings anymore cause these bags won't go to 0 because of the government but not being able to die doesn't mean you'll thrive. Their zombie fucking ass doesn't even have good VIX to make worth selling options on\" point.\n\nNope. I'm at the \"Oh it's been 6-30 months and INTC is at a new 52-wk or ALL-TIME LOW? Well shit. I guess I have some spare cash around. Guess I'll throw some into incinerator. It's probably better than lotto scratchers and Vegas is too far + too ripoff\" point.",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc9dote/",
                      "created": 1720476109,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lc9g94i",
                      "score": 10,
                      "body": "I agree. I've had an open position for the past week and it's been nice. Swinging calls because its too undervalued in this current market",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc9g94i/",
                      "created": 1720477029,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lc9x4hc",
                      "score": 10,
                      "body": ">No way INTC lets this AI gold rush slip through its fingers forever.\n\n10 years ago you\\`d think there would be no way that they'd be dominated by AMD. Here we are.\n\nIntel is a disorganized shitshow of an org.",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc9x4hc/",
                      "created": 1720483340,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lca8gne",
                          "score": 6,
                          "body": "Evvvery rose has its thorns…\n\nYou’re not wrong, but all it takes is some positive news. That’s why I’m not going yolo with it, just a small stock position in one account and a few option contracts in another account. My conviction isn’t sky high, but directionally, I think it will do better than some others *at this point*. I think NVDA, AMD, et. al. are going sideways for the time being. JMO.",
                          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lca8gne/",
                          "created": 1720487759,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lc9eg8p",
                  "score": 15,
                  "body": "I didn’t think this would happen but I’m buying Intel tomorrow 😂 ",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc9eg8p/",
                  "created": 1720476381,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lc9ikv4",
                      "score": 40,
                      "body": "Bruh.... \n\nThis isn't like I'm being malicious by shilling my stock so others can buy in while I unload my bags. I don't intend to sell anyways. My INTC bags have crabbed so long it's like that wife you haven't fuck for 35yrs but after +40yrs of marriage you don't bother to divorce just cause it's not worth the trouble and your dick can't even get up anymore. You're so jaded with her you can't feel love, hate, or anything but you go through the motions just cause that's how it's like.\n\nNor is it like like I'm striking some secret gold mine while telling you guys there's nothing down here.\n\nNo. This is like a gorilla screaming at the other gorillas not to come over because he's in fucking quicksand. And you're the gorilla saying he wants to jump in too. Please save yourself the trouble.",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc9ikv4/",
                      "created": 1720477879,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lc9pdd2",
                          "score": 13,
                          "body": "Ah the old rope a dope, I ain’t fallin’ for those rotten bananas!",
                          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc9pdd2/",
                          "created": 1720480400,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lca78hi",
                          "score": 7,
                          "body": "Damn.. you really going through it huh? I’m praying for you",
                          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lca78hi/",
                          "created": 1720487279,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lcaac0x",
                          "score": 8,
                          "body": "Holy shit",
                          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lcaac0x/",
                          "created": 1720488493,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lcb1qym",
                          "score": 3,
                          "body": "Thank you for your sacrifice.",
                          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lcb1qym/",
                          "created": 1720500555,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lc9t6od",
                  "score": 7,
                  "body": "Yeah, I hear you. Every time I look at INTC I just see a sexy gal shakin' that ass walking down the street but it's stock performance has been underwhelming.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc9t6od/",
                  "created": 1720481834,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcb4lvs",
                  "score": 4,
                  "body": "Also brought in a few years ago And still waiting to make money from the share 😆",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lcb4lvs/",
                  "created": 1720502121,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcbizg4",
                  "score": 4,
                  "body": "It's a fucking gamble, seriously. If a stock goes up or down has exactly nothing rational to it.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lcbizg4/",
                  "created": 1720511152,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcf78n5",
                  "score": 4,
                  "body": "It’s going to be a while for anyone to catch up to nvda.\n\nI've been diving deep into the AI chip market, and it’s pretty obvious that NVIDIA is dominating. Here’s why I think their competitors are going to have a really tough time catching up:\n\n1. Technological Leadership and Innovation:\nNVIDIA's GPUs, especially their CUDA platform, are the gold standard for AI and deep learning. They’re always pushing the limits with performance and efficiency, and their constant innovation keeps them miles ahead of the competition.\n\n2. Comprehensive Ecosystem:\nNVIDIA isn’t just about the hardware. They’ve built an entire ecosystem with software frameworks, development tools, and platforms like NVIDIA GPU Cloud (NGC). This makes it super easy for developers to adopt and optimize their tech. It’s a one-stop shop that’s hard to beat.\n\n3. Strategic Partnerships and Collaborations:\nThey’ve locked in partnerships with the big guns—Google, Amazon, Microsoft—you name it. These alliances mean NVIDIA’s GPUs are everywhere, especially in the largest cloud platforms. This kind of reach and integration is a massive advantage.\n\n4. R&D Investment and Talent:\nNVIDIA spends big on R&D and attracts top-tier talent in AI and chip design. This investment in innovation ensures they’re always at the cutting edge. When you have the best minds and the money to back them, staying ahead of the competition is a given.\n\n5. Market Penetration and Brand Strength:  \nNVIDIA got into the AI chip market early and has cemented its position as the go-to brand. Their early start and consistent innovation mean they’ve captured a huge market share. Plus, people trust NVIDIA’s products, making it tough for competitors to lure users away.\n\n6. Scale and Manufacturing Efficiency:\nNVIDIA’s scale gives them a cost advantage that’s hard to match. They can produce AI chips more efficiently, which means better pricing for customers. This scale also lets them invest in next-gen manufacturing tech, solidifying their lead even more.\n\nTL;DR: NVIDIA’s got the tech, the ecosystem, the partnerships, the R&D, the brand, and the scale. They’re not just leading the AI chip market; they’re dominating it. Competitors have a steep hill to climb if they want to catch up.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lcf78n5/",
                  "created": 1720563263,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lc9rtiq",
                  "score": 10,
                  "body": "Intel chips just aren’t very good right now.  It could change, but it will take a few years. They need a complete revamp of priorities.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc9rtiq/",
                  "created": 1720481317,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lc88ys7",
              "score": 48,
              "body": "Correct. Stocks (and real estate) only go up. People need to take their pessimism somewhere else.",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc88ys7/",
              "created": 1720462740,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lc81sds",
          "score": 47,
          "body": "Pfizer, Disney, Nike... all top tier companies in their fields at a 5 year low more or less.",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc81sds/",
          "created": 1720460432,
          "depth": 1,
          "replies": [
            {
              "id": "lc8wvbj",
              "score": 96,
              "body": "Model collapse isn't at all about garbage in, garbage out. The quality of the data isn't the issue. The quality of the generated data can be curated to be higher than average real-world data. Pretty much every AI company today is pursuing so-called \"synthetic data\" with success.\n\nModel collapse is about \"zeroing out\" unlikely outputs. To simplify, as the model gets trained on its own outputs, the probability distribution for possible outputs collapses towards a single point. Rare outputs vanish and can never occur again even when they would be correct for a rare input. Buy your books with cash.",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8wvbj/",
              "created": 1720470498,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lc7uw1t",
          "score": 68,
          "body": "I don’t know if a pharmaceutical company coming out of a pandemic is comparable to a shoe company",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7uw1t/",
          "created": 1720458207,
          "depth": 1,
          "replies": [
            {
              "id": "lc8x1ek",
              "score": 22,
              "body": "It’s comparable in that OP is making a (big) assumption that “it can’t go lower” - that’s what peo0le thought about PFE a year ago.  Broken stocks can always go lower",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8x1ek/",
              "created": 1720470551,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lc7mskf",
          "score": 171,
          "body": "Pfizer doesnt make cool shoes though ![img](emote|t5_2th52|12787)",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7mskf/",
          "created": 1720455582,
          "depth": 1,
          "replies": [
            {
              "id": "lc7n283",
              "score": 400,
              "body": "Neither does Nike.",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7n283/",
              "created": 1720455669,
              "depth": 2,
              "replies": [
                {
                  "id": "lc7nq85",
                  "score": 149,
                  "body": "well yeah, they leave that to the 5 year olds",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7nq85/",
                  "created": 1720455885,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lc8wr8w",
                      "score": 17,
                      "body": "Nike unfortunately has been spending too much money on gender politics when they should have stayed in their lane and design better athletic apparels to compete with lululemon and Adidas on quality products\n\nEven out of no where Alo has cornered much of their most profitable market segment",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8wr8w/",
                      "created": 1720470461,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lc9rl4l",
                          "score": 13,
                          "body": "Turns out suburban white kids and the urban black kids they copy really don’t give a fuck about gender politics\n\nSome industries really should just sell the slop",
                          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc9rl4l/",
                          "created": 1720481228,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lc8409k",
                  "score": 35,
                  "body": "Boom roasted",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8409k/",
                  "created": 1720461144,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lc893b1",
                  "score": 34,
                  "body": "It should've been a sign to all investors that this was a lead balloon when their best selling shoes for the last 5 years have been the ones they designed almost 30 years ago.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc893b1/",
                  "created": 1720462781,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lc93bhu",
                      "score": 5,
                      "body": "Aren’t the best selling Adidas like Superstar, Samba and Stan Smith? Doubt that’s unique to Nike",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc93bhu/",
                      "created": 1720472584,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lc863h9",
                  "score": 14,
                  "body": "The most out of touch post on here",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc863h9/",
                  "created": 1720461811,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lc7ser3",
          "score": 15,
          "body": "Try INTC next",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7ser3/",
          "created": 1720457409,
          "depth": 1,
          "replies": [
            {
              "id": "lc7v12a",
              "score": 32,
              "body": "I think my ex was one of those, wouldn't recommend.",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7v12a/",
              "created": 1720458253,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lc7rcjo",
          "score": 8,
          "body": "Amen to the Peter Lynch church brother",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7rcjo/",
          "created": 1720457069,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc8p5ao",
          "score": 3,
          "body": "lol are you me? I’ve been bag holding PFE for the same reasons",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8p5ao/",
          "created": 1720468011,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc7jn1s",
          "score": 7,
          "body": "I thought it would bounce slightly in the past few days that it dropped but I have a feeling it will just get lower",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7jn1s/",
          "created": 1720454539,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc9auno",
          "score": 3,
          "body": "And here I thought I was the only one. Fear not, fellow shitty stock picker, you have company!",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc9auno/",
          "created": 1720475133,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc7lved",
          "score": 2,
          "body": "![img](emote|t5_2th52|27189)",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7lved/",
          "created": 1720455280,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc7a7hj",
      "score": 1865,
      "body": "\"Lowest it's been in 5 years\" could be \"the highest it's going to be in the next 10.\"\n\nI actually bought some shares since seems like a decent hold getting in this low, but as for calls? Eh.. we'll see how the Clark shoes sell.",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7a7hj/",
      "created": 1720451411,
      "depth": 0,
      "replies": [
        {
          "id": "lc7gmzm",
          "score": 257,
          "body": "Isn’t it sitting at 26 p\\e now or something like that? Seems very expensive from the start. It’s not really in value territory yet",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7gmzm/",
          "created": 1720453550,
          "depth": 1,
          "replies": [
            {
              "id": "lc7mqj4",
              "score": 218,
              "body": "I think it's low 20 ish now.  Still high especially since the whole \"buy Nike shoes as an investment because they shat out another color way\" fad is dying out.\n\n\n They have like huge competition in general athletic wear. A huge chunk of their stuff is barely above Temu quality. And the whole athletic wear trend is dying down.  \n\n\n At this point they don't even have the high end performance bullshit going for them. \n\n\n If they made a jacket that didn't fall apart they might weather the headwinds. But they don't. Gonna be a slow decline unless the fashion gods show mercy. ",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7mqj4/",
              "created": 1720455564,
              "depth": 2,
              "replies": [
                {
                  "id": "lc7pe2y",
                  "score": 42,
                  "body": "I disagree about performance, they still have good shoes for sports,etc. It's just that people don't wear that day to day anymore",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7pe2y/",
                  "created": 1720456434,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lc7rw7j",
                      "score": 32,
                      "body": "That's the biggest problem, their product currently is in a very strange place. It is set in a premium price, but the longevity and the performance isn't there, so people just don't want to wear them except for special occasions. So now their shoes become something of a fashion fad. \n\nProblem, the price of the wear are not so premium that they are making banks on each shoe or shirt or something. They are like a bit higher than your usual sportswear, but nowhere ludacris enough to be Gucci or Chanel.\n\nSo now they're selling so little if not enough margin for every single product they are selling.",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7rw7j/",
                      "created": 1720457244,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lc7q080",
                  "score": 59,
                  "body": "I agree. Companies like underarmor and lululemon are caninalizing their marketshare and theyre also losing running shoes market share to companies like hokka.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7q080/",
                  "created": 1720456634,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lc81k0n",
                      "score": 94,
                      "body": "I don’t know where you’ve been but Under Armour isn’t taking market share from anyone.",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc81k0n/",
                      "created": 1720460356,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lc7vjo0",
                      "score": 57,
                      "body": "My girl and all her co workers won't shut up about hokka.",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7vjo0/",
                      "created": 1720458426,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lc7zum8",
                          "score": 44,
                          "body": "They’re too ugly",
                          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7zum8/",
                          "created": 1720459808,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lc81kgq",
                              "score": 107,
                              "body": "[deleted]",
                              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc81kgq/",
                              "created": 1720460360,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lc87pqq",
                                  "score": 18,
                                  "body": "they whole gang is ugly af.",
                                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc87pqq/",
                                  "created": 1720462337,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lc8exzv",
                                      "score": 7,
                                      "body": "They should keep running…",
                                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8exzv/",
                                      "created": 1720464679,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lc9c1pj",
                          "score": 18,
                          "body": "You gotta Hokka tuah that thing. 🤣",
                          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc9c1pj/",
                          "created": 1720475541,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lc7wwq3",
                      "score": 13,
                      "body": "[deleted]",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7wwq3/",
                      "created": 1720458865,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lc7we6b",
                      "score": 12,
                      "body": "These are all eminently solvable problems for Nike. I would argue Lululemon has more of a threat from Nike than Nike does from Lululemon. Lulu is running into quality issues themselves and it's not as though clothes made of stretchy fabric is some groundbreaking tech that's impossible to replicate. They are living off their brand reputation...but Nike is ***THE*** brand. If they put their sights on Lulu's market, I'd put money (and am) on Nike winning that battle. There's a very large portion of men who will be very difficult to convert to Lulu, but they already buy Nike. And there's a chasm between NIke's stock price and Lulu's which doesn't make a whole lot of sense.",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7we6b/",
                      "created": 1720458701,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lc7zmur",
                          "score": 13,
                          "body": "I don't know. I buy Lulu and I would never buy Nike.",
                          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7zmur/",
                          "created": 1720459738,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lc86eb2",
                              "score": 12,
                              "body": "I buy Lulu too, but for example my older brother and dad, I doubt I will ever see them wear any Lululemon clothing. They associate it with women and for their respective generations, it's an absolute nonstarter to ever be caught dead in something women wear. Not saying I agree with the logic, just saying it exists and getting them to change their minds is basically an impossible task. They would wear the exact same clothing as lulu if it had a NIke logo on it, but never with a lulu logo.",
                              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc86eb2/",
                              "created": 1720461909,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lc80cj9",
                              "score": 20,
                              "body": "I have no idea how LuLu is so popular in the US. The clothes are extremely basic with little branding, expensive and overrated in terms of quality/comfort. I can see why it isn't as popular here in Europe. Perhaps it's the obesity crisis in the states as a lot of the wearers of it seem to be hugely overweight and almost tucked into the gear.\n\nON is a different story, expensive yes but quality trainers and gear.\n\nUnder Armour is the one I really don't understand. Favoured by overweight middle aged men in the States and unpopular yet widely wore in the UK and seen as fashionable. Quality also seems different.",
                              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc80cj9/",
                              "created": 1720459966,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lcam37v",
                                  "score": 3,
                                  "body": "They’re not overrated in terms of quality.  They make hands down the best male golf apparel, hoodies, windbreakers in their price range.  Can’t speak to their yoga pants but have rarely heard anything negative about them and I live in the founding city where everyone and their dog wears them.",
                                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lcam37v/",
                                  "created": 1720493209,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lc7wm3z",
                  "score": 13,
                  "body": "Nike is by far the most popular sports brand. If you look at the 10 best selling sneakers for any year in the last decades, you‘ll probably always see at least five Nike / Jordan / Converse shoes. \n\nRight now Adidas is having great success with the Samba and similar shoes, moreover New Balance had a great year with the 550. However these successes depend too much on single models enjoying a hype. Once the Samba is out of fashion, what is Adidas left with? They depend on creating a new hype like they had to before with the Yeezy. That‘s something very hard to predict.\n\nNike in comparison has multiple staples like the Air Force, the Jordan 1, Jordan 4 and the Dunk. Their hypes build on these models through collaborations (e.g. Travis Scott) or colorways (Panda dunks). But even if they don‘t have any hype just like at the moment, these models still sell in their basic versions.\n\nBrands like ON or Hoka are also having a moment right now, just like Veja had its moment 2 years ago.\n\nFor now people are just taking a little break from Nike besides the classics. Nike was just  too omnipresent after the competition from Yeezy was gone.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7wm3z/",
                  "created": 1720458771,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lc7yxux",
                      "score": 7,
                      "body": "They can be popular and still not justify the pe ratio. \n\n\nThe hype around the classics is Dy mg because they oversaturated the market. The whole \"Nikes as an investment\" dumb fad is dying. You can see on sneaker resale sites prices are barely above retail. \n\n\nThe pe ratio was dependent on Nike still being a fashion icon, but it isn't. \n\n\nIt's not like it's gonna go bankrupt, just that a dealer company that's going out of fashion maybe doesn't deserve the PE ratio of Google.",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7yxux/",
                      "created": 1720459516,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lc817lo",
                          "score": 4,
                          "body": "The classics were never on resale sites. No one is putting a triple white AF1 on StockX. Nevertheless it‘s the best selling sneaker in the world. \n\nBut we can both agree that they oversaturated the market. Plus they also relied heavily on HipHop culture which isn‘t as dominant as it used to be. They will move a bit more to the mainstream focussing on athletes or use Converse to cater to niche groups outside of the Nike spectrum.\n\nIt’s almost guaranteed though that they will have another hyped sneaker, the question is only when.",
                          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc817lo/",
                          "created": 1720460245,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lc7rzjy",
              "score": 21,
              "body": "Look at s&p500 PE ratio. Its almost 30. I'd take nike over the majority of companies in the s&p 500. And yes I did buy some calls",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7rzjy/",
              "created": 1720457274,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lc7s9gz",
              "score": 9,
              "body": "PE is just below 20 now. It’s likely to keep dropping at the stock isn’t performing well. \n\nIt will likely be a buy in a few months. If they report another bad quarter in September, expect the stock to be in the $50 or below range",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7s9gz/",
              "created": 1720457363,
              "depth": 2,
              "replies": [
                {
                  "id": "lc89qck",
                  "score": 8,
                  "body": "They have guided lower for coming quarters, playing conservative and then hopefully coming out ahead on those muted forecast. This game is too familiar to pass up on.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc89qck/",
                  "created": 1720462987,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lc812tl",
          "score": 36,
          "body": "This is one of those times (in my opinion) where you see fear and capitalize on it.\n\nNKE won’t be the next nvdia for sure, but even if the stock goes does a bit more, the brand is here to stay.  It’s a household name, period.\n\nI bought some, probably just holding for life to be honest",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc812tl/",
          "created": 1720460202,
          "depth": 1,
          "replies": [
            {
              "id": "lca6e83",
              "score": 7,
              "body": "GE is a household name too",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lca6e83/",
              "created": 1720486950,
              "depth": 2,
              "replies": [
                {
                  "id": "lcaa25t",
                  "score": 8,
                  "body": "and so is Sears lmao",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lcaa25t/",
                  "created": 1720488384,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lc7lwbk",
          "score": 9,
          "body": "![img](emote|t5_2th52|27189)",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7lwbk/",
          "created": 1720455288,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc81xa3",
          "score": 5,
          "body": "Like Eastman Kodak",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc81xa3/",
          "created": 1720460474,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc7rr65",
          "score": 11,
          "body": "Nike trading at like roughly 2x revenue and 20 PE. All they need is like a reasonable quarter and the stock can double. Just depends if they can execute.",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7rr65/",
          "created": 1720457200,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc79l71",
      "score": 336,
      "body": "Wow they are at a 52 week low today.",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc79l71/",
      "created": 1720451202,
      "depth": 0,
      "replies": [
        {
          "id": "lc7tijn",
          "score": 136,
          "body": "You know 52 weeks is just 1 year right? Consumer trends can last many years and around 2017 it was in the 60s.",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7tijn/",
          "created": 1720457762,
          "depth": 1,
          "replies": [
            {
              "id": "lc84vzy",
              "score": 108,
              "body": "Yeah but did you know that 52 weeks is 364 days?",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc84vzy/",
              "created": 1720461422,
              "depth": 2,
              "replies": [
                {
                  "id": "lc8tgzh",
                  "score": 10,
                  "body": "69 weeks is 420 days or more",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8tgzh/",
                  "created": 1720469407,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lc8cr46",
                  "score": 13,
                  "body": "Does that include the leap week",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8cr46/",
                  "created": 1720463967,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lc8gdsx",
                      "score": 19,
                      "body": "Leap week costs extra",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8gdsx/",
                      "created": 1720465143,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lc7afg9",
          "score": 13,
          "body": "Zoom out.",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7afg9/",
          "created": 1720451486,
          "depth": 1,
          "replies": [
            {
              "id": "lc8o9th",
              "score": 13,
              "body": "Folks who bought it at $120 must have been super bullish and were like “lookit how this stock goes up!”",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8o9th/",
              "created": 1720467728,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lc7ao1i",
              "score": 7,
              "body": "And?",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7ao1i/",
              "created": 1720451567,
              "depth": 2,
              "replies": [
                {
                  "id": "lc7dza5",
                  "score": 62,
                  "body": "He's saying that it's also at a 5 year low",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7dza5/",
                  "created": 1720452669,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lc7e7i2",
                      "score": 18,
                      "body": "Wow.",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7e7i2/",
                      "created": 1720452745,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lcey0kw",
          "score": 2,
          "body": "It is the lowest NKE has been since the Covid dip, before that you are looking at 2019 for the same price. \n\nCompare financials between now and 2019, which is better?",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lcey0kw/",
          "created": 1720560097,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc7mzgx",
      "score": 174,
      "body": "Dude as a former sneaker fan I can confirm that they just don’t make good kicks anymore. Nobody does really.",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7mzgx/",
      "created": 1720455644,
      "depth": 0,
      "replies": [
        {
          "id": "lc891wo",
          "score": 23,
          "body": "I haven't had a pair of sneakrs in a while (lots of slip ons and boots) and I went to buy a pair yesterday and FUCK they're all so god damn ugly! Everythings got some weirdly chunky design with a 2\" lift and the thinnest materials possible with absolutely zero tread design.\n\nWound up with a pair of Merrells because they were the most shoe like shoe.",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc891wo/",
          "created": 1720462769,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc7tizd",
          "score": 39,
          "body": "I would give made in USA New Balances a look",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7tizd/",
          "created": 1720457766,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc9zt8h",
          "score": 6,
          "body": "ASICS are quite good, highly recommend",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc9zt8h/",
          "created": 1720484382,
          "depth": 1,
          "replies": [
            {
              "id": "lcd0rwy",
              "score": 2,
              "body": "What is this 2012? People are wearing ON’s and Hoka’s now. Catch up",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lcd0rwy/",
              "created": 1720537910,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lc8gjyx",
          "score": 4,
          "body": "I got so disillusioned by sneakers that I roll around in hiking boots most the time now. Much more comfortable for standing for several hours a day and they last closer to three years.",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8gjyx/",
          "created": 1720465199,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc78gpk",
      "score": 429,
      "body": "I think historically after the olympics they usually have a really good run. But my only concern is that a lot of brands seem to be getting a bite of Nike's business. Im part of a running club and I barely see nike sometimes lol",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc78gpk/",
      "created": 1720450817,
      "depth": 0,
      "replies": [
        {
          "id": "lc7hl9v",
          "score": 243,
          "body": "Ya the new trendy running shoes are those Hokas",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7hl9v/",
          "created": 1720453864,
          "depth": 1,
          "replies": [
            {
              "id": "lc7uwdo",
              "score": 77,
              "body": "After years about hearing about Hokas, I caved. They are the most comfortable shoes I’ve ever worn.",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7uwdo/",
              "created": 1720458210,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lc7jyd3",
              "score": 93,
              "body": "Brooks, too.",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7jyd3/",
              "created": 1720454643,
              "depth": 2,
              "replies": [
                {
                  "id": "lc7m3dq",
                  "score": 80,
                  "body": "Brooks have always been the GOAT for me, with Asics being a close second. Brooks tend to have wider toe boxes and their trainers are durable. Been running in the Adrenaline series for 11 years now and probably won't ever change.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7m3dq/",
                  "created": 1720455352,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lc7mlqi",
                      "score": 27,
                      "body": "Definitely, I found the brooks ghosts about 10 years ago and have exclusively done my running in them since.",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7mlqi/",
                      "created": 1720455520,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lc8ym86",
                          "score": 5,
                          "body": "Same story. That wide toe box is life. The shoes also just feel great on the feet.",
                          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8ym86/",
                          "created": 1720471063,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lc7tm1i",
                      "score": 9,
                      "body": "Asics Novablast 4s are the best running shoes I've ever owned. I might spring for the superblasts next. I do agree on the toebox, the NB4s could be slightly bigger. ",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7tm1i/",
                      "created": 1720457793,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lc7mqmh",
                  "score": 8,
                  "body": "I have some brooks, but I loved ASICS when I ran cross country. For me, it was the 1040 gels with some arch support. Shoes were so light. ",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7mqmh/",
                  "created": 1720455565,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lc8u1xu",
              "score": 16,
              "body": "And On",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8u1xu/",
              "created": 1720469597,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lc8leh9",
              "score": 12,
              "body": "Hokas were last year we’re moving into altras and topo athletic flat footed shoes now",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8leh9/",
              "created": 1720466791,
              "depth": 2,
              "replies": [
                {
                  "id": "lc9d79z",
                  "score": 2,
                  "body": "Hokas weren't even the shoe last year there's so many other brands ",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc9d79z/",
                  "created": 1720475941,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lc864qw",
              "score": 34,
              "body": "Hoka Tuahs",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc864qw/",
              "created": 1720461823,
              "depth": 2,
              "replies": [
                {
                  "id": "lca7bm6",
                  "score": 4,
                  "body": "How has hoka not jumped on this yet",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lca7bm6/",
                  "created": 1720487312,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lc8empx",
              "score": 16,
              "body": "They look awful tho",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8empx/",
              "created": 1720464578,
              "depth": 2,
              "replies": [
                {
                  "id": "lc9lqxe",
                  "score": 7,
                  "body": "You don’t dress for style when running/training, you dress for comfort.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc9lqxe/",
                  "created": 1720479047,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcc6d79",
              "score": 2,
              "body": "Damn I knew that for years and should have bought stock it that",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lcc6d79/",
              "created": 1720526080,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lcaoajw",
          "score": 18,
          "body": "🛎️. Someone finally hit the nail on the head. Nike’s problems are entirely self inflicted. During the pandemic, they decided to go all in on direct to consumer channels and take supply away from the wholesale market (outlets like foot locker, finish line, Nordstrom, academy, etc).  This was categorically dumb. For example, Nike would make up 65%+ of foot locker’s sales most years. Those retailers then filled their suddenly empty self space with hoka, on, adidas, new balance, ASICS, etc. Those brands have since thrived as a result of their newfound distribution and the fact that people returned to shopping in person. People like to be able try on shoes and apparel in person. Who knew? Not sure why Nike leadership made such a drastic move without seeing the data in a post pandemic world first. \n\nThat said, these are still the facts. Nike has the best balance sheet in the space and can buy pretty much any sponsorship they want. They can take back a large chunk of that retailer shelf space if they want.  The other brands still don’t have really great direct to consumer experiences so Nike can still win on technology. The other brands also will have difficulty diversifying. Examples: Under armour’s failed expansion into shoes. Adidas’s relatively small market share in basketball despite spending hundreds of millions on endorsements and making the nba jerseys for awhile. On and hoka will have trouble growing outside of running and getting into apparel in a major way. The Chinese brands like anta and li-ning can’t grow outside of China. We’ve seen this before with brooks, saucony, etc. This is why Nike has survived every environment. They have meaningful market share in every category and dominant share in many categories. \n\nUnfortunately, they’ll probably have to replace the ceo who got them in this mess for this to materialize. Lesson: never invest in a guy whose claim to fame is running eBay into irrelevance.",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lcaoajw/",
          "created": 1720494147,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc7sprb",
          "score": 17,
          "body": "Saucony is the way",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7sprb/",
          "created": 1720457507,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc78pby",
          "score": 32,
          "body": "On shoes is a great  example of an incumbent that's done pretty well this year.",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc78pby/",
          "created": 1720450899,
          "depth": 1,
          "replies": [
            {
              "id": "lc7j87h",
              "score": 8,
              "body": "I own a pair of Ons and haven’t stopped recommending them lol",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7j87h/",
              "created": 1720454402,
              "depth": 2,
              "replies": [
                {
                  "id": "lc7njdd",
                  "score": 19,
                  "body": "They're a good fashion athlesiure shoe but I feel like the price/performance is not there. I see them way more often in my bougie tech office than at my run club.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7njdd/",
                  "created": 1720455824,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lc7ubq1",
                  "score": 5,
                  "body": "Would never recomment them to anyone over 60kg.  But for those 2 or 3 weeks before they break and start squeaking they are honestly great!  \n\nSeriously they are my current favorite, I wish they didn't do that.  My nikes will do 500 or 600km but the Ons... 100? Maybe? And that's just walking and light hiking.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7ubq1/",
                  "created": 1720458022,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lc7qxe9",
          "score": 18,
          "body": "Yeah but I’m worried that their Olympic stuff is so trash that it won’t help this year. Have you seen the god awful track outfits? If Mr. Skin is still around he is going to get a ton of accidental genital flop photos out of those things. Plus they are farming out apparel making to Fanatics which is well known for making garbage. I’m stuck holding a bag on Nike and praying I’m wrong so I can sell as fast as possible.",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7qxe9/",
          "created": 1720456932,
          "depth": 1,
          "replies": [
            {
              "id": "lc7t56t",
              "score": 5,
              "body": "lmao. yes, I also saw the \"poop\" protests. Really bad location for the olympics imo.\n\nsrc: [https://www.usatoday.com/story/news/world/2024/06/28/pooping-in-the-olympic-river-paris-games-spark-talk-of-dirty-protest/74229634007/](https://www.usatoday.com/story/news/world/2024/06/28/pooping-in-the-olympic-river-paris-games-spark-talk-of-dirty-protest/74229634007/)",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7t56t/",
              "created": 1720457642,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lc7q7ky",
          "score": 9,
          "body": "I’ve always been a Brooks guy, and most runners I know are Brooks people. Personally I didn’t care for the Ghost 15, so I’ve been shopping alternatives, and haven’t even considered a Nike product.",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7q7ky/",
          "created": 1720456701,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc7quja",
          "score": 18,
          "body": "That’s cause Nike running shoes are fucking ridiculously expensive. I bought the alpha fly 3 last week. It was a 300 dollar purchase.",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7quja/",
          "created": 1720456907,
          "depth": 1,
          "replies": [
            {
              "id": "lc7tdgn",
              "score": 43,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7tdgn/",
              "created": 1720457716,
              "depth": 2,
              "replies": [
                {
                  "id": "lc7v4o7",
                  "score": 21,
                  "body": "Sir this is Wall Street bets.\n\nThe shoe promised me an 8% gain…\n\nIn performance for a race I’ve never done before.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7v4o7/",
                  "created": 1720458287,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lc7x661",
                  "score": 6,
                  "body": "I’m a vomero slut",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7x661/",
                  "created": 1720458949,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lc7btdo",
      "score": 235,
      "body": "The use of Nike shoes is at a low point among athletes...",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7btdo/",
      "created": 1720451952,
      "depth": 0,
      "replies": [
        {
          "id": "lc7ebej",
          "score": 88,
          "body": "This is true at my son’s school I’m seeing more & more kids using different brands it’s not like when I was a school if u had a pair of Nikes you were cool.",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7ebej/",
          "created": 1720452782,
          "depth": 1,
          "replies": [
            {
              "id": "lc7hlk1",
              "score": 99,
              "body": "It goes in cycles, people said the same about adidas before the ultra boosts and Yeezy revived it. Nike needs a catalyst and I think they’re just biding their time until the find the right hype wave. \n\nThe big boys always stay around",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7hlk1/",
              "created": 1720453866,
              "depth": 2,
              "replies": [
                {
                  "id": "lc7n69a",
                  "score": 29,
                  "body": "I feel like it depends a ton on the sport. \n\nFor your average runner they're not even in the conversation anymore as a non-pro. Brooks, Altra, Hoka, On (tho I do judge the On people a little tbh) kinda took over. And that's not even including Saucony, Asics and Addidas that generally maintained their presense. If they want back in they'd have to give people a reason.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7n69a/",
                  "created": 1720455705,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lc7j9s5",
                  "score": 24,
                  "body": "They lost a lost of hype around their exclusive sneaker collaborations. \n\nUnfortunately Virgil Abloah died who was designing highly demanded sneaker through the year and therefore hyping up the whole brand.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7j9s5/",
                  "created": 1720454416,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lc7nq9d",
                      "score": 6,
                      "body": "I don’t disagree, but they will figure something out. Money talks, the next big thing/person they will be desperate to get their hands on.",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7nq9d/",
                      "created": 1720455886,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lc7uw75",
                  "score": 10,
                  "body": "Sears used to be the Big Boy.\n\nNot saying they can’t do it, but it’s definitely not guaranteed.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7uw75/",
                  "created": 1720458209,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lc7wh85",
                      "score": 3,
                      "body": "You’re not wrong, but for now at least, Nike isn’t in as precarious a position as Sears was. They are just lacking creativity, and are caught in a fashion cycle as the odd man out. They should be able to survive it, they still lead in a lot of specialized sport equipment.",
                      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7wh85/",
                      "created": 1720458728,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lc7j71r",
          "score": 10,
          "body": "And even at the professional level, they are running into issues with their quality \n\n  \n[https://www.espn.com/mlb/story/\\_/id/40046470/mlb-modify-uniforms-player-complaints-per-memo](https://www.espn.com/mlb/story/_/id/40046470/mlb-modify-uniforms-player-complaints-per-memo)",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7j71r/",
          "created": 1720454392,
          "depth": 1,
          "replies": [
            {
              "id": "lc82pcp",
              "score": 3,
              "body": "Yea but they just pay to put the logo fanatics makes the actual uniform",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc82pcp/",
              "created": 1720460728,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lc7j2f1",
      "score": 220,
      "body": "Nike's trail running shoes are white. That's all you need to know about how fucked they are.",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7j2f1/",
      "created": 1720454349,
      "depth": 0,
      "replies": [
        {
          "id": "lc7sk2z",
          "score": 41,
          "body": "The mens are white for some inexplicable reason. They had all black pairs (an obvious choice for trail shoes since they will get dirty as hell) at one point, but yes that is a blunder imo.",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7sk2z/",
          "created": 1720457456,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc7ok5o",
          "score": 27,
          "body": "Half the people buying them want to appear as though they use them.",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7ok5o/",
          "created": 1720456160,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc82g4f",
          "score": 6,
          "body": "*stares at my brown trail runners from nike*",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc82g4f/",
          "created": 1720460645,
          "depth": 1,
          "replies": [
            {
              "id": "lcbc00l",
              "score": 2,
              "body": "All of them are brown after a while",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lcbc00l/",
              "created": 1720506495,
              "depth": 2,
              "replies": [
                {
                  "id": "lcbe81r",
                  "score": 3,
                  "body": "Just like my underwear.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lcbe81r/",
                  "created": 1720507935,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lc84pb8",
      "score": 36,
      "body": "Don’t ask a subreddit full of people that can’t afford shoes in the first place",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc84pb8/",
      "created": 1720461363,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7eqj1",
      "score": 128,
      "body": "Seeing the comments I am confident it will be back at 100 soon...you know inverse wsb",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7eqj1/",
      "created": 1720452923,
      "depth": 0,
      "replies": [
        {
          "id": "lc88aih",
          "score": 22,
          "body": "The most sensible comment for someone looking to decide whether to sell or buy lol",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc88aih/",
          "created": 1720462525,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lccivsf",
          "score": 2,
          "body": "True actually, I remember back when Facebook stock crashed and everyone here clowning on people thinking about buying the stock saying that Facebook was done. \nI regret so much not buying the stock back then lol",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lccivsf/",
          "created": 1720531538,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc7vjy7",
      "score": 21,
      "body": "I loaded up on NKE calls. Expecting a rebound with how oversold it is especially with the Olympics coming up later this month. \n\nhttps://preview.redd.it/zqqimut7ubbd1.png?width=1286&format=png&auto=webp&s=e072ac48fb0e3d5b205e530a859e5ba51df323ac",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7vjy7/",
      "created": 1720458428,
      "depth": 0,
      "replies": [
        {
          "id": "lcarc6k",
          "score": 3,
          "body": "RemindMe! 1 month",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lcarc6k/",
          "created": 1720495483,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc7nhd3",
      "score": 82,
      "body": "Buy it and sit back for a few months. Strong brands like this usually come back.\n\nThis sub is not a good indication of what will happen! They were bashing Netflix, Meta, Disney when they were at their lows...",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7nhd3/",
      "created": 1720455806,
      "depth": 0,
      "replies": [
        {
          "id": "lc8hmbl",
          "score": 46,
          "body": "Meta bashing was insane lmao. But to be fair, for every few stocks that bounce back, there are thousands of others that never do.",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8hmbl/",
          "created": 1720465557,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc8v7x9",
          "score": 20,
          "body": "Give that advice to a paypal shareholder…",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8v7x9/",
          "created": 1720469970,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcb0jiw",
          "score": 3,
          "body": "Yeah the Tesla bashing, going to 100 crowd on this site, was rabid",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lcb0jiw/",
          "created": 1720499915,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc8wiku",
          "score": 4,
          "body": "Disney hasn’t really recovered much",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8wiku/",
          "created": 1720470383,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc7gaer",
      "score": 64,
      "body": "is there any support on this stock?\n\nhttps://preview.redd.it/x50og7cdfbbd1.png?width=1422&format=png&auto=webp&s=2178953b91739ade7b1e79e1230b560704a457de",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7gaer/",
      "created": 1720453435,
      "depth": 0,
      "replies": [
        {
          "id": "lc88z5r",
          "score": 36,
          "body": "OP is one ![img](emote|t5_2th52|4275)",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc88z5r/",
          "created": 1720462744,
          "depth": 1,
          "replies": [
            {
              "id": "lc9hssz",
              "score": 5,
              "body": "One support",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc9hssz/",
              "created": 1720477595,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lc7zu5b",
          "score": 12,
          "body": "https://preview.redd.it/5u5vws76ybbd1.jpeg?width=1179&format=pjpg&auto=webp&s=410861d9c5805813a70359a62517b6288a3c9269\n\nHad to break out the 10 year chart for this one. $64 looks to be some support but that isn’t a sure thing",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7zu5b/",
          "created": 1720459804,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc7x4l9",
          "score": 2,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7x4l9/",
          "created": 1720458935,
          "depth": 1,
          "replies": [
            {
              "id": "lc7xkh4",
              "score": 15,
              "body": "Finviz 🤙 the best free scanner in my opinion.\nand for daily chart 👌",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7xkh4/",
              "created": 1720459076,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lc7nxjp",
      "score": 9,
      "body": "Still has room to the downside with all their headwinds. Need to fire CEO and fix their lack of innovation. The most competition they’ve had in maybe their entire history.",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7nxjp/",
      "created": 1720455953,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7ohcu",
      "score": 8,
      "body": "I would not paint the wall all black… the numbers are not that bad. Converse brand was bad… bit the rest is still growing. Not much but still… I would consider the price right now as a discount. I‘m going in. Long",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7ohcu/",
      "created": 1720456134,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lca68tn",
      "score": 9,
      "body": "this sub was bashing meta, tesla",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lca68tn/",
      "created": 1720486891,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7dd5z",
      "score": 26,
      "body": "I would wait. It is going to be a long turnaround, mngt even says so on the earnings call, if they cannot paint a rosy picture you know it is bad. \nThese large consumer brands (nke, sbux, pep, etc) have no idea how to operate and have gotten away with price hikes since 2020, spending $ on any/all initiatives - no idea how to select strategies and predict trends. Decisions today will not be operationalize for 6mos+ then another 6mos+ to see results.",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7dd5z/",
      "created": 1720452466,
      "depth": 0,
      "replies": [
        {
          "id": "lcbhg9n",
          "score": 2,
          "body": "Wait until the stock goes up why buy it when sentiment and price are so low. I will buy a lot when it goes back up all time highs and everyone on here loves it again.",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lcbhg9n/",
          "created": 1720510086,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc79mhd",
      "score": 71,
      "body": "My DD : \n\nNike apparel is cringe and dying except for basketball shoes . That’s their only good product (and even those have rampant fakes in circulation)",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc79mhd/",
      "created": 1720451214,
      "depth": 0,
      "replies": [
        {
          "id": "lc7c9rd",
          "score": 60,
          "body": "I love nike but stopped buying it other then at outlets stores 50%+ off etc, like seriously who wants to buy $120 running shorts or $300 shoes that come apart after 6 months because the quality has decreased so much???",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7c9rd/",
          "created": 1720452105,
          "depth": 1,
          "replies": [
            {
              "id": "lc7i9rx",
              "score": 19,
              "body": "Here's some DD:  Most brands design and manufacture specifically for outlet stores using variations on a pattern or in terms of quality of material. So, not all outlet merch is old, unsold merch from other stores. Source; My friend who's designed for a number of major brands that have outlet stores.",
              "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7i9rx/",
              "created": 1720454088,
              "depth": 2,
              "replies": [
                {
                  "id": "lc7k2vm",
                  "score": 13,
                  "body": "I so much miss the good old days of outlet malls. Growing up in central Florida it was great at Nike, that was all just like overstock and older items. You could get a pair of Jordans for a really good price, they were just last year's model, which was still awesome.",
                  "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7k2vm/",
                  "created": 1720454685,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lc7bcpg",
          "score": 3,
          "body": "They have some good workout gear but yeah a lot of crap too",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7bcpg/",
          "created": 1720451795,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lc7ikjc",
          "score": 2,
          "body": "100%, the quality isn't there and there are now many other brands that people want to wear as a \"flex\"",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7ikjc/",
          "created": 1720454186,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc7jewc",
      "score": 12,
      "body": "I thought the same about SBUX last earnings. It’s fucking Starbucks right? It can only go up.\n\nI bought a ton of shares. They hardly moved. I sold. And now it’s going down even further.",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7jewc/",
      "created": 1720454462,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7gc9t",
      "score": 6,
      "body": "Yes",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7gc9t/",
      "created": 1720453452,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7qw2q",
      "score": 6,
      "body": "I like to use SimplyWallStreet to validate my trading. They value the stock at $71.77 which is lower than it is now. Analysts have it around $93. I bought some to gamble but I’d be leery of options as the timeframe for recovery is unknown.",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7qw2q/",
      "created": 1720456920,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7fjyu",
      "score": 22,
      "body": "Look at Under Armor now",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7fjyu/",
      "created": 1720453195,
      "depth": 0,
      "replies": [
        {
          "id": "lc7tdum",
          "score": 7,
          "body": "Zoom out bb",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7tdum/",
          "created": 1720457719,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc7m7v0",
      "score": 5,
      "body": "Maybe? Depends on what you think the future is for consumer discretionary and Nike in particular \n\nTheir financials are fine and the dividends not bad\n\nIt’s def less risky to buy it here than it was over 100",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7m7v0/",
      "created": 1720455393,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7gv3v",
      "score": 13,
      "body": "could drop to the fifties as too much competition now since Nike has lost its innovation and fashion touch and other companies are doing it better now... Nike is in decline due to bean counters",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7gv3v/",
      "created": 1720453624,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7e23m",
      "score": 16,
      "body": "I'm in with a ton of shares. See you at 100 end of year.",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7e23m/",
      "created": 1720452695,
      "depth": 0,
      "replies": [
        {
          "id": "lc7uidi",
          "score": 2,
          "body": "🫡",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7uidi/",
          "created": 1720458082,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc7ohmz",
      "score": 5,
      "body": "Just picked up some more.  Of course there is competition.  But it’s Nike and Killshots are the best shoe ever made for all occasions",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7ohmz/",
      "created": 1720456136,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7x928",
      "score": 4,
      "body": "Anytime you enter %basis  below the risk free rate of return. It’s hard to articulate a buy, especially in a tech heavy bull market. They have positive cash flow and a nice dividend. I think it’s a good entry, but for a long term hold to diversify your portfolio outside of tech.",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7x928/",
      "created": 1720458975,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7bzeq",
      "score": 6,
      "body": "It looked like it was going to hold the $75 level but since that fell I'll wait to see where it ends up.",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7bzeq/",
      "created": 1720452008,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc8vatj",
      "score": 7,
      "body": "You are falling for a classic value trap. Buy when they replace the CEO",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8vatj/",
      "created": 1720469996,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7sccu",
      "score": 3,
      "body": "I reckon it’s a good buy. This drop will likely have given them a big kick in the ass to get their innovation back on track",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7sccu/",
      "created": 1720457388,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7x3yw",
      "score": 3,
      "body": "If you really believe this dollar cost average. Buying calls on a stock in this situation is pretty regarded",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7x3yw/",
      "created": 1720458929,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7lgrs",
      "score": 6,
      "body": "ULTA is better imo",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7lgrs/",
      "created": 1720455146,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7io93",
      "score": 4,
      "body": "I’m not sure. I feel like they’ve lost so much market share in the past few years and Nike is no longer the ‘cool’ premier brand about it for sport. Think about it: clothing they’re losing to Lululemon. Running shoes: HOKA. Plus nowadays you can find Jordan’s and Nike Dunks sitting for retail in stores.",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7io93/",
      "created": 1720454219,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7lunx",
      "score": 6,
      "body": "Nope.  There's a lot of competition that has gained ground quickly.  Millenials are starting to look like boomers with Nikes on.. the younger generation has different tastes and Nike does not have a monopoly on that market at all.",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7lunx/",
      "created": 1720455273,
      "depth": 0,
      "replies": [
        {
          "id": "lc7nqpr",
          "score": 17,
          "body": "I don’t know a single millennial that wears Nikes, but I also only know 3 people. ",
          "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7nqpr/",
          "created": 1720455890,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lc7oilz",
      "score": 2,
      "body": "I wouldnt say it's a no brainer. People are worried nike will have trouble gaining back it's once dominant market share.\n\nI like it though",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7oilz/",
      "created": 1720456146,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7pvla",
      "score": 2,
      "body": "REMIND ME! 60days",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7pvla/",
      "created": 1720456592,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7rura",
      "score": 2,
      "body": "I’m down almost 50% on NKE after 2+ years. Just waiting to sell, hoping I can get somewhere close to even",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7rura/",
      "created": 1720457232,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7scmz",
      "score": 2,
      "body": "China's coming",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7scmz/",
      "created": 1720457390,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7tctm",
      "score": 2,
      "body": "PE above 20, even after the fall. It’s a shoe and clothing retailer trading at a tech valuation.",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7tctm/",
      "created": 1720457711,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc7xapt",
      "score": 2,
      "body": "A lot of folks like ONON better. At least until they show up at Kohls.",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc7xapt/",
      "created": 1720458990,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc839c5",
      "score": 2,
      "body": "Ever since Zion exploded the shoe on court at Duke that was the top in the stock!!!!!",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc839c5/",
      "created": 1720460908,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc87ewl",
      "score": 2,
      "body": "The sub is overwhelmingly bearish. You just might make good money on it",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc87ewl/",
      "created": 1720462241,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc89a0h",
      "score": 2,
      "body": "Just do it is the sensible response here",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc89a0h/",
      "created": 1720462841,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc8anvg",
      "score": 2,
      "body": "Seems like a no brainer until it bites you in the ass. With that said I definitely bought in.",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc8anvg/",
      "created": 1720463286,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lc9v02n",
      "score": 2,
      "body": "bought a leap at these levels",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lc9v02n/",
      "created": 1720482519,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lca93bf",
      "score": 2,
      "body": "now that you said this i’m going to buy puts",
      "permalink": "/r/wallstreetbets/comments/1dyazsy/is_nike_a_no_brainer_buy_right_now/lca93bf/",
      "created": 1720488004,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "The post discusses whether Nike is a good buy given its low price.",
    "companies": [
      "Nike"
    ],
    "tickers": [
      "NKE"
    ],
    "main_ticker": [
      "NKE"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "The user is contemplating whether Nike stock is a good buy given its current low price, mentioning purchase of a call option.",
    "stock_recommendations": "The user is recommending to buy Nike stock by highlighting the purchase of a call option.",
    "is_recommending_stock_buying_or_selling": true,
    "buy_or_sell": "buy",
    "sentiment_summary": "There is positive sentiment because the user is optimistic about Nike stock's potential rebound and has purchased a call option.",
    "sentiment": "positive"
  }
}