{
  "title": "What would you invest in TODAY",
  "score": 72,
  "selftext": "Have a decent portfolio built up (FXAIX, QQQM, AVUV, and stocks in the magnificent 7. What would you recommend I invest in today for the long term (15-25 years). As I have been making money from summer jobs.\nThanks for any input!",
  "link_flair_text": null,
  "id": "1dza69b",
  "num_comments": 237,
  "created_utc": 1720550860,
  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/",
  "comments": [
    {
      "id": "lceffp4",
      "score": 133,
      "body": "Peter Lynch said....you got people working in the restaurant industry or engineers trying to speculate in biomedical......moral of the story, buy what you understand",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lceffp4/",
      "created": 1720554233,
      "depth": 0,
      "replies": [
        {
          "id": "lcf0aa3",
          "score": 40,
          "body": "Or just buy more of the whole damn haystack",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcf0aa3/",
          "created": 1720560852,
          "depth": 1,
          "replies": [
            {
              "id": "lcf2il4",
              "score": 19,
              "body": "Decorative Gourds ETFs you mean",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcf2il4/",
              "created": 1720561603,
              "depth": 2,
              "replies": [
                {
                  "id": "lcgd2fw",
                  "score": 3,
                  "body": "Is there such a thing? 🤔",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcgd2fw/",
                  "created": 1720579696,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lcfirxo",
          "score": 4,
          "body": "Or feed a biomedical worker!",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfirxo/",
          "created": 1720567972,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcho4ih",
          "score": 3,
          "body": "Yea but if you only buy what you understand, how many people actually do work in industries that see high growth?",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcho4ih/",
          "created": 1720607385,
          "depth": 1,
          "replies": [
            {
              "id": "lcje86p",
              "score": 1,
              "body": "my motto is buy what you know, index the rest of it.  I don't work in tech but my portfolio is heavily weighted towards tech through growth etfs but individual stocks i buy are in my field of expertise",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcje86p/",
              "created": 1720631282,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lceajbv",
      "score": 39,
      "body": "Well, you have plenty of growth through tech exposure, you have a solid basis of market wide ETF. So if I were you, and I wanted a long-term position in individual names, absent short-term concerns, which may outperform the market: \nFinancial (JPM)\nIndustrial (GE)\nHealthcare (GEHC, LLY)",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lceajbv/",
      "created": 1720552683,
      "depth": 0,
      "replies": [
        {
          "id": "lceatc3",
          "score": 8,
          "body": "So are you saying to buy those to balance risk? Or buy those as they may outperform the s and p 500?",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lceatc3/",
          "created": 1720552772,
          "depth": 1,
          "replies": [
            {
              "id": "lcecfzh",
              "score": 13,
              "body": "Sorry if I wasn't clear. Buy in an attempt to outperform the s&p500, but knowing that you have that good foundation of sp500 regardless. Less risk, still good upside potential relative to the market",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcecfzh/",
              "created": 1720553268,
              "depth": 2,
              "replies": [
                {
                  "id": "lcefql4",
                  "score": 5,
                  "body": "Interesting, I will look into that! Thank you for the input!",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcefql4/",
                  "created": 1720554330,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lceihg3",
      "score": 10,
      "body": "Small caps, 2021 SPACs that were beaten down unfairly, Phase 2/3 small biotech/pharma when hype has died down",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lceihg3/",
      "created": 1720555183,
      "depth": 0,
      "replies": [
        {
          "id": "lcfv4pi",
          "score": 3,
          "body": "small caps been beaten up for awhile. Unsure when. When tide does turn, it goes.",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfv4pi/",
          "created": 1720572676,
          "depth": 1,
          "replies": [
            {
              "id": "lcfvrr7",
              "score": 3,
              "body": "Going to be downright scary to try and time that entry but the payoff will be amazing",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfvrr7/",
              "created": 1720572919,
              "depth": 2,
              "replies": [
                {
                  "id": "lclp9jk",
                  "score": 1,
                  "body": "even one 10 bagger per lifetime is a lucky ticket. Balls of steel.",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lclp9jk/",
                  "created": 1720658622,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcfy5y4",
              "score": 1,
              "body": "Do you have any examples of good small caps? Or would AVUV be good?",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfy5y4/",
              "created": 1720573836,
              "depth": 2,
              "replies": [
                {
                  "id": "lcjcjdi",
                  "score": 1,
                  "body": "Personally, I’ve just been adding small cap tilt to my ETF portfolio but dollar cost averaging some VTWO, currently at about 5% of my taxable portfolio, and 10% retirement accounts. I think it will pay off.",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcjcjdi/",
                  "created": 1720630742,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lclpicf",
                  "score": 1,
                  "body": "I try not to give too many stock tips. Especially small caps. GL.....even the Russel 2000>?",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lclpicf/",
                  "created": 1720658715,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcezm0t",
      "score": 20,
      "body": "VOO is the only recurring investment I have set up",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcezm0t/",
      "created": 1720560627,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcfmlom",
      "score": 9,
      "body": "I would ignore these Space stock reco’s. Lately I’ve been picking up DISN since they just hit a 10 year low and I don’t think the Mouse is going anywhere. Space stocks are basically just gambling, no one really knows which will come out on top.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfmlom/",
      "created": 1720569410,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcefe0j",
      "score": 33,
      "body": "Asts",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcefe0j/",
      "created": 1720554218,
      "depth": 0,
      "replies": [
        {
          "id": "lcehivd",
          "score": 13,
          "body": "I have been buying this as well",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcehivd/",
          "created": 1720554882,
          "depth": 1,
          "replies": [
            {
              "id": "lcgj26y",
              "score": 5,
              "body": "ASTS is most likely not a smart long term play given its >20% short interest",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcgj26y/",
              "created": 1720582295,
              "depth": 2,
              "replies": [
                {
                  "id": "lci1dey",
                  "score": 2,
                  "body": "What?  If it’s anything it’s long term. Assuming it works.",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lci1dey/",
                  "created": 1720614267,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcikgzj",
                      "score": 1,
                      "body": ">Assuming it works.\n\nThat is a massive assumption to make. AST Space Mobile isn't the first company that has tried this, there have been many before it that failed. Right now they have a little bit of cash, but almost no consumer revenue, and unless they can change that fairly quickly they might be doomed as well.",
                      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcikgzj/",
                      "created": 1720621635,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lciso57",
                          "score": 1,
                          "body": "Massive?  I think massive has been taken off the table.  No guts no glory.  I’m balls deep.",
                          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lciso57/",
                          "created": 1720624365,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lchtwlb",
                  "score": 1,
                  "body": "That’s standard SPAC interest.",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lchtwlb/",
                  "created": 1720610692,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lciyffa",
          "score": 1,
          "body": "Super cool concept, but If I had to guess, a bad investment",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lciyffa/",
          "created": 1720626235,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcfajht",
      "score": 25,
      "body": "My #1 would be Google.   They are just incredibly well positioned for what is coming over the next decade.\n\nBut I do not think you can go wrong owning the other mega tech names.  Apple, Microsoft, Amazon and Meta.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfajht/",
      "created": 1720564523,
      "depth": 0,
      "replies": [
        {
          "id": "lcjm14r",
          "score": 1,
          "body": "I feel like Google hasn’t come out with anything new that’s actually stuck in the last 10 years.",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcjm14r/",
          "created": 1720633747,
          "depth": 1,
          "replies": [
            {
              "id": "lcjvuto",
              "score": 6,
              "body": "They came out with YouTube TV in the last 10 years and it went from zero to being the most popular OTT service in the US.\n\nJust one example.\n\nBut the one that I am most excited about is Waymo.   They are now deployed to San Fran, Los Angeles, Phoenix and now Austin.    They are years ahead of everyone else and it is a trillion dollar market opportunity.\n\nBut only one of them.\n\nOne of the most strategic things they did over the last decade is the TPUs.   It has enabled Google to now be the third largest datacenter chip designer and they will be #2 before the end of the year.\n\nThe sixth generation was just released and was a 5x improvement over the previous generation.  They are now working on the seventh generation.\n\nhttps://blog.svc.techinsights.com/wp-content/uploads/2024/05/DCC-2405-806_Figure2.png\n\nThere is going to be a ton of different applied AI like Waymo over the next decade and nobody is better positioned than Google to benefit from it.\n\nAll the massive investment Google has made over the last decade+ in AI is now going to be realized.\n\nI would also expect another really big AI breakthrough in the next couple of years and most likely place that will come from is Google.\n\nThey continue to be out in front in terms of AI research.   Last NeurIPS Google had twice the papers accepted as next best.",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcjvuto/",
              "created": 1720636842,
              "depth": 2,
              "replies": [
                {
                  "id": "lcjyot3",
                  "score": 1,
                  "body": "What exactly are TPUs? I unfortunately don’t see much of an upside in AI. Honestly I think a lot of the market hype around it is overblown and misdirected, just like it was with blockchain stuff",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcjyot3/",
                  "created": 1720637724,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lck0qp9",
                      "score": 1,
                      "body": "AI will be far bigger than people are even thinking. It will be far bigger than the Internet.\n\nComparing to blockchain would be like comparing Internet to the CB radio.\n\nhttps://cloud.google.com/tpu\n\nGoogle was able to completely do Gemini (training and inference) using TPUs and nothing from Nvidia.\n\nThey are the only one of the big techs not reliant on Nvidia and do NOT have to wait in the Nvidia line or pay the Nvidia tax.\n\nWe are already starting to see the money spent on actors, sets, and such now being spent on AI computation.\n\nHave you seen the new Volvo AI generated commercials?    \n\nThat for example the money went to AI computation instead of to the traditional production things.\n\nThis has only barely got started but will happen pretty quickly. The next decade is going to be the most amazing time.\n\nIt will be one industry after another. Wild that the first ones are going to be the creative ones. This commercial I provided the link will be the norm within a couple of years.\n\nWith the money going to the Googles and Microsofts and Amazons. But Google best positioned as they have the TPUs and get bigger margins.\n\nThe one that is hard to understand is Microsoft. It is not like Google did the TPUs in secret. Not sure why only now Microsoft is going to try to copy Google.",
                      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lck0qp9/",
                      "created": 1720638372,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lcknskn",
                          "score": 1,
                          "body": "I mean genuinely what are the applications of it even? None of this stuff is new it’s just suddenly consumer facing with the chat bots.",
                          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcknskn/",
                          "created": 1720645451,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lckqp85",
                              "score": 2,
                              "body": "Just about everything you can think of.\n\nSo for example Google already has it working for moving a person from point A to point B.   Deployed to few cities and will keep spreading to more.\n\nUltimately it will be moving any object from point A to point B without needing a human.   This is well over a trillion dollar market.\n\nVolvo just dropped a commercial completely made with AI.  No actors, or sets, etc.     Wish I could link to it but not allowed on this subreddit.\n\nJust get on YT and search for Volvo AI commercial.\n\nThis will ultimately be everything.  Commercials, movies, TV shows, etc.   \n\nBasically instead of the money going to actors and such it will go to Google.   Critical is the fact Google has the TPUs.\n\nIt will be endless.   AI will eat up pretty much everything and the money will mostly go to Google but also Microsoft and Amazon.  \n\nI am unusual and love Nvidia for the short and medium term but not so much for the longer term.\n\nI expect more companies to copy Google and do their own silicon.  It is a bit late and not sure why only Google had the vision.  But they will get there and why Nvidia will be fine for probably the next decade.\n\nI am old and feel so blessed to be alive right now.   I got to benefit from the PC era and then the Internet era and then mobile and now I get to live and benefit from the biggest one yet.  AI.   Each one has just been this huge opportunity to make money.   Mostly investing.   I got started on the Internet in 1986 and did well and ultimately our Internet investments paid for the house we still live in.   But domain names made us even more hey were free in 1986 and me and my GF who is now my wife each night would think up some good ones and grab them.    Kept thinking we would get in trouble at some point but nope.   No one seemed to care we were hoarding domain names.\n\nBut AI will be far, far, far bigger than anything before.",
                              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lckqp85/",
                              "created": 1720646361,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcevkpw",
      "score": 13,
      "body": "I bought 64 shares of TSM today.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcevkpw/",
      "created": 1720559302,
      "depth": 0,
      "replies": [
        {
          "id": "lcgtls9",
          "score": 3,
          "body": "I bought a similar amount 3/11. I dont usually lump on a single stock like that but oh my it's exploded!! \n\nHope it continues for us both. \n\nASML is a decent pairing. Wild the price/share.",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcgtls9/",
          "created": 1720587487,
          "depth": 1,
          "replies": [
            {
              "id": "lchv2ks",
              "score": 2,
              "body": "That Asml for 850 while ago oh my....",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lchv2ks/",
              "created": 1720611295,
              "depth": 2,
              "replies": [
                {
                  "id": "lcils2k",
                  "score": 1,
                  "body": "Nice price to get in. I kinda hope it splits but it's also kinda cool to own shares over 1k per share. \n\nBRK.A owners laughing lol.",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcils2k/",
                  "created": 1720622084,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcem0tp",
      "score": 13,
      "body": "QQQ",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcem0tp/",
      "created": 1720556309,
      "depth": 0,
      "replies": [
        {
          "id": "lcepjjx",
          "score": 11,
          "body": "Doesn’t QQQM have a lower expense ratio?",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcepjjx/",
          "created": 1720557413,
          "depth": 1,
          "replies": [
            {
              "id": "lcezov2",
              "score": 22,
              "body": "It does. Buy QQQM",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcezov2/",
              "created": 1720560653,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lcf4xsk",
          "score": 3,
          "body": "or VUG even better with respect to ER.",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcf4xsk/",
          "created": 1720562438,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcgef1i",
      "score": 7,
      "body": "RIVN",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcgef1i/",
      "created": 1720580259,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcehorq",
      "score": 7,
      "body": "LUNR. Good things are coming!",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcehorq/",
      "created": 1720554934,
      "depth": 0,
      "replies": [
        {
          "id": "lceidyf",
          "score": 3,
          "body": "How come?",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lceidyf/",
          "created": 1720555153,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcej9fi",
          "score": 5,
          "body": "Yes… how come?",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcej9fi/",
          "created": 1720555427,
          "depth": 1,
          "replies": [
            {
              "id": "lcf7b9q",
              "score": 13,
              "body": "I had posted this else where. So I am copying and pasting it here. I am bullish with Intuitive Machines ticket LUNR. A lot of people think that they were a “flash in the pan” and a failure with their lunar landing in Feb 2024.\n\nThe mission was actually a success in most aspects. Sure it tipped over in the end. But it was the first US Based moon landing in 50 years. The first ever private landing. The data that was intended to be received was received.\n\nMoving forward, they have been awarded multiple NASA contracts such as a rover and component delivery systems. They are scheduled for more landings in the next 18 months with the next coming in late Q42024 early Q12025 to land on the moon testing a lunar ice drill and a 4g comms network.\n\nThey are blazing the trail with developing the infrastructure needed to get to the moon. \n\nThey are a front runner for NASA’s Near Space Network contract  for network delivery systems and hardware placement in orbit. A contract worth about $542m over 10 years.\n\nThe are the front runners in the private sector for lunar projects.\n\nI truly believe this company will be around for the long term and has great investment potential.\n\nhttps://x.com/int_machines/status/1810707038428684644?s=46&t=ivHATa5R6IPWtTiEP5cpEA",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcf7b9q/",
              "created": 1720563290,
              "depth": 2,
              "replies": [
                {
                  "id": "lcfat3s",
                  "score": 7,
                  "body": "Thanks for the reply and link!  I’ll do a little digging.",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfat3s/",
                  "created": 1720564641,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcfdf5j",
                  "score": 6,
                  "body": "Basically penny stocks, sounds like a good move... very High risk and high reward. I wouldn’t bet the farm on it though…",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfdf5j/",
                  "created": 1720565856,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcfgh8l",
                      "score": 3,
                      "body": "I feel other wise.",
                      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfgh8l/",
                      "created": 1720567104,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lcfh5vc",
                          "score": 3,
                          "body": "Are you holding the bag? What’s your average cost basis?",
                          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfh5vc/",
                          "created": 1720567365,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lcfowr8",
                              "score": 2,
                              "body": "425ish shares at $3.44.   Gonna start adding 100 shares every two weeks",
                              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfowr8/",
                              "created": 1720570299,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lcfvb1m",
                                  "score": 6,
                                  "body": "That NASA contract only works out to ~$50M annually though, that’s hardly enough to get super excited about when their competitors (SpaceX for example) are valued at nearly $200B",
                                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfvb1m/",
                                  "created": 1720572743,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lcfyqda",
                                      "score": 2,
                                      "body": "A lot more than just that though. Even Time magazine has them I. Their 100 influential companies list. \n\nhttps://time.com/6980452/intuitive-machines/\n\nThey also have a lunar rover contract, more planned lunar landing missions. Communication networking contracts on the lunar surface. Their site is very informative. \n\nhttps://www.intuitivemachines.com\n\nYou can even view them on the nasa site to verify things mentioned on their own site. \n\nTheir next lunar launch is schedule late Q4/early Q1.  I intend to be a long term investor personally. I like the future plans they have and no public company is coming close to them when it comes to lunar tech and delivery.   \n\nBut there is short term hype for the next lunar mission sure to boost the share price in a more shorter term aspects. I can see their price being cyclical with their missions. Ups as you get close and downs after.",
                                      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfyqda/",
                                      "created": 1720574051,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lcghwu5",
                                          "score": 5,
                                          "body": ">Their site is very informative.\n\nNot sasying it ain't true but I'd rather see NASA publications about it instead.\n\nYou don't research about Solar panel efficiency by looking into the solar panel company website for example, you need to avoid self-bias.",
                                          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcghwu5/",
                                          "created": 1720581778,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "lchbr9a",
                                  "score": 1,
                                  "body": "fair enough 👌🏽. Best of luck to you. I have no idea what they will do and it could be the next Tesla but odds are not great in general. If you researched it and feel good about it then go for it. Make sure it’s money you are ok to lose",
                                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lchbr9a/",
                                  "created": 1720598853,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lcfwhp5",
                  "score": 3,
                  "body": "Thank you for the info, I will look into it as well!",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfwhp5/",
                  "created": 1720573194,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcejsnq",
      "score": 7,
      "body": "SQ",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcejsnq/",
      "created": 1720555602,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lce6dg6",
      "score": 15,
      "body": "Tech(Nvidia, Amazon, Google, Microsoft, TSM), VOO/SPYI, and btc(etfs like bitx as well). Some other things that have future potential are space stocks like ASTS and RKLB, and biotech etfs like XBI.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lce6dg6/",
      "created": 1720551363,
      "depth": 0,
      "replies": [
        {
          "id": "lce8hdp",
          "score": -4,
          "body": "Ugh!",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lce8hdp/",
          "created": 1720552037,
          "depth": 1,
          "replies": [
            {
              "id": "lce8m5b",
              "score": 4,
              "body": "What?",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lce8m5b/",
              "created": 1720552079,
              "depth": 2,
              "replies": [
                {
                  "id": "lceb0pm",
                  "score": 2,
                  "body": "Would you purchase a semiconductor fund such as FSELX to get exposure to the semiconductor stocks or would you recommend picking and choosing?",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lceb0pm/",
                  "created": 1720552836,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcec9o5",
                      "score": 2,
                      "body": "no idea, I was actually just looking at VGT and thinking about semiconductor etfs as well, have SMH bookmarked as a strong buy, but the thing is I'm not sure which to prioritize.",
                      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcec9o5/",
                      "created": 1720553215,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lcgtqqb",
                      "score": 1,
                      "body": "QTSM AND ASML are my go tos, but I have a good deal of SMH too.",
                      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcgtqqb/",
                      "created": 1720587563,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcektyg",
      "score": 15,
      "body": "PLTR...",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcektyg/",
      "created": 1720555933,
      "depth": 0,
      "replies": [
        {
          "id": "lcepo6u",
          "score": 6,
          "body": "What about this stock is attractive?",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcepo6u/",
          "created": 1720557454,
          "depth": 1,
          "replies": [
            {
              "id": "lcerkgo",
              "score": 14,
              "body": "AI is only as practical as far as the limits of data collection. Ross Perot managed to build one of the first fortunes on this resource, but it was nothing compared to the massive government and private industry infrastructure currently being built to harvest and store data. PLTR may be a little late to the game but their Foundry is being used by many high ranking entities in the public and private sector. Look also for TSLA to morph in this direction. There's a reason behind the Twitter acquisition as well as the massive NVDA powered data center Musk is building",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcerkgo/",
              "created": 1720558048,
              "depth": 2,
              "replies": [
                {
                  "id": "lcewgev",
                  "score": 2,
                  "body": "Thank you for the information!",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcewgev/",
                  "created": 1720559586,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcem4hs",
      "score": 9,
      "body": "Rocket Lab probably\n\n“The full story of rocket lab” on YouTube is a good explainer.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcem4hs/",
      "created": 1720556341,
      "depth": 0,
      "replies": [
        {
          "id": "lcgchp4",
          "score": 4,
          "body": "🥝 *New Zealand mentioned* 🥝",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcgchp4/",
          "created": 1720579457,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcepyme",
          "score": 1,
          "body": "I will look into that, Thanks for your input!",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcepyme/",
          "created": 1720557546,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcff1jb",
      "score": 7,
      "body": "I just bought intel today. But i am regarded idk.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcff1jb/",
      "created": 1720566558,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgmk9i",
      "score": 6,
      "body": "Rocket Lab. $RKLB. Best opportunity of the century.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcgmk9i/",
      "created": 1720583911,
      "depth": 0,
      "replies": [
        {
          "id": "lcilds4",
          "score": 1,
          "body": "Why’s that?",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcilds4/",
          "created": 1720621947,
          "depth": 1,
          "replies": [
            {
              "id": "lclji6z",
              "score": 2,
              "body": "Cause he’s a bag holder",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lclji6z/",
              "created": 1720656446,
              "depth": 2,
              "replies": [
                {
                  "id": "lcmfzke",
                  "score": 1,
                  "body": "?",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcmfzke/",
                  "created": 1720669339,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcfocqo",
      "score": 3,
      "body": "ASTS and NNE if you want potential homeruns in a couple years, but not penny stocks.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfocqo/",
      "created": 1720570087,
      "depth": 0,
      "replies": [
        {
          "id": "lcfyz2n",
          "score": 1,
          "body": "Is there a reason why NNE has been climbing so much so fast?",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfyz2n/",
          "created": 1720574144,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lce9q9r",
      "score": 8,
      "body": "RKLB",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lce9q9r/",
      "created": 1720552428,
      "depth": 0,
      "replies": [
        {
          "id": "lceb622",
          "score": 3,
          "body": "What would the time frame be on that?",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lceb622/",
          "created": 1720552881,
          "depth": 1,
          "replies": [
            {
              "id": "lced310",
              "score": 6,
              "body": "Space? Your lifetime I think. Not saying RKLB will be top 3 within that, but they have a good foundation",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lced310/",
              "created": 1720553472,
              "depth": 2,
              "replies": [
                {
                  "id": "lcehvqi",
                  "score": 1,
                  "body": "Interesting, thanks for the recommendation!",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcehvqi/",
                  "created": 1720554996,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcedkki",
              "score": 3,
              "body": "My time horizon is 10 years, but I expect that the business will experience a good ol' hockey stick move in the next few years.\n\n\nI hyperfocused on the space sector over the last few years, (thanks adhd) and I'm fairly confident that RKLB will indeed be one of the winners.",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcedkki/",
              "created": 1720553637,
              "depth": 2,
              "replies": [
                {
                  "id": "lcehx0l",
                  "score": 2,
                  "body": "What do you think about ASTS?",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcehx0l/",
                  "created": 1720555007,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcfakvs",
                      "score": 2,
                      "body": "I need to a deeper dive into what makes them a good candidate for investment.\n\n\nPlease feel free to toss me some bullet points of the highlights if you want to, but don't feel obligated.",
                      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfakvs/",
                      "created": 1720564540,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lcfyf3j",
                          "score": 4,
                          "body": "They essentially are putting satellites into the sky to eliminate dead spots (This will help with having reliable internet especially in times of need such as for wildfires) They are recently working on partnerships with large names such as T-Mobile.",
                          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfyf3j/",
                          "created": 1720573933,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lcfyhft",
                          "score": 3,
                          "body": "I think it could possibly be a big deal, I have about 10% of my portfolio in it",
                          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfyhft/",
                          "created": 1720573958,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lchpsou",
                              "score": 1,
                              "body": "I guess my question is: What is their proprietary tech or advantage compared to the other companies in that field?\n\n\nWhat's got you convinced that they're a cut above?",
                              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lchpsou/",
                              "created": 1720608408,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lciljw9",
                                  "score": 2,
                                  "body": "Their satellites are able to cover larger areas than starlink and they have better management in terms of PR",
                                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lciljw9/",
                                  "created": 1720622005,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcgfed4",
      "score": 4,
      "body": "GME. $4bn in cash. No debt. Expansion on the mind. A CEO who is paid nothing and owns more of the company than anyone on Earth. He never sells. Only buys. The whole board only buys. Rare sells, and if so, it's minimal. \n\nOn a fundamental basis, the stock is grossly undervalued. I think without all the obvious crime going on in the market, Gamestop would easily be in the $50s in a real market. They are focused on margin improvements YoY and Ryan Cohen is seeing to the investment strategy personally, and he is a financial genius.\n\nGME is ready for anything for the foreseeable future and they could dilute again and generate billions more in capital. Last time they did, the price went up after both were completed. \n\nIf the first thing that comes to mind is to be dismissive and think \"meme\" stocks, ask yourself who put that thought there and where is your thesis to support it? I see millions of people see the vision of RC and GME. They could close every store for a decade and still have billions on hand. Think about that. All while they reduce costs and boost margin.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcgfed4/",
      "created": 1720580677,
      "depth": 0,
      "replies": [
        {
          "id": "lcidaz1",
          "score": 1,
          "body": "non-ironically recommending gamestop is funny.\ngotta unload the bags somehow",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcidaz1/",
          "created": 1720619086,
          "depth": 1,
          "replies": [
            {
              "id": "lciiof5",
              "score": 1,
              "body": "What bags? See, that is what I am talking about. People just say stupid shit like this and present no articulate thesis. It's all emotion and no logic. It's like children crying when they don't get something. People just say gotcha shit on the internet but don't take the time to look at fundamentals and trajectory. And I have no bags to unload bc I am holding GME forever. Ryan Cohen is going to replace Warren Buffet. \n\nAn activist billionaire with a clear focus, access to billions in liquid capital, a downturn in market on the horizon, acquisition ready environment, and a brand that is beloved around the world with the soon to be in power generation, globally. But yea, apparently, I am coping. Lol, get bent dumbass.",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lciiof5/",
              "created": 1720621013,
              "depth": 2,
              "replies": [
                {
                  "id": "lcio163",
                  "score": 1,
                  "body": "everybody's looked at the fundamentals. it's not a hidden stock that few have analyzed, it's a cult stock that has members posting the same stupid thesis while they're getting diluted and robbed any time the stock shoots up. \n\nYou're telling people to look at the fundamentals, well the fundamentals say it has a future P/E of 2000, great value brother.\n\n\n\n\"no bags to unload because I'm holding forever\" yeah that's not how stocks work - cult.\n\n\"A brand that is beloved around the world with the soon to be in power generation\". holy shit batman, what a thesis. \n\nListen, when OP asked what stocks to buy today, he meant he wanted to make money; not sign up for your fucking cult",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcio163/",
                  "created": 1720622833,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcipdj1",
                      "score": 1,
                      "body": "Go look at the charts. Look at the volume. Ryan sold 76m into the market. The sepl volume in that time period was upwards of 1.6bn shares. YOU are just regurgitating the same talking points I've heard endlessly for years from talking heads. You sound like a boomer honestly. The company has completely shifted its model and continues to do so. They have more cash on hand than Target. They have less debt than everyone. They have $4bn to do whatever they want with. I'm not going to abstract my entire thesis and the 3 years of watching and research to some dickhead like you. But to be clear you still haven't made a counterargument. \n\nYou have called it a cult, acted emotional, said nothing of value, and presented no counterargument based on data and logic. I laid out all the key things I see that I base my decision on. I am not part of any cult. I make my decisions based off facts and logic. You need to get a grip and learn how to make an argument. You sound like an idiot.",
                      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcipdj1/",
                      "created": 1720623277,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lcizf1n",
                          "score": 1,
                          "body": "You're defending the CEO that's diluting your shares. They are literally making money off your back, but go off king. Stick it to the man with your GME shares.\n\nThey have shifted their model? What do they do now? Their new model is diluting the stock after it pumps and pocketing the cash.\n\nJust to be clear, I have done my research and that's why I made 8k off it when the short interest was 140%.\n\n\nEveryone has looked into the company, it sucks.",
                          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcizf1n/",
                          "created": 1720626552,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lcjd0b9",
                              "score": 1,
                              "body": "My man he threw 76m into a dark void of 1.6bn sell volume that came from nowhere and somehow barely affected the price in the long term charts. He thereby raised around $4bn in capital after the dilutions and the stock is holding a new higher low. You are clearly a troll and poorly educated on the situation. He defeated the oppositions thesis on cash burning by raising billions and making the company unkillable. You are an idiot. I am just going to call it what it is. \n\nI have researched my position, and it's ironclad. Go look at the long term charts and where are now compared to 2019-2020 after multiple dilutions. GME is up 5x and holding. If you bought at a decent range in 2020-2021 you'd have insane returns.  You don't know what you are talking about. I could give a shit about your 8k.",
                              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcjd0b9/",
                              "created": 1720630889,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lcjggk2",
                                  "score": 1,
                                  "body": "good luck with your investment, I still don't see anything of value in this stock",
                                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcjggk2/",
                                  "created": 1720631991,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lce9s3o",
      "score": 8,
      "body": "100% NVDA",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lce9s3o/",
      "created": 1720552444,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lceon45",
      "score": 2,
      "body": "Hexel Corporation\n\nCarbon fiber manufacturing isn’t going anywhere and they have very strong financials. Undervalued stock.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lceon45/",
      "created": 1720557129,
      "depth": 0,
      "replies": [
        {
          "id": "lceq84e",
          "score": 2,
          "body": "How come it has been going down lately? Is this a good purchase point?",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lceq84e/",
          "created": 1720557630,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcevq8v",
      "score": 2,
      "body": "Start looking for some value plays on SP500 small and medium cap",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcevq8v/",
      "created": 1720559351,
      "depth": 0,
      "replies": [
        {
          "id": "lcfymoe",
          "score": 1,
          "body": "AVUV?",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfymoe/",
          "created": 1720574013,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcfvjqs",
      "score": 2,
      "body": "VOO any day",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfvjqs/",
      "created": 1720572836,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lchh34d",
      "score": 2,
      "body": "MGK",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lchh34d/",
      "created": 1720602606,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lchi8tg",
      "score": 2,
      "body": "Avgo",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lchi8tg/",
      "created": 1720603433,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcj1rbb",
      "score": 2,
      "body": "MCD, PFE",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcj1rbb/",
      "created": 1720627301,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lckvjdw",
      "score": 2,
      "body": "Idk, GME is going to be $40+ by September 🤷🏼‍♂️",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lckvjdw/",
      "created": 1720647926,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcepi5f",
      "score": 2,
      "body": "I'm mostly ETFs like VTI. But I'm pretty excited about ASTS so I'm putting extra money I find into that.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcepi5f/",
      "created": 1720557401,
      "depth": 0,
      "replies": [
        {
          "id": "lceqjxb",
          "score": 2,
          "body": "ASTS could be a huge thing in a few years",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lceqjxb/",
          "created": 1720557734,
          "depth": 1,
          "replies": [
            {
              "id": "lcew78m",
              "score": 3,
              "body": "Yeah, eliminating cell phone dead zones is something I absolutely will invest it. Everyone wants that.",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcew78m/",
              "created": 1720559505,
              "depth": 2,
              "replies": [
                {
                  "id": "lcfylzk",
                  "score": 2,
                  "body": "I agree",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfylzk/",
                  "created": 1720574006,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lce8vds",
      "score": 4,
      "body": "I would hold the cash in an HYSA right now. Mag 7 is the only thing holding the market up.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lce8vds/",
      "created": 1720552159,
      "depth": 0,
      "replies": [
        {
          "id": "lcfgvtc",
          "score": 3,
          "body": "August/September and onward will be red, too much uncertainty with upcoming elections and historically the indexes start to slump short term before continuing higher. \n\nWe're due for a pull back so your idea of holding cash isn't a bad one",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfgvtc/",
          "created": 1720567260,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcecu22",
          "score": 2,
          "body": "so buy those Mag 7, they are basically an unstoppable oligopoly lmao. Or just play it safe with VOO/VGT.",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcecu22/",
          "created": 1720553392,
          "depth": 1,
          "replies": [
            {
              "id": "lcefhi9",
              "score": 4,
              "body": "If the market is only being held up by these 7 stocks that are at all time highs and the rest of the market is sideways or down then that’s not a good recommendation. They seem unstoppable now, but institutions will take profits soon and trends will reverse. Unemployment is also starting to go up. Market might go up a little higher but we are closer to the end of this bull market than the beginning.",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcefhi9/",
              "created": 1720554249,
              "depth": 2,
              "replies": [
                {
                  "id": "lcefzld",
                  "score": 7,
                  "body": "money doesn't just disappear, stocks are easily one of the best assets to save wealth in, so it will be reinvested. It might stagnate and dip here and there, but they will continue to trend up as the economy continues to generate revenue and they are its leaders.",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcefzld/",
                  "created": 1720554409,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lceg68v",
                      "score": 3,
                      "body": "Yea so I would buy them when they dip. Not today like op is asking",
                      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lceg68v/",
                      "created": 1720554467,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lcegj16",
                          "score": 2,
                          "body": "they are unlikely to dip by more than a single-digit percent, so continuous limit buys are a safe bet.",
                          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcegj16/",
                          "created": 1720554578,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lcegz5y",
                              "score": 1,
                              "body": "Unlikely to dip by more than a single digit percent based on what?",
                              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcegz5y/",
                              "created": 1720554715,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lceihi2",
                                  "score": 2,
                                  "body": "based on him owning them and thinking they cant go down.\n\nnewsflash: AAPL and TSLA trade at 35 and 70 PE and have NEGATIVE YoY Revenue and profit growth lmao.\n\nThinking that they cannot go down by 10%+ is fucking wild.",
                                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lceihi2/",
                                  "created": 1720555183,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lceivs3",
                                      "score": 1,
                                      "body": "TSLA maybe, Apple perhaps(I don't have shares in these 2 anyway), but the rest? No more than 15% before they recover probably.",
                                      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lceivs3/",
                                      "created": 1720555307,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lcejnf8",
                                          "score": 2,
                                          "body": "NVDA with QoQ profit growth of like 50, 33, 25, 18 last 4 quarters. \n\nLook at how their profit reacted in their last 2 boom cycles.\n\nThe growth is going to stop soon as it always does. They have an 80% gross margin. Once the demand even hints at a slowdown, prices drop, EPS drops dramatically, PE drops.\n\nNVDA right now is like TSLA in 2021. Insane growth and margins that are about to rollover and the stock will tank 50-70%.\n\nCould be next Q, could be 2 quarters, hell, might even be 3 Q from now. But NVDA is going to tank HARD once their valuation starts to matter",
                                          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcejnf8/",
                                          "created": 1720555555,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lcececj",
          "score": 1,
          "body": "I just put my money into silver and gold",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcececj/",
          "created": 1720553254,
          "depth": 1,
          "replies": [
            {
              "id": "lceif3a",
              "score": 1,
              "body": "Funds?",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lceif3a/",
              "created": 1720555163,
              "depth": 2,
              "replies": [
                {
                  "id": "lceisqa",
                  "score": 2,
                  "body": "I trust Sprott: PSLV and PHYS\n\nCEF is a mix of the two",
                  "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lceisqa/",
                  "created": 1720555280,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcf4fqs",
      "score": 2,
      "body": "LLY - pharmaceuticals, 1 of the 3 insulin makers who make up 90% of the world supply, their diet pills being eaten like tictacs, Alzheimer's meds in the pipeline, other meds getting FDA approval\n\nBROS - Dutch Bros coffee, loyal customer base, earnings are growing, has less than 1000 stores in 17 states but plans to expand to \\~4000 total stores. Forward P/E is something crazy though like 85 so be cautious. Recently had a break out from low $30s but keeps seeing resistance around the $40-42 mark. Might be worth watching and trying to time a better entry point or you can just full send it. \n\nCRWD - All I know is they're cybersecurity, big name in the field, and my friend who is a IT SysAdmin has been talking about them since 2014. It didn't IPO until 2019 at $63. It closed today at $385. \n\nTSM - I traded this way back in 2020-2021 and fumbled the bag. TSMC are the kingpin in chip production, their foundries far outpace any of the US companies, they're producing 3nm (even Intel isn't doing this), they have a plant planned for Arizona but it has seem some delays, and they're doing all of this while selling those chips to all of the Mag 7 (seriously). [Nvidia paid them $7b in 2023. That was 11% of TSMC revenue. ](https://www.tomshardware.com/tech-industry/analyst-estimates-nvidia-is-now-tsmcs-second-largest-customer-accounting-for-11-of-revenue-in-2023)Apple accounted for 25% in 2023. \n\nBeyond some speculative stuff, maybe look at some more traditional individual names for long holdings: WMT, JPM, WM, GE, etc. Basically boring boomer stocks that can withstand choppy markets.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcf4fqs/",
      "created": 1720562263,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcf7h76",
      "score": 2,
      "body": "Put a small amount in OKLO for moonshot, potential for 100-1,000 bagger within that timeframe.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcf7h76/",
      "created": 1720563349,
      "depth": 0,
      "replies": [
        {
          "id": "lcfz4tn",
          "score": 1,
          "body": "Thanks!",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfz4tn/",
          "created": 1720574206,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcgszkn",
      "score": 2,
      "body": "VGT is my bet for the next 10 years. SMH too. \n\nIm also a fan of SPOT ETF in BTC. We're in a little downturn so Im buying a bit. I think for long term holds IBIT is a good idea. My 2 cents.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcgszkn/",
      "created": 1720587155,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcepceh",
      "score": 2,
      "body": "TSLA, MSTR, SOL, and BTC.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcepceh/",
      "created": 1720557351,
      "depth": 0,
      "replies": [
        {
          "id": "lceqhvw",
          "score": 1,
          "body": "Why SOL?",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lceqhvw/",
          "created": 1720557716,
          "depth": 1,
          "replies": [
            {
              "id": "lckii71",
              "score": 1,
              "body": "It’s where the developers are going. Just follow the money. They have the fastest transactions in any blockchain and this is before Firedancer is released. Also, Visa has had a contract with them. They also have games being built on their network. Tons of applications. Massive potential.",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lckii71/",
              "created": 1720643830,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcex3jb",
      "score": 1,
      "body": "PLAY",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcex3jb/",
      "created": 1720559796,
      "depth": 0,
      "replies": [
        {
          "id": "lcf2ca4",
          "score": 2,
          "body": "Actually, I’d wait for the fault 10 more %",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcf2ca4/",
          "created": 1720561543,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcf0m9e",
      "score": 1,
      "body": "Yesterday was nvda, meta, etc. So assuming you didn’t miss that opportunity. It seems to me one good opportunity that no one talks about is reits. My theory being this…\n\n-lots of the market has run up and valuations in some not all may hamper future returns. \n\n-reits are the opposite which is due to rate hikes and they are still down. But if rate cuts happen or even just stability, reits benefit. \n\n-many income reits have yields 5-6% and a well supported cash flow for the dividend (well technically its a return of capital). That may seem like not so great return if they don’t appreciate so..\n\n-the plan for me is selling options at opportune moments (aka speculating a bit on the ups and downs) collecting premiums AND dividends. Not really needing it to appreciate. And with an over 5% yield I also borrow money at around 5% and the dividend and my interest payments are about a wash while I collect the option premiums.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcf0m9e/",
      "created": 1720560962,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcf1e0j",
      "score": 1,
      "body": "GPN",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcf1e0j/",
      "created": 1720561222,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcf5ywe",
      "score": 1,
      "body": "US equity ETF and international equity ETF.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcf5ywe/",
      "created": 1720562806,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcf9ipe",
      "score": 1,
      "body": "50% GSEW and 50% EDV, until rates fall, then 100% GSEW.  If you want to prep for a recession.\n\n\nIf you think we will get a soft landing and avoid all historic precedence then VOO is good.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcf9ipe/",
      "created": 1720564091,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcfioz3",
      "score": 1,
      "body": "Sgov 5% risk free at aths?  I’m fine with that",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfioz3/",
      "created": 1720567942,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcfohom",
      "score": 1,
      "body": "Yancoal.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfohom/",
      "created": 1720570140,
      "depth": 0,
      "replies": [
        {
          "id": "lcfz1h9",
          "score": 2,
          "body": "How come?",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfz1h9/",
          "created": 1720574169,
          "depth": 1,
          "replies": [
            {
              "id": "lcjkikf",
              "score": 1,
              "body": "Monster profits with a sexy dividend",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcjkikf/",
              "created": 1720633272,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcgbovs",
      "score": 1,
      "body": "Health care because obviously global population is aging.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcgbovs/",
      "created": 1720579130,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgfnsc",
      "score": 1,
      "body": "LULU and STNE",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcgfnsc/",
      "created": 1720580791,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgi2go",
      "score": 1,
      "body": "VITL - Egg company with fantastic growth & continuing to expand.  Check them out for yourself.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcgi2go/",
      "created": 1720581847,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgmhnl",
      "score": 1,
      "body": "Boosted crispr stocks today..they are killing it. Just gonna take a long time but. I think everyone should have some exposure to it. Major…major moonshot. \nI think they willl bring in the next age of cancer treatment and cure diabetes at some point. Phase 3 on type one diabetes for crispr therapeutics.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcgmhnl/",
      "created": 1720583876,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgnwr0",
      "score": 1,
      "body": "Defense contractors and recession-proof industries.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcgnwr0/",
      "created": 1720584561,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lchadi5",
      "score": 1,
      "body": "15-20 year hold? AMZN",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lchadi5/",
      "created": 1720597880,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lchdmt8",
      "score": 1,
      "body": "Tech, it’s the clear and obvious option. Anyone that says otherwise is just afraid",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lchdmt8/",
      "created": 1720600173,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lchuygc",
      "score": 1,
      "body": "Mag7 easy as that",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lchuygc/",
      "created": 1720611237,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcizzo5",
      "score": 1,
      "body": "I'm unsure but I think that semiconductors are going to be needed more and more. It seems like everything now has semiconductors in it, oven, fridge, dishwasher. EV's have something like 3000 in every car. There's only going to be more and more uses for chips.\n\nSo I just keep buying more SMH",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcizzo5/",
      "created": 1720626733,
      "depth": 0,
      "replies": [
        {
          "id": "lcjtcpp",
          "score": 1,
          "body": "Thanks for the input!",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcjtcpp/",
          "created": 1720636061,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcjlvey",
      "score": 1,
      "body": "Cruise stocks have had an incredible run, and RCL looks high right now but it could go further. CCL and NCL too",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcjlvey/",
      "created": 1720633697,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lck0pzh",
      "score": 1,
      "body": "If you want a ‘speculative’ stock (which is essentially de-risked) with a chance for outsized returns then look no further than ASTS. To give you an idea of potential - it’s currently trading at 12 bucks. Deutsche Bank have a 650 PT by 2027..\n\nI have massive belief in the company - currently all in with $240k. If interested, check my page as I made a post about it.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lck0pzh/",
      "created": 1720638365,
      "depth": 0,
      "replies": [
        {
          "id": "lco49i3",
          "score": 1,
          "body": "Will do!",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lco49i3/",
          "created": 1720703573,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcmvra8",
      "score": 1,
      "body": "Intuit & Doordash I’m thinking of starting a position",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcmvra8/",
      "created": 1720677554,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcfxg2q",
      "score": 1,
      "body": "American. Military. Industrial. Complex. Why? Because either there is peace in our time, America is in a crisis beyond saving anyways, or I'm rich.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfxg2q/",
      "created": 1720573561,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg1dd7",
      "score": 1,
      "body": "ARM",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcg1dd7/",
      "created": 1720575071,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lceym4z",
      "score": 1,
      "body": "Okay, so bio is always super speculative and risky, and now is no different. But we're coming out of a covid shadow, and there are a lot of companies that are having big catalysts.\n\nI'm heavy in ibrx, iova, SLS, alt, vktx",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lceym4z/",
      "created": 1720560296,
      "depth": 0,
      "replies": [
        {
          "id": "lcfyrn8",
          "score": 2,
          "body": "I have been buying IOVA, Thanks for the other stocks!",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfyrn8/",
          "created": 1720574065,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcefb3h",
      "score": 0,
      "body": "If you are not adverse to risk?\n\n$BETR    An Internet mortgage company. \n\nThey dropped right after IPO because the Fed started raising financing rates. And thus mortgages. They WERE a $10/share company (actually went to $45 briefly) but dropped to \n.50¢/share after Fed rates jumped. \n\nAll they are waiting for is for the Fed to start lowering rates, and mortgage rates to lower. They’re currently increasing their profits. AND they have $500 million cash on-hand. \n\nShould go back to $10 within the next 2 years. IF Mortgage rates start decreasing. Which is what I personally believe will happen. Especially if trump gets reelected since he’s a real estate guy. But even if Biden stays in office?  I see the Fed lowering rates. I just see it happening faster under Trump.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcefb3h/",
      "created": 1720554193,
      "depth": 0,
      "replies": [
        {
          "id": "lceh5ul",
          "score": 2,
          "body": "I thought better was a mental health (scummy) company?",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lceh5ul/",
          "created": 1720554771,
          "depth": 1,
          "replies": [
            {
              "id": "lcfhpgw",
              "score": 1,
              "body": "Better might be\n\nBut BETR is Better Home & Finance Holding Co\nNASDAQ: BETR\n\nLook it up",
              "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfhpgw/",
              "created": 1720567571,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lcehhj0",
          "score": 0,
          "body": "What makes you think the stock will rise when rates get lower? If rates don’t lower what will happen?",
          "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcehhj0/",
          "created": 1720554871,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcfimx3",
      "score": -2,
      "body": "Trump bibles. I’m buying as many as I can.  They’ll be worth so much money when he dies.",
      "permalink": "/r/stocks/comments/1dza69b/what_would_you_invest_in_today/lcfimx3/",
      "created": 1720567920,
      "depth": 0,
      "replies": []
    }
  ]
}