{
  "title": "Billionaire Sackler family members could face fresh lawsuits after Purdue Opioid settlement falls apart",
  "score": 1640,
  "selftext": "",
  "link_flair_text": "News",
  "id": "1dzgdlv",
  "num_comments": 210,
  "created_utc": 1720566274,
  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/",
  "url_overridden_by_dest": "https://www.forbes.com.au/news/billionaires/purdue-billionaire-sackler-family-members-could-face-new-lawsuits/",
  "comments": [
    {
      "id": "lcgmqnf",
      "score": 1,
      "body": "Thanks for your submission!\n\nr/WallStreetBets is ultimately a community about making money through trading, and our conversations should shift around that.\n\nPolitics are fundamentally intertwined with making money, and political actions almost always have an impact on financial markets.\n\nStill, we need to make sure that when we have these discussions, we're explicitly calling out the financial impacts of the politics we're discussing. Otherwise, the conversation can very easily veer off into flamewars and boring, unproductive, discussion.\n\nHere's an example of a political comment that doesn't offer any value:\n\n* \"I hate this new green policy from the Biden administration. What a fucking idiot\"\n\nNow compare it to this:\n\n* \"I hate this new green policy from the Biden administration. It threatens the profit margins of oil companies because they will need to expand their OpEx. I have calls on Shell that are going to get decimated at open.\"\n\nThe latter is significantly more interesting and offers a great jumping point into market related discussion.\n\nPut succinctly: If you choose to start or engage in arguments about libtards or Nazis instead of making fun of their bad SPY long then you're in the wrong place and we'll show you the door.\n\nIf you're not sure if your content is political, it probably is, and there's probably a better way to post it without making things weird.\n\n---\n\nAll that being said, we are here to help. We want to make it as easy as possible for you to post to our community. We have to balance this with making the subreddit interesting for our readers. \n\nIf you need some guidance, don't hesitate to [reach out to modmail](https://old.reddit.com/message/compose/?to=/r/wallstreetbets) and we'll give you some pointers!",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgmqnf/",
      "created": 1720583996,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcffwsy",
      "score": 720,
      "body": "Good.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcffwsy/",
      "created": 1720566890,
      "depth": 0,
      "replies": [
        {
          "id": "lcfmbtb",
          "score": 230,
          "body": "Can’t upvote this ENOUGH. They knew what they were doing. And still do.",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfmbtb/",
          "created": 1720569307,
          "depth": 1,
          "replies": [
            {
              "id": "lcfzhah",
              "score": -107,
              "body": "So does alchohol and tobacco.  We all know chemicals are addictive, people just want to blane others to get settlements.  I dint care what the advertising says, its on you as an adult to know sonething is wrong.",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfzhah/",
              "created": 1720574337,
              "depth": 2,
              "replies": [
                {
                  "id": "lcg0n5l",
                  "score": 43,
                  "body": "And we shouldn’t have trusted our doctors either right??",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg0n5l/",
                  "created": 1720574787,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcg5dca",
                      "score": 21,
                      "body": "Doctors were scrutinized for not treating the patient's pain adequately back then. Now, we're at the other end of the spectrum where people that have intractable pain cannot get these prescriptions. We tell them to live with it now.",
                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg5dca/",
                      "created": 1720576614,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lch5wlq",
                          "score": 2,
                          "body": "There IS ,, a responsible medium ..and these Dr's have the publics unquestioned trust...  I don't wanna hear one of these doctors complain about losing their license...\nYou turned honest people into drug addicts for the sake of your treasured money ...  real peice of shit humans were talking about here.",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lch5wlq/",
                          "created": 1720594845,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lcg73qa",
                          "score": 5,
                          "body": "According to who? Lobbyists for big Pharma and the Sackler family",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg73qa/",
                          "created": 1720577299,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lcg7qa1",
                              "score": -9,
                              "body": "It's a complex topic and obviously you seem to have a personal stake in this. All 3 parties are at fault, the patient is not immune from this. Having an addiction doesn't absolve you of all responsibility.",
                              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg7qa1/",
                              "created": 1720577545,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lcg9c5u",
                                  "score": 3,
                                  "body": "I only saw the first sentence you wrote about doctors being scrutinized for not treating pain adequately. I agree with you 100%. There will always be addicts. There will always be shady doctors willing to over prescribe for an extra buck and there will always be big pharma pushing new meds. Some people really need these medications. OxyContin on the other hand, the world would have been a much better place without. They knew exactly what they were doing",
                                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg9c5u/",
                                  "created": 1720578180,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lcgjrgc",
                                      "score": 1,
                                      "body": "> OxyContin on the other hand, the world would have been a much better place without. \n\nThe UK has much less of an opioid problem, and I definitely see oxycodone being used for certain reasonable things (though not hugely common) - e.g. cancer, sickle cell crisis, etc. \n\nDefinitely not handed out like candy like in the US though (e.g. tooth extractions, whereas here you'd just get cocodamol, i.e. codeine/acetaminophen 30/500)",
                                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgjrgc/",
                                      "created": 1720582614,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lcgl7s6",
                                          "score": 3,
                                          "body": "Oxycodone and OxyContin are two completely different drugs. Yes Oxycodone is the main ingredient in OxyContin but the formulation is completely different in OxyContin. Oxycodone has been around for over a hundred years and is commonly used in pain management all over the world. I guess the UK got lucky and didn’t flood the nation with OxyContin",
                                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgl7s6/",
                                          "created": 1720583279,
                                          "depth": 9,
                                          "replies": []
                                        },
                                        {
                                          "id": "lcgmd7u",
                                          "score": 3,
                                          "body": "Cancer patients and the terminally ill are the only people a drug like this should have ever been prescribed to. Just like fentanyl unless you’re in a hospital setting. They literally were giving out 80mg tablets for headaches. Everything under the sun. This drug single handedly started the biggest opioid epidemic the US has ever seen",
                                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgmd7u/",
                                          "created": 1720583818,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lcg11gp",
                      "score": -28,
                      "body": "No.  Anything that treats pain can trick the brain into depedency.",
                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg11gp/",
                      "created": 1720574941,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lcg23wn",
                          "score": 19,
                          "body": "It’s easy to say 20 yrs later. Lemme guess u knew better than the thousands of doctors that pushed this synthetic heroin to millions of americans under the narrative that it was the least addictive non habit forming pain pill on the market",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg23wn/",
                          "created": 1720575361,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lcg7ksa",
                          "score": 7,
                          "body": "Doctors were literally prescribing these meds for any kind of pain and saying they prescribed these SPECIFICALLY because of the low rate of addiction or lower rates when compared to other medications. \n\nYou're not wrong, but you're over looking HOW people BECOME addicted. Doctors TOLD people that the risk of addiction was incredibly low SPECIFICALLY because they were misled as well. \n\nMaybe research what you're talking about before trying to sound intelligent. You honestly just sound ignorant and like you can't bother to even Google something you clearly don't understand",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg7ksa/",
                          "created": 1720577485,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lcg3fen",
                          "score": 3,
                          "body": "Clearly you have never had chronic pain. OxyContin is nothing like any other pain medication. Yes all pain medications are habit forming when abused but that is not how Purdue marketed this drug. Pure heroin in a pill, plain and simple",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg3fen/",
                          "created": 1720575870,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lcggodb",
                          "score": 1,
                          "body": "Pure hate, sheepish trend 🐑",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcggodb/",
                          "created": 1720581236,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lcgg6lk",
                          "score": 1,
                          "body": "it's true I can't stop boofing acetaminophen",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgg6lk/",
                          "created": 1720581018,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lcg4n2i",
                  "score": 11,
                  "body": "Watch the Netflix story and tell me these companies weren’t purposely ruining people’s lives for profit",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg4n2i/",
                  "created": 1720576333,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcg7y2q",
                      "score": 1,
                      "body": "This 👆They absolutely were and that’s only a small fraction cut made into a 90min show. Anyone who hasn’t watched, check it out among several other docs over the years. OxyContin express to name one",
                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg7y2q/",
                      "created": 1720577630,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lcg623y",
                      "score": -14,
                      "body": "I know.  Thats why i said alchol and tobacco.",
                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg623y/",
                      "created": 1720576884,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lcg8drs",
                          "score": 7,
                          "body": "Have you ever been prescribed cigarettes and alcohol by a doctor who SWEARS they have read the research papers and that these medications (oxycontin) etc. have incredibly low rates of addiction and to not be concerned about it? \n\nStop being an ass when you are clearly either too dumb to understand or too ignorant to care that you are.\n\nThe doctors who did their research were reading fraudulent studies. Do you support fraud so blatantly that even though millions died you blame them for believing the researchers?\n\nThat's a uniquely idiotic stance to take--even in this sub.",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg8drs/",
                          "created": 1720577802,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lcgazfz",
                              "score": 3,
                              "body": "Guy is a moron, he wnt even read half what your wrote anyway",
                              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgazfz/",
                              "created": 1720578840,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lcgdwv0",
                                  "score": 3,
                                  "body": "No, it's like talking to a wall... oh, sorry, only read the first half of your message /jk",
                                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgdwv0/",
                                  "created": 1720580045,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lcg0i8g",
                  "score": 29,
                  "body": "You clearly have never taken oxy",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg0i8g/",
                  "created": 1720574733,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lchtbb5",
                      "score": 1,
                      "body": "Makes life feel better",
                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lchtbb5/",
                      "created": 1720610378,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lcg2v82",
                  "score": 17,
                  "body": "You seriously comparing alcohol and tobacco to fucking Opium?! Jesus Christ. Please get off of Fox News for five seconds.",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg2v82/",
                  "created": 1720575653,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcgmwua",
                  "score": 2,
                  "body": "The difference is that alcohol and tobacco is advertised and well established as addictive. Oxy was tactfully marketed as non addictive in order to manipulate doctors, patients, and sales in general.",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgmwua/",
                  "created": 1720584077,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcgi4ww",
                  "score": 1,
                  "body": "Oh please, Dr.s were throwing out prescriptions like Mardi Gras beads. There were no limits on refills and Pharmaceutical companies loved it.",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgi4ww/",
                  "created": 1720581876,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcholzl",
                  "score": 1,
                  "body": "Just like your parents knew something was wrong yet still cursed us all with having to suffer you right?",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcholzl/",
                  "created": 1720607692,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcggkpi",
                  "score": 1,
                  "body": "I upvoted you just cuz your first amendment right was violated. Carry on with free speech soldier.",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcggkpi/",
                  "created": 1720581191,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcg7f0k",
                  "score": 0,
                  "body": "Man why don’t you let everyone know how far up your own ass you are huh?  Oh you already did!",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg7f0k/",
                  "created": 1720577423,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcgl2za",
                  "score": -2,
                  "body": ".",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgl2za/",
                  "created": 1720583217,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lcfueet",
          "score": 81,
          "body": "Did you see how the settlement money was going to be spent? No? Its because they don't know what to do with it and were going to spend it all in stupid shit for police and other superfluous things and not addressing the real addiction problem?\n\nGood that it felt apart, fuck them all Sackler pieces of shit and bleed them dry.",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfueet/",
          "created": 1720572395,
          "depth": 1,
          "replies": [
            {
              "id": "lcfvcz3",
              "score": 63,
              "body": ">stupid shit for police\n\nAhh yea, this military vehicle designed for withstanding IED blasts will help prevent opioid addictions and abuse",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfvcz3/",
              "created": 1720572763,
              "depth": 2,
              "replies": [
                {
                  "id": "lcfyzyj",
                  "score": 21,
                  "body": "How are you going to fight drugs without antitank weapons for the cops? /s",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfyzyj/",
                  "created": 1720574153,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcg8b4p",
                      "score": 4,
                      "body": "Yeah man, what you gonna do when the tweakers and junkies roll up with a panzer?",
                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg8b4p/",
                      "created": 1720577772,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lcge1lq",
                          "score": 1,
                          "body": "[It's a real problem](https://youtu.be/fAXDWjXsvzw?feature=shared)",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcge1lq/",
                          "created": 1720580101,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lcgge4g",
                          "score": 1,
                          "body": "The Cartels pretty much do but the cops never seem to give a shit about them.",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgge4g/",
                          "created": 1720581110,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lcfxd4e",
                  "score": 13,
                  "body": "It's fucking insane, that money should go to prevention. Im not even in the USA and when I saw that piece of Last Week Tonight I almost choked with anger",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfxd4e/",
                  "created": 1720573530,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcgk0rj",
                  "score": 1,
                  "body": "What if the junkies deploy IEDs?",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgk0rj/",
                  "created": 1720582733,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcfzp4g",
                  "score": -2,
                  "body": "LRAD is really nice though, and calls on axon",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfzp4g/",
                  "created": 1720574421,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcggsen",
                  "score": -2,
                  "body": "Police are stupid.. it’s like modern day plantation owners. I got made media on “rich” cops.",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcggsen/",
                  "created": 1720581284,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcga7yi",
              "score": 4,
              "body": "Other side of the coin no doubt.  All the money earmarked for fixing the problem just slush funded to private interests, government 101.",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcga7yi/",
              "created": 1720578532,
              "depth": 2,
              "replies": [
                {
                  "id": "lcggjqr",
                  "score": 2,
                  "body": "All fine money pretty much goes to special interest groups and other BS. They should gather it all in a pile every year and burn it. Combat inflation.",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcggjqr/",
                  "created": 1720581178,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcheufm",
              "score": 1,
              "body": "I want to see their money actually go to families who were directly affected by this shit in any way that can be reasonably done. Every damn cent. That's the only way to start in the right direction again IMO.",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcheufm/",
              "created": 1720601019,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lcfz2s6",
          "score": 3,
          "body": "\"Could\"",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfz2s6/",
          "created": 1720574183,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcg8pms",
          "score": 3,
          "body": "They get a super small fine compared to how much money they were making off of it, say sorry and then commit more crimes 😒.",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg8pms/",
          "created": 1720577931,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcgei9z",
          "score": 3,
          "body": "Shit I had to recheck what subreddit I was on lol. \n\nThis is good tho very good",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgei9z/",
          "created": 1720580297,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcg69bk",
          "score": 5,
          "body": "The Supreme Court just ruled that all sacklers have immunity.  Just like the founding fathers intended",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg69bk/",
          "created": 1720576966,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcgi1uy",
          "score": 2,
          "body": "Criminal charges would be good",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgi1uy/",
          "created": 1720581840,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcfo1pi",
      "score": 257,
      "body": "There are grandkids living off this money and trying to hide it.  The family is still absolutely loaded and benefiting from this debacle.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfo1pi/",
      "created": 1720569970,
      "depth": 0,
      "replies": [
        {
          "id": "lcfqj9h",
          "score": 79,
          "body": "If you factor in all liabilities they still have billions in surplus. I hope that changes.  ",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfqj9h/",
          "created": 1720570919,
          "depth": 1,
          "replies": [
            {
              "id": "lcfw07n",
              "score": -30,
              "body": "People are too dumb and lazy to do anything \n\nthey rather wait for someone else to do it like with this lawsuit.",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfw07n/",
              "created": 1720573009,
              "depth": 2,
              "replies": [
                {
                  "id": "lcfxq41",
                  "score": 15,
                  "body": "That family has powerful people in their pockets protecting them every step of the way.  Rudy Giuliani for example was one of their “lawyers,” as if he knows anything about pharmacology…",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfxq41/",
                  "created": 1720573666,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcgaj3p",
                      "score": 4,
                      "body": "Probably because he knows about law. This case is not about pharmacology, it's about conspiracy to defraud and violation of anti kickback statute. They pay an expert to come testify about the pharmacology.",
                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgaj3p/",
                      "created": 1720578657,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lcgh7nv",
                          "score": 3,
                          "body": "Reddit likes to pretend like Giuliani didn't take down the NYC mob. The guy is not dumb, that is for sure.",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgh7nv/",
                          "created": 1720581473,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lchf0uf",
                              "score": 1,
                              "body": "He's not smart either. The mob in those years though, boy were they ever dumb. That I can tell ya.",
                              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lchf0uf/",
                              "created": 1720601144,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lcfxz3p",
                      "score": -3,
                      "body": "That’s what I mean people can’t touch them\n\nand no one will try the “orthodox” way so all they can do is sit and complain and wait until someone tries doing something about it",
                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfxz3p/",
                      "created": 1720573763,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lcfy1lc",
          "score": 25,
          "body": "If I remember correctly, most of the family has relocated to Switzerland.  Probably a good move because that last name is pretty unpopular in the states these days.",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfy1lc/",
          "created": 1720573790,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcfqm4s",
          "score": 19,
          "body": "They have a museum with their name on it in Washington DC. Many buildings with their name on them apparently.\n\n\nI want their grandkid's grandkids to live in poverty like so many they have caused.",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfqm4s/",
          "created": 1720570950,
          "depth": 1,
          "replies": [
            {
              "id": "lcft5is",
              "score": 23,
              "body": "I don’t want anything bad for they grandkids grandkids but I also don’t want them to be able to enjoy the I’ll gotten gains of their predecessors",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcft5is/",
              "created": 1720571915,
              "depth": 2,
              "replies": [
                {
                  "id": "lcfuhym",
                  "score": 13,
                  "body": "yup, welcome to square one, poverty.\n\n\n\nI want them to overdraft their checking accounts. I want them to see how expensive it is to be poor.",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfuhym/",
                  "created": 1720572434,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcgky5c",
                      "score": 1,
                      "body": "Unfortunately the government is generally against actually punishing the rich - it has to be super egregious ",
                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgky5c/",
                      "created": 1720583156,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lcgim0a",
              "score": 3,
              "body": "The Sackler name was on buildings in 5 different countries. 9 in the US alone. All have since removed the name except Harvard University which still have 2 buildings under the Sackler name. Harvards president Lawrence Bascow refuses to remove the name or give back any of the Sackler money donated even after several protests from his students. Bascow took hundreds of millions and gave zero back to students affected by the opioid epidemic. Shocker SMH",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgim0a/",
              "created": 1720582092,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcg9bup",
              "score": 5,
              "body": "Even Tel Aviv University Med School in Israel removed their name last year,  [after refusing to stop accepting donations from the family in 2019.](https://www.haaretz.com/israel-news/2019-06-05/ty-article/tau-refuses-to-reject-donations-from-sackler-family-embroiled-in-opioids-crisis/0000017f-f5e1-d5bd-a17f-f7fb1f860000)",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg9bup/",
              "created": 1720578177,
              "depth": 2,
              "replies": [
                {
                  "id": "lcgitlx",
                  "score": 2,
                  "body": "The only place that name belongs is in a federal penitentiary",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgitlx/",
                  "created": 1720582187,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcgicva",
              "score": 2,
              "body": "All their names were removed.",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgicva/",
              "created": 1720581977,
              "depth": 2,
              "replies": [
                {
                  "id": "lcgjtmq",
                  "score": 1,
                  "body": "Id wanna be forgotten.",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgjtmq/",
                  "created": 1720582642,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcfkjzf",
      "score": 128,
      "body": "The only justice is being sued into oblivion, all assets sold to fund drug rehabilitation programs across the country.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfkjzf/",
      "created": 1720568649,
      "depth": 0,
      "replies": [
        {
          "id": "lcfq12l",
          "score": 19,
          "body": "And , each member of the Sackler family above the age of 18 should have been sentenced to life in community service at opioid centers.",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfq12l/",
          "created": 1720570726,
          "depth": 1,
          "replies": [
            {
              "id": "lcg4q4q",
              "score": 8,
              "body": "Even better, they should be fed their own drug every day, multiply the doses every month for a year and then cut them off cold turkey. Fuck those pieces of shit. They should all rot in prison. Every penny the Sacklers made off oxycontin  should be seized and distributed to rehabilitation  centers across the country",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg4q4q/",
              "created": 1720576365,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcggnu1",
              "score": 0,
              "body": "*^prison",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcggnu1/",
              "created": 1720581229,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lcgksbk",
          "score": 1,
          "body": "Sued? They probably started hiding their assets already.",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgksbk/",
          "created": 1720583082,
          "depth": 1,
          "replies": [
            {
              "id": "lcgwkem",
              "score": 1,
              "body": "That's not a problem if you have the US after your ass. If they went after their assets like it was Russia or Osama bin Laden. They wouldnt stop until they found all their assets\n\nThe problem is, will they actually do it",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgwkem/",
              "created": 1720589135,
              "depth": 2,
              "replies": [
                {
                  "id": "lch3hsl",
                  "score": 1,
                  "body": "True but I thought rich people are good at hiding their money. What's to say you give money to relatives and they'll buy gold, diamonds etc and hide it? \n\nThey probably won't find all of it.",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lch3hsl/",
                  "created": 1720593286,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lch48po",
                      "score": 1,
                      "body": "Trust me, they can hide their money as much as possible but there's always a trail.\n\nYou literally need hound dogs that aren't bought off with lobbying or influence.\n\nLook at epstein. He was arrested multiple times before he came out as a creep",
                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lch48po/",
                      "created": 1720593767,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lchfcix",
                          "score": 1,
                          "body": "What happened to the crypto queen who disappeared with stolen billions?",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lchfcix/",
                          "created": 1720601371,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcfuasm",
      "score": 32,
      "body": "Fuck the Sacklers",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfuasm/",
      "created": 1720572355,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcfou35",
      "score": 18,
      "body": "Good luck getting through the family trust.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfou35/",
      "created": 1720570272,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg3xss",
      "score": 14,
      "body": "One of the worst family in all of history.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg3xss/",
      "created": 1720576066,
      "depth": 0,
      "replies": [
        {
          "id": "lcgfvoy",
          "score": 1,
          "body": "Is there a worse family in America in the last century?",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgfvoy/",
          "created": 1720580886,
          "depth": 1,
          "replies": [
            {
              "id": "lcghti8",
              "score": 1,
              "body": "The Texas Chain Saw family?",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcghti8/",
              "created": 1720581737,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcgk711",
              "score": 1,
              "body": "Don't think so. The deaths would fill stadiums.",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgk711/",
              "created": 1720582812,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcg41uk",
      "score": 11,
      "body": "Throw them in fucking jail forever. Fuck them",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg41uk/",
      "created": 1720576109,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcfolgv",
      "score": 47,
      "body": "Don’t stop till the entire family has to work minimum wage jobs",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfolgv/",
      "created": 1720570180,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg3nwq",
      "score": 8,
      "body": "Send those drug dealers to jail. Hunt them down like we did Pablo Escobar",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg3nwq/",
      "created": 1720575960,
      "depth": 0,
      "replies": [
        {
          "id": "lcghngc",
          "score": 5,
          "body": "No, hunt them down the way FARC hunted Pablo and his associates. Super effective.",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcghngc/",
          "created": 1720581664,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcftc02",
      "score": 7,
      "body": "/r/UpliftingNews",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcftc02/",
      "created": 1720571984,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcfterb",
      "score": 13,
      "body": "The victims aren’t going to see a cent",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfterb/",
      "created": 1720572013,
      "depth": 0,
      "replies": [
        {
          "id": "lcghxil",
          "score": 2,
          "body": "Many of them are dead. Many more will be dead.",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcghxil/",
          "created": 1720581787,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcfecl8",
      "score": 6,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 months ago\n**Total Comments** | 2 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfecl8/",
      "created": 1720566281,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcfp86k",
      "score": 4,
      "body": "It’s not enough compared to what they have done",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfp86k/",
      "created": 1720570419,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg3wxt",
      "score": 4,
      "body": "30+ plus years after killing a generation of young Americans these scumbags are still on their yachts. Not one single aspect of their billionaire lifestyle has changed. Fuck these assholes. I wish the worst for them.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg3wxt/",
      "created": 1720576057,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcfkstp",
      "score": 34,
      "body": "The doctors who prescribed should also be held liable.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfkstp/",
      "created": 1720568742,
      "depth": 0,
      "replies": [
        {
          "id": "lcfmdu3",
          "score": 56,
          "body": "Physicians were told explicitly by Purdue Pharma that oxy wasn’t addictive. Simultaneously there were multiple government agencies/organizations pushing the nationwide campaign “pain is the 5th vital sign.” So you have the government pressuring physicians to take treating patients pain more seriously and a pharmaceutical company saying “hey, we have this great new non-addictive pain medicine.” Most physicians were just caught in the middle of a perfect storm of shit. I say most because there definitely were/are some legitimate bad actors out there over prescribing and enriching themselves off pill mills. Couldn’t agree more that those people belong in a cell.",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfmdu3/",
          "created": 1720569327,
          "depth": 1,
          "replies": [
            {
              "id": "lcfwhij",
              "score": 22,
              "body": "They can't pretend that the patient calling them 3 times a day, waiting outside their office or pharmacy before it opens, and offering to pay 100s in cash for more prescriptions weren't signs of addiction.",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfwhij/",
              "created": 1720573192,
              "depth": 2,
              "replies": [
                {
                  "id": "lcfy3u0",
                  "score": 15,
                  "body": "They knew. Its a fucking opioid. They just got to bill for a visit every time a junkie would come in for “pain”  which would be a 10 minute max visit. Assume they got $200+ per visit they were making thousands per day. Any ol’ physician could be a millionaire within a year or two.",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfy3u0/",
                  "created": 1720573814,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcfwut3",
                  "score": 5,
                  "body": "As I said… There were/are unequivocally some bad actors out there. Those people belong in jail.",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfwut3/",
                  "created": 1720573333,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcgd0xn",
              "score": 3,
              "body": "i mean... its an opioid. doctors would have to be pretty fucking willfully ignorant to believe that it wasn't going to be addictive without some legit evidence.",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgd0xn/",
              "created": 1720579678,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcfoc7m",
              "score": 2,
              "body": "I understand that being a doctor is purely rote memorization but at some point they actually should be expected to analyze and evaluate on a case by case basis.",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfoc7m/",
              "created": 1720570082,
              "depth": 2,
              "replies": [
                {
                  "id": "lcfwnc3",
                  "score": 11,
                  "body": "This is a pretty obtuse, unaware take on what’s involved in medical education. I was trying to be charitable and provide some education and nuance for your bad take on physician culpability in the opioid crisis. You’ve now made it glaring obvious you have no idea what you’re talking about regarding both the opioid epidemic as well as physicians education. Against my better judgment I’ll try again. Yes, the first 2 years of medical school involves a lot of rote memorization, as you said. The second 2 years of medical school as well as the subsequent 3-7 years of residency/fellowship training involves a lot more complex pattern recognition. You look at the patient in front of you, chief complaint, history, physical exam, labs, imaging, then synthesize that into a diagnose and treatment plan that makes sense. Patients don’t read the textbooks and most people are garbage historians. Patients that present as the textbooks describe are the exception, not the rule.",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfwnc3/",
                  "created": 1720573254,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcfyihw",
                      "score": -6,
                      "body": "We’ll try this first and then we’ll try this if that doesn’t work.",
                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfyihw/",
                      "created": 1720573969,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lcfphk7",
                  "score": 7,
                  "body": "It’s a shame that technology has reached the point where a poor uneducated sap like yourself can share shitty takes as if you have any idea what you are talking about",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfphk7/",
                  "created": 1720570519,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcfq0j7",
                      "score": -6,
                      "body": "Sure. Explain how being a doctor is not 99% rote memorization.",
                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfq0j7/",
                      "created": 1720570720,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lcfx28l",
                          "score": 5,
                          "body": "Interesting take from some who presumably is not a physician. Can’t everything be boiled down to rote memorization in that case?\n\nMedicine does require a lot of memorization but clinical context drives decision making. A very simple example. If a patient has awful osteoarthritis of their knee but expresses no pain. They may need surgical intervention but there’s no need for pain medications.\n\nUltimately the bad actors running pill mills DO deserve to face justice but the majority of physicians prescribing these meds were caught in the crossfire of the Sackler family and their lust for money. Those physicians will have to live with that for the rest of their life. And it does weigh on them.\n\nHopefully you value your physicians more than the robots you think they are.\n\n-Resident physician",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfx28l/",
                          "created": 1720573413,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lcfynpj",
                          "score": 2,
                          "body": "Let's see you perform a hip replacement or do brain surgery genius.",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfynpj/",
                          "created": 1720574023,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lcfz0sy",
                              "score": -2,
                              "body": "I would just read the textbook and academic literature like everyone else.",
                              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfz0sy/",
                              "created": 1720574162,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lcfzdtq",
                                  "score": 1,
                                  "body": "Good luck with that.",
                                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfzdtq/",
                                  "created": 1720574300,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lcg202j",
                                      "score": 0,
                                      "body": "I’m not creating a new procedure. It’s a tried and true procedure that literally involves rote memorization. You can think otherwise to justify the inflated expenses but the reality is that most people could perform this procedure with proper training.",
                                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg202j/",
                                      "created": 1720575319,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lcg2ddu",
                                          "score": 3,
                                          "body": "Lol ok rain man.",
                                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg2ddu/",
                                          "created": 1720575464,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lcfq9qv",
                          "score": 3,
                          "body": "No. Not going to waste any more time on you.",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfq9qv/",
                          "created": 1720570819,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lcfqn65",
                              "score": -4,
                              "body": "Maybe you can fix your lights and Steam deck instead",
                              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfqn65/",
                              "created": 1720570960,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lcfu33d",
                  "score": 2,
                  "body": "Medical errors are third leading cause of death according to John Hopkins. Not sure why people think doctors should be treated like infallible gods.",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfu33d/",
                  "created": 1720572273,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcg29iz",
                      "score": 6,
                      "body": "My manager died from doctors misdiagnosing her cancer for 2 years. When she finally got a 3rd opinion it was stage 4 and she was gone within 6 months.",
                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg29iz/",
                      "created": 1720575422,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lch4awh",
                          "score": 1,
                          "body": "Yep. Doctors miss stuff all the time. Because they are human. They also cannot have cutting edge research because they don’t have time to read everything.",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lch4awh/",
                          "created": 1720593806,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lcfzukt",
                      "score": 8,
                      "body": "The data that led to this “conclusion” is so flawed it’s unbelievable. They took a population comprised exclusively of Medicare patients (over 65) and patients in kidney failure and literally guessed how many of them might have died from medical error. They then extrapolated that number to the entire US population. They then used that number as the basis for what you’re referring to.",
                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfzukt/",
                      "created": 1720574480,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lcgegjp",
                          "score": 6,
                          "body": "As someone who has lost multiple loved ones to doctor errors, reducing this to \"the study was flawed\" isn't earning you any sympathy. There is a reason a -lot- of people don't trust doctors these days. And it's not all just antivax tinfoil bullshit.",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgegjp/",
                          "created": 1720580277,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lch3mvn",
                          "score": 2,
                          "body": "You are just making shit up. Instead of parroting stuff like doctors do, go to the source. \nMissed strokes are the highest missed diagnosis. \n\nhttps://www.hopkinsmedicine.org/news/newsroom/news-releases/2023/07/report-highlights-public-health-impact-of-serious-harms-from-diagnostic-error-in-us\n\n“A disease-focused approach to diagnostic error prevention and mitigation has the potential to significantly reduce these harms,” Newman-Toker says. “Reducing diagnostic errors by 50% for stroke, sepsis, pneumonia, pulmonary embolism and lung cancer could cut permanent disabilities and deaths by 150,000 per year.” ",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lch3mvn/",
                          "created": 1720593378,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lcg6ivh",
                      "score": 5,
                      "body": "That study is almost as scientifically accurate as outright guessing lol",
                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg6ivh/",
                      "created": 1720577073,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lch3wzn",
                          "score": 2,
                          "body": "Or about as scientifically accurate as the food pyramid. Or fats are bad for you.  \n\nIf doctors know so much about nutrition, why are obesity rates and diabetes skyrocketing despite their “expertise” and prescription drugs?",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lch3wzn/",
                          "created": 1720593559,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lcmc6to",
                              "score": 1,
                              "body": "Because of a lack of self control. There isn’t a medicine that cures or treats stupid",
                              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcmc6to/",
                              "created": 1720667657,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lcg6cef",
                  "score": 1,
                  "body": "Lol this an idiotic take",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg6cef/",
                  "created": 1720577001,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcg7w9i",
                      "score": 1,
                      "body": "And you would probably prescribe opiates(or anything) to someone if you could make $200k. But first you have to check with the hospital admins and insurance.",
                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg7w9i/",
                      "created": 1720577610,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lcmcipj",
                          "score": 1,
                          "body": "I don’t have to check with admin or insurance for anything. I don’t even require insurance to treat someone. I also only give max 3 days worth of an opiate, on the rare occasions I do.",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcmcipj/",
                          "created": 1720667800,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lcg598b",
              "score": 1,
              "body": "If I was a physician and I had a patient begging me for the 160mg oxys because they couldn’t feel the 80mg I just bumped them up to, id have a feeling that maybeee it was addictive",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg598b/",
              "created": 1720576569,
              "depth": 2,
              "replies": [
                {
                  "id": "lcgd8fa",
                  "score": 4,
                  "body": "also, if you're a doctor, you should know that opiates are addictive lol. it's not as if it was some mystery.",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgd8fa/",
                  "created": 1720579765,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcgceqd",
              "score": 0,
              "body": "> Simultaneously there were multiple government agencies/organizations pushing the nationwide campaign “pain is the 5th vital sign.” So you have the government pressuring physicians\n\nTrying to blame the behavior of the Sacklers on the government is wild",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgceqd/",
              "created": 1720579423,
              "depth": 2,
              "replies": [
                {
                  "id": "lcgidro",
                  "score": 1,
                  "body": "It's not, they had the gov in their pocket. This shit should have been obvious to everyone. It sure was to me. I didn't even need college to figure it out.",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgidro/",
                  "created": 1720581988,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcgm4zv",
                      "score": 0,
                      "body": "> It's not, they had the gov in their pocket.\n\nWhich is why the government never pursued charges.\n\nOh, wait, that's the complete opposite of reality, and you're lying.",
                      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgm4zv/",
                      "created": 1720583711,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lciv6f4",
                          "score": 0,
                          "body": "The regulatory bodies can have conflicting views within the same body. One generation can be bought and paid for and the next doesn’t have the same “financial incentives” their predecessors had. Or more likely it became increasingly obvious they were accepting blood money and guilt gets the better of them. It’s really not surprising when you consider how much money is spent on lobbying the government. It just a standard case of regulatory capture which is so prevalent in the US healthcare system that I’m surprised it has to be explained.",
                          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lciv6f4/",
                          "created": 1720625187,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lcjbb0m",
                              "score": 1,
                              "body": "> The regulatory bodies can have conflicting views within the same body.\n\n\"Well, even though all the evidence points to it being a lie, it could still technically be true.\"\n\nThat's when you cross the line into being a conspiracy. There's *literally zero evidence* that \"da gubmit\" was involved with this *at all*. There's zero *incentive* for them to be involved.\n\nWhat is both incredibly logical, and obviously true to anyone keeping their eyes open, is that the sacklers did what they did *for money*, and didn't need any government conspiracy to make money off the deaths of Americans.\n\n> I’m surprised it has to be explained.\n\nYou sound like you're surprised a lot.",
                              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcjbb0m/",
                              "created": 1720630358,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lcgijq7",
              "score": 0,
              "body": "BULLSHIT",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgijq7/",
              "created": 1720582063,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcftda2",
      "score": 7,
      "body": "I graduated HS 2001. OD death rate of my class has to be around 10%. I’d love to make $ off shorting them but I’d be too angry if I lost.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcftda2/",
      "created": 1720571998,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcfxky6",
      "score": 3,
      "body": "Best thing for them really, their therapy was going nowhere",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfxky6/",
      "created": 1720573612,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg4w5c",
      "score": 3,
      "body": "They richly deserve it.  So richly.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg4w5c/",
      "created": 1720576429,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgcbh7",
      "score": 3,
      "body": "Why is no one mentioning the death penalty? When 9/11 happened, we invaded two countries over ~3k people. There's been something like 600k opioid-related deaths since the Sacklers. They may not be responsible for all of those deaths, but given the way opioid deaths went up from around 4k a year in 2000 to nearly 20k today, it's clear they're responsible for a lot. Several hundred thousand. And no one is even mentioning the *possibility* of a death penalty.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgcbh7/",
      "created": 1720579385,
      "depth": 0,
      "replies": [
        {
          "id": "lcgigqo",
          "score": 5,
          "body": "Screw the death penalty, send them to Guantanamo",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgigqo/",
          "created": 1720582025,
          "depth": 1,
          "replies": [
            {
              "id": "lcgk0dv",
              "score": 3,
              "body": "Better yet just give them their products",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgk0dv/",
              "created": 1720582728,
              "depth": 2,
              "replies": [
                {
                  "id": "lcgluqm",
                  "score": 1,
                  "body": "And then take them away...",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgluqm/",
                  "created": 1720583578,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcgd4j1",
      "score": 3,
      "body": "I don’t know what the best thing to do for those who fell victim to addiction because these garbage humans.  They are worse than cartel members and have caused more deaths and destruction.  They should be treated as such criminals and punished to the max sentenced to death.  Take all their stuff and make sure they never get anything more ever.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgd4j1/",
      "created": 1720579719,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg4xjx",
      "score": 2,
      "body": "I’m not judging but throw the book at them.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg4xjx/",
      "created": 1720576444,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcfum60",
      "score": 5,
      "body": "Interesting take from some who presumably is not a physician. Can’t everything be boiled down to rote memorization in that case? \n\nMedicine does require a lot of memorization but clinical context drives decision making. A very simple example. If a patient has awful osteoarthritis of their knee but expresses no pain. They may need surgical intervention but there’s no need for pain medications.\n\nUltimately the bad actors running pill mills DO deserve to face justice but the majority of physicians prescribing these meds were caught in the crossfire of the Sackler family and their lust for money. Those physicians will have to live with that for the rest of their life. And it does weigh on them. \n\nHopefully you value your physicians more than the robots you think they are.\n\n-Resident physician",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfum60/",
      "created": 1720572479,
      "depth": 0,
      "replies": [
        {
          "id": "lcfwe29",
          "score": 3,
          "body": "Heads up, the person you meant to reply to is a few comments up. They may never see this. ",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfwe29/",
          "created": 1720573155,
          "depth": 1,
          "replies": [
            {
              "id": "lcfx0ut",
              "score": 2,
              "body": "Thanks will repost",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfx0ut/",
              "created": 1720573398,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcfui9d",
      "score": 2,
      "body": "Would anybody else here cause an epidemic if it meant you gained an estimated 35,000,000,000 + ?",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfui9d/",
      "created": 1720572437,
      "depth": 0,
      "replies": [
        {
          "id": "lcg4tiu",
          "score": 2,
          "body": "That wouldn’t help you sleep at night or not hate yourself.",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg4tiu/",
          "created": 1720576401,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcg2m1t",
      "score": 1,
      "body": "As they should... they knew what that shit can and has done to people. Bleed em dry",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg2m1t/",
      "created": 1720575557,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg5b4a",
      "score": 1,
      "body": "It’s difficult to go certain places. That name is like a black mark. \n\nI will actually read the article, though. Doesn’t sound good.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg5b4a/",
      "created": 1720576590,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg61gb",
      "score": 1,
      "body": "Is this the stock that Bill Hawk had purchased?",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg61gb/",
      "created": 1720576877,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg712t",
      "score": 1,
      "body": "That’s the best news I e heard in a long time",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg712t/",
      "created": 1720577270,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg7y31",
      "score": 1,
      "body": "Good fuck these rotten fucks",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg7y31/",
      "created": 1720577630,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg8uhb",
      "score": 1,
      "body": "It's somewhat appropriate their name has \"sack\" in it. They truly are sacks of shit",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg8uhb/",
      "created": 1720577985,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgav26",
      "score": 1,
      "body": "They should go to prison.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgav26/",
      "created": 1720578790,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgbz7t",
      "score": 1,
      "body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgbz7t/",
      "created": 1720579248,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgc8yc",
      "score": 1,
      "body": "So jail time?",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgc8yc/",
      "created": 1720579357,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgcn1r",
      "score": 1,
      "body": "Fuck these rich assholes, feel sorry for peopel wanting to get money but these a holes should not be able to sleep at night",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgcn1r/",
      "created": 1720579519,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgdcya",
      "score": 1,
      "body": "when even this supreme court hates you...",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgdcya/",
      "created": 1720579816,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcghe0q",
      "score": 1,
      "body": "Yeah right 😆 🤣",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcghe0q/",
      "created": 1720581551,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcghhjg",
      "score": 1,
      "body": "Don’t forget to add all your politicians in Washington to this. They all got rich, and still get rich, off of pharma. You ever hear of the FDA? Guess who approved this crap! The FDA should absolutely be part of this lawsuit. You don’t even need to know much about opioids and you know a 160 mg OxyContin is egregious. \n\nI don’t think they were buying police crazy vehicles but I’m actually okay with it. If you don’t know anything about trap houses and how the street drug business works, then you may have a problem with it. Guess where all the small city drugs come from? The big cities, so small town cops gotta go to big towns to do search warrants and get the people responsible for selling dope to their residents. I think more than anything the settlement was gonna provide Narcan to police agencies across the country.\n\nOh, and if you do a little research, guess who’s making a fortune off Narcan?",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcghhjg/",
      "created": 1720581593,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcghkx4",
      "score": 1,
      "body": "Take every fucking penny.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcghkx4/",
      "created": 1720581634,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgi6x3",
      "score": 1,
      "body": "Fuck em.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgi6x3/",
      "created": 1720581901,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgi845",
      "score": 1,
      "body": "Excellent. Leave them with nothing.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgi845/",
      "created": 1720581916,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgj1wn",
      "score": 1,
      "body": "What's the ticker? Is it too late to short?",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgj1wn/",
      "created": 1720582292,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgkeih",
      "score": 1,
      "body": "Family probably killed more people than all the serial killers in history combined multiple times.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgkeih/",
      "created": 1720582906,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgm3zd",
      "score": 1,
      "body": "While I am not at all an admirer of the People's Republic of China, I still recognize the Broken Clock Principle.\n\n[https://moguldom.com/384320/report-out-of-72-billionaires-in-china-14-were-executed-by-government-15-murdered-and-17-committed-suicide/](https://moguldom.com/384320/report-out-of-72-billionaires-in-china-14-were-executed-by-government-15-murdered-and-17-committed-suicide/)",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcgm3zd/",
      "created": 1720583698,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lch5jiv",
      "score": 1,
      "body": "This conglomerate needs to be cut off ,,RIGHT AT THE KNEES ... A NONRECOVERABLE PENALTY FOR ALL OF THE LIVES THEY DESTROYED IN THE NAME OF FUCKING ....MONEY ...SMH",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lch5jiv/",
      "created": 1720594609,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcffo7s",
      "score": 1,
      "body": "Rip",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcffo7s/",
      "created": 1720566801,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcfw98r",
      "score": 1,
      "body": "Good, make those evil fuckers suffer for what they did. Killed so many of my friends, and they did it on fucking purpose.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfw98r/",
      "created": 1720573105,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcfxczf",
      "score": 1,
      "body": "Good. Fuck them!! Biggest drug dealers/killers in the planet. I hope they rot in hell and go bankrupt. Fucking bums",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfxczf/",
      "created": 1720573528,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcfyugr",
      "score": 1,
      "body": "Hopefully, they willl make a Loss post here soon -->  $10.8 B going to $0 or less....",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfyugr/",
      "created": 1720574094,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg0kg4",
      "score": 1,
      "body": "These lawsuits will go on for the next 10,000 years",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg0kg4/",
      "created": 1720574757,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg0nue",
      "score": 1,
      "body": "Thank fudding god",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg0nue/",
      "created": 1720574793,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg0e20",
      "score": 0,
      "body": "Hang'em high! These people are so terrible and responsible for what is currently going on as well. What morty did will Valium previously is just as awful.\n\nEdit: Also, that's a common phrase, but I don't support capital punishment. Not that my opinion on that issue really matters for a wsb comment.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg0e20/",
      "created": 1720574688,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcfo12j",
      "score": 0,
      "body": "![img](avatar_exp|99615856|dizziness)",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfo12j/",
      "created": 1720569962,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg332c",
      "score": 0,
      "body": "Sacktickler?",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg332c/",
      "created": 1720575736,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg85ek",
      "score": 0,
      "body": "Sacklers should just become the next POTUS.  Then poisoning the lower socioeconomic strata of West Virginia would be an official act of the WH and they would be immune",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcg85ek/",
      "created": 1720577709,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcffphe",
      "score": -30,
      "body": "Eh, it's roughing making money in pharma. Opioids have relieved so much suffering for all their abuse.",
      "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcffphe/",
      "created": 1720566814,
      "depth": 0,
      "replies": [
        {
          "id": "lcfmyqo",
          "score": 9,
          "body": "Bullshit",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfmyqo/",
          "created": 1720569546,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcfnlg2",
          "score": 8,
          "body": "And ruined a ton more cause they told doctors to prescribe them candy",
          "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfnlg2/",
          "created": 1720569789,
          "depth": 1,
          "replies": [
            {
              "id": "lcfohuu",
              "score": -3,
              "body": "NGL as a former alcoholic with friends who died from overdoses: *nobody wants to say it but that's the patients fault.*",
              "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfohuu/",
              "created": 1720570142,
              "depth": 2,
              "replies": [
                {
                  "id": "lcfs076",
                  "score": 4,
                  "body": "And now, people who are in legitimate pain get 8 days...EIGHT DAYS of pain relief after a tlif and told after 'take some tylenol and ice'...",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfs076/",
                  "created": 1720571479,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcfu4x6",
                  "score": 2,
                  "body": "Some yes. Not all.",
                  "permalink": "/r/wallstreetbets/comments/1dzgdlv/billionaire_sackler_family_members_could_face/lcfu4x6/",
                  "created": 1720572292,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}