{
  "title": "When should I sell a stock that has taken a large % of my portfolio over time because of the gains?",
  "score": 38,
  "selftext": "[deleted]",
  "link_flair_text": "Advice",
  "id": "1dzjhfe",
  "num_comments": 69,
  "created_utc": 1720574976,
  "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/",
  "comments": [
    {
      "id": "lcg14om",
      "score": 1,
      "body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcg14om/",
      "created": 1720574977,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg3gq4",
      "score": 149,
      "body": "Let your winners run.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcg3gq4/",
      "created": 1720575884,
      "depth": 0,
      "replies": [
        {
          "id": "lcg76de",
          "score": 82,
          "body": "Let your winners run, that is, unless prudent risk management dictates otherwise in light of your situation and goals. That said, a 10% weight in a single stock doesn’t strike me as a risk management concern at all—especially with a stable mega cap like Google, which is also an incredibly diversified company in and of itself.",
          "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcg76de/",
          "created": 1720577327,
          "depth": 1,
          "replies": [
            {
              "id": "lcg8hsn",
              "score": 17,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcg8hsn/",
              "created": 1720577845,
              "depth": 2,
              "replies": [
                {
                  "id": "lcgckj9",
                  "score": 5,
                  "body": "I personally like tech stocks because it combines my understanding of technology with something that I'm not as strong as yet. \n\nMy one advice would be to keep track of anti-trust litigation involving any of the big tech companies if you own stock in them. \n\nPeople who don't understand what that could mean for this company's could potentially cause damage to those companies or the companies themselves could do damage to their own in idiot moves intent to medicate the risks risks that they face. \n\nEspecially since this is the first time that I can think of that any of the big tech companies are facing government investigations from multiple fronts, i.e. at any given time the United States, the EU, India, Brazil, the UK, Canada, New Zealand, Australia, (may have missed some) have all in various degrees threatened to go after these companies. \n\nI do agree that out of all of them Google is most diversified. It also has the most open market policies in terms of for example the app store which is one of the bigger points of contention with Apple.",
                  "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgckj9/",
                  "created": 1720579490,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lci0vhv",
                  "score": 6,
                  "body": "While I agree with the approach, I disagree that Google is diversified. Their earnings are dominated by one thing, and even all the pies they have fingers in don't get you that much breadth. I do strongly agree with the approach , I'm limiting my stake to a percentage of portfolio. And I strongly advocate having a plan and sticking to it, reactive actions to unexpected movements in markets are rarely the right ones. Also, while I still believe Google is a great investment, I stay skeptical of that judgement as confirmation bias. Which is why I stick to the system. I trust my judgement more at the time when I made that decision than I do now (for Google).",
                  "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lci0vhv/",
                  "created": 1720614043,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcg98ce",
              "score": 6,
              "body": ">especially with a stable mega cap like Google, which is also an incredibly diversified company in and of itself.\n\nIf this was the summer of 2000, you could have written that exact same sentence, but replace \"Google\" with \"GE\".   \n  \nYou'd look back 24 years later and feel silly.",
              "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcg98ce/",
              "created": 1720578138,
              "depth": 2,
              "replies": [
                {
                  "id": "lcgbf1w",
                  "score": 16,
                  "body": "Sure, there’s always anecdotes like this. I’ve noticed that lots of folks will jump at the chance to cite a single counter-example with the sole aim of trolling someone else’s sound advice. But I don’t see that as a productive contribution to the discussion whatsoever. \n\nOP could very well sell half his Google and watch it go on to massively outperform the market over the next decade, which would also be silly. \n\nWhether or not you think Google is the next GE—that’s a different question. Put simply, I don’t see any reason to sell a stock merely because it’s run up from 4% to 10% of portfolio allocation. There might be other reasons to sell or trim, but that isn’t what OP is asking about.",
                  "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgbf1w/",
                  "created": 1720579018,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcga12y",
                  "score": 1,
                  "body": "It's still only 10% of his portfolio",
                  "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcga12y/",
                  "created": 1720578457,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lckpj68",
                  "score": 1,
                  "body": "Googles income is mostly because of the ads. Google is the biggest advertising company, thats why Im still holding all my goog stock.",
                  "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lckpj68/",
                  "created": 1720645994,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcgeykf",
                  "score": 0,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgeykf/",
                  "created": 1720580489,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcgnpzi",
                      "score": -3,
                      "body": "YouTube is NICE. …but its not search. Every search threat via AI is baked in partially while still being unknown. Even though they are an \nAI leader it doesnt mean they are that well diversified. They are third in cloud.\n\nI would call Apple via iPhone plus services and walled garden/status symbol diversified. Ditto for Microsoft via enterprise suite, cloud, gaming, GTP. \n\n\nI personally would take my investment back/let the rest ride and bet on another hyper growth horse or even a slow and steady winner like BRK ….This of course depends on OPs age, risk tolerance, goals etc.",
                      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgnpzi/",
                      "created": 1720584470,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lcia4sg",
          "score": 4,
          "body": "Well, but don't be greedy and not take gains. How many countless times do I keep holding only to watch a stock go back down and wipe out gains? Don't be like me",
          "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcia4sg/",
          "created": 1720617887,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcg4u06",
      "score": 29,
      "body": "I usually thin a position that has grown a lot.  \n\nI bought FB for $19.30 after the IPO crashed and burned.  What I hold today is up 2600%.  When it hit $150 I sold enough to pay the cost of my 550 shares and a $5000 profit.  I kept the rest mostly because I had stupidly bought it in my taxable stock account instead of one of my IRAs.\n\nThe rest of it will go to several of my heirs so that the tax liability goes away.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcg4u06/",
      "created": 1720576407,
      "depth": 0,
      "replies": [
        {
          "id": "lcgpb2x",
          "score": 3,
          "body": "What is the benefit of using an IRA to buy stocks?",
          "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgpb2x/",
          "created": 1720585242,
          "depth": 1,
          "replies": [
            {
              "id": "lcgy6id",
              "score": 8,
              "body": "No taxes",
              "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgy6id/",
              "created": 1720590058,
              "depth": 2,
              "replies": [
                {
                  "id": "lcj1u2m",
                  "score": 4,
                  "body": "Only for a roth.",
                  "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcj1u2m/",
                  "created": 1720627326,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcj27dv",
                      "score": 2,
                      "body": "Guess I figured that was implied",
                      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcj27dv/",
                      "created": 1720627445,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lci9ljh",
              "score": 1,
              "body": "OMG, I hope you don't buy stocks and not know the answer to this question.\n\nNo taxes on dividends, interest and capital gains.  No short- or long-term gains, just gains which aren't taxed.  Taxes, taxes, taxes are the benefits of buying individual stocks inside an IRA.",
              "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lci9ljh/",
              "created": 1720617679,
              "depth": 2,
              "replies": [
                {
                  "id": "lcjchxd",
                  "score": 2,
                  "body": "Only taxed (as ordinary income) when you withdraw from your IRA (retirement) account.",
                  "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcjchxd/",
                  "created": 1720630730,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcm7lfp",
                      "score": 1,
                      "body": "Only taxed (as ordinary income) when you withdraw from your *traditional* IRA account.   \n\nYour dividends, interest, capital gains are not taxed when withdrawn from your Roth IRA account if the withdrawal is qualified.",
                      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcm7lfp/",
                      "created": 1720665748,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lcsrn4c",
              "score": 1,
              "body": "My IRA adds an extra 3% but I can only put 7k a year in, but still that's a free $210 lol",
              "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcsrn4c/",
              "created": 1720766564,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lcg60jp",
          "score": 1,
          "body": "beast",
          "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcg60jp/",
          "created": 1720576867,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcg8plw",
      "score": 30,
      "body": "OP asks a good question because learning when and how to sell is one of the most important lessons one has to learn if you are buying individual stocks.\n\nI always have a target price when I buy.  When a stock hits that target or even better, soars past it, it is time to re-evaluate.  I usually sell enough to cover what I had invested to begin with and keep the rest.  \n\nThe one thing you don't ever want to do is beat yourself up for taking a profit.  You buy to get a profit, when you take one, celebrate it.  Don't berate yourself for selling if the stock keeps going up.  A profit is a profit is a profit.  But don't be afraid to keep some, you don't have to sell all of your shares.  \n\nIt is silly to say I shouldn't have sold, why?  It could also go down; you didn't make a mistake by taking a profit.  You did what we all hope to do when we buy, sell at a profit.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcg8plw/",
      "created": 1720577931,
      "depth": 0,
      "replies": [
        {
          "id": "lcgc9h6",
          "score": 3,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgc9h6/",
          "created": 1720579363,
          "depth": 1,
          "replies": [
            {
              "id": "lcj17g5",
              "score": 2,
              "body": "I bought AMD at around $3 and celebrated when it 10xed, sold it around $35. My lesson from that was to take some profits off the table, but leave some on the table. How much is up to you. The important thing is to lock in some of the gains and use those for new investments while letting your winners ride. In your case, it would also reduce tax liability by not selling all.",
              "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcj17g5/",
              "created": 1720627124,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcg4lky",
      "score": 9,
      "body": "I wouldn't sell a major tech company like Google. Wait for the AGI dividends.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcg4lky/",
      "created": 1720576316,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgwuf7",
      "score": 3,
      "body": "There's no one-size-fits-all rule of thumb. Too much has to do with time horizons, portfolio size, industry savvy, market savvy, etc. \n\nYou should sell shares until you stop feeling anxious about holding so many shares. There's no one \"correct\" allocation for your portfolio, so all you can do is follow your gut and your intellect to reach a portfolio balance that feels right to you. \n\nIf you felt good about a 4% Google allocation and now feel bad about a 10% allocation, then sell off half of your Google shares, and take some profits. Or anyway, sell off whatever percentage it takes to make you feel better balanced. You can then plow those profits into some other stock you feel good about and don't have a position in yet. Or a bond. Or hold cash -- cash is a position too.\n\nYou can never know looking forward if you're maximizing alpha. You can only see that looking back. \n\nBut what you *can* do for now is stop fretting about your allocations, so redistribute from time to time until you feel back in balance.\n\n*\"Life can only be understood backwards, but it must be lived forwards.\" - Soren Kierkegaard.*",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgwuf7/",
      "created": 1720589295,
      "depth": 0,
      "replies": [
        {
          "id": "lcieqht",
          "score": 2,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcieqht/",
          "created": 1720619610,
          "depth": 1,
          "replies": [
            {
              "id": "lcjiyf2",
              "score": 1,
              "body": "As long as you're comfortable with it, you're making the right decision!",
              "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcjiyf2/",
              "created": 1720632775,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcg7sgc",
      "score": 5,
      "body": "You should only sell a stock if you think it is overvalued, if you think it will underperform the market going foward, or if you want to redeploy that money into another opportunity that you think will yield a greater return. \n\n Thining your position on a stock simply because it has grown to an oversized portion of your portfolio is always a mathematically incorrect choice.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcg7sgc/",
      "created": 1720577568,
      "depth": 0,
      "replies": [
        {
          "id": "lcjbg9g",
          "score": 2,
          "body": "Is it really mathematically incorrect every time? I made a post similar to this one. Almost identical actually. Except my NVDA shares now make up 25% of my portfolio. I’ve already recovered more than double the initial investment by selling a few shares. But 25% of my entire portfolio is terrifying.",
          "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcjbg9g/",
          "created": 1720630403,
          "depth": 1,
          "replies": [
            {
              "id": "lck7a69",
              "score": 1,
              "body": "It's mathematically incorrect to look at ONLY the % of your portfolio a stock occupies.  The more a single stock takes up in my portfolio, the more I am going to scrutinize it, but im not going to sell just because it is a large %.  If Nivida was 25% of my portfolio, i would consider triming, but not because it's 25%. Becuase it's 25% AND looking at its fundamentals, I believe it is overvalued.  \n\nKeep in mind. I'm also only talking about what is right from an objective standpoint.  There is also an emotional element.  If you are up at night with anxiety about your shares and selling enough to cover your investment improves your mental heath, it's worth more than the money.  \n\nInteresting side note to this.  Several studies on both market investment and casino table games have shown that once people cash out their initial investment and feel like they are \"playing with house money\" they are more likely to be reckless and make worse decisions, resulting in lower returns overall.",
              "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lck7a69/",
              "created": 1720640322,
              "depth": 2,
              "replies": [
                {
                  "id": "lck84k9",
                  "score": 1,
                  "body": "Thank you for the clarification! Makes sense to me.",
                  "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lck84k9/",
                  "created": 1720640582,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lcirwuc",
          "score": 1,
          "body": "Isn’t selling the financially prudent choice though. So you can diversify your portfolio and reduce concentration risk",
          "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcirwuc/",
          "created": 1720624114,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcj27av",
          "score": 1,
          "body": "Oversized positions matter when risk management goal is more important than overall performance.",
          "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcj27av/",
          "created": 1720627444,
          "depth": 1,
          "replies": [
            {
              "id": "lcj44r6",
              "score": 1,
              "body": "an excellent counterpoint.",
              "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcj44r6/",
              "created": 1720628093,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcg9hg7",
      "score": 2,
      "body": "since it's google I would say just keep it but if not then I would sell the amount to be about about 6-7% percent of your portfolio.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcg9hg7/",
      "created": 1720578239,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgfi8y",
      "score": 2,
      "body": "Some investors set a percentage allocation and rebalance every year. Rules of thumb can be a way to manage your decision making and to keep from fretting a lot about situations like this. Whatever you choose will sometimes give you better results one year and weaker results in another. \n\nThe most important question to resolve may be what your risk threshold is and to find a level of diversification that matches it. Unless you want to be obsessing about your holdings, it's good to be able to set up a portfolio that you review and adjust only once a year, or at most once a quarter.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgfi8y/",
      "created": 1720580724,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgm7yw",
      "score": 2,
      "body": "Only sell if you need the money or dying or wanting to spend it on a holiday. Or later at older age you want to cut down on risk and diversify more in bonds, REITs etc then is a good time to sell also.\n\nGo enjoy your life and travel too. Life isn’t all about money.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgm7yw/",
      "created": 1720583749,
      "depth": 0,
      "replies": [
        {
          "id": "lcih9j2",
          "score": 3,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcih9j2/",
          "created": 1720620520,
          "depth": 1,
          "replies": [
            {
              "id": "lcii79k",
              "score": 1,
              "body": "Np. Have a safe and fun travel! 👍",
              "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcii79k/",
              "created": 1720620848,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcgx7sb",
      "score": 2,
      "body": "Listening to a Motley Fool podcast, they discussed a Sleep Number that made sense to me. Basically, what percentage of a stock , in your case, Google being 10% of your portfolio causes you to feel uneasy and lose sleep. \n\nEveryone will have a different sleep number so it’s your decision when to trim positions. \n\nHere’s a link to that episode: https://www.fool.com/investing/2021/01/23/the-6-principles-of-a-rule-breaker-portfolio/",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgx7sb/",
      "created": 1720589504,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgywqn",
      "score": 2,
      "body": "4.3% of SPY is google too, so you have even more than that, but concentration is only a problem if it is the wrong place.  Do you think anyone got rich with VOO?  No - that is your core.  30% individual stocks seems reasonable and honestly, 10% google isnt horrible - I mean you have \\~7% each of MSFT, NVDA and AAPL.  Being overweight AMZN or GOOGL looks like a decent portfolio.  Dont overthink it, maybe just leave it be and stop looking at it everyday",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgywqn/",
      "created": 1720590477,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lch4lar",
      "score": 2,
      "body": "A single stock should never account for more than 5-10% of your overall portfolio. How you land in that range is up to you imo.\n\nThat's a very standard approach to balancing out individual stocks typically.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lch4lar/",
      "created": 1720593991,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lchbqxu",
      "score": 2,
      "body": "This is the most counter intuitive bit about disciplined portfolio management \n\nNeed to sell your winners. \n\nThe 10% allocation is alright imo if your other 20% individual stocks aren’t tech heavy as well",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lchbqxu/",
      "created": 1720598846,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg7zlk",
      "score": 1,
      "body": "I have been holding a stock that has grown to almost 25% of my overall savings. It is most of my brokerage holdings. I don’t plan to sell and hope it keeps going up.  I wish i bought more when it was down few years ago. If you believe it will go up keep it but it does carry higher risk.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcg7zlk/",
      "created": 1720577647,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg84ci",
      "score": 1,
      "body": "Pretend you sold everything for cash. How would you allocate that, what would you buy in which proportions?",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcg84ci/",
      "created": 1720577698,
      "depth": 0,
      "replies": [
        {
          "id": "lcg8qxr",
          "score": 1,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcg8qxr/",
          "created": 1720577946,
          "depth": 1,
          "replies": [
            {
              "id": "lcgay1d",
              "score": 3,
              "body": "Real question is why you think sp500 is more safe than Google and why you value that perceived safety vs higher returns. What I’m getting at is higher returns can balance the “safety” and actually land you in a “safer” scenario because of it.\n\nThere is safety in risk, if managed properly.",
              "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgay1d/",
              "created": 1720578824,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcgiujh",
      "score": 1,
      "body": "I'd say you're in ok shape. Maybe start building another position in something more diversified for peace of mind, but I wouldn't sell for the sake of rebalancing",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgiujh/",
      "created": 1720582199,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgjazw",
      "score": 1,
      "body": "My rule is no more than 5% individual stock. Set 5% as your goal and rebalance quarterly. Sell some right now and sell whatever is left to get to 5% at the end of the quarter.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgjazw/",
      "created": 1720582406,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgkx3g",
      "score": 1,
      "body": "Keep it if it's never declining drastically. Wish I  bought more whirlpool, that's going up fast",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgkx3g/",
      "created": 1720583142,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgotym",
      "score": 1,
      "body": "Which s&p index do you buy?",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgotym/",
      "created": 1720585006,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgyefl",
      "score": 1,
      "body": "How many shares? If you have several hundred I would just start selling a call until it goes away.  You could do an out of the money call.... or you could do an in the money call for the end of the year. You get the premium now and can put that towards another investment. If google drops below the strike you still have your shares, but otherwise your shares will just go away at that option expiration date. \n\nIf its fewer shares I would just sell a few each week or possibly every day until you get to the desired balance.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgyefl/",
      "created": 1720590182,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lchf2fg",
      "score": 1,
      "body": "Set a trailing stop loss",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lchf2fg/",
      "created": 1720601175,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lchgneg",
      "score": 1,
      "body": "Hold forever if you still think it’s a good stock (Google is imo).\n\nSell only when you don’t have cash coming in and need a little cash to buy something else at a dip, but only if you think it’s as good of a stock pick as Google. Like for example if you think NVDA is a good stock and you don’t have any you could buy the slight dip right now. AAPL is like ATH so I wouldn’t sell Google to trade for AAPL just for sake of rebalancing.\n\nSell when really over valued. (Learn valuation and sell if it’s 2x the value). \n\nOtherwise, sell when you really need the money for something like down payment for real estate or other major purchase.\n\nDon’t sell just because stock crashes, it will rebound later and go even higher and you would have missed the timing.\n\nIf you want other stocks, it’s better to add more funds and buy to rebalance with cash.\n\nSell if Google becomes a shit company and you don’t believe it anymore (maybe in 10 years? 20? Who knows.).",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lchgneg/",
      "created": 1720602291,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lchnjyw",
      "score": 1,
      "body": "If 10% is your threshold for one stock, just trim it accordingly, if it’s 8% trim a little more. Doesn’t have to be an all or nothing proposition",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lchnjyw/",
      "created": 1720607023,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lchrdf3",
      "score": 1,
      "body": "With 70% in S&P index fund you are pretty diversified. If you are concerned about the weight of Google in the remaining 30% sell half of your shares and reinvest the money in a different area than tech.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lchrdf3/",
      "created": 1720609315,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lci0mob",
      "score": 1,
      "body": "Why would you sell something that is successful?",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lci0mob/",
      "created": 1720613931,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lciizpi",
      "score": 1,
      "body": "Sell under two conditions: \n1. The underlying business changed and is no longer a favourable company to own \n2. You need liquidity \n\nDon’t:\n-Sell based on stock price\n-Sell based on percentage of portfolio\n-Sell cuz you think it’s gonna drop \n-Sell cuz someone told you to",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lciizpi/",
      "created": 1720621123,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lciqcck",
      "score": 1,
      "body": "That is a highly personal question only you can answer, based on your risk tolerance and time frame.\n\nYou are managing risk having a majority of your portfolio in the index, so in my opinion, that 30% should be allocated to the strongest leaders. GOOG is one of them, and one could argue undervalued compared to its peers.\n\nThat said, the market is in nosebleed territory and nobody knows when the rug will be pulled. If GOOG were to pull back to 175 within the next few months, would you be upset? If so, selling a few shares up here is not a terrible idea.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lciqcck/",
      "created": 1720623597,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcj5280",
      "score": 1,
      "body": "Running is logical, you may want to reduce your holdings if you feel there is a better opportunity but don’t sell out unless you know it is troubled",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcj5280/",
      "created": 1720628392,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcj6qfz",
      "score": 1,
      "body": "The question is, do you see any reason to think the stock will go down? If not, don’t sell",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcj6qfz/",
      "created": 1720628921,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcjnq2l",
      "score": 1,
      "body": "Just buy more of other assets instead of paring down what you already own.\n\nThe only time you should sell a company is when you're convinced that the company's health is worsening and it cannot create more value for you.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcjnq2l/",
      "created": 1720634282,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcm1wsz",
      "score": 1,
      "body": "Yes sell the winner so you can buy a looser. Great strategy! Good luck with that.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcm1wsz/",
      "created": 1720663472,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcmomyj",
      "score": 1,
      "body": "I am 98% tsla. Not even bothered lmao",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcmomyj/",
      "created": 1720673550,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcmu9od",
      "score": 1,
      "body": "I did a similar post more than a year ago, and 99% people told me to sell my stock and diversify..(Currently holding about 50% net worth in google stock due to company RSUs)  \n I did not listen to anyone and Goog has doubled during this time.. ![gif](emote|free_emotes_pack|money_face)",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcmu9od/",
      "created": 1720676674,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg3fwb",
      "score": 1,
      "body": "There’s no right or wrong answer here. And also to note, you actually have something like ~13% in Google stock since it’s like 4.5% of the S&P.\n\nIt sounds like you should sell some of your Google. If you find your portfolio is too concentrated in one name, reduce the exposure. It’s a nice problem to have.\n\nAside from that, generally you should sell/trim a stock when you believe the price has disconnected from the fundamentals. If you think a stock is worth $100/share and it’s trading at $120, I’d generally keep holding that. If you think a stock is worth $100 and it’s trading at $200, then I would typically sell or at least trim that.\n\nBut do what you want, it’s your portfolio. No reason to be uncomfortable with the amount of a stock you have.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcg3fwb/",
      "created": 1720575875,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg8xuf",
      "score": 1,
      "body": "Don’t sell it .. hold for life",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcg8xuf/",
      "created": 1720578022,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgf2ux",
      "score": 1,
      "body": "I would suggest investing more money instead in a technology etf like VGT vs individual stocks like google. That’s the majority of my portfolio the rest is in VOO (sp500 etf). So far it has way outperformed the sp500 over the past 5 years. If you need the money go ahead and sell it, but it doesn’t make sense I just for the sake of being 4% vs 10% of your portfolio. Invest elsewhere and it will be a smaller percentage eventually.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgf2ux/",
      "created": 1720580540,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgnou7",
      "score": 1,
      "body": "You should be buying stocks that you want to hold for decades. Thus they should be companies you believe are worth holding for decades. Thus they should be robust and prominent companies that will be around for decades.",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgnou7/",
      "created": 1720584453,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcg9m8z",
      "score": 0,
      "body": "I’m not qualified to give you advice. I’m fighting back to break even on portfolio 😂 team down bad",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcg9m8z/",
      "created": 1720578292,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcgiggy",
      "score": 0,
      "body": "I wouldn’t sell at 10% lol",
      "permalink": "/r/stocks/comments/1dzjhfe/when_should_i_sell_a_stock_that_has_taken_a_large/lcgiggy/",
      "created": 1720582022,
      "depth": 0,
      "replies": []
    }
  ]
}