{
  "title": "Microsoft quits OpenAI board seat as antitrust scrutiny of artificial intelligence pacts intensifies",
  "score": 44,
  "selftext": "https://www.reuters.com/technology/microsoft-ditches-openai-board-observer-seat-amid-regulatory-scrutiny-2024-07-10/\n\nMicrosoft has ditched the board observer seat at OpenAI that has drawn regulatory scrutiny on both sides of the Atlantic, saying it was not necessary after the AI start-up's governance had improved significantly in the past eight months.\n\nApple which last month announced bringing OpenAI's chatbot ChatGPT to its devices, would not take the observer role on OpenAI's board after being widely expected to do so, the Financial Times reported, citing a person with direct knowledge of the matter. Apple did not respond to a request for comment.\n\nAn OpenAI spokesperson said the company will establish a new engagement approach by hosting regular stakeholder meetings with strategic partners such as Microsoft and Apple and investors such as Thrive Capital and Khosla Ventures.\n\nMicrosoft took a non-voting, observer position on OpenAI's board in November last year after OpenAI CEO Sam Altman took back the reins of the company which operates the generative AI chatbot ChatGPT.\n\n\nThe seat meant it could attend OpenAI's board meetings and access confidential information but had no voting rights on matters including electing or choosing directors.\n\nThe observer seat and Microsoft's more than $10 billion investment in OpenAI have triggered unease among antitrust watchdogs in Europe, Britain and the U.S. over how much control it exerts over OpenAI.\n\nMicrosoft cited OpenAI's new partnerships, innovation and growing customer base since Altman's return to the startup for giving up its observer seat.\n\n\"Over the past eight months we have witnessed significant progress by the newly formed board and are confident in the company's direction. Given all of this we no longer believe our limited role as an observer is necessary,\" it said in a letter to OpenAI dated July 9.\n\nEU antitrust regulators last month said the partnership would not be subjected to the bloc's merger rules because Microsoft does not control OpenAI, but they would instead seek third-party views on the exclusivity clauses in the agreement.\n\nIn contrast, the British and U.S. antitrust watchdogs continue to have concerns as well as questions about Microsoft's influence over OpenAI and the latter's independence.\nMicrosoft and OpenAI are increasingly competing to sell AI technology to enterprise customers, aiming to generate revenue and demonstrate their independence to regulators to address antitrust concerns.\n\nAdditionally, Microsoft is expanding its AI offerings on the Azure platform and has hired Inflection's CEO to head its consumer AI division, a move widely interpreted as an effort to diversify beyond OpenAI.\n\n",
  "link_flair_text": null,
  "id": "1dzv3wz",
  "num_comments": 2,
  "created_utc": 1720616204,
  "permalink": "/r/stocks/comments/1dzv3wz/microsoft_quits_openai_board_seat_as_antitrust/",
  "comments": [
    {
      "id": "lcosktx",
      "score": 7,
      "body": "US and European government once again helping ensure China comes out ahead in the AI race.",
      "permalink": "/r/stocks/comments/1dzv3wz/microsoft_quits_openai_board_seat_as_antitrust/lcosktx/",
      "created": 1720712088,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcj4lx8",
      "score": -2,
      "body": "Was Microsoft looking to control the regulatory board for something it is a major player in? Oh no! Anyway…",
      "permalink": "/r/stocks/comments/1dzv3wz/microsoft_quits_openai_board_seat_as_antitrust/lcj4lx8/",
      "created": 1720628248,
      "depth": 0,
      "replies": []
    }
  ]
}