{
  "title": "RIVN, What are your thoughts?",
  "score": 54,
  "selftext": "I've been paying attention to Rivian (RIVN) and I'm holding for the long term. Historical performance has been poor, they IPO'd way over valued to raise funds, but what they're doing is expensive. It's no news that they're hemorrhaging money, citing a loss of $40,000 per vehicle sold (down from $67,000 last year). But in the last 3 months they've had some very promising announcements.\n\nDuring the recent investor day webinar they talked about how Gen 1 was all about proof of concept, but now they're moving onto Gen 2 which is about manufacturing efficiency. They detailed how they reduced components, steps and fasteners to decrease production and assembly costs. It all sounds very good. In addition they just entered a deal with VW for $5 Billion and all Rivian is supplying to VW is software. It's a stepped plan, $1B up front and additional investments based on performance.\n\nIf they reduce manufacturing costs as they predict, and lower sale price as they promised, I'm thinking this stock could be ripe for big growth. They're the only company competing directly with Tesla, and on the consumer side, it's going well. I doubt we'll ever see a RIVN selling at comparable prices to TSLA, but I could see them over $100 in a few years if they continue to make advancements.\n\nThoughts?\n\nI'm in at $11/share.",
  "link_flair_text": "Company Discussion",
  "id": "1e0ds09",
  "num_comments": 99,
  "created_utc": 1720664028,
  "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/",
  "comments": [
    {
      "id": "lcm3bxr",
      "score": 1,
      "body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcm3bxr/",
      "created": 1720664028,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcomo8e",
      "score": 25,
      "body": "Reddit has lately been anti-Rivian. Inverse Reddit",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcomo8e/",
      "created": 1720710154,
      "depth": 0,
      "replies": [
        {
          "id": "lcral8n",
          "score": 2,
          "body": "Shhhh, stop telling people!",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcral8n/",
          "created": 1720742357,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcvihy2",
          "score": 1,
          "body": "redrum",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcvihy2/",
          "created": 1720809178,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcm8nvw",
      "score": 54,
      "body": "Car business is notoriously competitive.  Hard to tell if electric vehicles are different due to the tech requirements or they are the same.  Worth noting basically every car company has gone bankrupt at some point",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcm8nvw/",
      "created": 1720666183,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcm97tf",
      "score": 44,
      "body": "If their announcement that they’ve cut production costs by 35% turns out to be accurate, I believe they’ll prosper. I’m seeing them everywhere in Fort Lauderdale, and a friend who has one loves it.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcm97tf/",
      "created": 1720666410,
      "depth": 0,
      "replies": [
        {
          "id": "lcpb7q1",
          "score": -2,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcpb7q1/",
          "created": 1720718113,
          "depth": 1,
          "replies": [
            {
              "id": "lcpljog",
              "score": 8,
              "body": "No. It’s really not. And I didn’t try to present it as such.",
              "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcpljog/",
              "created": 1720721440,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcpnpsq",
      "score": 15,
      "body": "All I can say is I have an R1S and it’s the best car I’ve ever driven. Great product. Hope they can stay around.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcpnpsq/",
      "created": 1720722136,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcms3a0",
      "score": 37,
      "body": "I’m also around $11 cost basis.  I’m invested purely on the strength of their design.  It’s definitely a gamble but I think it’s a brand that will appeal to millennials as the enter middle age and can afford them.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcms3a0/",
      "created": 1720675427,
      "depth": 0,
      "replies": [
        {
          "id": "lctwipd",
          "score": 3,
          "body": "And as Elon perpetually shits the bed, and his investors stop believing the empty promises, I think riv will stand out against other major car manufacturers that are testing the trust of the consumer.",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lctwipd/",
          "created": 1720789955,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ld2psby",
          "score": 1,
          "body": "They produce an actual car that runs reliably.\n\nThey might have a Tesla moment. \n\nIt is a good bet.",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/ld2psby/",
          "created": 1720920814,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcrj865",
      "score": 11,
      "body": "I am from California, Bay Area, and I have seen an explosion of Rivian cars. I have a window looking out into the freeway and I count the rivian cars lol and I want one myself, and a lot of people I know want to drive their cars into the ground and get a rivian next.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcrj865/",
      "created": 1720745654,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcmed2j",
      "score": 21,
      "body": "At the end of the day with VW’s large investment, Amazon still owning a large chunk, the company will be around for a very very long time. It’s more about if the market will allow it to follow Tesla. Tesla wasn’t profitable for a very long time. \n\nI imagine if Rivian were to collapse an automaker would come scoop it up for the same reason VW just invested in them.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcmed2j/",
      "created": 1720668606,
      "depth": 0,
      "replies": [
        {
          "id": "lco2zip",
          "score": 7,
          "body": "\"Being around\" and \"being a good investment\" are two different things.\n\nTo be a good investment a company needs to be better than its peers. Amazon is certainly not adding anything for Rivian on that score. VW arguably isn't either as their software is sub par - and software is where it's at with the current and next generation(s) of cars.",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lco2zip/",
          "created": 1720703054,
          "depth": 1,
          "replies": [
            {
              "id": "lcomivx",
              "score": 9,
              "body": "You don't think the delivery van market has a huge upside potential? What company makes a better EV light truck than Rivian or a better delivery vehicle? They have those two products that differentiate them from Tesla and others.",
              "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcomivx/",
              "created": 1720710104,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lcng4pg",
          "score": 5,
          "body": "Tesla wasn't profitable, but they were never gross margin negative. Rivian is much more unprofitable and has never had a gross margin positive quarter. Those two are nowhere near comparable.",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcng4pg/",
          "created": 1720691224,
          "depth": 1,
          "replies": [
            {
              "id": "lcnr99k",
              "score": 2,
              "body": "Not too mention all the things Tesla has its hands in aside from just EVs. It's comparing apples to oranges.",
              "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcnr99k/",
              "created": 1720697767,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lcp4je5",
          "score": 5,
          "body": "TSLA had captured the imaginations of the progressive market and they ruined it with Elons Twitter rants. Everyone is embarrassed to be in a TSLA now. RIVN could gill that market",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcp4je5/",
          "created": 1720715961,
          "depth": 1,
          "replies": [
            {
              "id": "lcrx707",
              "score": 3,
              "body": "Yes everyone is embarrassed, says the 440k deliveries last quarter. And let’s be honest, RIVN has how many deliveries?",
              "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcrx707/",
              "created": 1720751255,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcvevu6",
              "score": 1,
              "body": " I never consider consumer \"embarrassment\" into investing. Is that even possible ?",
              "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcvevu6/",
              "created": 1720808000,
              "depth": 2,
              "replies": [
                {
                  "id": "lcwwgmr",
                  "score": 1,
                  "body": "Are you kidding. It’s all branding. Even in china they say they’re embarrassed to be in a TSLA. BYD is a better car.",
                  "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcwwgmr/",
                  "created": 1720826613,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lcqq78j",
          "score": 0,
          "body": "It depends on the patience of these companies. Nothing is set in stone. Remember when Ford bought a stake in Rivian too and then sold it, at a loss? Well that can happen with Amazon and VW too.",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcqq78j/",
          "created": 1720734873,
          "depth": 1,
          "replies": [
            {
              "id": "lcr8foj",
              "score": 3,
              "body": "Ford sold at $175 all the way at the top first few days from the IPO launched. To be honest, I see a lot of electric Rivian van was made it for Amazon in LA, this is a sleeping giant, just give them some time to prove it.",
              "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcr8foj/",
              "created": 1720741557,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcsf00x",
      "score": 4,
      "body": "Im not sure, but tbh ive seen so many rivian trucks out there these days that im willing to bet they’ll be fine in the future",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcsf00x/",
      "created": 1720759416,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcmaer9",
      "score": 23,
      "body": "I think people are mistakenly viewing car companies as good investments because of Tesla. But Tesla isn’t being valued as a car company. Unless Rivian is working to figure out autonomous driving, robotics, charging networks, etc. then I don’t think it’s a good investment. The cars look great though. I’d pick up an R3 if they ever actually come out.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcmaer9/",
      "created": 1720666901,
      "depth": 0,
      "replies": [
        {
          "id": "lcogxqh",
          "score": 10,
          "body": "Rivian is already moving into bidirectional charging for home and had had their own charging network since inception. \n\nThey will not be just a car company for long and the way you are thinking is how you miss the boat.",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcogxqh/",
          "created": 1720708234,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcnac4m",
          "score": 2,
          "body": "This is largely true...that said, EV's have much higher margins than gas cars (tsla reached 30% at one point). That could change with competition of course, but RIVN seems to be making good cars that reviews and consumers love. That kind of product buy premium pricing power.\n\nSo its possible EV companies would be priced with higher P/S",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcnac4m/",
          "created": 1720687139,
          "depth": 1,
          "replies": [
            {
              "id": "lcou126",
              "score": 3,
              "body": "had.....had higher margins.....Elon and BYD have crushed the margins",
              "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcou126/",
              "created": 1720712559,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcoh55a",
              "score": 2,
              "body": "It's actually not largely true. They have had their own charging network since launch.\n\nDoes GM and Ford have their own gas stations?",
              "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcoh55a/",
              "created": 1720708304,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcnfz9t",
      "score": 10,
      "body": "[This graph](https://x.com/alojoh/status/1795687481834381799) says all you need to know about Rivian. They make great cars, but they're not investable as long as they don't get their costs under control.\n\nFor comparison, Tesla was never gross margin negative while Rivian has yet to post a single gross margin positive quarter. Rivian's operating expensives have been ~$2.5B for the last 2,5 years, they built 10K cars last quarter with declining sales. Tesla was building over 20K cars a quarter with 50%+ YoY growth while already working on the Model 3 when they were doing $2.5B a quarter in opex.\n\nObviously Tesla is an outlier, but you have to be an outlier to not go bankrupt as an automaker these days.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcnfz9t/",
      "created": 1720691119,
      "depth": 0,
      "replies": [
        {
          "id": "lcpb8qi",
          "score": 2,
          "body": "That is a scary chart. Somebody, quick, delete that from the internet! /s",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcpb8qi/",
          "created": 1720718122,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ld2q1sd",
          "score": 1,
          "body": "I invest in them because I am betting that they will figure out the cost.",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/ld2q1sd/",
          "created": 1720920936,
          "depth": 1,
          "replies": [
            {
              "id": "ld44a77",
              "score": 1,
              "body": "Fair enough, but that's a hell of a gamble. They haven't exactly shown any signs they can do that so far.",
              "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/ld44a77/",
              "created": 1720947012,
              "depth": 2,
              "replies": [
                {
                  "id": "ld4hspf",
                  "score": 1,
                  "body": "Yeah. Hence the price. If it showed even a slight improvement, the stock would jump up.\n\nIt is a decent bet given that they produce actual cars that you can see running on the street.",
                  "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/ld4hspf/",
                  "created": 1720956133,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ld4wzaf",
                      "score": 1,
                      "body": "Disagree tbh. 18B is a huge valuation for an automotive company only selling in the tens of thousands of units a quarter, even if it wasn't massively unprofitable. Especially given they have no non-automotive product potential like Tesla.",
                      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/ld4wzaf/",
                      "created": 1720963793,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lr5jnge",
          "score": 1,
          "body": "Imo, when I read that chart it seems like not only does it closely resemble teslas early days- but by following that logic, it looks like it could turn around very soon. And when it does- it could possibly even surpass Tesla. \nRivian was def taking notes!",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lr5jnge/",
          "created": 1728508213,
          "depth": 1,
          "replies": [
            {
              "id": "lr7yqkf",
              "score": 1,
              "body": "Then you're reading the chart wrong. Rivian lost twice as much money in the first 6 years (not counting the pre-production period that was much longer and costly than it was for Tesla already) than Tesla did in the first 9.\n\nOn top of that, Tesla was never gross margin negative, while Rivian has never been gross margin positive. They couldn't be any more different.",
              "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lr7yqkf/",
              "created": 1728546854,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcmwclj",
      "score": 3,
      "body": "Not bullish on a pure EV play. Way too much risk. Will be interesting to see how the landscape changes with Chinese ev manufacturers",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcmwclj/",
      "created": 1720677913,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lco4i0n",
      "score": 3,
      "body": "If they cant get to positive gross margin soon they're toast. \n\nThey can't keep losing money on every car for very much longer. \n\nThis whole idea of \"well we cant make a profit on our luxury vehicles but our mass market vehicle will\" is profoundly delusional, the luxury models always have better margins than the mass market. \n\nBadly run company, good design with terrible operations.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lco4i0n/",
      "created": 1720703668,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcmdnbv",
      "score": 4,
      "body": "Fleet contracts !",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcmdnbv/",
      "created": 1720668293,
      "depth": 0,
      "replies": [
        {
          "id": "lcvfh98",
          "score": 4,
          "body": "Yeah... like Hertz !   giggle giggle",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcvfh98/",
          "created": 1720808192,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcmef9c",
          "score": 1,
          "body": "I would like to know more about their deal with Amazon and if it's growing or not. I see them hauled through my area, but they aren't in use in my area.",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcmef9c/",
          "created": 1720668633,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcm4xre",
      "score": 11,
      "body": "Love the car, don’t love their business model (Producing cars that cost more to make then they can sell them for).",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcm4xre/",
      "created": 1720664666,
      "depth": 0,
      "replies": [
        {
          "id": "lcm6pmd",
          "score": 6,
          "body": "The R2 is really gonna be the test. I'm holding a small amount, betting that they'll eventuality achieve profitability.",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcm6pmd/",
          "created": 1720665388,
          "depth": 1,
          "replies": [
            {
              "id": "lcmgj3g",
              "score": 7,
              "body": "Achieving profitability is one thing. Justifying a $16 billion market cap is another. For reference, Nissan's market cap is $12.8 billion. They had $2.7 billion in net income last year. Rivian lost $5.4 billion last year and has lost a total of approximately $16.5 billion over the past three years.",
              "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcmgj3g/",
              "created": 1720669590,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcm8d71",
              "score": 2,
              "body": "If they cant make a 70k car for a profit, what is it about making a 45k car that would make profitability more likely?",
              "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcm8d71/",
              "created": 1720666061,
              "depth": 2,
              "replies": [
                {
                  "id": "lcm90j7",
                  "score": 18,
                  "body": "Go watch the investor webinar or read about Gen 2 R1. They are significantly retooling their assembly and have redesigned many components to require less moving parts, pieces, smaller and require less materials, while maintaining the same essential shell of a vehicle. \n\nBy their own admission Gen 1 R1 was not built to be cost-effective, it was to prove market demand. Gen 2 R1 is all about making it cost effective and mass scale.\n\nI'm not saying it will work, I'm saying I hope it does. But that's the answer to your question. They aren't selling the same car, they're designing a new one that looks very similar.",
                  "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcm90j7/",
                  "created": 1720666326,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcmaspv",
                  "score": 7,
                  "body": "The first car from any brand is never about profitability. Now they can focus less on building a functioning car and more on improving production, same thing tesla went through.",
                  "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcmaspv/",
                  "created": 1720667061,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcp4skv",
                  "score": 2,
                  "body": "Are you joking? Production becomes more efficient over time",
                  "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcp4skv/",
                  "created": 1720716042,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcmc66o",
                  "score": -1,
                  "body": "The hope would be to sell more cars... lol",
                  "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcmc66o/",
                  "created": 1720667649,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcme7uh",
                      "score": -2,
                      "body": "Selling more cars at a loss means even more losses…",
                      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcme7uh/",
                      "created": 1720668542,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lcmemgz",
                          "score": 4,
                          "body": "Obviously this corresponds with the hope of slashing manufacturing costs over time and turning a profit lol",
                          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcmemgz/",
                          "created": 1720668722,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lcmg80v",
                              "score": -9,
                              "body": "If rivian was capable of that, why dont they make cars today for a profit",
                              "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcmg80v/",
                              "created": 1720669447,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lcm8f54",
          "score": 2,
          "body": "weren't tesla car's also taking a loss at the start?",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcm8f54/",
          "created": 1720666084,
          "depth": 1,
          "replies": [
            {
              "id": "lcmh83u",
              "score": 11,
              "body": "Tesla had one quarter in its entire history where it sold cars for less than cost to build, so not really",
              "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcmh83u/",
              "created": 1720669909,
              "depth": 2,
              "replies": [
                {
                  "id": "lcnto4t",
                  "score": 2,
                  "body": "And this is the biggest difference between Rivian and Tesla.\n\nTesla could always have just sold more cars to eventually become profitable, which is what they did with the Model 3.\n\nRivian on the other hand is just going to become more and more unprofitable the more cars they sell, since they're spending more on raw materials alone then on what they sell the vehicle for. Even a 35% reduction in their costs per vehicle almost certainly isn't going to make them profitable given how they lose $40K on each vehicle sold as OP cited.",
                  "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcnto4t/",
                  "created": 1720698945,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcmcoub",
              "score": 5,
              "body": "Tesla started small with the low volume roadster and took gradual steps. First mid volume S, then X. Then high volume 3 and Y. They learned a lot at each step which helped them with the next step. Companies like rivian, lucid, and Fisker tried to start at high volume without “paying their dues” and they are suffering for it.",
              "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcmcoub/",
              "created": 1720667873,
              "depth": 2,
              "replies": [
                {
                  "id": "lcmumfc",
                  "score": 2,
                  "body": "Fisker is about to be delisted. That Q symbol is the kiss of death for many stocks.",
                  "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcmumfc/",
                  "created": 1720676882,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcm98c8",
              "score": 3,
              "body": "Yes … but they are also the ONLY American auto company that’s currently able to produce a profitable EV at scale. It’s not as simple as “If Tesla can do then Rivian can do it.”",
              "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcm98c8/",
              "created": 1720666416,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcm8rhl",
      "score": 5,
      "body": "I am a big Rivian believer. Purchase in dips and sell half when the stock doubles at your purchase price.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcm8rhl/",
      "created": 1720666224,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcr3bhm",
      "score": 2,
      "body": "I see at least 3 rivians every day here in socal",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcr3bhm/",
      "created": 1720739663,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcm45pa",
      "score": 3,
      "body": "they need a gigapress to churn out vehicles. without that they are always going to lose to TSLA.\n\nand they need a tiny $10K SUV to compete against the chinese. its a tall order.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcm45pa/",
      "created": 1720664355,
      "depth": 0,
      "replies": [
        {
          "id": "lcm4p64",
          "score": -2,
          "body": "Gigapresses are essentially exclusive to Tesla. I haven't done a lot of research on them, but why is that the secret sauce? What do other automakers do that's different?",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcm4p64/",
          "created": 1720664571,
          "depth": 1,
          "replies": [
            {
              "id": "lcm56wt",
              "score": 2,
              "body": "either you pay your workers next to nothing to bolt cars together from parts (the chinese secret sauce) or you buy an industrial press to stamp out your cars in volume (the tesla secret sauce). gigapresses are not exclusive to tesla. they are sold by idra in italy who will happily sell to anyone who wants one (glovitech just bought one). idra is owned by the chinese so they have no loyalty to tesla.",
              "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcm56wt/",
              "created": 1720664769,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcmijiu",
      "score": 1,
      "body": "I think many got burned buying it at the start and had it drop. For the rest of us that bought it cheap, sitting on it may be worth the wait. \n\n\nThis is the only Ev company I feel like investing in now, if aptera was on the open market, I'd grab that instead.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcmijiu/",
      "created": 1720670524,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcnp0b9",
      "score": 1,
      "body": "I don’t like investing in car companies. Too much competition. But I will change my tune if Toyota can manage to make a good solid state battery car that’s patent protected",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcnp0b9/",
      "created": 1720696602,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcnuapa",
      "score": 1,
      "body": "They sell EVs at a loss and will continue to do so as long as investors keep allowing it. As they start selling even cheaper cars i dont see them turning a profit anytime soon so i wouldnt touch RIVN.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcnuapa/",
      "created": 1720699243,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lco29zt",
      "score": 1,
      "body": "I think they have negative earnings.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lco29zt/",
      "created": 1720702764,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lco2laj",
      "score": 1,
      "body": "Depends on what they come out with next. Cars are a global business but sticking to a format that isn't very global (high priced pickup trucks) isn't a good long term strategy. The demographic for pickup trucks is either very conservative (i.e. not gonna buy something from an unproven brand) or extremely adventurous (at which point their offerings *look* positively dated compared to Tesla's). High price segments also attract lots of competition. \n\nIMO they need to switch to something that has *global* mass market appeal in order to really take off.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lco2laj/",
      "created": 1720702893,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lco9ko6",
      "score": 1,
      "body": "My thoughts are that VW insiders must be doing a killing, first with RIVN and today QS",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lco9ko6/",
      "created": 1720705619,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcown3o",
      "score": 1,
      "body": "until rivian can sell a vehicle for more than they can produce it.....i'll sit on the sidelines, plus i think they aren't done falling",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcown3o/",
      "created": 1720713402,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcoxqki",
      "score": 1,
      "body": " Ought it under 11",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcoxqki/",
      "created": 1720713756,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcq9kmw",
      "score": 1,
      "body": " Nice truck, if I was going to buy a new truck this would likely be the top contender",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcq9kmw/",
      "created": 1720729262,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcqaunv",
      "score": 1,
      "body": "I don't get the obsession with Rivian is what I think. It's a car startup that's losing absurd amounts of money with stagnant  growth\n\nI honestly tend to just assume it a stock that people who missed Tesla latch onto in the hopes that Rivian somehow repeats Tesla's stock performance, and statements like \"i could see them over 100 usd in a few years\" (6x increase from current valuation) along with vague references to \"very promising announcements\" sorta reinforces that belief of mine.\n\nLike it all just feels very much based on hopium rather than any kind of pragmatic analysis of their business and finances. And that sorta makes sense, because anyone who does make a pragmatic analysis of the business and their finances will likely be running away screaming instead of buying into the stock thinking it'll 6x in a few years",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcqaunv/",
      "created": 1720729678,
      "depth": 0,
      "replies": [
        {
          "id": "lcqb99n",
          "score": 1,
          "body": "A lot of it is hope, because they still have a lot to prove and do, but that's what early investing is, and I still consider Rivian early. My vague statements are more because I don't want to use incorrect terms, when Rivians investor packets and their own numbers are freely accessible. More of a \"just go and look for yourself\" kind of sentiment.",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcqb99n/",
          "created": 1720729809,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcr6qeg",
      "score": 1,
      "body": "I like Rivian because I know some Tesla owners that say a Rivian is their next car. I like their stuff.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcr6qeg/",
      "created": 1720740930,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcskgjp",
      "score": 1,
      "body": "I live just outside Nashville.   The very wealthy and conservative Williamson County (ie Franklin) cannot keep Rivian’s in stock. They are everywhere.  I bought like crazy under $12.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcskgjp/",
      "created": 1720762321,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcubaf1",
      "score": 1,
      "body": "They need a large cash infusion to not only survive till they can launch the R2 but also until the R2 turns a profit. I am not sure why people believe Rivian can make a profit off the R2 when when it is nearly as large as the R1 but starting at half the price.   \n  \nI linked their Q1 shareholder letter down below, just scroll to page 14. Granted they have revised their manufacturing line but they reported nearly forty thousand loss per vehicle on a cost of goods versus what it sells for.  Then to add insult to injury for the quarter they spent nine hundred fifty seven million dollars between research and SG&A!  How!  On the next page down you can see they had around eight billion in cash and short term investments. The VW deal is about a billion up front but its not like the other four billion goes to Rivian's bottom line.  \n\nSo with that eight billion dollars of cash they have to not only make it to the R2 launch in the first half of 2026 they have to fund it as well. I don't see how without another cash raise and a large one at that. Their next two quarterly reports are going to be very interesting. \n\nSummary, they have to not only break even on COGS versus Revenues which they were down forty thousand a unit but they need to start earning sufficient profit to reduce the near billion a quarter they are spending to run the place.  They need to sell magnitudes more vehicles than they have ever sold.  Just the SG&A portion being five hundred million dollars requires over thirty thousand in profit per unit sold if they achieve fifteen thousand units per quarter.  That is one heck of a hill to climb to profitability as a whole  \n\n\n[Rivian Q1 2024 Shareholder letter in PDF](https://downloads.rivian.com/2md5qhoeajym/7zCEJ4kjX4TnecjryDLg0J/e43344caf7ab00ee1b4335921cd9c8c7/RIVN_1Q24_Shareholder_Letter.pdf)",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcubaf1/",
      "created": 1720795231,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcvef2x",
      "score": 1,
      "body": "What was VW thinking ? Spin off the work vans and sell the corpse ?",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcvef2x/",
      "created": 1720807850,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp1rzpt",
      "score": 1,
      "body": "Amazon in NY are using mostly Rivian vans",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lp1rzpt/",
      "created": 1727370689,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcm7w84",
      "score": 2,
      "body": "they are the future of investments",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcm7w84/",
      "created": 1720665870,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcovw0h",
      "score": 1,
      "body": "To add more to the trouble, there's ongoing investigation on rivan.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcovw0h/",
      "created": 1720713161,
      "depth": 0,
      "replies": [
        {
          "id": "lcoyuxu",
          "score": 2,
          "body": "\"investigation\" into what? Can you cite anything for us?",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcoyuxu/",
          "created": 1720714120,
          "depth": 1,
          "replies": [
            {
              "id": "lcp0hn8",
              "score": 1,
              "body": "[https://www.faruqilaw.com/investigation/2099/rivian-automotive-inc](https://www.faruqilaw.com/investigation/2099/rivian-automotive-inc)",
              "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcp0hn8/",
              "created": 1720714648,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcp403h",
      "score": 1,
      "body": "I just got in. I think this stock has huge potential for $24 in the short term. Which is 50% from current price. $100 in a few years no problem as long as management doesn’t fumble",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcp403h/",
      "created": 1720715788,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcr65s4",
      "score": 1,
      "body": "😬",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcr65s4/",
      "created": 1720740717,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcny7wx",
      "score": 0,
      "body": "I’m in because I see a new Rivian every day, they have big partnerships, and they’re the family friendly alternative to Tesla. Technicals don’t matter right now, IMO, it’ll go up to at least it’s 52w high.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcny7wx/",
      "created": 1720701045,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcsej79",
      "score": 0,
      "body": "Follow r/RIVIAN and see what their customers think about them. I like about 2/3 of what I see but the other 1/3 concerns me",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcsej79/",
      "created": 1720759177,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcqvq0c",
      "score": -1,
      "body": "Not touching rivian with a ten foot pole. They’re not going to outcompete Tesla, and there are too many major car manufacturers getting into the EV game. It’s a very crowded area for an upstart like Rivian to make it.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcqvq0c/",
      "created": 1720736874,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcmfbjn",
      "score": -11,
      "body": "Rivian sub is filled with owners who have problems with their Rivian. Nah.",
      "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcmfbjn/",
      "created": 1720669034,
      "depth": 0,
      "replies": [
        {
          "id": "lcmh6vq",
          "score": 15,
          "body": "So is every Sub and forum. No one goes online looking for answers to problems they don't have. Bias sampling.",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcmh6vq/",
          "created": 1720669893,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcmhhs8",
          "score": 7,
          "body": "Same with the Tesla sub 🤷🏽‍♂️",
          "permalink": "/r/stocks/comments/1e0ds09/rivn_what_are_your_thoughts/lcmhhs8/",
          "created": 1720670034,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}