{
  "title": "How can I start?",
  "score": 32,
  "selftext": "Hello, I’m a 21 year old woman pursuing nursing at a community college (the concurrent ASN & BSN) and working full-time. I’m currently finishing my pre-reqs and when I was scrolling around YouTube after finishing my homework, I saw someone who gained a lot of money by investing stocks. The amount that can cover her education, housing, and essential needs. \n\nI been interested on investing for two years, but I fear of getting scammed. I was introduced when there is this crypto thing, but I already view it negatively due to the fact that there is a lot of negative experiences from other people. \n\nWith that said, I would like to know how I can start. I plan on putting $250 down on investing, simply because I saw a lot of people having positive experiences (although I saw a lot of it requiring discipline) and I want to at least have enough to pursue my future children’s education.\n\nI’m not expecting to get quick money because I know it requires commitment, I just want something to start so that I do not end up losing money or making dumb decisions. Thank you!\n",
  "link_flair_text": "Read the wiki",
  "id": "1e0e3j4",
  "num_comments": 30,
  "created_utc": 1720665043,
  "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/",
  "comments": [
    {
      "id": "lcncys1",
      "score": 13,
      "body": "Start simple with index funds or ETF's, visit websites like investopedia and for the love of God,  do not get investment advice from Reddit or YouTube. Investing is certainly not something you can learn overnight.",
      "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcncys1/",
      "created": 1720688994,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcmt2am",
      "score": 25,
      "body": "Once you accumulate $10k then you can start messing with stocks..\n\nBe careful, a lot of those YouTubers are full of BS or have an agenda",
      "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcmt2am/",
      "created": 1720675976,
      "depth": 0,
      "replies": [
        {
          "id": "lcqq4w6",
          "score": 2,
          "body": "I can only advise you to watch Ben Felix. You will quickly realize why most of the other ones are garbage. And he will give you some great investing advice too.",
          "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcqq4w6/",
          "created": 1720734850,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcmp7mq",
      "score": 8,
      "body": "Get a brokerage account with vanguard and buy some ETFs and mutual funds",
      "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcmp7mq/",
      "created": 1720673856,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcmtq9l",
      "score": 5,
      "body": "Start with broad index funds like SPY and QQQ. When you have a salary and disposable income you can do individual stocks and options with throwaway money. When you can afford to retire, invest in financial and accounting courses.",
      "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcmtq9l/",
      "created": 1720676361,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcmdbey",
      "score": 5,
      "body": " Once you start making some money out of college, save a good 10-15% of salary for investing if you can. That should be a baseline for retirement. The earlier the start the better and the more it compounds.",
      "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcmdbey/",
      "created": 1720668147,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcm8hhn",
      "score": 17,
      "body": "the best investment is in yourself. get a good paying job and then start investing. its easier to make money when you have money. you should aim for 10% every year. if you're only starting with 250, that's pennies. if you're able to invest 2500 every month once you get a great job as a nurse, that's much more attractive\n\n  \n>The amount that can cover her education, housing, and essential needs.\n\n  \nshe made this money by tricking gullible people like yourself. there's no shortcut to investing. slow and steady wins the race",
      "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcm8hhn/",
      "created": 1720666111,
      "depth": 0,
      "replies": [
        {
          "id": "lcnjw9j",
          "score": 7,
          "body": "In which country nurses can invest 2500usd per month ?!",
          "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcnjw9j/",
          "created": 1720693655,
          "depth": 1,
          "replies": [
            {
              "id": "lcnsdcp",
              "score": 3,
              "body": "My NP friends make 150k and CRNAs make 300k. Even reg RNs make 110",
              "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcnsdcp/",
              "created": 1720698320,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lcm90t2",
          "score": 5,
          "body": "I am getting paid $16/hr as of right now working at a fast food restaurant. I’m trying to find a better job because I have an associate of science degree. I just went back because finding a job with an AS is hard. \n\nI am debating if I should look for high paying jobs or wait until I either get deployed (current in contact with a recruiter for national guard) or until I finish all of my requirements to become a fire cadet. Either or, I’m just looking for ways to get a better career.\n\nI’m definitely taking that option to find a better job, just don’t know when I should do it.",
          "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcm90t2/",
          "created": 1720666329,
          "depth": 1,
          "replies": [
            {
              "id": "lcm9oaj",
              "score": 12,
              "body": "focus on getting your RN so you can make 100k a year (or whatever it is that's near you) and then worry about investing then. until then, keep expenses low, carry exactly $0 in CC debt and you'll be golden",
              "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcm9oaj/",
              "created": 1720666597,
              "depth": 2,
              "replies": [
                {
                  "id": "lcm9vol",
                  "score": 3,
                  "body": "Ok, thank you!",
                  "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcm9vol/",
                  "created": 1720666681,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcnsutx",
      "score": 4,
      "body": "As a fellow nurse.  Finish school then worry about stocks. Not sure where u are in school but it’s not easy and the only thing u should be concerting on is the nclex",
      "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcnsutx/",
      "created": 1720698556,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcmv4wh",
      "score": 2,
      "body": "How much money you have now is not the most important thing. The important part is to consistently contribute a portion of what you earn into the stock market. Over years your money will compound into a great sum. \n\nstart by putting that money into the S&P500 and forget about it. Consistently put in more and more each month. The market averages around 10-15% per year so there will be a doubling around every 5 years. \n\nYour job is to earn and allocate as much money as you can into the market.",
      "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcmv4wh/",
      "created": 1720677185,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcnvvrx",
      "score": 2,
      "body": "Besides buying index funds, as others have already mentioned. Go to your local bookstore and grab a couple of books on the topic. \n\nIndex funds is good advice but it'll be even better if you know what you're doing. Best of luck to you.",
      "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcnvvrx/",
      "created": 1720699988,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcnw8sr",
      "score": 2,
      "body": "Contribute what you can on a weekly or monthly basis to a brokerage account (like Robinhood) and buy VTI which is an ETF that tracks the total US stock market.  Don't worry about timing the market, just keep accumulating on a regular basis. In 20 years you'll have a very nice nest egg.\n\nOnce you have a nursing job, focus on your 401K (403B if you end up working for a nonprofit organization) and contribute at least enough to maximize any employer matching.  Optimally you're going to want to contribute the maximum amount you can per year to the 401K for tax purposes, and then the remainder can go to your regular (taxable) brokerage account to buy VTI.",
      "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcnw8sr/",
      "created": 1720700154,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcp1lff",
      "score": 2,
      "body": "ETF ETF ETF ETF. Don't mess with individual stocks as a beginner. Buy VOO/SPY(S&P 500) and forget about it.",
      "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcp1lff/",
      "created": 1720715006,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwtndv",
      "score": 2,
      "body": "You gotta lose money first to taste what it’s like. Then you become much clearer what needs to be done. GL!",
      "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcwtndv/",
      "created": 1720825531,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcmzayd",
      "score": 1,
      "body": "Start with low-cost index funds or ETFs, which are generally safer and more stable than individual stocks or cryptocurrencies.",
      "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcmzayd/",
      "created": 1720679736,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcoc2iv",
      "score": 1,
      "body": "If the lady you saw made that much money from crypto, please do not buy into it, but if she made it from Stocks, Options, and futures then there is some truth behind it, everyone else in here all say the same thing, invest 2000-3000 a month as if they think you’ll be making that much to be able to invest while still paying off your bills, you can however make crazy good money from “stocks” but your also at great risk from losing that money, regardless if you study about the market and stocks, you most likely won’t be able to make it work for you, I’m not saying it’s impossible, just atm it seems impossible, plus you would have to be awake and off duty at certain times to manage your “stocks”",
      "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcoc2iv/",
      "created": 1720706532,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcrrsmd",
      "score": 1,
      "body": "Just put your money in $VOO and let it grow",
      "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/lcrrsmd/",
      "created": 1720749080,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ld8fcf5",
      "score": 1,
      "body": "I’m 21 aswell and use Sofi, they have the easiest to use platform from my experience. Averaging 30%+ return by investing heavy on Nvidia and other tech sector stocks.",
      "permalink": "/r/stocks/comments/1e0e3j4/how_can_i_start/ld8fcf5/",
      "created": 1721010641,
      "depth": 0,
      "replies": []
    }
  ]
}