{
  "title": "Deep dive into Celsius $CELH - Is it becoming Monster Beverage 2.0?",
  "score": 169,
  "selftext": "It has been a while since I shared an analysis of a public company, and it is time to change that.\n\nCelsius ($CELH) is riding on top of the memories of the exceptional returns of Monster Beverage. Is Celsius becoming Monster Beverage 2.0? To answer this question, I’ll walk you through plenty of information that I think anyone interested in the company should be aware of.\n\n\n\n**1.0 The Bull Case**\n\nIn **2023**, Celsius had revenue comparable to Monster Beverage back in **2010**. However, as a company, it is growing at a much faster pace. In the 4 years prior:\n\n- Celsius grew from $75m to $1.3 billion\n\n- Monster Beverage grew from $606 million to $1.3 billion\n\nThis brings a lot of excitement and the main question is - *Will the revenue growth continue in the next decades?* \n\nSince 2010, the share price of Monster Beverage is up over 1,000% (vs. 350% for the S&P500).\n\n  \n**2.0 Pepsi - The key stakeholder**\n\nBefore we dive into all the fun stuff, it is important to introduce Pepsi, I’ll argue, the most important stakeholder. It is not only the exclusive distributor but also owns part of Celsius through so-called mezzanine financing (a hybrid of debt and equity). The ownership is slightly less than 10% and it is enough to align the incentives. This also opens the door to a potential acquisition in the future.\n\nPepsi accounts for almost 60% of all the Celsius sales. You might wonder, wait a second, isn’t Celsius selling products to the final customers? Ultimately, yes. However, the customers’ definition of Celsius is ***Distributors, Brick-and-mortar outlets, club stores, and health-focused locations.***\n\nDistribution is key in a business of this kind. Ideally, you’d like to partner with someone who has a large reach and can quickly distribute the product to the final customer. Pepsi is a great match. However, given its size, it has a lot of negotiation leverage, especially when it comes to pricing.\n\n  \n**3.0 The bull case tested**\n\nFor Celsius to follow in the footsteps of Monster Beverage, it needs to grow, a lot. In my opinion, there are 3 ways for that to happen:\n\n1. **Expand into new markets**\n\nNorth America accounts for 96% of all the revenue that Celsius brings. For comparison, this is only 65% for Monster Beverage. The good news is: **There is a lot of room for expansion**, and the company is already working on this. During 2024, sales are expected to begin in **Canada, the UK, Ireland, Australia, New Zealand, and France.**\n\n\n\n1. **Steal market share from its competitors (in existing markets)**\n\nBased on the Q1 data, Celsius holds the #3 spot in the U.S. energy drinks market with a market share of 11.4%. This is definitely impressive growth. However, the latest data show that its market share **has decreased to 10.5%** - which indicates that the upper limit is being reached. In addition, on June 11, Celsius’ management shared that Pepsi would reduce inventories of the energy drink by another $20-$30 million in the second quarter, which followed a $45 million reduction in the first quarter. This could be another indication that the supply outweighs demand and the hypergrowth days might be over.\n\nLet’s not forget, this is a tough landscape to compete with. Red Bull, Monster Beverage, and even Pepsi are direct competitors.\n\n1. **Introduce new products (expand into new verticals)**\n\nLastly, for a company to innovate, it needs to invest in Research and Development.\n\nUnfortunately, there isn’t much of that happening. The R&D expense is below 0.1% of revenue, so I don’t have high expectations for new products or verticals (such as protein bars) unless it comes through an acquisition.\n\n\n\n**4.0 Historical financial performance**\n\nThe company is in charge of development and marketing, while the manufacturing is outsourced. This, combined with Pepsi’s distribution, allowed the company to grow at this incredible pace, without having to invest too much.\n\nHowever, profitability-wise, it is lagging behind Monster Beverage:\n\n* 50% gross margin (vs. 55% of Monster Beverage)\n* 22% operating margin (vs. 29% of Monster Beverage)\n\nIt is quite clear that Celsius isn’t at the same level.\n\n  \n**5.0 Valuation**\n\nBased on my assumptions, the company will continue to grow, although, at a lower pace than analysts currently expect. Here are my assumptions:\n\n- Revenue growth is to decrease to 20% over the next 5 years\n\n- Operating margin to increase to 23% (much lower than Monster Beverage)\n\nBased on my assumptions, the value of the company is roughly $10 billion (after adjusting for cash/debt), or **$43/share** (below the current price of **$59).**\n\nHere’s how the valuation (per share) changes if you have different assumptions than mine regarding the revenue growth over the next decade and its operating margin:\n\n\n\n|Revenue / Operating margin|21%|23%|25%|29%|\n|:-|:-|:-|:-|:-|\n|342% ($6.2b)|$33|$37|$41|$48|\n|419% ($7.3b)|$39|**$43**|$47|$55|\n|650% ($10.6b)|$56|$61|$67|$78|\n\nCurrently, the market price is $59, which implies high expected growth for an **extended period of time**. If the growth rate decreases below 25%, I do expect a significant market reaction.\n\nHowever, if you believe Celsius is the next Monster Beverage, will grow at the same pace for an extended period of time, and will reach the 29% operating margin, then the company is undervalued.\n\nShould the price drop below $40, I might revisit the company and see if my thesis is still intact. Until then, I’m happy to follow the company from the sidelines.\n\nI hope you enjoyed this post, feel free to share your thoughts.",
  "link_flair_text": "Company Analysis",
  "id": "1e1e12r",
  "num_comments": 145,
  "created_utc": 1720779010,
  "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/",
  "comments": [
    {
      "id": "lctm4bm",
      "score": 134,
      "body": "i love celsius as a product but the reason i won't invest is because it doesn't have an individual identity like monster or red bull do. you know exactly what a red bull tastes like. celsius doesn't have its own taste, it's just the same fruit flavors that every other energy drink company has put out.",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctm4bm/",
      "created": 1720785528,
      "depth": 0,
      "replies": [
        {
          "id": "lcv0zdn",
          "score": 26,
          "body": "I feel like their identity is about health and fitness. The flavour profile of most energy drinks of the past - monster, rockstar, and redbull - is kind of gross to me. I admit that my younger self stupidly   thought, “this is the demands of ‘energy’ and you’re making the trade off.” Having classic flavours seems a little similar to the Olipop or Poppi model where it’s a healthy and enjoyable alternative to the classics. Seems to be working for those other brands in their growth phases.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcv0zdn/",
          "created": 1720803524,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcu4wux",
          "score": 24,
          "body": "exactly...I legit thought this was like a sparkling water or a whute claw or something. it doesn't have the same brand identity \n\nyou look at a can of monster or Red Bull and you know exactly what it is and what it tastes like. Celsius wants to differentiate themselves from them, but in doing so, they need to create a \\*new\\* brand identity\n\nthey parroted the weird health drinks with all the text on them, and I don't think they realize most people view that with skepticism. i didn't even think it had caffeine!",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcu4wux/",
          "created": 1720793047,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcxqz4t",
          "score": 6,
          "body": "Celsius is really popular among women, who generally aren’t into the extreme sports and racing identities of Monster and RB. ",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcxqz4t/",
          "created": 1720839260,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcvtp0r",
          "score": 6,
          "body": "When Celsius has a racecar, I'll invest. Redbull and Monster have the best and most badass car scene IMO.\n\nHave you seen RB17? holy shit, I'm glad my purchases help to make things like this a reality, even if I'll never drive or see one lol.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcvtp0r/",
          "created": 1720812888,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcui12c",
          "score": 8,
          "body": "I agree with you to an extent but you’re missing the demographic it’s reaching. Celsius is targeted as a cleaner energy drink compared to the big names you mentioned. Fitness influencers and health centric individuals are key here. If you’re at all familiar with the up and coming younger generation, and what they care about , it’s a lot more focused on ingredients in products. The youth/fitness group will adopt this as their energy drink because it’s not a legacy energy drink that’s “extreme” like monster and redbull and the “vibe” Celsius is creating matches their preferences.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcui12c/",
          "created": 1720797448,
          "depth": 1,
          "replies": [
            {
              "id": "lcuox46",
              "score": 8,
              "body": "It’s not even about being healthier or having better ingredients. It’s just imagine. Celsius is for white collar yuppies working desk jobs. You don’t wanna be cracking open a white monster at your finance job, but Celsius won’t make anyone think twice. Monster is blue collar/ trashy.",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcuox46/",
              "created": 1720799660,
              "depth": 2,
              "replies": [
                {
                  "id": "lcv4ya3",
                  "score": 0,
                  "body": "This is true also",
                  "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcv4ya3/",
                  "created": 1720804804,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcuikt2",
              "score": 2,
              "body": "this is definitely a good argument for the brand. who knows, a cult following could make it stick around",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcuikt2/",
              "created": 1720797624,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lcvtvg8",
          "score": 2,
          "body": "The 20+ different flavors of Bang were 25% of every gas station's energy drink selection 5 years ago and they are all but extinct, possibly for the same reason.  I realize Monster owns Bang, but I'm speaking of the brand, not the company.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcvtvg8/",
          "created": 1720812948,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcuh7ex",
          "score": 1,
          "body": "I invest in XMHQ, which has about the percent in its holdings that I believe in Celsius for. \n\n\nOn the other hand, why does flavoring matter? I don't drink Celsius but God are my friends so damned loyal to it. No, they can't describe the taste but they unequivocally all believe it is the best.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcuh7ex/",
          "created": 1720797179,
          "depth": 1,
          "replies": [
            {
              "id": "lcui84s",
              "score": 5,
              "body": "it is the best, for now. until something else comes along and people forget about celsius because it doesn't stand out",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcui84s/",
              "created": 1720797512,
              "depth": 2,
              "replies": [
                {
                  "id": "lcuj972",
                  "score": 3,
                  "body": "Maybe you're right. I don't know, I just have this little feeling it's going to be the energy drink of the future, regardless of its lack of identity. ",
                  "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcuj972/",
                  "created": 1720797844,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcum75f",
                      "score": 3,
                      "body": "it could be. we're all just guessing lol",
                      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcum75f/",
                      "created": 1720798792,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lcuozzk",
                          "score": 1,
                          "body": "And that's what I love about stocks, we can all pretend to be fortune tellers. ",
                          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcuozzk/",
                          "created": 1720799686,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lculxvg",
                  "score": 1,
                  "body": "What about Bang energy drink?",
                  "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lculxvg/",
                  "created": 1720798709,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcxfica",
                      "score": 1,
                      "body": "Bang is or was a flash in the pan. Got sued to shit due to lies about the ingredients.",
                      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcxfica/",
                      "created": 1720834313,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lg327ri",
                  "score": 1,
                  "body": "Don't forget it'd be quite difficult for another brand to build the mindshare and brand loyalty that Celsius has committed to building over the past decade.",
                  "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lg327ri/",
                  "created": 1722568628,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lcu3ukm",
          "score": -2,
          "body": "This",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcu3ukm/",
          "created": 1720792668,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcv33af",
      "score": 22,
      "body": "I like how Motley Fool recommended them about 2 months ago at their High and it immediately tanked. So glad I didn’t buy into it then. I might buy in at this low a price though.",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcv33af/",
      "created": 1720804203,
      "depth": 0,
      "replies": [
        {
          "id": "lcwe8tx",
          "score": 8,
          "body": "That's their MO somehow. They will recommend a stock at high to get people interested, then it crashes. I almost feel like it's a pump'n'dump lol.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcwe8tx/",
          "created": 1720819816,
          "depth": 1,
          "replies": [
            {
              "id": "lcww6rr",
              "score": 3,
              "body": "Look into who owns them and then see what their stock positions are VS what’s on their website recommendations. It’s very telling",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcww6rr/",
              "created": 1720826508,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ld0kq5r",
              "score": 1,
              "body": "I think what happens is when we are in a bear market people dont look at the site or anywhere for stock ideas. It when it a bull market or stocks are rallying is when suddenly people start looking up stock recommendations. \n\nI know Motley fool is hated and I dont look to them for stock ideas but I wouldn't be surprised if their traffic is correlated to how the indexes are doing.",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/ld0kq5r/",
              "created": 1720891115,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lcvf24y",
          "score": 9,
          "body": "I guess the 2nd half of their name is a hint sometimes.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcvf24y/",
          "created": 1720808056,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ld0k0dn",
          "score": 2,
          "body": "I don't really look to Motley Fool for stock recs. But it should be mentioned they have multiple people writing the articles for them.\n\nI wouldnt be surprised if people the recommending for this company go back years and you just happened to decide to search them in 2024. This company was a fnance YouTube stock as well.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/ld0k0dn/",
          "created": 1720890856,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcueeib",
      "score": 33,
      "body": "In my area, soooo many girls drink this.  Lot's of girls at the gym dinking it, and at my office it's really the only energy drink I see women drinking.  Seems a lot fewer men drinking it, and kids now all love Prime for some reason (my kids seem so impressed when people are drinking prime, of course they are in elementary school and who knows why kids like stuff).  They are a sponsor for MLS and have their name on the substitution board so they seem to be trying to push into a mens market as well. \n\nI've tried it and some of the flavors are very good, plus I don't look like a douche carrying a can around, unlike  Monster's ed hardy looking cans.",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcueeib/",
      "created": 1720796262,
      "depth": 0,
      "replies": [
        {
          "id": "lcumyjv",
          "score": 19,
          "body": "Prime is by social media influencers - thats probably why kids like it",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcumyjv/",
          "created": 1720799036,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcv8crj",
          "score": 8,
          "body": "It's extremely popular in the health care field. Lots of Celsius in the hospitals I work in.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcv8crj/",
          "created": 1720805890,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcvcqij",
          "score": 3,
          "body": "It's extremely popular in the health care field. Lots of Celsius in the hospitals I work in.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcvcqij/",
          "created": 1720807300,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lctjx5e",
      "score": 31,
      "body": "I owned shares of this at $5, I sold them at $15. \n\nGah",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctjx5e/",
      "created": 1720784476,
      "depth": 0,
      "replies": [
        {
          "id": "lcurypv",
          "score": 33,
          "body": "Nobody ever went broke taking a profit...",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcurypv/",
          "created": 1720800642,
          "depth": 1,
          "replies": [
            {
              "id": "ld1ld7m",
              "score": 4,
              "body": "yeah but he could have been fucking rich lol",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/ld1ld7m/",
              "created": 1720904534,
              "depth": 2,
              "replies": [
                {
                  "id": "ld31d9u",
                  "score": 2,
                  "body": "Make enough good trades and you will be; missing out on the whales or not. I had a ticket in my hands for OEX puts on the Friday before Black Monday; decided to wait to see what the weekend brought. Cost me 7 figures. I still did OK over time...",
                  "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/ld31d9u/",
                  "created": 1720925512,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lcwfib5",
          "score": 1,
          "body": "I still have 120 shares at entry price of $15.73.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcwfib5/",
          "created": 1720820263,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcuwn0a",
      "score": 18,
      "body": "Honestly never heard of Celsius until a couple weeks ago when I saw it in a vending machine at a rest stop during a roadtrip.  Thought it looked interesting so bought one and surprisingly, tasted delicious.  Also surprisingly, had no idea it was an energy drink as I saw it just had zero calories/sugar and was looking for something other than soda or water.  Was staring at the ceiling until 3am that night wondering WTF was wrong with me and why I couldn't sleep.  Son informed me the next morning that I basically downed 6 cups of coffee at 8pm...",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcuwn0a/",
      "created": 1720802143,
      "depth": 0,
      "replies": [
        {
          "id": "lcvfdz7",
          "score": 5,
          "body": "Thank you for sharing your experience. To be honest, I find the caffeine level way too high.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcvfdz7/",
          "created": 1720808163,
          "depth": 1,
          "replies": [
            {
              "id": "lcz2gl5",
              "score": 3,
              "body": "200 mg?",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcz2gl5/",
              "created": 1720868235,
              "depth": 2,
              "replies": [
                {
                  "id": "lcz9vb1",
                  "score": 2,
                  "body": "Yes.",
                  "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcz9vb1/",
                  "created": 1720872446,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lctiya7",
      "score": 14,
      "body": "Im on the same thought process as you. Im just a little worried that over the past 5-10 years ive seen so many new energy drinks come out. There was bang, reign, c4, etc so im not sure if its a new fad until the next one comes out",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctiya7/",
      "created": 1720783999,
      "depth": 0,
      "replies": [
        {
          "id": "lcu7yje",
          "score": 4,
          "body": "Reign is monster's higher caffeine content meant to compete with bang but now that monster owns bang idk what the point of reign is",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcu7yje/",
          "created": 1720794109,
          "depth": 1,
          "replies": [
            {
              "id": "lcu93fr",
              "score": 7,
              "body": "Brand loyalty and illusion of choice. People don't actually look at the can or read online information to figure out that two different \"brands\" come from the exact same mother brand.",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcu93fr/",
              "created": 1720794495,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lcum8pn",
          "score": 1,
          "body": "Monster owns Bang and Reign.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcum8pn/",
          "created": 1720798806,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcvpbsd",
          "score": 1,
          "body": "C4 is eating Reign and Bang's lunch right now.  Their Popsicle line has really taken off.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcvpbsd/",
          "created": 1720811432,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lctk3nb",
          "score": -2,
          "body": "Anything is possible. thus, diversify",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctk3nb/",
          "created": 1720784563,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lctu2e8",
      "score": 15,
      "body": "Amazing this thread just popped up today. I work at a hospital and I saw it everywhere yesterday. It just came on my radar and suddenly I see all these nurses drinking it. I think it tastes good and gave me good energy without feeling wired",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctu2e8/",
      "created": 1720788987,
      "depth": 0,
      "replies": [
        {
          "id": "lcup5jf",
          "score": -1,
          "body": "I know there's a class action lawsuit against them for something they put in the drink",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcup5jf/",
          "created": 1720799735,
          "depth": 1,
          "replies": [
            {
              "id": "lcv0ba1",
              "score": 3,
              "body": "For labeling that there were no preservatives, but using citric acid in the ingredients - Celsius claimed it was used as flavoring, not a preservative, but settled instead of going to court.",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcv0ba1/",
              "created": 1720803314,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lctfgin",
      "score": 18,
      "body": "Celsius probably has a superior product to monster but they will take a few yrs to expand. It is gonna take time. Monster has 4x celsius mkt cap. Celsius has alot of catching up to do.\n\n\nU are of course giving it a low valuation, below its current price, because u are not a shareholder. This stock is volatile and it has already fallen by nearly half. It was higher valued just awhile ago.\n\nI own some shares. Its a small position in my port.",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctfgin/",
      "created": 1720782152,
      "depth": 0,
      "replies": [
        {
          "id": "lcthfjp",
          "score": 22,
          "body": "I think the one thing a lot of people don't account for is that TAM for Celsius is way larger than Monster. \n\nPeople are drinking it instead of their morning coffee, drinking it with lunch, etc. People who would never drink a Monster or a Redbull are drinking it (and so are people previously drinking Monster and Redbull).",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcthfjp/",
          "created": 1720783219,
          "depth": 1,
          "replies": [
            {
              "id": "lctpyla",
              "score": 14,
              "body": "They’re also being sold in a lot of gyms too. Don’t get me wrong, monsters are there too but there are always more celcius available and I always see more people drinking them than monster.",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctpyla/",
              "created": 1720787271,
              "depth": 2,
              "replies": [
                {
                  "id": "lcu1sq0",
                  "score": 7,
                  "body": "Also a lot of “fitness studios” that are primarily targeted to women, like Barre studios, etc. ",
                  "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcu1sq0/",
                  "created": 1720791938,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lctkeco",
              "score": 13,
              "body": "monster and redbull's TAM does not include women. Celsius' does. that's enough DD for me",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctkeco/",
              "created": 1720784708,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lctjy86",
              "score": 6,
              "body": "yep, same thoughts since it does not have the huge amount of sugar that monster and redbull has. Even without the additional TAM, its mkt cap is significantly lower than monster. However, expansion will take time and a stock with this sort of valuation will be volatile. Analysts will just tug it up and down basis their assumptions and valuations lol",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctjy86/",
              "created": 1720784491,
              "depth": 2,
              "replies": [
                {
                  "id": "lctknrh",
                  "score": 1,
                  "body": "Yeah it's not a get rich quick scheme. I'm gonna keep buying at these prices and my future self will thank me in a few years :)",
                  "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctknrh/",
                  "created": 1720784833,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcwg7qr",
              "score": 1,
              "body": "I’m a big energy/coffee drinker, and all I drink now is Celsius.  They have mastered the perfect “buzz”.  It’s a nice “pick me up” without a major crash",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcwg7qr/",
              "created": 1720820515,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lctup6e",
          "score": 7,
          "body": "Just to make sure I understand, your critique of his valuation is that he doesn’t own any stock?  \n\nIs the purpose of valuation to confirm you already made a good investment?",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctup6e/",
          "created": 1720789238,
          "depth": 1,
          "replies": [
            {
              "id": "lcu43y6",
              "score": 0,
              "body": "On valuation, there will be analyst who give a higher price target basis it deserves a higher valuation and vice versa.\n\n\nIt is normal investor psychology for one to value something lower than current price if they are considering buying some and vice versa. There is always bias on both sides.\n\n\nAs for wat price it deserves, that will be up to those wall st analyst who have clout. They can push it up and down as they wish. I dont need confirmation on anything lol. Is a small position and i am diversified. U can short the stock if u wanna",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcu43y6/",
              "created": 1720792761,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lctmt1b",
          "score": 9,
          "body": "If my valuation changes on whether I am a shareholder or not, then I'm adding a lot of bias to the process and it will eventually harm me.  I wish you lots of success in your investment journey.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctmt1b/",
          "created": 1720785853,
          "depth": 1,
          "replies": [
            {
              "id": "lctnzqw",
              "score": -7,
              "body": "no harm. it is just human nature to hope for a stock to go down if they dont own it and to hope for it to go up if u own it. it exists in us all. The valuation will be moved by those wall street analysts, results and market sentiment. And something this richly valued due to high future expectations will always be volatile.",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctnzqw/",
              "created": 1720786399,
              "depth": 2,
              "replies": [
                {
                  "id": "lctqrtv",
                  "score": 9,
                  "body": "I don't agree that \"it is human nature to hope for a stock to go down if they don't own it.\" - If anything, I hope others succeed too. I don't see any reason why I should hope for a stock to go down if I don't own it.",
                  "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctqrtv/",
                  "created": 1720787621,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lctr2kg",
                      "score": 5,
                      "body": "It does not just apply to stocks. its the same if u are heavy in cash, u hope for mkt to go down so u can buy cheap. If u are heavily invested, u hope the market goes up. Its normal trading/investing bias. I guess we agree to disagree on this.",
                      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctr2kg/",
                      "created": 1720787749,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lctyw6f",
                          "score": 4,
                          "body": "I agree for the most part but I’m absolutely capable of being objective at times. Reading the write up he seems totally indifferent as to what happens. Probably wanted to invest. Looked into it and said eh. Gave us his findings anyway. People can be objective",
                          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctyw6f/",
                          "created": 1720790862,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lcu59ys",
                      "score": 1,
                      "body": "yeah for real, we all have money in the S&P, nobody wants it to tank! (well, maybe for long enough to buy more haha)",
                      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcu59ys/",
                      "created": 1720793177,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lcu5h77",
                          "score": 2,
                          "body": "Those who miss the rally and are heavy in cash will want it  to tank, so they can buy in lol",
                          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcu5h77/",
                          "created": 1720793249,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lctxoww",
                  "score": 1,
                  "body": "I was just agreeing with the sentiment described here then saw the downvoting. I guess we're just assholes then, everyone else is celebrating the market moving against them cause hey, someone out there is winning so why not be happy for them",
                  "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctxoww/",
                  "created": 1720790410,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcu8x2q",
                      "score": 1,
                      "body": "Celsius can go down 50% or go up 100% from here btw. Will be up to ER and analyst downgrades/upgrades\n\nWe are not supposed to be happy when port goes up or down, although that is hard to do lol",
                      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcu8x2q/",
                      "created": 1720794436,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lctmu8j",
          "score": -1,
          "body": "Jesus, the bagholders here are on Olympics level of copium.\n\n\n\nMonster has had the *best returns of any stock in the world* since IPO, get real.\n\n\n\nCelsius is *shit*. It's an energy drink that's neither has a cult following, nor brand coolness and not even a good rap sheet. It's litterary no better the Vitamin Water.\n\n\n\nThey've been trying to sell it for years in Europe. Even *giving it away regularly* but people don't buy it, don't want it. It's not tasty, the ingridients aren't impressive and the taste mediocre. It isn't monster nor coffee, it's the \"vegan wannabe drink\" that will flop as hard as all other fake products.\n\n\nCoffee is a cultural thing, popular all across the world.\n\n\n\nMonster is the goto for all Kyle's, all kids and all conservative youths. Celsius target demographic are people gluing themselves to the highway, a minority niche. This will be a massive loss for you, Mark my words. This is oatley or impossible meats 2.0, you'll cry yourself to sleep within a few years when it's discontinued",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctmu8j/",
          "created": 1720785869,
          "depth": 1,
          "replies": [
            {
              "id": "lcty98u",
              "score": 5,
              "body": "> Monster has had the best returns of any stock in the world since IPO, get real.\n\nThat is not correct.",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcty98u/",
              "created": 1720790624,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lctnpwz",
              "score": 9,
              "body": "lol its growth and popularity says otherwise. over here, some flavors are currently sold out. anyways, we shall see. cant lose sleep over a small position. the play these days are AI and chips.\n\nFirst time i hear that. celsius on amazon uk alone has 46,000+ reviews with a 4.7 rating. I would think that it is selling fine\n\n[https://www.amazon.com/gp/bestsellers/grocery/16318341/ref=zg\\_b\\_bs\\_16318341\\_1](https://www.amazon.com/gp/bestsellers/grocery/16318341/ref=zg_b_bs_16318341_1)\n\nCelsius is the top selling energy drink on amazon us. I dont think it will be discontinued anytime soon lol. See link",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctnpwz/",
              "created": 1720786274,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcuakyo",
              "score": 3,
              "body": "Clearly missed that Celsius just launched in Europe in 2024...swing and a miss there kiddo.",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcuakyo/",
              "created": 1720794996,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcxphse",
              "score": 2,
              "body": "RemindMe! 2 years",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcxphse/",
              "created": 1720838594,
              "depth": 2,
              "replies": [
                {
                  "id": "lcxpmvf",
                  "score": 1,
                  "body": "I will be messaging you in 2 years on [**2026-07-13 02:43:14 UTC**](http://www.wolframalpha.com/input/?i=2026-07-13%2002:43:14%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcxphse/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1e1e12r%2Fdeep_dive_into_celsius_celh_is_it_becoming%2Flcxphse%2F%5D%0A%0ARemindMe%21%202026-07-13%2002%3A43%3A14%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201e1e12r)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                  "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcxpmvf/",
                  "created": 1720838657,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lctv3mr",
              "score": 1,
              "body": "it will make you shit and it is shit lmao listen to your bodies people!",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctv3mr/",
              "created": 1720789400,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcwmlwk",
              "score": 1,
              "body": "If you can say all of this in an annoyingly loud voice, you've got a career waiting for you at CNBC.",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcwmlwk/",
              "created": 1720822861,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lcwe2ov",
          "score": 1,
          "body": "I'm upset that I haven't been using \"port\" for portfolio all these years",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcwe2ov/",
          "created": 1720819756,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcu90se",
      "score": 3,
      "body": "Good write up, thanks for sharing.  \nI drink Celcius from time to time on road trips, I prefer it over Reb Bull or Monster for less chemical taste. Recently, though, I've found Bubbl'r without artificial sweetener and I believe it's a better fit for me. It's not a fit for my portfolio at this time either. GLTA",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcu90se/",
      "created": 1720794470,
      "depth": 0,
      "replies": [
        {
          "id": "lcvfkfe",
          "score": 2,
          "body": "Thank you for sharing.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcvfkfe/",
          "created": 1720808222,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcvmcic",
      "score": 3,
      "body": "The construction guys I work with drink this shit by the ton",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcvmcic/",
      "created": 1720810440,
      "depth": 0,
      "replies": [
        {
          "id": "lcvzdxk",
          "score": 1,
          "body": "Same here at our solar and wind farms.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcvzdxk/",
          "created": 1720814770,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcti3ky",
      "score": 4,
      "body": "I bought a case of Celsius to try it out recently .  Tastes a bit too sweet for my liking.",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcti3ky/",
      "created": 1720783564,
      "depth": 0,
      "replies": [
        {
          "id": "lctipdh",
          "score": 6,
          "body": "I think thats why people like it over coffee though",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctipdh/",
          "created": 1720783872,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcv2tlx",
      "score": 2,
      "body": "One thing you're forgetting in your comparison is market conditions when Monster was coming along. Back then it was really just Redbull dominating the market. When Monster came along as an alternative that didn't taste like stale horse piss, it took off. \n\nCelsius has to fight for market share from Redbull, Monster, Rockstar, and whatever else is there. Consumers already have a plethora of choices and it would take a clearly superior product to quickly take over this market segment. Will they grow? Sure. Will we see the same type of growth and returns like Monster? Highly unlikely.",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcv2tlx/",
      "created": 1720804115,
      "depth": 0,
      "replies": [
        {
          "id": "lcvf5ph",
          "score": 2,
          "body": "Great point, I agree.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcvf5ph/",
          "created": 1720808088,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcxps7d",
          "score": 1,
          "body": "Celsius has twice the potential TAM as traditional energy drinks though, women will drink it.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcxps7d/",
          "created": 1720838724,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcvoxxx",
      "score": 2,
      "body": "All of the back rooms and grocery stores around here are packed full of backstock.  Sure, it sells well, but they aren't through what they got jammed with at Christmas last year, and they got their back rooms jammed full at the end of March to make numbers.  There isn't any room left to have jammed at the end of June to make Q2 numbers, which is why they are predicting it backing off even though the summer months should be its time to shine.  Retailers are getting pissed around here.",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcvoxxx/",
      "created": 1720811304,
      "depth": 0,
      "replies": [
        {
          "id": "lcxoy2l",
          "score": 1,
          "body": "Are you like a grocery backroom inventory engineer? Just curious how you have this insight",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcxoy2l/",
          "created": 1720838349,
          "depth": 1,
          "replies": [
            {
              "id": "lcxvo2h",
              "score": 4,
              "body": "I'm a district sales supervisor for KDP.  Part of my job is keeping an eye on the competition.  Just about every convenience store in our area got slammed with 30-50 cases of Celsius going into Christmas last year.  It was a \"special buy\" with a hint of, \"if you don't take this, next year's contract pricing for you might not be favorable\".\nWhen March came around, Pepsi was peddling the same story.  But a lot of stores were still sitting on that Christmas drop, but you can't piss off the Mountain Dew supplier around here, so they loaded up their back rooms to the point that Coke and Budweiser just starting dropping stacks when delivering and walking back out- not bothering to work deliveries.  So now just everyone is angry at the situation.  Pepsi came in and said, \"buy buy buy for the 4th of July!\", but oops- all of that March drop is getting dusty in the back room.  We'll see if they follow through on higher pricing for all the accounts that took a pass.  As short of drivers and warehouse staff they are (had half their warehouse loaders walk out before July 4th weekend in Omaha, and a handful of managers when they were told they'd be stacking pop now).  Pepsi drivers are now running Celsius and Gatorade off their trucks now instead of warehouse direct, and all the drivers are ready to quit.  Stores are all mad because they are just dropping and running.  We've already got a couple stores to drop contracts with them due to service issues- and we've got a great story now that Dr Pepper is outselling Pepsi.",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcxvo2h/",
              "created": 1720841430,
              "depth": 2,
              "replies": [
                {
                  "id": "lcxwnqy",
                  "score": 1,
                  "body": "Wow. So it’s safe to say you are an expert and have a good pulse on the situation. Wondering if they were overly bullish on the shelf resets that were coming up. Appreciate the additional insight as I have too many options and shares of Celsius right now 😅 Might be saving me some heartache. Congrats on surpassing PEP as well!",
                  "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcxwnqy/",
                  "created": 1720841903,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcxxhe9",
                      "score": 5,
                      "body": "Don't get me wrong, Celsius still has very brisk sales, but they have definitely hit their saturation point around here.  Pepsi jammed a shelf full of flavors with resets this spring, but the weird additional flavors aren't finding any footing.  As always, the top 4 flavors carry 60% of the business- all the rest are just to hog space from the competition to keep them from selling new items.  The only saving grace around here is Pepsi has thrown their weight around one too many times- doing stupid space grabs and forcing stores to carry multiple SKUs of UpTime and over space on water to try and cut into our Core Water space.  The joke's on them- our 2 facings of Core 30.4oz water is outselling their shelf of Aquafina.",
                      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcxxhe9/",
                      "created": 1720842299,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lcxy9ux",
                          "score": 3,
                          "body": "Aquafina needs to go away. I would almost rather drink my tap water. Absolutely can’t believe anyone still buys this, if there are other options available. Dasani is nearly equivalent trash. It’s like Pepsi and Coke aren’t even trying with these brands.",
                          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcxy9ux/",
                          "created": 1720842685,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lcxygnr",
                              "score": 4,
                              "body": "If they didn't force stores to carry it in contracts, they would both be long dead.  But, they make money hand over fist on it.",
                              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcxygnr/",
                              "created": 1720842777,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lcy0lyl",
                                  "score": 2,
                                  "body": "I learned a lot today. Thank you for sharing your hard earned knowledge 🍻",
                                  "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcy0lyl/",
                                  "created": 1720843852,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ld3qcc5",
                                      "score": 2,
                                      "body": "Just a heads up, take everything you read on here with a grain of salt. A lot of what that guy is saying about contracts, spacing , shelving etc is likely either a.) not accurate or b.) very very specific to his market that he may or may not work in. I work in a similar position as him and the way he explained things is just not correct.",
                                      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/ld3qcc5/",
                                      "created": 1720937958,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lczf71m",
      "score": 2,
      "body": "Too much caffeine for such a small can. I also believe that the sugar free versions of Monster and Redbull taste a little better. For that reason, I will not invest.",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lczf71m/",
      "created": 1720875108,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcu2wyy",
      "score": 2,
      "body": "I love when a see a lot of comments in the daily or regular posting on a particularly stock - I just think how many are bag holders that purchased near ATH.",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcu2wyy/",
      "created": 1720792339,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lctr9g6",
      "score": 2,
      "body": "I've read from people VERY knowledgeable in the space that the PEPSI deal was the nail in the coffin for this company.  They are in control by Pepsi, not the other way around.  The CEO seems to be a good drink maker/marketer but not business man.   You need to control all distribution if you want to win in this game.  They think CELH will get taken out cheap now.",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctr9g6/",
      "created": 1720787830,
      "depth": 0,
      "replies": [
        {
          "id": "lctskza",
          "score": 5,
          "body": "I disagree on this topic, to be honest. Building a distribution to the Pepsi level will take decades and plenty of capital. Yes, Pepsi has a lot of leverage, but I'd argue this approach adds more value to the shareholders.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctskza/",
          "created": 1720788387,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcuv44y",
          "score": 4,
          "body": "If you want to win in the beverage game, you want to be bought out by coke, Pepsi, or whatever Cadbury is calling Dr Pepper these days. \n\nRed Bull doesn’t own its distribution and they’re doing juuuuust fine.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcuv44y/",
          "created": 1720801653,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcubhh7",
          "score": 3,
          "body": "All beverage makers use distributors, Monster used Coca Cola",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcubhh7/",
          "created": 1720795297,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcubnp0",
      "score": 1,
      "body": "Thanks for the analysis. I got lucky with my timing and bought at $52.88 on Tuesday. \n\nI still believe in the product, so I’m hoping for a bit more run up yet. have a sell set for $61.5",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcubnp0/",
      "created": 1720795355,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcuy3r1",
      "score": 1,
      "body": "$coco",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcuy3r1/",
      "created": 1720802614,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcvl7n7",
      "score": 1,
      "body": "poots it is",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcvl7n7/",
      "created": 1720810068,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwhtlg",
      "score": 1,
      "body": "their lack of moat is dramatic. i have to look at how monster did so well but the market was far less crowded back then. celsius is more like a sam adams. stock mooned with white claw then competition ate its lunch \n\ni’d short both celsius and monster or not buy either",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcwhtlg/",
      "created": 1720821087,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwk74d",
      "score": 1,
      "body": "It’s one of Motley Fool’s top 10 picks. Do what you’d like with that info.",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcwk74d/",
      "created": 1720821959,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwssic",
      "score": 1,
      "body": "I feel like this market is super saturated already. Yeah, Celsius is good but it’s not unique by any means.",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcwssic/",
      "created": 1720825203,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcy4ae9",
      "score": 1,
      "body": "My kids stopped drinking it. I will not invest. It's about to turn down hard. Quote me",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcy4ae9/",
      "created": 1720845760,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ld0a652",
      "score": 1,
      "body": "I know it’s anecdotal, but seeing all these responses in here of folks “just learning about it” recently is actually pretty reassuring that there’s more growth in the tank. \n\nI’m consistently bullish",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/ld0a652/",
      "created": 1720887313,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfjkzp3",
      "score": 1,
      "body": "45 now …",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lfjkzp3/",
      "created": 1722284776,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg318t8",
      "score": 1,
      "body": "Great analysis! Thanks for sharing. I feel Celsius has a strong emergent (i.e. more relevant today) moat compared to its peers, with its advertising and brand packaging focusing on \"health\" and \"fitness\". Seems like it's pushing itself as a lifestyle brand rather than a sporty energy drink.\n\nGood points about the gross and operating margins. Monster seems to have also had good traction with its own margins, but at one point gross was in the mid 60s and operating in the 40s in 2016. So i'm wondering if there is in fact more headroom for Celsius to expand margins, but of course the macro environment was different in 2016 than it is now. Celsius has appeared pretty heavy-handed with promotional activity over the past few years.\n\nAm curious what valuation approach you used to arrive at those price targets and perhaps the terminal growth rate if applicable. and what do you think now that it's below $45?",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lg318t8/",
      "created": 1722568204,
      "depth": 0,
      "replies": [
        {
          "id": "lg3z7sy",
          "score": 2,
          "body": "I am glad you liked the analysis.\n\nI used DCF, with 4% as a terminal growth rate (similar to the 10-year treasury yield).\n\nAlthough it is close to the fair value now, I am not buying any shares. The main reason is - I see other companies that offer better returns (of course, I might be wrong). However, if the price continues to decline and there is a significant margin of safety, I will reconsider.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lg3z7sy/",
          "created": 1722587207,
          "depth": 1,
          "replies": [
            {
              "id": "lg7e3t5",
              "score": 1,
              "body": "Thanks for the follow up. I think that's fair. They are releasing their Q2 print Tuesday morning. Curious, what do you think about international segment contribution to revenue? They just launched into Britain and Ireland at Q2 start (combined $1.25 billion market), and if their success in Canada was anything replicable then they could potentially already be pulling >5% of the market in Q3, or 60+ million additional annual revenue. \n\nI'm hoping that the Q2 report may calm the somewhat overblown slowdown fears, since we haven't seen any sales growth data from analysts for June/July yet.",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lg7e3t5/",
              "created": 1722633798,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgtn93d",
              "score": 1,
              "body": "Looks like they posted a good quarter. Beat expectations solidly, optimistic about market share recapture.\n\nI especially liked their gross margins, I think the market is overlooking these. 52% versus market and management's own expectations of high 40s. Only $5 mil growth pulled in from international markets but SKUs selling per store increased from 15 to 20. Also liked the fact that they briefly lost market share to Monster on Amazon at the end of the quarter (19.7%) but it soared back to 22.1% 3 weeks later, higher than 20.2% at the end of Q1. Consumer demand is evidently still very strong. What are your thoughts now?",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lgtn93d/",
              "created": 1722973307,
              "depth": 2,
              "replies": [
                {
                  "id": "lguo1sk",
                  "score": 2,
                  "body": "Unchanged.",
                  "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lguo1sk/",
                  "created": 1722985197,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lg5508d",
      "score": 1,
      "body": "Red bull is for everyone. Period. Monster though, I don’t think I’ve ever seen a white female drink this before. In my culture, if I were to see a woman drinking this I would immediately think she’s either autistic or feral druggieeeeeee. Celsius though, all flavours in mind, I feel and taste fruit and health and power. Goddess.",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lg5508d/",
      "created": 1722607683,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgr09or",
      "score": 1,
      "body": "HOW BOUT THEMMMM EARNING$$$$$$$$$$$$$$$$$$$$$$",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lgr09or/",
      "created": 1722939938,
      "depth": 0,
      "replies": [
        {
          "id": "lgunyj5",
          "score": 1,
          "body": "I don't know, you tell me. I am not that focused on the short-term earnings reports when I'm looking into the long-term potential of a company.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lgunyj5/",
          "created": 1722985164,
          "depth": 1,
          "replies": [
            {
              "id": "lgurh72",
              "score": 1,
              "body": "Earnings were nice...very nice. Now the call and put strategy we saw today was also very well orchestrated.....left everyone saying WTF that's for sure",
              "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lgurh72/",
              "created": 1722986417,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "llhqfip",
      "score": 1,
      "body": "Just found this thread, I'm curious if you are updating your thesis or positioning in the company (if any) at 52 week lows of \\~$34.00/share?",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/llhqfip/",
      "created": 1725468752,
      "depth": 0,
      "replies": [
        {
          "id": "llj0gyp",
          "score": 1,
          "body": "Hi there,\n\n  \nThe change in price has no impact on my thesis.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/llj0gyp/",
          "created": 1725483549,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcvnkdn",
      "score": 1,
      "body": "who's still buying that garbage in a can",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcvnkdn/",
      "created": 1720810841,
      "depth": 0,
      "replies": [
        {
          "id": "lcxjp6t",
          "score": 1,
          "body": "Me! The Peach Mango is awesome ",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcxjp6t/",
          "created": 1720836065,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcto2kc",
      "score": -2,
      "body": "Alani Nu is way better",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcto2kc/",
      "created": 1720786434,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcu3rnz",
      "score": -1,
      "body": "As a daily energy drink user for years, Celsius is definitely not the superior product in my opinion. This is based off taste. Perhaps it’s a beginner drink like Redbull. The similarity to sparkling water could attract people that are already familiar with that. But I’m also a sparkling water drinker and Celsius just doesn’t taste good enough for me. When I drink an energy drink I want something more soda-like that has a richer flavor. While Celsius compared to other top brands will always seem watered down.\nSure Celsius will be successful but definitely won’t dethrone Monster.",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcu3rnz/",
      "created": 1720792640,
      "depth": 0,
      "replies": [
        {
          "id": "lczo404",
          "score": 2,
          "body": "I can smell this post",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lczo404/",
          "created": 1720879038,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcu82yp",
          "score": 1,
          "body": "The mandarin Marshmallow is the best flavor of any energy drink right now imo",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lcu82yp/",
          "created": 1720794151,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lctaxkb",
      "score": -4,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctaxkb/",
      "created": 1720779450,
      "depth": 0,
      "replies": [
        {
          "id": "lctbwa9",
          "score": 7,
          "body": "Disclaimer: I have no position in Celsius. I understand that energy drinks have a certain reputation, and I do think it is deserved. I use Reddit and all the other platforms to share my research, get feedback, and improve my communication skills over time.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctbwa9/",
          "created": 1720780054,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lctlp3p",
      "score": -1,
      "body": "Gah at a 200% profit?",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctlp3p/",
      "created": 1720785327,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lctbn4h",
      "score": -14,
      "body": "Too long to read. Im in.",
      "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctbn4h/",
      "created": 1720779893,
      "depth": 0,
      "replies": [
        {
          "id": "lctbyc4",
          "score": 17,
          "body": "Sir, this is not wallstreetbets.",
          "permalink": "/r/stocks/comments/1e1e12r/deep_dive_into_celsius_celh_is_it_becoming/lctbyc4/",
          "created": 1720780090,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}