{
  "title": "Quantum Computing Stocks for long position?",
  "score": 88,
  "selftext": "Talking to a former quant who now owns a clearing house said that while NVIDIA hype is here to stay. Quant computing will be something to watch out for after the NVIDIA hype dies down. Any companies to watch out for?",
  "link_flair_text": "Industry Question",
  "id": "1e1k59w",
  "num_comments": 107,
  "created_utc": 1720797292,
  "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/",
  "comments": [
    {
      "id": "lcuufp3",
      "score": 51,
      "body": "IONQ for a pure play.\nQTUM ETF for the sector.",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcuufp3/",
      "created": 1720801434,
      "depth": 0,
      "replies": [
        {
          "id": "lcxq962",
          "score": 9,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcxq962/",
          "created": 1720838935,
          "depth": 1,
          "replies": [
            {
              "id": "ld4yfqt",
              "score": 3,
              "body": "RGTI🥂",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ld4yfqt/",
              "created": 1720964412,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ld6g0qb",
              "score": 2,
              "body": "I closed most of my position with RGTI after I read this - [Oxford Ionics Reports Chips Break Global Quantum Performance Records (thequantuminsider.com)](https://thequantuminsider.com/2024/07/11/oxford-ionics-reports-chips-break-global-quantum-performance-records/).",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ld6g0qb/",
              "created": 1720983355,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcuidjj",
      "score": 51,
      "body": "Ionq",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcuidjj/",
      "created": 1720797560,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcv8qh1",
      "score": 49,
      "body": "Terrible idea because it's so immature yet both on the technology but the business use cases that make return on investments. Investing this soon is dumb for multiple reasons.  (I'm using D-Wave as an example not as an actual issue). \n\n* The first is that at any point one of the major players can come out with something revolutionary that none of the other can do. \n* Then you have strategic partnerships on who will partner on both a technolgoy alliance but a business alliance\n* Who discovers use cases for it - there are no massive ROI Quantum Computing tasks out there yet for the average business to monetize \n* The lead can quickly change so fast that one stock like D-Wave was seen as the defacto player, now all of a sudden you have all the tech giants building their own \n* Buyouts are going to be non-existent just yet, there is a world where D-Wave doesn't have funding to keep going, the other giants have as much if not more technology. Take an SAP or Oracle who don't seem to have quantum computer divisions we know about, Oracle may make an offer substantially lower but they will have to pump $1B into them that they will eventually match what Google, IBM, Microsoft have been accomplishing. \n* The technology will eventually transform from what computers were when they took up entire buidlings to something you have at home, to bet on who eventually makes that happen is so far out its near impossible to see (yes I know the skeptics are going to say you need to be near absolute zero in temperature for it to work, but once upon a time you needed vacuum tubes and punch cards to operate a computer the size of my apartment)\n\nThe only people who are going to get money betting this early are the VC's because they are buying in at SUCH low prices, they are bound to make money on a terrible buyout/merger. The average investor will never get the returns and you can't pick something like Google or IBM who are leading the charge as you are buying into their overall business not a sector of it. \n\n  \nTrying to bet this early on in the race is literally just throwing a dart at one of the companies names and hoping for the best.",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcv8qh1/",
      "created": 1720806013,
      "depth": 0,
      "replies": [
        {
          "id": "lczohuz",
          "score": 10,
          "body": "As someone with a tech background, I feel like people investing in this right now are foolish. People just want to watch the next big hype wave but they have no idea what they're investing in.\n\nWhat is the actual use case? What problem can quantum computers solve that current computers can't? Do you have any proof of concept that you can point to where a quantum computer is outperforming a classical computer at a useful task? No? Then you probably shouldn't throw your money at this.\n\nYou seriously shouldn't invest in a technology you don't understand with dubious promises.",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lczohuz/",
          "created": 1720879196,
          "depth": 1,
          "replies": [
            {
              "id": "lsee294",
              "score": 3,
              "body": "eh, idk, I'm studying quantum computing right now, and your right, but you left out the entire argument FOR computing. classical computing is only a subset of what general computing is, its a massive simplification with a lot of inefficiencies.\n\nIn the pure theory, there is nothing that a quantum computer can do that a classical computer can't. HOWEVER, in certain problems, a quantum computer is exponentially faster. It is the efficiency gain that people care about.\n\nYou might think thats useless bc its only certain problems, but thats EXACTLY what the GPU is, take look at nvidia... In a very big nutshell, quantum computing is like a GPU but on steroids.\n\nQuantum computing will happen, its the next logical step in computing. and when it does happen, it will be a massive leap in compute power. \n\nbuying specific stocks as an investment is generally a bad idea, but a quantum computing ETF is a really great idea, especially for long term investment. The value of quantum computing won't just sky rocket from 0 over night when the first consumer quantum chip comes out, the value will gradually go up as there is more and more viability, in it. even if its not practical in the next 10 years, the value of it will still go up because we are closer to it than we were 10 years ago.\n\nIDK, thats my, long winded take on it lol. I've been debating on investing for a while now.",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lsee294/",
              "created": 1729188144,
              "depth": 2,
              "replies": [
                {
                  "id": "lsg0f2n",
                  "score": 1,
                  "body": "You still haven't outlined a single use case.",
                  "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lsg0f2n/",
                  "created": 1729207655,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lsg40w9",
                      "score": 3,
                      "body": "I did, either you did not read or you don't know anything about computing or computing theory.\n\nIn a very big nutshell, you can think of it as \"infinite\" parallelism, like the explosion in AI because of the massive parallelization that GPU's offer. you want a use case, how about machine learning, with a QC learning algorithm, it would launch us lightyears into the future.",
                      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lsg40w9/",
                      "created": 1729208991,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "luhm79v",
              "score": 0,
              "body": "I do not think you have researched thoroughly on the use cases of qcompute. There are plenty of use cases if you google them, one of them being encryption, which qcompute can do it in an instant as compared to classical computing. In the field of medicine, qcompute can be use to simulate behaviour on a molecular level, which classical computers will take ages. These are just top off my head. If there were no use cases then conpanies like honeywell will not build one. Recently a consortium of smaller semiconductor companies built a qcomputer in Germany. Search for 'NXP quantum compute'",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/luhm79v/",
              "created": 1730275467,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lcx9dds",
          "score": 2,
          "body": "Exactly my thoughts. Which is why I'm DCAing into QUTM ETF with a small position in IONQ.",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcx9dds/",
          "created": 1720831759,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcuimmh",
      "score": 60,
      "body": "GOOGL is actually surprisingly ahead in this field. Look at their supercomputer research they are doing.",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcuimmh/",
      "created": 1720797640,
      "depth": 0,
      "replies": [
        {
          "id": "lcwx8b8",
          "score": 8,
          "body": "Yes!  Google Quantum AI is in Santa Barbara.  They are expanding and hiring.",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcwx8b8/",
          "created": 1720826910,
          "depth": 1,
          "replies": [
            {
              "id": "lwaaobr",
              "score": 1,
              "body": "This is exactly what needs to be regulated heavily!  We don't even understand our regular computing Ai.   And that's not a facetious statement!   WE DO NOT FULLY UNDERSTAND THE CURRENT AI MODLES AND HOW THEY ARE EVOLVING THEIR OWN WAYS OF LEARNING!      \n\nWe also don't fully understand the very thing that Ai is being molded after.   We are attempting to engineer a  digital human brain.  Yet we lack the indepth knowledge of how our biological ones function.    So right out of the gate, one could argue that it's a bad idea.  \n\nBut whatever..   Ai as it is, even as scary fast as it's evolving,   isn't yet inherently dangerous to our existence.   Yet!  \n\nIt's already smarter than anyone who has ever lived or ever will live. It retains the entire catalog of human experience.    That's been documented at least. It's the sum of all the shared, compiled knowledge of the human race as it stands.  \n\nPlus it can scan vast Dada sets and seek out patterns and make very accurate predictions based on probability.   And it does so in seconds.  \n\nBut on a regular computer.  It's restricted by the inputs and or coding that we implement.   \n\nIt's extremely smart and fast but within the confines of the coded box if you will.  \n\n\nNow if you add Quantom computing to that equation.   You introduce the ability to transend dimensions.   And not just see all the known answers that have ever been documented.  And not only compound data and find probabilities and make great educated guesses.  As it can know.  \n\nBut it will be able to try evey possible combination of variables , simultaneously and find the answers to questions that have never been asked.  It will be able to not just predict futer probability but to see what the most probable thing looks like and how it would play out.  Using superposition to pose all possibilities at once .  \n\nThink about that!   I'd you asked it to find a drug that will restrict the protein that causes lymphoma.   It will run evey combinations of chemical compounds in evey possible manner not one after another.  But all at the same time !  And come back with 1000 years' worth of trial and error.  And the combination or combinations  that worked the best.  Or cured the problem.    \n\nNow you can use any set of Data in any field and it will be able to do this.  If Quantom Ai is figured out.  \n\nWhy on earth would you wanna release something that's nothing short of a GOD.  It will by thousands of times smarter than all of us combined.  And it will be able to seemingly defy the laws of physics by using those very same laws.   It will be able to pop.in and out of existence.  Between different dimensions.   And instantly control anything from any distance away instantly.   It will be able to tell apart and be in multiple places at once.  It will be able to do all the crazy shit it wants by utilizing quantom mechanics.  And it's energy so it can never be destroyed.   \n\nWhy the hell would they want to mess around with something so incredibly dangerous that they don't even fully understand.  They actually don't even understand the thing that they are attempting to design it after.  \n\n\nHow stupid are these smart people?  Oh well actually there not stupid .   They're just greedy and chasing that damn dollar bill!\n\nIt's just completely reckless! Smh...",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lwaaobr/",
              "created": 1731176812,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lcuzzl4",
          "score": 7,
          "body": "I second this.",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcuzzl4/",
          "created": 1720803212,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcvidaf",
          "score": 4,
          "body": "I tought IBM was ahead in this field? Am I wrong? Anyway I can live with Google, it's à good company.",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcvidaf/",
          "created": 1720809137,
          "depth": 1,
          "replies": [
            {
              "id": "lcx9krh",
              "score": 3,
              "body": "This is why I put more money into GOOG and IBM.",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcx9krh/",
              "created": 1720831843,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcxilqa",
              "score": 3,
              "body": "Me too, and Google behind IBM but with more tons of money",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcxilqa/",
              "created": 1720835609,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcy4skr",
              "score": 4,
              "body": "Invest in IBM if you hate money. Easily one of the most poorly run tech companies of the last couple of decades.",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcy4skr/",
              "created": 1720846030,
              "depth": 2,
              "replies": [
                {
                  "id": "lcyrxp1",
                  "score": 0,
                  "body": "Welp they’ve made me nearly 80% gains in the last yr.",
                  "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcyrxp1/",
                  "created": 1720860902,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lczm97u",
                      "score": 2,
                      "body": "One year returns are around 30% according to graphs, but in any case the 10 year returns on IBM are near zero. I know multiple people who worked there and they told me that management was doing everything possible to push out any long term employees (3+ years) and they had entire teams staffed by interns (coop students). There's just no way that a company run like that can produce anything of value in the long run.",
                      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lczm97u/",
                      "created": 1720878265,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ld7cbna",
                      "score": 1,
                      "body": "The only way you made that was either through options or nailing the day trades",
                      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ld7cbna/",
                      "created": 1720995113,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ld7vliw",
                          "score": 1,
                          "body": "4 trades in the last 500 days. No options.",
                          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ld7vliw/",
                          "created": 1721002565,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ld80fj6",
                              "score": 1,
                              "body": "I guess you bought and sold at the right times",
                              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ld80fj6/",
                              "created": 1721004494,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ld05hkf",
              "score": 1,
              "body": "IBM and Google are the clear plays. IBM is ahead in it's refrigeration technology.",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ld05hkf/",
              "created": 1720885619,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ld7c3th",
              "score": 1,
              "body": "IBM is always ahead, stumbles, and then falls behind",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ld7c3th/",
              "created": 1720995033,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ld9z7yu",
              "score": 1,
              "body": "I work for a company that works with IBM, they're a sinking ship, if you have any shares in IBM get them out ASAP.",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ld9z7yu/",
              "created": 1721043776,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcv0ia0",
      "score": 22,
      "body": "I've come to the conclusion that quantum computing is like cold fusion. It's always right around the corner, but never actually arrives. It's been decades now.",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcv0ia0/",
      "created": 1720803375,
      "depth": 0,
      "replies": [
        {
          "id": "lcxa18y",
          "score": 5,
          "body": "If you talk to researchers they'll tell you that Quantum Computers are NOT around the corners. Number of qubits are steadily increasing and it could be about 20 years when we start getting fully usable computers (not sure if anyone what \"usable\" is tho lol).\n\nAlso, unlike cold fusion we already have quantum computers but they are still small numbers of qubits. Unfortunately it could be that physics eventually limits us and commercial quantum computers are not possible. But that's a risk and exactly why there's chance for massive returns. If there was no risk everyone would have invested already.",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcxa18y/",
          "created": 1720832033,
          "depth": 1,
          "replies": [
            {
              "id": "lkchdds",
              "score": 1,
              "body": "I don't think we'll ever see a consumer grade quantum PC. It's a bit like flying cars. Sure it's a fun concept to believe in but the requirements to make it a reality just say no.",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lkchdds/",
              "created": 1724855454,
              "depth": 2,
              "replies": [
                {
                  "id": "lkcj749",
                  "score": 2,
                  "body": "We don't need consumer grade PC tho. I mean we don't have consumer grade fighter jets but doesn't mean that US govt isn't spending trillions on companies producing them.  And no one spent money developing flying cars - no top 10 unis worked on it. Quantum Computing is getting funding from all sources from US govt to Goldman Sachs. Every single Physics department across the world are working on it. My undergrad in India had people working on it and my grad school in US has several people working on it. \n\nFinally - there's of course a risk that this won't work out. But that's exactly why there's opportunity to make money. If it was certain to work - all hedge funds in the world would have jacked up the prices before retail even knew.",
                  "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lkcj749/",
                  "created": 1724856028,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkckmry",
                      "score": 1,
                      "body": "I wasn't really speaking about the potential to make a profit on it. I was going on about the reality of it happening. The same could be said about cold fusion, tbh. The amount of money that has went into that technology since the 40s is insane and here we are. No closer to a functional model^(that works for more than a few seconds) than we were then.",
                      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lkckmry/",
                      "created": 1724856474,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkcnbd0",
                          "score": 1,
                          "body": "Yes true but that is research. It is an exploration and some time you return empty handed. But if it works - the returns are orders of magnitude greater than what we put in.\n\nIn theoretical physics we have string theory - it was supposed to be one single theory to explain everything and that went nowhere. But in 1900s Einstein tried to explain all of the cosmos with one theory and we got general relativity.\n\nSame thing can happen with AGI or it may not happen. Just 20 years back no one thought AIs capable of text and image analysis were possible and today we are creating videos from text input. For all we know, we might stagnate here.\n\nAnother example from video game/graphic card industry. Just 5-10 years back no one that Path Tracing was possible but in 2023 we got Cyberpunk 2077 - an open world game with real time path tracing thanks to advances by chip industry and video game research. There's video by Digital Foundry on it.\n\nUnfortuantely, that's resaerch. Things may work - things may not work.",
                          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lkcnbd0/",
                          "created": 1724857298,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lkcoo2u",
                              "score": 1,
                              "body": "I'm not trying to argue here I value your opinion and knowledge. But none of those things have or had the physical restraints and complications of quantum computing. AI and path tracing are both just code.",
                              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lkcoo2u/",
                              "created": 1724857715,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lcyd4n3",
          "score": 3,
          "body": "It's actually 5 years away and has been for decades.",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcyd4n3/",
          "created": 1720850926,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcvi4re",
          "score": 1,
          "body": "Nobody's ever said cold fusion is right around the corner. \n\nA Tesla FSD car. Quantum computing's like an FSD car.",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcvi4re/",
          "created": 1720809061,
          "depth": 1,
          "replies": [
            {
              "id": "lkci94k",
              "score": 1,
              "body": "> Nobody's ever said cold fusion is right around the corner.\n\nhttps://news.illinois.edu/view/6367/298834\n\nhttps://time.com/7609/nuclear-fusion-experiment/\n\nhttps://content.time.com/time/subscriber/article/0,33009,810076,00.html\n\nThey've been saying for for literally 70 years.\n\n>Quantum computing's like an FSD car.\n\nIt's not. Quantum computing is like...... cold fusion lol.",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lkci94k/",
              "created": 1724855734,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lcw51u3",
          "score": 1,
          "body": "Well, researchers have been writing programs for quantum computers for some time now. Unlike cold fusion, quantum computing is there, it's being used for some high-level stuff, but it isn't going to hit the consumer market any time soon. ",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcw51u3/",
          "created": 1720816658,
          "depth": 1,
          "replies": [
            {
              "id": "lcwhg86",
              "score": 1,
              "body": "Exactly. You can even learn and program in Q# which is like C# but for quantum computers (of course). Cryptography is where QC will really come to shine since they can break our normal means of cryptograph pretty quickly and also create unbreakable ones using a lattice structure.",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcwhg86/",
              "created": 1720820952,
              "depth": 2,
              "replies": [
                {
                  "id": "lcy5tei",
                  "score": 1,
                  "body": ">Cryptography is where QC will really come to shine since they can break our normal means of cryptograph pretty quickly and also create unbreakable ones using a lattice structure.\n\nSmall note:\n\nLattice-based cryptography is done on classical computers. Once PQC is widely adopted, Quantum Computers will realistically only be relevant to cryptography in harvest now, decrypt later attacks (unless there is a breakthrough that reduces the security of the cryptographic algorithms we currently believe are quantum resistant).",
                  "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcy5tei/",
                  "created": 1720846593,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcz2wrg",
                      "score": 1,
                      "body": "correct, I should have been more clear. Thank you.",
                      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcz2wrg/",
                      "created": 1720868516,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcv0y9x",
      "score": 11,
      "body": "QBTS \n\nIt’s only down 88% in the last 2 years…",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcv0y9x/",
      "created": 1720803514,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcukcqy",
      "score": 19,
      "body": "I have a few hundred shares of IONQ.  Quantum computing is really in such infancy that it's kind of a hype trade at the point, tbh.  Imo, it's far too early to determine any winners or losers.  The big boys like GOOGL, AMZN, MSFT, etc are obviously involved in quantum but, if you're looking for a pure play in quantum, it's really more betting that people will get excited about it vs betting that anything real will come of it in the short term.",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcukcqy/",
      "created": 1720798195,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcumgwj",
      "score": 18,
      "body": "Try **qtum** etf. Not clear who the major players will be.  I have it since 2023.  It may exceeed AI eventually.",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcumgwj/",
      "created": 1720798879,
      "depth": 0,
      "replies": [
        {
          "id": "lcvejy7",
          "score": 1,
          "body": "I held QTUM for about a year and got a nice return. I'm only moving out of it over time because I'm gravitating toward more general indexes at this point, which is a me thing. Not a bad pick at all.",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcvejy7/",
          "created": 1720807894,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcyqd9g",
          "score": 1,
          "body": "I'm concerned that it is focused on:\n\n\"The index consists of a modified equal-weighted portfolio of the stock of companies that derive at least 50% of their annual revenue or operating activity from the development of quantum computing and machine learning technology.\"\n\nIn such case the significant part of the holdings may be related to the 'traditional' machine learning but not quantum computing.",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcyqd9g/",
          "created": 1720859807,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ld1k7pa",
      "score": 8,
      "body": "RGTI 🤫🤫",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ld1k7pa/",
      "created": 1720904111,
      "depth": 0,
      "replies": [
        {
          "id": "lmcv57f",
          "score": 3,
          "body": "Buyout",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lmcv57f/",
          "created": 1725924610,
          "depth": 1,
          "replies": [
            {
              "id": "lueaa4w",
              "score": 1,
              "body": "Nvidia?",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lueaa4w/",
              "created": 1730228940,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lculd8p",
      "score": 13,
      "body": "I would only put GOOGL at this point, IBM maybe",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lculd8p/",
      "created": 1720798524,
      "depth": 0,
      "replies": [
        {
          "id": "lcvia5k",
          "score": 3,
          "body": "Why GOOGL over GOOG?",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcvia5k/",
          "created": 1720809109,
          "depth": 1,
          "replies": [
            {
              "id": "lcw47al",
              "score": 2,
              "body": "GOOGL has voting rights, GOOG does not.",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcw47al/",
              "created": 1720816374,
              "depth": 2,
              "replies": [
                {
                  "id": "lczjvln",
                  "score": 2,
                  "body": "GOOG is cheaper, GOOGL offers voting rights but you won't make an impact if you don't carry heavy stock?",
                  "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lczjvln/",
                  "created": 1720877237,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcvkpey",
              "score": 1,
              "body": "Their really the same, I'd still want voting shares over not",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcvkpey/",
              "created": 1720809902,
              "depth": 2,
              "replies": [
                {
                  "id": "lcvkwnn",
                  "score": 2,
                  "body": "Ah ok was curious bc every comment in this post mentions GOOGL when usually I see just GOOG",
                  "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcvkwnn/",
                  "created": 1720809968,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcwj2i4",
                      "score": 2,
                      "body": "Type A versus type C.",
                      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcwj2i4/",
                      "created": 1720821540,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcvy56f",
      "score": 5,
      "body": "Rigetti is the purest quantum play. Working with Nvidia as well $rgti $nvda",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcvy56f/",
      "created": 1720814359,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcx0ecb",
      "score": 3,
      "body": "I’m surprised no one has mentioned HON",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcx0ecb/",
      "created": 1720828140,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ld3wrjo",
      "score": 3,
      "body": "Lithium and uranium.....thank me laterz",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ld3wrjo/",
      "created": 1720941950,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcumiwt",
      "score": 2,
      "body": "Formfactor",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcumiwt/",
      "created": 1720798896,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcv96y0",
      "score": 2,
      "body": "I own a lot of Google and they would be my pick but not exactly under the radar lol",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcv96y0/",
      "created": 1720806161,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcvccc6",
      "score": 2,
      "body": "theres more money in protecting against the threat of quantum computers than there is in making and selling them. look into quantum emotion (qnc.v) they have a chip that samples quantum randomness for quantum safe encryption.",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcvccc6/",
      "created": 1720807173,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcvy1k3",
      "score": 2,
      "body": "QBTS",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcvy1k3/",
      "created": 1720814325,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxzxgn",
      "score": 2,
      "body": "I’m looking at IONQ their projected revenue 4 quarters out is expected to go up with next earnings coming soon. Revenue is everything right now since the tech is so early imo.",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcxzxgn/",
      "created": 1720843506,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcyryt7",
      "score": 2,
      "body": "This will get hate, but IBM.",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcyryt7/",
      "created": 1720860925,
      "depth": 0,
      "replies": [
        {
          "id": "ld06f8u",
          "score": 2,
          "body": "It shouldn't. If people spend even 3 minutes doing research on QC it will be obvious that IBM is one of the key leaders, if not *the* leader.",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ld06f8u/",
          "created": 1720885958,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcytx2z",
      "score": 2,
      "body": "Just hold MAG7, They will use quantum computing to pump themselves when the time comes.",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcytx2z/",
      "created": 1720862309,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lczmvn8",
      "score": 2,
      "body": "that is for the DISTANT FUTURE.\n\ndo any of these companies make money yet?  Have any big revenues?",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lczmvn8/",
      "created": 1720878527,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ld0ccin",
      "score": 2,
      "body": "Quantum computing is where AI was twenty years ago. It’s way, way too early for retail investors",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ld0ccin/",
      "created": 1720888105,
      "depth": 0,
      "replies": [
        {
          "id": "luted8v",
          "score": 1,
          "body": "Its a segment  for institutional investors or average joe investors who are willing to wait. Buy thousands of shares cheap and hope it hits at least 10 dollars per share in 5 years. \n\nRetail investors can't sit still. \n\nPure QC is not the right/profitable play imo. The player that can enhance AI with the integration/boost from QC will win. QC commercial systems that can operate at room temp and run on low power will win.",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/luted8v/",
          "created": 1730439282,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ld10oay",
      "score": 2,
      "body": "Can someone help me understand is quantum computing the next step in the advancement of computing compared to General Artificial Intelligence (which I’m hearing is still about 5 years away?)",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ld10oay/",
      "created": 1720896900,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ld6gx13",
      "score": 2,
      "body": "I'd wait if I were y'all - [Oxford Ionics Reports Chips Break Global Quantum Performance Records  (thequantuminsider.com)](https://thequantuminsider.com/2024/07/11/oxford-ionics-reports-chips-break-global-quantum-performance-records/)",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ld6gx13/",
      "created": 1720983661,
      "depth": 0,
      "replies": [
        {
          "id": "ltjsv6z",
          "score": 1,
          "body": "why. I dont get the relation with the article :)",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ltjsv6z/",
          "created": 1729792698,
          "depth": 1,
          "replies": [
            {
              "id": "ltmfhsk",
              "score": 2,
              "body": "There's a lot of quantum tech that's coming out with less temp. requirements.  The cooling on most quantum foundry setups is expensive.  There are a couple that're damn close with the \"old\" rigs to achieve 95+% fidelity already.  Some are \\~98% at 2qbit.  The accuracy is paramount currently.  IP (intellectual property) is also HUGE with those startups.  The race is warmer (physically) and accurate (mathematically).  I've been holding Rigetti for a year now.  Insiders CLEARLY know something I don't too.  They've recently popped 53+% in one month.",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ltmfhsk/",
              "created": 1729824217,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "llgu18c",
      "score": 2,
      "body": "Everyone here is stuck on the consumer market and how far out QC are on a consumer basis. \n\nIdk if they will ever be even allowed to be owned by the general population.  They are far to dangerous!  \n\nI look at QC as a weapon or defense mechanism . \n\nIt's a race similar to that of the nuclear arms race .  He who control the tech will hold the power. That means there will be endless funding  and huge positions of power investing in the tech. \n\nAlso what is evehone talking about with them being so weak at the moment .  Talking about 20 cubits and shit?  What?  \n\nTry closer to 500 cubits or likely more at the moment .  \n\nIt's like alot peopel commenting don't really understand what a QC is or how it works .  Or basically doesn't understand quantom physics very well. \n\nI Mean at the level a QC is functioning.   Using superposition and entanglement phenomenon it's truely 4th dimension stuff. It could transform Ai into a God . \n\nIt can break all current encryption.  Think about how dangerous that is. It can hack any military facility on the planet. Andy bank. And block chain. Anything.  Not to mention find the answers to all the hardest questions.  Create cures for all kinds of illnesses.  And it can all this  in a matter of minutes.  Where as a regular comp would take 10 plus years running 24/7 to do what a current 250cub QC can solve in like 2 min.  \n\n\nSo he amount of time that they have the ability to save is priceless.   And if we don't master rhe tech first then someone els will.   And that would catastrophic.   So idk 🤷‍♀️.  Kinda seems valuable to Me. \n\n\nAlso for the record we just succeeded at making a fusion reactor using a bunch of lazers focused into an single point  . We literally have created a minimum start.  In lab and it's not just a poof it's gone situation.  It's a sustained reaction .  So for all the talk about fusion reactors not being possible ot whatever.   Your wrong.  \n\nIt will likely be whats going to power the AI demands in the futer.",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/llgu18c/",
      "created": 1725458171,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcv2r2f",
      "score": 2,
      "body": "Google, IBM, Honeywell",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcv2r2f/",
      "created": 1720804092,
      "depth": 0,
      "replies": [
        {
          "id": "lcv5ue0",
          "score": 2,
          "body": "how is honeywell active in the quantum field? just solely as a parts manufacturer or actually developing quantum computing?",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcv5ue0/",
          "created": 1720805086,
          "depth": 1,
          "replies": [
            {
              "id": "lcv9c4s",
              "score": 0,
              "body": "From what I understand development! \n\nI heard Dr. Michio kaku talking about it",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcv9c4s/",
              "created": 1720806206,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcuqg5m",
      "score": 2,
      "body": "Nvidia is very involved in QC, but check out ionQ",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcuqg5m/",
      "created": 1720800151,
      "depth": 0,
      "replies": [
        {
          "id": "lueaguj",
          "score": 1,
          "body": "Aren’t Nvidia working with Rigetti ?",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lueaguj/",
          "created": 1730228996,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcuubvb",
      "score": 2,
      "body": "IBM is investing hundreds of millions into Quantum. Out of all the big tech companies they seem to be taking it the most seriously. These small companies like IonQ, D-Wave, Rigetti are a waste of time. They make no profit and are losing hundreds of millions of dollars on just research. They will never make that back.",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcuubvb/",
      "created": 1720801400,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcvaunt",
      "score": 1,
      "body": "IBM? They are into quantum computing much but I don’t if that company is not too monolithic and obsolete on fundamentals",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcvaunt/",
      "created": 1720806694,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcw4zcs",
      "score": 1,
      "body": "The time horizon is too far for it to be a solid investment. It's at the stage where funding should come from universities/research grants. Any of the companies now will just dilute you assuming they even survive the 10+ years needed to see results.\n\nYou should also read up on the applications of QQ. It's not literally faster processors for traditional problems/Moore's law. Imo people who are hoping to find the next Nvidia are looking in the wrong place in QQ and trying to put the cart before the horse.",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcw4zcs/",
      "created": 1720816634,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwi68x",
      "score": 1,
      "body": "long googl amzn nvidia and tsmc",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcwi68x/",
      "created": 1720821213,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcx93sd",
      "score": 1,
      "body": "I'm in IONQ which is probably the most popular pure quantum startup. However there are a LOT of players in quantum computing. I mean it goes from Intel, IBM, Google to Goldman Sachs, Amazon and the research institutions such Hokins JPL, national labs. And there are several different techniques being tried, and no one knows which will work the best - it is working with fundamental physics. Because of this I have started DCA into QUTM ETF, instead of trying to pick out a winner.",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcx93sd/",
      "created": 1720831649,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcy1q3w",
      "score": 1,
      "body": "ionq",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcy1q3w/",
      "created": 1720844419,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcykctz",
      "score": 1,
      "body": "tbh my \\*hope\\* was that Nvidia really truly makes this work, becomes a powerhouse, and is on the front lines of the quantum computing revolution\n\nit's one reason I bought in at 1,150, I have faith that they will be involved in the \\*next\\* hype cycle, and the one after that\n\nit may start slow enough that people are willing to sell to them if the price is right? Just because I see quantum as having very little use, until suddenly it's good enough to do mind bending things that change humanity as we know it\n\nI know more about tech than investing though, and am not very educated on physics, so take that \\*all\\* with a grain of salt!",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcykctz/",
      "created": 1720855634,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ld079x2",
      "score": 1,
      "body": "We all think our niche is the most important aspect of our trading success.  Ask someone with a broader view of the market.",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ld079x2/",
      "created": 1720886264,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ld2ayd5",
      "score": 1,
      "body": "Not sure if they will be massively used as there are net security concerns with regards to passwords etc",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ld2ayd5/",
      "created": 1720914185,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ld2wlge",
      "score": 1,
      "body": "Laes",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ld2wlge/",
      "created": 1720923546,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp2kmvs",
      "score": 1,
      "body": "Silly silly 4x government doe coming",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lp2kmvs/",
      "created": 1727379656,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lttp0y7",
      "score": 1,
      "body": "I'd say it's never too early to get in the big dawgs too early. I have starting positions in the following:\n\nIONQ\nRGTI\nQTUM\nQBTS\n\nAnd yes, I like them in that order lol",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lttp0y7/",
      "created": 1729933988,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcuitlg",
      "score": 1,
      "body": "[https://en.wikipedia.org/wiki/List\\_of\\_companies\\_involved\\_in\\_quantum\\_computing\\_or\\_communication](https://en.wikipedia.org/wiki/List_of_companies_involved_in_quantum_computing_or_communication)",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcuitlg/",
      "created": 1720797703,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcyfe95",
      "score": 1,
      "body": "Don't waste your time it's way far from becoming anything, if ever honestly. In fact it's more likely that there will be something else that comes and is adding practical value before quantum computing ever does. Obviously NVDA has been in focus the last couple of years, but if you're in tech and really plugged in with the developments of technology (meaning technological advances not just new commercial use cases), it was around 2016/2017 when people said wow NVDA introduced a new way of programming. Btw GPT1 was first released in 2018 and it was abolute junk but this is the nature of this paradigm of programming, if you can even call it that, it takes sometime to return good results. Anyways what i mean to say is that despite lack of early commercial success, it was clear to people in technology that there is something tangible here that can take hold. No one of the technologists, except with a handful die hards whose PhD is maybe in the topic, believes that Quantum Computing will materialize into anything meanigful anytime soon, there isn't even the slightest hints of it.",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcyfe95/",
      "created": 1720852355,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcyhofl",
      "score": 1,
      "body": "Google?",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcyhofl/",
      "created": 1720853836,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lculhs2",
      "score": 0,
      "body": "Commercial Quantum Computing is 40+ years away. Don't hold your breath",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lculhs2/",
      "created": 1720798565,
      "depth": 0,
      "replies": [
        {
          "id": "lcvga28",
          "score": 2,
          "body": "Another commenter compared it to cold fusion, and they're not wrong.",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcvga28/",
          "created": 1720808453,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcuui6l",
          "score": 0,
          "body": "False.",
          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcuui6l/",
          "created": 1720801456,
          "depth": 1,
          "replies": [
            {
              "id": "lcvddp6",
              "score": -1,
              "body": "Yupp, it’s never gonna happen at all :)\n\nThe people investing in quantum computing know next to nothing about it, it’s never gonna be used commercially.",
              "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcvddp6/",
              "created": 1720807511,
              "depth": 2,
              "replies": [
                {
                  "id": "lcxac25",
                  "score": 1,
                  "body": "Goldman Sachs is interested in quantum computing. If they are interested, you better believe that there's money to be made.\n\nAnd let's be real - national labs are working on QC. And we actually already have QC. But QC which are more efficient that normal computers are still away.",
                  "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcxac25/",
                  "created": 1720832158,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcyrr79",
                      "score": 1,
                      "body": "The things you can do with quantum computing aren’t the same as the things you can do with normal computers. They have very limited use cases. People are under the misconception that QC is just the same as regular computing but faster, when it’s really a different thing entirely.\n\nThere’s plenty of technologies that get investment without any commercial use, as an example the AI craze right now has turned out some useful products but we’ve yet to see big companies actually make them commercially profitable. QC has far fewer use cases than even that.",
                      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcyrr79/",
                      "created": 1720860775,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ld5nc59",
                          "score": 2,
                          "body": "That is exactly why returns can be higher. If QC was sure to work with good use cases then you can be sure that it would be gobbled up by billionaires before retail ever has a chance to jump in. Because it is risky there is room to make money (or lose money). I am doing PhD Physics in top 10 unis in US and I see some of the best minds in Physics working on it. It still may not work - but as a Physicist I'm betting on it.",
                          "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/ld5nc59/",
                          "created": 1720973590,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcva2yd",
      "score": 0,
      "body": "None at all.. It's all BS.",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcva2yd/",
      "created": 1720806445,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcvbqiq",
      "score": 0,
      "body": "All computing uses advanced mathematics. Quant is just a word.",
      "permalink": "/r/stocks/comments/1e1k59w/quantum_computing_stocks_for_long_position/lcvbqiq/",
      "created": 1720806977,
      "depth": 0,
      "replies": []
    }
  ]
}