{
  "title": "What will the affect of the wealth transfer of Boomer money to millennials over the next 20 years?",
  "score": 279,
  "selftext": "The amount of wealth share per generation is roughly as follows. Silent Generation - 11% of wealth/Boomers - 50% wealth/GenX - 30% and millennial - 9% of wealth.  So the silent money will quickly transfer to boomers as those folks are 90+. \n\nGiven that the millennials are strapped with more debt and higher costs of living. I would imagine a lot of that boomer money will be taken out of the market to cover debts. Will the market continue its growth in say 15-20 years or will we have heavy stagnation as the 2040s approach. The reason I ask is I’m planning to retire in 2043. I’m an older millennial and if everyone of a certain age group inherits a shitload of wealth at the same time frame how will that affect the price of stocks. I can imagine there being a significant sell off in the 2040s. \n\nWe did not really see that when silent money transferred to boomers but the level of wealth the older generation had is not comparable to what the boomer generation has. The boomers cost of living was also much less when they were our age. Keep in mind that silent generation didn’t also have Schwab and fidelity apps and as much trust or access to the stock market. It was put money in bonds and mutual funds and forget about it. You might visit your local Wells Fargo once a year to drop off a check. ",
  "link_flair_text": null,
  "id": "1e1q8q7",
  "num_comments": 404,
  "created_utc": 1720812471,
  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/",
  "comments": [
    {
      "id": "lcw2thk",
      "score": 582,
      "body": "Poor financial planning and assisted living facilities.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcw2thk/",
      "created": 1720815913,
      "depth": 0,
      "replies": [
        {
          "id": "lcwdhvh",
          "score": 88,
          "body": "So Medicaid clawback?",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwdhvh/",
          "created": 1720819552,
          "depth": 1,
          "replies": [
            {
              "id": "lcyjpel",
              "score": 59,
              "body": "We BEAT medicaid",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcyjpel/",
              "created": 1720855192,
              "depth": 2,
              "replies": [
                {
                  "id": "ld2f3ie",
                  "score": 2,
                  "body": "![gif](emote|free_emotes_pack|joy)",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/ld2f3ie/",
                  "created": 1720915804,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcyjqqs",
              "score": 75,
              "body": "My dad's $400K life insurance policy was supposed to take care of mom \"as long as she'd need.\" Except the nursing home is $110K/year.   \nOops, no inheritance for me.  Good thing I only spent a dozen years working on the family farm.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcyjqqs/",
              "created": 1720855217,
              "depth": 2,
              "replies": [
                {
                  "id": "lcz30yx",
                  "score": 39,
                  "body": "> My dad's $400K life insurance policy was supposed to take care of mom\n\nYou're not mentioned in there.",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcz30yx/",
                  "created": 1720868586,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcz4gt7",
                      "score": 46,
                      "body": "It was assumed mom might pass before dad (diabetes/obese), but of course dad had a heart attack and died a few years after retirement, long before his financial planning expected.  Of course that sent mom to assisted living, but due to mobility issues and medical needs, they were quick to bump that to full nursing home status and invoked that 7 year clawback period so assets couldn't be shuffled.   \nThe master plan was for dad's life insurance to cover mom's needs so that the farm land could be inherited between me and my sister.  We had both spent too many years helping dad on the farm while we had full time jobs and families of our own to raise.  It's not that we just expected to get it, we've both put in the work, but of course dad's rural financial planner didn't take into consideration mom might outlast the savings.   \nBut at least those nursing home investors can enjoy my inheritance- they've earned it, obviously. /s.   \nWhile the rest of mom's roommates at the nursing home are already broke and pay nothing due to Medicaid.   \nPlan for others stealing your stuff.  Get it in an irrevocable trust to keep what you've earned.",
                      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcz4gt7/",
                      "created": 1720869454,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ld01ty7",
                          "score": 19,
                          "body": "You mean the venture capitalists who probably bought and stripped that nursing home of everything good and left behind a rotting corpse of a company",
                          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/ld01ty7/",
                          "created": 1720884302,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lcxv3r6",
          "score": 13,
          "body": "Absolutely it will all go to the health insurance/health care complex.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxv3r6/",
          "created": 1720841163,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcw8299",
          "score": 58,
          "body": "That’s already a thing and won’t take all that wealth. For some it will . But that situation has existed for the better part of 30 years. 3 years in a nursing home already wrecks your portfolio.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcw8299/",
          "created": 1720817665,
          "depth": 1,
          "replies": [
            {
              "id": "lcwa4aq",
              "score": 113,
              "body": "Reverse mortgages, Boomer debt and spendthriftness will likely deplete much of the proposed wealth transfer. I am a regulatory attorney but have many colleagues in Trust and Estate planning and anything beyond families that were already wealthy and thus planned will likely be gone.\n\nAnecdotally, I’ve heard more than a few of my parents friends say that they planned to spend all of their money before they passes. I’ve actually seen it two times, which among my sample size with the older middle class is significant. Among my mother’s friends I also see a ton of people now in their mid-60s without pensions or any significant retirement savings. 5+ years of retirement, disability, or medical bills will likely deplete many of these people’s entire nest egg. The wealth transfer will be to corporations.\n\nAs an aside, if you are planning to retire in 2043, the majority of your money should be out of the market by your predicted timeline of 2040.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwa4aq/",
              "created": 1720818365,
              "depth": 2,
              "replies": [
                {
                  "id": "lcwyod7",
                  "score": 64,
                  "body": "MIL’s parents had a million dollar house paid in full. Inheritance was 80k after the home was sold for the nursing home. All that asset up in smoke so someone can live in a nursing home not know where they are or who they are. Pretty wild.",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwyod7/",
                  "created": 1720827468,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcx02rp",
                      "score": 65,
                      "body": "It’s wild in general that there are estate planners that can avoid that type of thing if you plan early. But, again anecdotally, Boomers don’t want to pay for it or for some reason imagine everything working well for them the rest of their life. \n\nI’m at attorney and my mother drafted her will on some website because she didn’t like my planning suggestions and confusion how she had no equity in a house paid for by inheritance from my step-dad’s parents passing. I have a general idea of how much she has left and I am inheriting nothing, despite her being an industry accountant for many years and my step-dad being an early computer programmer. In her early 60s and his 70s they used to host parties for all of their friends to try to show off how “big” their house was. My step-dad’s best friend of 50 years and him stopped talking over an argument about whose deck was nicer. They were both dead within 5 years and nobody cares about either deck. The priorities are so strange, I’m a firm believer that most generations are very similar but Boomer’s honestly just seem so wrapped up in consumerism and one upsmanship. ",
                      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx02rp/",
                      "created": 1720828013,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lcy1lbn",
                          "score": 19,
                          "body": "I have relatives who are going the reverse mortgage route because they blew almost all their retirement savings in 30 years on excessive spending. They have nothing to give their kids, nor do they want to.",
                          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcy1lbn/",
                          "created": 1720844352,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lcxbiy8",
                          "score": 15,
                          "body": "How do estate planners avoid that sort of thing?  I’m only early 40s so haven’t considered that much but want to get this taken care of in case.  Looking for any guidance as I don’t know what questions to ask.",
                          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxbiy8/",
                          "created": 1720832652,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lcxkzpz",
                              "score": 13,
                              "body": "Long term care insurance number one. But, a popular vehicle of the past was state dependent but it used to be to put all of your assets in an irrevocable trust at some point well before the 5 year look back of medicaid. But, with an irrevocable trust and you not being the trustee you “lose control” of the assets. I’m not an estate planner though so I’m sure there are other methods, possibly newer and better. But, a competent trust and estate attorney is step one and they should be the ones that are asking you the questions to determine what is best for your situation. ",
                              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxkzpz/",
                              "created": 1720836614,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lcxqjcq",
                                  "score": 2,
                                  "body": "Thank you!",
                                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxqjcq/",
                                  "created": 1720839060,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lcy2lrv",
                          "score": 11,
                          "body": "Estate planning is bullshit anyways and unfair. Either nursing homes should be publicly funded or they shouldn’t be. If they aren’t t and someone has assets then they should have to liquidate them to pay. The idea that someone who is wealthy early enough can hide their assets in a trust and someone who is farther behind might not get to do so and the latter gets annihilated by the nursing home and the former gets a ride while assets protected, it is complete bullshit.",
                          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcy2lrv/",
                          "created": 1720844872,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lcxscn4",
                          "score": 5,
                          "body": "Dude spot on about Boomers not wanting to \"pay for it.\" \n\nMy parents tried to get my brother and I to pay the legal fees to set up a trust for the farm property in their names, that they manage and get income from. So that it would be protected in case of some unforseen medical issues down the road. They figured since we will eventually inherit it, we should pay the bill. We were like in what world do you think WE are paying the legal bills for something you own and benefit from and could own for the next potentially 30+ years",
                          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxscn4/",
                          "created": 1720839885,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lcxvfrq",
                              "score": 17,
                              "body": "Coming from a farming family, you and your brother are making a huge mistake in not getting on board with what your parents are trying to do to preserve an inheritance for you. By doing no planning, you risk the farm having to be sold and every bit of your parents' assets could have to be divested to pay for long term care should they need it. Anything left may go to taxes. Your parents need to be largely without assets (thus the trust) for 5 years in most states before needing assistance, or those assets can be clawed back and force sold, and you will lose everything potentially. Get on board, go meet with estate planners, and figure out what it will cost. It really isn't very costly to do this, but not doing it could cost you everything. It made a huge difference for me and my siblings and worked beautifully. \n\nhttps://www.payingforseniorcare.com/medicaid/look-back-period",
                              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxvfrq/",
                              "created": 1720841321,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lcxvxng",
                                  "score": 2,
                                  "body": "It's all done. We were the ones that suggested it for them and gave them the lawyer to use. We just told them no when they presented the bill to us.\n\nI would never expect my kids to pay legal bills for stuff I owned",
                                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxvxng/",
                                  "created": 1720841557,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lcxxbd5",
                                      "score": 12,
                                      "body": "I guess everyone sees it differently. My siblings and I were very happy to help my parents pay the legal bills, which were quite small, as in less than $2k, so that we could help them preserve their estate, which was passed on to us. They did everything they could to help us along the way, so assisting them in their later years was what we wanted to do. We also bought their house so that they could live rent/mortgage free in retirement. I would do it all again if they were still with us. My father did the same legal arrangement for his parents. I guess that's part of the reason why the farm has stayed in our family for 8 generations. Generational cooperation.",
                                      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxxbd5/",
                                      "created": 1720842217,
                                      "depth": 8,
                                      "replies": []
                                    },
                                    {
                                      "id": "ld0azop",
                                      "score": 4,
                                      "body": "Lmao so you made your parents pay for securing your inheritance? Smart move mate. It’s not like they’re getting anything out of it, y know?",
                                      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/ld0azop/",
                                      "created": 1720887612,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lcxe044",
                          "score": 6,
                          "body": "Lmao. Have you not noticed the consumerism of the current tik tok generation?",
                          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxe044/",
                          "created": 1720833677,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lcxlocs",
                              "score": 6,
                              "body": "When you say tik tok generation are you talking about Gen Z? It’s all anecdotes because I’ve never looked at consumer spending data of different generations comparing them at the same age, but if anything you Gen Z attorneys I meet are incredibly frugal compared to even millennials. There are a lot more vehicles they drove through college in the parking lot compared to what I used to call the new associate Mercedes phase. Do you have any data to support that Gen Z is especially spend thrift? ",
                              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxlocs/",
                              "created": 1720836907,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ld68c08",
                      "score": 3,
                      "body": "My MIL is in Memory Care. All they do is give them a pill that causes a chemical lobotomy and  plop them in front of a big screen TV. $8800/ month plus a $850,000 buy in for her original unit.",
                      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/ld68c08/",
                      "created": 1720980706,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lcy7hfy",
                  "score": 9,
                  "body": "The Me generation indeed",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcy7hfy/",
                  "created": 1720847535,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcwk8y3",
                  "score": 19,
                  "body": "Yep, all these additions and new garages etc were paid for with HELOCs. The biggest source lf wealth to transfer - home equity - isn’t there.",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwk8y3/",
                  "created": 1720821978,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ld1vhzh",
                  "score": 4,
                  "body": "‘The wealth transfer will be to corporations’ - That’s the simple, correct answer",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/ld1vhzh/",
                  "created": 1720908437,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcwr7l9",
              "score": 26,
              "body": "That's why I got long term care insurance and am socking away for my kids. They may not understand my shitty car and limited wardrobe but will thank me later",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwr7l9/",
              "created": 1720824604,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcxamq5",
              "score": 17,
              "body": "The situation has been there but costs are outrageous now and these corporations are much more predatory than 30 years ago. If you have to put your parent in a nursing home, it will be around $10k/month. The plan is to take all their money. Nursing homes are predatory, horrible conditions, they suck off all the cash then boot them out.\n\nDon't forget about medical bills.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxamq5/",
              "created": 1720832281,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcxdf4i",
              "score": 6,
              "body": "This is such a discriminatory post. The older folks that survived lived through the great depression and extremely difficult financial times through WWII after that. Most had barely enough to live on in retirement as  a lot of them had no employer retirement plans. A great number barely escaped poverty. End of life care is very expensive, so not a lot of inheritance passed on. Same goes for the older \"baby boomers.\" There weren't many scholarships and guaranteed student loans didn't exist until 1965, the last year of birth for that generation. So only the later ones had access to funding for college. The stock market was not a safe place to save for the majority of them for most of their lives. Interest rates approaching 20% in the early 80's wrecked a lot of small business owners and farmers. They worked hard, raised their children, and most will have very little to leave to their children. Gen X probably has more wealth by current age than any generation before. Millennials will probably retire as a whole with more wealth than previous generations. Everyone has more opportunity now to get an education, escape poverty, bust their ass working, and accumulate wealth the old fashioned way than ever before. Expecting to accumulate wealth with low effort, unskilled, low wage jobs has never worked and will never work. Career choice is important. Spending $250k on a private college liberal arts degree that will never pay for itself is a really really bad decision. Wealth cycles. It gets consumed in 25-30 years of retirement. Very little gets passed on from one generation to the next, and almost no real family wealth survives three generations due to the carnage of math with generational division. No amount of blaming others will do it for you.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxdf4i/",
              "created": 1720833435,
              "depth": 2,
              "replies": [
                {
                  "id": "ld0c2or",
                  "score": 7,
                  "body": "I’m with you on this. People feeling entitled to their parents wealth their parents are spending on nursing home / end of life care is disgusting",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/ld0c2or/",
                  "created": 1720888005,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcxgil9",
                  "score": 16,
                  "body": "Easier to blame others than take any accountability or make strides to build yourself up",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxgil9/",
                  "created": 1720834733,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lcwx9hf",
          "score": 7,
          "body": "Yup. My parents have a will and it's going to another family member to be managed. \n\nMy grandparents have nothing and will leave nothing except debt to my parents.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwx9hf/",
          "created": 1720826924,
          "depth": 1,
          "replies": [
            {
              "id": "lcwzvli",
              "score": 26,
              "body": "They don't have to accept the debt. Talk to a lawyer. And if they transfer any keepsakes and such well enough in advance, they can't be clawed back.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwzvli/",
              "created": 1720827934,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lcyohdy",
          "score": 2,
          "body": "I’m Gen X and this is true of myself and so many people I know with Boomer parents. Sometimes it’s both, but at least one or the other… even if they had good financial planning, any wealth transfer is completely gone after really long stays in assisted living.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcyohdy/",
          "created": 1720858471,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcwrofx",
          "score": 1,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwrofx/",
          "created": 1720824781,
          "depth": 1,
          "replies": [
            {
              "id": "lcx36n9",
              "score": 32,
              "body": "I can't imagine what kind of life they gave you for you to not wish for your parents to be alive even one minute more with the resources they/you have.\n\n\nI would give every last cent I have and my own blood for them. \n\n\nI'm so sorry pal. ",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx36n9/",
              "created": 1720829242,
              "depth": 2,
              "replies": [
                {
                  "id": "lcxky3p",
                  "score": 7,
                  "body": "Really?  For you, there is no quality of life argument, only quantity?  Because please be sure the healthcare companies will convince you it's better to keep them alive, even if in a state of panic 24/7 or completely drugged up, and it'll only cost everything they have.  But those extra six years of sitting in a room every day freaked out, hey it's worth it. \n\n\nDon't be so high and mighty dude, there are nuances that you're just ignoring to seem morally superior.",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxky3p/",
                  "created": 1720836594,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcxe6uq",
              "score": 3,
              "body": "That's so fucked up.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxe6uq/",
              "created": 1720833754,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcwgf0r",
      "score": 240,
      "body": "A lot of boomer money will be transferred to retirement villages.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwgf0r/",
      "created": 1720820586,
      "depth": 0,
      "replies": [
        {
          "id": "lcxtkdh",
          "score": 60,
          "body": "And nursing home\n\nI've seen this first hand.. dementia and alzheiners can leave few options",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxtkdh/",
          "created": 1720840447,
          "depth": 1,
          "replies": [
            {
              "id": "lcyz124",
              "score": 8,
              "body": "My parents have a long term care insurance plan for this reason.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcyz124/",
              "created": 1720865953,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lcxqv6i",
          "score": 21,
          "body": "Boomers are the wealthiest generation. Like any generation, greed is human so it will be spent until they can’t recognize their face.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxqv6i/",
          "created": 1720839210,
          "depth": 1,
          "replies": [
            {
              "id": "lcxt3ba",
              "score": 2,
              "body": "That’s probably what millennials will do with it too.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxt3ba/",
              "created": 1720840229,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcvvnot",
      "score": 79,
      "body": "https://www.theguardian.com/us-news/2024/mar/12/parents-adult-children-financial-support#:\\~:text=Of%20parents%20providing%20support%2C%2021,each%20month%20by%20their%20parents.\n\nI mean, some of that wealth transfer is already occuring thanks to cost of living increases.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcvvnot/",
      "created": 1720813541,
      "depth": 0,
      "replies": [
        {
          "id": "lcw8yax",
          "score": 6,
          "body": "Anecdotally that is going to pay bills and cover costs now. I’m assuming it will be more of that than both parents gifting the current tax free max of $17K per parent to each person. I’m more interested in the bulk massive transfer that will take place in like 15-20 years. The 65 year old boomer paying bills for their millennial I would imagine help the market as it’s mostly consumer spending which is good.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcw8yax/",
          "created": 1720817965,
          "depth": 1,
          "replies": [
            {
              "id": "lcx3axc",
              "score": 13,
              "body": "Just a heads up, there’s only a reporting limit on the 17k/34k gift limit. Anything over that you have to report to the IRS. But you aren’t taxed until the LIFETIME gifts reach something like 11 or 13 million, so — probably not something most of us have to worry about.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx3axc/",
              "created": 1720829291,
              "depth": 2,
              "replies": [
                {
                  "id": "lcx7y65",
                  "score": 7,
                  "body": "\nSo my wife’s parents are comfortably retired and she has a sibling that needs some help usually so they feel guilty and corroborate with the gifting limit to my wife. If one kid gets 17K, they both do. Or like if we need a new roof on our house they pay the invoice and the money never even hits our account. It makes me incredibly uncomfortable because we don’t need the money but also they are very smart about money and taxes etc and their thought is get rid of as much tax free now while we are younger and appreciate the help more I guess than to get a lump sum when we are both 75 years old. \n\nIf I had 13 million I would not be posting in a Reddit forum.",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx7y65/",
                  "created": 1720831175,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcwv2zz",
      "score": 32,
      "body": "Skip right over Gen X love it!",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwv2zz/",
      "created": 1720826080,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcvyc03",
      "score": 129,
      "body": "Same as always, the next generation will have money until it all gets spent.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcvyc03/",
      "created": 1720814421,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcw86jf",
      "score": 101,
      "body": "What will affect the Boomer money transfer to millennials? Health Care. Health Care, Health Care, Health Care.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcw86jf/",
      "created": 1720817705,
      "depth": 0,
      "replies": [
        {
          "id": "lcwc1zj",
          "score": 18,
          "body": "Them boomers are on Medicare now or they are only spending like 10K a year on a private deal while their 1-3 million dollar portfolios are growing by 6% every year. Any boomer couple that made good choices has a portfolio north of 1.5- 2 million plus pensions social security etc. appreciated 150K per year. my dad has like 2 pensions, SS and a bunch of Apple and other stock he bought in the 80s, 90s snd 2000s at like 10% their present value. Money in the market was doubling basically every 6 years back then. \n\nI’m smart and have to fund all of that on my own through a Roth, trad IRA and 401K and I doubt my money doubles every 10 years now.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwc1zj/",
          "created": 1720819043,
          "depth": 1,
          "replies": [
            {
              "id": "lcwikbw",
              "score": 43,
              "body": "[https://creativeplanning.com/insights/financial-planning/budget-healthcare-retirement/](https://creativeplanning.com/insights/financial-planning/budget-healthcare-retirement/)\n\nDo you really think the average boomer has that kind of money? \n\n[https://www.foxbusiness.com/personal-finance/baby-boomers-retirement-savings#](https://www.foxbusiness.com/personal-finance/baby-boomers-retirement-savings#)\n\n\"The lack of savings is greater for certain social groups. The average retirement savings for all male boomers just hitting retirement age is $269,000, but it’s $185,000 for women. The divide widens even more for non-white retirees. White retirees in their 60s have $299,000 saved, on average, compared to $123,000 for Hispanic savers and $49,000 for Black savers\"\n\nTranslation is...there is NOT going to be some crazy wealth transfer from Boomers.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwikbw/",
              "created": 1720821355,
              "depth": 2,
              "replies": [
                {
                  "id": "lcwxdqj",
                  "score": 20,
                  "body": "Most of the wealth transfer is gonna be in the form of inheriting property.",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwxdqj/",
                  "created": 1720826970,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcwvxmv",
                  "score": 14,
                  "body": "Yeah and Millennials think old people should quit their jobs so that they can have those jobs even though older people still don’t have enough to retire on.. believe me, they’d LOVE to quit and retire if they could.",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwvxmv/",
                  "created": 1720826409,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ld0gxel",
                      "score": 5,
                      "body": "Except for our politicians 🙂 Those never want to retire.",
                      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/ld0gxel/",
                      "created": 1720889748,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ld3tol8",
                  "score": 3,
                  "body": "Inflation will play a big part in who will have nearly all the money when it's time to transfer wealth.\n\nIf a boomer was saving when earning a high income of $35,000 a year, that $269,000 may seem like a lot of money to the boomer who retired years ago. But if a young person years from now to be making $300,000 per year may have $3,000,000 saved when they retire 10 years from now. So the boomer money probably would seem like nothing for the millennials.",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/ld3tol8/",
                  "created": 1720940006,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcwkuth",
              "score": 18,
              "body": "Yeah dog people don’t have as much money as you think. You grew up with a financially sound father. I grew up middle class and my parents don’t have much. My dad is about to retire and will live off a total of 3000 bucks a month. 2500 from SS and 500 from his 401k. My mom was a high school teacher basically her whole life so she will probably be better off with some sort of pension plan I imagine. But their house is paid off so they don’t need much. I imagine a lot of boomers are more like my parents than yours. My inheritance might be a thousand bucks. I’m not expecting anything really and that’s totally fine. \n\nOverall I wouldn’t think too much into this large sum of money being transferred between generations. It’s more important you have a balanced portfolio that shifts towards more conservative assets like bonds/treasuries as you approach retirement age",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwkuth/",
              "created": 1720822205,
              "depth": 2,
              "replies": [
                {
                  "id": "lcwsopl",
                  "score": 7,
                  "body": "Same. My dad (71yo) has been a low tier software programmer since the early 80s, mom (74yo) has been paid under the table as a preschool teacher (read: paid enough for the odd “treat yourself” shopping spree) and they have $100k saved up in a HCOL city and a house that’s crumbling but completely empty paid off. Any inheritance after their failing health gets taken care my 2 brothers and I get will probably be a wash paying other debts off.\n\n\nGrew up extremely lower middle class, trying my best to break the cycle.",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwsopl/",
                  "created": 1720825162,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lcxeycn",
              "score": 8,
              "body": "$1M is like the top 10%. $3M is less than 1%, so \"any boomer couple that made good choices\" seems to conflict with 1-10%. \n\nOnly the top 2% have enough to pay for all their retirement and healthcare without going broke.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxeycn/",
              "created": 1720834076,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcxex99",
              "score": 12,
              "body": "You are so out of touch with the reality of most people's lives. Most of America does not live with your privilege.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxex99/",
              "created": 1720834064,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ld0fqu7",
              "score": 2,
              "body": "You are the 1% and insanely delusional about how much wealth most boomers have.  ",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/ld0fqu7/",
              "created": 1720889322,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcw0sdh",
      "score": 117,
      "body": "I’m no expert but I don’t think there will be much. Boomers are generally unhealthy and living awhile. They will require lots of healthcare (inpatient visits, nursing homes, rehab, LTAC, expensive prescriptions, etc) and I think a good chunk if not all of their wealth will be used up by that.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcw0sdh/",
      "created": 1720815234,
      "depth": 0,
      "replies": [
        {
          "id": "lcxeke6",
          "score": 17,
          "body": "They will both require lots of healthcare and Medicare and Medicaid and then turn around and vote for the candidates that are most likely to reduce those.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxeke6/",
          "created": 1720833912,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcxb0uk",
          "score": 19,
          "body": "I think you underestimate just how much some of these boomers have been stashing away since forever, ex was an estate attorney and lots and lots of these Toyota driving cheapskates with the house they paid 25k for in 1974 had tens of millions sitting in brokerage accounts when they shuffled off this mortal coil.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxb0uk/",
          "created": 1720832442,
          "depth": 1,
          "replies": [
            {
              "id": "lcxgq9y",
              "score": 41,
              "body": "Emphasis on \"some.\" Don't kid yourself, millionaires are a small minority.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxgq9y/",
              "created": 1720834822,
              "depth": 2,
              "replies": [
                {
                  "id": "lcy2lqx",
                  "score": 14,
                  "body": "[According to Forbes](https://www.forbes.com/advisor/retirement/how-many-billionaires-and-millionaires-live-in-the-u-s/), there's 22mn millionaires in the US. Out of a labour force of around 170mn, that's a minority, but still quite a lot actually\n\nHaving tens of millions is definitely rare though",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcy2lqx/",
                  "created": 1720844872,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ld0o6u6",
                      "score": 13,
                      "body": "Most of those \"millionaires\" mostly just have a million dollar house.",
                      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/ld0o6u6/",
                      "created": 1720892362,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lcxzu4k",
              "score": 17,
              "body": "Thats hyperbolic. No one is amassing \"tens of millions\"  from either saving or letting it ride in a brokerage account.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxzu4k/",
              "created": 1720843459,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcw3p9h",
      "score": 112,
      "body": "Whatever happens it will be millennials fault.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcw3p9h/",
      "created": 1720816206,
      "depth": 0,
      "replies": [
        {
          "id": "lcx3o39",
          "score": 12,
          "body": "Of course, just like people blame boomers, as they will take the boomers place and end up understanding their thought processes. It's a vicious cycle.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx3o39/",
          "created": 1720829438,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcxuhss",
          "score": 4,
          "body": "Me: [Proceeds to maniacally laugh in lab grown diamonds, not-drinking cheap watered beer, not going on cruises, and not buying motorcycles.]",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxuhss/",
          "created": 1720840876,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcw92pw",
      "score": 60,
      "body": "I don't know about all of your parents, but mine love heading to the casinos. It's a sad reality watching them spend their nest egg on 'having a good time' when you know there's more enjoyable hobbies out there for your golden years.\n\nI half joke with them that they would have better odds gambling in the stock market on penny stocks. It's their money and I could care less if I ever see any of it. I just think about my childhood years and getting the cheapest pair of shoes at Walmart because we needed to 'save' for the future.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcw92pw/",
      "created": 1720818007,
      "depth": 0,
      "replies": [
        {
          "id": "lcwia8t",
          "score": 28,
          "body": "[removed]",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwia8t/",
          "created": 1720821253,
          "depth": 1,
          "replies": [
            {
              "id": "lcwwnx7",
              "score": 12,
              "body": "Me: Loading up on VICI (Casino REIT).",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwwnx7/",
              "created": 1720826692,
              "depth": 2,
              "replies": [
                {
                  "id": "lcy47ye",
                  "score": 3,
                  "body": "Many boomers are now getting into online gambling/slots.",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcy47ye/",
                  "created": 1720845723,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lcwomii",
          "score": 10,
          "body": "> It's their money and I could care less if I ever see any of it.\n\nThis means you do care at least a little bit.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwomii/",
          "created": 1720823621,
          "depth": 1,
          "replies": [
            {
              "id": "lcxse5l",
              "score": 8,
              "body": "I do care about them. I wish they wouldn't flush it down the casino toilet. I want them to enjoy their golden years. There's so much more to life than having the thrill of pulling a lever (or pushing a button).",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxse5l/",
              "created": 1720839904,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcza4qt",
              "score": 7,
              "body": "This is the idiom that grinds my gears the most. How can someone read “could care less” and not realize they’re saying it wrong?",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcza4qt/",
              "created": 1720872584,
              "depth": 2,
              "replies": [
                {
                  "id": "lczt3m1",
                  "score": 6,
                  "body": "Right? It should be “I couldn’t care less”.",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lczt3m1/",
                  "created": 1720881019,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcwoyo6",
      "score": 27,
      "body": "Put your investments into healthcare. \n\nMany boomers are/will spend 6-30k a MONTH for years of assisted living. It's not going to go into their kids'pockets. It's going to go to caregivers, activity directors, admin, maintenance workers, companions, and FAR more of it, to the companies and PEF that will run those caregivers into the ground for profit.\n\nNo matter how much you love your parents, it will suck the life out of you to try to save their nest egg by helping them, while you watch them decline to the point that they don't remember who you are, and why you are hand feeding them in their house.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwoyo6/",
      "created": 1720823749,
      "depth": 0,
      "replies": [
        {
          "id": "lcwy4kv",
          "score": 31,
          "body": "My sister works for one of those assisted living places. 6K a month and the conditions are awful. 1 nursing assistant per floor of 24 residents, sometimes covering 2 floors at the same time during a shift if someone doesn't come in. That's 48 people you have to feed, clean, and move around during the shift. If the nurse after you doesn't come in you have to do a double shift. They also get paid less than $20/hr. Plus they feed the residents the cheapest garbage from SYSCO. I tried their slop during thanksgiving and it was worse than regular school cafeteria food by 2 levels. I'd feel bad feeding it to a stray dog. For that kind of money you can get a mansion sized private villa in SE Asia with full time caretakers (my parents retirement plan).",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwy4kv/",
          "created": 1720827256,
          "depth": 1,
          "replies": [
            {
              "id": "lcx0p3x",
              "score": 20,
              "body": "Aging in place is a strategy that will take off as the alternative of assisted living becomes ridiculous. I never thought of doing it in a foreign country. Your parents are smarter than me.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx0p3x/",
              "created": 1720828257,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcx168l",
              "score": 18,
              "body": "There is a beautiful community near my home in Chiangmai Thailand that provides assisted living for western seniors and for around $3.5k per month offer amazing care and facilities. Im surprised more people haven’t gone this route.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx168l/",
              "created": 1720828444,
              "depth": 2,
              "replies": [
                {
                  "id": "lcx7z47",
                  "score": 10,
                  "body": "Another good option here in Thailand are live in caregivers which are much cheaper. A lot of my wealthy Thai friends have mentioned their elderly grandparents have carers who stay at the house.",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx7z47/",
                  "created": 1720831186,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lcx1n3j",
                  "score": 5,
                  "body": "My parents are also retiring in Thailand. We have family that work there that can help out with the visa and everything. Everything is very affordable. Even with a budget of $2k/month you can get by pretty good.",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx1n3j/",
                  "created": 1720828628,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcx4s71",
                      "score": 3,
                      "body": "That's definitely true a smaller budget is sufficient. Amazing what 2k can get you here and the Thai caretakers are lovely.",
                      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx4s71/",
                      "created": 1720829889,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lcyd4h3",
          "score": 4,
          "body": "Good thing I’m going to off myself before I have to go through any of that. My kids are gonna be set!",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcyd4h3/",
          "created": 1720850923,
          "depth": 1,
          "replies": [
            {
              "id": "lczrwio",
              "score": 2,
              "body": "Seriously, look into your state's death with dignity laws. 14 states now offer it. But you have to be able to ask for it 3x, and be of sound mind. Which means if you go into cognitive decline, your family can't help you off yourself.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lczrwio/",
              "created": 1720880550,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcvthn4",
      "score": 18,
      "body": "Debt",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcvthn4/",
      "created": 1720812819,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwt665",
      "score": 17,
      "body": "My mom and step dad just bought a second RV that costs more than my house. Not sure why they need two either, but the people they pay to store and maintain them are cashing any inheritance money i’d get. \n\nThey proudly say “cant take it with you when you die might as well spend it!”  \n\nAnd i agree with that, they should spend their money if they want (though it does make me sad seeing them waste it on TWO RVs when they just alternate). However, from my observation it is a stark difference compared to the silent generation, who really wanted to pass down money and a legacy. \n\nSo my opinion is the extremely rich boomers will pass on wealth, but a lot of the upper middle boomers will blow it all on partying in their 70s and health care in their 80s.  \n\nAlso, a lot of their cash comes from fat pensions, which dont get passed on. So they can take on monthly expenses because they have a guaranteed monthly income. \n\nStock wise health care and anything old people splurge on. Boats, RVs, fancy cars, vacation places that cater to older people, retirement communities that are basically country clubs with nurses on site, etc.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwt665/",
      "created": 1720825348,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lczb4kf",
      "score": 4,
      "body": "You’re making a lot of assumptions here that I think are wrong. \n\nAssumption 1: the 50-60% of wealth boomers have/will have is distributed roughly evenly among them. \n\nBoomers as a generation might own 50–60% of all wealth despite being only 20-25% of the population, but plenty will die with nothing or even in debt. Heck, Bill Gates and Jeff Bezos (boomers) are somewhere in the range of 2-3% of all wealth by themselves.\n\nAssumption 2: assets cleanly pass down from one generation cohort to the next upon death. \n\nThat’s not how generation cohorts or estate planning work. First, generation cohorts use made up dates to loosely describe cultural phenomena. Actual generations within a family don’t hold to those lines. I’ve got one silent generation set of grandparents and one elder boomer set. I’ve got one younger boomer parent and one elder gen x parent. I’m a millennial but my sister is Gen z. These lines aren’t especially useful for this kind of data. Also, even if we’re talking actual generations rather than cohorts, assets often don’t pass cleanly to the kids. They might skip a financially secure group of empty-nesters to set young adults up for the long term. They might got to charity or to other non-family entities. \n\nAssumption 3: once passed down, assets will remain as a package.\n\n“Grandma’s money” (probably) doesn’t all stay together when Grandma dies. It likely gets broken apart and diluted, with some going to Grandma’s debts, some to her children, some to her grandchildren. If she has more than one child or grandchild, it’s not all staying together.\n\nAssumption 4: when these assets are passed down, they will largely be liquidated. \n\nMaybe, maybe not. My priors lead me in the opposite direction - the kind of parents who leave a large nest egg are also likely the kind of parents who raise financially literate children who know about compounding growth and may well be in a position to let it ride. \n\nAssumption 5: if they are liquidated, it will collectively be a large enough hit to affect the market. \n\nThis is a *big* assumption. First, there’s the issue: I raised above of wealth concentration within the boomer cohort and messy transfers between cohorts, which lowers the effective number we’re worrying about from 50-60% of all wealth to probably more like 45-50%. Second, boomers aren’t all the same age now and won’t all die at the same age. There’s a large wealth transfer *already happening* that will continue to happen *over the next four decades*. Some boomers are already dead. Some are going to live to be 100+. You’re worrying about aggregate numbers, but the ones that matter are the center of the bell curve - still big, but a *lot* smaller. \n\nAssumption 6: if #5 comes to pass, the effect will be lasting stagnation.\n\nFundamentally, markets are resilient. advances in technology and gains in productivity have always - yes, *always* - trumped any other forces in the medium-to-long term. Stagnation in the market based on generational wealth transfer rather than the underlying strength of the stocks themselves leads to undervaluation, leads to market correction when people buy the stocks. \n\nNow, I don’t *know* that the market is going to be hot in the 2040s. Statistically, that decade will probably include one or two downturns either way. And your assumptions *might* all be correct. But if any one of them is wrong, it’s business as usual. If it gives you peace of mind to adjust your retirement plans to compensate for this or other risks, do it. I for one think this one is fine to ignore.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lczb4kf/",
      "created": 1720873104,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcw1mzt",
      "score": 9,
      "body": "Are properties inherited taxed at their cost basis?",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcw1mzt/",
      "created": 1720815520,
      "depth": 0,
      "replies": [
        {
          "id": "lcw3tyd",
          "score": 14,
          "body": "That's a state/county issue, but at least for most states, they are inherited and the cost basis is bumped up to the current value and no tax is paid on that change.  I am not a lawyer, but that is my understanding.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcw3tyd/",
          "created": 1720816250,
          "depth": 1,
          "replies": [
            {
              "id": "lcwh9zm",
              "score": 4,
              "body": "That is accurate, the cost basis ‘steps up’ to current fair value on inheritance.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwh9zm/",
              "created": 1720820891,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lcx5zhc",
      "score": 4,
      "body": "My wife inherited about 1.5  million from her parents.   Plus her sister inherited 1.5 million and she spent about $500,000 between alcoholism and now memory care.  She is on hospice and will probably die in 1 year.   We have about $450,000 in our 401K/IRAs we earned ourselves.  My wife is sole heir to my sil’s estate.   We have another $500,000 in home equity.   We are both either 60 or damn close.   She wants us to work 5 more years and isn’t counting on Social\nSecurity or the market to save us.   Her sil’s house is being rented for $2000 net income/mo after property management fees and repairs.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx5zhc/",
      "created": 1720830379,
      "depth": 0,
      "replies": [
        {
          "id": "lczctpx",
          "score": 2,
          "body": "Can I be your kid?",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lczctpx/",
          "created": 1720873964,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcw8zjd",
      "score": 9,
      "body": "My mother passed away in May. She had her 401k at Fidelity in the bonds and half her net worth in a credit union savings account. My brother and I split all assets 50/50. 75% of my part of the savings account is now invested in the market, when before it was sitting in a savings account. Her 401k has been liquidated and is now sitting in a non-interest bearing checking account as it is in probate. When her estate is closed my half is going back in the market. So, while some money will be taken out of the market, you may see more money enter than what left.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcw8zjd/",
      "created": 1720817977,
      "depth": 0,
      "replies": [
        {
          "id": "lcwxnys",
          "score": 14,
          "body": "Very good point. OP’s underlying assumption is that all boomers have the bulk of their wealth in the stock market, which is probably not true. Many boomers are what my CPA calls “house rich and cash poor” and the bulk of their net worth is real estate.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwxnys/",
          "created": 1720827080,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcvygfu",
      "score": 19,
      "body": "The silent generation’s children are often generation X. I’m a gen X, my parents are in their 80’s and are part of the silent generation. Boomers children are mostly millennials and Generation Y. It is Gen Y who may inherit the largest amount from the boomers.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcvygfu/",
      "created": 1720814462,
      "depth": 0,
      "replies": [
        {
          "id": "lcw56g8",
          "score": 41,
          "body": "Gen Y and the Millennials are one and the same.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcw56g8/",
          "created": 1720816700,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcw5s9k",
          "score": 5,
          "body": "What’s the difference between Millennials and generation Y ?",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcw5s9k/",
          "created": 1720816904,
          "depth": 1,
          "replies": [
            {
              "id": "lcw8fzg",
              "score": 11,
              "body": "None, silent-boomers-x-millennials-z",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcw8fzg/",
              "created": 1720817793,
              "depth": 2,
              "replies": [
                {
                  "id": "lcwsfmx",
                  "score": 7,
                  "body": "We are actually in Gen-Alpha now. Gen Z are actually entering the work force, or have been for a couple years.",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwsfmx/",
                  "created": 1720825066,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lcwe4ga",
          "score": 7,
          "body": "> Boomers children are mostly millennials and Generation Y.\n\nYou're talking about the same group twice. Millennials are Generation Y.\n\nhttps://en.wikipedia.org/wiki/Millennials",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwe4ga/",
          "created": 1720819773,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcwjgas",
          "score": 5,
          "body": "My parents are boomers - born right after the second world war - and I am Gen X. But yes, some of the ‘younger’ boomers may have Millenial kids.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwjgas/",
          "created": 1720821681,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcy424y",
          "score": 2,
          "body": "Two forgotten generations in one comment!\n\n… I’m in the same boat.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcy424y/",
          "created": 1720845638,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcxd8po",
      "score": 17,
      "body": "Selfish self centered boomer here. We paid for both of our kids undergrad degrees so they would be debt free. We are planning to leave both kids a comfortable inheritance. We plan to live off our pensions and social security to grow the inheritance and start gifting it before we croak. When I was younger my father left us a nice amount of money that enabled us to move to a nicer area with nicer schools for my kids. I was grateful to him for that gift, it changed our lives.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxd8po/",
      "created": 1720833360,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcx7ce7",
      "score": 3,
      "body": "I’m sure this is obvious but those numbers are about total wealth not money. Most of that wealth is held by a group of people who have been ultra-wealthy for decades and they’re not stopping anytime soon. When those people die, that money ain’t going anywhere besides to their families who will most likely repeat the process.\n\nFor the upper-middle class boomers and the middle class boomers who have their finances in order this is the type of wealth I imagine they posses: \n\nHouses- majority of the wealth middle class boomers own is or was tied up in real estate; whether 1 house or multiple. They will/have been sold for retirement to: a contractor who will tear it down and build 2-4 townhouses, a millenial family, a property management company or someone who want to be a landlord, or house flippers…yuck. Some will probably hold on to their rental property for passive income. Either that or they will continue to live in their house throughout retirement until they require assisted living or die and it’s transferred to next of kin or the bank.\n\nStocks/investments- either sold to fund retirement, or used for passive income. If they’re not gone by the time they die, they’ll probably go to spouse or family.\n\nPensions/401k etc.-pretty self explanatory, same as stocks. They’ll fund their retirement until it’s all gone. With current high cost of living, I assume the majority of them will burn through this fairly quick. \n\nSS/Medicare- out of our pockets and into theirs. SS has been broken for a minute so this money will come from the payments we’re making now and will supplement their retirement income. Medicare will cover some medical expenses for them but not everything.\n\nI assume most of the money they can spend for the 10-15 years that they’re still healthy will be used for vacations, cruises, RVs etc. They’ve spent their whole lives believing that they’ll finally be able to enjoy their life when they retire and you know they’re gonna try.  \n\nWhatever they don’t use when they can will be used for medical care or assisted living. Boomers have been exposed to high amounts of carcinogens, terrible diets, and mediocre health care so only the healthy-minded, rich and genetically privileged will make it past 80 without spending some serious coin on medical bills. \n\nThe biggest impact I see the boomer generation having on the economy is the amount of employees exiting the work force. Some “boomer heavy” industries might have a hard time replacing these employees, especially dependent on the pay.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx7ce7/",
      "created": 1720830930,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcznigq",
      "score": 3,
      "body": "Reverse mortgage and assisted living. Boomers will eat up all their equity and wealth, turning it into debt to pay for slightly better-than-medicaid services.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcznigq/",
      "created": 1720878791,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ld08mss",
      "score": 3,
      "body": "Healthcare costs are quickly sapping anything I would have inherited.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/ld08mss/",
      "created": 1720886759,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ld091dh",
      "score": 3,
      "body": "All of their houses will be sold to Airbnb corporations, because their kids don’t want to live where they do. Huge swaths of suburbia will become short term rentals until that bubble bursts.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/ld091dh/",
      "created": 1720886906,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwoq40",
      "score": 14,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwoq40/",
      "created": 1720823659,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcw9128",
      "score": 9,
      "body": "Millennial will follow boomer footstep and blame genZ for being entitle. It’s never ending cycle.\n\nPeople are communists when they are poor but will 100% becomes mega capitalist like Scrooge McDuck or Mr Krab when they suddenly has so much money",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcw9128/",
      "created": 1720817991,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwdqla",
      "score": 8,
      "body": "Your problem OP is your not doing per person wealth. Boomers are not particularly wealthy compared to other generations, they are just at the point in their lifecycle when wealth always peaks. (end of career/early retirement)\n \nSo nothing particularly noteworthy will happen. Gen Z is wealthier at this point in their generation cycle compared to any other generation, as an example of how there's not going to be some massive transfer from rich to poor.\n\nThe only generation which appears to lag overall is Millennials as they experienced the great recession right during the beginning of their careers which really screwed them on multiple levels financially. \n\nGen X and Gen Z have done fine financially when you look at the data.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwdqla/",
      "created": 1720819638,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ld05lqo",
      "score": 2,
      "body": "Here’s another question: how will past redlining affect future wealth distribution to any generation?",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/ld05lqo/",
      "created": 1720885661,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcw1ckr",
      "score": 6,
      "body": "WW3",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcw1ckr/",
      "created": 1720815423,
      "depth": 0,
      "replies": [
        {
          "id": "lcw7tja",
          "score": 9,
          "body": "Neither China nor USA will risk economic collapse fighting WW3. \n\nWorld War 3 would either be between China and its allies Vs. The US/Taiwan/Japan/India/South Korea etc. \n\nThe economies are so interconnected now. The rich in WW2 didn’t have stock and relationships in foreign countries like they do now. “Oh no! We can’t fight Germany I’ve got Rheinmettal, Siemens AG, Bayer and BMW stock!”  \n\nYour stock portfolio would lose 90% of its value the minute that war pops off against China. The Chinese elite also don’t want to destroy their economy. Every western company would get absolutely wrecked because all the CPG companies shit is made in China. And that bottom wouldn’t be like Covid, it would bottom out for decades and not be the grand buying opportunity that you want it to be. \n\nIf anything we would broker some appeasement deal where they occupy Taiwan because we make it happen to prevent that and we maintain our access to Taiwan semiconductors and Chinese goods manufacturing.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcw7tja/",
          "created": 1720817584,
          "depth": 1,
          "replies": [
            {
              "id": "lcxd9im",
              "score": 7,
              "body": "Sounds exactly like the logic after WWI aka “the war to end all wars”.\n\nSame exact argument: Countries to codependent economically.\n\nNobody gave a crap. No war has been avoided due to investors. Investors realize what’s coming and shift their holdings accordingly.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxd9im/",
              "created": 1720833370,
              "depth": 2,
              "replies": [
                {
                  "id": "lcxg8jz",
                  "score": 3,
                  "body": "The world wasn’t as connected then as it is now and the dynamics have changed. There are central banks connected everywhere to one another. The markets are connected. We have nukes now so the United States, Russia, Germany, China, Japan etc just fight proxy wars amongst themselves with lesser powers now because it’s not worth the risk of mutually assured destruction. NATO is actually a force. The League of Nations had no Army or the United States. \n\nWW2 never would have started now be cause the Austrian painter would have just taken out a student loan at 8% interest to get accepted to that school.",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxg8jz/",
                  "created": 1720834617,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcxh6cv",
                      "score": 6,
                      "body": "If that were the case The Great Depression would not have been a global economic event… but it was, it actually gave the Nazi party the environment they needed to thrive and grow combined with the WWI economic hit Germany took.\n\nYou’re looking at it from an American centric view not a global view. The world then was actually quite connected, even if American history books ignore most global history. American history books are kinda fucked because they don’t teach American history in a global context, but that doesn’t mean there wasn’t one.\n\nAll of recorded history humans have said the bigger powers are done with war. Every single time it’s been wrong.  You need to be especially arrogant to think this time humans are different.  We’re genetically the same, our technology is still incremental in the grand scheme of things.",
                      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxh6cv/",
                      "created": 1720835010,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lcwcqoc",
              "score": 8,
              "body": "A very optimistic view of what would happen. \n\nOnce the propaganda machine goes choooo chooooo in a full scale conflict no one will be thinking about the economy, it’ll be about survival. ",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwcqoc/",
              "created": 1720819288,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcx2ium",
              "score": 2,
              "body": "Funny, reminds me of the dumbass theory that a war couldn't break out between two countries that have McDonalds in them.",
              "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx2ium/",
              "created": 1720828978,
              "depth": 2,
              "replies": [
                {
                  "id": "lcx96dm",
                  "score": 2,
                  "body": "I think that happened with Ukraine and Russia.",
                  "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx96dm/",
                  "created": 1720831678,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcw3pxc",
      "score": 2,
      "body": "Won’t the silent generation $ pass to Gen X?",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcw3pxc/",
      "created": 1720816212,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwhodp",
      "score": 2,
      "body": "How money works did a video on this exact scenario. You should check it out",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwhodp/",
      "created": 1720821034,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwhv2v",
      "score": 2,
      "body": "My boomer money will go to charities actually.  No kids, no direct family.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwhv2v/",
      "created": 1720821101,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwlob5",
      "score": 2,
      "body": "Just buy Sofi stock their customer base is growing and they are young customers who’s wealth will grow… sit back and let the $$$ come in",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwlob5/",
      "created": 1720822511,
      "depth": 0,
      "replies": [
        {
          "id": "lcx8nb4",
          "score": 2,
          "body": "I bought a bit after opening a sofi account, using it, and being impressed with the product/service. Unless I'm missing something, the only real drawback is it being a bit of a pain and ~$5 to deposit cash directly into it. Easy enough to deposit it into my local banking account then transfer with the app though if I don't need it in there immediately. Still clears in a day or so.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx8nb4/",
          "created": 1720831462,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcx4380",
      "score": 2,
      "body": "Stop complaining and do something about it 😀. Scared of all your money going to a care home? Start shoveling money to your kids and grandkids. Establish a pattern of giving for ten years so that when you give them $20k for a birthday, the IR don’t think you’re trying to avoid tax (which you totally are). Put half your house in your kids names. \nMy parents did *none* of this despite advice and being scared the gubbermint would take all their money for care homes, which they did. A lot of their capital loss was avoidable…",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx4380/",
      "created": 1720829606,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwc72c",
      "score": 1,
      "body": "Spoiler alert- this is long. \nAs a mid-cycle boomer I agree with most of this. A few silent generation invested in the market but most invested in property or money markets. Keep in mind that the interest rates for the 1974-2004 years ranged from 7-16%. Quantitative easing from 2007-2023 fueled many things- rapidly increasing national debt, more taxes to compensate for more interest, and probably one of the biggest results was that with an interest rate as low as 2% for a borrower with good credit, modest income on a primary residence, it was easy to buy a house from 2008 until 2021/2. Then the huge number of buyers, speculators, investment bankers and hedge funds blew up the housing market and housing prices doubled over a short time. \nThis has happened before though. Nearly Doubled from 74-84, and again in 84-94 and again 94-04. The only reason they didn’t double in 04-14 was the housing/financial crisis. \nIf you look at the savings most boomers have it is pitiful. I’d argue that younger generations are saving more than we did at the same age. Also most boomers have never invested in individual stocks - generally 401k or mutual funds/etfs. Never mind the unmentionable B word  \nMore money pouring in from trusts and wills should likely increase the price of stocks. However the proliferation of the national debt, medical costs, open and silent quitting and the effect on goods and services is going to siphon money from individuals and small/medium businesses to banks corporations and the government. If our government can slow down spending, if healthcare can be slowed( not by universal insurance which will just drive up the cost) and if people get back to work and we start producing again, then the future looks brighter",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwc72c/",
      "created": 1720819093,
      "depth": 0,
      "replies": [
        {
          "id": "lcwwgh8",
          "score": 2,
          "body": "THIS. YOU NAILED IT!!",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwwgh8/",
          "created": 1720826611,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcwsram",
      "score": 2,
      "body": "Honestly it will most likely just \"evaporate\". Boomers just had it that good, better than those who came before and after. As such by the time the money reaches the millenials not much of it will remain, not to mention various other factors like inflation or other types of depreciation. Also don't discount the absolute money drain that healthcare is. I didn't believe it until I saw it, but if there's one way to suck wealth out of the rich it's healthcare costs, which mount in later life quite substantially. Boomer money will go to Gen X who have higher rates of heart disease and cancer, and probably have been waiting to live it up for a long while. By the time it gets to millenials, unless Gen X builds on it, which they certainly won't to the degree boomers did, what's left? Some lump sums in inheritance and houses that are 40+ years old?",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwsram/",
      "created": 1720825190,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcw3ef1",
      "score": 1,
      "body": "business as usual",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcw3ef1/",
      "created": 1720816106,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwds71",
      "score": 1,
      "body": "very good point OP....... would this not have been the case 30 years ago too?.... or is this phenomenon so much larger now? larger relative to size of economy or size of stock market.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwds71/",
      "created": 1720819654,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwl9sq",
      "score": 1,
      "body": "More money invested in “newer” investments: crypto, trading cards (Pokémon, magic, etc), games or ingame items (counter strike skins).\nLess money in gold, silver- that’s my guess and there will definitely be millennials who couldn’t care less about Pokémon or whatever I just listed- but we are already seeing a strong shift. Everyone has E- wallets. Everyone uses *online* banking, we don’t need to own, we are fine to rent",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwl9sq/",
      "created": 1720822361,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwlibn",
      "score": 1,
      "body": "It’s not going to cause a stock sale, people still need to hoard all that wealth in an asset while they find ways to spend portions of it",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwlibn/",
      "created": 1720822449,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwlp32",
      "score": 1,
      "body": "Does OP watch how money works?",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwlp32/",
      "created": 1720822519,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwoo1w",
      "score": 1,
      "body": "Itll be the largest transfer of wealth ever. It will be a large affect, to say the least.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwoo1w/",
      "created": 1720823637,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwvhyd",
      "score": 1,
      "body": "I think that money, by and large, isn't going anywhere.  The top 10% of people own about 93% of stock market wealth.  When they die, it will stay in the trusts that have been set up for their children.  The remaining 7% of stock market wealth isn't really worth talking about, but most of it will end up in the pockets of corporations owned by the top 10%.\n\nSo I would expect another 40 years of inflationary policies that tend to inflate asset values and devalue labor.\n\nUnless something breaks.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwvhyd/",
      "created": 1720826239,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwvrdq",
      "score": 1,
      "body": "Nothing the system is going to fleece them before they die somehow",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwvrdq/",
      "created": 1720826341,
      "depth": 0,
      "replies": [
        {
          "id": "lcx9pc2",
          "score": 3,
          "body": "Inflation is already doing that to everyone.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx9pc2/",
          "created": 1720831895,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcwxyb1",
      "score": 1,
      "body": "Trust fund babies stealing the wealth for themselves.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwxyb1/",
      "created": 1720827190,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcwzarm",
      "score": 1,
      "body": "Youre spot on with the macro optics on this.  Also try to overlay boomer RMDs with less people contributing to their 401ks. \n\nThe entire thing is going to go upside down.  Wealth transfer will pay debt and RMDs will eat the system alive.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcwzarm/",
      "created": 1720827709,
      "depth": 0,
      "replies": [
        {
          "id": "lcx28ah",
          "score": 2,
          "body": "Not necessarily. A lot of boomer net worth is in real estate.",
          "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx28ah/",
          "created": 1720828862,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcx4dwi",
      "score": 1,
      "body": "I’m Gen X with boomer parents and millennial/Gen Z adult children. My parents are still alive, so the wealth transfer is 20-30 years away for my kids. It’s weird that these discussions leave out Gen X parents.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx4dwi/",
      "created": 1720829727,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcx7dd0",
      "score": 1,
      "body": "Lots of people buying their childhoods back. Think sports cars, collectibles, etc. Cars like the Diablo, 911, Merci, F355 are all rocketing in value as an example. Same with Pokémon cards and 90s era nostalgia. Selling huge homes and opting for higher quality of life with lower cost to live as well. Millennials will have been through several financial disasters by the time real money starts to change hands on a large scale so some will splurge, and most will be cautious. \n\nEnjoying life for us doesn't mean 5 kids and 5000 sqft with a pool and a boat and being stretched paper thin to appear rich. Most of us see the work and the cost and don't see the worth in doing all that. We'd rather work 4 days a week and travel, go drive, enjoy the world, relax, live life. We are not here to sell our souls to a dream that was sold to us as hard work equals becoming wealthy. We saw through that horse shit a long time ago.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx7dd0/",
      "created": 1720830942,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcx7mpx",
      "score": 1,
      "body": "Wall Street will absorb 75%",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx7mpx/",
      "created": 1720831046,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcx974u",
      "score": 1,
      "body": "Man I doubt I'm getting shit. My parents are both poor and I can't afford to help them out at all.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcx974u/",
      "created": 1720831687,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxassw",
      "score": 1,
      "body": "How many Gen X'rs got that Boomer money? None I know.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxassw/",
      "created": 1720832350,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxbih0",
      "score": 1,
      "body": "Don’t forget uncle Sam’s cut. Inherited Traditional Ira think 25%+",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxbih0/",
      "created": 1720832646,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxeklp",
      "score": 1,
      "body": "Wealth is measured in nominal dollars.  Expect big inflation to keep the party going",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxeklp/",
      "created": 1720833914,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxibyb",
      "score": 1,
      "body": "Most will be given to nursing homes  and Medicaid. It’s the most perverse incentive there is - wealth can be transferred if parents die quickly. Why anyone thinks this is the society we want is beyond me, but there’s no political will from any party to change it.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxibyb/",
      "created": 1720835495,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxkb2q",
      "score": 1,
      "body": "99 percent of boomer wealth will go directly to healthcare and healthcare administrative costs, those guys will buy a few more super cars, and that'll be about that, is my prediction",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxkb2q/",
      "created": 1720836323,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxkqv3",
      "score": 1,
      "body": " Effect is the noun you want, affect is a verb.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxkqv3/",
      "created": 1720836508,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxn3jl",
      "score": 1,
      "body": "That's the thing... there won't be a wealth transfer.  The healthcare system will bleed the boomers dry (as it was designed) and the next generation will get nothing.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxn3jl/",
      "created": 1720837527,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxnfyv",
      "score": 1,
      "body": "Not much… boomer is giving it to trump to save Jesus or something",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxnfyv/",
      "created": 1720837678,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxqx7w",
      "score": 1,
      "body": "45% of it will be taken in taxes by the government.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxqx7w/",
      "created": 1720839236,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxsllt",
      "score": 1,
      "body": "We will get nothing obviously. Hasn’t history taught you anything? $ will flow into healthcare and end of life care and there won’t be a penny left",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxsllt/",
      "created": 1720839999,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxsqy1",
      "score": 1,
      "body": "Money , crypto currency, mutual funds ,",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxsqy1/",
      "created": 1720840069,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxt50t",
      "score": 1,
      "body": "It's bizarre to me that you think a bunch of millennials inheriting a pile of gold and running out and spending it all would *hurt* corporate profits or shareholders.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxt50t/",
      "created": 1720840250,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxtaoh",
      "score": 1,
      "body": "Will my parents and all of my friends parents just die already - fuck….  /s",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxtaoh/",
      "created": 1720840323,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxtksk",
      "score": 1,
      "body": "I would expect anyone with a large amount of wealth to have already started to transition it or will do so in a slower controlled process that will evade the most tax and not shock the market. The people they transfer too will also most likely have no debt and be investing this and growing most of it.  \n\nMedium amount to low amount of wealth will be more unplanned and taxed heavily by the government.  It will also be spread out over the next 0-40 years since people don’t die all at once.  This money will be a mix of more spend and some save.  \n\nI would expect it to go back into the market in a similar way. Probably less managed funds and more unmanaged low cost etfs by comparison though.  \n\nThis will keep markets going up and wide the wealth gap more. \n\nGood point by other commenters. A lot will go to assisted living and medical costs. Probably disproportionately a higher amount of the wealth of the medium to lower wealth individuals. Higher wealth individuals will be making more money on their investments then they spend on medial costs. ",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxtksk/",
      "created": 1720840452,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxu6xx",
      "score": 1,
      "body": "So many \"healthcare\" comments, and I don't disagree. Is this priced into something like VHT?",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxu6xx/",
      "created": 1720840736,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxu9c3",
      "score": 1,
      "body": "That money will be taxed in some fashion. Or the US fiscal situation will implode\n\nOr both\n\nUS annual deficits are nearing the parabolic phase and most boomers aren't even on social security or Medicare yet, I don't believe",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxu9c3/",
      "created": 1720840767,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxujo3",
      "score": 1,
      "body": "Millennials using boomer inheritance to buy Bitcoin",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxujo3/",
      "created": 1720840901,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxvhkp",
      "score": 1,
      "body": "*effect",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcxvhkp/",
      "created": 1720841345,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcy19iy",
      "score": 1,
      "body": "What transfer? All that wealth is going directly to the top.\n\n  \n1. reverse mortgages\n\n2. medical expenses\n\n3. assisted care expenses\n\n4. Funeral services. a few companies control all but #1 and will put the dying baby boomer into debt and get the house anyway. Often will attempt to dig into the pockets of their living relatives too and prey on their emotional state.\n\n  \nAll the wealth is going to a few people at the top. There is no great wealth transfer coming. You will be forced to work until you keel over. We're heading toward an economy and an inflation rate that will make losing $50k in stocks look hilariously small in the next decade.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcy19iy/",
      "created": 1720844185,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcy1pv2",
      "score": 1,
      "body": "It'll be spent on CC debt and housing. Squandered mostly. More wealth transfered to blue collar",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcy1pv2/",
      "created": 1720844415,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcyc909",
      "score": 1,
      "body": "I doubt there will be much wealth transfer, unless you preplan.\n\nThe transfer goes where you don't think.\n\nFrom what I've seen it is spent on elderly care. It goes fast at £2200 per week in nursing home costs.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcyc909/",
      "created": 1720850376,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcycvg5",
      "score": 1,
      "body": "I don’t think they pass on any money. They will soon start to die more rapidly and collectively and I think the only  benefit from that generation will be they are suddenly less of a burden on their children.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcycvg5/",
      "created": 1720850765,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcyfuvj",
      "score": 1,
      "body": "There won't be a transfer to millennials. Boomers plan to spend it all.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcyfuvj/",
      "created": 1720852654,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcyjipv",
      "score": 1,
      "body": "Little to none.  A large chunk of that will be eaten up by the healthcare industry.  My mom is paying almost $110K per year for nursing home care.  A lifetime of work and savings is being eaten up at a rate exponentially higher than it was earned in the 80s and 90s.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcyjipv/",
      "created": 1720855065,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcyk49u",
      "score": 1,
      "body": "It will ALL go offshore",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcyk49u/",
      "created": 1720855471,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcymb99",
      "score": 1,
      "body": "My parents plan on spending all their money before they die. As irresponsibly as possible too.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcymb99/",
      "created": 1720856979,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcypd11",
      "score": 1,
      "body": "To their kids",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcypd11/",
      "created": 1720859087,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcypflc",
      "score": 1,
      "body": "not sure where you get the idea that everyone will inherit a shitload of wealth.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcypflc/",
      "created": 1720859139,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcyxp4w",
      "score": 1,
      "body": "💎🙌",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcyxp4w/",
      "created": 1720865025,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcyy13v",
      "score": 1,
      "body": "U forget the 95% population outside of the US that is getting more wealthy all the time.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcyy13v/",
      "created": 1720865260,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcz1bie",
      "score": 1,
      "body": "I think you meant “effect” unless you man how will people feel about this.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lcz1bie/",
      "created": 1720867501,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lczbd0l",
      "score": 1,
      "body": "boomer money will be wasted on boomers",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lczbd0l/",
      "created": 1720873227,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lczdve0",
      "score": 1,
      "body": "I agree with the sentiment that most of the Boomer wealth will be spent on health care. It’s outrageously expensive. That generation is arguably one of the least physically healthy, although millennials are by far the least psychologically [healthy](https://www.bcbs.com/the-health-of-america/reports/the-health-of-millennials).\n\nI watched my grandfather, one of the wealthiest people I’ve ever known, burn through nearly $120,000 per month over the course of his 6 year battle with dementia/Alzheimer’s.\n\nBoomers have been conditioned to avoid [death](https://time.com/6257805/americans-aging-resistance/)—similar to any generation. But this time we have more tools for that, but they’re expensive.\n\nThe boomers who haven’t [saved](https://www.marketwatch.com/story/the-closer-people-are-to-retirement-the-less-ready-they-feel-survey-finds-11670862698) will run out and those who have saved will also run out. The system is designed to do so in my opinion",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lczdve0/",
      "created": 1720874475,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lczj17l",
      "score": 1,
      "body": "The selfishness and wickedness of this generation is absurd.  Do you have any idea how much crap the boomer generation went through?  All just to end up with a selfish entitled generation demanding they die and give up whatever money they’re sitting on.\n\nNo wonder the fired of hell never go out.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lczj17l/",
      "created": 1720876865,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lczjskm",
      "score": 1,
      "body": "Probably cheaper housing because more of us millennials are happy with 1 house. Hell, I don't even have 1 house.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lczjskm/",
      "created": 1720877200,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lczkouk",
      "score": 1,
      "body": "I'm an elder millennial with gen x parents in their late 50s. I'm not seeing shit for a good long while. I've been doing the inheritance math in my head recently though. The number is fucking staggering to me considering I've been near the poverty line and pay check to pay check my entire adult life.",
      "permalink": "/r/stocks/comments/1e1q8q7/what_will_the_affect_of_the_wealth_transfer_of/lczkouk/",
      "created": 1720877590,
      "depth": 0,
      "replies": []
    }
  ]
}