{
  "title": "AT&T data on ‘nearly all’ wireless customers accessed in hack",
  "score": 52,
  "selftext": "AT&T suffered a vast cyber security breach earlier this year, with hackers accessing the call and text message information of 110mn of the US telecoms company’s customers. \n\nOver 11 days in April, “threat actors” accessed and copied records of customer calls and texts from a period of several months in 2022 as well as on January 2 2023, AT&T said in a regulatory filing on Friday. \n\nThe compromised data included files related to “nearly all” of its cellular customers, customers of mobile virtual network operators using its wireless network, and landline customers who interacted with those cellular numbers between May and October 2022. AT&T said the breach from January 2 affected “a very small number of customers”. It is the second cyber security incident disclosed by AT&T this year, following an episode in March. \n\nThat also puts the Dallas-based group on a growing list of big US companies over the past 12 months that have contended with cyber security breaches, which includes healthcare giant UnitedHealth, consumer group Clorox, casino operators MGM Resorts International and Caesars Entertainment, and Supreme and North Face owner VF Corporation.\n\n  \nFull article without paywall: [https://www.archivebuttons.com/articles?article=https://www.ft.com/content/6bad5833-621e-46f0-802f-ffe747db152e](https://www.archivebuttons.com/articles?article=https://www.ft.com/content/6bad5833-621e-46f0-802f-ffe747db152e)\n\n  \n",
  "link_flair_text": "Company News",
  "id": "1e1txft",
  "num_comments": 1,
  "created_utc": 1720821794,
  "permalink": "/r/stocks/comments/1e1txft/att_data_on_nearly_all_wireless_customers/",
  "comments": [
    {
      "id": "lczxks8",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1e1txft/att_data_on_nearly_all_wireless_customers/lczxks8/",
      "created": 1720882727,
      "depth": 0,
      "replies": [
        {
          "id": "ld0n1ad",
          "score": 2,
          "body": "Wat",
          "permalink": "/r/stocks/comments/1e1txft/att_data_on_nearly_all_wireless_customers/ld0n1ad/",
          "created": 1720891943,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}