{
  "title": "DD on $MU: Why I'm All In with 1716 Shares🚀",
  "score": 77,
  "selftext": "\n\nHey WSB fam,\n\nI’ve gone all in on Micron Technology Inc. ($MU) with 1716 shares, and I want to break down my thorough due diligence (DD) on why this stock is a stellar investment. Buckle up, because this is going to be a deep dive into the fundamentals, technicals, industry trends, and strategic positioning of Micron Technology.\n\nCompany Overview\n\nMicron Technology Inc. is a leading provider of innovative memory and storage solutions. Their products include DRAM, NAND, and NOR memory, which are essential components in a wide range of applications, from computing and mobile devices to automotive and industrial markets.\n\n\n\n1.) Revenue:\n\nFor the fiscal year 2023, Micron reported revenue of $30.8 billion, a significant increase from $27.7 billion in 2022.\n\nNet Income:\n\nNet income for 2023 was $5.4 billion, showcasing their strong profitability.\n\nEPS: \n\nEPS stood at $4.85, reflecting robust earnings growth.\n\nBalance Sheet Strength:\n\nMicron boasts a solid balance sheet with healthy liquidity and low debt levels\n\nTotal Assets~$60.4 billion\nTotal Liabilities~ $15.9 billion\nCash and Cash Equivalents~ $10.5 billion\nDebt-to-Equity Ratio~0.26, indicating a conservative approach to leverage.\n\nCash Flow:\n\nStrong cash flow generation is a hallmark of Micron’s business\n\nOperating Cash Flow:\n\n$12.3 billion in 2023, highlighting their ability to generate cash from core operations.\n\nFree Cash Flow: \n\n$7.8 billion, providing ample room for reinvestment and shareholder returns.\n\n\n\n2.) Technical Analysis\n\nPrice Action and Trends\n\nMicron’s stock has shown a solid upward trajectory in recent months. Key technical indicators include:\n\n- Support and Resistance Levels:\n\nThe stock recently tested resistance at $136.95, and with strong buying pressure, it is poised for a potential breakout.\n\n\n- Moving Averages:\n\nThe stock is trading above its 20-day, 50-day, and 200-day moving averages, indicating bullish momentum.\n\n-Volume and Market Sentiment:\n\nVolume:\n\nIncreased trading volume suggests heightened investor interest and confidence in Micron’s prospects.\n\nRSI:\n\nThe RSI is currently at 60, suggesting that the stock is neither overbought nor oversold, indicating potential for further gains.\n\n\n3.) Industry Analysis\n\n\nThe global memory and storage market is poised for significant growth, driven by several key trends:\n\n- Data Explosion:\n\nThe proliferation of data across industries necessitates advanced memory solutions, benefiting companies like Micron.\n\n\n-AI and Machine Learning:\n\nThe rise of AI and machine learning applications demands high-performance memory, creating a robust market for Micron’s products.\n\n\n- 5G and IoT:\n\nThe expansion of 5G networks and the Internet of Things (IoT) will drive demand for faster and more efficient memory solutions.\n\n-Competitive Landscape:\n\n\nMicron competes with major players like Samsung and SK Hynix. However, Micron’s focus on innovation and strategic investments gives it a competitive edge. \n\n\n4.)Strategic Positioning\n\n\nMicron’s commitment to innovation is evident through their substantial R&D investments:\n\n- R&D Spending:\n\n$3.6 billion in 2023, highlighting their focus on developing cutting-edge technologies.\n\n\n- Product Innovation:\n\nIntroduction of advanced memory solutions like DDR5 DRAM and QLC NAND, positioning Micron as a technology leader.\n\n-Collaborations:\n\nPartnerships with tech giants like Intel and NVIDIA bolster Micron’s market reach and innovation capabilities.\n\n\n-Supply Chain:\n\nA robust supply chain ensures timely delivery of products, mitigating risks related to supply disruptions.\n\n\n5.)Risk Management\n\n-Diversification:\n\nWhile I’m heavily invested in $MU, diversification is crucial to managing risk. My portfolio includes other holdings that provide a buffer against market volatility.\n\n-Market Volatility:\n\n\nMicron operates in a cyclical industry, subject to market fluctuations. However, their strong financials and strategic positioning provide resilience against downturns.\n\n-Geopolitical Risks:\n\n\nAs a global company, Micron faces geopolitical risks. Their diversified operations and supply chain management help mitigate these risks.\n\n\n6.)Valuation\n\n-Price-to-Earnings Ratio:\n\n\nMicron’s current P/E ratio is 27, indicating that the stock is reasonably valued compared to its peers in the semiconductor industry.\n\n-Price-to-Book Ratio:\n\n\nThe P/B ratio stands at 2.5, reflecting a fair valuation relative to the company’s book value.\n\n-Growth Potential:\n\n\nAnalysts project strong growth for Micron, with a consensus target price of minimum $150, implying significant upside potential from current levels.\n\n\nTLDR: The Bull Case for $MU**\n\nStrong Fundamentals:\n\nMicron’s robust financials, including revenue growth, profitability, and cash flow, underpin the investment thesis.\n\nBullish Technicals:\n\nFavorable technical indicators and price action suggest potential for further gains.\n\nIndustry Tailwinds:\n\nPositive industry trends in AI, 5G, and data storage drive demand for Micron’s products.\n\nStrategic Advantages:\n\nInnovation, strategic partnerships, and a strong balance sheet position Micron for long-term success.\n\nRisk Management:\n\nDiversification and prudent risk management provide a safety net against market volatility.\n\n\nWith 1716 shares, I’m confident in Micron’s ability to deliver substantial returns. This is a long-term play with the potential for significant upside as market trends and technological advancements drive demand for memory and storage solutions.\n\n🚀 To the moon we go! 🌕🚀\n\n#DiamondHands #MU \n\nDisclaimer: \n\nThis is not financial advice. Always conduct your own research and consult with a financial advisor before making any investment decisions.\n\n",
  "link_flair_text": "DD",
  "id": "1e1xcgm",
  "num_comments": 157,
  "created_utc": 1720831162,
  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/",
  "url_overridden_by_dest": "https://i.redd.it/jn2m52tjm6cd1.jpeg",
  "comments": [
    {
      "id": "lcx7xpw",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 8 | **First Seen In WSB** | 4 weeks ago\n**Total Comments** | 19 | **Previous Best DD** | [x](https://i.redd.it/0eqbhjer887d1.jpeg) [x](https://i.redd.it/jn2m52tjm6cd1.jpeg) \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcx7xpw/",
      "created": 1720831170,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxc560",
      "score": 83,
      "body": "MU DD… well that takes me back to the old wsb.",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxc560/",
      "created": 1720832906,
      "depth": 0,
      "replies": [
        {
          "id": "lcxoxqf",
          "score": 43,
          "body": "This sub was so much fun back then.\n\nThe insults. \n\n\nThe memes \n\n\n~~The women~~\n\nWell 2 out of 3 anyway.",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxoxqf/",
          "created": 1720838344,
          "depth": 1,
          "replies": [
            {
              "id": "lcxqof1",
              "score": 16,
              "body": "FDs…",
              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxqof1/",
              "created": 1720839124,
              "depth": 2,
              "replies": [
                {
                  "id": "ld3l2ie",
                  "score": 4,
                  "body": "Remember that guy with the wolf mask? Pepperidge farm ‘members.",
                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld3l2ie/",
                  "created": 1720934914,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lcxz50e",
          "score": 14,
          "body": "Yep, back when a tech stock could actually go down, it was between $40 and $60 a share and fun to trade since it reports a week when almost no other major company is reporting. Now it’s $133 and continuously defying gravity. Will be interesting to see if this ever ends.",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxz50e/",
          "created": 1720843111,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ld175fy",
          "score": 6,
          "body": "MU 90c",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld175fy/",
          "created": 1720899300,
          "depth": 1,
          "replies": [
            {
              "id": "ldk97p4",
              "score": 4,
              "body": "It will undoubtedly get back to below $90 at some point but I think it has room to run at some point in the next 12 month.  \n\nHistorically PE hits 11-14x EPS and and I was figuring a $10-12 EPS based on last cycle.  This gives a range for top between  $110 and $168.  Now you might be thinking, haven't we already hit that?  I ran these numbers before the AI hype train showed up so I'm figuring there could easily be bit of a hype multiplier in there.  \n\nSide note, if you look at historical PE there is many spikes over 11-14x but those don't occur at the peak earnings instead more like we are right now when price spikes on forward looking earnings and typically crashes before those are realized because everyone is looking for the next sign of the downturn as to not be bag holding.",
              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ldk97p4/",
              "created": 1721190162,
              "depth": 2,
              "replies": [
                {
                  "id": "lolhmtr",
                  "score": 2,
                  "body": "You were SPOT ON",
                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lolhmtr/",
                  "created": 1727129152,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lolhoav",
                  "score": 1,
                  "body": "How do you feel about it now at 94 and reporting earnings on Wednesday",
                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lolhoav/",
                  "created": 1727129166,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "loqgtxn",
                      "score": 3,
                      "body": "Earnings are always a coin flip.  I would say it looks positioned for an up if earnings report is good/good unlike last time when stocked was pumped going in and primed to drop unless earnings/guidance both crushed.\n\nSafer play is normally run up into earnings, but I could see it jumping to the $100-$105 range if it reports solid.",
                      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/loqgtxn/",
                      "created": 1727204188,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "loqirja",
                          "score": 2,
                          "body": "I bought a $96c call on Friday when price was still $89, already sold because why risk earnings when the call price went from $2.59 to $4.05 in less than 24hrs.  I just took the quick 60% win and ran 😂",
                          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/loqirja/",
                          "created": 1727204790,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lcxnxlq",
          "score": 5,
          "body": "Last time MU was big on this sub I still had some hope for the future. I’m willing to go back.",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxnxlq/",
          "created": 1720837894,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcxoqim",
      "score": 31,
      "body": "fuck it im in for 1 share Monday morning at the opening.",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxoqim/",
      "created": 1720838255,
      "depth": 0,
      "replies": [
        {
          "id": "lcxoxn1",
          "score": 14,
          "body": "$133 well spent.",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxoxn1/",
          "created": 1720838343,
          "depth": 1,
          "replies": [
            {
              "id": "lm0hgh7",
              "score": 4,
              "body": "How are you feeling about MU now?",
              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lm0hgh7/",
              "created": 1725743096,
              "depth": 2,
              "replies": [
                {
                  "id": "lnzu12y",
                  "score": 3,
                  "body": "If he liked it at 133 he’ll love it at 89",
                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lnzu12y/",
                  "created": 1726801208,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lo03byl",
                      "score": 1,
                      "body": "How do you think it’ll do on earnings next week?",
                      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lo03byl/",
                      "created": 1726805531,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lo1j4ux",
                          "score": 3,
                          "body": "Demand has not changed. Guidance was weaker last time. I think they will beat but the stock goes sideways. The “hype” that seemed to carry this name is no longer there. Even after rate cuts people are cautious regarding chip stocks.\n\nVolatility is high but not as high as others. The only plays I have are bullish. Buy and hold or buy calls (10/18/24) slightly OTM $95 for $380 and pray.\n\nNo Leaps for this name. Think post-election we could be in trouble.",
                          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lo1j4ux/",
                          "created": 1726835938,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lo85hy1",
                              "score": 2,
                              "body": "Yeah I’ve been riding this since the last drop.  Was planning to tax loss this and hop into $SOXL when it was $25 and would have made back the loss but didn’t.  Not sure if I should hold $MU through earnings.  Post-election in trouble for the market or $MU specifically?",
                              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lo85hy1/",
                              "created": 1726934935,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lod4lgn",
                                  "score": 2,
                                  "body": "When I wrote this, I was referring to the market in general. I guess I’ll loop back on that one in Dec 25. I bought MU at $137… I feel your pain. If you’re in it still, I’d recommend holding. MU will probably go sideways unless they announce a buyback in the short term. If the market holds on and truly does have a soft landing, which is very possible then MU will prove to be a good buy at this range for 2025 and 2026. I think SOXL. It’s at 33.5 right now. We look like we’re sideways but the I think we’re getting ready for a run up into 50 by EOY.",
                                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lod4lgn/",
                                  "created": 1727014420,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "loriium",
                                      "score": 1,
                                      "body": "Yeah I was just concerned of another post ER catastrophic drop to compound my losses.  NVDA was my plan to tax loss into when they were near same price but NVDA rebounded, then I eyed SOXL but held back since I’d be selling at what I perceived to be the near term bottom for MU.  Which it has rebounded a bit but not nearly to the extent of SOXL",
                                      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/loriium/",
                                      "created": 1727216336,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lorj8qp",
                                          "score": 2,
                                          "body": "Hate to say this, but how much lower can it go? It already took such a beating from the market before. Don't really see it getting any more crushed. Still think SOXL is the move from now \\~$35.5 -->$45. Think MU is a hold. Tech confidence coming back",
                                          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lorj8qp/",
                                          "created": 1727216600,
                                          "depth": 9,
                                          "replies": []
                                        },
                                        {
                                          "id": "loxlxn4",
                                          "score": 1,
                                          "body": "Calls were expensive…",
                                          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/loxlxn4/",
                                          "created": 1727304692,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcxzu0h",
      "score": 34,
      "body": "Former Semi Cap Industry Employee (understand this industry deeply) & Micron shareholder from 2016 - 2024:\n\nMicron has been one of my best IRR returns and also worst positions paradoxically. Ultimately I no longer hold Micron.\n\nWhat I learned is it is extremely hard to predict the supply/demand cycles for memory. Because memory is a commodity, the memory business is actually tough for three reasons:\n1. Prices for DRAM and NAND are deflationary in nature. Good for consumers; tough business for MU/Samsung/Hynix when they need to spend through Capex cycles while facing deflationary cycles. Micron has yet to reach peak gross margin like it did back in the 2018 cycle\n2. The cost basis (pay to play) for DRAM is now going require EUV. See point 1 on gross margins\n3. Semi cap (maybe not now because multiples are so high) are just higher quality companies in terms of gross margin, FCF, & product differentiation of not having to deal with commodity pricing. I hold the portfolio of LAM, KLA, ASML. Never selling. \n\nThe X factor maybe High Bandwidth Memory. I have since left the semi industry, but if you are long Micron you really have to believe HBM is going to be such a differentiated product that it can generate 60% gross margins and sustain those gross margin through the “winter cycles”\n\nKudos to Micron management though. Having seen them weather 2016, 2020 downturns, they are in much better financial shape in FCF and balance sheet than before.\n\nUltimately, it’s the commodity pricing reason and not having any ability to control cycles is the reason I’m no longer a share holder. Hope this perspective helps. You should always see both sides and hope these disclosures help you even if you choose to hold",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxzu0h/",
      "created": 1720843457,
      "depth": 0,
      "replies": [
        {
          "id": "lcy0a0l",
          "score": 14,
          "body": "Thank you for this great response and different perspective. You are 100% correct about the demand cycles for memory. \n\nI am very bullish because of HBM, so I guess it’s safe to say that I am long on that ‘X factor’. Seeing that they are already sold out for 2025, I believe the demand cycle is still rising.\n\nBest of luck to you and your investments you hold as well",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcy0a0l/",
          "created": 1720843683,
          "depth": 1,
          "replies": [
            {
              "id": "lczlgr4",
              "score": 3,
              "body": "As I’ve said before, MU does not have significant market share in HBM, <5%.  Dominated by Hynix and sec.  Likely will not own significant market share of other 3d memory products as well.  ",
              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczlgr4/",
              "created": 1720877926,
              "depth": 2,
              "replies": [
                {
                  "id": "lczmagp",
                  "score": 2,
                  "body": "It’s true that SK Hynix currently leads the high-bandwidth memory market, holding around 50% of the market share. Samsung follows with about 40%, leaving Micron with a smaller share, around 10%.\n\nHowever, Micron is making significant strides imo. They announced plans to capture a 20-25% market share in HBM by 2025, largely driven by their advancements in HBM3e and future HBM4 products, and targets 25% HBM Market Share by 2025.\n\nYes, SK Hynix and Samsung are indeed dominant players for now. Micron’s advancements and strategic moves suggest that they are a big competitor in the HBM market. The investment in Micron is not just based on their current market share but also on their potential for growth and innovation in this space.",
                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczmagp/",
                  "created": 1720878280,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lczmwht",
                      "score": 5,
                      "body": "They invented HBM and are behind 10 years later.  Not convinced they will catch up.  Likely still large markets available.  I do R&D for advanced packaging at major supplier….the attention  is all on korea",
                      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczmwht/",
                      "created": 1720878537,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lczntkq",
                          "score": 0,
                          "body": "\nCongrats. \n\nMy earnings the past year from owning the stock say different though. From a financial perspective, it seems like the company is in good position for the present & future.\n\nBest of luck",
                          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczntkq/",
                          "created": 1720878918,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lczqwwz",
                              "score": 3,
                              "body": "something something rising tide",
                              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczqwwz/",
                              "created": 1720880162,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ld0ijh2",
                                  "score": 1,
                                  "body": ">My earnings the past year from owning the stock say different though.\n\nHe uses past performance to predict future performance \n\nLOL",
                                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld0ijh2/",
                                  "created": 1720890325,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lczwboq",
              "score": 2,
              "body": "> I am very bullish because of HBM\n\nthis is literally the first time you even mentioned hbm, and it comes after i made 2 comments about it (and the lack of it in your \"comprehensive\" dd)... both of which you evaded, and now another poster's comment about it.  also, if you cared about hbm, you'd want to stay miles away from mu.\n\nyou're full of shit.",
              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczwboq/",
              "created": 1720882255,
              "depth": 2,
              "replies": [
                {
                  "id": "ld0itk0",
                  "score": 3,
                  "body": "> My earnings the past year from owning the stock say different though. \n\nOP just likes the STONK\n\nlol",
                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld0itk0/",
                  "created": 1720890426,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lczwpwh",
                  "score": 2,
                  "body": "Thanks for your comments, but calling my DD “full of shit” because I didn’t mention HBM right away is shortsighted. \n\nMy focus on HBM underscores its crucial role in my investment thesis. HBM demand is skyrocketing due to AI and high-performance computing needs. Micron’s advancements in HBM3E and future tech are key drivers for growth.\n\nInvesting isn’t about hitting every keyword in a single post; it’s about understanding the full picture and strategic positioning. \n\n\nNext time, try to keep the conversation productive instead of instantly attacking an OP bc you have a different view",
                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczwpwh/",
                  "created": 1720882405,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lczxvzw",
                      "score": 0,
                      "body": "> Thanks for your comments, but calling my DD “full of shit” because I didn’t mention HBM right away is shortsighted. \n\ni called YOU full of shit because you omitted hbm and lied about micron's position... AND because you evaded my posts about hbm/sk hynix, but then magically cited hbm as the reason why you're bullish - which is even more laughable, given that hbm is why micron's in trouble.\n\ni don't just think you're full of shit - i know you are.  your comments were a dead giveaway.\n\n>Next time, try to keep the conversation productive \n\nlolz @ someone who got caught lying/evading saying this.  fuck off, lies aren't productive conversation, hypocrite.",
                      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczxvzw/",
                      "created": 1720882843,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lczya7g",
                          "score": 1,
                          "body": "You exhibit psychopath behavior, which is why I evaded your posts.\n\nBest of luck to you and your investments",
                          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczya7g/",
                          "created": 1720882991,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lczyjrw",
                              "score": 0,
                              "body": "dat projection\n\nyou're lying on here to pump a stock you own.  you got caught (repeatedly).  keep throwing stones.",
                              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczyjrw/",
                              "created": 1720883091,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lczzhba",
                                  "score": 1,
                                  "body": "Lying, how? Lmao\n\nWhat part of I’ve been in this stock pre $100 a share don’t you understand? \n\nPumping a stock I own? I posted this in DD bc I see value in the company, and wanted to share my insight/reasoning for investing. I Don’t need to pump a stock I own when I make your monthly income off a 1% move in EITHER direction.",
                                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczzhba/",
                                  "created": 1720883437,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ld006m4",
                                      "score": 2,
                                      "body": "> Lying, how? Lmao\n\n...seriously?  0 mention of hbm in your bigass \"comprehensive\" dd.  0 mention of hbm until 3 comments are posted about it, in which you magically are bullish on micron because hbm...which was exempt.\n\nyou also lied in the dd, like i already pointed out (which you also evaded).\n\n>What part of I’ve been in this stock pre $100 a share don’t you understand? \n\n??? nothing.  nothing, at all.  it's why you're lying to pump it.  your motive.\n\n> posted this in DD bc I see value in the company,\n\nffs, dd means due diligence, which you clearly never even did, given that you obviously knew nothing about hbm given that you didn't even mention it until we did... and then when you pretended to know/care, you got it backwards.\n\nobvious liar obviously lied.",
                                      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld006m4/",
                                      "created": 1720883696,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "ld00lsf",
                                          "score": 0,
                                          "body": "Wow, ok, I guess if you really feel that way then I can’t change your mind.\n\nI hope my lying really ruins your day, and the rest of your week crazy Rob",
                                          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld00lsf/",
                                          "created": 1720883852,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lczwdwi",
          "score": 1,
          "body": "\"everything is bad for mu\"",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczwdwi/",
          "created": 1720882278,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcxa9md",
      "score": 16,
      "body": "I need more friends like that that straddle and covered calls. Good setup",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxa9md/",
      "created": 1720832129,
      "depth": 0,
      "replies": [
        {
          "id": "lcxakh9",
          "score": 9,
          "body": "Hedging is always key!\n\nDefinitely has been helping with the large position and generating a nice income while it’s down short term. Wheel method has been my go to strategy since I have learned it",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxakh9/",
          "created": 1720832254,
          "depth": 1,
          "replies": [
            {
              "id": "lcyjvte",
              "score": 1,
              "body": "What’s this strategy",
              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcyjvte/",
              "created": 1720855311,
              "depth": 2,
              "replies": [
                {
                  "id": "lczjujk",
                  "score": 1,
                  "body": "The wheel strategy,\n\nSell covered calls, sell cash secured puts",
                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczjujk/",
                  "created": 1720877224,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ld1ml2p",
                      "score": 2,
                      "body": "Can you PayPal me some cash off that free money glitch 🫣🫣🫣",
                      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld1ml2p/",
                      "created": 1720904990,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcxvdl8",
      "score": 9,
      "body": "lol ‘diversification and risk management’ - so are you all in, or are you diversified? or did you just copy paste from chatgpt 😂",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxvdl8/",
      "created": 1720841293,
      "depth": 0,
      "replies": [
        {
          "id": "lcxvmup",
          "score": -1,
          "body": "I can be all in on an investment, and still have diversification & risk management in the form of selling options.",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxvmup/",
          "created": 1720841414,
          "depth": 1,
          "replies": [
            {
              "id": "lcxw0am",
              "score": 8,
              "body": "yeah sorry mate, i don’t think that selling options is what chatgpt had in mind when it said “my portfolio contains other holdings that provide a buffer against market volatility” 😂😂😂\n\nso just to be clear, you really are all in and don’t own any other names, correct?",
              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxw0am/",
              "created": 1720841591,
              "depth": 2,
              "replies": [
                {
                  "id": "lcxwhlk",
                  "score": 4,
                  "body": "I’m not your mate, and you are mad weird",
                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxwhlk/",
                  "created": 1720841821,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcxwl5u",
                      "score": 5,
                      "body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)",
                      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxwl5u/",
                      "created": 1720841869,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcxbnt8",
      "score": 8,
      "body": "MU ceo are too chicken. Even with good earnings, they don't dare to invest to up their production line and rather maintain their status quo. Bad guidance will not move the price up",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxbnt8/",
      "created": 1720832707,
      "depth": 0,
      "replies": [
        {
          "id": "ld07g6w",
          "score": 5,
          "body": "Bro the reason they sold off is because they increased their capex based on massive growth. Samsung has their people striking, micron will be coming to win. I’m long 179 shares and 4 calls out to 8/16",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld07g6w/",
          "created": 1720886326,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcxh814",
          "score": 4,
          "body": "Micron is building a giant new fab in Boise and New York. All that chips act money.",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxh814/",
          "created": 1720835030,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lcxc2m3",
          "score": 2,
          "body": "I see your view, and stance. But would have to respectfully disagree. I believe the YoY & Qtr after Qtr increased revenue, free cash flow, and net income are enough guidance for the share price to increase with time!",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxc2m3/",
          "created": 1720832877,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcxkihx",
      "score": 7,
      "body": "i think we can easily see anywhere between 180-200 EOY",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxkihx/",
      "created": 1720836410,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxe1qa",
      "score": 6,
      "body": "But when am I gonna make all the money I was promised before it tanked after exceeding earnings expectations",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxe1qa/",
      "created": 1720833696,
      "depth": 0,
      "replies": [
        {
          "id": "lcxg4f3",
          "score": 3,
          "body": "I can’t time the market, nor do I invest just because earnings hype. \n\nI’ve been investing here pre $100 a share, for the long term. What I can say for sure is, there’s plenty of ways make money in the long run and short term, without gambling.\n\nBest of luck",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxg4f3/",
          "created": 1720834569,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcyl9qd",
      "score": 4,
      "body": "I hope you are right, I sold all my $12k QCOM stocks to buy MU days before the last earning report and I’m still on red numbers 🤕",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcyl9qd/",
      "created": 1720856259,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxg7vy",
      "score": 8,
      "body": "Been trading this daily for a couple weeks.   Earnings gave me confidence in longer term and it loves to dip low 130s and rip to 135 to 137.   Buying 130 calls a couple weeks out has been a great play for me.    Hoping this breaks out like amd did a week or so ago",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxg7vy/",
      "created": 1720834609,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ld61sax",
      "score": 4,
      "body": "-Geopolitical Risks:\n\nAs a global company, Micron faces geopolitical risks. Their diversified operations and supply chain management help mitigate these risks.\n\n-Supply Chain:\n\nA robust supply chain ensures timely delivery of products, mitigating risks related to supply disruptions.\n\nI'd be questioning those more with elections coming up.\n\nThe Jan 6th traitor hates China.  Its base hates China.  \n\n\"Tariffs have become a flashpoint in the 2024 presidential campaign as candidate Trump has proposed a new 10 percent universal tariff on all imports and a 60 percent tariff on all imports from China, as well as potentially higher tariffs on EVs from China or across the board.\"\n\nChina produces \\~60% of all rare earth elements and processes \\~90%.\n\nDoes your modeling for Micron compensate both ways post-election?  We've only recently discovered a large, rare earth metal deposit in Europe.  How long will the strategic rare earth metal processing center President Biden partially funded take to come online? \n\nE Pluribus Unum",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld61sax/",
      "created": 1720978491,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcy8dbd",
      "score": 5,
      "body": "Mu just mirrors Nvidia, it has no movement of its own. Just invest in Nvidia instead of all of its cheerleaders.",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcy8dbd/",
      "created": 1720848047,
      "depth": 0,
      "replies": [
        {
          "id": "lcyajnh",
          "score": 3,
          "body": "I noticed this too",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcyajnh/",
          "created": 1720849335,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lczv44u",
          "score": 3,
          "body": "Claiming that MU just mirrors Nvidia is like saying a car engine mirrors the tires. Sure, they work together, but they serve entirely different purposes. Micron’s memory tech is essential across multiple industries, not just for Nvidia’s GPUs. \n\nLimiting your investment to Nvidia ignores the broader opportunities and diverse applications Micron offers. \n\nNext time, dig a little deeper before making such simplistic comparisons.",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczv44u/",
          "created": 1720881794,
          "depth": 1,
          "replies": [
            {
              "id": "lczzjwu",
              "score": 1,
              "body": "We're talking about the stocks movement here, not what the company does.\n\nYes in a perfect world stocks would have values reflective of their companies, but they don't. Otherwise tesla would be 0 :).",
              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczzjwu/",
              "created": 1720883464,
              "depth": 2,
              "replies": [
                {
                  "id": "ld00awf",
                  "score": 1,
                  "body": "So you are saying that microns increase in share price over the past year isn’t because of the companies financial performance, only because Nvidia has risen in price?",
                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld00awf/",
                  "created": 1720883740,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ld02ako",
                      "score": 3,
                      "body": "Would Micron have performed if Nvidia did not exist? Would Micron ever gain any more value in any way if Nvidia just got deleted from existence?\n\nAnyways, we're talking about the current stock value, not how it moved in the past. For the past 2 weeks Micron has mirrored Nvidia's movements to a T almost and it's actually been really easy to make money off of because of how it lags.\n\nIf Nvidia spikes up Micron usually follows within 10 minutes, but WHEN not IF Nvidia dips back down Micron is usually delayed by 30min-1hour.\n\nCould Micron break out and away from this pattern by innovating something new or having phenomenal earnings? Sure. Do I see it happening anytime in the next few months? No.\n\nMicron will probably go up so the play itself isn't dumb. But all semis will go up next month because Nvidia itself will go up. Nvidia is far easier to predict than any of the other chip companies, and I really don't get the point of betting on a company when it's heavily reliant on the performance of another one.\n\nIf MU bombs back down to 0 Nvidia won't care, it will probably stay flat. If Nvidia bombs back down to 0 MU will also follow Nvidia to 0. You add more risk to your gamble by adding another factor.",
                      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld02ako/",
                      "created": 1720884471,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ld02lr6",
                          "score": 2,
                          "body": "Nice perspective.\n\nThank you for sharing this",
                          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld02lr6/",
                          "created": 1720884582,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ldsc771",
                              "score": 1,
                              "body": "Hope you recover brother.",
                              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ldsc771/",
                              "created": 1721317388,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ldsce7a",
                                  "score": 1,
                                  "body": "Sold covered calls for all 1700 shares before the drop, earned a 40k premium all together, and protected on the downside",
                                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ldsce7a/",
                                  "created": 1721317450,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ldscsro",
                                      "score": 1,
                                      "body": "It oversold for sure, I bought some calls for next week. Will probably rebound to 120, don't see it going higher until we get closer to Nvidia earnings or biden/trump walkback what they said.",
                                      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ldscsro/",
                                      "created": 1721317579,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "ldsg2im",
                                          "score": 1,
                                          "body": "Yeah I am Probly gonna load up on 700 more shares this dip, \n\n1.) bc I like the stonk\n2.) to avg down a bit\n3.)I don’t mind taking another ride to $160",
                                          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ldsg2im/",
                                          "created": 1721318646,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcydn3h",
      "score": 4,
      "body": "The fact that this \"DD\" never mentions 1) HBM 2) SK Hynix's role in HBM 3) Why NVDA gives a fuck means that you should inverse whatever this clown does.",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcydn3h/",
      "created": 1720851248,
      "depth": 0,
      "replies": [
        {
          "id": "lczkk3r",
          "score": 6,
          "body": "Put your money where your mouth is then!",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczkk3r/",
          "created": 1720877533,
          "depth": 1,
          "replies": [
            {
              "id": "lczmip6",
              "score": 2,
              "body": "Nah man, your dd is a bunch of BS, without any real technical basis or knowledge, and lacks actual foresight.  That being said, chips act and ai hype will likely revenue increase…. They’re not intel after all",
              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczmip6/",
              "created": 1720878376,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ld07me7",
          "score": 3,
          "body": "Micron has the best HBM3E chip in the market that goes with Blackwell. Way more energy efficient than SK Hynix. Also the market is large enough for more than 1 player",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld07me7/",
          "created": 1720886389,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ld0duss",
      "score": 3,
      "body": "Thanks ChatGPT",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld0duss/",
      "created": 1720888652,
      "depth": 0,
      "replies": [
        {
          "id": "ld1t3cv",
          "score": 2,
          "body": "They don't even try to hide it anymore",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld1t3cv/",
          "created": 1720907484,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ld0xdn4",
      "score": 3,
      "body": "What is shares? Is it like a new kind of options?",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld0xdn4/",
      "created": 1720895706,
      "depth": 0,
      "replies": [
        {
          "id": "ld12j0v",
          "score": 2,
          "body": "![img](emote|t5_2th52|4258)",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld12j0v/",
          "created": 1720897579,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ld3uhb3",
      "score": 3,
      "body": "Ur welcome. I got in pre dump",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld3uhb3/",
      "created": 1720940500,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ld487gh",
      "score": 3,
      "body": "I am here with 1350 shares.",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld487gh/",
      "created": 1720949767,
      "depth": 0,
      "replies": [
        {
          "id": "ld5dty9",
          "score": 2,
          "body": "Nice position status. I’d suggest selling some covered calls to get paid while owning the stock, if you aren’t already",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld5dty9/",
          "created": 1720970263,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ld74427",
      "score": 3,
      "body": "I'm still hurt from MU earnings",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld74427/",
      "created": 1720992174,
      "depth": 0,
      "replies": [
        {
          "id": "ld74gnm",
          "score": 4,
          "body": "Even though they beat ![img](emote|t5_2th52|4260)",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld74gnm/",
          "created": 1720992296,
          "depth": 1,
          "replies": [
            {
              "id": "ld74j51",
              "score": 2,
              "body": "![img](emote|t5_2th52|52627)",
              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld74j51/",
              "created": 1720992320,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lda83sz",
      "score": 3,
      "body": "One of the true regards",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lda83sz/",
      "created": 1721048006,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxe868",
      "score": 5,
      "body": "Im 20 and have made 35k so far from 1k. just went balls deep into Micron with a third of my portfolio",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxe868/",
      "created": 1720833769,
      "depth": 0,
      "replies": [
        {
          "id": "lcxfbo7",
          "score": 6,
          "body": "2025-2030 is gonna be a wild ride!",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxfbo7/",
          "created": 1720834235,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcxe5ma",
      "score": 4,
      "body": "I used to work for MU and I can tell you that the morale at the company is at its all time low. The leadership team and their decisions about their employees has a lot of people scratch their heads and look for a way out of the company. No matter how they dress it up during ER calls, their innovation is a far cry from what it used to be. I would not invest in MU for this reason alone. When you have engaged employees, magic happens. MU is not that place. Just my 2 cents",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxe5ma/",
      "created": 1720833740,
      "depth": 0,
      "replies": [
        {
          "id": "lcxezk6",
          "score": 3,
          "body": "Thanks for sharing your perspective from Micron , along w/ insights into morale and leadership. However, my investment decisions prioritize objective financial metrics, market trends, and strategic positioning over anecdotal reports.\n\nInternal morale is important, but my decision to invest in $MU is grounded in comprehensive due diligence. Financial performance, industry positioning, and technical indicators present a strong case for the stock’s potential. Investors should focus on objective data and market dynamics.\n\nBest regards",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxezk6/",
          "created": 1720834091,
          "depth": 1,
          "replies": [
            {
              "id": "lcxw7ec",
              "score": 2,
              "body": ">  but my decision to invest in $MU is grounded in comprehensive due diligence.\n\nand yet, your dd began by calling them a \"leading\" memory supplier... and failed to even mention hbm.  clown shoes.",
              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxw7ec/",
              "created": 1720841686,
              "depth": 2,
              "replies": [
                {
                  "id": "lcymenr",
                  "score": 1,
                  "body": "chatgpdd type post",
                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcymenr/",
                  "created": 1720857046,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ld1wt0l",
      "score": 2,
      "body": "used to trade down to .5 Book Value in deep downturn, and it went up to 4 at the highs, right now 3.35\n\ni pass, good luck",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld1wt0l/",
      "created": 1720908962,
      "depth": 0,
      "replies": [
        {
          "id": "ldk7lad",
          "score": 1,
          "body": "Eh, MU bottomed out at around $9.75, $28, and $48 during the last few cycle down turns. I think the price to book was something like 1.2 those times.",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ldk7lad/",
          "created": 1721189349,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lg86wul",
      "score": 2,
      "body": "Pain.",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lg86wul/",
      "created": 1722644488,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxv3w7",
      "score": 4,
      "body": ">I’ve gone all in on Micron Technology Inc. ($MU) with 1716 shares, and I want to break down my **thorough due diligence (DD)** on why this stock is a stellar investment. Buckle up, because this is going to be a deep dive into the fundamentals, technicals, industry trends, and strategic positioning of Micron Technology.\n\n>Company Overview\n\n>**Micron Technology Inc. is a leading provider of innovative memory** and storage solutions.\n\ndude.  essentially, the first sentence of the dd is wrong.  lolz.  they're WAY behind sk hynix.  both in quality and quantity.\n\nctrl+f \"hbm\" - yielded  zero results.  oof.  op knows nothing about this, like at all.  \n\neta: mu $90, never forget",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxv3w7/",
      "created": 1720841165,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxbslf",
      "score": 3,
      "body": "So should I get 100 shares and yolo?",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxbslf/",
      "created": 1720832761,
      "depth": 0,
      "replies": [
        {
          "id": "lcxccda",
          "score": -1,
          "body": "I think it’s currently fair valued. \n\nI would never suggest buying options, as I am a writer of them and know you will only get burned short term. Buy-Write would be the best way to go IMO. Do not sell leap calls, I recommend selling weekly/monthly’s for a hedge/income generation",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxccda/",
          "created": 1720832989,
          "depth": 1,
          "replies": [
            {
              "id": "lcxlutd",
              "score": 3,
              "body": "Fair value means undervalued in ai",
              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxlutd/",
              "created": 1720836985,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcxvdoq",
              "score": 2,
              "body": "> I would never suggest buying options\n\nwelp",
              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxvdoq/",
              "created": 1720841294,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lcxdn48",
              "score": 3,
              "body": "Nah. I just buy shares and hold long term",
              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxdn48/",
              "created": 1720833526,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ld5z2zb",
      "score": 2,
      "body": "You bought at all time high good job bro 👏",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld5z2zb/",
      "created": 1720977575,
      "depth": 0,
      "replies": [
        {
          "id": "ld6fh7b",
          "score": 2,
          "body": "No? Last time I checked, all time high was about $157",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld6fh7b/",
          "created": 1720983170,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcz2han",
      "score": 1,
      "body": "I have friends in Boise and they are all cashing out.",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcz2han/",
      "created": 1720868248,
      "depth": 0,
      "replies": [
        {
          "id": "lgs47ph",
          "score": 0,
          "body": "Just because they work for Micron doesn’t mean they know shit about the company. I work for a big tech company myself that is poised to do good. I’m a senior engineer with multiple years of experience and I still don’t know jack shit about what the future holds for my company.",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lgs47ph/",
          "created": 1722956244,
          "depth": 1,
          "replies": [
            {
              "id": "lgs580x",
              "score": 1,
              "body": "Stock is down 32% since I made this post, they have been selling since June.",
              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lgs580x/",
              "created": 1722956569,
              "depth": 2,
              "replies": [
                {
                  "id": "lgs9oes",
                  "score": 1,
                  "body": "They could be selling due to the fear of recession/stagflation/Nvidia etc, you’re acting like micron is the only stock that’s down. Just take a look around, everything is down. Especially tech. I highly doubt your friends know any valuable information about the future of the company that’s worth acting on.\n\nEdit — since you mentioned June, micron was heading towards all the time highs and they had performed really well in May. Who’s to say that they weren’t just taking profits. If I’m up an ungodly amount on my RSU’s I’d be selling too.",
                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lgs9oes/",
                  "created": 1722957987,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ld19me1",
      "score": 1,
      "body": "What’s a share?",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/ld19me1/",
      "created": 1720900218,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgw6541",
      "score": 1,
      "body": "Same, but pain now:(",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lgw6541/",
      "created": 1723006888,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lit9p7r",
      "score": 1,
      "body": "It's been a month. Have you filled out your Wendy's application yet?",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lit9p7r/",
      "created": 1724033588,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lk02vrt",
      "score": 1,
      "body": "OP wtf is happening with this stock currently",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lk02vrt/",
      "created": 1724674603,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llrudkt",
      "score": 1,
      "body": "Damn how much are you down?",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/llrudkt/",
      "created": 1725618182,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lox10e0",
      "score": 1,
      "body": "if ur still holding good job",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lox10e0/",
      "created": 1727297562,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loyc7hd",
      "score": 1,
      "body": "Things looking up for you now! I don’t see any problems with this thing hitting $130 before December now.\n\nI have some Oct 11th 105strikes that I bought this morning at an average cost basis of $2.48 a contract, with this after hours surge I don’t see them selling below $8.00 a contract tomorrow lol, I’m just wondering if I should hold for a few more days or not it could go even higher a quick retrace to the $130-$140. Honestly it wouldn’t be crazy to see it that high next week. ",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/loyc7hd/",
      "created": 1727314408,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcxo3w1",
      "score": 1,
      "body": "Don’t rly understand Webull \n\nSo you bought shares and then sold covered calls on them?",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxo3w1/",
      "created": 1720837973,
      "depth": 0,
      "replies": [
        {
          "id": "lcxoiao",
          "score": 2,
          "body": "Correct. These are Take profit long covered calls I sold when I first started buy-writing. \n\nWas intrigued by the large premium, and soon realized there was a catch to that. \n\nI sell weeklies now with the remaining 1500 shares, and will let those 200 get assigned at expiration, or roll up and out further if possible.\n\nWebull sure does have a weird way of showing it lol.",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxoiao/",
          "created": 1720838153,
          "depth": 1,
          "replies": [
            {
              "id": "lcxxh52",
              "score": 0,
              "body": "Yeah MU as it currently sits is perfect for collecting premium from covered calls\n\nIt’s been trading sideways since earnings \n\nWorst case your covered calls get assigned and you take premium plus profit\n\nBest case it trades sideways for a month while you collect premium and then sell it for profit eventually",
              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxxh52/",
              "created": 1720842295,
              "depth": 2,
              "replies": [
                {
                  "id": "lcxzjjd",
                  "score": 3,
                  "body": "> Worst case your covered calls get assigned and you take premium plus profit\n\numm...",
                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxzjjd/",
                  "created": 1720843310,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcy3toh",
                      "score": -1,
                      "body": "What?",
                      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcy3toh/",
                      "created": 1720845512,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lcy4wen",
                          "score": 3,
                          "body": "that's... not even close to the worst case scenario.",
                          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcy4wen/",
                          "created": 1720846087,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lcya4z8",
                              "score": 1,
                              "body": "Worst case scenario is MU goes bankrupt and your shares become worthless but we both know that’s very unlikely to happen\n\nEventually the stock will go back up and you sell for profit + all the premium you would have got from selling covered calls \n\nIf you’re thinking MU goes way past your covered call strike and you lose out on additional profit I don’t rly see that as a loss since you set the call with intent to sell at that price",
                              "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcya4z8/",
                              "created": 1720849090,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lcycol5",
                                  "score": 2,
                                  "body": "wow.  so you think the worst scenario is getting called away, followed by bankruptcy.  i mean, sure the latter is.\n\n...or/but it could drop by 15% after hours and you can't even sell because you need to wait til market open to close the calls first and wait for analyst downgrades /etc to drop the stock even further, but at least the $1 in premium mitigated the $30/share loss... which i guess isn't as bad as being called away.",
                                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcycol5/",
                                  "created": 1720850646,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lczwf4y",
                                      "score": 1,
                                      "body": "Ok but stonks only go up\n\nEspecially for a stick like MU there’s no doubt it will go up by 10-15% eventually",
                                      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczwf4y/",
                                      "created": 1720882292,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lczxjd8",
                                          "score": 1,
                                          "body": "press x to doubt",
                                          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczxjd8/",
                                          "created": 1720882712,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lcxxo9w",
                  "score": 1,
                  "body": "This is the 🔑!",
                  "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxxo9w/",
                  "created": 1720842392,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lcxyvu4",
                      "score": 1,
                      "body": "I wish I had the money for 100 shares 😂",
                      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxyvu4/",
                      "created": 1720842983,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lcxubbx",
      "score": 1,
      "body": "You’re a couple years too late bro",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcxubbx/",
      "created": 1720840793,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lcz8a1s",
      "score": 1,
      "body": "can you explain your strategy on this stock \ni mean covered call position?",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcz8a1s/",
      "created": 1720871597,
      "depth": 0,
      "replies": [
        {
          "id": "lczjmrr",
          "score": 1,
          "body": "The 2 covered call position here are take profit long covered calls I sold when I first started buying shares pre $100.\n\nWas intrigued by the fairly large premium, and soon realized there was a catch to that.\n\nI sell weeklies now with the remaining 1500 shares, and will let those 200 get assigned at expiration, or roll up and out further if possible.\n\nIf I get assigned, I turn around a sell a cash secured put to reinvest and get back in at a price I want.",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lczjmrr/",
          "created": 1720877130,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lcy8epi",
      "score": 0,
      "body": "Betting that a stock will gain 80% in 2.4 years is called gambling. You better hope we are not in the middle of a correction, bear market or recession. Corrections happen every 2 years on average.",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcy8epi/",
      "created": 1720848069,
      "depth": 0,
      "replies": [
        {
          "id": "lcy941z",
          "score": 1,
          "body": "Shut up pussy. Sir this is a casino",
          "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lcy941z/",
          "created": 1720848480,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lqppjsi",
      "score": 1,
      "body": "thanks for the DD. here 10X MU next year..... who know baby.... moon soon",
      "permalink": "/r/wallstreetbets/comments/1e1xcgm/dd_on_mu_why_im_all_in_with_1716_shares/lqppjsi/",
      "created": 1728265798,
      "depth": 0,
      "replies": []
    }
  ]
}