{
  "title": "Xi Jinping’s Great Economic Rewiring Is Cushioning China’s Slowdown Thanks to Electric Vehicle, Solar, and Semiconductor Sectors",
  "score": 155,
  "selftext": " > While Japan and America both suffered deep economic setbacks when their housing markets hit the skids, China’s tech advances and resulting export boom have helped to keep economic growth within reach of its targeted pace of around 5%. \n\n> If Beijing can keep batting away US-led containment efforts, exclusive analysis from Bloomberg Economics forecasts the hi-tech sector will account for 19% of gross domestic product by 2026, up from 11% in 2018. Combining what Beijing has dubbed the “new three” — EVs, batteries and solar panels — the proportion of GDP swells to 23% of GDP by 2026, more than enough to fill the void from the ailing real estate sector, which is set to shrink from 24% to 16%. \n\n> GDP related to high-tech industries — including medicine, advanced equipment, information technology and communications equipment and services, and research and development — expanded 12% on average between 2018 and 2023, significantly faster than the nominal GDP growth of 7%. Bloomberg Economics’s projections are based on the assumption that the industries can largely keep their current growth pace.\n\n> China’s total factor productivity — a measure of how efficiently resources are used to generate output — has been stuck at around 40% of that of the US since 2008, according to Wang Yiming, a long-time state adviser. Korea and Japan reached 60% and 80% of US productivity, respectively, before their economic rise relative to the US began to stall. It will be an “uphill battle” for China to push for faster productivity gains, Wang said. \n",
  "link_flair_text": "News",
  "id": "1e479f9",
  "num_comments": 82,
  "created_utc": 1721080059,
  "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/",
  "url_overridden_by_dest": "https://www.bloomberg.com/news/features/2024-07-15/evs-solar-tech-sectors-help-xi-jinping-s-china-navigate-property-slump",
  "comments": [
    {
      "id": "ldcvnib",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 1650 | **Previous Best DD** | \n**Account Age** | 8 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldcvnib/",
      "created": 1721080063,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldd6f5h",
      "score": 61,
      "body": "![img](emote|t5_2th52|18630)",
      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldd6f5h/",
      "created": 1721083939,
      "depth": 0,
      "replies": [
        {
          "id": "ldee0cr",
          "score": 8,
          "body": "![img](emote|t5_2th52|18630)",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldee0cr/",
          "created": 1721101110,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldf07yc",
      "score": 22,
      "body": "*Thanks for sharing our story from Bloomberg News reporters. Here's some more details:*\n\nChina’s twin-track economy is generating doom-and-gloom headlines about domestic woes one moment and growing fears around the world about the dominance of its manufacturers the next.\n\nThose conflicting signals on Monday showed ongoing strength in industrial production more than offset by tepid consumption as the property slump continues, leading to the slowest quarterly growth pace in five quarters. But through the fog a silver lining is becoming clear: Xi Jinping’s long quest for technology-driven “high-quality growth” is actually starting to pay off.\n\nWhile Japan and America both suffered deep economic setbacks when their housing markets hit the skids, China’s tech advances and resulting export boom have helped to keep economic growth within reach of its targeted pace of around 5%.\n\nAnd the nation’s leaders are determined to keep it that way. Read The Big Take [here](https://www.bloomberg.com/news/features/2024-07-15/evs-solar-tech-sectors-help-xi-jinping-s-china-navigate-property-slump).",
      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldf07yc/",
      "created": 1721113560,
      "depth": 0,
      "replies": [
        {
          "id": "ldg5pcx",
          "score": 3,
          "body": "Your assumption that any data from China is trustworthy.....lol\n\nYou have local teams in China, how about you actually do a deep dive on how bad that housing mess is. China accidentally revealed that they have built roughly 1.2 Billion homes and a big chunk of its working class owns more than 1 home.\n\n The local governments are having issues making payroll, their tried and tested cash cow of land-lease has dried out, and, many mega projects can't sustain themselves.  \n\nMost regional banks are stiff breeze away from collapse-look at the many different bank runs over the last two months. \n\nChina is rotting from within, without any feasible way of clawing their way back out, short of crashing the US economy.",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldg5pcx/",
          "created": 1721137295,
          "depth": 1,
          "replies": [
            {
              "id": "ldg8d42",
              "score": 7,
              "body": "lmao rotttINg from withIN.  We have heard this paper dragon pulled out my ass analysis a million times.",
              "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldg8d42/",
              "created": 1721138281,
              "depth": 2,
              "replies": [
                {
                  "id": "ldgbz9r",
                  "score": -4,
                  "body": "You mean before their housing market essentially shit the bed? \n\nyeah lets pretend its sunshine and roses in the country where multiple regional banks are essentially insolvent.",
                  "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldgbz9r/",
                  "created": 1721139584,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldgl040",
                      "score": 0,
                      "body": "Stop pretending like you can truly understand the back workings of any government.  All the countries play hooky with their magical finance numbers.  If you have have worked with finance at any company you should know the tomfoolery already starts there.  Doesn't mean shit",
                      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldgl040/",
                      "created": 1721142670,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldid3fj",
                          "score": 2,
                          "body": "Idk. Every 1st world nation ever has a pretty successful housing market. The U.S. has had one of the most successful markets ever if we look at it in terms of accumulation of wealth. In China, people simply aren't spending money and that's created tons of challenges on its own. Now add in the fact that real estate, which for most people is the largest taxable purchase they'll make in a lifetime, is essentially worth nothing. How do they keep the economy moving? One more thing. What about all of the people who built those houses? They're most likely unemployed by the thousands with skills that are unneeded. Regardless of whether you're Xi Jinping or a know it all redditor with a PHD for everything in the universe it seems pretty bleak.",
                          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldid3fj/",
                          "created": 1721163441,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ldifz94",
                              "score": 0,
                              "body": "They are saying the spending power is rapidly  increasing in China no doubt.  It's a slow shift but there none the less.",
                              "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldifz94/",
                              "created": 1721164396,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ldigz5r",
                                  "score": 2,
                                  "body": "Spending power isn't the same as spending.",
                                  "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldigz5r/",
                                  "created": 1721164733,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ldil7aj",
                                      "score": 1,
                                      "body": "Why would it not correlate?",
                                      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldil7aj/",
                                      "created": 1721166169,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "ldiz7bd",
                                          "score": 2,
                                          "body": "Simply put, people in China have seen a massive increase in buying power in the last 5 years. However, nobody is actually buying. For starters, China is a rapidly aging nation, so much so that the long standing laws restricting the amount of children that families can have has been removed. Now it gets a little more speculative but the guess as to why people aren't spending is that the housing bubble has brought an end to the traditional multigenerational housing that China has had for centuries. As a result there's a rapidly growing need for elderly care facilities and a cost as well since children aren't at home to care for their families anymore. For a better documented example Japan is experiencing this right now. Coupled with the fact that, unlike Japan, China lacks a 401k, social security or other system to fund retirement. People are completely on their own when it comes to affording retirement.",
                                          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldiz7bd/",
                                          "created": 1721171227,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ldgqus9",
              "score": -2,
              "body": "I always love this stupid ass reply.  Like western nations are some beacon of honesty.  I trust xi’s numbers as much as I trust trump’s.  If it pays to lie, every politician and ceo will do it, regardless of border.",
              "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldgqus9/",
              "created": 1721144590,
              "depth": 2,
              "replies": [
                {
                  "id": "ldgs4x1",
                  "score": 6,
                  "body": "You haven't done any work overseas and it shows. Yes everyone fudges numbers, but China doesn't fudge numbers, they literally create entire revenue streams out of nothing. We have the ability to question these numbers and call out major bs, no one can do that in China. \n\nYou act like China didn't kick out auditing firms just recently for this same reason. \n\n\n\nYou are regarded-along with anyone who thinks any western country is the equivalent to China in regards to corruption",
                  "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldgs4x1/",
                  "created": 1721145005,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldgtvhn",
                      "score": -2,
                      "body": "That’s a weird way of agreeing with my comment.",
                      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldgtvhn/",
                      "created": 1721145562,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ldgwil5",
                      "score": -2,
                      "body": "You’re simply brainwashed. How about you actually work overseas?",
                      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldgwil5/",
                      "created": 1721146427,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ldgwdba",
              "score": -1,
              "body": "So more housing supply, which means affordable housing, is bad? Lol\n\nAnd China’s data are trustworthy. They are willing to admit high youth unemployment. Can the us do the same?\n\nHypocrisy sure is a drug, eh?",
              "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldgwdba/",
              "created": 1721146380,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ldixcmq",
          "score": 1,
          "body": "Chyna bot",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldixcmq/",
          "created": 1721170542,
          "depth": 1,
          "replies": [
            {
              "id": "ldpj9gl",
              "score": 1,
              "body": "India lion too saar",
              "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldpj9gl/",
              "created": 1721267905,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldcx4z8",
      "score": 99,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldcx4z8/",
      "created": 1721080579,
      "depth": 0,
      "replies": [
        {
          "id": "ldd081o",
          "score": 114,
          "body": "I don’t. Cus I’m a proud American who trusts only what US papers say about China especially around election times.\n\nAs a matter of fact if any country is adversarial to China and friendly to the West they’re right.\n\nIf they’re friendly to China then they’re probably liars.",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldd081o/",
          "created": 1721081684,
          "depth": 1,
          "replies": [
            {
              "id": "ldek7o8",
              "score": 37,
              "body": "This is the way.\nI cannot put it any better myself.\n\nFact checking is for noobs.",
              "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldek7o8/",
              "created": 1721104115,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ldelq2f",
              "score": 9,
              "body": "fucking lol, love it\nUSA! USA!",
              "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldelq2f/",
              "created": 1721104899,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ldd1h6o",
              "score": 13,
              "body": "Ever read a paper in China? It’s a mindf.",
              "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldd1h6o/",
              "created": 1721082141,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ldg5f3q",
              "score": -1,
              "body": "As a Chinese, I would like to say that China's development or stagnation is materialistic and objective, and not subject to the will of the American media.",
              "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldg5f3q/",
              "created": 1721137187,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ldfm7im",
          "score": 17,
          "body": "Now this is some good American copium.\n\nOnly America puts out real numbers, like nominal GDP growth rate thanks to inflation, record job numbers through people having to work multiple jobs to afford rising living costs (that pump up Bidens nominal GDP numbers for election year) and the value of speculation and debt trading in the financial sector",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldfm7im/",
          "created": 1721128284,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldd3us4",
          "score": 27,
          "body": "you don’t need to necessarily believe them as literal but rather take them as an indication of trend\n\nand those trends are typically confirmed by external numbers such as foreign sales in China, imports into US from China, etc. Western electronic or retail/luxury sales may confirm Chinese consumer data trends, for example; electronic component exports may confirm factory data trends.\n\nfor the EV Solar Battery GDP figure, it’s reasonable enough to at least believe the trend. Chinese EVs have observably exploded (lol) in popularity in China. batteries i’m less unsure about as certainly manufacturers do a better job as obfuscating component source of country as they do with solar too because of the US attempts to effectively ban Chinese solar components.\n\nbut instead you can look at Vietnamese, Thai, Malay solar—long linked to Chinese companies and using Chinese components. Solar imports from SE Asia have continued to grow…\n\nthis is all global imports but >90% are from SE Asia and heavily linked to Chinese components manufacturers or in practice essentially believed to be part of Chinese supply chain\n\nhttps://preview.redd.it/be5b8rloercd1.jpeg?width=828&format=pjpg&auto=webp&s=f1063f2405479a08147b4865c3c9a832d668481c\n\none could reason then that official Chinese data  that Chinese solar, in addition to the huge growth of Chinese EVs, growing from <1% of GDP to 4% may be a believable trend\n\nWestern policymakers seem to believe it as numerous countries have just recently further increased significant trade restrictions on Chinese EVs and it’s expected SE Asia solar is next\n\nso no I don’t believe the broader macro data per se but I can’t say it matters to me whether Chinese GDP is 3% or 6% …. for me I see it as just a guide to look for verifiable trends. in this case, why is GDP growth bring cushioned? from EVs and solar? ok, now that can likely be somewhat verified by non-Chinese data, and that can be used to inform decisions in how you invest in domestic EVs or solar.",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldd3us4/",
          "created": 1721083008,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldfi3h0",
          "score": 4,
          "body": "The general economist don't even believe the numbers US and Europe put out, let alone China. Economic data has become a population sentiment manipulation tool, since they know general public do not fucking care",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldfi3h0/",
          "created": 1721125885,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldee0u2",
          "score": 1,
          "body": "All of our shit is made by advanced chinese super soldiers. I believe the numbers",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldee0u2/",
          "created": 1721101117,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldgwl08",
          "score": 0,
          "body": "More than the us’s numbers",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldgwl08/",
          "created": 1721146448,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lde3ngr",
      "score": 20,
      "body": "Don´t get me wrong, I strongly believe, the chinese economy will recover and the current levels of the stock market provide a good base for broad, diversified investment, but I do have issues with these outlooks.\n\n  \nOne of those issues is, that it bases it´s predictions on maintaining growth levels in a time of growth slowdown.\n\nThe others may be more fundamental. China created a real estate bubble, which largely fuelled it´s growth in the past. When that real estate bubble became unstable, they infused a credit bubble into the real estate bubble, in order to stabilize it (people got loans so far out, the banks literally relied on their heirs to pay them off).\n\nWhen China chose to let the air out of those bubbles and introduced restrictions, that was the right choice, despite leading to unavoidable negative side effects. The fact, that they have started loosening those restrictions again, to stop the disintegration of an overblown real estate market is not a good sign. Some cities are fuelling the bubble again, in order to stop the deflation - risking it to uncontrollably burst at some point.\n\nLooking at the EV and renewable energy sectors, they are indeed impressive. But: China uses the same tactics, it used to create the real estate bubble. And the massive distortions, this creates, endanger it´s most important market: The European Union. \n\nSome time ago US bankers were arguing, the way, China needed to go, was to create more social security, invest in health care and pensions, in order to ease the fear in the population and fuel consumer participation. Can you imagine, how rotten your social security system has to be, for Wall Street Bankers to tell you to fix it?\n\nChina is a big future market. But it has massive risks. It´s economic policies are hit and miss. It badly needs to find a level with it´s main customers.\n\nAnd ironically the answers on all those issues might overlap. Because if you increase wages and pensions, improve health care and workers protections and boost the services markets, you increase the cost of labor and reduce the friction with partners.\n\nThe clearest sign of the uncertainty in the chinese market is probably, that the Bank of China is actively discouriging institutions from investing in long term chinese government bonds. So much money has fled into these supposedly safe investments, that the threat of a SVB scenario became real, where institutions would not be able to maintain liquidity, because they were to deep in long positions, which with one wrong turn of the economy might not be recoverable fast enough.",
      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/lde3ngr/",
      "created": 1721096666,
      "depth": 0,
      "replies": [
        {
          "id": "ldfo95t",
          "score": 4,
          "body": "Holy hell ease up on the commas",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldfo95t/",
          "created": 1721129401,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldg92ik",
          "score": 2,
          "body": "The housing market over there is in a far far bigger mess than anyone realizes. When you have 1.2 billion homes, and almost at par population, that is fucking ridiculous. There is no home that will be worth the price it was bought for over the next 50 years minimum. \n\nLocal banks are so insolvent, they have mandated 30 Dollar max withdrawal at some banks lol. \n\nLocal govt can't make payroll since the money making land-lease scheme has gone bust. \n\nChina is not clawing its way out anytime soon. It will be worse than Japan.",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldg92ik/",
          "created": 1721138538,
          "depth": 1,
          "replies": [
            {
              "id": "ldib7nm",
              "score": 3,
              "body": "> There is no home that will be worth the price it was bought for over the next 50 years minimum.\n\nXi recently said homes were for living in, rather for investing in.  It seems China is discouraging using homes as an investment now.  I think that might be the right track.  Sky high real estate sucks productivity out of economies.",
              "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldib7nm/",
              "created": 1721162831,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lde3nhl",
          "score": 3,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/lde3nhl/",
          "created": 1721096666,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldda9cn",
      "score": 17,
      "body": "Makes sense, I keep reading and seeing Chinese EVs taking over SEA, Europe and China itself.\n\nTheir own brands are beating American multinationals.",
      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldda9cn/",
      "created": 1721085352,
      "depth": 0,
      "replies": [
        {
          "id": "ldddgfs",
          "score": 27,
          "body": "American Multinational auto-makers are uncompetitive. More-so when they’re competing against state backed Chinese auto makers.",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldddgfs/",
          "created": 1721086550,
          "depth": 1,
          "replies": [
            {
              "id": "ldddny8",
              "score": 7,
              "body": "True, but I was referring to other companies top.\n\nJust saw that Luckin Coffee came back from the grave and taking market share from Starbucks.\n\nEven local chains are beating brands like McDonalds. Also there is a Chinese brand beating Nike.",
              "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldddny8/",
              "created": 1721086628,
              "depth": 2,
              "replies": [
                {
                  "id": "lde7cg4",
                  "score": 9,
                  "body": "At the beginning they tried to follow in Starbucks footsteps and build these massive stores with seating, lounge chairs, etc. encouraging people to sit and stay (coworking space). That business model was a flop and almost bankrupted them. People didn't want to sit and be seen in Luckin Coffee.. they wanted to be seen in Starbucks!\n\nThey've now pivoted their business model to cater more to people actually just want coffee. Essentially they've cut all the excess fat and adopted a bubble tea business model. Focused on deliveries, efficiency and sales. Most of the new stores are tiny, manned w 5-6 workers operating in a small area. Heavily catered to China's food delivery game, which is next level (nobody really buys food/drinks in the store anymore everything is delivered).",
                  "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/lde7cg4/",
                  "created": 1721098175,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ldg9fhu",
                  "score": 1,
                  "body": "Times are tight, and money is even tighter in China. When a ridiculous amount o the work force is doing deliveries, there is a massive problem",
                  "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldg9fhu/",
                  "created": 1721138670,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ldibbg2",
                  "score": 1,
                  "body": "> Also there is a Chinese brand beating Nike.\n\nWhich brand?",
                  "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldibbg2/",
                  "created": 1721162866,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldibln1",
                      "score": 2,
                      "body": "Anta\n\nI saw a financial video on it. Was a CNBC one I think.",
                      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldibln1/",
                      "created": 1721162958,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lderkg1",
          "score": 1,
          "body": "Well but they need to Sell it, here in Germany we laugh about thier Numbers Right now.\n\nBiggest is MG with total 21.200 cars in 2023, in Germany there were 2.8 Million cars in total and VW alone sold 520.000 in one year.\n\nStop this Chinese Propaganda bullshit.",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/lderkg1/",
          "created": 1721108158,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldczroc",
      "score": 8,
      "body": "https://preview.redd.it/sy5lhcezarcd1.jpeg?width=887&format=pjpg&auto=webp&s=924df5c618201805c3e58e6120150349e8ba80bd",
      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldczroc/",
      "created": 1721081518,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lde365i",
      "score": 4,
      "body": "If i could invest in Huawei, I would.",
      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/lde365i/",
      "created": 1721096470,
      "depth": 0,
      "replies": [
        {
          "id": "ldesyav",
          "score": 1,
          "body": "You like to burn you‘re Money?",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldesyav/",
          "created": 1721108977,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldfj61z",
      "score": 3,
      "body": "Yeah but also according to China TSMC is their #1 company.",
      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldfj61z/",
      "created": 1721126539,
      "depth": 0,
      "replies": [
        {
          "id": "ldfr456",
          "score": 1,
          "body": "Ha. What? is TSMC in their stats?",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldfr456/",
          "created": 1721131026,
          "depth": 1,
          "replies": [
            {
              "id": "ldibwe8",
              "score": 1,
              "body": "They think it is. there was an article with their Finance Minister I think sometime this year when TSMC surpassed Tencent. they basically said TSMC is now Chinas most valuable company. lol",
              "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldibwe8/",
              "created": 1721163055,
              "depth": 2,
              "replies": [
                {
                  "id": "ldit5e9",
                  "score": 1,
                  "body": "Oh wow. So that means the PRC stats \\*include\\* Taiwan so does that mean you need to lop off another 700B or so?",
                  "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldit5e9/",
                  "created": 1721168995,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lditozw",
                      "score": 2,
                      "body": "yeah I guess so, not sure if they officially include it or if they were just beating their chest in the article.",
                      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/lditozw/",
                      "created": 1721169196,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldiuj6c",
                          "score": 2,
                          "body": "C'mon, can you imagine \\*THAT\\* ministry of finance discussion?\n\n\"Erm, Minster we have the GDP stats ready.\"\n\n\"Hrm, did you or did you not include that 'renegade' province, Taiwan?\"\n\n\"Well.....\"\n\n\"Well, did you?\"\n\n\"Erm ... \"\n\n\"XI JINGPING THOUGHT TELLS TAIWAN IS PART OF CHINA DO IT AGAIN JACKASSES!\"",
                          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldiuj6c/",
                          "created": 1721169505,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ldg6n2q",
          "score": 1,
          "body": "Are you seriously?",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldg6n2q/",
          "created": 1721137648,
          "depth": 1,
          "replies": [
            {
              "id": "ldibnyr",
              "score": 1,
              "body": "yeah, I can't find it thought just keep getting hypotheticals, but one of Chinas business papers had a Finance Minister talking about how TSMC is now Chinas most valuable company after surpassing Tencent.",
              "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldibnyr/",
              "created": 1721162979,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldf8rds",
      "score": 2,
      "body": "USA, USA, USA",
      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldf8rds/",
      "created": 1721119517,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldeakrb",
      "score": 4,
      "body": "Those numbers could look a lot different if western leaders had spines. China relies on stealing intellectual property to remain competitive - that's number one. \n\nSecondly, they cut highly favorable trade deals in order to open up their substantial market space - almost one-sided agreements, which enables those export numbers they enjoy. Negotiate real deals and those numbers change.\n\nBehind the façade it's a financial dumpster fire, and BRICS isn't going to solve that one. If November in the U.S. turns out well, China's in for a rude awakening...",
      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldeakrb/",
      "created": 1721099561,
      "depth": 0,
      "replies": [
        {
          "id": "ldee9eq",
          "score": 1,
          "body": "The IP was stolen long ago, the Chinese are simply better at electronics, engineering and manufacturing than Americans now.",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldee9eq/",
          "created": 1721101229,
          "depth": 1,
          "replies": [
            {
              "id": "ldetd7y",
              "score": 3,
              "body": "They still just steal and invent nothing.",
              "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldetd7y/",
              "created": 1721109225,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ldelxpn",
              "score": 0,
              "body": "This is absolutely not true. China steals tech constantly and has done so for decades.",
              "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldelxpn/",
              "created": 1721105011,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ldflask",
              "score": 0,
              "body": "Lmao, if you mean China has a leg up on the developed world because they have no worker rights or protections, no environmental protections, and no meaningful regulations, then yes you’re correct.",
              "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldflask/",
              "created": 1721127776,
              "depth": 2,
              "replies": [
                {
                  "id": "ldft40l",
                  "score": 1,
                  "body": "No i mean they actually know how to design and make things",
                  "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldft40l/",
                  "created": 1721132070,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldgcxp0",
                      "score": -1,
                      "body": "The Chinese leaders are refusing to fly on the alleged home-built C919. If they are so good at hardware then surely their leaders wouldn't still be flying using American and European planes?",
                      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldgcxp0/",
                      "created": 1721139922,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ldgigfe",
                      "score": 0,
                      "body": "Garbage take. Not only are they not the best at design, their designs or inventions are derivative of something someone else made. \n\nThey just made their first ballpoint pen using homemade ball bearing like 7 years ago. And they had massive, massive help to get there. \n\nThey can't manufacture jet engines yet and you pretend they are the best at making things. They are reasonably okay at low tech stuff, but lag on high precision stuff",
                      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldgigfe/",
                      "created": 1721141815,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldgk7w2",
                          "score": -1,
                          "body": "EVs, DNA sequencing hardware, consumer electronics, renewable infrastructure, etc. They destroy baby dick america. Americans are too fat, lazy and stupid to compete. Hell the average american is barely fit to take my order at a wendy’s",
                          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldgk7w2/",
                          "created": 1721142407,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ldel9bk",
          "score": -1,
          "body": "Stop drinking all that kool-aid big guy it's not safe!",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldel9bk/",
          "created": 1721104655,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lddbkf4",
      "score": 3,
      "body": "So calls on NIO",
      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/lddbkf4/",
      "created": 1721085841,
      "depth": 0,
      "replies": [
        {
          "id": "lddvecc",
          "score": 1,
          "body": "NIO will moon",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/lddvecc/",
          "created": 1721093401,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lde7oa4",
      "score": 1,
      "body": "Whoever believes that the Chinese economy is fine has their head in the sand. \nNo one can be fine when so many sectors are hit, not even the great magnificent China with 5 thousand years of history.",
      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/lde7oa4/",
      "created": 1721098312,
      "depth": 0,
      "replies": [
        {
          "id": "ldet8gz",
          "score": 1,
          "body": "Xi is the problem, he has no clue.\nHi own mega city Xiong‘an is a 128 billion grave.\nIt‘s one of so many failures, they are Lucky, they control the data.",
          "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldet8gz/",
          "created": 1721109147,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldgrlvq",
      "score": 1,
      "body": "I saw some people comparing the unreal economic data of Europe and the United States with the unreal CCP data, but please don’t forget that when the full score is 100 points, 80 is still much better than 20 . Even the Chinese people don’t believe in this 5% GDP growth. Come to China and have a look. If you look more, you will know how much trouble it is in now.",
      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldgrlvq/",
      "created": 1721144834,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldnqpl8",
      "score": 1,
      "body": "Apples to Oranges already in the first sentence LMAO, who the fuck reads these things",
      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldnqpl8/",
      "created": 1721244893,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldf0y5m",
      "score": 1,
      "body": "Seen this article in at least 3 subs.  Ridiculous push by somebody",
      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldf0y5m/",
      "created": 1721114051,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldf244l",
      "score": -1,
      "body": "The Chinese has been dumping their goods in everywhere. Small economy like Singapore have so much going on in the vehicle sales sector. BYD setting up showroom in CBD and shopping mall. They even opened a restaurant with showroom in the nightclub area. Mind you that Singapore is the only place where you need to bid a certificate before you are entitled to own the vehicle on top of the cost of vehicle and taxes. It is really crazy that even a small market they don’t leave any chance to dump their poorly made goods.",
      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldf244l/",
      "created": 1721114837,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldfvzay",
      "score": -2,
      "body": "Wumao are out in force lmao\n\nThanks for the laugh you autocratic cock suckers",
      "permalink": "/r/wallstreetbets/comments/1e479f9/xi_jinpings_great_economic_rewiring_is_cushioning/ldfvzay/",
      "created": 1721133372,
      "depth": 0,
      "replies": []
    }
  ]
}