{
  "title": "GM's 2025 EV production capacity target in doubt after Barra comments ",
  "score": 43,
  "selftext": "General Motors’ goal of being capable of producing 1 million all-electric vehicles in North America by the end of 2025 in heavily in doubt, following comments Monday by CEO Mary Barra.\n\nThe production capacity target for next year was one of the last EV targets the automaker hadn’t lowered or withdrawn as demand for EVs has not materialized as quickly as many companies such as GM previously expected.\n\n“We won’t get to a million just because the market is not developing, but it will get there,” Barra said Monday at a virtual CNBC CEO Council event. “We’re going to be guided by the customer.”\n\nFor more than two years, GM has said it would have production capacity of 1 million in EVs in each China and North America by 2025. Even after it changed or withdrew several EV targets and product plans in the last year, the company continued to say it would install the North American capacity for EVs.\n\nA GM spokesman said the company’s target was about the production capacity, while the question was regarding actually producing 1 million EVs in 2025. Barra did not specifcally address whether it was production or production capacity that she was referring to.\n\nThe spokesman later said the company would no longer reiterate the EV production capacity plans for 2025. The company has continually said its EV plans will be flexible to meet demand.\n\nMore details about the automaker’s EV plans could come when GM reports second-quarter results on July 23.\n\nSource: https://www.cnbc.com/2024/07/15/gms-2025-ev-production-capacity-target-in-doubt-after-barra-comments.html",
  "link_flair_text": null,
  "id": "1e49qxq",
  "num_comments": 24,
  "created_utc": 1721086464,
  "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/",
  "comments": [
    {
      "id": "lddw8ni",
      "score": 33,
      "body": "She is misleading investors. This is and always was a fantasy. The sales demand has never been there at the prices they're asking. Maybe if EVs cost 50% of what they want for MSRP they would have a chance.",
      "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/lddw8ni/",
      "created": 1721093729,
      "depth": 0,
      "replies": [
        {
          "id": "lde0wnb",
          "score": 14,
          "body": "Yeah nobody is buying a GM EV over a 30k model 3",
          "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/lde0wnb/",
          "created": 1721095565,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldfybl1",
          "score": 8,
          "body": "Agreed, of all the automaker CEO's Mary Barra has honestly been the most delusional and willfully misleading in what outrageous promises she's made to investors.\n\nThis is the woman who claimed several years ago that GM would be selling more EV's then Tesla in 2025, all while guiding to sell the same number of EV's that Tesla was already selling the year she made that promise, as if Tesla's sales wouldn't increase at all over a several year period.\n\nNot to mention I don't think a lot of consumers who are knowledgeable about EV's are going to want to trust GM after the whole Bolt bomb disaster and GM's atrocious response to it. IMO Barra should have been fired over that whole fiasco.",
          "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/ldfybl1/",
          "created": 1721134370,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldgiq9g",
          "score": -1,
          "body": "Fantasy? are you claiming that EV' market demand is dying and not growing in sales? Because that's simply way off. Shifting production to majority EV is the way forward for any auto company that wants to survive in the future. Go look at the streets of China today to see the EV market penetration where more new EV's than ICE were sold in the last year, that is where USA will be likely within the next 10 years. \n\nAlso EV's are becoming nearly just as cheap sometimes cheaper than ICE vehicles (including tax rebate and gas savings).... The 1LT version of GM Equinox about to be released will be $34k, and plenty of EV's in the $30k range from Hyundai, Volvo, Volkswagon and Kia.",
          "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/ldgiq9g/",
          "created": 1721141906,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lde5g96",
      "score": 10,
      "body": "She knew this would be a failed promise a long time ago. Now she says she'll let the market dictate their direction. Yeah ok. Entirely predictable turn of events, their EVs suck and they can't scale effectively, they're way behind, so buy time, try to keep gas cars going longer, she'll bail, collect big and let the next CEO clean up the mess.",
      "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/lde5g96/",
      "created": 1721097401,
      "depth": 0,
      "replies": [
        {
          "id": "ldglxe3",
          "score": 3,
          "body": "What’s bad about their EVs?",
          "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/ldglxe3/",
          "created": 1721142977,
          "depth": 1,
          "replies": [
            {
              "id": "ldhlcok",
              "score": 3,
              "body": "The range, power, charging speeds, cost/value, and features",
              "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/ldhlcok/",
              "created": 1721154447,
              "depth": 2,
              "replies": [
                {
                  "id": "ldkxxrp",
                  "score": 2,
                  "body": "so, the whole thing",
                  "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/ldkxxrp/",
                  "created": 1721205291,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ldejakw",
      "score": 6,
      "body": "You led and it matters",
      "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/ldejakw/",
      "created": 1721103646,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lddgq4t",
      "score": 6,
      "body": "Just bring back the Volt already.",
      "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/lddgq4t/",
      "created": 1721087781,
      "depth": 0,
      "replies": [
        {
          "id": "ldfcxiv",
          "score": 5,
          "body": "So what you are saying is you want either an 100k diesel Sierra HD or an 100k Silverado EV? Let’s make a deal!!!",
          "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/ldfcxiv/",
          "created": 1721122476,
          "depth": 1,
          "replies": [
            {
              "id": "ldfhvtl",
              "score": 3,
              "body": "I had my 13 Sierra at the dealership for bodywork last year after a minor fender bender. When I went to pick it up, one of the salesmen came out to tell me how great its shape is and offered me $20k for it on trade. I told him I wasn’t putting another $70 thousand down to replace a truck that I paid $35 for. He walked away without saying a word.",
              "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/ldfhvtl/",
              "created": 1721125752,
              "depth": 2,
              "replies": [
                {
                  "id": "ldjm3ph",
                  "score": 1,
                  "body": "If you traded the ’13 in they will probably turn around and try to sell it for 35k",
                  "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/ldjm3ph/",
                  "created": 1721180081,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lde28va",
      "score": 2,
      "body": "Because EVs are piling up in dealership lots and there's plenty of people that rent with no way of charging their electric vehicles or don't want to pay the price. Also there's not enough charging stations, take too long, or are getting destroyed by junkies for the copper.",
      "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/lde28va/",
      "created": 1721096098,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldgu5ug",
      "score": 2,
      "body": "But I thought the competition was coming",
      "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/ldgu5ug/",
      "created": 1721145655,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lde52h5",
      "score": 3,
      "body": "gm ev's are actually quite good. i've driven all of them as well as the competition. to be honest most of the ev's are pretty good. demand will come in time. right now ev's are a tough sell on the whole, for reasons unrelated to the tech itself. slowly that will change. personally i think GM is a decent long term hold.",
      "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/lde52h5/",
      "created": 1721097245,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldhl2xi",
      "score": 1,
      "body": "She also said they would catch up to Tesla in a couple years lol\n\nAnyone who follows the auto industry immediately knows that's just BS hopium for gullible GM investors",
      "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/ldhl2xi/",
      "created": 1721154359,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lde118q",
      "score": 0,
      "body": "Lyriq is selling like hot cakes, pretty much the best luxury EV with no close second.",
      "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/lde118q/",
      "created": 1721095615,
      "depth": 0,
      "replies": [
        {
          "id": "ldjqy4y",
          "score": 1,
          "body": "Strong agree, even Silverado ev and hummer suv are leaders in their class, it is not me saying but renowned influencers and reviewers on YT",
          "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/ldjqy4y/",
          "created": 1721182005,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lde11u5",
      "score": 1,
      "body": "They really need to work on hybrid first to transition most of its consumer base. Are we pretending a pickup owner will take an ev with open arms? Imagine if trump wins? There goes the progress with ev.",
      "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/lde11u5/",
      "created": 1721095622,
      "depth": 0,
      "replies": [
        {
          "id": "ldfiy2s",
          "score": -2,
          "body": "EV won’t sell to the remaining market in North America due to its limitations. They had it right with  the Volt and dropped the ball. They’d sell thousands of trucks if they did a phev Colorado and Sierra and all they have to do is sandwich a small pancake motor between a four cylinder engine and the transmission and install a small battery pack good for 40 miles, but it seems like most of their engineers are smoking that cheap Michigan weed.",
          "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/ldfiy2s/",
          "created": 1721126406,
          "depth": 1,
          "replies": [
            {
              "id": "ldgayoq",
              "score": 3,
              "body": "The Volt was practically given away in the final years. The Silverado Hybrid was a sales flop.\n\nMaybe Toyota has it right (predicting total EV market penetration at only around 30%). Americans don't seem keen on EVs right now.",
              "permalink": "/r/stocks/comments/1e49qxq/gms_2025_ev_production_capacity_target_in_doubt/ldgayoq/",
              "created": 1721139221,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}