{
  "title": "Bank of America tops estimates on better-than-expected investment banking ",
  "score": 64,
  "selftext": "Bank of America on Tuesday said second-quarter revenue and profit topped expectations on rising investment banking and asset management fees.\n\nHere’s what the company reported:\n\nEarnings: 83 cents a share vs. 80 cents a share LSEG estimate\n\nRevenue: $25.54 billion vs. $25.22 billion estimate\n\nThe bank said profit slipped 6.9% from the year earlier period to $6.9 billion, or 83 cents a share. Revenue climbed less than 1% to $25.54 billion.\n\nHow is Bank of America navigating the interest rate environment?\n\nThat’s a key question after CEO Brian Moynihan told investors in April that net interest income would bottom in the second quarter.\n\nThe measure, known as NII, is the difference between what the bank earns on loans and what it pays depositors for their savings. It’s one of the main ways that banks earn money.\n\nWells Fargo shares fell on Friday when it posted disappointing NII figures, showing how much investors are fixated on the metric.\n\nSource: https://www.cnbc.com/2024/07/16/bank-of-america-bac-earnings-q2-2024.html",
  "link_flair_text": null,
  "id": "1e4lsyl",
  "num_comments": 10,
  "created_utc": 1721127804,
  "permalink": "/r/stocks/comments/1e4lsyl/bank_of_america_tops_estimates_on/",
  "comments": [
    {
      "id": "ldfti6g",
      "score": 30,
      "body": "Having been a customer for almost 20 years, the quality of service has decreased so it makes sense shareholders are getting the benefits that the workers should have. At least 1 ATM is out of service every other week. Fewer employees...",
      "permalink": "/r/stocks/comments/1e4lsyl/bank_of_america_tops_estimates_on/ldfti6g/",
      "created": 1721132257,
      "depth": 0,
      "replies": [
        {
          "id": "ldivi95",
          "score": 1,
          "body": "They closed a ton of branches where I live and also reduced hours.  They also started charging me fees after an exemption period for not maintaining 20k in my accounts or whatever (I use Vanguard for most of cash holding/investments)....at this point I'm considering closing all my BoA accounts and going with another bank like Sofi.",
          "permalink": "/r/stocks/comments/1e4lsyl/bank_of_america_tops_estimates_on/ldivi95/",
          "created": 1721169865,
          "depth": 1,
          "replies": [
            {
              "id": "ldjuobm",
              "score": 1,
              "body": "20k is insane\n\nDid you check if you're able to downgrade your account or something like that?\n\nI've had a BoA checking account since 2016, have less than $5k in my account and am not being charged any fees",
              "permalink": "/r/stocks/comments/1e4lsyl/bank_of_america_tops_estimates_on/ldjuobm/",
              "created": 1721183526,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldg80ev",
      "score": 15,
      "body": "Expect large fines to be dished out at these major banks in next few years for regulatory failures.  They've been cutting many positions in their desire to save near term money.\n\nBofA under Moynihan has been nothing more than a continuous reduction in force.  Sure, the net number of employees has remained the same but that is at the expense of other legacy positions.   For example, they'll not fill position for employee that leave loan processing or loan servicing at the same time, adding a cyber security position.  Both are critical, but these large companies see only the aggregate and desire to keep employment numbers flat. \n\nIt will come to bite them.  This is occurring everywhere at financial firms.  They dont want to pay the extra cost of dealing with cyber security so legacy processes and jobs suffer and those are critical as well imo.",
      "permalink": "/r/stocks/comments/1e4lsyl/bank_of_america_tops_estimates_on/ldg80ev/",
      "created": 1721138154,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldg6vgn",
      "score": 7,
      "body": "Nobody likes this stock but I sure did - I made a lot of money off it near the bottom and sold at 39.50.  It still has tons of room to run, and selling so early wasn't smart.  \n\nThis stock still has wings and will fly.",
      "permalink": "/r/stocks/comments/1e4lsyl/bank_of_america_tops_estimates_on/ldg6vgn/",
      "created": 1721137736,
      "depth": 0,
      "replies": [
        {
          "id": "ldjj6zq",
          "score": 2,
          "body": "I am in a similar boat.  I sold call options against my shares at 41 and 42.  I'll still be up on the sales when calls close, but wish I would have been more patient waiting for the cyclic rotation.",
          "permalink": "/r/stocks/comments/1e4lsyl/bank_of_america_tops_estimates_on/ldjj6zq/",
          "created": 1721178918,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldfod8o",
      "score": 8,
      "body": "Given the increased fees as well as the NII guidance, report is quite bullish for the stock.",
      "permalink": "/r/stocks/comments/1e4lsyl/bank_of_america_tops_estimates_on/ldfod8o/",
      "created": 1721129461,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldg0zps",
      "score": 2,
      "body": "Still pretty substantial HTM losses.",
      "permalink": "/r/stocks/comments/1e4lsyl/bank_of_america_tops_estimates_on/ldg0zps/",
      "created": 1721135463,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldk24d7",
      "score": 0,
      "body": "Bank of America sucks…",
      "permalink": "/r/stocks/comments/1e4lsyl/bank_of_america_tops_estimates_on/ldk24d7/",
      "created": 1721186763,
      "depth": 0,
      "replies": []
    }
  ]
}