{
  "title": "[deleted by user]",
  "score": 38,
  "selftext": "[removed]",
  "link_flair_text": null,
  "id": "1e4snwy",
  "num_comments": 19,
  "created_utc": 1721146427,
  "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/",
  "comments": [
    {
      "id": "ldgxcqw",
      "score": 12,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldgxcqw/",
      "created": 1721146698,
      "depth": 0,
      "replies": [
        {
          "id": "ldgxoa2",
          "score": 2,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldgxoa2/",
          "created": 1721146802,
          "depth": 1,
          "replies": [
            {
              "id": "ldh1870",
              "score": 4,
              "body": "realization of actual value has to be years away right?\n\nWhat's their path to revenue and timeline? how do they compare to CRSP?",
              "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldh1870/",
              "created": 1721147954,
              "depth": 2,
              "replies": [
                {
                  "id": "ldh2bj7",
                  "score": 9,
                  "body": "[deleted]",
                  "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldh2bj7/",
                  "created": 1721148306,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ldgwj6d",
      "score": 2,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 6 | **Previous Best DD** | \n**Account Age** | 9 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldgwj6d/",
      "created": 1721146432,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldgycak",
      "score": 2,
      "body": "Interesting, what is the company all about?",
      "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldgycak/",
      "created": 1721147020,
      "depth": 0,
      "replies": [
        {
          "id": "ldh9x6x",
          "score": 17,
          "body": "Geneticist here, what they add to the space is that they can read long stretches of DNA, their only competitor ONT also reads long stretches but is not as accurate. The market leader is Illumina, they have a large piece of the pie, but their tech can only read short stretches of DNA. Before Pacb was to expensive to bridge the gap, today they are still more expensive but they have reduced the costs by a lot with their new machine: the Revio. \n\nImagine reading all the DNA of an organism (the genome) as a big puzzle. With Illumina you'd have a puzzle with thousands of pieces, while with Pacb you can get the same (actually a better) picture witj just 100 pieces. I like to invest a little for fun, but from my expertise I believe that they have the best tech in this space and that they are currently largely under valued. If they could take only 10% of the market share from Illumina then you would be looking at a very different valuation already. \n\nThe big questions are if, and when the fields of genetics is going to appreciate the superiority and accept paying a bit more for much more useful data. \n\nHope that helps. Dyor",
          "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldh9x6x/",
          "created": 1721150756,
          "depth": 1,
          "replies": [
            {
              "id": "ldhaki2",
              "score": 6,
              "body": "Thanks Dyor",
              "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldhaki2/",
              "created": 1721150961,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ldihm6g",
              "score": 3,
              "body": "You forgot to mention use case.\n\nPacBio’s long read technology is highly niche and is rarely used once a reference genome is built out, or if you’re only looking for CNVs/ sequencing regions with large repeats.\n\nShort read sequencing has a much larger market than long read due its applicability with oncology, MCED, NIPT, and cost effectiveness.\n\nPacBio’s long read tech will never achieve that due to the inherent nature of how it sequences the DNA; limited by its CMOS. Their short read sequencer may gain traction, but it’s crap compared to competitors and is draining the company of a lot of money.\n\nThere’s a reason PacBio’s share price hasn’t moved in many years. Cool technology, but minimal use case relative to its competitors.",
              "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldihm6g/",
              "created": 1721164951,
              "depth": 2,
              "replies": [
                {
                  "id": "ldl2ahn",
                  "score": 1,
                  "body": "Of course short read will remain relevant for many applications. I am not sure if Pacbio's short-read technology will become a winner, a lot of competition in that part of the market. Appearantly the quality delived with their Onse system is very-high which can be good for some applications (e.g. liquid biopsy). I have yet to have a look to the data myself, and a lot will depend on price competitiveness. My expectations are higher for the long-read segment of the company. \n\nI disagree with you statement that long-read sequencing is only useful to build a reference. I have heard clinical labs thinking about completely replacing all their other pipelines with Pacbio WGS because of the ability to detect structural variants, repeat expansions, etc. Another great advantage is the ability to directly measure DNA-methylation, which is not possible with short reads. And then there are applications in the RNA-sequencing realm where full-length mRNA sequencing can find different iso-forms of genes.  \n\nLong-read will not fully replace short-read sequencing anytime soon, but there is still a lot of market share to gain by use cases where it can provide much added value. As the instruments become more readily available at large facilities I definitely predict growth. The technology was selected as the Nature method of the year 2022 for good reasons.",
                  "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldl2ahn/",
                  "created": 1721208303,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldndxki",
                      "score": 1,
                      "body": "I said that long read is only relevant in very niche cases, not strictly for conducting de novo sequencing.\n\nThis is a finance sub, and you have to look at potential market share. Long read tech in its current state will not have the same reach and potential as short read due to the impracticality of integrating it with oncology assays and population sequencing (which is where the money is at).\n\nIt’s a cool technology and their data quality is top notch, but unfortunately reads/run will be the main obstacle for any substantial growth to happen.\n\nThese labs converting their entire pipeline to PacBio are most likely a drop in the bucket within the grand scheme of market share.\n\nThere’s a reason PacBio is developing their own short read sequencer at the expense of improving their long read tech.",
                      "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldndxki/",
                      "created": 1721240804,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ldh0fpk",
          "score": 5,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldh0fpk/",
          "created": 1721147698,
          "depth": 1,
          "replies": [
            {
              "id": "ldh0nl6",
              "score": 0,
              "body": "Cool, I like that stuff but I cannot see it being profitable for the near term future. I will look at it",
              "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldh0nl6/",
              "created": 1721147769,
              "depth": 2,
              "replies": [
                {
                  "id": "ldh1jby",
                  "score": 3,
                  "body": "[deleted]",
                  "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldh1jby/",
                  "created": 1721148055,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldh1sli",
                      "score": 3,
                      "body": "Nah, I just think that biotech/life sciences has so much potential to absolutely and totally change the world for the better but regulation and lack of investment prevents it, along with people pussyfooting around “ethical” issues.",
                      "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldh1sli/",
                      "created": 1721148137,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ldh1vms",
                      "score": 1,
                      "body": "How did you learn about the company?",
                      "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldh1vms/",
                      "created": 1721148165,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldh2quv",
                          "score": 3,
                          "body": "[deleted]",
                          "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldh2quv/",
                          "created": 1721148443,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ldh2zkn",
                              "score": 3,
                              "body": "I need friends like this",
                              "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldh2zkn/",
                              "created": 1721148520,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ldjbg3p",
      "score": 1,
      "body": "[removed]",
      "permalink": "/r/wallstreetbets/comments/1e4snwy/deleted_by_user/ldjbg3p/",
      "created": 1721175890,
      "depth": 0,
      "replies": []
    }
  ]
}