{
  "title": "Delta says lower earnings is because of too much capacity",
  "score": 50,
  "selftext": "https://viewfromthewing.com/delta-discovers-its-just-another-airline-blames-rivals-for-profit-drop/\n\nSo I came across this article explaining delta’s reasonings for lower profit this quarter. They mentioned too much capacity. \n\nI’ve flown several times this year. Pretty much every flight is overbooked no matter which airline I was on. I was on a flight two months ago and I heard among the crew that the flight was overbooked by 23. Then I hear other airlines saying they have to pause new pilot hiring classes due to delayed Boeing and airbus deliveries and therefore they can’t get the utilization they need due to not enough aircraft. \n\nHow is there too much capacity? If anything I was under the impression there was not enough capacity. \n\nOn a side note… last year I did lookup some prices to Asia from the United States. The prices on delta was close to $4000 for some routes and that was a few months advance ticket purchase. \n\nToo much capacity isn’t adding up at all. Thoughts?",
  "link_flair_text": "Discussion",
  "id": "1e4wroy",
  "num_comments": 27,
  "created_utc": 1721156340,
  "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/",
  "comments": [
    {
      "id": "ldhr7ss",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 6 months ago\n**Total Comments** | 8 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldhr7ss/",
      "created": 1721156344,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldi2ukn",
      "score": 81,
      "body": "Dont worry, Boeing is trying its hardest to lower capacity",
      "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldi2ukn/",
      "created": 1721160133,
      "depth": 0,
      "replies": [
        {
          "id": "ldi5lj1",
          "score": 10,
          "body": "Between killing passengers and whistleblowers, I thought they were trying to increase it.",
          "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldi5lj1/",
          "created": 1721161024,
          "depth": 1,
          "replies": [
            {
              "id": "ldjpj5x",
              "score": 9,
              "body": "They're lowering both demand and supply, the overachievers",
              "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldjpj5x/",
              "created": 1721181444,
              "depth": 2,
              "replies": [
                {
                  "id": "ldkkook",
                  "score": 1,
                  "body": "They kinda understand capitalism but have some of the details mixed up",
                  "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldkkook/",
                  "created": 1721196538,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ldj8n27",
      "score": 15,
      "body": "Airplanes can be full and still have an over capacity issue. Modern revenue management dictates that an airline will lower prices to almost nothing to fill a seat rather than have it go empty. What Delta and the other airlines are seeing is a precipitous drop in yields due to a lack of high end demand. Compare today to the revenge travel days when people were spending a massive amount of money (or more likely saved up miles, doesn't matter to the airline) and the same seats were going for top dollar.\n\nCurrently the major airlines are eating the low cost carrier's lunch with basic economy fares. They had the advantage of having the same Spirit Airlines customer in the same jet as the high end business class ones. However if demand drops, even a small amount, those basic economy fares take up a much larger portion of the seats and those high end first class seats go to free upgrades. That's how you can still have a full jet and lose a LOT of money.",
      "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldj8n27/",
      "created": 1721174800,
      "depth": 0,
      "replies": [
        {
          "id": "ldm0pnv",
          "score": 0,
          "body": "This.\n\nIIRC, first class tickets alone make up half the revenue of the entire flight. If they don’t fill that first, they’re likely going to lose money.\n\nEdit: First and business class combined makes up half actually. Specifically the larger capacity planes.",
          "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldm0pnv/",
          "created": 1721224860,
          "depth": 1,
          "replies": [
            {
              "id": "ldm580z",
              "score": 1,
              "body": "That’s like not true at all. Especially on domestic flights. You think 16 people pay more than a collective 150 people?",
              "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldm580z/",
              "created": 1721226437,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldi14ec",
      "score": 20,
      "body": "Capacity is an industry wide metric. Not a Delta metric. Second point, you don't see the planes on the ground and the routes that are not being flown. \n\nOverseas travel has really fallen off and a lot of overseas carries are cutting back routes too.",
      "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldi14ec/",
      "created": 1721159574,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldhupiw",
      "score": 16,
      "body": "your anecdotal example of \"several times this year\" compared to - Delta Air Lines operates over 4,000 flights daily.\n\nalso, you flying out of the ATL hub? its almost always gonna be full there, because they run so many flights thru it, a good portion of the plane is probably people making connections. But for those taking a multi-leg journey with ATL as only part of it, those other legs are where that extra capacity may be showing.",
      "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldhupiw/",
      "created": 1721157484,
      "depth": 0,
      "replies": [
        {
          "id": "ldi3j10",
          "score": 2,
          "body": "Closer to 12.  Dallas. Charlotte. Los Angeles. DC. and a bunch of international flights. All on various airlines. I might have forgotten one or two. But I can’t recall seeing a single seat available. It could be anecdotal or the flights that I don’t see. But that’s why I am having this discussion.",
          "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldi3j10/",
          "created": 1721160355,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldilark",
      "score": 7,
      "body": "I get on a plane maybe once every 10 years and god damn is that way too much.",
      "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldilark/",
      "created": 1721166202,
      "depth": 0,
      "replies": [
        {
          "id": "ldk2j5h",
          "score": 4,
          "body": "I recently decided that the next time I fly, it will be when they scatter my ashes to the wind.",
          "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldk2j5h/",
          "created": 1721186952,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldi11pt",
      "score": 4,
      "body": "Sure... And I'm having less seggs because I have too many hoes. Right.",
      "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldi11pt/",
      "created": 1721159551,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldhwfn2",
      "score": 2,
      "body": "I have friends working in flyover states. It is roulette getting flights home. They often get cancelled and refunded due to not being full enough.",
      "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldhwfn2/",
      "created": 1721158046,
      "depth": 0,
      "replies": [
        {
          "id": "ldioy2h",
          "score": 21,
          "body": "It’s not legal for them to cancel flights due to “not being full enough”.  Lying on the internet?  Never happens.",
          "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldioy2h/",
          "created": 1721167471,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldiacnv",
      "score": 2,
      "body": "\nThe way THEY count capacity is the amount of employees vs physical resources vs consumer income. Too much capacity could mean they have plenty of pilots and attendants, but not enough planes to put them in, dropping their capability to serve and costing them revenue. To rectify this, they’ll either secure more planes and resources, or they’ll announce layoffs to balance it out, or they’ll keep shit the same and announce fare hikes to balance the loss that way.",
      "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldiacnv/",
      "created": 1721162555,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldirblj",
      "score": 2,
      "body": "Planes being full to you means nothing. A plane that HAD 20 extra seats could be filled with non revs, other airline employees commuting, buddy pass holders, delayed passengers rebooked from other flights, same day standbys that were on the later flight etc. it says nothing about how many revenue generating people are actually on board.\n\n\nAll airlines have to supply seats in suboptimal (for them) ways. Saturday/sunday flights into Vegas are generally pretty empty but necessary to have those planes to carry people home. Early morning and late night flights are also usually pretty empty as people usually want to fly during convenient hours.\n\n\nFinally a level of overcapacity is not always bad - they would be positioned to absorb customers in case of another airline meltdown like United or southwest the previous 2 years, or spirit every other day. Overcapacity also lets them recover faster from IRROPs and mechanical delays.\n\n\nDeltas results are still very strong, it’s just a Wall Street mentality that if line stops going up then stock price must come down.",
      "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldirblj/",
      "created": 1721168323,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldi2vco",
      "score": 1,
      "body": "Dont worry, Boeing is trying its hardest to lower capacity",
      "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldi2vco/",
      "created": 1721160140,
      "depth": 0,
      "replies": [
        {
          "id": "ldi5wst",
          "score": 1,
          "body": "Between killing passengers and whistleblowers, I thought they were trying to increase capacity.",
          "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldi5wst/",
          "created": 1721161125,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldi3t1v",
          "score": 0,
          "body": "It helps them to lower capacity? I would assume as a factory they would want max capacity for max profits.",
          "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldi3t1v/",
          "created": 1721160445,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldk7hby",
      "score": 1,
      "body": "4k/seat? Are you talking about one of the routes they were trying to kill off stating \"no demand\"",
      "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldk7hby/",
      "created": 1721189296,
      "depth": 0,
      "replies": [
        {
          "id": "ldm39fb",
          "score": 1,
          "body": "Nope. When I looked at the seats at the time there was mostly taken seats. To be transparent that $4k/seat was round trip if it makes a difference.",
          "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldm39fb/",
          "created": 1721225760,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldlu0r5",
      "score": 1,
      "body": "That's what she said.",
      "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldlu0r5/",
      "created": 1721222372,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le0gbkc",
      "score": 1,
      "body": "Good routes are oversold at lower prices to compete with other airlines. That is your experience.\n\n\nBad routes are alsk undersold at lower prices to compete with competition.\n\n\nCapacity is a fine excuse, but the story has layers.",
      "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/le0gbkc/",
      "created": 1721434341,
      "depth": 0,
      "replies": [
        {
          "id": "le0gjd0",
          "score": 1,
          "body": "Exactly… that’s what I’m trying to say. The story has multiple layers and isn’t as simple as overcapacity.",
          "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/le0gjd0/",
          "created": 1721434431,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldigvix",
      "score": 1,
      "body": "I fly a few times a month. Used to be a lot of Delta, but last year they decided to insert cylindrical objects into my body when they changed Skymiles. This year it's been no Delta (better to use the miles to maintain status on another airline). My flights are almost always full.\n\nSo, from my limited point of view they are spot on: too much spare capacity but only for Delta.",
      "permalink": "/r/wallstreetbets/comments/1e4wroy/delta_says_lower_earnings_is_because_of_too_much/ldigvix/",
      "created": 1721164699,
      "depth": 0,
      "replies": []
    }
  ]
}