{
  "title": "Sell, Sell, Sell....when is the right time to sell?",
  "score": 49,
  "selftext": "Do you have an exit strategy when you buy?  I am looking at my portfolio and pruning over last 2 weeks.  Probably too early, but many investments no longer fit the thesis I bought them for originally.  Example Iron Mountain IRN, was a dividend reinvestment play, but I got lucky because of AI boom and it doubled in value in 2 years but I would not even consider buying it now or keeping drip on because new money is not even at inflation rate dividend yield.  Plus 20 years worth of dividends in value in 2 years, thank you.\n\nI also pruned things that have had huge runs, that could mean 5 shares or 50 shares depending on price,  at some point there will be a pull back and want some fire power to jump in on new ideas,  And of course there are the dreaded losers.  This one I have the hardest time with,  when is the right time to call it quits?  Turn the page and admit you blew it, currently in my penalty box, vale, path, ddd, and zim.  The earnings calls are not bad, professional, leaves you feeling good about management.  But stocks are awful, just putrid\n\n  \nCurious to what gets you out of your investments...Thank you",
  "link_flair_text": "Industry Discussion",
  "id": "1e55919",
  "num_comments": 121,
  "created_utc": 1721178180,
  "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/",
  "comments": [
    {
      "id": "ldjrwj8",
      "score": 193,
      "body": "1)  when you need money \n2)  When you can't sleep at night \n3)  when you achieved your goals. \n4) when the environment changes adversely",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjrwj8/",
      "created": 1721182392,
      "depth": 0,
      "replies": [
        {
          "id": "ldkm050",
          "score": 50,
          "body": "5. When your situation changes.\n(I'm focused on this one, as someone who retired last week.)",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkm050/",
          "created": 1721197354,
          "depth": 1,
          "replies": [
            {
              "id": "ldmodkh",
              "score": 8,
              "body": "Congratulations on retirement!",
              "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldmodkh/",
              "created": 1721232704,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ldkn755",
          "score": 1,
          "body": "Securities based lending entered the chat",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkn755/",
          "created": 1721198103,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldl2hu0",
          "score": 1,
          "body": "Needs a 5th something along the times of taking some profits off the table",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldl2hu0/",
          "created": 1721208445,
          "depth": 1,
          "replies": [
            {
              "id": "ldl6pm0",
              "score": 6,
              "body": "That's #3",
              "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldl6pm0/",
              "created": 1721211230,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ldo2xyx",
          "score": 1,
          "body": "💯",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldo2xyx/",
          "created": 1721248780,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldk9uz4",
          "score": 1,
          "body": "Probably best advice here",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk9uz4/",
          "created": 1721190489,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldkhzpu",
          "score": -10,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkhzpu/",
          "created": 1721194940,
          "depth": 1,
          "replies": [
            {
              "id": "ldkm88n",
              "score": 3,
              "body": "That is literally so different than what he listed that it doesn't deserve to be part of his list",
              "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkm88n/",
              "created": 1721197493,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ldlwqe1",
              "score": 0,
              "body": "Perhaps phrased differently... \n- When better opportunity arises.",
              "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldlwqe1/",
              "created": 1721223407,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldjjphz",
      "score": 146,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjjphz/",
      "created": 1721179121,
      "depth": 0,
      "replies": [
        {
          "id": "ldjkie0",
          "score": 47,
          "body": "\"Nature has infinite resources to exploit.\"  -Wallstreet bros ",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjkie0/",
          "created": 1721179439,
          "depth": 1,
          "replies": [
            {
              "id": "ldk7wdr",
              "score": 4,
              "body": "Money is just numbers in a computer at this point. \n\nAnd I don't see us running out of bigger numbers",
              "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk7wdr/",
              "created": 1721189503,
              "depth": 2,
              "replies": [
                {
                  "id": "ldk8wa6",
                  "score": 0,
                  "body": "Are you asserting that the financial market has zero relevance to the real tangible market? Interesting view. Care to elaborate? ",
                  "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk8wa6/",
                  "created": 1721190002,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldk9cko",
                      "score": 0,
                      "body": "Can just keep printing more money... \n\nZimbabwe stocks values would need to written in scientific notation",
                      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk9cko/",
                      "created": 1721190230,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldka5n1",
                          "score": 0,
                          "body": "One apple is worth $1,000,000,000,000*100,00,00,000,000. Totally reasonable take. /s",
                          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldka5n1/",
                          "created": 1721190642,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ldjlid4",
              "score": 11,
              "body": "[removed]",
              "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjlid4/",
              "created": 1721179843,
              "depth": 2,
              "replies": [
                {
                  "id": "ldjlsjd",
                  "score": 11,
                  "body": "We used to have Atlantic Salmon runs a couple hundred years ago. Human behavior destroyed their habitat. ",
                  "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjlsjd/",
                  "created": 1721179956,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldjprft",
                      "score": 1,
                      "body": "[removed]",
                      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjprft/",
                      "created": 1721181536,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldjs9q1",
                          "score": 13,
                          "body": "Wild Salmon fishing is a multi billion dollar industry. The government is spending billions to try and preserve Salmon habitats. \n\n\n\"The US has spent more than $2B on a plan to save salmon. The fish are vanishing anyway.\"\n\n\nhttps://www.opb.org/article/2022/05/24/pacific-northwest-federal-salmon-hatcheries-declining-returns/\n\n\n\n\n\nThe report also shows that removal of the four lower Snake River dams and subsequent recovery of Snake River salmon populations would be a boon for fishing and outdoor recreation industries in the West. Representing a nearly five-fold increase in commercial fishing, sport fishing and recreational opportunities in the Columbia Basin and five Pacific states – California, Oregon, Washington, Idaho and Alaska – revenues could reach $20 billion over the next two decades\n\n\n\nhttps://www.wildsalmon.org/facts-and-information/revenue-stream.html\n\n\n\n\n\nThe fact that we can't even fathom wild Atlantic Salmon means there was a huge source of 'revenue' that is no more. \n\n\nNow zoom out and look at the sustainability of global fishing practices. If you go into any grocery you can see a literal Wall of canned tuna. \n\n\nI predict my grandchildren will be as able to comprehend this present day abundance as we are able to comprehend Wild Atlantic Salmon. \n\n\nIf you can't fathom the economic consequences maybe it's time to touch grass. ",
                          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjs9q1/",
                          "created": 1721182540,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ldk8sht",
                              "score": 3,
                              "body": "That's a nice bit of information, an example for financially reasonable environmental protection. Thanks for sharing!",
                              "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk8sht/",
                              "created": 1721189950,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "ldjut7s",
                              "score": 2,
                              "body": "I think you're getting off topic with this. Yes resources are finite if not maintained properly, however the other person was mentioning that resources are technically infinite which holds true as long as the supply is maintained properly and taken care of.\n\nFor example with salmon, if we had taken it seriously much sooner and put restrictions in place to make sure the wild ecosystem wasn't destroyed I'm sure it would be flourishing today. The main issue was old habits before we understood that we can't take the environment for granted.\n\nTrees are another issue, we currently are cutting down more trees than we have the capability to replace due to the ammount of time it takes for a tree to fully grow plus the nutrients and space they need. However recent efforts of charities like team trees have made a huge impact on the issue. I believe that the only solution to the problem at this point is to create a new plant that grows at a faster rate but has the same structure needed to create paper, or turn to paper made from stone, which may be equally bad for the environment, but will give us time with a fresh supply to think of a better solution.\n\nTL;DR I believe any resource is infinite if maintained properly and recycled. We can also create some resources like coal and diamonds",
                              "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjut7s/",
                              "created": 1721183583,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ldjx3ed",
                                  "score": 2,
                                  "body": "\n\n\n>\"I'm sure it would be flourishing today.\"\n\nI'm sure it would not. Pacific Salmon populations are under dire threat currently, while we are well aware about their habitats and how to preserve them. The government is spending billions to try and preserve their habitats and they are still failing. \n\nZoom out to global fishing practices and it paints an even more dire picture.   Look at how China is fishing.\n\nThe extraction of resources like this is driving many fish species to the brink of extinction.  \n\nYou could see the collapse of trillion dollar industries, and centuries old fishing communities in our lifetime. Not good economic viability if you ask me. ",
                                  "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjx3ed/",
                                  "created": 1721184539,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ldkifrg",
                                      "score": 1,
                                      "body": ">I'm sure it would not. Pacific Salmon populations are under dire threat currently, while we are well aware about their habitats and how to preserve them. The government is spending billions to try and preserve their habitats and they are still failing. \n\nAre you a selective reader or something? I said if we took the correct steps \"SOONER\" than within the last 50 years I'm sure it would be flourishing the issue is that they didn't take it seriously until it became a huge problem. Read before you cherry pick a quote and comment\n\n\n>Zoom out to global fishing practices and it paints an even more dire picture.   Look at how China is fishing.\n\n>The extraction of resources like this is driving many fish species to the brink of extinction.  \n\n>You could see the collapse of trillion dollar industries, and centuries old fishing communities in our lifetime. Not good economic viability if you ask \n\nAll of this is completely off topic of the question \"IF we maintained\" you keep talking in reality when littlerally everyone else has been talking in theory and technicality. IF we maintained our resources and recycled properly we WOULD be in a better place right now and resources would be infinite. Trillion dollar companies could use fish parms instead of destroying the ecosystem.\n\nIf you're just gonna not read and keep speaking on the present reality then this conversation is over because you clearly can't keep up with the topic at hand.",
                                      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkifrg/",
                                      "created": 1721195200,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "ldkisg6",
                                          "score": -1,
                                          "body": "I'm so sorry for speaking about reality and not your theoretical reality.  Please let me refrain from speaking about the way things actually are and let's restrict our conversation to what you think they theoretically could be. Sounds like a rational way to engage in discourse \n#/s ",
                                          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkisg6/",
                                          "created": 1721195405,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "ldkaenm",
                                      "score": -1,
                                      "body": "There is only one end result for mankind. Famine, war, disease and the death of majority of global population.",
                                      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkaenm/",
                                      "created": 1721190772,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "ldkihb3",
                                          "score": 2,
                                          "body": "Doesn't have to be if we change",
                                          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkihb3/",
                                          "created": 1721195225,
                                          "depth": 9,
                                          "replies": []
                                        },
                                        {
                                          "id": "ldkf4qv",
                                          "score": 1,
                                          "body": "\"The grim irony\n\nHe says the grim irony is that these tech billionaires are closely intertwined with, and benefiting from, systems which are indeed ravaging the planet.\n\nHe points to the dangers of \"violent, extractive, growth-based capitalism\", specifically big business' addiction to exponential growth.\n\n\"When you have to keep paying back your investors, 100 times, a thousand times, you've got to grow your company so much, that you need to do pretty much anything at all to keep growing,\" Rushkoff says.\n\nThis addiction to growth is \"accelerating the rate at which the planet gives up on us [and] it becomes unlivable\", he says.\n\n\n\n\nAnd he says even well-meaning billionaires sometimes just don't get it.\n\n\"I've talked to a lot of these tech bros by now. You take a tech bro and you send them to Burning Man or down to South America and let them do ayahuasca. They come back, saying, 'Oh my gosh, I have the plan now to save civilization and create ecologically renewable cities'.\"\n\n\"[They say] 'all we've got to do is clear cut that forest and put in my dome and my solar panels'.\"\n\n\n\n\n\"I said, 'The way to keep your head of security from shooting you when you're in the bunker together later is to pay for his daughter's Bat Mitzvah today'.\" \n\n\"The way to prevent the calamity, the catastrophe, is to start treating other people better now.\n\n\"But that's not the American way. That's certainly not the way of the Mindset … They want to lord above the rest of humanity.\"\n\nSo what is Rushkoff's main message for humanity?\n\n\"Well, people are going to hate this. But really, it's the old fashioned kind of stuff. We need to realise we're all in this together, and we can just do less, we can become more local and more social … I think really the object of the game is to really change what we look at as success.\"\n\nAnd specifically to the tech bros: \"[Ask] how can I roll my sleeves up and make this world better?\"\n\n\n\n\nhttps://www.abc.net.au/news/2022-10-20/tech-billionaires-are-planning-for-the-apocalypse/101546216",
                                          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkf4qv/",
                                          "created": 1721193318,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ldl0syj",
                  "score": 1,
                  "body": "No, for all intents and purposes it absolutely cannot.",
                  "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldl0syj/",
                  "created": 1721207265,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ldjnkxl",
              "score": 3,
              "body": "No, the FED does have infinite money though",
              "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjnkxl/",
              "created": 1721180670,
              "depth": 2,
              "replies": [
                {
                  "id": "ldjscrk",
                  "score": 1,
                  "body": "That's alright,  we'll make More!",
                  "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjscrk/",
                  "created": 1721182573,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ldk3mgf",
              "score": 1,
              "body": "If the market ever crashes and never recovers then you'll have much more pressing worries. So let her ride, it'll either be fine or the world won't exist in a state for you to worry about money anymore.",
              "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk3mgf/",
              "created": 1721187454,
              "depth": 2,
              "replies": [
                {
                  "id": "ldk8oi4",
                  "score": 1,
                  "body": "Because you can't eat money, which is exactly my point. ",
                  "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk8oi4/",
                  "created": 1721189894,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ldk9nc1",
          "score": 3,
          "body": "They’re not making anymore land!",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk9nc1/",
          "created": 1721190382,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldjp59c",
          "score": 5,
          "body": "That's a great slogan, but not at all true,  otherwise Berkshire would still have US Air and a few other airlines.  Nor would people pour over the 13F's to see what berkshire bought and sold",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjp59c/",
          "created": 1721181292,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldjlnlm",
      "score": 60,
      "body": "Be a long term investor. Don’t buy/sell based on stock price \n\nSell when you need liquidity or if the underlying business is no longer valuable to hold.\n\nTime in the market > timing the market",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjlnlm/",
      "created": 1721179901,
      "depth": 0,
      "replies": [
        {
          "id": "ldjvp6b",
          "score": 16,
          "body": "Even long time investors need to cut and run if a company starts making poor decisions or the industry changes?",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjvp6b/",
          "created": 1721183954,
          "depth": 1,
          "replies": [
            {
              "id": "ldk0o4a",
              "score": 7,
              "body": "Yes, every investor needs to. \nOnly difference is the time frame",
              "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk0o4a/",
              "created": 1721186105,
              "depth": 2,
              "replies": [
                {
                  "id": "ldpk057",
                  "score": 1,
                  "body": "And the tax implications.   Why should I sell a stock that plummets 15% when I'll have to pay a LTCG tax of 20+% on the proceeds?",
                  "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldpk057/",
                  "created": 1721268197,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ldkasp8",
          "score": 5,
          "body": "This only works if you don't invest in shit stocks.",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkasp8/",
          "created": 1721190976,
          "depth": 1,
          "replies": [
            {
              "id": "ldkbdh0",
              "score": 3,
              "body": "And if you find yourself investing into shit stocks, stick to index funds.",
              "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkbdh0/",
              "created": 1721191277,
              "depth": 2,
              "replies": [
                {
                  "id": "ldkgnpq",
                  "score": 4,
                  "body": "Yes, stick to fund/etf if you do not want to spend time on research, regular monitoring of stocks and manage your emotions towards the market. \n\nEarn an average 10% of market return every year on s&P500 and double your money every 5 years. Consistently contribute to the fund on a regular basis. If you aren’t confident to earn more than 10% average annual return, stick to funds.",
                  "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkgnpq/",
                  "created": 1721194177,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ldkhkcq",
          "score": 2,
          "body": "Yeah I’m using cash broker account for stocks I don’t need to be worrying about because they will surely grow in time",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkhkcq/",
          "created": 1721194692,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldjotpj",
      "score": 15,
      "body": "The right time to sell is a highly personal decision that varies for each investor. For me, it's a combination of quantitative analysis and qualitative factors.\n\nHere's my approach:\n\n1. Quantitative: I analyze potential returns compared to benchmarks like the S&P 500.\n2. Qualitative: I prioritize understanding and interest in the business. If I don't grasp the company's operations or find it compelling, I'm less likely to invest, regardless of potential returns.\n\nWhy? I've found that when I don't truly understand or believe in a company, I'm more likely to sell during turbulent periods. On the flip side, when I'm genuinely interested in a business, I'm better equipped to weather both the ups and downs.\n\nMy ideal investments are companies I'm passionate about and confident in holding long-term, through thick and thin. This approach helps me avoid impulsive selling decisions based on short-term market fluctuations.\n\nRemember, the key is to develop a strategy that aligns with your investment goals, risk tolerance, and personal interests. What works for me might not work for everyone, so it's crucial to find your own balance.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjotpj/",
      "created": 1721181163,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldjoyk5",
      "score": 9,
      "body": "If you’re trimming winners, you may as well also trim losers for tax loss harvesting. It’s a win win, cut out the losers and free up cash while making your tax burden on winners lower. Typically in December to get for this year.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjoyk5/",
      "created": 1721181217,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldjjzkx",
      "score": 11,
      "body": "Do you have a better place to put the cash?",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjjzkx/",
      "created": 1721179232,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldk425d",
      "score": 10,
      "body": "I have a few long term positions that I leave untouched for years to come, this is probably 90% of my portfolio. The other 10% I play around with and day trade.\n\nI've made a ton of money off of the 10% which is 30k im gambling with. I usually have a goal of making a 3-5% return on day trades. So if I'm ever around a 1k return in a single day, we'll shit that's more than I would make in a day at my actual career so I'll sell. \n\nI used to get greedy and jump immediately back in after having sold something for a profit, and that's when I get stuck in a stock for longer than I want to and my money is sitting there doing nothing.\n\nI also don't play with options.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk425d/",
      "created": 1721187653,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldjrzp2",
      "score": 5,
      "body": "IRM is one of my favorites but I also wouldn't enter at these prices. A few weeks ago I noticed it trading sideways from $73-83 and I thought about swinging it but then it just took off 😳 \n\nIt keeps hitting all time highs, which can go on for a while. I've made profit a couple times before with it by simply trimming my position gradually. I regret not keeping closer track of it over the months (for potential reentry), but then again my investment strategy has changed",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjrzp2/",
      "created": 1721182428,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldk4y35",
      "score": 6,
      "body": "I don't touch a stock unless cyclically it's low and I know the price it should be. The sell price I update with news higher or lower, but I always, ALWAYS have a price where its going to go and go no more.\n\nWarren Buffett dips into stocks all the time and out and he does the same thing.  Don't believe the hype, he LIKES TO keep forever but he does not do that.  I can name so many stocks hes gotten into and out of after making his money....\n\nEveryone needs to stop mis quoting the smartest investor on the planet to fit their narrative.  The truth isn't often what we want it to be.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk4y35/",
      "created": 1721188069,
      "depth": 0,
      "replies": [
        {
          "id": "ldltzdf",
          "score": 2,
          "body": "How do you determine what the price should be?",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldltzdf/",
          "created": 1721222357,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldjzxhc",
      "score": 7,
      "body": "Depends on what kind of investor you are but I have learned that it is not uncommon for many stocks to drop large % at different times so you need to have a disciplined strategy.  IBD suggests cutting loss at 8% for initial purchases.  For long term holds it is more of a personal decision & taxes need to be considered.  A very common approach is to sell part when 50 day MA is broken & sell more when 200 day is broken.  The main thing is to have a strategy.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjzxhc/",
      "created": 1721185772,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldpbgme",
      "score": 4,
      "body": "I buy shares of a s&p 500 fund and bluechip stocks such as Apple, Microsoft, Walmart, Waste Management and Alphabet. I buy every week and I’m accumulating into retirement, or to buy real estate. The time to sell is never, unless I’m reinvesting into something such as real estate or if I absolutely needed the money. Over many years most blue chip stocks will increase way more than decrease, and the s&p 500 fund will as well. Buy the s&p and buy great companies and hold onto them as long as possible and watch your wealth grow.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldpbgme/",
      "created": 1721264833,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldjzlqd",
      "score": 3,
      "body": "BUY BUY BUY!",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjzlqd/",
      "created": 1721185627,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldkqyos",
      "score": 3,
      "body": "1. When SPX closes 3,5% above its SMA200, buy SSO (2x long SPY).\n2. When SPX closes 3,5% below its SMA200, sell SSO (2x long SPY).\n\nThank me later.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkqyos/",
      "created": 1721200526,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldjji55",
      "score": 6,
      "body": "When it goes to $1000 per share 😂",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjji55/",
      "created": 1721179040,
      "depth": 0,
      "replies": [
        {
          "id": "ldjlfib",
          "score": 2,
          "body": "Minimum?  $1,850 is VW $1,000 per share for inflation.",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjlfib/",
          "created": 1721179812,
          "depth": 1,
          "replies": [
            {
              "id": "ldjljix",
              "score": 2,
              "body": "$5,ooo",
              "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjljix/",
              "created": 1721179856,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldjkasn",
      "score": 6,
      "body": "When you have a better place to put the sold cash.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjkasn/",
      "created": 1721179356,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldjkq8k",
      "score": 2,
      "body": "FSLY Chargepoint square PayPal - I don’t have exit plan for all these companies and all the paper gains gone",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjkq8k/",
      "created": 1721179528,
      "depth": 0,
      "replies": [
        {
          "id": "ldk9s1w",
          "score": 1,
          "body": "i think SQ is a good hold long term. i averaged down when it was hovering around 40-60. can’t say the same about the others",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk9s1w/",
          "created": 1721190448,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldlhp9d",
          "score": 1,
          "body": "I just got into chargepoint,  I used to make fun of my buddy who loved it, the former ceo was a knucklehead and ran a zoo.  Super unprofessional earnings calls, the one right before he got fired was hall of fame bad.  New guy is a real ceo, I really liked last call.",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldlhp9d/",
          "created": 1721217160,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldjpx7o",
      "score": 2,
      "body": "Sell price action reversal from up to down. Pare at resistance and when price action gets choppy. ",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjpx7o/",
      "created": 1721181599,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldk3f45",
      "score": 2,
      "body": "Investing, my plan is hold for a minimum of 3 years, preferably forever when I buy any stock.\n\nTrading, make a few % in profit initially. I'll sell some shares to profit take, and leave the rest to ride with a trailing stop loss.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk3f45/",
      "created": 1721187360,
      "depth": 0,
      "replies": [
        {
          "id": "ldk8uog",
          "score": 1,
          "body": "What trail percentage do you like to use?",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk8uog/",
          "created": 1721189981,
          "depth": 1,
          "replies": [
            {
              "id": "ldlqg4q",
              "score": 1,
              "body": "Depends on the market and what the stock is doing, but usually between 2-5%.",
              "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldlqg4q/",
              "created": 1721220963,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldkkrrs",
      "score": 2,
      "body": "For me, I exit investments when they no longer align with my original thesis, have reached my target price, or significantly underperform despite good management.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkkrrs/",
      "created": 1721196592,
      "depth": 0,
      "replies": [
        {
          "id": "ldli8yc",
          "score": 1,
          "body": "I agree, i try to use a trailing stop order if a stock just moves right past a target price",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldli8yc/",
          "created": 1721217412,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldjwsl9",
      "score": 2,
      "body": "Warren Buffett once said that it’s wise for investors “to be fearful when others are greedy and to be greedy only when others are fearful.”",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjwsl9/",
      "created": 1721184413,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldjqms0",
      "score": 2,
      "body": "If it's good enough to screenshot then it's good enough to sell",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjqms0/",
      "created": 1721181881,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldjq4e1",
      "score": 1,
      "body": "Try to sell late. So you never miss out on it going up",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjq4e1/",
      "created": 1721181678,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldjvfmt",
      "score": 1,
      "body": "Hold a stock until it makes sense to sell it. \n\nIs there somewhere else that makes more sense to put your money to work? I have bought and sold over the last 2 weeks and every single decision I made was a good one.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjvfmt/",
      "created": 1721183843,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldk04wz",
      "score": 1,
      "body": "When I really need the money, thats when I sell :)",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk04wz/",
      "created": 1721185866,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldk2xrq",
      "score": 1,
      "body": "Never.   I’m gonna live off it’s growth in a few years",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk2xrq/",
      "created": 1721187139,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldk39dp",
      "score": 1,
      "body": "sell whenever you feel like to. just don't sell hastily",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk39dp/",
      "created": 1721187287,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldk4b8c",
      "score": 1,
      "body": "I sell whenever a better opportunity arises (usually because one of the companies I've invested in has gone significantly up in value and the others haven't yet). A company which is a great buy at one price is often a great sell at a different price.  \nAlso, I currently have a small stake in IRM because it has a very high P/B ratio, meaning it has a lot of value outside its shareholder's equity. A high P/B ratio means that a company has a high return on equity, which is often an indicator of excess returns, and/or a high P/E ratio, which means that value investors who just pick blindly aren't buying it and the only people who are buying are those who have actively researched the company and invested despite the high P/E ratio, meaning it's more likely to be undervalued. Of course, this could be a really stupid strategy, which is why I've only got £10 in, but it's worked well so far. Made an 11% return in just over a month. Working almost as well as the Weekly DipBuy.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk4b8c/",
      "created": 1721187773,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldk52pr",
      "score": 1,
      "body": "I think you already answered your own question. Always ask yourself this, will I be buying the underlying at current price? If the answer is no, then you should probably sell or at least take some off the table to cover your initial entry.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk52pr/",
      "created": 1721188130,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldk79dg",
      "score": 1,
      "body": "I only buy. I will tax gain harvest my first year of retirement for 0% tax. From then on I will sell 4% of my portfolio and add it to my pension for retirement.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk79dg/",
      "created": 1721189188,
      "depth": 0,
      "replies": [
        {
          "id": "ldlix1q",
          "score": 2,
          "body": "I like the sentiment, but that is a long time from now.  And If something rode up for 20 years, I am not riding it down like Nike.  I am not afraid of a little taxes if I am making money",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldlix1q/",
          "created": 1721217720,
          "depth": 1,
          "replies": [
            {
              "id": "ldm1gop",
              "score": 1,
              "body": "Good point, I’m only 4-8 years away from retirement. I also don’t know when stocks are going to decline (like you’re Nike example) so I wouldn’t know when to sell. My investments are in msft nvda lly amd asml cost crwd etc and I hope to hold them for a good profit. I only own 12 stocks at this point, everything else is voo, vti, vxus",
              "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldm1gop/",
              "created": 1721225129,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldkhdcp",
      "score": 2,
      "body": "A realtor once told me the answer to your question.\n\n\"Right now is a great time to sell\"\n\nand, coincidentally when I asked about entering the RE market, I got this answer: \n\n\"Right now is a great time to buy\"\n\nPS - I think realtors are generally low-life parasitic opportunistic scumbags.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkhdcp/",
      "created": 1721194582,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldkowf8",
      "score": 1,
      "body": "Never! What’s an exit strategy:D",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkowf8/",
      "created": 1721199186,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldksxxh",
      "score": 1,
      "body": "When you´re 6 feet under, your beneficiaries will do the selling promptly, don´t worry.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldksxxh/",
      "created": 1721201867,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldkzigi",
      "score": 1,
      "body": "I have all my ETFs on autosell when price drops 10%. ",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkzigi/",
      "created": 1721206370,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldl9jeu",
      "score": 1,
      "body": "You still have time...\n\nSell your tech, buy the Russell 2000 / S&P 600 Small Cap\n\nYou don't need to sell, you need to rotate",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldl9jeu/",
      "created": 1721212936,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldldc87",
      "score": 1,
      "body": "I ask my lucky eight ball. It's right some of the time. 🤑",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldldc87/",
      "created": 1721215009,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldlet97",
      "score": 1,
      "body": "Why would you sell when the next 4 years is gonna be bullish af",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldlet97/",
      "created": 1721215769,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldlgw0z",
      "score": 1,
      "body": "Hmm I'm about to cut my losses on some garbage I bought back in 2020 when everything was up. Help onto the garbage which is now over 50% or more in the red lol. Learned my lesson since then. Been purchasing FSKAX in the roth and FXAIX in the the work 401k and its been going well.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldlgw0z/",
      "created": 1721216784,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldm0s1g",
      "score": 1,
      "body": "Yes right now, all of it. Buy back in when the prices are higher. Story as old as the market",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldm0s1g/",
      "created": 1721224884,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldm268k",
      "score": 1,
      "body": "when you need to pay your bills in retirement",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldm268k/",
      "created": 1721225378,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldm4gii",
      "score": 1,
      "body": "I bought my stock and have owned it for over a year in my non retirement account.  I wanted to buy a new truck so I sold all my lost stock,  ones I knew I wasn’t going to ever break even on, to help offset taxes, and I sold all my all time high stock as well.  MSFT, VOO, VTI, APPL, AMZN, NVDA.\n\nDo I think these stocks will continue to go up, yes but who knows how much.  Did I find a better use for my investment, yes as I was able to put a good portion down on my truck and save a boatload in interest at today’s crappy loan rates.  Did I make money on most of my stocks, yes.  Was it the most I could have made, who knows, but it worked for me.\n\nNo regrets.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldm4gii/",
      "created": 1721226178,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldm8n0c",
      "score": 1,
      "body": "Buy high sell low",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldm8n0c/",
      "created": 1721227590,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldmanow",
      "score": 1,
      "body": "Never, hold until retirement",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldmanow/",
      "created": 1721228254,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldmqdh4",
      "score": 1,
      "body": "yesterday. always yesterday.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldmqdh4/",
      "created": 1721233337,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldn0ytj",
      "score": 1,
      "body": "I DCA so I never sell😀",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldn0ytj/",
      "created": 1721236687,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldn3rz6",
      "score": 1,
      "body": "Apparently yesterday.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldn3rz6/",
      "created": 1721237577,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldn7qxj",
      "score": 1,
      "body": "Yes",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldn7qxj/",
      "created": 1721238834,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldnizki",
      "score": 1,
      "body": "When you open a position, you should already identify a selling price.\nTaking profits never hurt anyone. Don't marry a stock, the market is always full of under priced stocks",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldnizki/",
      "created": 1721242405,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldqgeng",
      "score": 1,
      "body": "Hold it hold it hold it hold it, never sell! Much value!\nRising rising rising rising, I can tell. Very trading!",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldqgeng/",
      "created": 1721284266,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldqggne",
      "score": 1,
      "body": "If you want to sell, it means you chose the wrong investment.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldqggne/",
      "created": 1721284301,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldx69ru",
      "score": 1,
      "body": "High",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldx69ru/",
      "created": 1721392892,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldxhxql",
      "score": 1,
      "body": "when you need the money, having said that, can't go broke taking profit.\n\nFor a specific example I used covid stock profits to pay off all my debt. I didn't \"need\" the money but .",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldxhxql/",
      "created": 1721397443,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le5kear",
      "score": 1,
      "body": "I sold NVDA last Monday to reduce risk but bought it back after 10% drop. Sold some AVGO because I had too much. Mostly I sell due to target value I plan",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/le5kear/",
      "created": 1721519357,
      "depth": 0,
      "replies": [
        {
          "id": "le68xwz",
          "score": 1,
          "body": "I get the sentiment, but looking at chart 50 day moving average is to close, my gut says it will test the 115 and change level.  But I could be totally wrong.  I feel like nvidia has one more big move in it, then I am out.  I will put a trailing stop in once it makes a new high.  The volatility roller coaster is just getting to hard for me to ride",
          "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/le68xwz/",
          "created": 1721529997,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "le8hvdu",
      "score": 1,
      "body": "Personally, I have below 3 conditions to sell:\n\n1. When I need to buy house or go to hospital (big expenditure) --> I have to sell regardless of profit / loss in this case  \n2. When I found a lot better investment opportunity, compared to current portfolio --> Sell a little bit, and buy another stocks a little bit  \n3. When I retire and go 'full investor / retiree mode' --> maybe 20\\~30 years later? I need to sell very small portion of my portfolio monthly to cover living costs.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/le8hvdu/",
      "created": 1721574563,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldjrftg",
      "score": 1,
      "body": "I keep stop loss at 3%. I sell at 5% or higher profit. But lately it’s coming difficult to time it because it’s sudden and wild swing. Value investing is dead until you purchase Coca Cola and Apple at a low price. Mutual funds or ETF are better.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjrftg/",
      "created": 1721182204,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldjxd3q",
      "score": 0,
      "body": "When insiders are selling. Jeff Bezos is dumping Amazon shares. Jensen Huang is dumping Nvidia. The Zuck is dumping Meta. Now is the time to get rid of your tech stocks.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjxd3q/",
      "created": 1721184653,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldjtlzo",
      "score": 0,
      "body": "When there’s money.",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldjtlzo/",
      "created": 1721183085,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldk7zyf",
      "score": 0,
      "body": "I always have an exit strategy when I buy \n\nThe fed has infinite money in a way that they could actually keep printing till a world wide economic collapse happens\n\nI’m not saying that will ever happen \n\nI’m just saying that’s the power of the fed \n\nThe US owns 1/3 of its own debt \n\nWhich is a powerful feature \n\nAt anytime congress could pass a law that says \n\nHey foreigners aren’t allowed to own US debt and all current outstanding debt is null and void\n\nWill this happen no\nBecause it would kill the credit rating and remove the US dollar as the worldwide business currency \n\nHowever \n\nThey could do it if they wanted to \n\nAnyways I got a little off topic \n\nBut yeah\n\nAlways have an exit strategy even if it’s long term\nMoney always rotates and even the best rollercoasters have to come down once in awhile before it hits another twist turn or loop",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldk7zyf/",
      "created": 1721189552,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldkl4df",
      "score": 0,
      "body": "when the market hits an all time high.  thats when i sell",
      "permalink": "/r/stocks/comments/1e55919/sell_sell_sellwhen_is_the_right_time_to_sell/ldkl4df/",
      "created": 1721196806,
      "depth": 0,
      "replies": []
    }
  ]
}