{
  "title": "Chipotle (CMG) built loyalty program of 40 million members in only 5 years. ",
  "score": 44,
  "selftext": "# I'm a long-term shareholder in Chipotle (CMG) and I am hoping to gain other shareholders opinions on the fundamental drivers of their revenue and net margin growth. \n\n**Accelerated digital adoption during the pandemic has significantly bolstered Chipotle's loyalty program, expected to sustain higher order frequency and lower customer churn rates.** Chipotlanes, present in 25% of current store locations and in 80% of new openings, are poised to enhance competitive positioning against quick-service rivals and facilitate expansion into new markets. \n\n**I believe that Chipotle will open 300 new stores in 2024,** and my model projects high-single-digit unit growth through 2033 (8.5%), leveraging robust unit economics (with estimated cash-on-cash returns currently in the 50%-60% range, compared to midteens to low 20s for QSR peers) and strong cash flow generation. \n\n**I personally consider management's long-term goal of reaching 7,000 US restaurants feasible,** fueled by strong adoption in smaller and rural markets, as well as significant digital sales volumes acting as primary growth drivers.\n\nWhat are your thoughts - can Chipotle go from 3,200 stores to 7,000 stores in the next 5 years? ",
  "link_flair_text": null,
  "id": "1e6gqig",
  "num_comments": 33,
  "created_utc": 1721322949,
  "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/",
  "comments": [
    {
      "id": "ldtu24b",
      "score": 62,
      "body": "I love Chipotle but their loyalty rewards program is among the most useless I’ve ever seen. It feels like I have to buy like 50 burritos in order to get a free side of queso.",
      "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldtu24b/",
      "created": 1721335022,
      "depth": 0,
      "replies": [
        {
          "id": "ldvrz24",
          "score": 18,
          "body": "17 burritos for a free one",
          "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldvrz24/",
          "created": 1721363535,
          "depth": 1,
          "replies": [
            {
              "id": "ldy737n",
              "score": 4,
              "body": "So essentially a 5.6% discount if you choose to go through the app which doesnt sound bad but they raise their prices like 10% each year rendering it completely useless",
              "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldy737n/",
              "created": 1721405863,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ldx9w5s",
          "score": 3,
          "body": "When they first launched it I could order for a family of 5 and get a free entree every order. They scaled that back a lot. Now it’s like every third order I get a free one.",
          "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldx9w5s/",
          "created": 1721394385,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldtv0rg",
          "score": 2,
          "body": "You sadly are not wrong. Starbucks and that app have a better one. As an investor in the company I am focused on long-term FCF and revenue growth. \n\nWhat state are you in, out of curiosity? Are you in the Midwest or South? I’m always curious about how crowded the local Chipotles are where people live. The ones here in NYC are incredibly crowded to the point that I often eat at home because it can take 30 minutes just to stand in line.",
          "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldtv0rg/",
          "created": 1721335331,
          "depth": 1,
          "replies": [
            {
              "id": "ldw6utd",
              "score": 3,
              "body": "rural Florida, Chipotle usually has a couple people. Nothing crazy",
              "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldw6utd/",
              "created": 1721372118,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ldtx5ye",
              "score": 6,
              "body": "I’m in Denver, birthplace of Chipotle. Almost everyone here seems to like Chipotle so we have a lot of locations. Most of them are busy but not typically super packed like NYC.",
              "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldtx5ye/",
              "created": 1721336019,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ldzrjlg",
          "score": 1,
          "body": "Don’t worry you’ll get a participation badge!",
          "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldzrjlg/",
          "created": 1721424798,
          "depth": 1,
          "replies": []
        },
        {
          "id": "le33zp9",
          "score": 1,
          "body": "How times have changed.  I remember their temporary loyalty program after the bacterial contamination scares and it was every 4th one was free or some crazy crap",
          "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/le33zp9/",
          "created": 1721485816,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lejuev2",
          "score": 1,
          "body": "I gotta say I'm impressed with Jimmy Johns, I don't eat their often but last few visits got a free sandwhich, $2 off and a free cookie",
          "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/lejuev2/",
          "created": 1721745896,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldu92h6",
      "score": 22,
      "body": "I used to eat Chipotle as much as 4-5 times a week a few years back (not a great habit, I know). Over the years, I’ve had so many crappy experiences that I finally called it quits with them as a company two months ago and vow not to go back until things improve (which I doubt they will). Their reward member numbers do not show a full picture.",
      "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldu92h6/",
      "created": 1721340047,
      "depth": 0,
      "replies": [
        {
          "id": "ldui58t",
          "score": 9,
          "body": "Same here. The last time I ordered online and picked up my order, it was literally less than half full. And when I complained the employees literally started cracking jokes in the back and being completely ridiculous. It wasn’t a good location either, that had something to do with it I guess.\n\nAnyway, won’t go back.",
          "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldui58t/",
          "created": 1721344336,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldvcp0a",
          "score": 4,
          "body": "I agree that they’ve taken a huge nosedive but their earnings report indicates customers don’t agree with us",
          "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldvcp0a/",
          "created": 1721356484,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldvs2pb",
          "score": 2,
          "body": "Same here. At first I thought it was just the one by my house that never had fajita veggies prepped, undercooked their black beans, and couldn’t ever put guac on my burrito bowl ordered on the app. \n\nThen I went to other ones a little further from my house, and they all did the same thing. \n\nChipotle sucks.",
          "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldvs2pb/",
          "created": 1721363588,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldszv0l",
      "score": 19,
      "body": "In my opinion, a loyalty program doesn't generate cash flow. Loyalty programs are good for customer tracking... Head over to the reddit and the posts tend to be negative. Did chipotle publicly say how many loyalty members eat weekly?",
      "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldszv0l/",
      "created": 1721325194,
      "depth": 0,
      "replies": [
        {
          "id": "ldt9a0q",
          "score": 22,
          "body": "Using reddit as a metric for gauging any customer base is inherently flawed. You'll never get the impression of an average, everyday consumer, only the most dedicated fanboys and haters.\n\nIf you trusted the opinions of redditors to predict stock performance, you would have thought that META and Google were going to go bankrupt.",
          "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldt9a0q/",
          "created": 1721328263,
          "depth": 1,
          "replies": [
            {
              "id": "ldtdgqp",
              "score": 3,
              "body": "People on Reddit are very upset at constantly getting ripped off at Chipotle, but in real life I’ve only seen someone refuse to pay a very few times. ",
              "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldtdgqp/",
              "created": 1721329624,
              "depth": 2,
              "replies": [
                {
                  "id": "ldv7c8g",
                  "score": 2,
                  "body": "Lot of people won't speak up when something goes wrong at a restaurant but will stop going there after.  Reddit sentiment is an indication of the value proposition that chipotle poses.\n\n\nPersonally I went from eating there regularly to skipping it almost altogether. For me it was post pandemic I can do sit down mexican for the same cost. ",
                  "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldv7c8g/",
                  "created": 1721354284,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldvchvn",
                      "score": 1,
                      "body": "> Reddit sentiment is an indication of the value proposition that chipotle poses.\n\nThen why do Chipotle revenues keep climbing? I hate their skimping as much as you do but if the subreddit were a good gauge of how customers feel about the value proposition, Chipotle locations would be empty",
                      "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldvchvn/",
                      "created": 1721356401,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldvwx0o",
                          "score": 1,
                          "body": "Because people love to generalize their personal feelings and assume everyone feels the same way. It's the same reason why people say video games like Call of Duty and FIFA are so bad, yet those sell like hotcakes every time a new one comes out. They cannot wrap their head around the fact that the majority of people are satisfied customers.",
                          "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldvwx0o/",
                          "created": 1721366207,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ldt2fau",
          "score": 3,
          "body": "That's what I am trying to figure out and I find your take really interesting because as their loyalty program grew so did their cash flows and pretty much aligned with the growth of the program, so I don't fully agree with your take on that.",
          "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldt2fau/",
          "created": 1721326045,
          "depth": 1,
          "replies": [
            {
              "id": "ldt64tr",
              "score": 2,
              "body": "If we assume people wanted to eat there anyways, of course they would sign up. With Loyalty programs people assume they are getting something from it (buy x get one free). \n\nIf we assume the loyalty program was the driver of the person going there... The question becomes did they return after they signed up. Ie cash flow goes up while loyalty stays the same. It didn't seem like Chipotle provided any details that would explain what we are asking... That doesn't feel right... They could have said we have x% of weekly retuning customers. (Online platforms use daily and monthly avg users in a similar way.)\n\nImo the chipotlane is a better catalyst. We have one at my local and they are very convenient.",
              "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldt64tr/",
              "created": 1721327252,
              "depth": 2,
              "replies": [
                {
                  "id": "ldt73nk",
                  "score": 1,
                  "body": "out of curiosity where are you located? I am in New York City and I get so damn excited walking by the chipotles near me and seeing the lines stretch out the door. I never walk by and see them empty which is a good sign of strong demand.",
                  "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldt73nk/",
                  "created": 1721327563,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldt7jus",
                      "score": 1,
                      "body": "Rhode Island....\nAnecdotal but my local store is less busy than previous years.\nHave you checked out the reddit? Im not saying it's a good source but it's interesting....",
                      "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldt7jus/",
                      "created": 1721327708,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ldzs5t6",
          "score": 1,
          "body": "It does though. I never eat out unless it’s through a deal on the app. I’m sure they’re still making a profit even on the “deal” and if not the area they get you is if you get something not on the deal like another item or drink. But also good for tracking too and seeing what brings people into your store and how much they spend.",
          "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldzs5t6/",
          "created": 1721425018,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldv61tl",
      "score": 4,
      "body": "My son works at a store in Duluth, MN.  Says the customer lines never stop- and that is a relatively small college town on Lake Superior (<100K).  He thinks they manage the app orders vs walk in customers effectively.  CMG plan is to go from 1 to 4 stores in that Duluth-Superior market in the next year.",
      "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldv61tl/",
      "created": 1721353767,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldu9je8",
      "score": 3,
      "body": "I see a lot of resurgence of posts like this trying to justify why they should buy the CMG dip. \n\nAnd i get it, mexican food is nice, the growth story is good. Im not American but when i was last there a few years back, i loved it. We have equivalents in Australia where Im from and it does well.\n\nBut you can love the company and not love the stock. Bear in mind that at its P/E before split, all of your growth points above has been priced in. At a close to 60x p/e ratio, you are priced to perfection. Especially comparing against other QSR companies.\n\nIve said it in other subs but ill say it again, my thesis is that CMG has and lose a lot of the occasional customer much like SBUX. That is what will hurt their next earnings.\n\nBut what do i know, i own puts on both CMG and TSLA and look how the latter turned out 😂",
      "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldu9je8/",
      "created": 1721340889,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldvd1e9",
      "score": 3,
      "body": "Anecdotal, but the first time I tried a “chipotlane” it was such a bad experience I’ve never tried again and that particular location, the only one in my vicinity with a drive thru, has horrible reviews focused mainly on the drive thru.\n\nI’m not convinced Chipotle is ever going to be a good drive thru experience. The restaurant is not well set up for it.",
      "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/ldvd1e9/",
      "created": 1721356629,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le0b32b",
      "score": 2,
      "body": "I believe their growth will start slowing down. Their quality has gone down, and the cost for customers has gone up. The financial projections may say otherwise, but I don’t want to invest in a restaurant that I don’t even want to go to.",
      "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/le0b32b/",
      "created": 1721432233,
      "depth": 0,
      "replies": [
        {
          "id": "le1deo4",
          "score": -1,
          "body": "You don’t like chips and guacamole 🥑?!! I feel differently I like their food and find their restaurants fast and convenient",
          "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/le1deo4/",
          "created": 1721449206,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "le50uph",
      "score": 1,
      "body": "If you guys like free stuff the subreddit from Chipotle is entertaining and offers coupons",
      "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/le50uph/",
      "created": 1721511410,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le7kzft",
      "score": 1,
      "body": "So is this collapse some sort of record. Chipotle and Under Armour are in the same category now 😂",
      "permalink": "/r/stocks/comments/1e6gqig/chipotle_cmg_built_loyalty_program_of_40_million/le7kzft/",
      "created": 1721559542,
      "depth": 0,
      "replies": []
    }
  ]
}