{
  "title": "Why do stocks pump on massive volume, and then retrace to the original price?",
  "score": 78,
  "selftext": "[deleted]",
  "link_flair_text": "Industry Question",
  "id": "1e6ht3i",
  "num_comments": 54,
  "created_utc": 1721325921,
  "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/",
  "comments": [
    {
      "id": "ldtbr92",
      "score": 70,
      "body": "Let say a stock is trading at 5. I like it at 5, so I buy at 5. Suddenly, bunch of idiots start talking about thus stock as an AI play and they pump it up to 25. Stock tops off at 25. No buyers at 25.05.\n\nI may have liked the stock at 5, but it looks frothy at 25, so I decide to sell. Other people like me decide to sell as well. I find no buyers at 25 because those who liked it are already in. I have $20 in unrealized gains to play with, so I try to find a buyer at 24.5. Some of us find buyers, some of us don't so we look for buyers at 24. Some of us find buyers some don't and look for buyers at 23.\n\nThis just keeps repeating until you find consistent buyers at some price level that's lower than the high.",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldtbr92/",
      "created": 1721329062,
      "depth": 0,
      "replies": [
        {
          "id": "lduaphw",
          "score": 25,
          "body": "It's almost like supply and demand is a real thing.",
          "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/lduaphw/",
          "created": 1721341475,
          "depth": 1,
          "replies": [
            {
              "id": "ldud9ep",
              "score": 6,
              "body": "No we have infinite shares of everything.",
              "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldud9ep/",
              "created": 1721342487,
              "depth": 2,
              "replies": [
                {
                  "id": "lduo307",
                  "score": 3,
                  "body": "Are you being as sarcastic as I was?",
                  "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/lduo307/",
                  "created": 1721346582,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lduxdvf",
                      "score": 3,
                      "body": "They're being super cereal",
                      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/lduxdvf/",
                      "created": 1721350274,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "le4sbl5",
              "score": 1,
              "body": "On Reddit? No it isn’t.",
              "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/le4sbl5/",
              "created": 1721508137,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ldtchgk",
          "score": -13,
          "body": "This is cute.",
          "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldtchgk/",
          "created": 1721329297,
          "depth": 1,
          "replies": [
            {
              "id": "ldtp7x1",
              "score": 7,
              "body": "Long story short, Bag holders selling to the new bag holders.",
              "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldtp7x1/",
              "created": 1721333467,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldt42s8",
      "score": 82,
      "body": "Markets are irrational",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldt42s8/",
      "created": 1721326591,
      "depth": 0,
      "replies": [
        {
          "id": "ldtrwgo",
          "score": 25,
          "body": "No, it’s a voting machine until you click the sell button. It’s the best way to think about it in the short term.\n\nLong term price stability and discovery will always occur. \n\nAmazon for me has always been a buy below 2 trillion dollar market cap. I can’t believe how large that company is for only 1.9T and Apple’s business is selling the same product every single year and praying nothing happens on the competition and innovation side. Apple is worth 3.4T.\n\nI’m wrong. I don’t have enough money to vote enough.",
          "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldtrwgo/",
          "created": 1721334327,
          "depth": 1,
          "replies": [
            {
              "id": "ldtzhzt",
              "score": 4,
              "body": "If you think that’s crazy nvidia and Apple have a 4 billion (16 billion a year diffence) and nvidias only issue is people are buying too quick and they can’t keep up with supply, nvidia is about half apples market cap",
              "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldtzhzt/",
              "created": 1721336784,
              "depth": 2,
              "replies": [
                {
                  "id": "ldu0nlv",
                  "score": 9,
                  "body": "Thank you for including NVDA in the discussion. I was worried I didn’t bring it up.",
                  "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldu0nlv/",
                  "created": 1721337175,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldu1eie",
                      "score": 3,
                      "body": "I don’t have any nvidia position. I’m waiting until their p/e improves. But it’s an interesting stock to look at. I just don’t see much value in holding.",
                      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldu1eie/",
                      "created": 1721337428,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ldukgxo",
                  "score": 3,
                  "body": "lol people don’t buy Nvidia chips",
                  "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldukgxo/",
                  "created": 1721345215,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldumpoa",
                      "score": 2,
                      "body": "wha?  ever hear of a little thing called the rtx 4090?",
                      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldumpoa/",
                      "created": 1721346063,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lduo9ie",
                          "score": 2,
                          "body": "That’s what 22% of their revenue",
                          "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/lduo9ie/",
                          "created": 1721346651,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lduojif",
                              "score": 3,
                              "body": "A lot of chips. That’s what it is. You said “ people don’t buy nvidia chips” \n\nThat is absurd. They have led the gpu market for decades.",
                              "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/lduojif/",
                              "created": 1721346759,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ldup2ap",
                                  "score": 4,
                                  "body": "Well they made 13 billion dollars selling graphics cards in Q4 and have a market cap of 3 Trillion dollars lol. I hope you don’t own the stock because you like their graphics cards",
                                  "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldup2ap/",
                                  "created": 1721346957,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ldupa4q",
                                      "score": 2,
                                      "body": "no. i was countering your falsehood that \" people dont buy nvidia chips\"\n\npeople have been buying nvidia chips for decades",
                                      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldupa4q/",
                                      "created": 1721347042,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "ldupn9l",
                                          "score": 1,
                                          "body": "Well it’s 5 companies that buy nvidia chips. Thats the joke. Best of luck in market brother",
                                          "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldupn9l/",
                                          "created": 1721347183,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "le3w19f",
                          "score": 1,
                          "body": "Yea look at the numbers. Gaming cards are not a priority anymore at Nvidia. It makes up. Fraction of their revenue. It’s really surprising. What was once 100% of their business is now 15-20%.",
                          "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/le3w19f/",
                          "created": 1721496102,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "le3yw50",
                              "score": 1,
                              "body": "and?  I never said video cards are a big portion of their revenue. I was only countering the statement that people do not buy nvidia chips. a LOT of people buy nvidia chips. the fact that its 15-20% of revenue is irrelevant. \n\n15-20% of nvidias revenue is still a LOT of chips. saying people \"dont buy nvidia chips\" is absurd.",
                              "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/le3yw50/",
                              "created": 1721497147,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ldv27l3",
                          "score": 0,
                          "body": "I’ve heard of a little thing called your dick.  Incel",
                          "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldv27l3/",
                          "created": 1721352214,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ldtb9h1",
      "score": 56,
      "body": "How familiar are you with[ high frequency trading?](https://www.investopedia.com/terms/h/high-frequency-trading.asp)  Newb retail investors like to buy when they see spikes.  So do folks with long positions thinking their bet is finally paying off.  Most of it is psychology to take from folks that don't know fundamentals.  For some reason, we invented it and decided never to regulate it.",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldtb9h1/",
      "created": 1721328903,
      "depth": 0,
      "replies": [
        {
          "id": "ldvkgmm",
          "score": 5,
          "body": "You seriously think newb and veteran retail traders are capable of pulling hundreds of millions of shares per trade for shares at a price of double digits or more?\n\nIt’s 100% financial institutions performing high frequency trading with each other that causes the average pump and dump run.\n\nIt’s like comparing the average American annual carbon emissions from their car to the average coal factory’s annual carbon emissions. The car doesn’t come anywhere close to the levels of the coal plant.",
          "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldvkgmm/",
          "created": 1721359890,
          "depth": 1,
          "replies": [
            {
              "id": "ldvmbfj",
              "score": 8,
              "body": "the question was WHY are there massive volume spikes.  THOSE start with financial institutions using algorithms from information streams and just like sharks and blood, it creates frenzy ... till the meat is picked ... and then it settles back down.",
              "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldvmbfj/",
              "created": 1721360742,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldtxdz6",
      "score": 14,
      "body": "Ex-Institutional here. \n\nIts hard to grasp but at the top, price doesnt matter as much as liquidity. \n\nRamps into volume are when funds can rebalance - getting in AND getting out. \n\nAlso, if you are good at charting you can see the flow move through a 15min VWAP, 1hr, 4hr and then \"usually\" the blow off top is on the daily. \n\nNothing wrong with a retrace.  Just buy 3-5 days after the blow off top and you will do good. \n\n(As an example $AAOI is going through this now as many analysts think their 800 series can turn water in wine as an \"AI play\"  Wait for the dust to settle then re-take a look)",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldtxdz6/",
      "created": 1721336089,
      "depth": 0,
      "replies": [
        {
          "id": "leg6tdi",
          "score": 2,
          "body": "Hope everyone took action here.  AAOI just did what Ive made a small edge over my career: \n\nInitial thesis is sound.  Datacenters need their 800 optical switcher for AI.  \n\nEveryone figures this out, the stock ramps and then it RETRACES almost 100% of the inital ramp. \n\nIts just investors switching from ST to LT thinking ( those who were ST bail )",
          "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/leg6tdi/",
          "created": 1721685079,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldtrl9t",
      "score": 8,
      "body": "There are many possible reasons, but the most common one for this phenomenon has to do with options trading and folks trading on margin, especially those short the stock.\n\nBoth have a time element to them... for options, obviously the expiration dates forces trading behavior. If someone is long a call or put option, then the market maker has to do the corresponding trade in the stock to stay delta neutral. When the stock prices moves because of an event, then the folks that have options that are expiring have to make trades - which causes the market makers to buy or sell stock accordingly.\n\nCorrespondingly, traders that are exposed to margin, either with long common or through shorting the stock will likely make adjustments with significant stock price movement, and sometimes they are forced to do it due to margin calls.\n\nSometimes, it could just be that another stock causes widespread margin calls and the stock you are observing has a lot of profit (long or short) from which large numbers of investors will tap as a source of funds to cover the liquidity issue.\n\nIn short, gamma squeeze is the term for it, and it can actually go either way.\n\nThe reason for the short term movement with such spikes is usually due to the time components of either options or margin, and when that pressure is relieved, then the stock the bid or sell that is essentially forced and the volume tapers off. Often, if that price movement causes a move that makes the stock no longer interesting to further that price movement, then the price can come back towards where it was before. The drop in volume also drops the IV in the options, which further adds selling pressure of the option (which could be a long or short bet). That drop off in IV may then end up causing the options to be cheap enough again for speculators to load back up - and we repeat the cycle.\n\nIf the fundamental investment picture has changed, it may find a bid or sell well before a full reset to the earlier price... hence we talk about retracements.",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldtrl9t/",
      "created": 1721334227,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldth0lf",
      "score": 12,
      "body": "Algos cause much more extreme swings than prior to algos",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldth0lf/",
      "created": 1721330794,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldtsp9z",
      "score": 7,
      "body": "Simple really\n\nGreat news stock goes up. Stock goes up, more people want to experience those great gains. \n\nPrice goes too overvalued and the hype has settled down. People get scared stock is going down so they sell either to secure gains or prevent losses. \n\nStock goes back to its normal price and people are no longer interested because the stock has been tanking.",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldtsp9z/",
      "created": 1721334584,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldt2xwc",
      "score": 4,
      "body": "Reversion to the mean.\n\nhttps://www.investopedia.com/terms/m/meanreversion.asp",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldt2xwc/",
      "created": 1721326217,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldu16zq",
      "score": 5,
      "body": "I just see it as big fucking whales (or algos knowing retail will buy-jn if it spikes) throwing money at a stock and sucking in mugs and/or Wall Street on \"the new shiny\".\n\nRecently it has been AI meme stocks like SoundHound. It spikes then crashes like Bitcoin or Ether. \n\nIt's market manipulation in my book. Not sure if there is a law against buying shit loads of a stock and then selling it all when it spikes (leaving bag holders) but to make money from it you have to get out before they get out.\n\nI.e see it happening: buy some: get out after X profit (maybe 10% maybe 5%) then get out. It's good money buy very hard to do - because you don't know when it's planned/manipulation and when it's irrational and not being driven by a whale (meaning it doesn't sell off it holds an you're like - \"wtf?\").",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldu16zq/",
      "created": 1721337358,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldtw171",
      "score": 2,
      "body": "Could be that the news causes new retail investors to jump in, old shareholders that’ve been holding the stock see a nice profit and decide to cash out.  The price movement from up and then back down kind of quells any excitement the general public has for the stock over the time being.",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldtw171/",
      "created": 1721335655,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldu4jyg",
      "score": 2,
      "body": "OP gives great example of wisdom of the crowd",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldu4jyg/",
      "created": 1721338498,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldwmdoy",
      "score": 2,
      "body": "dependent lock shy ancient tart resolute outgoing pen thought zealous\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldwmdoy/",
      "created": 1721382490,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldtdk0z",
      "score": 1,
      "body": "There are more interesting parties going on. Your rave is no longer the fav.",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldtdk0z/",
      "created": 1721329654,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldti2fe",
      "score": 1,
      "body": "https://en.m.wikipedia.org/wiki/Regression_toward_the_mean",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldti2fe/",
      "created": 1721331142,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldtljdt",
      "score": 1,
      "body": "So regard will buy at top",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldtljdt/",
      "created": 1721332281,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldu2wnc",
      "score": 1,
      "body": "Big fund with long-term view buys which pushes price up, retail traders with short term view decide to sell.",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldu2wnc/",
      "created": 1721337940,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldu9zxi",
      "score": 1,
      "body": "Algos searching for liquidity areas to trap/trick longs and shorts before a reversal.\n\nImagine a stock that topped at 100 before dropping to 60. Then 4 months layer, it's 95. Then some good news comes out, you have a crazy volume and the price keeps going up, big volume comes in and it ramps from 99 to 102 in minutes.\n\nDumb money and bad traders immediately go: Breakout!!! And start buying. Or shorts start covering.\n\nSmart money and algos either wait and see what happens, or start selling here into strength. \n\nNow it's an hour later, and the price starts dropping to 102, 101, 100, then big volume comes in and it's 97  a minute later. Now what?\n\nThis is how algos and big money works. Funds dump the test of their positing, algos keep selling. All those new longs and breakout traders are selling (or averaging down like idipts). Price keeps going down until the same likely happens I'm reverse.",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldu9zxi/",
      "created": 1721341132,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lduo0ox",
      "score": 1,
      "body": "Options are a major factor imo",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/lduo0ox/",
      "created": 1721346556,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldw7hgt",
      "score": 1,
      "body": "What often happens is that the initial hype attracts a lot of buyers, but once the excitement fades and people start to realize it’s not a guaranteed win, they hesitate to buy more. So, the stock ends up cooling off and stabilizing at a lower level.",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldw7hgt/",
      "created": 1721372507,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldwx3k2",
      "score": 1,
      "body": "Use your brain and think about it. Some catalyst drive sentiment toward something and then which changes future expectations. People are the ones who actually trigger the buying and selling and not always or often solely on fundamental changes even though say fundamentally the only thing attributable to the run up and excess trading volume was the news event. \n\nWell eventually people want to get out and have their profit since people set a take profit at 20-30-50% whatever and then comes selling pressure. Depending on how fast the price ran up and gets over extended people will get more weary based on if there is actionable news that the company is on tracking to successfully meet those expectations etc. if they aren’t then sentiment changes and more pork doubt the expectation that was set at he change of the news ever and will come in to short which drives the velocity of buying down by a lot and then come in more and people who bought early in the move don’t want to miss out on gains so they set stop orders or lock in profits and people who bought in late may want to get out at break even if there’s already been a downward move etc. \n\nIt’s all just people. Stock trading is just a representative mixture  of corporate/macroeconomic fundamentals, human emotion, and human psychology. Plain and simple. The proportion of that mixture at any given time varies but the actual make up of what price action is never changes.",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldwx3k2/",
      "created": 1721388673,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldxa645",
      "score": 1,
      "body": "Because they are a pain in the ass",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldxa645/",
      "created": 1721394495,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldxe3ei",
      "score": 1,
      "body": "People make a profit, and they sell. The stock price falls back down.",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldxe3ei/",
      "created": 1721396024,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldxwjhy",
      "score": 1,
      "body": "True rich people buy an asset when its cheap and will only sell at super high prices. This applies to real estate and stock.\nAverage retail people cannot see the potential when its low and will buy an asset only when its priced very high and established in the media as a superior asset.",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldxwjhy/",
      "created": 1721402410,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leh64ne",
      "score": 1,
      "body": "Institutional buying.",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/leh64ne/",
      "created": 1721698106,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldt7lxz",
      "score": 1,
      "body": "arbitrage in the name of reversion to the mean",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldt7lxz/",
      "created": 1721327727,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldt9msr",
      "score": 0,
      "body": "They control the price 🙄",
      "permalink": "/r/stocks/comments/1e6ht3i/why_do_stocks_pump_on_massive_volume_and_then/ldt9msr/",
      "created": 1721328377,
      "depth": 0,
      "replies": []
    }
  ]
}