{
  "title": "Netflix earnings are out — here are the numbers",
  "score": 409,
  "selftext": "Netflix reported earnings after the bell. Here are the results.\n\nEarnings per share: $4.88 vs $4.74 per share expected by LSEG\n\nRevenue: $9.56 billion vs.9.53 billion expected by LSEG\n\nTotal memberships: 274.4 million paid memberships expected, according to StreetAccount\n\nAdvertising has become an increasingly important business model for media companies to boost — or in some cases, achieve — profitability for streaming. Netflix’s stock has been uplifted in recent quarters by its push to gain subscribers on its cheaper, ad-supported tier, in addition to its crackdown on password sharing.\n\nThe company has also begun adding live sports, such as NFL games on Christmas Day over the next three years, a move that will likely attract more ad dollars for the streamer.\n\nNetflix had roughly 270 million global subscribers at the end of the first quarter, up 16% from the same period in year prior and surpassing expectations.\n\nWhen Netflix made its pitch to advertisers during its Upfront presentation in May, the company said its ad-supported tier had amassed 40 million global monthly active users, nearly double the figure it had shared months earlier.\n\nLast quarter Netflix warned investors it would stop providing quarterly membership numbers or average revenue per user beginning next year, noting the company is “focused on revenue and operating margin as our primary financial metrics -- and engagement (i.e. time spent) as our best proxy for customer satisfaction.”\n\nThis decision showcases Netflix’s “pivot from a high-growth, low-profit business to a slow-growth, high-profit business,” according to an analyst note from Wedbush last week. However, the note emphasizes that although Netflix has a big lead ahead of its competitors when it comes to the streaming business, that pivot “is far from complete.”\n\nSource: https://www.cnbc.com/2024/07/18/netflix-nflx-earnings-q2-2024.html",
  "link_flair_text": null,
  "id": "1e6kptq",
  "num_comments": 185,
  "created_utc": 1721333121,
  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/",
  "comments": [
    {
      "id": "ldtvoa9",
      "score": 460,
      "body": "question is how much more can they raise their prices before people just stop subscribing",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldtvoa9/",
      "created": 1721335540,
      "depth": 0,
      "replies": [
        {
          "id": "ldtzslb",
          "score": 232,
          "body": "That's been the case for majority of companies out there for the last couple of years. \n\nThe likes of McDonalds, Starbucks, Nike etc. seem to have hit the ceiling and their customers are basically starting to say f off. \n\nI think this push to lower tier and raising prices are just their way to squeeze the last drops out of their customers before they start eventually leaving.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldtzslb/",
          "created": 1721336885,
          "depth": 1,
          "replies": [
            {
              "id": "lduqe67",
              "score": 87,
              "body": "McDonald’s and Starbucks are different. You can cook and make coffee \n\nHell once I found out how much I was spending on coffee at Starbucks, I bought an espresso machine and it’s paid for itself many times over. \n\nI can’t make TV shows or movies as easily. Cable is still expensive.",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduqe67/",
              "created": 1721347490,
              "depth": 2,
              "replies": [
                {
                  "id": "lduwetf",
                  "score": 25,
                  "body": "You don't have to watch TV through Netflix though. People who stopped going to McDonald's still eat out, just not at McDonald's",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduwetf/",
                  "created": 1721349883,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lduyzri",
                      "score": -5,
                      "body": "No one else serves delicious Netflix Originals. The other streaming sites are also raising prices. \n\nMy point was, Netflix isn’t as price sensitive as food chains.",
                      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduyzri/",
                      "created": 1721350919,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lduztos",
                          "score": 14,
                          "body": "I think if you take Netflix originals as something generally  unobtainable except from Netflix then I think it's only fair to also consider you can't get a big mac or Starbuck's roast other than their respective producers.",
                          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduztos/",
                          "created": 1721351256,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ldwto3v",
                              "score": 2,
                              "body": "Nintendo is a better comparison. You guys are basically bickering semantics because the food comparison is trash. A better parallel is Nintendo's exclusivity with their games.",
                              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldwto3v/",
                              "created": 1721386855,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ldv2uel",
                          "score": 1,
                          "body": "Apple is making goooood shit.",
                          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldv2uel/",
                          "created": 1721352466,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ldy8lvb",
                              "score": 1,
                              "body": "eh",
                              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldy8lvb/",
                              "created": 1721406371,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ldut8ih",
                  "score": 52,
                  "body": "I've been watching mostly Youtube lately tbf. I still have my Netflix subscription, but I honestly barely use it nowadays. \n\nSo far I'm keeping it because the price is not so bad for an occassional watch, but if it gets a bit more expensive I'll just cancel it and only renew when there is a good show to watch for a month.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldut8ih/",
                  "created": 1721348619,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldvg7rp",
                      "score": 19,
                      "body": "And that’s exactly where the sweet spot is for streaming services. Just cheap enough for you to not cancel but high enough to maximize profits",
                      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldvg7rp/",
                      "created": 1721357997,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldxqul7",
                          "score": 7,
                          "body": "The sweet spot is where they will lock you up in longer term contracts and bundles, like cell phone companies do. This is the next step after they all do the pivot.",
                          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldxqul7/",
                          "created": 1721400517,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ldyxtha",
                              "score": 3,
                              "body": "Yep. It won't happen until another price increase or two, but once people start cancelling because the price is \\*genuinely\\* too high then the bundles, 3-6-9 month contracts, \"pay an entire year and save\" tactics etc will start.",
                              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldyxtha/",
                              "created": 1721414647,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ldvdw6x",
                      "score": 11,
                      "body": "Honestly what you said basically describes me to. According to YouTube's analytics I watch an average of 3.96 hours of content every day. By contrast I rarely ever watch 4+ hours of Netflix a day, half the time I don't even watch anything on Netflix on a workday.\n\nThat said I'm still very much invested into Netflix, and not Google, because watch time and views aren't profit. Just because I prefer YouTube doesn't mean that others don't prefer Netflix.",
                      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldvdw6x/",
                      "created": 1721356998,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lduw6lq",
                      "score": 3,
                      "body": "And if more people feel like this, YT will get even more saturated with ads, which is saying something, or the good content will kept behind paywalls.",
                      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduw6lq/",
                      "created": 1721349791,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldvc5jn",
                          "score": 8,
                          "body": "I can block ads way easier on my computer than my tv",
                          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldvc5jn/",
                          "created": 1721356256,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ldxftud",
                              "score": 3,
                              "body": "It's also easy to download any type of digital media.",
                              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldxftud/",
                              "created": 1721396675,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ldy8gzk",
                                  "score": 2,
                                  "body": "haven’t watched a Netflix show on Netflix in quite a while lol",
                                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldy8gzk/",
                                  "created": 1721406326,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ldvtadx",
                  "score": 6,
                  "body": "The problem is that with TV shows and movies, piracy becomes a competitor if it's too expensive.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldvtadx/",
                  "created": 1721364228,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldwmph0",
                      "score": 4,
                      "body": "I thought this was going to be an issue when the Netflix password sharing crackdown was announced. Instead their share price went through the roof. A lot of people that post on Reddit are likely to load up Bittorent when they feel they're being ripped off. The average Netflix subscriber is far less likely to.",
                      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldwmph0/",
                      "created": 1721382686,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldwqtfu",
                          "score": 2,
                          "body": "Also true. It's very hard to predict how people behave.",
                          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldwqtfu/",
                          "created": 1721385212,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "ldyj59u",
                          "score": 2,
                          "body": "Not true\nUp until the password sharing crackdown I had had a Netflix subscriptions since the DVD days .\n\nBack then, they actually turned me away from piracy \n\nNot anymore, back to the high seas  for me",
                          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldyj59u/",
                          "created": 1721409843,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ldvowri",
                  "score": 13,
                  "body": "You can pirate, though. That’s always been the appeal of the easy subs. Many won’t pirate music when they can pay monthly for Apple Music. Many won’t pirate comics when they can pay for marvel unlimited. And many won’t pirate movies when they can pay for an inexpensive streaming sub. But that inexpensive streaming sub has slowly become 3+ expensive streaming subs.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldvowri/",
                  "created": 1721361980,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldy4lv4",
                      "score": 2,
                      "body": "Pirating isn’t that easy for most people\n\nI use Kodi and Fen. Yes it works fantastically, but you can’t be a complete idiot and set it up. Then on top of that once every few months you run into a troubleshooting issue that may take 15 minutes to fix.\n\nMost people are complete idiots and would never be able to successfully accomplish Kodi/Fen, much less be able to troubleshoot when something goes wrong.",
                      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldy4lv4/",
                      "created": 1721405040,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "le3hpix",
                          "score": 2,
                          "body": "A torrent is pretty easy to use. I haven’t sailed the high seas of ye olde piracy for a while but it takes literally 15 seconds to search for and download a torrent with high seeds",
                          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/le3hpix/",
                          "created": 1721490866,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ldwnyhx",
                  "score": 6,
                  "body": "I can pirate any show or movie I want in 4K in less than 10 minutes.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldwnyhx/",
                  "created": 1721383418,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldy8tex",
                      "score": -3,
                      "body": "The FCC doesn't read Reddit you hope?",
                      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldy8tex/",
                      "created": 1721406442,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ldx2nrb",
                  "score": 2,
                  "body": "You can also access anything on netflix or any other streaming service free of charge and with very little effort (Kodi, Stremio etc)",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldx2nrb/",
                  "created": 1721391311,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldx39km",
                      "score": 3,
                      "body": "The average family seeking blue-y wouldn't bother. \n\ngot to think like a Joe not a G",
                      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldx39km/",
                      "created": 1721391581,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldx3ki7",
                          "score": 2,
                          "body": "Fair point but even my girlfriend's father has a nice kodi system set up from a local. It's becoming more mainstream I think.",
                          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldx3ki7/",
                          "created": 1721391717,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ldxe5ol",
                              "score": 2,
                              "body": "They also forget which generation subscribe to these services. We grew up on the high seas. When I was a child everyone in my class knew how to use certain streaming sites, even the most tech averse person. Not that hard to imagine we will revert if pushed hard enough.",
                              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldxe5ol/",
                              "created": 1721396048,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "ldx4wgs",
                              "score": 1,
                              "body": "Sounds like her family tree might be worth marrying into :)",
                              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldx4wgs/",
                              "created": 1721392302,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ldy24jv",
                          "score": 1,
                          "body": "Very true. I am 45 and have been an on and off pirating music/TV/movies since around 2004 and I have many times had to explain how to download shit to my younger siblings over the years. A lot of folks are too busy or just not interested in that kind of stuff so they just take what’s given to them. A lot of folks just don’t know how to pirate or where to find free streams",
                          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldy24jv/",
                          "created": 1721404225,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ldx68e6",
                  "score": 1,
                  "body": "I wouldn’t recommend pirating movies, but it’s a much cheaper option. \n\nBflix is one of the nicest websites to use for movies and tv shows \n\nAd blocker on chrome would help block all the pop ads \n\nAnd screen sharing to a smart tv so you can watch it like an actual movie on the tv,would work just fine. \n\nDo what you please with that information",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldx68e6/",
                  "created": 1721392876,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ldxqla2",
                  "score": 1,
                  "body": "And Netflix is more aware than today's consumer, that you will soon be able to tell your TV what sort of show you want to watch, with whom, and it will generate the content for you. That is going to be kind of a big deal to every major production and service in entertainment.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldxqla2/",
                  "created": 1721400430,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ldxqm8z",
                  "score": 1,
                  "body": "And Netflix is more aware than today's consumer, that you will soon be able to tell your TV what sort of show you want to watch, with whom, and it will generate the content for you. That is going to be kind of a big deal to every major production and service in entertainment.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldxqm8z/",
                  "created": 1721400438,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ldy628x",
                  "score": 1,
                  "body": "Just about everyone knows how to sail the seas now tho.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldy628x/",
                  "created": 1721405530,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ldy843l",
                  "score": 1,
                  "body": "You can get rabbit ears and watch CBS, NBC, and FOX all day.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldy843l/",
                  "created": 1721406206,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ldyd1eu",
                  "score": 1,
                  "body": "Any digital media that exists can (almost always) be found online for free. Shared P2P.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldyd1eu/",
                  "created": 1721407839,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ldysp8z",
                  "score": 1,
                  "body": "Not advocating piracy but the option is right there and takes near zero effort. It’s silly pretending consumers don’t have alternatives.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldysp8z/",
                  "created": 1721412963,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "le6nouf",
                  "score": 1,
                  "body": "Tubi and Pluto tv",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/le6nouf/",
                  "created": 1721537412,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ldzdvyl",
                  "score": 0,
                  "body": "You can pirate",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldzdvyl/",
                  "created": 1721420066,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "le3f70k",
                  "score": 0,
                  "body": "There are a ton of illegal streaming websites out there you can find via Google. On top of that, there’s always torrents.\n\nIt’s not even shows and movies competing with other shows and movies though. It’s content competing with content and every single day there’s more and more content out there. \n\nthe average person only has so much time a day to watch TV and eventually they realize it costs too much to pay for something that isn’t being used.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/le3f70k/",
                  "created": 1721489953,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ldu9kd6",
              "score": 36,
              "body": "What indication from the 9 billion in revenue over the last 3 months indicates that they are saying this. It’s 2024. You people have been saying this for four years.\n\nHow dumb are you people?",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldu9kd6/",
              "created": 1721340907,
              "depth": 2,
              "replies": [
                {
                  "id": "ldufaef",
                  "score": 31,
                  "body": "The average reddit user is so incredibly dumb it's frustrating. They are the most outraged group of users who make absurd claims with no data. \n\n\nFor every mcdonalds Starbucks and nike there is dominos and chipotle who are thriving. Netflix has increased prices consistently and grown subscribers consistently at the same time. Reddit users say everyone is cancelling when their bill goes up $1 per month 😂",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldufaef/",
                  "created": 1721343257,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldup715",
                      "score": 3,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldup715/",
                      "created": 1721347008,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldusx6y",
                          "score": 2,
                          "body": "We're talking about $1 price increases every few months to a year at most. The reason people aren't leaving is because the service has been subsidized for so many years that it's been far cheaper than it should be based on its value to consumers. Even now you can have 3 streaming services which gives you basically all you can watch and you're still going to be paying less than half of what you would with cable. Unfortunately there's still a lot of room for price increases.",
                          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldusx6y/",
                          "created": 1721348493,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ldutnot",
                      "score": 1,
                      "body": "The only Mcdonald's pricing out customers I've seen is in memes.  Prices in and around my area have never once come close to what is blathered about.",
                      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldutnot/",
                      "created": 1721348787,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ldvk44u",
                  "score": 1,
                  "body": "Nononono you don’t get it. Netflix is going down THIS YEAR! Trust me bro",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldvk44u/",
                  "created": 1721359732,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lduqrps",
              "score": 4,
              "body": "I think the way out of this bind is going to be through partnerships. Like you'll start to see more and more companies selling their services through Costco. As long as their members get a better price, Costco is happy to sell Netflix or Nike wear or whatever. \n\nOr like Tesla or GM... buy a Tesla and get two years of Netflix free (when really they just bake the cost into the car). \n\nBut yes, the direct sale growth is probably going to slow very soon, if not shrink.",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduqrps/",
              "created": 1721347639,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ldx1iag",
              "score": 1,
              "body": "People aren’t believing the hype anymore, they see through the lies.",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldx1iag/",
              "created": 1721390791,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ldu58hc",
          "score": 46,
          "body": "every. single. time. \n\nsomeone raises this point and a bunch of people on reddit press the up arrow and grab their pitch fork and jump on the wagon... Netflix subscriber numbers go up. \n\nevery. single. time. \n\nNetflix invented the space.  It's good at it.  Competitors already have/will bow out.  \n\nIf you want to make a momentary life change and go outside or switch to a slightly cheaper but crappier streaming service great, there are 3 other people having done that and area ready to chill at home and access consistently good content for an entire month at the cost of a modern day inflated happy meal.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldu58hc/",
          "created": 1721338730,
          "depth": 1,
          "replies": [
            {
              "id": "lduff8z",
              "score": 11,
              "body": "Reddit users love outrage just as much if not more than twitter users",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduff8z/",
              "created": 1721343307,
              "depth": 2,
              "replies": [
                {
                  "id": "ldvnjya",
                  "score": 6,
                  "body": "The Reddit \"boycott\" was the best example of this. Everyone was saying how they will stop using it and move somewhere else. Then Reddit comes out and says the difference was a tiny blip and had no meaningful impact at all.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldvnjya/",
                  "created": 1721361327,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldwryyi",
                      "score": 5,
                      "body": "The only successful boycott of a major brand happening in recent times is of bud light.",
                      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldwryyi/",
                      "created": 1721385891,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldxrjgh",
                          "score": 2,
                          "body": "Tractor Supply Co.",
                          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldxrjgh/",
                          "created": 1721400749,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "ldy8ukn",
                          "score": 1,
                          "body": "it wasn’t though",
                          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldy8ukn/",
                          "created": 1721406453,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "ldxbug5",
                          "score": 1,
                          "body": "Was it though?",
                          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldxbug5/",
                          "created": 1721395159,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ldy8vvs",
                              "score": 0,
                              "body": "not by any metric",
                              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldy8vvs/",
                              "created": 1721406465,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ldy9m9a",
                                  "score": 3,
                                  "body": "Billions of dollars lost say otherwise.\n\n[https://www.investors.com/etfs-and-funds/sectors/bud-light-boycott-already-costs-anheuser-busch-15-7-billion/](https://www.investors.com/etfs-and-funds/sectors/bud-light-boycott-already-costs-anheuser-busch-15-7-billion/)",
                                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldy9m9a/",
                                  "created": 1721406710,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lduq6dz",
              "score": 4,
              "body": "The standard price is still like $15/month right? I find I’m kind of a Netflix defender in these threads, mostly because I believe in the stock and company still. They make bold moves all the time and they keep finding ways to up subscribers and keep on people who want a bargain. \n\nThe thing I always point out is that the avg Reddit user is a power content user, they are not who Netflix is targeting. Netflix wants the lowest common denominator viewer just like any other big studio. I think Netflix understands that a lot of content targeting all sorts of people keeps people subscribed, they don’t go hard on a particular niche and I think that has served them well in being the one streamer you can reliably find something to watch on.\n\nFor every bland production I can think of, Netflix also puts out some banger that works for some segment. And even the bland stuff seems to do really well for them (Red Notice, various Adam Sandler products). Lately I’m pretty impressed with the anime backlog. And at least once a year they have some show that goes from obscure to sensational, all because they have an audience that supports making content viral.\n\nAnd lastly I should point out there are way more Redditors who complain about the price than say they don’t use the service. Probably by a 10:1 ratio in any comment thread. They still use it but are just angry about the price hike.",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduq6dz/",
              "created": 1721347401,
              "depth": 2,
              "replies": [
                {
                  "id": "ldws698",
                  "score": 3,
                  "body": "It's fake rage. Redditor post and move on. No follow through. \n\n2 second rage that dissipates as soon as next thing inflames them.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldws698/",
                  "created": 1721386007,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ldxbsbr",
              "score": 2,
              "body": "The number of people subscribed to this subreddit who have such limited understanding of basic economic fundamentals is astonishing.",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldxbsbr/",
              "created": 1721395136,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ldu9wo2",
          "score": 22,
          "body": "Ask a boomer how much they pay for cable $$$",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldu9wo2/",
          "created": 1721341089,
          "depth": 1,
          "replies": [
            {
              "id": "ldvim27",
              "score": 2,
              "body": "Probably not much more than what I pay for the 50 subscriptions out there",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldvim27/",
              "created": 1721359055,
              "depth": 2,
              "replies": [
                {
                  "id": "ldvz4gx",
                  "score": 1,
                  "body": "Yea but most people don’t have 50 subscriptions.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldvz4gx/",
                  "created": 1721367465,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lduesc5",
          "score": 9,
          "body": "Contrary to what you will hear on reddit, people have shown they will continue to pay.\n\n\nAverage monthly price in US + Canada is up $2.30 per month compared to 2 years ago and total subscribers increased by 10M",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduesc5/",
          "created": 1721343070,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldvdj83",
          "score": 2,
          "body": "Obviously more than you think",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldvdj83/",
          "created": 1721356841,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldx47k1",
          "score": 2,
          "body": "It seems like most companies have eroded the consumer surplus. When that happens either new competitors come in a drive market prices down or something else increases the value proposition of the product. The market is saturated, but eventually people will either substitute or move down tiers. Netflix would try and nudge people toward ad based streaming but no ads were one of the major draw cards of Netflix streaming in the first time.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldx47k1/",
          "created": 1721391997,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldy4ywk",
          "score": 2,
          "body": "Already there and cut out Netflix and Apple TV, Hulu is up next on the chopping block. Probably just going to roll with Prime Video and Disney+",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldy4ywk/",
          "created": 1721405162,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldue7zl",
          "score": 6,
          "body": "I still haven’t buckled. Havent had Netflix since prices were raised",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldue7zl/",
          "created": 1721342856,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldubsdx",
          "score": 5,
          "body": "We just unsubbed after the last increase. First time not having Netflix in 9 years.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldubsdx/",
          "created": 1721341917,
          "depth": 1,
          "replies": [
            {
              "id": "ldun249",
              "score": 2,
              "body": "Damn that’s not a flex",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldun249/",
              "created": 1721346194,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ldujyfo",
          "score": 2,
          "body": "I just dropped Netflix after 6 years. I don’t even know why I had this one service on all this time, while I keep switching back and forth amongst others.\n\nNevertheless, glad to have done it.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldujyfo/",
          "created": 1721345021,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldubss8",
          "score": 2,
          "body": "As long as they release entire seasons at once, I’ll pay whatever tf they charge.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldubss8/",
          "created": 1721341921,
          "depth": 1,
          "replies": [
            {
              "id": "ldun9yx",
              "score": -1,
              "body": "Sailing the high seas is a much better alternative but ofc it’s all preferences. Tbf I know a lot of my family and friends that are subbed to multiple streaming services especially Netflix\n\nThe subscribers will always go up no matter what.",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldun9yx/",
              "created": 1721346277,
              "depth": 2,
              "replies": [
                {
                  "id": "lduqxur",
                  "score": 4,
                  "body": "I disagree that it’s a better alternative. On one side I get the product legally, ethically, and quickly, and without any setup. On the other side I’m in a grey area, needs some setup and trusted networks, and even then I risk problems to my equipment. All content being equal I’ll happily pay for the service.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduqxur/",
                  "created": 1721347707,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ldus1ql",
          "score": 1,
          "body": "Probably another $20",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldus1ql/",
          "created": 1721348146,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldv9q39",
          "score": 1,
          "body": "I’ve been on Netflix streaming since the beginning. However, T-Mobile has been footing the bill for quite some time",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldv9q39/",
          "created": 1721355251,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldw1atm",
          "score": 1,
          "body": "Netflix has different prices depending on regions. They have not been raising prices that much in Asia or LATAM. Additionally they not anymore too reliant on subscriptions since they want to scale the advertising business.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldw1atm/",
          "created": 1721368738,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldwzzxh",
          "score": 1,
          "body": "If they raise it by only $1 provided they don't lose millions of subs they will still be better off.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldwzzxh/",
          "created": 1721390087,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldxbhey",
          "score": 1,
          "body": "Congratulations! You have stumbled upon the fundamental economic concept known as *equilibrium*.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldxbhey/",
          "created": 1721395016,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldxtksg",
          "score": 1,
          "body": "For me in Canada  with the removal of the 10$ a month basic plan. And having to either tolerate adds (I won't) or accept a 65% price increase for the same service was the final nail in the coffin, I terminated my subscription and will likely never go back. This kind of price increase is just insulting to the point where I don't want to deal with the company again.\n\nI switched to Disney+ for now, not as much content but still a bit cheaper. If they also get too greedy I'll find other things to do with my free time.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldxtksg/",
          "created": 1721401428,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldy6udl",
          "score": 1,
          "body": "A lot more. Many streaming platforms will go out of business in the coming years. Consolidation is incoming and Netflix is the undisputed leader.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldy6udl/",
          "created": 1721405780,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldy808g",
          "score": 1,
          "body": "How much more can food cost before we stop eating.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldy808g/",
          "created": 1721406171,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldycser",
          "score": 1,
          "body": "They don’t just raise their prices to improve numbers, if you watch their investor calls, they usually say what they will spend the money on which is usually ultimately on increasing content spend. Netflix content output has grown a lot long this price hikes. Nowadays you can expect multiple new shows and movies every week from Netflix while their competitors that cost pretty close you can likely expect a few episodes.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldycser/",
          "created": 1721407757,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldywegv",
          "score": 1,
          "body": "I know more than a few who are subscribed because of their cell plan. I would love to know how many subscribers they derive from such deal and how much of a discount they are sold at.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldywegv/",
          "created": 1721414178,
          "depth": 1,
          "replies": []
        },
        {
          "id": "le4yd11",
          "score": 1,
          "body": "I first subscribed to Netflix in 2017 through the Apple App Store for $7.99.  Not sure if it was 4k yet but HD and the family plan, it was the highest plan.  Through the App Store it just automatically charges me more with price increases and I get no notification what so ever.  The other day I saw I was paying $22.99 just for Netflix I was shocked.  It’s not just Netflix though, HBO Max, Hulu, Apple TV, Peacock have all raised their prices",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/le4yd11/",
          "created": 1721510433,
          "depth": 1,
          "replies": []
        },
        {
          "id": "le8nvo4",
          "score": 1,
          "body": "I cancelled due to rising subscription cost and the end of sharing. I'm going to rotate and choose different streamers.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/le8nvo4/",
          "created": 1721576699,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldu786h",
          "score": 1,
          "body": "I canclled. Amazon gives me free prime whenever i buy from then",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldu786h/",
          "created": 1721339408,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldwvl9o",
          "score": 1,
          "body": "humor disgusted absurd shame chunky ghost smoggy brave long jar\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldwvl9o/",
          "created": 1721387893,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldyasgw",
          "score": 1,
          "body": "Think about how high cable bills used to be. There's a long way to go.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldyasgw/",
          "created": 1721407099,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldu0by6",
          "score": 0,
          "body": "i wait for all the shows i like to get new seasons. and just subscribe for a month or two.. aint no way i am paying month on month.. but i guess cracking down on password sharing has probably been boosting their bottom line past few quarters",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldu0by6/",
          "created": 1721337066,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldtv9hj",
      "score": 72,
      "body": "Solid but its still an expensive stock. They are not a huge growth play for now unless they find another source to boost growth(gaming? Live Sports?). Their pricing power has helped them with much improved margins. But that FCF number is not looking that good. \n\nAt least for a company that kickstarts a Quarter for tech companies, this is a solid start. Next 2 weeks are going to be interesting.",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldtv9hj/",
      "created": 1721335410,
      "depth": 0,
      "replies": [
        {
          "id": "ldtxeuv",
          "score": 17,
          "body": "What happened to their gaming? Years ago I remember moving towards this, and then nothing.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldtxeuv/",
          "created": 1721336097,
          "depth": 1,
          "replies": [
            {
              "id": "ldtyqke",
              "score": 24,
              "body": "Streaming games properly is very hard. If Google and Microsoft can't really crack it with all their servers and computing power, then companies like Netflix don't have a huge chance",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldtyqke/",
              "created": 1721336530,
              "depth": 2,
              "replies": [
                {
                  "id": "ldu0xnt",
                  "score": 11,
                  "body": "Microsoft has cracked it. They are slowly growing their Gamepass cloud gaming",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldu0xnt/",
                  "created": 1721337270,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldu17s5",
                      "score": 10,
                      "body": "Still doesn't run as good as Stadia, and google saw no future in it",
                      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldu17s5/",
                      "created": 1721337366,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lduwto5",
                          "score": 15,
                          "body": "Google and profiting off of new product lines go together like peanut butter and crushed glass.",
                          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduwto5/",
                          "created": 1721350047,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "ldwwgmb",
                          "score": 3,
                          "body": "Google might still offer stadia tech to companies. On the wikipedia page\n > The service continued to sell third party games, and Google offered the game-streaming technology as a white-label product. Google announced in September 2022 that it would be shutting down Stadia; the service went offline permanently on January 18, 2023.",
                          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldwwgmb/",
                          "created": 1721388345,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "ldyb5b3",
                          "score": 1,
                          "body": "Google perfected the tech but had no games.",
                          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldyb5b3/",
                          "created": 1721407218,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ldurk9g",
              "score": 6,
              "body": "They still have games, I still play a copy of Into The Breach on my phone via Netflix. it’s kind of an odd offering IMO, I’m not sure what they are targeting exactly. You download games via App Store and then confirm you’re a Netflix subscriber, that’s all. Maybe they are going after Apple Arcade subscribers?",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldurk9g/",
              "created": 1721347954,
              "depth": 2,
              "replies": [
                {
                  "id": "ldw1tpg",
                  "score": 3,
                  "body": "Former CEO Reed Hastings said they are competing for attention. People spend their free time differently and watching series is just one part of it.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldw1tpg/",
                  "created": 1721369052,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ldybegm",
                  "score": 2,
                  "body": "I mean they give you free games that normally cost additional money. It's just a bonus. Next is to eventually expand to PC games. People streaming movies, shows and playing games through Netflix aren't going to cancel Netflix most likely.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldybegm/",
                  "created": 1721407302,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ldyb2gg",
              "score": 2,
              "body": "It still exists, it didn't go anywhere. It's just mobile games.",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldyb2gg/",
              "created": 1721407191,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ldybve2",
              "score": 2,
              "body": "They offer a gamepass/Apple Arcade like perk for mobile.  You can play a bunch of games made by or licensed by Netflix. Notable ones right now is you can play sonic and PS2 era GTA games at no extra cost. On some TV platforms they starting to let you play games on ur tv. I don’t have access but saw it at a friends house with a beta or trail tag or whatever.",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldybve2/",
              "created": 1721407457,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ldyazwy",
          "score": 1,
          "body": "They are in both gaming and live sports. Just phone games for now but will expand to PC as well. Also have multiple NFL games this season.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldyazwy/",
          "created": 1721407167,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldtq4ee",
      "score": 141,
      "body": "From high growth low profit to low growth high profit? What does that remind us of? Definitely not a “growth” company anymore.",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldtq4ee/",
      "created": 1721333755,
      "depth": 0,
      "replies": [
        {
          "id": "ldtr0pt",
          "score": 138,
          "body": "They should just announce the dividend and call it a day",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldtr0pt/",
          "created": 1721334044,
          "depth": 1,
          "replies": [
            {
              "id": "ldudv5n",
              "score": 29,
              "body": "They are essentially spending all free cash flow on buybacks so currently returning 100% of free cash flow to shareholders",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldudv5n/",
              "created": 1721342719,
              "depth": 2,
              "replies": [
                {
                  "id": "ldw7r0p",
                  "score": 7,
                  "body": "Buying back shares at 45x earnings when the company is low growth is a quite reckless use of capital.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldw7r0p/",
                  "created": 1721372676,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldxgn2j",
                      "score": 2,
                      "body": "Keep using trailing 12 pe boomer... Forward pe is 30 so they are doing the same exact thing apple is doing...",
                      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldxgn2j/",
                      "created": 1721396973,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ldu1yqz",
              "score": 13,
              "body": "They probably will within a year",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldu1yqz/",
              "created": 1721337620,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ldu1w63",
          "score": 17,
          "body": "Grows subscribers 8 mil quarter over quarter = no growth?",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldu1w63/",
          "created": 1721337596,
          "depth": 1,
          "replies": [
            {
              "id": "ldue3aa",
              "score": 18,
              "body": "And 8 million accounts paying $10 a month is $1B in yearly revenue... then once you realize their current net profit is $10B the math becomes very very easy for that to double in the next 5 years",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldue3aa/",
              "created": 1721342805,
              "depth": 2,
              "replies": [
                {
                  "id": "ldw1hlk",
                  "score": 3,
                  "body": "That’s if you ignore that they have an ad business now. This flawed thought process is why they are going to stop reporting subscribers numbers.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldw1hlk/",
                  "created": 1721368849,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ldvz9um",
                  "score": 1,
                  "body": "Can they keep up the same rate of subscriber growth for the next 5 years?",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldvz9um/",
                  "created": 1721367552,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldxge9d",
                      "score": 0,
                      "body": "Don't need to keep up this pace",
                      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldxge9d/",
                      "created": 1721396883,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ldverz8",
              "score": 1,
              "body": "Not to mention just look at their financial numbers. Revenue is up over $1.2 billion YoY, Net Income is up around $650 million YoY. Their gross profit margins are in the mid-40's, and their operating margin is in the mid to upper 20's. All of those numbers are up nicely YoY, some by a pretty big amount.",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldverz8/",
              "created": 1721357374,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lduam6x",
              "score": -9,
              "body": "password sharing means new accounts. not like they are gaining subscribers in any other way these days",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduam6x/",
              "created": 1721341433,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldtq2hh",
      "score": 83,
      "body": "Yet her we are the stock is been down -3.58% in after market. ![gif](emote|free_emotes_pack|shrug)",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldtq2hh/",
      "created": 1721333739,
      "depth": 0,
      "replies": [
        {
          "id": "ldtr8uy",
          "score": 76,
          "body": "My favorite market reaction to good earnings. Let it slide for a few days then buy the dip",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldtr8uy/",
          "created": 1721334116,
          "depth": 1,
          "replies": [
            {
              "id": "ldtvk0u",
              "score": 17,
              "body": "Forward guidance was lowered. Market is forward looking.",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldtvk0u/",
              "created": 1721335502,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ldtrzbp",
              "score": 14,
              "body": "They forecasted down Q3 revenue expectations but other than a really solid earnings",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldtrzbp/",
              "created": 1721334352,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lduwlf2",
              "score": 2,
              "body": "TSM here I come!",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduwlf2/",
              "created": 1721349956,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ldu1rhb",
          "score": 12,
          "body": "Guidance is all that matters",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldu1rhb/",
          "created": 1721337552,
          "depth": 1,
          "replies": [
            {
              "id": "lduwpad",
              "score": 1,
              "body": "Unless they miss on expectations, then things tank.",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduwpad/",
              "created": 1721349999,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lefsnfw",
              "score": 1,
              "body": "Can you explain this please? Noob here",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lefsnfw/",
              "created": 1721680465,
              "depth": 2,
              "replies": [
                {
                  "id": "lefxyts",
                  "score": 1,
                  "body": "The market usually cares more about what profits and economic conditions lie ahead in a company’s future than it does about what is in its past. A component of each earnings release is forward guidance.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lefxyts/",
                  "created": 1721682139,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ldu7u1w",
          "score": 2,
          "body": "It’s up in aftermarket now",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldu7u1w/",
          "created": 1721339616,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldtus70",
          "score": 1,
          "body": "As expected haha",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldtus70/",
          "created": 1721335255,
          "depth": 1,
          "replies": [
            {
              "id": "ldundiv",
              "score": 1,
              "body": "Welp it’s flat now",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldundiv/",
              "created": 1721346314,
              "depth": 2,
              "replies": [
                {
                  "id": "lduqez8",
                  "score": 2,
                  "body": "Morning will establish some sort of direction",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduqez8/",
                  "created": 1721347499,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ldw1uh5",
          "score": 1,
          "body": "Soft guidance",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldw1uh5/",
          "created": 1721369064,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldtwpnv",
      "score": 21,
      "body": "Great quarter (again) and I will gladly buy the post earnings drop (again). \n\n\nThey are buying back 10M shares per year. At this pace share count will be roughly 20% lower in 10 years while revenue and operating margin will continue to grow",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldtwpnv/",
      "created": 1721335874,
      "depth": 0,
      "replies": [
        {
          "id": "ldvv4bv",
          "score": 2,
          "body": "You’re just pumping your bag. No mother could call their son ugly",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldvv4bv/",
          "created": 1721365211,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldvh7fv",
      "score": 4,
      "body": "I don't watch much in Netflix either. I do watch more youtube. But I'm getting tired of youtube with their constant ads. It's like regualr tv. \nI try to watch YouTube on my brave browser so that way I don't have to get those damn ads",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldvh7fv/",
      "created": 1721358432,
      "depth": 0,
      "replies": [
        {
          "id": "ldwisdn",
          "score": 3,
          "body": "Same here. Youtube has now become my main source of information through their very many news and specialised channels. However, the increasing ads move me more and more often to my PC, where I only watch through Brave. \n\nI am not sure GOOGL are doing this right. You anger your clientele, one day someone else will find it easy to take away a part of your cake.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldwisdn/",
          "created": 1721380060,
          "depth": 1,
          "replies": [
            {
              "id": "ldzjfeu",
              "score": 1,
              "body": "If I watch a longer youtube video, I get more ads and they are long ads. Over a minute sometimes. Just like traditional TV.  I'm not a huge fan of targeting videos. Meaning if u watch certain videos, u will keep getting similar videos.",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldzjfeu/",
              "created": 1721421950,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ldx50qu",
          "score": 3,
          "body": "Netflix is slowly creeping toward this. Soon all tiers will have ads, similar to how Amazon is trying to sneak that in with prime video.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldx50qu/",
          "created": 1721392355,
          "depth": 1,
          "replies": [
            {
              "id": "ldzioid",
              "score": 2,
              "body": "I wished more and more people cancel their subscription. Maybe send a message. The whole point of streaming was to get away from ads. \nI had a feeling yrs ago streaming would be traditional tv 2.0",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldzioid/",
              "created": 1721421694,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "le833cr",
          "score": 2,
          "body": "Youtube Revanced works for me, even while using a Chromecast there's no ads on my tv.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/le833cr/",
          "created": 1721568974,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldxd94j",
      "score": 5,
      "body": "I started sailing the seas again. Fuck these greedy companies. That sweet spot of time where only Netflix and Hulu existed and they were both affordable I was more than happy to pay. Now there's like 20 streaming services and it's the same as cable used to be. Fuck you guys",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldxd94j/",
      "created": 1721395700,
      "depth": 0,
      "replies": [
        {
          "id": "ldymsfx",
          "score": 3,
          "body": "Same here. They increased their prices 2 months ago. Add this to a mail, stating that we \"live in times where everything is a lot more expensive - anyway, we'll increase our prices too\" ... That's where I dropped out. I've found other ways to watch the stuff I like.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldymsfx/",
          "created": 1721411033,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldwileu",
      "score": 4,
      "body": "With a P/E of 40, one would say the stock needs a yearly increase in profit of around 20% (possibly more) a year for the foreseeable future to justify the valuation. \n\nIf they keep growing (which I am sure they'll do), but stay more on the 10% a year line, I think the stock is overpriced and will correct at some point. \n\nThis is not a reflection on the business model itself. I think they know what they're doing. It's more about how much to pay for the business.",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldwileu/",
      "created": 1721379924,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldvidrq",
      "score": 4,
      "body": "Their revenue is growing at a rate of around 10%, pe is 40 and trading close to 10x revenue. A giant drop is inevitable, it’s not a growth stock anymore.",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldvidrq/",
      "created": 1721358954,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldulsw9",
      "score": 7,
      "body": "So Netflix has ads now and live sports. Great so it’s just basically cable without the cord. Not worth it. Glad I cancelled it months ago.",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldulsw9/",
      "created": 1721345718,
      "depth": 0,
      "replies": [
        {
          "id": "ldw0oug",
          "score": 4,
          "body": "Okay and they got 8 million new subscribers.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldw0oug/",
          "created": 1721368372,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldw2gqp",
          "score": 3,
          "body": "Cable was 5-10x the price of Netflix with an annual contract. Several minutes ad blocks and no option to choose what to watch when and not even mentioning from missing location flexibility or regularly fresh content.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldw2gqp/",
          "created": 1721369435,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldu4dln",
      "score": 2,
      "body": "It's been pulling back lately and I think it's time for it to start going up",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldu4dln/",
      "created": 1721338437,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldu08uf",
      "score": 10,
      "body": "Surprised given how mediocre their content has become ",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldu08uf/",
      "created": 1721337037,
      "depth": 0,
      "replies": [
        {
          "id": "ldusetx",
          "score": 5,
          "body": "What's the alternative? Traditional Cable TV? Youtube? One of the many other streaming sites that are worse?\n\nOnly reason I don't own the stock is because I think the stock price is overvalued at this price, but can only imagine Netflix the business thriving for next decade at the very least.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldusetx/",
          "created": 1721348290,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldtptmz",
      "score": 4,
      "body": "Let’s gooo",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldtptmz/",
      "created": 1721333659,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldu3ghd",
      "score": 4,
      "body": "Thank god they’re not wasting money on generative AI",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldu3ghd/",
      "created": 1721338126,
      "depth": 0,
      "replies": [
        {
          "id": "ldv9pkz",
          "score": 3,
          "body": "Heresy!!  \n\nGEN AI will revolutionize everything, everywhere, always and forever.  Every single thing you see or touch will be made 100% by GEN AI, all jobs will be replaced by GEN AI, and all companies will be forced to buy nvda chips in perpetuity or be bankrupted.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldv9pkz/",
          "created": 1721355245,
          "depth": 1,
          "replies": [
            {
              "id": "ldw7s20",
              "score": 5,
              "body": "gen AI can watch the shows for me so I don't have to watch them.",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldw7s20/",
              "created": 1721372694,
              "depth": 2,
              "replies": [
                {
                  "id": "leh3xnn",
                  "score": 1,
                  "body": "Excellent idea!  Now you're really getting the \"new paradigm\".",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/leh3xnn/",
                  "created": 1721697264,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ldu7s5t",
          "score": 2,
          "body": "What do you mean? They're fully making use of it! Or how do you explain the generic movies and shows that we got blessed with /s",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldu7s5t/",
          "created": 1721339598,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lmqrb1x",
          "score": 1,
          "body": "They can't afford it. The big players can spend a fortune on it without a dent while competing with each other's bidding war. Netflix would need to sell their livers to even talk about it.\n\nNetflix will use AI services and tech provided by other companies.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lmqrb1x/",
          "created": 1726135702,
          "depth": 1,
          "replies": [
            {
              "id": "lmrdw2n",
              "score": 1,
              "body": "You ever even buy a graphics card? Once you have the most recent chip and the next series of chips drop it’s barely an improvement and you don’t have any reason to buy it. I’ve seen like 4 cycles of this chip mania and that’s all that’s happening. AI hype is a bubble bruv",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lmrdw2n/",
              "created": 1726146635,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldwgxcp",
      "score": 2,
      "body": "They be cookin the books",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldwgxcp/",
      "created": 1721378780,
      "depth": 0,
      "replies": [
        {
          "id": "ldybu2j",
          "score": 0,
          "body": "Based on?",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldybu2j/",
          "created": 1721407445,
          "depth": 1,
          "replies": [
            {
              "id": "leck8fo",
              "score": 0,
              "body": "They seem to be the only streaming company that never loses subscribers.\n\nIt literally only goes up",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/leck8fo/",
              "created": 1721633455,
              "depth": 2,
              "replies": [
                {
                  "id": "ledef3k",
                  "score": 2,
                  "body": "Yeah. That's not proof of cooking the books. Maybe it's because only one streamer has the brand recognition of Netflix.",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ledef3k/",
                  "created": 1721651662,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ldwv9wh",
      "score": 1,
      "body": "I was sharing my parents netflix. When they cracked down on passwords and I couldn't watch their stuff anymore I realized Max and Hulu already outpaced them for quality content. In all this time I've never considered subscribing.",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldwv9wh/",
      "created": 1721387727,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldx6xjl",
      "score": 1,
      "body": "I stopped paying for netflix in like 2014… still watched all thier exclusive content on the net.. i will never pay another cent to watch anything",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldx6xjl/",
      "created": 1721393173,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldy1hmk",
      "score": 1,
      "body": "A2aq1qa😛",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldy1hmk/",
      "created": 1721404020,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lefla32",
      "score": 1,
      "body": "Waa",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lefla32/",
      "created": 1721678155,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lduq7rm",
      "score": 1,
      "body": "Only going to be a few more of these from Netflix before the numbers reverse.",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduq7rm/",
      "created": 1721347417,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldu50as",
      "score": -1,
      "body": "Where will people leave? TV feels empty without Netflix. We really got trapped didn’t we.",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldu50as/",
      "created": 1721338653,
      "depth": 0,
      "replies": [
        {
          "id": "lduaol1",
          "score": 3,
          "body": "not us pirates. all of these services are too expensive now.",
          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduaol1/",
          "created": 1721341463,
          "depth": 1,
          "replies": [
            {
              "id": "lduazs6",
              "score": 7,
              "body": "0.1% do that. Rest trapped.",
              "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduazs6/",
              "created": 1721341596,
              "depth": 2,
              "replies": [
                {
                  "id": "ldyc3rk",
                  "score": 3,
                  "body": "I've tried to tell redditors this but they are kinda detached from reality lol. Hell even in my household I'm a pirate, have access to every movie and show and my wife still insists on having Netflix and Hulu \"because she's used to them\"",
                  "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldyc3rk/",
                  "created": 1721407533,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldysjx9",
                      "score": 2,
                      "body": "That’s the biggest thing. No one wants to spend time of their day setting up the pirate stuff. They made it so convenient that people don’t even think of pirating anymore. And ofc, there won’t be any piracy stuff free of ads or malware, unless you know what you are doing.",
                      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldysjx9/",
                      "created": 1721412914,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldyyu8r",
                          "score": 1,
                          "body": "I setup Stremio on our TV so all we have to do is use the TV remote for it. She still wants Netflix and Hulu.",
                          "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldyyu8r/",
                          "created": 1721414986,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lduynuh",
      "score": -3,
      "body": "Here’s my comment from another thread:\n\nNetflix deceived investors and played everyone.\n\nSee, Netflix announced the password crackdown. And Netflix saw good growth and investors were pleased. Everyone thought the plan worked.\n\nWhat really happened was Netflix announced the crackdown, but very slowly rolled out the actual crackdown. Way way slower than they led people to believe. Investors had no clue how deceptive Netflix was being.\n\nNetflix rolled out changes extremely biased way. They focused on users they knew would resubscribe when they lost access and get their own accounts. They left others alone that they knew would unsubscribe. Amongst other tricks.\n\nSlowly Netflix has been adding the password restriction and only recently have they finally they’ve reached the group of people that would unsubscribe completely with these changes.\n\nNetflix played (borderline lied) to investors and everyone by mismatching their announcement with actually doing it. And it’s going catch up to them in their numbers, But not hurt as badly as if they did it all at once. Because that initial idea that the passwords led to more growth is why the stock went up so much the last 2 years.",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduynuh/",
      "created": 1721350786,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldu34er",
      "score": 0,
      "body": "Thank god I didn’t play earning otherwise I would’ve been cooked 😅",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/ldu34er/",
      "created": 1721338012,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lduh4as",
      "score": -1,
      "body": "password crackdown is a gold mine ",
      "permalink": "/r/stocks/comments/1e6kptq/netflix_earnings_are_out_here_are_the_numbers/lduh4as/",
      "created": 1721343946,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "Netflix's earnings report reveals a focus on profitability with increased memberships and advertising strategies as key growth drivers.",
    "companies": [
      "Netflix",
      "NFL"
    ],
    "tickers": [
      "NFLX"
    ],
    "main_ticker": [
      "NFLX"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Netflix reported better than expected earnings and revenue, along with growth in subscribers, and is focusing on transitioning to a more profitable business model with an emphasis on advertising and live sports content.",
    "stock_recommendations": "The post does not explicitly recommend buying or selling Netflix stock.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": null,
    "sentiment_summary": "There is neutral sentiment as the post provides an analysis of Netflix's earnings and business strategy without suggesting any stock action.",
    "sentiment": "neutral"
  }
}