{
  "title": "Boeing's largest union says it will strike if contract negotiations fail. Union is asking for a +40% raise and restoration of the pension",
  "score": 504,
  "selftext": ">“We don’t want to strike — but we’re ready and willing to do so to bring home the best aerospace contract our members have ever seen,” Jon Holden, president of IAM District 751, said in a statement after the vote. “There is no Boeing without us, and we have what it takes to build this company back to the level it was.”\n\n>Now its labor issues loom large. The union’s proposal includes a pay increase of more than 40 percent and restoration of the traditional pension program that was eliminated in 2014. Although pay and benefits are important, after several years in which Boeing has threatened to move aircraft production elsewhere, Holden, IAM District 751’s president, said one of the union’s top priorities is ensuring that the company’s next new airplane is built in Washington state.\n\nhttps://www.washingtonpost.com/transportation/2024/07/17/boeing-machinists-union-strike-vote/",
  "link_flair_text": "Company News",
  "id": "1e6nc6j",
  "num_comments": 141,
  "created_utc": 1721339715,
  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/",
  "comments": [
    {
      "id": "ldurp3l",
      "score": 336,
      "body": "They should also ask for company funded life insurance policies.",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldurp3l/",
      "created": 1721348007,
      "depth": 0,
      "replies": [
        {
          "id": "ldy065q",
          "score": 25,
          "body": "For the passengers.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldy065q/",
          "created": 1721403591,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldy2veq",
          "score": 7,
          "body": "They need snitch immunity. This company clearly needs snitches.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldy2veq/",
          "created": 1721404468,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldvbqeq",
          "score": 30,
          "body": "This is an under appreciated joke!",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvbqeq/",
          "created": 1721356081,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lduo7x0",
      "score": 179,
      "body": "Pension days have passed and will never come back to be brutally honest unless gov forces all companies to institute it",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/lduo7x0/",
      "created": 1721346634,
      "depth": 0,
      "replies": [
        {
          "id": "ldutz2p",
          "score": 85,
          "body": "And honestly, in this day and age when people keep switching jobs every few years, pensions are irrelevant. \n\nYou make way more in your career over span of decades if you switch multiple times and get pay bump than spending all your life in one place for a pension.\n\nPensions are mainly for industries where there are limited opportunities outside a few companies or if your company is in a small town and that’s the only major employer in your town. Like coal towns of the 80s.\n\nMy wife’s company has mandatory contribution to pension and people hate it. Everyone’s trying to get away from those contributions. Because everyone her age knows they are going to quit in a few years and aren’t planning to spend the next 20 years in this company.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldutz2p/",
          "created": 1721348912,
          "depth": 1,
          "replies": [
            {
              "id": "ldv042q",
              "score": 140,
              "body": ">And honestly, in this day and age when people keep switching jobs every few years, pensions are irrelevant. \n\n\nMaybe job hopping is a thing because there are no more pensions as incentive for you to stay in a job for longer.",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv042q/",
              "created": 1721351373,
              "depth": 2,
              "replies": [
                {
                  "id": "ldvdnaz",
                  "score": 59,
                  "body": "The 401k killed pension plans, and the death of pensions led to job hopping.",
                  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvdnaz/",
                  "created": 1721356891,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldvvwe0",
                      "score": 26,
                      "body": "Also the faux 2% inflation.  If you're getting 2% a year raise you're getting robbed.",
                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvvwe0/",
                      "created": 1721365643,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldwyfsi",
                          "score": 5,
                          "body": "Your right on that one. I via collective agreement have gotten a total of 12% over the last two years with another 3.5 and 3.5 in the next two years then the CA comes due, and I am not any better off with current inflation and paying more tax on the higher yearly total.",
                          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldwyfsi/",
                          "created": 1721389340,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ldw8phb",
                      "score": 9,
                      "body": "This is a good thing IMO, people shouldn't feel tied to a job they don't like just because they don't want to lose their pension. Imagine you have a toxic workplace, but you can't quit because your pension doesn't vest for a few more years and you'd be starting over. It was an awful system.\n\n401ks are a really good system if employees actually contribute to them to get the match. The problem is way too many people choose not to until they're in their 50s.",
                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldw8phb/",
                      "created": 1721373279,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldxmadl",
                          "score": 4,
                          "body": "And if companies actually offer a match. My first company did not. My next company did not for its first 7 years or so, finally offers a $3k match now.\n\n401(k)’s would feel like a more fair replacement for pensions if matches were required.",
                          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldxmadl/",
                          "created": 1721398972,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "le4ob76",
                      "score": 1,
                      "body": "In the Netherlands we do have pensions, job hopping just means you built up pension gets moved to your new organization or its simply saved by multiple organisations that activate when retiring",
                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/le4ob76/",
                      "created": 1721506646,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "le4oew1",
                          "score": 1,
                          "body": "Oh how nice that would be.",
                          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/le4oew1/",
                          "created": 1721506684,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lduy0lg",
              "score": 26,
              "body": "The people who are asking for pensions are not that bright. What they need to do is focus on their IRA contributions in ask the employers for a higher 401K match. That way they can take their retirement accounts with them wherever they go to whichever jobs and accumulate a retirement nest egg that way. Plus if they die they can leave it to their beneficiary. People are lazy AF and want spoonfed at Old age.",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/lduy0lg/",
              "created": 1721350528,
              "depth": 2,
              "replies": [
                {
                  "id": "ldwpnvo",
                  "score": 7,
                  "body": "They need to push for more fair 401k contribution systems at their employers.  Microsoft as an example matches 50 cents to every dollar an employee contributes capping out at $11,500. They did this as they found under previous methods where they matched up to a percentage of the contribution lower paid employees were not benefiting as much as higher paid employees.  This meant they were not saving enough early enough.  \n  \n[WSJ article](https://www.wsj.com/personal-finance/retirement/is-your-companys-401-k-match-unfair-cb58b71b)  - sorry it is likely pay walled for most.",
                  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldwpnvo/",
                  "created": 1721384504,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "le53m7s",
                      "score": 1,
                      "body": "Yeah, the largest contribution I've ever had was capped at 3 percent. Which, if it's intended to replace a pension, is simply laughable.",
                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/le53m7s/",
                      "created": 1721512495,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ldv1nxr",
                  "score": 38,
                  "body": "Pensions are great and you don’t lose them when the market crashes. We are talking about Boeing employees where exactly does a Boeing worker job hop to? These are lifetime jobs that should be paid well and appreciated more. If Boeing wants to be better they need to start with labor. These jobs are also harder than working at Amazon or Google.",
                  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv1nxr/",
                  "created": 1721351997,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldvh57v",
                      "score": 13,
                      "body": "Thats not true. You 100% can lose your pension. Pensions are often managed funds and if the fund goes under or the company you work for goes under then the pension benefits can reduce and potentially be fully wiped out. \n\n“If you have a defined benefit pension with your company, it may be insured by the Pension Benefit Guaranty Corporation, which covers certain pension plans.\nAlong with pension payments, the PBGC provides basic guaranteed benefits including survivor’s annuity benefits, disability benefits and some early retirement benefits.\nIf the PBGC takes over your pension, your plan records will be reviewed, and benefits will be determined.”\n\nYou can learn more here:\nhttps://money.usnews.com/money/retirement/articles/what-happens-to-my-pension-if-my-company-goes-bankrupt",
                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvh57v/",
                      "created": 1721358404,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldvwzlh",
                          "score": 5,
                          "body": "Honestly, I'm surprised pensions are even allowed to be invested in company stock at any weight beyond an indexed fund.",
                          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvwzlh/",
                          "created": 1721366247,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ldwudze",
                              "score": 6,
                              "body": "its less about the pension fund investing in the company and more about where in the creditor tree employees sit. If a company goes bankrupt and doesn’t have enough money to pay all the people it owes money to then certain debtors get paid out first (there are legally defined tiers and this is partially where bankruptcy courts come in to play, they help decide who gets paid first and how much they get).",
                              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldwudze/",
                              "created": 1721387254,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ldv4zsh",
                      "score": 10,
                      "body": "Market crashes are Temporary. Over the long run gains will come back. Even during the great depression, if you kept your money in the market, it came back in three years.\n\nMost pensions are invested in the market too, so they can go insolvent too.\n\nSS would probably be ok today if they put that money in the market instead of US bonds.",
                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv4zsh/",
                      "created": 1721353340,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldv8g4b",
                          "score": 8,
                          "body": "You're forgetting that retirees are in a position where they're forced to sell in order to fund their retirement, regardless of if the market is up or down. Sequence of returns is a big risk in retirement (i.e. even if the market averages 10% gains a year in your 20+ years of retirement, if the early years have very bad returns then that will compound overtime and greatly increase the chances of you running out of money).",
                          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv8g4b/",
                          "created": 1721354732,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "ldv6jwc",
                          "score": 2,
                          "body": "There is no guarantee that's true. I'm a state employee and once my pension starts I get it until I die then it transfers to my wife until she dies. I also contribute to deferred compensation  as a secondary so I'll have two retirement sources.",
                          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv6jwc/",
                          "created": 1721353968,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ldvduuo",
                              "score": 6,
                              "body": "Assuming your pension fund manager doesn't fuck up and sink the pension in a market crash.  Which has happened plenty of times in the last 30 years.  Hell even CalPERS which is one of the largest public sector plans is or was leveraging debt within the past couple years.",
                              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvduuo/",
                              "created": 1721356982,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ldxuw7y",
                      "score": 2,
                      "body": "Boeing workers hope in and out of other trades all\nthe time.  In the trades here in Seattle it’s common to see a resume that’s like:\n\nBoeing - 10 years \n\nCarpenter - 10 years \n\nTruck Driver - 2 Years \n\nBoeing - 3 years",
                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldxuw7y/",
                      "created": 1721401867,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "leec1cd",
                          "score": 1,
                          "body": "There is nothing about working at Boeing that translates to carpentry work. The worker didn’t “Hop” jobs. They were laid off and found other work. Big difference.",
                          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/leec1cd/",
                          "created": 1721663775,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "leectgl",
                              "score": 1,
                              "body": "I hire guys into the trades from Boeing all the time that weren’t laid off but rather left on their own volition.   Conversely we lose a similar number who go back to Boeing every year.  It’s an ongoing cycle.",
                              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/leectgl/",
                              "created": 1721664023,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lehtn9y",
                                  "score": 1,
                                  "body": "Sure pal..",
                                  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/lehtn9y/",
                                  "created": 1721708019,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lejru4t",
                                      "score": 1,
                                      "body": "lol why do you think I would lie about hiring people from Boeing?  That makes no sense what would I gain from that.  I’m not out here saying I’m sleeping with Sydney Sweeney",
                                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/lejru4t/",
                                      "created": 1721745036,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ldvc6bu",
                      "score": 6,
                      "body": "> Pensions are great\n\n? Based on what? Lol you just said this like it’s a flavor of ice cream. What makes a pension great? From what I can tell, absolutely nothing is better about a pension compared to taking my paycheck and putting it in bonds. Same risk, better return, I have full control over it. But maybe I’m missing something?",
                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvc6bu/",
                      "created": 1721356265,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldvgt7l",
                          "score": 8,
                          "body": "[deleted]",
                          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvgt7l/",
                          "created": 1721358258,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ldvj1po",
                              "score": 4,
                              "body": "> Depends on your pension. My pension works out to 2% a year per year of work. Work 30 years, receive 60% of your best 5 years indexed to inflation and 66% of which is transferable to your partner if you die before them. Work from 25-55, receive an indexed wage for the next 30 years until you’re 85 or longer if you make it. That way outpaces a 401k with only a 10k a year investment on my part.\n\nOkay, but how much more money would you make if your company wasn't having to pay for pensions? I mean, the money can't be free. It has to come from somewhere. If the company is getting return from stocks, you could do the same. If the company is getting return from bonds, you could do the same. The only other way to pay out your pension would be a Ponzi scheme lol.\n\nCompanies that offer pensions, all else being equal, aren't gonna pay as much. I'm really doubtful that they are getting the type of returns with that money that you could get from an index fund. In fact I'm certain they're not.",
                              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvj1po/",
                              "created": 1721359251,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ldvk3ek",
                                  "score": 4,
                                  "body": "[deleted]",
                                  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvk3ek/",
                                  "created": 1721359722,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ldvovup",
                                      "score": 1,
                                      "body": "I don't know how that would make any financial sense. A voluntary benefit comes out of the budget. I've been in those meetings with the bean counters. I've never ever gotten the impression that absoltluely anyone gets a freebie under any circumstances. If more bonuses are being given out that year, it's either because the company had a great year, or because cuts are being made elsewhere.\n\nIf the company started offering a pension they'd reduce merit increases, or reduce PTO, or *something*. It wouldn't just be free money.",
                                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvovup/",
                                      "created": 1721361967,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "ldvqb26",
                                          "score": 5,
                                          "body": "[deleted]",
                                          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvqb26/",
                                          "created": 1721362678,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ldvqkej",
                          "score": 5,
                          "body": "Idk my dad is pretty happy making his 5k a month for life off his pension",
                          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvqkej/",
                          "created": 1721362810,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ldvu2zy",
                              "score": -1,
                              "body": "Okay? And lots of people make more than that on their stock accounts. Not sure what your argument is",
                              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvu2zy/",
                              "created": 1721364651,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ldyfzuf",
                                  "score": 5,
                                  "body": "My dad was military so he probably didn't have the knowledge in his younger years that he does now, he just knew he'd be taken care of, as far as pensions go! Trick is to make it 30 years",
                                  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldyfzuf/",
                                  "created": 1721408808,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ldyuhd0",
                                      "score": 1,
                                      "body": "If the argument is that pensions take the individual's personal responsibility out of the equation then that I can agree with. I'd personally still rather trade that for higher pay that I can choose what I want to do with",
                                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldyuhd0/",
                                      "created": 1721413546,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "le4vc55",
                          "score": 1,
                          "body": ">Same risk, better return, I have full control over it. But maybe I’m missing something?\n\nYou are absolutely missing something: time. Defined benefit pensions are far more efficient than 401ks because of how contributions and payouts are distributed. \n\nWith a defined benefit pension plan, everyone is pooling their savings together. The contributions made by current workers help fund the retirements of previous workers, and the contributions from previous workers ensure that the fund isn't starting from zero. As a result, defined benefit pensions are able to provide payouts twice as high as 401ks, with the exact same contributions. \n\nThe money that you put into your 401k at the end of your career has virtually no time to compound. Conversely, the money you put in at the beginning has decades to compound, but you are starting from zero. 401ks are a scam: workers get smaller pensions, or they are forced to contribute more money, but the company gets to offload the risk onto you.",
                          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/le4vc55/",
                          "created": 1721509273,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "le5i1ux",
                              "score": 1,
                              "body": "This doesn't make mathematical sense. Current workers can only pay for retired workers at a constant rate, otherwise it would require continued growth forever (and would be a Ponzi scheme). \n\n> As a result, defined benefit pensions are able to provide payouts twice as high as 401ks, with the exact same contributions.\n\nI don't believe this for a second.",
                              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/le5i1ux/",
                              "created": 1721518388,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "le9nzfu",
                                  "score": 1,
                                  "body": "It's a plain and simple fact. Here's a source you can check yourself: \n\nhttps://www.nirsonline.org/reports/still-a-better-bang-for-the-buck-an-update-on-the-economic-efficiencies-of-defined-benefit-pensions/",
                                  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/le9nzfu/",
                                  "created": 1721589013,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "le9petk",
                                      "score": 1,
                                      "body": "I’ll read this later. It’s very interesting to me. Thanks \n\nI must be missing something fundamental about the math",
                                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/le9petk/",
                                      "created": 1721589485,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ldw6xwc",
              "score": 2,
              "body": "Here in the UK you just transfer your pension when you move jobs. So whatever provider my old job used will transfer it to whatever the new provider is at my new job. So it's still one pout and continues to accumulate. Is that not a thing?",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldw6xwc/",
              "created": 1721372171,
              "depth": 2,
              "replies": [
                {
                  "id": "ldw8hca",
                  "score": 5,
                  "body": "UK pensions are more like 401ks in the US. When they talk about pensions, they mean defined benefit pensions.",
                  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldw8hca/",
                  "created": 1721373137,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldxhgvg",
                      "score": 1,
                      "body": "Yeah I was confused reading this thread (and why people were anti-\"pension\") until I realized that. What we call pension is equivalent to a 401k thing.",
                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldxhgvg/",
                      "created": 1721397274,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ldzzg96",
                      "score": 1,
                      "body": "Cool, thanks for explaining. Couldn't for the life of me work out why people would be anti pension!",
                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldzzg96/",
                      "created": 1721427705,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ldxjvzy",
              "score": 2,
              "body": "> You make way more in your career over span of decades if you switch multiple times and get pay bump than spending all your life in one place for a pension.\n\nThat's a symptom of a broken system.\n\n>Pensions are mainly for industries where there are limited opportunities outside a few companies or if your company is in a small town and that’s the only major employer in your town.\n\nSo, pensions are what companies that have an actual relationship and obligation to their employees have? Not like most corps nowadays where you are just another line on the balance sheet and not a person with dignity?",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldxjvzy/",
              "created": 1721398137,
              "depth": 2,
              "replies": [
                {
                  "id": "lho0tby",
                  "score": 1,
                  "body": "> That's a symptom of a broken system.\n\n\nIs getting paid less for your entire career not a symptom of a broken system? Like it works different in other places, but they also make way lower for comparable jobs.",
                  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/lho0tby/",
                  "created": 1723419726,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "le40s3v",
              "score": 1,
              "body": "If what you say in your first paragraph is true then there should be no reason why NOT to bring back pensions since they are so irrelevant.",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/le40s3v/",
              "created": 1721497843,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ldvcj50",
              "score": -1,
              "body": "That’s honestly not a sustainable way to live though. Constantly dealing with the stress of hopping from job to job every 1-3 years is unhealthy for a society to function.\n\nAs shareholders, we’ve got to put corporations on their heels and make them stop the fucking orphan crushing machine.",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvcj50/",
              "created": 1721356415,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lduzs0h",
              "score": -7,
              "body": "Plus pensions can’t be given to beneficiaries like a 401k can",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/lduzs0h/",
              "created": 1721351237,
              "depth": 2,
              "replies": [
                {
                  "id": "ldv6kzg",
                  "score": 11,
                  "body": "Wrong, can be given to a spouse.",
                  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv6kzg/",
                  "created": 1721353980,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldv8rks",
                      "score": 6,
                      "body": "This. My grandmother has been living off her late husband's pension for over 2 decades, so yes it definitely has survivor benefits.\n\nAlso pensions don't mean that you don't have other investments you're living off of in retirement.",
                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv8rks/",
                      "created": 1721354860,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ldv85rm",
                      "score": -5,
                      "body": "Yeah and then the spouse dies and thats it. What if I want to give my money to an organization such as a charity, or a child? Cant do that with a pension.",
                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv85rm/",
                      "created": 1721354614,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ldv6lt6",
                  "score": 6,
                  "body": "They totally can. Any legitimate pension plan will include a survivor benefit.",
                  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv6lt6/",
                  "created": 1721353989,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldv86o2",
                      "score": -4,
                      "body": "For the spouse. But it doesn't go beyond that.",
                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv86o2/",
                      "created": 1721354624,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ldvab4o",
                          "score": 2,
                          "body": "It’s not as cut and dry as you may think. Many pension plans let you designate whoever you want to be your survivor. It doesn’t have to be your spouse — it can be your kids or even your parents. Some plans even let you name a contingent annuitant *in addition to* the survivor, so that two people can draw on your pension benefits. For example:\n\nhttps://chr.ucla.edu/benefits/university-of-california-retirement-plan-ucrp",
                          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvab4o/",
                          "created": 1721355493,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ldvvbic",
              "score": -2,
              "body": "It sounds like the company structured their pension plan as, \"We're going to steal part of your paycheck, and unless you spend the rest of your life with us you're not getting it back.\"\n\nWhen they could have structured it as, \"As a bonus on top of your regular paycheck, we're paying into a pension for you, and if you stick with us you'll get bonuses when you leave equal to $x.\"",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvvbic/",
              "created": 1721365320,
              "depth": 2,
              "replies": [
                {
                  "id": "lho11u1",
                  "score": 2,
                  "body": "Aren't those functionally the same just with a wording difference?",
                  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/lho11u1/",
                  "created": 1723419816,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ldv4cnj",
          "score": 14,
          "body": "I wouldn't even want a pension. I've seen too many companies go under and take their pensions with them.\n\nGive me a well matched 401k and Roth 401k any day.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv4cnj/",
          "created": 1721353078,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldvnpxc",
          "score": 4,
          "body": "The 401k seems like a good compromise. I don't want to get stuck to 1 company for 10+ years.  That would suck.  This way I can bail and go to another company.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvnpxc/",
          "created": 1721361407,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldutb6v",
          "score": 1,
          "body": "Lots of companies have pensions. The problem is that some rich people see cash sitting idle and want to grab it... and there's no recourse for the victims who paid their dues their entire career.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldutb6v/",
          "created": 1721348648,
          "depth": 1,
          "replies": [
            {
              "id": "lduybcy",
              "score": 8,
              "body": "Do you have any evidence of this happening in the last 40 years? This is extremely illegal and pretty easy t catch if not outright impossible.\n\nI'm not saying it never happened in the history of the country, but I can't think of any modern instances of a company embezzling money from their own pension plan (is that even possible these days with all of them being administered by a third party typically?)",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/lduybcy/",
              "created": 1721350647,
              "depth": 2,
              "replies": [
                {
                  "id": "ldv3gel",
                  "score": 5,
                  "body": "Yes. Google Ross Island and Pamplin Media.",
                  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv3gel/",
                  "created": 1721352712,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ldus11l",
          "score": 1,
          "body": "Exactly",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldus11l/",
          "created": 1721348139,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldwavlr",
          "score": 0,
          "body": "Entirely untrue but thinking like this surely helps them keep it going mate",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldwavlr/",
          "created": 1721374703,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldusmft",
      "score": 7,
      "body": "The only thing happier than the unions is Comac.",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldusmft/",
      "created": 1721348374,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lduetib",
      "score": 41,
      "body": "How much was Boeing buyback this year?",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/lduetib/",
      "created": 1721343082,
      "depth": 0,
      "replies": [
        {
          "id": "ldw8z2o",
          "score": 26,
          "body": "$64.87 million, or about $376 per employee. So no way does eliminating buybacks pay for what the union is asking for. And there's a good chance they'll have to cut the buybacks anyways because of the recent troubles Boeing has been encountering.\n\nHowever, that's not the full story. Shares outstanding has been rising, meaning they are issuing more shares for employee compensation than they are buying back. So the buybacks are mostly just them offsetting their share compensation plan so that they aren't as dilutive.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldw8z2o/",
          "created": 1721373449,
          "depth": 1,
          "replies": [
            {
              "id": "ldwnr5v",
              "score": 5,
              "body": "Nice… eliminate the buybacks… and don’t offer stock options since it appears that Boeing isn’t performing well…",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldwnr5v/",
              "created": 1721383287,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ldx24l2",
          "score": -1,
          "body": "jellyfish unique unused rob chubby quarrelsome whistle meeting worry humor\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldx24l2/",
          "created": 1721391073,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldutrxj",
      "score": 62,
      "body": "Whenever you see anybody covering contract negotiations and headlining it as \"union requests 40% raise\" without pointing out that it is 40% _over three years_ (i.e. 12% annual raises), you know you are reading corporate propaganda. Anyone who discusses raises knows that they are always talked about on an annual basis.",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldutrxj/",
      "created": 1721348833,
      "depth": 0,
      "replies": [
        {
          "id": "ldxhxj2",
          "score": 10,
          "body": "But also, even if it *was* a 40% year-on-year incrase, my first assumption would be that the wages were so stagnant for so long that this is necessary just to catch up to where they should be.\n\nIt's like the minimum wage argument, some people want *significant* increase that sounds \"greedy\" at a glance, until you look at how long it has been stagnant for. It *needs* to go up by a huge amount just to stay on par with its purchasing power many years back.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldxhxj2/",
          "created": 1721397441,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldx8s1q",
          "score": 13,
          "body": "A decade of no raises, but now theyre asking for 40% raises!!1!1!1!! Thats outrageous, they should be happy to stay at the 2014 pay levels!! Cant you think of the poor, criminally convicted company??????",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldx8s1q/",
          "created": 1721393929,
          "depth": 1,
          "replies": [
            {
              "id": "lov16mu",
              "score": 1,
              "body": "Why was the contract not negotiated for 10 years? Was it a very long-term contract or did something else happen that delayed negotiations?\n\n  \nETA: nevermind, found it. Is this right:\n\n  \nIn fact, this is the first full-scale contract negotiation between IAM and Boeing in 16 years. Roughly half the current Boeing workforce has never been through union bargaining. The current contract was hammered out in 2008 after a 58-day strike. It was meant to be a four-year agreement, but since then, two multi-year contract extensions were bargained secretly between top IAM leaders and the company, without the usual union member surveys and participation. Both extensions came as Boeing engaged in a kind of hardball jobs blackmail against the union.\n\n[https://nwlaborpress.org/2024/03/boeing-back-in-bargaining-first-time-in-16-years/](https://nwlaborpress.org/2024/03/boeing-back-in-bargaining-first-time-in-16-years/)",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/lov16mu/",
              "created": 1727275251,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ldv6wxv",
          "score": -24,
          "body": "Still an insane demand. My salary will go down 10% nominally over the next 3 years. ",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv6wxv/",
          "created": 1721354114,
          "depth": 1,
          "replies": [
            {
              "id": "ldv80qy",
              "score": 25,
              "body": "Congrats? Why are you arguing against yourself?",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv80qy/",
              "created": 1721354558,
              "depth": 2,
              "replies": [
                {
                  "id": "ldv9lcj",
                  "score": -19,
                  "body": "Why are you replying to me? ",
                  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv9lcj/",
                  "created": 1721355197,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ldv9kiy",
              "score": 8,
              "body": "Fight for your rights as a worker, fight together for the rights of your coworkers.",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv9kiy/",
              "created": 1721355187,
              "depth": 2,
              "replies": [
                {
                  "id": "ldvatys",
                  "score": -8,
                  "body": "I can't, lol. CMS (gubment) sets my reimbursement. ",
                  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvatys/",
                  "created": 1721355709,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldw3g00",
                      "score": 9,
                      "body": "Irrelevant. A 12% raise is not “insane” if it’s to correct for inflation and a series of low raises prior.",
                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldw3g00/",
                      "created": 1721370023,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ldvtfre",
              "score": 2,
              "body": "Where do you work and why doesn't anyone else want to work there?",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvtfre/",
              "created": 1721364306,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldujwsi",
      "score": 21,
      "body": "boeing is fucked Loll",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldujwsi/",
      "created": 1721345004,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldx3skj",
      "score": 3,
      "body": "you want less quality issues? pay the people a fair wage so they give a damn",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldx3skj/",
      "created": 1721391814,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldux0bc",
      "score": 11,
      "body": "“There is no Boeing without us”. There is no Boeing without order contracts.",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldux0bc/",
      "created": 1721350123,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldun5hu",
      "score": 24,
      "body": "Production is at its lowest rate.   Boeing SC is no where near its max capacity.  \n\nBoeing Seattle can strike and BSC will pickup the production slack.  Boeing can ride this out longer than the union can stay solvent.  \n\nPension is never going to come back.   40% raise is a pipe dream.",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldun5hu/",
      "created": 1721346230,
      "depth": 0,
      "replies": [
        {
          "id": "lduu2uk",
          "score": 21,
          "body": "You can't shift airline production between separate aircraft cross country without huge delays. 777x or 737 max are here to stay. Production of the 87 in SC has been a disaster. ",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/lduu2uk/",
          "created": 1721348954,
          "depth": 1,
          "replies": [
            {
              "id": "lduxtre",
              "score": -3,
              "body": "How huge?  Don't forget how quickly Boeing sets up the second 787 production line in SC (the fist line in SC took a while mostly due to the facility isn't there).\n\nWithin a year, BSC can spin up a 737max line.",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/lduxtre/",
              "created": 1721350451,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ldv543h",
          "score": -4,
          "body": "There are multiple customers who won't accept Boeing planes manufactured in SC because they are much worse from a quality standpoint.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv543h/",
          "created": 1721353388,
          "depth": 1,
          "replies": [
            {
              "id": "ldx6ur7",
              "score": 6,
              "body": "Literally making this up",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldx6ur7/",
              "created": 1721393140,
              "depth": 2,
              "replies": [
                {
                  "id": "ldzlty9",
                  "score": -2,
                  "body": "Emirates has refused to accept planes made in SC for years.",
                  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldzlty9/",
                  "created": 1721422765,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldzmdz5",
                      "score": 2,
                      "body": "That's the only place they come from .....",
                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldzmdz5/",
                      "created": 1721422956,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "le48aco",
                      "score": 1,
                      "body": "That is not true. I challenge you to post any reputable link stating such.",
                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/le48aco/",
                      "created": 1721500613,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ldv8q99",
              "score": 9,
              "body": "Name ONE.",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv8q99/",
              "created": 1721354846,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldx6pjv",
      "score": 2,
      "body": "Need to get this sort before project 2025 becomes a reality.",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldx6pjv/",
      "created": 1721393080,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldue4d1",
      "score": 14,
      "body": "40% raise and a pension that seems excessive... and risks Boeing management calling on its employee of the year to negotiations.    [https://ifunny.co/picture/wall-street-silver-wallstreetsilv-id-boeing-employee-of-the-year-TLsakgWQB?s=cl](https://ifunny.co/picture/wall-street-silver-wallstreetsilv-id-boeing-employee-of-the-year-TLsakgWQB?s=cl)",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldue4d1/",
      "created": 1721342817,
      "depth": 0,
      "replies": [
        {
          "id": "ldufzfh",
          "score": 42,
          "body": "Didn't the ceo just get blasted by a senator for receiving a 45% raise while their planes are falling apart in the sky?",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldufzfh/",
          "created": 1721343518,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldug7gf",
          "score": 11,
          "body": "Because they will negotiate and settle in the middle.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldug7gf/",
          "created": 1721343602,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldujnpb",
          "score": 13,
          "body": "No it does not.  What is excessive is what GM did to auto workers.  Claiming they couldn't survive if the gave union demand.   Then they do 16b, yes billions, in buybacks in less than 7months after tey negotiated the contract. \n\nWe as workers have to unit and support each other.  If boeing workers wantnto start at 40% and pension damn if ill oppose their ask.  Only they know how badly they've been treated by management.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldujnpb/",
          "created": 1721344909,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldv56tc",
          "score": 5,
          "body": "Their last contract was raises that were well below inflation so they are trying to claw that back.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv56tc/",
          "created": 1721353418,
          "depth": 1,
          "replies": [
            {
              "id": "ldv8xbw",
              "score": -8,
              "body": "You know very little about the things you are speaking of. How did you get in here ?",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv8xbw/",
              "created": 1721354924,
              "depth": 2,
              "replies": [
                {
                  "id": "ldve7ly",
                  "score": 5,
                  "body": "You're right, this was actually a masterful win for labor:\n\n>Having flight-tested a strategy for using jobs blackmail to extort concessions, Boeing did it again in 2013. Union members are still steamed about how it went down. Boeing threatened to move production of its new 777X airliner out of Washington unless workers agreed to extend their contract by another eight years and make big concessions: give up their pension plan and accept a 401(k) instead; pay more for health insurance; limit raises to 1% every other year; and accept a two-tier pay scale in which new hires have a slower wage progression. \n\nhttps://nwlaborpress.org/2024/03/boeing-back-in-bargaining-first-time-in-16-years/",
                  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldve7ly/",
                  "created": 1721357134,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldxivln",
                      "score": 5,
                      "body": "1% every OTHER year not even every year\n\nWtf",
                      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldxivln/",
                      "created": 1721397779,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lduesy1",
          "score": 14,
          "body": "No it doesnt. Considering all the profits/stock buy backs they sure can afford to pay their giys more.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/lduesy1/",
          "created": 1721343076,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldw70tg",
          "score": 3,
          "body": "It's 12% a year for 3 years",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldw70tg/",
          "created": 1721372221,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ldv3wa9",
          "score": -1,
          "body": "Get outta here with your corporate boot licking. It’s over 3 years and it’s a negotiation not a line in the sand",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv3wa9/",
          "created": 1721352893,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldwbb9m",
      "score": 4,
      "body": "Take it directly out of the stock buybacks and CEO's compensation.",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldwbb9m/",
      "created": 1721374991,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldxu5fg",
      "score": 4,
      "body": "Here comes the media trying to make the Union look unreasonable, meanwhile never mentioning the real inflation rate.",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldxu5fg/",
      "created": 1721401619,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldv22pl",
      "score": 3,
      "body": "Between this and the congressional hearings…time to short Boeing stock it seems.",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv22pl/",
      "created": 1721352160,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldux74q",
      "score": 2,
      "body": "40%?!",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldux74q/",
      "created": 1721350198,
      "depth": 0,
      "replies": [
        {
          "id": "le1qs4r",
          "score": 2,
          "body": "Right? I feel like they should be asking for a lot more considering their CEO just got a 45% raise.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/le1qs4r/",
          "created": 1721457306,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldxhdie",
      "score": 1,
      "body": "Timing is interesting.",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldxhdie/",
      "created": 1721397240,
      "depth": 0,
      "replies": [
        {
          "id": "le1qxey",
          "score": 3,
          "body": "Almost as interesting as the Boeing CEO receiving a 45% raise.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/le1qxey/",
          "created": 1721457400,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "le7k6xg",
      "score": 2,
      "body": "makes no sense tbh. when the company is at its worse and nearly bankrupt and u want 40% more? for what? its not like u built good planes the last 10 years",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/le7k6xg/",
      "created": 1721559026,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le7ow9k",
      "score": 1,
      "body": "Yeah fuck Boeing.",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/le7ow9k/",
      "created": 1721561937,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldurg35",
      "score": 1,
      "body": "The union will probably settle for 20% raise but restore pension is not gonna happen. That ship has sailed",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldurg35/",
      "created": 1721347909,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldut9js",
      "score": 1,
      "body": "They are also asking for a 4-day work week and no mandatory overtime.",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldut9js/",
      "created": 1721348630,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldxq5mi",
      "score": 1,
      "body": "Maybe get a raise when the product improves. They've got two astronauts stranded in space for weeks now.",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldxq5mi/",
      "created": 1721400286,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldv5byj",
      "score": 1,
      "body": "Union has balls",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldv5byj/",
      "created": 1721353476,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldw1eaa",
      "score": 1,
      "body": "The planes come with skylights now so why not?",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldw1eaa/",
      "created": 1721368795,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldua2ip",
      "score": -8,
      "body": "Insanity ",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldua2ip/",
      "created": 1721341168,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldvb7ui",
      "score": 0,
      "body": "Haha. Clueless. I guess I’ll keep buying BA puts.",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvb7ui/",
      "created": 1721355869,
      "depth": 0,
      "replies": [
        {
          "id": "ldwg0yu",
          "score": 3,
          "body": "> Clueless\n\nWanting fair pay is \"clueless\", hmmm.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldwg0yu/",
          "created": 1721378163,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldw82ss",
      "score": 0,
      "body": "These employees have messed up so much and still expect a massive raise and a pension. Talk about failing upwards.",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldw82ss/",
      "created": 1721372882,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldvp19o",
      "score": -3,
      "body": "TBH while I agree the main problem at Boeing is management, I would hardly say the workers have been doing a stellar job either. Hardly anything to justify a 40% raise.",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/ldvp19o/",
      "created": 1721362042,
      "depth": 0,
      "replies": [
        {
          "id": "le1qv47",
          "score": 2,
          "body": "They don’t need to justify it, they are unionized. The company is nothing without them. Boeing is lucky they didn’t ask for more tbh.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/le1qv47/",
          "created": 1721457359,
          "depth": 1,
          "replies": [
            {
              "id": "le1r3tq",
              "score": 0,
              "body": "There are obviously limits. Or else why didn't the workers ask for 400% instead of 40?",
              "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/le1r3tq/",
              "created": 1721457515,
              "depth": 2,
              "replies": [
                {
                  "id": "le1r86t",
                  "score": 5,
                  "body": "I imagine they didn’t think 400% was reasonable, but found 40% reasonable since the CEO just received a 45% pay raise.",
                  "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/le1r86t/",
                  "created": 1721457595,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lduuluq",
      "score": -5,
      "body": "All these companies making BILLIONS and can’t be bothered to pay pensions to their employees. Of course they will give themselves bonuses and stock buybacks though, criminals.",
      "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/lduuluq/",
      "created": 1721349163,
      "depth": 0,
      "replies": [
        {
          "id": "lduwdsx",
          "score": 8,
          "body": "Revenue isn't profit. \n\nBoeing is not currently profitable and losing billions a year, trying to stay in business. The company is at risk of receiverships or being broken up for parts.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/lduwdsx/",
          "created": 1721349871,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lduxslc",
          "score": 1,
          "body": "Pensions suck for pretty much everyone. If you leave the company early your payout is crap and the plan ends up having to be very conservative with the returns to meet uncertain future obligations. They are expensive to administer and they underperform the market. 401ks are much better for most people as long as they can stay disciplined (which many people can not, admittedly, and is a flaw)\n\nStock buybacks aren't illegal. Just like dividends aren't illegal. They are mathematically equivalent. If you have a problem with buybacks but not dividends, or just have a problem with a publicly owned company returning value to shareholders in general then I'd question if you understand what buyback is or what the whole point of publicly owned equity is to begin with.\n\nExecutive compensation is usually a pretty small number compared to regular employee compensation. Executive positions are drastically fewer in number and most of their compensation (including bonuses) is typically in the form of equity/options. It's not something the company is really 'paying' for - the stockholders (owners) are implicitly paying for their compensation. They also have an outsized role in the success/failure of a company so owners of the company are typically wiling to pay a premium for experienced executive leadership.\n\nThey also don't just decide their own bonuses, those are up to the board of directors who in turn answer to shareholders. Generally speaking paying your CEO an extra $10 million is going to have a more positive effect on the company than paying your 170,000 workers and extra $58.",
          "permalink": "/r/stocks/comments/1e6nc6j/boeings_largest_union_says_it_will_strike_if/lduxslc/",
          "created": 1721350439,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ],
  "stockTickers": {
    "post_summary": "Boeing's largest union is threatening to strike if contract negotiations fail, citing demands for significant pay increases and pension restoration.",
    "companies": [
      "Boeing"
    ],
    "tickers": [
      "BA"
    ],
    "main_ticker": [
      "BA"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Boeing's largest union is threatening to strike if contract negotiations fail, demanding a significant pay raise and restoration of the pension.",
    "stock_recommendations": "The user is not recommending to buy or sell any Boeing stock.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": null,
    "sentiment_summary": "The post is neutral as it is focused on union negotiations without any stock trading recommendation.",
    "sentiment": "neutral"
  }
}