{
  "title": "Big fan of Costco fanatic, but should I buy shares now?",
  "score": 86,
  "selftext": "Costco has been arguably my favorite company and store to shop at for nearly 20 years. I’m the average shopper who goes into the store for a few things, and walks out with a few hundred bucks worth of stuff “cuz it’s on sale”.  \nI probably spend 500 a month on costco each month on things I really could cut back on. \n\nSo is now a good time to buy a few shares to add to my portfolio? \n\ncurrently i’m 50% QQQM/30%BTC and going to start dumping into SPLG soon. \n",
  "link_flair_text": null,
  "id": "1e7b03p",
  "num_comments": 113,
  "created_utc": 1721414287,
  "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/",
  "comments": [
    {
      "id": "ldywqfj",
      "score": 1,
      "body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldywqfj/",
      "created": 1721414288,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldzo4u8",
      "score": 40,
      "body": "Todays close for COST $838.13. It's trading high with an EPS of 16.07, and FRWD P/E  of 52.23. That's a pretty high multiple on that price. Not trading at a discount, but I'd target $720-$750 as a decent entry price. It's not a growth stock. They do pay a dividend, but the yield could be better. \n\nDo you own other individual stocks or mostly ETFs?",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzo4u8/",
      "created": 1721423578,
      "depth": 0,
      "replies": [
        {
          "id": "le0xlnw",
          "score": 23,
          "body": "With all due respect, as someone who has held Costco stock for years, it is absolutely a growing company. They have been expanding overseas and are huge in China, a market they have only lightly scratched.",
          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le0xlnw/",
          "created": 1721441689,
          "depth": 1,
          "replies": [
            {
              "id": "le354rm",
              "score": 24,
              "body": "Sure. It is a growing company. It has momentum, but I would not label it as a \"growth stock\". A growth stock is a stock that is growing, or expected to grow in earnings faster than the market itself. Costco does not meat that criteria. \n\nIt's not a value stock either. A value stock is a stock trading at levels that are perceived to be below its fundamentals. Costco is not trading below it's fundamentals. One of the key numbers that we'd want to look at first for this is the Price to Earnings Ratio \"P/E\".   \n  \nThe P/E for Costco is 52.23. This means it's trading 52 times it's earnings per share. I typically look for 20 or less as an indicator. This is also a measure I use to consider my entry price. The longer you're planning to hold this stock, the less this might matter, but you still want to buy it at a good price.",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le354rm/",
              "created": 1721486242,
              "depth": 2,
              "replies": [
                {
                  "id": "le3ldav",
                  "score": 9,
                  "body": "Costco gets a premium because it’s a loved company, it’s inflation resistant, has decades of growth, and is recession proof. \n\nAlso anyone who values a company just on P/E is someone who doesn’t see the bigger picture on owning a stock.",
                  "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le3ldav/",
                  "created": 1721492198,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "le3nwap",
                      "score": 3,
                      "body": "No one values a company just on P/E ratio, but that is a top level fundamental. That's why you see it listed as the most common fundamentals when you look up any stock.\n\nThe first part of your comment is nonsense. \"Costco gets a premium because it’s a loved company\". No one with any level of trading and investing experience would say that about an investment. You don't buy a stock just because you love the company, and you don't love a company that doesn't perform to the necessary fundamentals of financial success.\n\nIs Costco a strong viable company? Sure it is. Is it a value at it's current price? No. Is it considered a growth stock right now? No.\n\nThe worst type of investor is someone who does not know how to evaluate an investment based  on the fundamentals. They just throw money at investments and hope something sticks. They run with the crowd. Personally I like that there are those investors. They help the market move, and I like selling to them.",
                      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le3nwap/",
                      "created": 1721493134,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "le5wmpe",
                          "score": 4,
                          "body": "Loved might be the wrong word. The better would would be consistent. \n\nCostco has consistently beaten the market over the last 40 years.\n\nSo regardless of what the price is now. If you are in it for the long term it doesn't really matter.",
                          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le5wmpe/",
                          "created": 1721524543,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "le3pdxd",
                          "score": 2,
                          "body": "People buy stocks of companies they love. Why do you think GameStop or Tesla has the valuation it has?\n\nOwning stock is emotional for a lot of people and stocks are not often rational.\n\nThe market decides whether the price is right, you are too fundamental on your analysis.",
                          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le3pdxd/",
                          "created": 1721493682,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "le3zcb4",
                              "score": 3,
                              "body": "You are mistaken if you think regular investors are moving the stock prices for large cap companies. Institutional investors move the market, not emotional investors like Joe with $1K in his robinhood account.\n\nGME is the exception since they have a cult following, but even they are subject to institutional investors. Stock prices only go down when selling is occuring and GME apes do not sell... So who is doing the selling? The big players, of course.",
                              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le3zcb4/",
                              "created": 1721497314,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "le4246x",
                                  "score": 3,
                                  "body": "Lol, this is why discussing investments in general never really resonates with many novice investors. I can tell real quick who knows what they're saying and who just kind'a says things. \n\nI'm a seasoned retail investor, with a net worth of 1.5 million. It took 25 plus years to get there. I have a regular middle class job that I will eventually retire from in less than 10 years, and I'm starting to make plans for my \"forever\" house.   \n  \nI've made a few recoverable mistakes, and I've gathered a wealth of knowledge. I enjoy seeing others succeed and helping were I can.",
                                  "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le4246x/",
                                  "created": 1721498332,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "le4a4bk",
                                      "score": 0,
                                      "body": "Congrats on your success. Time in the market beats everything, but that is something many who comment here have yet to learn. Many of them are trading, not investing like you, but they'll learn eventually.",
                                      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le4a4bk/",
                                      "created": 1721501294,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "le4akxb",
                                          "score": 1,
                                          "body": "There are two ways to learn things. Foresight, where you learn from the advice, experience, and mistakes of others; And hindsight where you learn from your own mistakes. \n\nIt's best to learn from the former, but we all kind'a learn from the later. However, there are some who just don't learn from either.",
                                          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le4akxb/",
                                          "created": 1721501464,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "le5vrn1",
                                  "score": 2,
                                  "body": "GME is a freak show. That is a downgrade from the circus it was.",
                                  "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le5vrn1/",
                                  "created": 1721524170,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lezyjmr",
                                      "score": 1,
                                      "body": "Hey it’s fun money, I buy games with my trimmings 😅",
                                      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/lezyjmr/",
                                      "created": 1721977639,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "le3z7sx",
                              "score": 0,
                              "body": "GameStop was an oddity. Uncommon.",
                              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le3z7sx/",
                              "created": 1721497267,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "le4j71l",
                          "score": 4,
                          "body": "The fact that Costco is well loved and has strong brand loyalty from people who shop there SHOULD be taken into account when determining a value for the company. That is part of their moat, and a major part of their moat. This drives future growth. When I bought this stock years ago, it was selling at a similar premium to what it is selling at now. They keep the regular dividends relatively low, focusing on reinvesting into the business, and then at the end of the year award a special dividend based upon profitability for the year, which is how companies should do it. I have probably gotten about half my initial investment back in dividends alone.",
                          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le4j71l/",
                          "created": 1721504731,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "le4lbtn",
                              "score": 1,
                              "body": "Brand strength is a factor, but it's not a fundamental. It's more of a technical. I agree with the dividend approach, and yes they do back their investors. \n\nNote: I'm not saying it's a bad stock. I'm saying I would not buy it at it's current trading price. I'd set a buy order at around $720-ish. In addition to that, I don't own may merchandise retail industry stocks. In fact, outside of an ETF or two I don't have any. Most of my individual stocks are consumer staples manufactures, energy, transportation, financials, and high-tech.",
                              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le4lbtn/",
                              "created": 1721505531,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "le5zkhw",
                                  "score": 2,
                                  "body": "I would argue brand strength is a fundamental. For retail I have Costco and Walmart and nothing else but those companies are just sort of in my set it and forget pile... just reinvest the dividends. A few specs (RCYEY, BWXT, SMCI) but other than that largely stable stuff like Google, Texas Instruments, GE, American Towers, ADM, WM, BRK, KO, etc.",
                                  "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le5zkhw/",
                                  "created": 1721525824,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "le6xkpz",
                  "score": 1,
                  "body": "I see Costco as a growth stock and a staple /defensive, which somewhat explains the forward EPS.. I bought more this week.",
                  "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le6xkpz/",
                  "created": 1721543355,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "le5vfso",
              "score": 2,
              "body": "Some may disagree but I believe Costco is the top retailer at this point and I do not like consumer retail overall.  I have owned COST for many years and on hold at this point.",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le5vfso/",
              "created": 1721524026,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lealvv9",
              "score": 1,
              "body": "I think the reality is costco is really stable, it is indeed growing, but just so slowly that there are probably better companies to buy.  I mean really why would people buy 52PE costco, instead of microsoft which is at 37.87PE.\n\n  \nBut I dont' really know much about Costco, maybe they can just flip it and dramatically increase membership fee, or dramatically open more store in a short period of time.",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/lealvv9/",
              "created": 1721600703,
              "depth": 2,
              "replies": []
            },
            {
              "id": "le152r6",
              "score": 0,
              "body": "How can then be Huge and only lightly scratched at the same time? Seriously asking as a potential investor. Which one is it?",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le152r6/",
              "created": 1721445067,
              "depth": 2,
              "replies": [
                {
                  "id": "le18aoe",
                  "score": 9,
                  "body": "The locations they have in China literally had MASSIVE crowds of people lining up on the grand openings. I remember reading somewhere that in one of their recent stores opened up earlier this year, over 10,000 people showed up for its grand opening, over 15,000 people signed up for Costco membership cards before it opened, and over 100,000 people shopped there within the first couple months. Its only lightly scratched because they only have a handful of stores there. The stores though are so popular in China that travel agencies actually include shopping at Costco as part of their vacation packages. Costco works because they put the customer first.",
                  "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le18aoe/",
                  "created": 1721446613,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "le6eqch",
                      "score": 1,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le6eqch/",
                      "created": 1721532771,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lelc4n0",
                          "score": 1,
                          "body": "The Walton family couldn't even break into Germany without getting sued into oblivion.  I highly doubt they would do any better in China.",
                          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/lelc4n0/",
                          "created": 1721762847,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "le2fctr",
                      "score": 1,
                      "body": "Awesome thanks!",
                      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le2fctr/",
                      "created": 1721474211,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ldzsqa6",
          "score": 2,
          "body": "I wish I understood how to evaluate like that before I buy. I’m still learning. I did just end up buying 5 shares or costco and apple today though. \nI made a post on investing actually too. “what are your top 3 things to look for when buying a stock?”.",
          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzsqa6/",
          "created": 1721425222,
          "depth": 1,
          "replies": [
            {
              "id": "le3mrn8",
              "score": 3,
              "body": "Anyone who uses P/E ratio as their sole DD on whether you should buy a stock isn’t doing a good analysis on the stock\n\nThere are very good reasons why Costco gets a premium on P/E.",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le3mrn8/",
              "created": 1721492716,
              "depth": 2,
              "replies": []
            },
            {
              "id": "le33hw9",
              "score": 1,
              "body": "Learn the fundamentals first. These are the numbers that you see on typical financial analysis. Then learn the technicals. These are the chart/price movements over time.   \n  \nThe good news is, you can learn this stuff pretty much free. If you have a brokerage account, like Fidelity, or Charles Schwab, they have a \"learning section\" that can help you gain a basic understanding of both.   \n  \nAlso, I have fond Investopedia A great resorce for learning the basics. It's free also, but they do have \"classes\" you can take that do cost about $200 or so per class.  [https://www.investopedia.com/](https://www.investopedia.com/)",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le33hw9/",
              "created": 1721485627,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ldztbtj",
          "score": 4,
          "body": "NVDA,APPL,TSLA. GME, CAT, TTWO, COST, XLE, XLK, QQQM, SPLG, BTC/ETH",
          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldztbtj/",
          "created": 1721425435,
          "depth": 1,
          "replies": [
            {
              "id": "le377g3",
              "score": 1,
              "body": "Some of these are pretty solid stocks, and ETFs, but also kind of typical.   \nThe two on your list I don't like at all are GME and TTWO, but I have my own reasons for that. If you asked me which one to get rid of I'd say GME. Take a look at the forward P/E for GME 326. That's insane. Not to mention the fact that GME is steadily losing money.   \n\nThe ETFs look pretty good.",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le377g3/",
              "created": 1721487021,
              "depth": 2,
              "replies": [
                {
                  "id": "le4xbhp",
                  "score": 2,
                  "body": "yah GME just for short term degenerate gambling as it seems to pump every so often. TTWO is because GTA6 release will be the biggest selling game in our generation.",
                  "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le4xbhp/",
                  "created": 1721510030,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ldyz4pm",
      "score": 73,
      "body": "I like Costco long term.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldyz4pm/",
      "created": 1721415082,
      "depth": 0,
      "replies": [
        {
          "id": "le08td3",
          "score": 44,
          "body": "Yea and I like pizzas longterm, but if someone said to me \"do you want a pizza for $500?\", I'd probably say nah I'm good",
          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le08td3/",
          "created": 1721431332,
          "depth": 1,
          "replies": [
            {
              "id": "le3dcgp",
              "score": 8,
              "body": "The real answer to all this is Costco pizza.",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le3dcgp/",
              "created": 1721489284,
              "depth": 2,
              "replies": []
            },
            {
              "id": "le097lu",
              "score": 4,
              "body": "$500 for pizza, cost $100 already every time I order it and it always goes down the shitter, lol.",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le097lu/",
              "created": 1721431487,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldz0fii",
      "score": 39,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldz0fii/",
      "created": 1721415520,
      "depth": 0,
      "replies": [
        {
          "id": "ldz11fg",
          "score": 9,
          "body": "Could also wait for it to be above 21/10/8 MAs as well. It’s in a clear down trend with rest of market it’s clearly broke trend. As well they blew their load with the membership price hike announcement. That was out there in people’s imaginations it could be $10… $15… no it’s on $5 and. O more now for awhile, plus they did the big unscheduled dividend. Less catalysts now than there was",
          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldz11fg/",
          "created": 1721415723,
          "depth": 1,
          "replies": [
            {
              "id": "le5usaj",
              "score": 3,
              "body": "Down Trend ?  You have no idea what you you are saying. They paid a special dividend of 6.3 BILLION in January 2024 as a result of double digit year over year EPS.\n\nThat is the fifth special dividend.  \"blew their load\" with membership increase ?  please.",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le5usaj/",
              "created": 1721523743,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "le0ldh8",
          "score": 1,
          "body": "How many shares is considered a whole position?",
          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le0ldh8/",
          "created": 1721436456,
          "depth": 1,
          "replies": [
            {
              "id": "le0roc4",
              "score": 7,
              "body": "Depends how concentrated you like to be",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le0roc4/",
              "created": 1721439146,
              "depth": 2,
              "replies": [
                {
                  "id": "le0rr0r",
                  "score": 3,
                  "body": "You buy enough so that if it tanks you will still have appetite to buy more and double down",
                  "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le0rr0r/",
                  "created": 1721439179,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "le0rt5v",
                      "score": 1,
                      "body": "Rather than think oh shit I’m too deep in red can’t buy more now",
                      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le0rt5v/",
                      "created": 1721439204,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "le0rw1v",
                      "score": 1,
                      "body": "Got it. I know what you mean.",
                      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le0rw1v/",
                      "created": 1721439239,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "le5tofm",
                      "score": 1,
                      "body": "What do you call that strategy ?",
                      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le5tofm/",
                      "created": 1721523270,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "leabvin",
                          "score": 1,
                          "body": "It’s similar to DCA, although many prefer to lump sum. Dollar cost averaging I’d basically just investing monthly or when you get your paycheck.",
                          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/leabvin/",
                          "created": 1721597069,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "le420z5",
              "score": 2,
              "body": "I use 100 shares as a position. I rarely ever buy 100 shares at one time, usually do not have that much cash available. 100 shares allows you to sell covered puts  and calls. Which can be used to increase your annual return.",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le420z5/",
              "created": 1721498300,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldz28ao",
      "score": 35,
      "body": "When I bought it at $440 not so long ago, I thought it was overvalued..  Just start a small position and start to DCA..   This is one of the few stocks that I can rest easy at night",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldz28ao/",
      "created": 1721416129,
      "depth": 0,
      "replies": [
        {
          "id": "ldzcpv9",
          "score": 14,
          "body": "This 👆 I regret not buying more at $450",
          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzcpv9/",
          "created": 1721419674,
          "depth": 1,
          "replies": [
            {
              "id": "ldzwdlr",
              "score": 1,
              "body": "at least you’re in though! that’s all that matters. I’m in at 838 😆",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzwdlr/",
              "created": 1721426544,
              "depth": 2,
              "replies": [
                {
                  "id": "le0jvjf",
                  "score": 6,
                  "body": "rather buy in at 838 than at 890 a few weeks ago",
                  "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le0jvjf/",
                  "created": 1721435826,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "le04i5s",
                  "score": 0,
                  "body": "👍",
                  "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le04i5s/",
                  "created": 1721429652,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "le16t2k",
          "score": 3,
          "body": "That's why I dollar cost averaged a very small amount of money into the stock earlier this week.\n\nMost of the time with Costco I keep thinking it's too expensive and just dollar cost average in a few shares on small dips, only for it to shoot up to be even more expensive, and wish I had bought more when I thought was expensive before.",
          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le16t2k/",
          "created": 1721445889,
          "depth": 1,
          "replies": []
        },
        {
          "id": "le3f6ww",
          "score": 2,
          "body": "I think Costco is such a rock solid company that it will always trade at a bit of a premium. I started buying at $320, and even then everyone was saying it was overvalued.\n\nThat said, based on the fundamentals, Costco does look pretty pricey right now even compared to its own history. I'm not rushing to add more right now.",
          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le3f6ww/",
          "created": 1721489952,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ldzcydc",
      "score": 7,
      "body": "I’ve been watching Costco with a “maybe it’s overpriced so let me just buy this much for now and see.” \nRegrets because I should have got more.\nIt’s gone up tremendously. You may want to DCA over few weeks.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzcydc/",
      "created": 1721419755,
      "depth": 0,
      "replies": [
        {
          "id": "ldzw48m",
          "score": 2,
          "body": "yah, makes sense. That’s  what seems to be the norm with costco being so expensive. I mean, it doesn’t necessarily scream growth at this point, more as a safe hedge against my other degenerate moves 😆",
          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzw48m/",
          "created": 1721426448,
          "depth": 1,
          "replies": [
            {
              "id": "le01t63",
              "score": 2,
              "body": "It's not exactly safe. The business probably won't shrink, but there could easily be severe multiple contraction.",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le01t63/",
              "created": 1721428614,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldzxulk",
      "score": 5,
      "body": "I buy at least 5 shares of cost per year no matter the price. Been doing that for nearly 10 years. It's far and away the most overvalued I've seen it. Some year I bought plenty more than 5. But this year I've literally had to force myself to do it. Beware though it's premium is historically stretched. Will never sell nonetheless.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzxulk/",
      "created": 1721427098,
      "depth": 0,
      "replies": [
        {
          "id": "ldzz0qt",
          "score": 1,
          "body": "that’s awesome, I should have been buying a long time ago. It does say the company is undervalued though when I research a bit today. How is this analyzed ?",
          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzz0qt/",
          "created": 1721427541,
          "depth": 1,
          "replies": [
            {
              "id": "le3p5of",
              "score": 1,
              "body": "Not by PE ratio (price to earnings). You're paying over $50 for every $1 or earnings. Historically I've bought my shares when that ratio in is mid 20s to mid 30s. But given the consistency of the company's growth investors have decided it's worth an additional premium.",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le3p5of/",
              "created": 1721493600,
              "depth": 2,
              "replies": []
            },
            {
              "id": "le0k1t8",
              "score": 1,
              "body": "it's analyzed by big banks that give it whatever rating helps them make money. Fuck what BofA \"analysts\" have to say",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le0k1t8/",
              "created": 1721435900,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldyy54e",
      "score": 6,
      "body": "It’s a great company. If your holding period is long you should definitely buy shares.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldyy54e/",
      "created": 1721414754,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldzet18",
      "score": 3,
      "body": "I bought at $160 and have continually sold out (to lower taxes each year) and reinvested it in BRK/B.\nI wouldn’t buy it now, but it is possibly and probably a good investment for the long term, just doesn’t fit my determination of value as well as BRK/B.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzet18/",
      "created": 1721420375,
      "depth": 0,
      "replies": [
        {
          "id": "ldzvi3u",
          "score": 1,
          "body": "How would you say you view BRK differently?",
          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzvi3u/",
          "created": 1721426222,
          "depth": 1,
          "replies": [
            {
              "id": "le1jg1p",
              "score": 1,
              "body": "BRK has a far far lower PE with a smaller way to drop. Doesn’t mean it won’t drop farther, just that it has less to drop.\nI would say BRK is the safest single stock out there since it is a conglomerate with a strong ethical foundation to do right for the shareholders in the long run.",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le1jg1p/",
              "created": 1721452746,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldzqiyj",
      "score": 2,
      "body": "Sell some OTM monthly puts",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzqiyj/",
      "created": 1721424434,
      "depth": 0,
      "replies": [
        {
          "id": "ldzsaxu",
          "score": 2,
          "body": "i’m a noob at investing and I don’t have options, margin or anything like that. maybe some day, but I just sold my house and wanna get stabilized in the market first with etf’s and a few blue chips.",
          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzsaxu/",
          "created": 1721425069,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "le0jfb4",
      "score": 2,
      "body": "Im a big costco fanboy, like I go there almost every day, and I wear kirkland branded clothes lol, but I feel it's in overvalued territory.\n\nI'd wait for an 800 dip, or maybe even a 750 dip. They might not ever come, but that's a risk im willing to take.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le0jfb4/",
      "created": 1721435633,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le0mbl5",
      "score": 2,
      "body": "I have held Costco for years, and when I bought Costco years ago, people were talking about it being overvalued. But all you need to do is look at the fundamentals of the company. They take care of their customers and are continuing to grow globally. In China, people are lining up around the block to go to their stores. I honestly feel you cannot go wrong investing in this company as long as you have the patience and discipline not to dump it.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le0mbl5/",
      "created": 1721436861,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le3h8fa",
      "score": 2,
      "body": "Benji, you and me are simpatico.  I bought 300 shares of COST in the late 90s, early aughts and have never purchased again, but wish I had.  It's a fantastic company, and contrary to some of the comments below, I think it IS a growth stock. It trades like a tech stock.\n\nIt does seem a bit overpriced right now, so you might wait for a dip, but whatever you pay today, I suspect, will look cheap in 5 years. \n\nI'm hoping they will split this year and that the new CEO will be as excellent as Gallanti has been.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le3h8fa/",
      "created": 1721490696,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le3rp3c",
      "score": 2,
      "body": "Long term Costco seems fine. That said, it's not really a growth stock to me.  Given its expected growth, I don't see a reason to choose it over, say, QQQ.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le3rp3c/",
      "created": 1721494516,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le4lxgg",
      "score": 2,
      "body": "Been buying for 2 years. Buying the dip all the time. It’s an insanely good business.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le4lxgg/",
      "created": 1721505755,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le6i2o1",
      "score": 2,
      "body": "I thought Costco was a pricey at ~$260\n\nI thought Costco was way pricey at ~$450\n\nAnd now shake my head, cannot touch it at ~$850",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le6i2o1/",
      "created": 1721534437,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lemlzpt",
      "score": 2,
      "body": "Stop walking into Costco.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/lemlzpt/",
      "created": 1721778155,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldyzaa1",
      "score": 2,
      "body": "Everyone here saying yes even though it’s extremely expensive right now compared to what it historically has traded at",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldyzaa1/",
      "created": 1721415134,
      "depth": 0,
      "replies": [
        {
          "id": "ldz01v0",
          "score": 1,
          "body": "yah it’s always been expensive. we’ve been saying that since it was $300 a share. I think the time is now",
          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldz01v0/",
          "created": 1721415394,
          "depth": 1,
          "replies": [
            {
              "id": "ldzuv0j",
              "score": 5,
              "body": "It’s trading at 50x earnings which is a historical high while growing revenue at 7% annually and income at 10% annually.  That’s insanely expensive for its growth.",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzuv0j/",
              "created": 1721425987,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ldzikv0",
      "score": 1,
      "body": "I buy costco shares every 2 weeks.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzikv0/",
      "created": 1721421660,
      "depth": 0,
      "replies": [
        {
          "id": "ldztwz4",
          "score": 1,
          "body": "nice! what makes you buy every 2 weeks specifically rather than just buying the dips? I’ve sorta been sloppy with my savings being both lump summed and DCA at the same time. I don’t really have a set strategy",
          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldztwz4/",
          "created": 1721425647,
          "depth": 1,
          "replies": [
            {
              "id": "ldzu72o",
              "score": 3,
              "body": "I get paid every 2 weeks.",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzu72o/",
              "created": 1721425747,
              "depth": 2,
              "replies": [
                {
                  "id": "ldzvrsw",
                  "score": 1,
                  "body": "right but do you have it still set to auto buy every 2 weeks even on green days? I’m curious if people care about that or not",
                  "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzvrsw/",
                  "created": 1721426321,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldzwfue",
                      "score": 3,
                      "body": "Yep. I have around 4-5 stocks/eft I buy every payroll. They are aapl, xeqt, costco, and whatever I like at the time",
                      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzwfue/",
                      "created": 1721426568,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "le0iu7z",
      "score": 1,
      "body": "I wouldn't but they weren't cheap when I bought some shares either. I'm planning to hold them long term unless costco changes dramatically.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le0iu7z/",
      "created": 1721435390,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le0m4o8",
      "score": 1,
      "body": "Historically Costco stock rallies into membership price increase and then trails S&P in next 6 months.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le0m4o8/",
      "created": 1721436778,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le0oojt",
      "score": 1,
      "body": "Glad you posted this. I’m thinking the same exact thing…",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le0oojt/",
      "created": 1721437863,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le0xihy",
      "score": 1,
      "body": "I’ve been long COST for at least 15 years now , it’s a good one, occasional special dividends too. \n\nI’m hoping for a split if it hits $1000.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le0xihy/",
      "created": 1721441652,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le0z8nx",
      "score": 1,
      "body": "Don't invest on personal feelings.  Research the company.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le0z8nx/",
      "created": 1721442411,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le15hbt",
      "score": 1,
      "body": "Look at a life long chart of MSFT, and that’s COSTs future. Slow n steady up up up.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le15hbt/",
      "created": 1721445258,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le2ifon",
      "score": 1,
      "body": "I like Costco for long term, however the price has gone up way too much to get in great companies like COST, NVDA, GOOG, and APPL.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le2ifon/",
      "created": 1721475991,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le2kn66",
      "score": 1,
      "body": "Should have bought 20 years ago",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le2kn66/",
      "created": 1721477183,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le2ni95",
      "score": 1,
      "body": "Man you are like 17 years too late",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le2ni95/",
      "created": 1721478668,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le2r8o6",
      "score": 1,
      "body": "It’s ran up almost 100% in a year. Wait for a dip",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le2r8o6/",
      "created": 1721480466,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le31fgx",
      "score": 1,
      "body": "I got my first 2 shares this year. Great company. Been a shopper there for 15 years, wish Id bought back then.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le31fgx/",
      "created": 1721484827,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le3eh2k",
      "score": 1,
      "body": "Don't buy then bitch.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le3eh2k/",
      "created": 1721489694,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le3gwbf",
      "score": 1,
      "body": "Costco trades at a premium. Ignore the noise if you buy it and just hold. They are very well managed and conservatively run so you can expect to be rewarded over the long run.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le3gwbf/",
      "created": 1721490574,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le4dzrn",
      "score": 1,
      "body": "It’s pricey but if you dollar cost average into it, future you will be super grateful.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le4dzrn/",
      "created": 1721502755,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le4pnpk",
      "score": 1,
      "body": "I've been buying Costco for 4 years now on a recurring basis, basically $30 a week. I've bought high and I've bought low. I treat it like a savings account. I have a couple of other stocks with which I do the same thing; all together I try to save (invest) about $120-$150 a week. Each stock is from a company of which I am a customer of some sort and with which I have a favorable opinion. All together, this portfolio is doing very well right now. But that's mainly because if you're not doing well in the stock market right now you need to get out of investing entirely. It's hard to bet wrong right now.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le4pnpk/",
      "created": 1721507151,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le5ez2k",
      "score": 1,
      "body": "Costco overvalued. It will drop until 600",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le5ez2k/",
      "created": 1721517132,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lea7dsk",
      "score": 1,
      "body": "Wait the crash. Meh",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/lea7dsk/",
      "created": 1721595495,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldyy9rt",
      "score": 1,
      "body": "Yes, go for it.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldyy9rt/",
      "created": 1721414796,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ldyzz2b",
      "score": 0,
      "body": "Buy now if a 20% pullback won’t bother your psyche\n\nIf a 20% pullback would be a big red number that bothers you wait to buy these higher p/e companies after a pullback, like at the time of earnings guidance revision.",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldyzz2b/",
      "created": 1721415367,
      "depth": 0,
      "replies": [
        {
          "id": "ldz0o5v",
          "score": 10,
          "body": "\"Miss out on 80% growth while waiting for a 20% pullback\"",
          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldz0o5v/",
          "created": 1721415600,
          "depth": 1,
          "replies": [
            {
              "id": "ldzojxh",
              "score": -1,
              "body": "I think you missed the point.   Right over your head.\nAppreciate the input!",
              "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzojxh/",
              "created": 1721423726,
              "depth": 2,
              "replies": [
                {
                  "id": "ldzrvzu",
                  "score": 0,
                  "body": "Thanks for proving your ignorance. Good luck timing the market!",
                  "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzrvzu/",
                  "created": 1721424920,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ldzu2cj",
                      "score": 2,
                      "body": "[removed]",
                      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldzu2cj/",
                      "created": 1721425701,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "le05ei5",
                          "score": 1,
                          "body": "Trolling, insults, or harassment, especially in posts requesting advice, is not tolerated.  Please try to keep discussions on /r/stocks civil by providing straightforward responses without including any insults or harassment.\n\nContinual abuse of /r/stocks rule #5 regarding trolling, insulting and harassment will result in your account being banned.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules",
                          "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/le05ei5/",
                          "created": 1721429995,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ldz3sgg",
      "score": -2,
      "body": "No",
      "permalink": "/r/stocks/comments/1e7b03p/big_fan_of_costco_fanatic_but_should_i_buy_shares/ldz3sgg/",
      "created": 1721416659,
      "depth": 0,
      "replies": []
    }
  ]
}