{
  "title": "Crowd Strike Liability for the outage and  stock price impact",
  "score": 62,
  "selftext": "Just got done analyzing Crowdstrike Terms and condition located at \n\n[https://www.crowdstrike.com/terms-conditions/](https://www.crowdstrike.com/terms-conditions/)\n\nLooks like CrowdStrike is at risk of losing last 12 Months of revenue. \n\n\"The liability limits in CrowdStrike's terms and conditions specify that CrowdStrike’s total liability for any claim arising out of or related to the agreement will be limited to the amount paid by the customer for the specific product or service giving rise to the claim during the 12-month period immediately preceding the event causing the claim. Additionally, CrowdStrike is not liable for any indirect, special, incidental, consequential, or punitive damages, even if advised of the possibility of such damages.\"\n\nI haven't had a chance to review last 4Q revenue by product but seems like the liability is going to be at around 3B. which is a bit less than what their predictions for FY25 revenue. Let us see what this will do to the stock price in coming weeks/months?\n\nI am inclined towards shorting, what is the WSB sentiment?\n\nUpdate 1  Monday 7/22- Shorted at 276 and covered ar 264.\n\n\n\n",
  "link_flair_text": "Discussion",
  "id": "1e7zyy5",
  "num_comments": 103,
  "created_utc": 1721494049,
  "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/",
  "comments": [
    {
      "id": "le3qeqy",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 5 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 6 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le3qeqy/",
      "created": 1721494053,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le42omt",
      "score": 83,
      "body": "https://preview.redd.it/uzecpne0rpdd1.jpeg?width=828&format=pjpg&auto=webp&s=faf4f1217fbefd8ef4b77e26dda3aeae1dbd7197",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le42omt/",
      "created": 1721498543,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le3yifc",
      "score": 59,
      "body": "Man if boeing isnt going down with the crap they got going on neither is crowdstrike. Whats most likely going to happen is that they will 100% will lose some clients and their account managers are going to have to stroke their clients cocks and all will be fine.",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le3yifc/",
      "created": 1721497007,
      "depth": 0,
      "replies": [
        {
          "id": "le42ti5",
          "score": 18,
          "body": "I assume Boeing has a non indifferent amount of lobbying and support from dod and friends. It's also in a duopoly, while crowdstrike had few competitors.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le42ti5/",
          "created": 1721498593,
          "depth": 1,
          "replies": [
            {
              "id": "le7cbt5",
              "score": 5,
              "body": "Since they bought McDonnell Douglas it’s not a duopoly anymore, at least not if you have American stakeholders in mind. \n\nAirbus being their competitor on a global civil scale, it’s a little different i think. \n\nBoeing is and was the only American plane manufacturer for a long time. This makes it almost a monopoly on the most important US market. \n\nOn top of that:\nBoeing being the biggest military plane manufacturer makes them untouchable.",
              "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le7cbt5/",
              "created": 1721553443,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "le7he4b",
          "score": 8,
          "body": "While I agree with CRWD not going down, you can't compare it to Boeing, like ever. Aerospace industry has an incredibly high barrier of entry that is almost impossible to penetrate, therefore you can't just simply let one of the biggest aircraft suppliers fail, hence they are still alive. In cybersecurity, vendors are growing like mushrooms every day. We are talking about at least a decade of ramp up for aircrafts while a maximum of few years for cybersecurity. So no, they are vastly different.\n\nRegardless, I am pretty sure CRWD will lose quite a few clients on renewals and it might scare away new clients for a bit, but this will blow over within a year tops imo.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le7he4b/",
          "created": 1721557099,
          "depth": 1,
          "replies": [
            {
              "id": "le8x2z4",
              "score": 1,
              "body": "Agreed. CRWD isn’t part of a duopoly like Boeing.",
              "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le8x2z4/",
              "created": 1721579989,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "le4ry6b",
          "score": 5,
          "body": "People gonna get some hefty price reduction",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le4ry6b/",
          "created": 1721508002,
          "depth": 1,
          "replies": []
        },
        {
          "id": "le7qnv1",
          "score": 3,
          "body": "Ah well boeing is protected by the fact that they are one of the two companies powering one of the most important industries in the world. And Americas politicians would rather eat shit and die than crippling that important source of global influence. The sanctions against planes is most likely the only sanction that really hurts Russia. Neither China nor Russia have yet the ability to replace boring and airbus in any meaningful way. \n\nCrowdstrike on the other hand is basically a computer virus and lots of companies use it because they want to protect themselves against exactly the kind of event that it now caused. I would be shocked if half of their customers wouldnt delete it from their computers now and never ever renew that contract. You don't need governments to fuck over a company customers are more important.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le7qnv1/",
          "created": 1721562941,
          "depth": 1,
          "replies": []
        },
        {
          "id": "le6qy2g",
          "score": 2,
          "body": "This incident is far more severe than what happened with Boeing. A critical failure only happened with something like 0.0001% of Boeing flights.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le6qy2g/",
          "created": 1721539247,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "le4ccqx",
      "score": 22,
      "body": "It’s gonna be big. I’m the director of cloud at IBM. All day yesterday and through today we are seeing ridiculous amounts of damage. Airlines are still in safe mode, global cc processors in safe mode… hospitals all over in safe mode. Meaning that they are not fully recovered and still have to re image and remove the agents. The law suits from this will be gigantic. Note that this could have been zscaler, or Palo Alto or anyone with overlap and agent protection. To me the biggest risk I see beyond this is if zscaler has an outage. The amount of business that is funneling all their traffic to the zscaler network is astounding. I always preach to my clients that you should be able to make your network modular and swap in components with minimal disruption. Zscaler and crowdstrike and others really are about making sure they sit at the center of everything.. would not shock me to see this happen at the same scale with zscaler or Palo in the near future.",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le4ccqx/",
      "created": 1721502127,
      "depth": 0,
      "replies": [
        {
          "id": "le4g0p1",
          "score": 3,
          "body": "Elasticity and scalability of cloud solutions is a double edge sward.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le4g0p1/",
          "created": 1721503531,
          "depth": 1,
          "replies": []
        },
        {
          "id": "le6nlic",
          "score": 2,
          "body": "How much money do you make? Didn’t know we had smart people here.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le6nlic/",
          "created": 1721537360,
          "depth": 1,
          "replies": [
            {
              "id": "le85a48",
              "score": 1,
              "body": "Made 200 on crowd on Friday with the bounce",
              "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le85a48/",
              "created": 1721569885,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "le4se5q",
      "score": 6,
      "body": "I bought some puts for post earnings. I think the true pain won't reflect until their forward guidance (for the short term) comes in as total crap. Stay away from shorter plays, because it's easy for it to be manipulated. But when the guidance/sales come in as shit, there's nowhere to hide.\n\nImagine being a salesperson trying to pitch a company on Crowdstrike.\n\nAlso, you know PANW has its salespeople going full throttle right now trying to get contracts. Pelosi is not an easy taskmaster",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le4se5q/",
      "created": 1721508163,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le3shr1",
      "score": 43,
      "body": "So Delta lost several billions dollars this weekend for example, do you think:\n\nA) They demand a refund of the 12 months fees\n\nB) Cancel their contract and switch to someone else \n\nC) They sue Crowdstrike into oblivion and reparation for those billions lost because those terms and conditions do not apply to crippling entire networks\n\nD) All the above\n\nI keep repeating, this is probably one of the worst IT disasters in recent history. The damage will take several quarters to assess, major clients will move on, reputation as top breed is destroyed, etc. etc. etc.\n\nEdit: And Delta is just one of tens/hundreds of such clients, CRWD is toast but only after they get some retail trapped!",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le3shr1/",
      "created": 1721494803,
      "depth": 0,
      "replies": [
        {
          "id": "le4x02h",
          "score": 14,
          "body": "If they can prove that it was incompetence then the contract limits are as good as toilet paper.   In court they will eat them alive.    And honestly the software industry has needed such a thing for a very long time.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le4x02h/",
          "created": 1721509907,
          "depth": 1,
          "replies": []
        },
        {
          "id": "le4snst",
          "score": 4,
          "body": "Also, \n\nA2 - Future contracts will not be limited to 1 year loss of revenue. \n\nE - Crowdstrike insurance premiums finnin to moon.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le4snst/",
          "created": 1721508264,
          "depth": 1,
          "replies": [
            {
              "id": "leds38f",
              "score": 1,
              "body": "Also. Current costumer can just claim breach of contract and stop the entire charade and switch to a competitor. Like starting today.",
              "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/leds38f/",
              "created": 1721657074,
              "depth": 2,
              "replies": [
                {
                  "id": "ledt03l",
                  "score": 1,
                  "body": "CRWD busy drilling to the center of the earth",
                  "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/ledt03l/",
                  "created": 1721657400,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ledu8ii",
                      "score": 2,
                      "body": "My puts ($160 09/24) i bought at a insane premium (like 80%) on Friday just turned green. \n\nI am absolutely in team Chapter 11 after looking at their financials. There goodwill is toast and they absolutely in no world have the cash to survive litigation. Its a prime candidate for someone like Microsoft to jump in at 10$ and buy the scraps. \n\nI doesn’t matter if there product is exceptional, they simply don’t have enough cash flow to cover the damages, even if they go for the “here take credits on our products”. They will have to cover for 3 party damages, exactly because it wasn’t hack and absolutely gross negligence on there QA.",
                      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/ledu8ii/",
                      "created": 1721657835,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ledv5gk",
                          "score": 1,
                          "body": "Congrats\n\nThey are def in a bad spot. People are severely underestimating how much this might hurt them. Their sky-high Pe is based on exponential growth. But even if they keep signing up customers, the contracts going forward are going to be much less favorable to CRWD. Their insurance premiums are going to moon, etc.\n\nI will say, not sure that they will go the route of bankruptcy. I wouldn't put too much $ betting on that.",
                          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/ledv5gk/",
                          "created": 1721658157,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "le42vnh",
          "score": 12,
          "body": "Crowdstrike isn’t toast IMO. I use the EDR at work daily and it’s honestly solid. The incident wasn’t a data leak, it was purely human. CS is still the best EDR (or one of the best) and has more data aggregated for analysis than the NSA lol.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le42vnh/",
          "created": 1721498615,
          "depth": 1,
          "replies": [
            {
              "id": "le65rjb",
              "score": 1,
              "body": "We ended up just doing MDE, but crowdstrike was in the lead for third-party solutions.",
              "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le65rjb/",
              "created": 1721528552,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "le43x9g",
          "score": 9,
          "body": "delta did not lose several billion dollars.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le43x9g/",
          "created": 1721499000,
          "depth": 1,
          "replies": [
            {
              "id": "le50zkf",
              "score": 6,
              "body": "It probably costs $200K to operate a single flight, there are thousands of flights cancelled. There are tens or hundreds of thousands of passengers rebooked or refunded, hundreds of thousands of meals, transportation, and hotel vouchers. There are the indirect costs associated with hiring contractors and bringing in extra staff, the lost revenues that would be in the millions as customers switch to other airlines, I could go on. This is just a single Crowdstrike client.",
              "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le50zkf/",
              "created": 1721511461,
              "depth": 2,
              "replies": [
                {
                  "id": "le5krrx",
                  "score": 11,
                  "body": "they made just over 54 billion last year. that is from all sources. even if their revenue was just from flights, it was split evenly across the year and they didn't fly EVERY flight in an entire week, it wouldn't be billionS.",
                  "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le5krrx/",
                  "created": 1721519514,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "le7h8v3",
                  "score": 3,
                  "body": "GTFOH with this $200k nonsense.\n\nYou know operational costs are public? \n\nIt’s $10-11k per hour to fly an A320 or A321 (the bulk of delta’s fleet) at the high end. Those costs are obviously not incurred if the planes aren’t flying.\n\nThe big issue with the airlines is getting people rebooked in a timely manner, losing out on some revenue (because they don’t gave an unlimited amount of planes to put in service to make up for overcapacity), and having to pay for people’s reimbursement costs.",
                  "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le7h8v3/",
                  "created": 1721556996,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "le56u3d",
          "score": 2,
          "body": "Or E) they carry on as is",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le56u3d/",
          "created": 1721513799,
          "depth": 1,
          "replies": []
        },
        {
          "id": "le6dxva",
          "score": 2,
          "body": "I think D) with an extra serving of C) on top.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le6dxva/",
          "created": 1721532389,
          "depth": 1,
          "replies": []
        },
        {
          "id": "le46ldg",
          "score": 3,
          "body": "All that is going to happen is that Crowdstrike will offer them 12 months worth of credits to their service and corporations will be like okay.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le46ldg/",
          "created": 1721499985,
          "depth": 1,
          "replies": [
            {
              "id": "le4st0v",
              "score": 3,
              "body": "and so their revenue guidance will go down the shitter, hence the stock will sink ![img](emote|t5_2th52|4275)",
              "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le4st0v/",
              "created": 1721508318,
              "depth": 2,
              "replies": [
                {
                  "id": "le4ydqu",
                  "score": 2,
                  "body": "Eh I don’t even think stocks can sink at this point",
                  "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le4ydqu/",
                  "created": 1721510441,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ledu8ka",
                      "score": 1,
                      "body": "Puts go Brrr",
                      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/ledu8ka/",
                      "created": 1721657836,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "le3tmey",
          "score": 2,
          "body": "A and C",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le3tmey/",
          "created": 1721495216,
          "depth": 1,
          "replies": [
            {
              "id": "le48lwc",
              "score": 2,
              "body": "Another thing to consider is who else does this as efficiently as Crowd Strike has done over last 5 years and how easy and quick is it to dump CrowdStrike to deploy other available solutioons.  IMO  near term it will be a massive short opportunity and evetually once all legal matters are setttled as long as their is not a  more viable alternative they will be back in upswing again. Time Horizon  to be back to glory will be 2-3 years.",
              "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le48lwc/",
              "created": 1721500733,
              "depth": 2,
              "replies": [
                {
                  "id": "le77890",
                  "score": 2,
                  "body": "Also, this happening again with any EDR product is a possibility.",
                  "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le77890/",
                  "created": 1721549820,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "le6u661",
          "score": 1,
          "body": "I work in Cybersecurity and reputation is everything. Gartner Magic Quadrant and all that jazz. I highly doubt they’ll let this “bug” justify a high rating ever again.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le6u661/",
          "created": 1721541200,
          "depth": 1,
          "replies": []
        },
        {
          "id": "le65iaa",
          "score": 1,
          "body": "E. Most corporations are allergic to change. \n\nThey'll get a deal on their next contract and be happy.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le65iaa/",
          "created": 1721528435,
          "depth": 1,
          "replies": [
            {
              "id": "le78u2j",
              "score": 1,
              "body": "Crowdstrike's screw-up is front page news around the world. Lots of people got stranded at airports, had surgeries delayed, etc. It's not a minor glitch to be resolved at the corporate IT level.\n\nNormally, the CEOs and Boards of large companies do not pay attention to the inner details of their IT security. Today, Fortune 500 boards who didn't know Crowdstrike from Crowded House are telling their CIO:\n\n\"'My wife and kids got stranded at the airport for **two days**.  *Rip this Crowdstrike thingy out of our computers now!!'\"*\n\nCrowdstrike's loss is Palo Alto Networks' gain.",
              "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le78u2j/",
              "created": 1721550951,
              "depth": 2,
              "replies": []
            },
            {
              "id": "le9u5k4",
              "score": 1,
              "body": "lol you realize that companies especially Microsoft will reduce their relationship with crowdstrike right because if by some chance something lie this happens again Microsoft shareholders will be pissed the company stuck with crowdstrike",
              "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le9u5k4/",
              "created": 1721591066,
              "depth": 2,
              "replies": [
                {
                  "id": "leaif36",
                  "score": 2,
                  "body": "What are you talking about? Crowdstrike is a third party software purchased by companies. They have no relationship with Microsoft.",
                  "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/leaif36/",
                  "created": 1721599413,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "le475id",
          "score": 0,
          "body": "What else is there that can match what cloud strike has done for them over years.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le475id/",
          "created": 1721500193,
          "depth": 1,
          "replies": [
            {
              "id": "le500q5",
              "score": 1,
              "body": "\n\nhttps://www.g2.com/products/crowdstrike-falcon-endpoint-protection-platform/competitors/alternatives#",
              "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le500q5/",
              "created": 1721511083,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "le5d1s5",
          "score": -1,
          "body": "D , Crowdstrike will only exist as a shell of itself after it has to declare bankruptcy cause it can’t cover the losses. Someone will buy up the shell and rename the new company. They will sell the same features.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le5d1s5/",
          "created": 1721516348,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "le3r0wr",
      "score": 13,
      "body": "the other posts were saying buy Blackberry  ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|31225)",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le3r0wr/",
      "created": 1721494277,
      "depth": 0,
      "replies": [
        {
          "id": "le4i12h",
          "score": 3,
          "body": "Your loss",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le4i12h/",
          "created": 1721504293,
          "depth": 1,
          "replies": [
            {
              "id": "le4qcud",
              "score": 1,
              "body": "What’s the bear case against blackberry?   (Besides the fact that they are at a 11 year low, or some shit)",
              "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le4qcud/",
              "created": 1721507410,
              "depth": 2,
              "replies": [
                {
                  "id": "le6v6i8",
                  "score": 0,
                  "body": "The fact bots recommend that garbage every time there is a clear position on another stock, should be all the info you need brotha",
                  "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le6v6i8/",
                  "created": 1721541827,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "le7fpsl",
                  "score": 0,
                  "body": "They’re a shitty company with no clear direction in the middle of a 20 year turnaround plan?",
                  "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le7fpsl/",
                  "created": 1721555918,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "le53sxn",
      "score": 6,
      "body": "You are looking the standard language that crowd strike use. But bigger enterprise clients are often going to push back and negotiate the contract language. Enterprises are not always just going to take the vendors paper and accept it as is, especially when it comes to liability language.",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le53sxn/",
      "created": 1721512569,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le5m3x4",
      "score": 6,
      "body": "Amazon rarely accepts vendors T&C. Assuming they didn’t in this case, I could see Amazon owning CrowdStrike in 6 months.",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le5m3x4/",
      "created": 1721520069,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le46tct",
      "score": 6,
      "body": "'What is the WSB sentiment?'\n\nHow about reading any of the 100 threads about it over the last 24 hours",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le46tct/",
      "created": 1721500066,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le3qm6w",
      "score": 8,
      "body": "Inverse get calls priced in",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le3qm6w/",
      "created": 1721494128,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le4443e",
      "score": 6,
      "body": "Everybody is saying they are toast and to buy puts.  When will you regards learn the do the opposite of the herd.  Calls all day",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le4443e/",
      "created": 1721499069,
      "depth": 0,
      "replies": [
        {
          "id": "le4i64k",
          "score": 4,
          "body": "You haven't been following",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le4i64k/",
          "created": 1721504346,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "le3wwc8",
      "score": 8,
      "body": "I work at a factory for a defense contractor and all the computers that had BSOD are fixed. IT is working the weekend and on site for once, instead of working from home. It’s a quick fix and people who bought overpriced short positions are drastically over exaggerating the severity of this. \n\nAt least I hope so because I want my calls print.",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le3wwc8/",
      "created": 1721496418,
      "depth": 0,
      "replies": [
        {
          "id": "le42nc8",
          "score": 10,
          "body": "The fix isn’t the concern. It’s the billions of dollars lost from multiple companies over one day that is concerning. The upcoming lawsuits will be hell",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le42nc8/",
          "created": 1721498529,
          "depth": 1,
          "replies": [
            {
              "id": "le5nn2f",
              "score": 2,
              "body": "Isn't there insurance for stuff like this?",
              "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le5nn2f/",
              "created": 1721520707,
              "depth": 2,
              "replies": []
            },
            {
              "id": "le4idd1",
              "score": 3,
              "body": "Poster above sounds like they have blinders on",
              "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le4idd1/",
              "created": 1721504422,
              "depth": 2,
              "replies": [
                {
                  "id": "le7ge3u",
                  "score": 1,
                  "body": "The blinders are in the people who just say “it’s so many billions”. No it’s not. \n\nGlobal GDP is $275B daily. Crwd has a lot of exposure but they don’t have exposure to all GDP and this was caught and a fix was implemented pretty quickly.\n\nCompanies that skimped on IT departments to the point they couldn’t deploy the fix in a timely manner are going to be the ones taking the brunt of shit from their customers. For companies like this, they will get something in settlements/negotiations with crowdstrike, but their own negligence means it’s likely to be pennies on the dollar.",
                  "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le7ge3u/",
                  "created": 1721556390,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "le9uld0",
                      "score": 0,
                      "body": "I think you guys dont understand how this stuff works. Companies around the world are going to be wear of just relying on crowdstrike. You know why? One the off chance it happens again—what do they tell their investors? OH YEA WE STUCK WITH CROWDSTRIKE. lol Management do not want to take the fall for crowdstrike potentially screwing up again. Even if the likelihood of that is almost zero—this creates a huge opportunity for Palo Alto networks, Wiz, etc.",
                      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le9uld0/",
                      "created": 1721591210,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "leaf3ks",
                          "score": 1,
                          "body": "I understand exactly how it works. \n\nWhat you guys don't understand is how people with little or not IT or tech knowledge make IT purchasing decisions. The decisions are often made based on relationships with execs/sales teams at other large companies.",
                          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/leaf3ks/",
                          "created": 1721598222,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "leafl2p",
                              "score": 1,
                              "body": "Yes management will tell their it teams to find other vendors. Anything to save their own jobs",
                              "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/leafl2p/",
                              "created": 1721598393,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lek8c19",
                          "score": 1,
                          "body": "I don't think you understand how business works at the C-Suite level. It has shit all to do with the best practices and everything about quid pro quo (Execs at company X personally know and break bread with execs at Crowdstrike) and making backdoor deals for personal gain (whether monetary or career wise). You are using logic in a sea of sharks.",
                          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/lek8c19/",
                          "created": 1721750346,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "le45n21",
          "score": 2,
          "body": "Everyone is acting like Crowdstrike doesn't have insurance.  Like that level of legal proceedings don't take months to initiate. And that though the issue was eye-opening, it's resolved easily and for many cloud connected systems, fixed quickly.\n\nAnyhow, I also jumped on some fire sale calls that I would love to convert into a Rivian (of which I also have calls)",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le45n21/",
          "created": 1721499634,
          "depth": 1,
          "replies": [
            {
              "id": "le9ux9v",
              "score": 2,
              "body": "That’s not the big concern. it’s not the liability that the insurance will cover. It’s more so that IT departments and especially Microsoft MUST reduce their exposure to crowdstrike. You know why? One the (even very unlikely chance) something happens again with Crowstrike, what will management tell their Investors/shareholders? “OH YEA WE STRUCK WITH CROWSTRIKE AFTER THEY CREATED A HUGE GLOBAL IT MELTDOWN” You know what will happen to that management team? They’ll lose their jobs.",
              "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le9ux9v/",
              "created": 1721591318,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "le5oiv6",
      "score": 2,
      "body": "In any normal market situation, it'd be puts all the way. But... it's 2024, so obviously $CRWD will go up for some fuck reason so calls it is.",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le5oiv6/",
      "created": 1721521072,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le6v2gj",
      "score": 2,
      "body": "Wait till they start listing deaths ..",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le6v2gj/",
      "created": 1721541757,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le5mbam",
      "score": 3,
      "body": "Regardless of the contract, Crowd strike is 100% getting sued. \n\nAnd if it gets to a jury trial, I'd bet that at least one juror was directly impacted by the outage.",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le5mbam/",
      "created": 1721520154,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le6cbyt",
      "score": 2,
      "body": "My guess is the really large companies negotiated the contract and the 12 months doesn’t apply to all of the clients. CRWD is Fuk imoa",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le6cbyt/",
      "created": 1721531612,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le57je5",
      "score": 3,
      "body": "Dude companies sign contracts with them. Each one is tailored to the company they are dealing with. You have no clue and I wouldn’t go off what is posted just standard on the site. \n\nI also wonder why all these companies went down. \n\nYes CS made a mistake that they corrected in 1.5 hours. The impact though is all on how you as a company plan for it. \n\nI work for a fortune 5 company that was barely impacted. Because we architected our design to handle for this sort of thing. We also have a whole mirror of production that can be brought online very quickly if shit really hits the fan. It’s called continuity of business, and they all did a piss poor job of it if you ask me.",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le57je5/",
      "created": 1721514091,
      "depth": 0,
      "replies": [
        {
          "id": "le6vxdh",
          "score": 2,
          "body": "It’s called trust but verify, everyone did the first part. The Gartner Magic Quadrant will be my buy/sell indicator.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le6vxdh/",
          "created": 1721542304,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "le4g7j1",
      "score": 2,
      "body": "https://news.sky.com/story/who-will-pay-for-the-worst-it-outage-the-world-has-seen-13181296\n\nA news that explained the muted impact on share price but we should still look at the movement in the coming days.",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le4g7j1/",
      "created": 1721503602,
      "depth": 0,
      "replies": [
        {
          "id": "le4t1d3",
          "score": 3,
          "body": "Insurance premiums will go through the roof\n\nFuture contracts will not limit recompense to 1 year and might prevent insurance caps from preventing the affected company to seek direct compensation from the security provider.\n\nShort term = bad\n\nLong term = probably ok but not as good as it used to be profit wise.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le4t1d3/",
          "created": 1721508405,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ledu7xd",
          "score": 1,
          "body": "Puts go Brrr",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/ledu7xd/",
          "created": 1721657829,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "le78m1j",
      "score": 1,
      "body": "A lot of companies and people damaged by this do not have contracts with Crowdstrike.\n\nAirline passengers, hospital patients, etc.\n\nCrowdstrike is about to get sued up the wazoo.",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le78m1j/",
      "created": 1721550792,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le7r5sa",
      "score": 1,
      "body": "OP analysis is not accurate. There is a damage cap, but it’s not relevant. The relevant language is in the warranty section that covers “Errors” (a defined term).  Unless customers negotiated this out their sole remedy is termination and return of prepaid fees (everything before this event would be earned). \n\n8.2 Product Warranty. If Customer has purchased a Product, CrowdStrike warrants to Customer during the applicable Subscription/Order Term that: (i) the Product will operate without Error; and (ii) CrowdStrike has used industry standard techniques to prevent the Products at the time of delivery from injecting malicious software viruses into your Endpoints where the Products are installed. You must notify CrowdStrike of any warranty claim during the Subscription/Order Term. Your sole and exclusive remedy and the entire liability of CrowdStrike for its breach of this warranty will be for CrowdStrike, at its own expense to do at least one of the following: (a) use commercially reasonable efforts to provide a work-around or correct such Error; or (b) terminate your license to access and use the applicable non-conforming Product and refund the prepaid fee prorated for the unused period of the Subscription/Order Term. CrowdStrike shall have no obligation regarding Errors reported after the applicable Subscription/Order Term.",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le7r5sa/",
      "created": 1721563213,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lea1uhg",
      "score": 1,
      "body": "They must have liability insurance?????",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/lea1uhg/",
      "created": 1721593649,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ledj64g",
      "score": 1,
      "body": "Lawyers probably filing suit right now. 12 mos my ass",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/ledj64g/",
      "created": 1721653666,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leduaju",
      "score": 1,
      "body": "Puts go Brrr",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/leduaju/",
      "created": 1721657855,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lehzgx3",
      "score": 1,
      "body": "My takeaway in all these blunder bruhaha is it seems that Crowdstrike had a monopoly in the Cyber security space and why the hell where they allowed that?\n\nAren't there other Vendors that Microsoft can partner with or CRWD \"it is only worth it if it had 500 hooker in it! as what was said in better call Saul about this yellow suzuki esteem's worth.\n\nOr Microsoft is such an incel it swiped right immediately upon seeing crowdstrikes images?\n\nThe SEC should light up their Arses as to why Microsoft and Crowdstrike had such an anomalous contract and people should class action sue these clowns.\n\nMeanwhile, buy the dip and enjoy the ride ya'll",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/lehzgx3/",
      "created": 1721711036,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezbo5f",
      "score": 1,
      "body": "You think their contract gives immunity to gross negligence? LOL",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/lezbo5f/",
      "created": 1721965030,
      "depth": 0,
      "replies": [
        {
          "id": "lf7xk68",
          "score": 0,
          "body": "It’s not about what I think mate, it’s about me and other people who are interested to make money from this.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/lf7xk68/",
          "created": 1722103014,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "le45zra",
      "score": 1,
      "body": "They will provide credits to their customers and then move on.",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le45zra/",
      "created": 1721499763,
      "depth": 0,
      "replies": [
        {
          "id": "le4tsu1",
          "score": 1,
          "body": "![img](emote|t5_2th52|4267)",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le4tsu1/",
          "created": 1721508693,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "le3xj7a",
      "score": -2,
      "body": "Why do companies use crowd strike? Genuine question. What does their product do? What were they using before crwodstrike?",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le3xj7a/",
      "created": 1721496649,
      "depth": 0,
      "replies": [
        {
          "id": "le43lrc",
          "score": 10,
          "body": "Crowdstrike is an Endpoint Detection and Response, or EDR; think antivirus for corporations. Before crowdstrike many EDR’s would find viruses by looking for signatures, which is looking for known viruses. Crowdstrike aggregates data at truly unimaginable scales to find new threats that haven’t been seen.\n\nOld EDR’s are like cops looking for crimes committed exactly the same way every time. Crowdstrike is like detectives looking for new things happening with immense knowledge.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le43lrc/",
          "created": 1721498883,
          "depth": 1,
          "replies": []
        },
        {
          "id": "le3z8tl",
          "score": 3,
          "body": "This is a dumb lazy question that you can easily google and answer yourself.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le3z8tl/",
          "created": 1721497278,
          "depth": 1,
          "replies": [
            {
              "id": "le42l1x",
              "score": 9,
              "body": "Bro,please.. Don't tell a regard that he is a regard. Have some decency.![img](emote|t5_2th52|4260)",
              "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le42l1x/",
              "created": 1721498505,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "le3zob0",
      "score": 0,
      "body": "The night is darkest just before the dawn. I think CRWD will dip in the short term but by next year this will be a thing of the past. The company is still extremely young and has more than enough time to rebound but with that being said they absolutely can never let anything like this happen again. Bullish",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le3zob0/",
      "created": 1721497438,
      "depth": 0,
      "replies": [
        {
          "id": "le4ne2f",
          "score": 4,
          "body": "Extremely young? It was founded 2011…",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le4ne2f/",
          "created": 1721506301,
          "depth": 1,
          "replies": [
            {
              "id": "le4qvyf",
              "score": 1,
              "body": "Yes…. You think 13 years is a long time for a company?? Cmon man",
              "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le4qvyf/",
              "created": 1721507607,
              "depth": 2,
              "replies": [
                {
                  "id": "le6v3lg",
                  "score": 4,
                  "body": "What do you call a 5 old Company? Ultra mega extremely young?\n\nI agree it’s young. Not extremely young.",
                  "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le6v3lg/",
                  "created": 1721541777,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "le57t10",
      "score": 0,
      "body": "Microsoft is going to come up with some competitive alternative because a ton of people still think this was a Microsoft issue.  Or maybe Amazon will. Either way one of the giant tech companies will come up with an alternative because Crowd strike showed they can shit the bed.",
      "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le57t10/",
      "created": 1721514200,
      "depth": 0,
      "replies": [
        {
          "id": "le7gltn",
          "score": 1,
          "body": "They won’t come up with a solution, one of the big tech companies are just going to buy Crowdstrike at some point. Then it’s up to antitrust regulators to see if it goes through.",
          "permalink": "/r/wallstreetbets/comments/1e7zyy5/crowd_strike_liability_for_the_outage_and_stock/le7gltn/",
          "created": 1721556541,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}