{
  "title": "Starbucks (SBUX) DCF Analysis",
  "score": 113,
  "selftext": "# Introduction:\n\nSBUX is the most recognized coffee chain globally, serving up millions of coffee daily. SBUX has been dominating the specialty market and continues to be the largest player in the market, largely due to the branding that SBUX has built. However, recently, SBUX’s overall revenue has been down due to a fall in same-store sales, partially offset by net new store growth. This decline in same-store sales is heavily attributable to the NA and China markets. With multiple issues such as consumers trading down and strong rivals such as Luckin Coffee and Dunkin' competing for SBUX's market share.\n\n\n\n# Market:\n\n*Australia*  \nSBUX opened up too quickly in Australia, not giving Australian consumers time to adapt and develop an appetite for SBUX. SBUX Australia also tried to copy and paste the coffee culture that worked in America to Australia, leading to a lack of personalization to local taste buds. There was also a strong competitor, Gloria Jeans that did the exact opposite of SBUX. They opted for slower more organic growth to show respect to the coffee culture of Australia. This led to the locals being more fond of Gloria Jeans and that combined with the cheaper prices of Gloria Jeans eventually gave Gloria Jeans the lead over SBUX.\n\n*China*  \nOne of the largest markets in which SBUX operates is the Chinese market. SBUX has managed to integrate very well into the Chinese market especially because the Chinese market has a very strong tea drinking culture. In China, SBUX is seen as a luxury item given the high prices that SBUX charges relative to citizens' income. SBUX is even seen as a status symbol as consumers would carry their SBUX cups and display them in public as a way of showing off. However, SBUX has run into a very strong local competitor “Luckin Coffee”. Luckin Coffee has been able to pursue very rapid growth in part due to its lean business model, opting for a smaller store size and for consumers to be able to complete the entire transaction through the app. This has allowed Luckin to employ a lesser number of employees, achieve higher margins, and reinvest more back into the business. China is a market that places heavy emphasis on novelty, people would like to buy new trendy things to flaunt.\n\n\n\n# Revenue:\n\n*Overall*  \nSBUX plans to pick up business in NA through initiatives such as “Morning Daypart”, better value offerings, and newer product innovation.\n\n*Morning Day Part*  \nMorning Daypart is when SBUX is the busiest and a very significant chunk of their revenue comes from here. SBUX noticed that 60% of orders from this part of the day are through mobile orders, however, there is a large cart abandonment rate due to customers being unwilling to wait. SBUX plans to resolve this by increasing operational efficiency by increasing the usage of machinery and product availability (Popular products out of stock). SBUX also believes that there are other parts of the day with untapped potential such as overnight from 5 pm to 5 am and weekends (when families usually would visit).\n\n*Better Value Offerings*  \nSBUX also hopes to increase the value of being a Starbucks Rewards member through initiatives such as In-app offers and a better wait time algorithm, they hope that through these initiatives SBUX can convert the “Occasional Consumer” into a loyal customer. Plus, the data collected from Starbucks Rewards can be processed by SBUX’s machine learning algorithm, Deep Brew AI allowing for a more personalized experience.\n\n*Newer Product Innovation*  \nSBUX hopes that through new product innovation, it can attract a new demographic of customers and retain existing customers. It plans to half its innovation pipeline from 12 to 18 months, introduce a new zero-sugar energy drink, and healthier options such as lower calories on existing products or plant-based options.\n\n\n\n*Company Operated*  \nWhen forecasting Company Operated Stores, I believe that SBUX’s “Purpose Driven” growth means that SBUX will not pursue rapid store count expansion due to the lack of suitable talent. SBUX’s innovations in machinery will allow it to mitigate this lack of suitable talent, however as SBUX is a specialty coffee where consumers are paying a premium for the experience of witnessing a skillful barista brew a high-quality cup of coffee, I believe that company-operated stores will not experience very rapid growth for SBUX to have the right balance between human talent and machinery. In my base case, I forecast SBUX to grow slightly lower than the historical rate to avoid cannibalizing profits and diluting SBUX’s brand value. However, SBUX has a growth plan for emerging markets, but I argue that SBUX charges a very high premium for its products to be appealing to locals.\n\nWhen forecasting Revenue/Store, given the current tough macro-environment I believe that slower growth will persist for the next 2 years for the macro-environment to have any meaningful improvement, increasing the likelihood that consumers will be more willing to purchase luxury goods such as SBUX. I believe that SBUX has slight pricing power due to the unique nature of its products allowing it to raise prices to a limited extent and the increasing chances of reaching a larger audience which translates into higher transaction volume. On top of that, I believe that SBUX’s constant innovation and promotion of their food attach will increase total ticket size. In perpetuity, I forecast that Revenue/Store will grow in line with the perpetual inflation rate. \n\n*Licensed*  \nWhen forecasting %Franchised, according to Howard Schultz “It would have been hard to provide the level of sensitivity to customers and knowledge of the product needed to create those Starbucks values if we franchised.”([~SOURCE~](https://www.entrepreneur.com/franchises/you-cant-buy-a-starbucks-franchise-heres-why-and-what/311377)) this shows that SBUX maintains very stringent QC and criteria for their licensee. However, given that SBUX is very reliant on its Chinese licensee due to local laws in China, plus China is a huge part of SBUX’s future growth plans. I forecasted %Franchised to taper slightly downwards with respect to historical averages.\n\nWhen forecasting Revenue/Store, given that SBUX has a very stringent QC process and is very selective about their licensees, it gives SBUX high bargaining leverage that translates into high pricing powers. I believe that Revenue/Store will grow at an elevated rate before tapering to grow in line with the perpetual inflation rate. However, this rapid growth rate is moderated by SBUX ensuring that it does not reduce the economic viability of a Starbucks Store through excessive profit-sharing arrangements.\n\n*Others*  \nOthers refer to other items sold by SBUX such as serveware and ready-to-drink beverages. Given that the success of Others is hinged on SBUX’s stores, opting for less granularity I forecasted it as a % of total store sales.\n\n\n\n# Cost:\n\n*COGS*  \nWhen forecasting COGS, given that SBUX has a mature supply chain where there is less room for significant swings in costs. So, opting for less granularity I forecasted it as a % of historical averages. \n\n*Store Operating Expense*  \nWhen forecasting Store Operating Expense, I believe that SBUX’s initiatives to improve efficiency through Machinery and Digitization of their stores will allow SBUX to enjoy cost savings over time. \n\n*Others*  \nWhen forecasting Others, opting for less granularity I forecasted it as a % of historical averages. \n\n*G&A*  \nWhen forecasting G&A, given that SBUX has proactively raised wages and reinvested back into its employees through multiple initiatives such as sponsoring online degrees, stock ownership, and comprehensive health insurance. I believe that G&A will increase over time due to these initiatives.\n\n\n\n# CapEX and D&A:\n\n*CapEX*\n\nWhen forecasting CapEX, taking into account “We expect our capex in fiscal year 2024 to be approximately 3 billion… targeting an approximate 50% dividend payout ratio” - 2023 Q4 Earnings conference.\n\n*D&A*\n\nWhen forecasting D&A, opting for less granularity I forecasted it as a % of historical averages.\n\n\n\n# WACC:\n\n10Y T Bond Yield (1M Avg) = 4.25%  \nBeta ([~SOURCE~](https://finance.yahoo.com/quote/SBUX/)) = 0.94  \nStable Market ERP ([~SOURCE~](https://pages.stern.nyu.edu/~adamodar/New_Home_Page/datafile/ctryprem.html)) = 4.60%  \nCOE = 8.57%  \nSBUX is rated “BBB”  \nCOD (1M Avg) = 5.54%  \nMarginal Tax Rate = 21.00%  \nAT COD = 4.38%\n\nStock Price (5D Avg) = $77.11  \nShares O/S = 1136.7M  \nMarket Value of Equity = 87650.94M  \nWeighted Average Maturity of Debt = 10 Years  \nFY23 Interest Expense = 550.1M  \nMarket Value of Debt = 14509.32M\n\n%Debt = 14.20%  \n%Equity = 85.80%  \n%WACC = 7.98%\n\n\n\n# Conclusion:\n\nUltimately in my base case, I value SBUX at $65.74 per share. I believe that despite the recent poor financial results which reduced SBUX's stock price by \\~14%, the stock price is still overvalued. I believe that investors are overly fixated on the high AUV and low payback of each new store opened, they believe that SBUX can maintain this high AUV for every subsequent location it opens in. However, I do not believe that this historic number can be maintained over time. The reason is that the initial locations were deliberately picked because they had very high potential for high AUV, however as opportunities for potentially high AUV locations dry up, SBUX's AUV will decline. And, there is a very large risk of cannibalizing profits amongst SBUX chains.\n\nBase Case: \\[[INSERT](https://imgur.com/a/BuxzhDl)\\]  \nBest Case: \\[[INSERT](https://imgur.com/a/9XZ6mrR)\\]  \nWorst Case: \\[[INSERT](https://imgur.com/a/dKKuuVF)\\]  \nRevenue Model: \\[[INSERT](https://imgur.com/a/rUW1Plw)\\]  \nCost Model: \\[[INSERT](https://imgur.com/a/IWprAuk)\\]  \nChange in NWC Schedule: \\[[INSERT](https://imgur.com/a/7CrAVVq)\\]  \nSanity Check: \\[[INSERT](https://imgur.com/a/Pi6APqP)\\]  \nDebt Schedule: \\[[INSERT](https://imgur.com/a/7ZuoXkv)\\]\n\n",
  "link_flair_text": "Company Analysis",
  "id": "1e8kahc",
  "num_comments": 34,
  "created_utc": 1721561665,
  "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/",
  "comments": [
    {
      "id": "le87b3f",
      "score": 82,
      "body": "The most work I have ever seen on a dd on reddit",
      "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/le87b3f/",
      "created": 1721570691,
      "depth": 0,
      "replies": [
        {
          "id": "leac6vl",
          "score": 40,
          "body": "Too bad the model is wrong.  Starbucks puts non-cash lease expenses in a separate account from D&A, which op doesn’t include in his model. OP includes cash flow from operating lease liabilities. Effectively, his model shows the outflow of cash to leases, but does not recognize the cash-increasing amortization of those leases. So his increase in net working capital is way too high for every year. \n\nE.G., Starbucks had $6B of cash from operations in 2023 from their 10-k. That’s after changes in net working capital. They had $2.3B in capex. UFCF is CFO-investment. UFCF should be about $3.7B for 2023. OP’s model shows $2.3B in UFCF for 2023, which is way off. \n\nAnd Starbucks’ current net working capital is $1B. Is it reasonable to assume that will increase 50x in the next 15 years like OP’s model shows?  \n\nThe fact no one has noticed such an obvious error is telling of the quality of this sub these days.",
          "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/leac6vl/",
          "created": 1721597181,
          "depth": 1,
          "replies": [
            {
              "id": "lei1qw2",
              "score": 7,
              "body": "And so people will learn. You did well explaining what was missing and many will appreciate it. Don't see the need to be an asshole about it though.",
              "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/lei1qw2/",
              "created": 1721712309,
              "depth": 2,
              "replies": []
            },
            {
              "id": "leaw570",
              "score": 2,
              "body": "good points",
              "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/leaw570/",
              "created": 1721604606,
              "depth": 2,
              "replies": [
                {
                  "id": "lebdalo",
                  "score": 6,
                  "body": "Which gets to the second-order problem:  despite cash flows at a little over half what they should be, OP still gets within 20% of the trading price.  In part because his base case growth assumptions are double IBES or capIQ consensus estimates for the next three years.  Morningstar has revenue growth for the next three years a 2%, 6%, and 9.5%. OP has 11%, 10.5%, and 13.5%.  Starbuck’s own issued guidance is “low single digit” revenue growth for 2024.  All of this points to low revenue growth for 2024. But OP penciled in 11% anyways. Even his worst case has multiple times higher revenue growth than Starbucks’ own guidance. \n\nIt feels like OP looked at the answer he wanted and tweaked the assumptions until the model got close.  And he had to disregard Starbucks’ own guidance to get there, which doesn’t make for a very useful model.",
                  "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/lebdalo/",
                  "created": 1721611413,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lebebs9",
                      "score": 1,
                      "body": "True. Garbage in garbage out, or GIGO. \n\nI had an idea to build a stock community for retail where we build crowdsourced institutional grade financial models and investment reports / DDs, as a way to give retail a better chance to make informed investment decisions. Like a Wikipedia for high quality investment analyses. \n\nBut the issue is that it’s a lot of work to create that level of analysis and easy to get wrong, and easy to decide on a price and screw with the numbers to rationalize it.",
                      "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/lebebs9/",
                      "created": 1721611841,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lg93tn3",
              "score": 1,
              "body": "I’m not mentally thorough enough to know if you’re right or how obvious that is, but I am just good enough to notice the lack of pushback even with replies when this is a reply to a top comment is a good indicator.",
              "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/lg93tn3/",
              "created": 1722658626,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "le873zw",
      "score": 25,
      "body": "You left out the dozens of new coffee chains popping up in the US - scooters, cosmc, Dutch brothers, 7 brew, black rock coffee, the list is endless",
      "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/le873zw/",
      "created": 1721570612,
      "depth": 0,
      "replies": [
        {
          "id": "le8hj23",
          "score": 12,
          "body": "Black Rock is the shit yo. We stopped going to StarBucks because 1 the price is way too high, and 2 there's way too much sugar in their drinks. \n\nWe always pass up SB and drive an extra 10mins to go get Black Rock coffee, that's how much we like it.\n\nDutch Bros just came to Texas, I was excited because I'm from Oregon and it's the first time I've seen them in like 20 years. We stopped there once and had a drink and about passed out because of the sugar content. Probably the highest I've ever had. I'm not diabetic or anything but I may as well have just eaten sugar honestly. \n\nScooters is pretty good too. Black Rock also serves Taco Deli until 11",
          "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/le8hj23/",
          "created": 1721574441,
          "depth": 1,
          "replies": [
            {
              "id": "leayzav",
              "score": 3,
              "body": "Non-american question, is that chain related to Blackrock?",
              "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/leayzav/",
              "created": 1721605699,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lehmf37",
          "score": 2,
          "body": "Ok, everyone keeps mentioning BROS but are they really going to take customers from SBUX? I live in So Cal and am not as familiar with it. Everyone says lines are long but service is slow. I’ve not heard any of the other names either.",
          "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/lehmf37/",
          "created": 1721704682,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "le81cx5",
      "score": 17,
      "body": "Good analysis but you do not mention the unionization. More and more stores join the union, which in return would limit the agility of the stores and may affect the bottom line.\n\nAlso, the competition is growing in both NA and overseas (some fast food chains invest heavily in coffee business increasing their offerings), while the economic conditions are also not quite there yet.\n\nAll of those could affect the margins and therefore not helping the financials.",
      "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/le81cx5/",
      "created": 1721568223,
      "depth": 0,
      "replies": [
        {
          "id": "leb3kqt",
          "score": 2,
          "body": "The union issues is a real headwind that should be accounted for.",
          "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/leb3kqt/",
          "created": 1721607501,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "le95mg9",
      "score": 11,
      "body": "Starbucks is getting rid of indoor seating in North America.  A coffee shop without seating.......",
      "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/le95mg9/",
      "created": 1721583022,
      "depth": 0,
      "replies": [
        {
          "id": "leiisb3",
          "score": 2,
          "body": "Bs, source? (Im ballsdeep in sbux)",
          "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/leiisb3/",
          "created": 1721723129,
          "depth": 1,
          "replies": [
            {
              "id": "lejx55q",
              "score": 1,
              "body": "The newly remodeled store in my neighborhood and my son who works there.  And note, there is no drive through and it is big enough. Prior to remodeling there were 5 or so tables.  Minimal homeless population.\nhttps://www.google.com/search?client=firefox-b-1-d&q=starbucks+removing+seating+in+stores",
              "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/lejx55q/",
              "created": 1721746786,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "le99bd5",
          "score": -11,
          "body": "Downvote because???????",
          "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/le99bd5/",
          "created": 1721584305,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leal2gp",
      "score": 3,
      "body": "I think for the cheaper countries, they all have alternative cheaper coffee options.  People see StarBux more of a luxury brand there since its coffee/food is much more expensive than others.",
      "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/leal2gp/",
      "created": 1721600403,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lebpybi",
      "score": 2,
      "body": "I am more worried about the China situation for SBUX honestly. I don’t like them doubling down on China right now.",
      "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/lebpybi/",
      "created": 1721616703,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le89ijq",
      "score": 3,
      "body": "Didn't expect this from u/Hanzoisbad. Good post, though, thanks for that.",
      "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/le89ijq/",
      "created": 1721571539,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le8mwg3",
      "score": 4,
      "body": "A newbie here, how do you put the actual analysis in Excel together",
      "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/le8mwg3/",
      "created": 1721576351,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leced03",
      "score": 1,
      "body": "God damn I miss posts like this; very pre-2020 of you. Kudos & upvoted. \n\nToo bad I didn’t buy BROS earlier this year",
      "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/leced03/",
      "created": 1721629560,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf3dj1t",
      "score": 1,
      "body": "Agree with your rationale - Puts already loaded for Tuesday. Thank you for the detailed DD.",
      "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/lf3dj1t/",
      "created": 1722027312,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leawkzi",
      "score": 1,
      "body": "Great DD but my gf’s nieces both love Dutch Bros now.  They are my gen Z tastemakers and I think there are many like them.  Starbucks just isn’t cool anymore which is death if your sales are based on a meme.",
      "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/leawkzi/",
      "created": 1721604774,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le9r3vx",
      "score": 0,
      "body": "Great detailed work, I think you were kind with 65 dollar price.  They forecast more slowing this quarter and $50 price will be high.  Shrinking businesses get very low multiples.  6 or 8 p/e's are common.  Whats walgreens p/e right now 4 or 5.  Ceo will need a credible turnaround plan and then execute on it for at least a quarter or two before stock starts moving up",
      "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/le9r3vx/",
      "created": 1721590048,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lebnzh6",
      "score": 0,
      "body": "I wouldn’t go long SBUX. Massive H&S on 1D.",
      "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/lebnzh6/",
      "created": 1721615868,
      "depth": 0,
      "replies": []
    },
    {
      "id": "le9h2fm",
      "score": -2,
      "body": "Question: why are you trying to forecast UFCF out through 2036 instead of just forecasting out 3 - 5 years (reducing your margin of error) and relying on a peer comp terminal value multiple? Seems like an easy way to punt far-dated (and volatile) assumptions away from your own estimates and relying on what the market things vis-a-vis industry comp trading multiples....\n\nI dropped [SBUX into a DCF template I have saved down](https://imgur.com/a/VbWqwzG) on my work PC and arrived at ~$100 / share\n\nAlso - by just using a flat \"opex\" line item, you're including DD&A (nor any tax benefits to cashflow vis-a-vis timing differences) which I'm pretty sure is throwing off your near term cashflow math in the OP",
      "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/le9h2fm/",
      "created": 1721586822,
      "depth": 0,
      "replies": [
        {
          "id": "lecz5u2",
          "score": 1,
          "body": "If I were to use only 3-5 years it wouldn’t account for the recent reinvestments made by SBUX to grow their earnings, especially given the double digit y/y increases in revenue lately to use 3-5 years would be giving too little of a runway to account for SBUX current high growth period. \n\nI believe SBUX still has untapped potential like emerging markets which it has announced plans to enter before it can reach stable growth I.e. when I apply my TGR.\n\nI believe a peer comp multiple as my TV will grossly undervalue SBUX as they are likely to have a significantly different multiple from their competitors given how they are the market leader in the speciality coffee market by a very very large margin.",
          "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/lecz5u2/",
          "created": 1721643661,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "le7z83u",
      "score": -15,
      "body": "$BROS is going to dominate $SBUX. \n\nPlus, Starbucks burns their beans.",
      "permalink": "/r/stocks/comments/1e8kahc/starbucks_sbux_dcf_analysis/le7z83u/",
      "created": 1721567275,
      "depth": 0,
      "replies": []
    }
  ]
}