{
  "title": "$SCHW and market irrationality? ",
  "score": 50,
  "selftext": "Schwab stock had a rough week, to say the least, given that it’s down 17.33%. My thing is, I really can’t see any practical reason as to why. Financially-speaking they either met, or fell just short/above expectations. From what I understand, the big thing was that they decided to pause buybacks to focus on paying down their debt, which apparently was horrible enough news to warrant a pullback like this. \n\nPersonally, I’d almost expect the opposite to happen. I wouldn’t expect a massive gain from it or anything, but I can’t see this as anything but a positive in the long run. Yes, you could make the argument that pausing the buybacks can take away from investors’ immediate returns, but less debt now translates to a stronger balance sheet overall and freeing up more capital to potentially return to shareholders later, either via dividends or a strengthened buyback program. \n\nAll that said, personally, I’d say that a good chunk of the drop was due to panic selling. Larger moves aren’t seen very often in stocks like SCHW, and when they do happen, they’ll usually trigger a temporary up/downturn. Investors saw a larger-than-average drop on earnings, which soured sentiment, and led to a larger selloff. \n\nOf course I’m open to other opinions, if you can see something I can’t I’d love to hear it. ",
  "link_flair_text": "Company Discussion",
  "id": "1e8zdw4",
  "num_comments": 28,
  "created_utc": 1721603461,
  "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/",
  "comments": [
    {
      "id": "leauqur",
      "score": 35,
      "body": "It’s cause they said they need to scale down. Accts up, but overall growth came up short.",
      "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/leauqur/",
      "created": 1721604065,
      "depth": 0,
      "replies": [
        {
          "id": "lebl8ks",
          "score": 9,
          "body": "Exactly this.\n\n\nA CEO doesn't say something like this lightly.\n\nIt could even mean the end of Schwab as we know it with divestments. Or even an acquisition.    \nLook at CS.\n\nThe uncertainty is what caused the drop.\n\nIt's best to stay away until it's clear what exactly it means to be smaller.",
          "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/lebl8ks/",
          "created": 1721614715,
          "depth": 1,
          "replies": [
            {
              "id": "lebpitu",
              "score": 13,
              "body": "Isn’t it just the banking section of the company that’s going poorly? The brokerage side seems to be doing well, unless I’m confused.",
              "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/lebpitu/",
              "created": 1721616520,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lebpscg",
              "score": 11,
              "body": "It was actually not what he said and was clarified the next day (same day he loaded up on shares himself).  His point - articulated poorly on the call - seems to have been about laying off a lot of risk onto other banks. That was somehow interpreted as moving depositors to other banks.",
              "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/lebpscg/",
              "created": 1721616631,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "leauomk",
      "score": 29,
      "body": "I bought some more on the dip. The part of the business that they are downsizing is low margin and high risk, seems like it will make the company more profitable in the long run.",
      "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/leauomk/",
      "created": 1721604041,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leblfqj",
      "score": 14,
      "body": "I think the question if it should be valued as bank.  Its P/E is 25+ and most banks are valued at 15 below.  If the market decides to value it as a bank then it is overvalued so the question you need to ask do you think it should keep its premium. I think the bank valuation noise is going to be there for awhile",
      "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/leblfqj/",
      "created": 1721614799,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lebc8xh",
      "score": 12,
      "body": "The comments of scaling down the banking side is what did it.\n\nPlus the buybacks weren't resumed.\n\nSeems kind of strange to scale down banking side when you buy TD Ameritrade and all the other acquisitions.\n\nNot sure if I want to buy more or not now. I was really bullish and thought they could get bigger and bigger.",
      "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/lebc8xh/",
      "created": 1721610984,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leb9j1h",
      "score": 6,
      "body": "They’re trying to run a better business but market read “slow” and panicked. You’re not buying a business like SCHW for 1 year. You’re buying it for 5-10+. I’m adding more",
      "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/leb9j1h/",
      "created": 1721609871,
      "depth": 0,
      "replies": [
        {
          "id": "lec3oir",
          "score": 2,
          "body": "I've held schw since 1995.",
          "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/lec3oir/",
          "created": 1721623280,
          "depth": 1,
          "replies": [
            {
              "id": "lenldmc",
              "score": 1,
              "body": "1 share of stock for 30 years.",
              "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/lenldmc/",
              "created": 1721792111,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ledm00s",
      "score": 3,
      "body": "They are scaling down Schwab Bank over the next few years, but it accounts for a big chunk of their profit. Stock holders didn't like that. BTW, they are not in financial trouble. The stockholders just disagreed with what the CEO is doing.",
      "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/ledm00s/",
      "created": 1721654788,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lebmg6e",
      "score": 2,
      "body": "Yea seems cheap for long term",
      "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/lebmg6e/",
      "created": 1721615221,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leazqhg",
      "score": 3,
      "body": "I’m personally looking into opening a position. It’s still a very profitable company and has a solid dividend . I’m not a financial expert it has a P/E ratio of 25, which is still high for a mature financial company. Also, their app and website it much worse than other brokerage firms",
      "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/leazqhg/",
      "created": 1721605992,
      "depth": 0,
      "replies": [
        {
          "id": "leb700m",
          "score": 5,
          "body": "The app has nothing to do with this lol",
          "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/leb700m/",
          "created": 1721608853,
          "depth": 1,
          "replies": [
            {
              "id": "leb7we3",
              "score": 1,
              "body": "Just putting it out there",
              "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/leb7we3/",
              "created": 1721609214,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lebnxyz",
      "score": 2,
      "body": "They were doing the same thing like Morgan Stanley. They were telling their clients to sit in cash. The head of Morgan Stanley Investment arm \"resigned.\" 15 companies were proping up the S&P 500. It's hard for investors to like a company that was bearish during one of the better bull markets in recent times.",
      "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/lebnxyz/",
      "created": 1721615851,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leav0hi",
      "score": 2,
      "body": "[https://www.investopedia.com/charles-schwab-stock-sinks-as-ceo-says-firm-will-get-smaller-8678595](https://www.investopedia.com/charles-schwab-stock-sinks-as-ceo-says-firm-will-get-smaller-8678595)",
      "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/leav0hi/",
      "created": 1721604170,
      "depth": 0,
      "replies": [
        {
          "id": "leayjmj",
          "score": 3,
          "body": "*Schwab plans to rely on off-balance sheet deals with outside partners to hold customers' deposits in order to more efficiently use capital, Bettinger said on the company's second-quarter earnings call, according to a report from Bloomberg.*\n\nI wonder what this means and what the point of it would be?",
          "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/leayjmj/",
          "created": 1721605529,
          "depth": 1,
          "replies": [
            {
              "id": "leht7u7",
              "score": 1,
              "body": "Rehypothecation. Provides greater financial flexibility, also they can now bump up their marketing around the amount of deposits being insured since they will now be diversified across their partners. \n\nIf this is what the market reacted too it would be  really odd. It would be analogous to a tech company saying they’re moving off internal servers to Amazon and Azure. \n\nIf anything, I think the decline was more so the disappointed with progress on the TD Ameritrade purchase, and that they missed their new accounts growth target by 10%.",
              "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/leht7u7/",
              "created": 1721707809,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lehs85u",
      "score": 1,
      "body": "The CEO just bought $2.5m shares of SCHW on Friday.\n\nThats a green light for me",
      "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/lehs85u/",
      "created": 1721707326,
      "depth": 0,
      "replies": []
    },
    {
      "id": "let2td1",
      "score": 1,
      "body": "U seriously wrote this DD and are not aware of the CEOs statement of scaling down going forward?!",
      "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/let2td1/",
      "created": 1721872756,
      "depth": 0,
      "replies": [
        {
          "id": "lfew9az",
          "score": 1,
          "body": "CEO issued clarifying statement that it wasn't \"scaling down\". But playing accounting games to offload customer deposits from on their books directly to third party banks but it would still be money under the schwabs system. It's basically what Fidelity does, their cash handling is via \"UMB Bank\".\n\nPart of the problem is money sitting \"on the side\" in Schwab is sweeped into \"Schwabs Bank\". When the fed rate sucked, people would just let it sit there because MMFs and Treasuries sucked anyway. Schwabs however could take that money and make loans just like the bank it was. Once rates shot up, suddenly people moved alot of money from the sweep into MMFs and treasuries. This caused Schwabs to suddenly need to plug holes in their banks balance sheet. Ultimately they see it as a pain point to stuff themselves with sweep money and are most likely looking to third party it instead.",
          "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/lfew9az/",
          "created": 1722210908,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lec6oge",
      "score": 1,
      "body": "It's because they were already overvalued (and still are). They have a higher P/E ratio than IBKR despite Schwab's poor reputation, regulatory sanctions, and having more debt with less cash. And IBKR's earnings are growing more steadily.",
      "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/lec6oge/",
      "created": 1721624921,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lefzt6k",
      "score": 1,
      "body": "You aren’t reading between the lines. If they are paying down debt instead of buying stock it means they are approaching creditor issues",
      "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/lefzt6k/",
      "created": 1721682736,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lebinrq",
      "score": -2,
      "body": "Case study right there on ignoring your customers wants",
      "permalink": "/r/stocks/comments/1e8zdw4/schw_and_market_irrationality/lebinrq/",
      "created": 1721613634,
      "depth": 0,
      "replies": []
    }
  ]
}