{
  "title": "Dad permanently blinded by Ozempic...tl;dr Long LLY, short NVO",
  "score": 530,
  "selftext": "Edit: For those that are having trouble reading the headline message - people are not going to stop taking GLP-1 drugs because of a rare, severe side effect. But people will switch from Ozempic to Mounjaro if the side effects  are asymmetrical.\n\nNews of Ozempic causing sudden blindness went under the radar recently because people don't know that this isn't diabetic retinopathy. It's a stroke in the eye that often causes permanent blindness. Dad was just hospitalized last week.  This also isn't a small issue - we're talking about 5-10% of people in the test group in a 3 year period.\n\nSee studies below:\n\n[https://www.statnews.com/2024/07/03/ozempic-wegovy-naion-vision-loss-study/](https://www.statnews.com/2024/07/03/ozempic-wegovy-naion-vision-loss-study/)\n\n[https://www.goodrx.com/classes/glp-1-agonists/can-semaglutide-cause-eye-problems](https://www.goodrx.com/classes/glp-1-agonists/can-semaglutide-cause-eye-problems)\n\nIt's currently only tied to Ozempic and not Mounjaro. Class action already started and I'm predicting more momentum as news of this study picks up and those that have already gone blind realized what actually happened (none of my dad's doctors were aware of the linkage). With Mounjaro/Zepbound stock coming back and more effective weight loss results (and don't seem to be blinding people so far), there's going to be very little reason to pick up Ozempic any time soon. El Lilly is going to take the king spot for some time and the next catalyst will be an oral pill (earliest Phase III completions seem over a year out) or Retatrutide (also owned by LLY).\n\nFor those stating the obvious that fat and diabetic people go blind more often; read the study. It's a peer-reviewed Harvard study... people with Ozempic are going blind with eye strokes more often than people that are staying fat and diabetic. It's a big deal.",
  "link_flair_text": "potentially misleading / unconfirmed",
  "id": "1e930pd",
  "num_comments": 239,
  "created_utc": 1721614291,
  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/",
  "comments": [
    {
      "id": "lecdme3",
      "score": 562,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lecdme3/",
      "created": 1721629085,
      "depth": 0,
      "replies": [
        {
          "id": "lecilov",
          "score": 283,
          "body": "He's completely ignoring the fact that the study is 8% of people that saw a neuro-ophthalmologist at a single specialist health centre. \n\nThis isn't anything like 8% of the general population and much closer to 0.04% if it holds true vs 0.01% natural risk.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lecilov/",
          "created": 1721632336,
          "depth": 1,
          "replies": [
            {
              "id": "leeh01s",
              "score": 83,
              "body": "If 1 in every 2500 people on a drug go blind, that's noteworthy and worth pretty big investigation and scrutiny.",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leeh01s/",
              "created": 1721665388,
              "depth": 2,
              "replies": [
                {
                  "id": "lefii82",
                  "score": 19,
                  "body": "Agreed. It kind of seems like an example here of people who don't understand statistics.\n\nTo put it another way, there's 8.8 million people who live in New York City. 1/2500th of that is 3,520 people, so considering how many people seem to be using the drug it could add up quick.",
                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lefii82/",
                  "created": 1721677277,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "leg31n1",
                      "score": 19,
                      "body": "880 of those 3520 would already go blind given the base incidence rate of the disease. The increase is noteworthy for sure if it actually holds true for normal samples of semaglutide patients. Even then though it's easily offset by the cardiac/stroke risk reductions that are both much more common lifetime issues and much more reliably demonstrated by current studies of the drug.",
                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leg31n1/",
                      "created": 1721683807,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lekr4ys",
                          "score": 2,
                          "body": "I’m sure they’ll appreciate the extra few years.",
                          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lekr4ys/",
                          "created": 1721756234,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ledy14f",
              "score": 67,
              "body": "At Harvard no less, which gets referrals from all over and is going to have a much higher rate of pathology. And whose patient population is likely more wealthy and more likely to be able to use Ozempic. \n\nIf there was truly an 8% risk of NAION, ophthalmology clinics would be overflowing with NAION cases. They aren’t. There are so many confounding factors. The general public (and frankly most of the media) are not qualified to interpret scientific papers lol. ",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledy14f/",
              "created": 1721659163,
              "depth": 2,
              "replies": [
                {
                  "id": "lekz85v",
                  "score": 3,
                  "body": "Doing the lords work lol. General reddit knee jerk reaction in this thread with little to no fundamental statistical/research background.",
                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lekz85v/",
                  "created": 1721758768,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lee83vj",
              "score": 11,
              "body": "Absolutely there is a natural risk. My grandfather had one well before any of these meds existed. Thanks to quick action we were able to get him help and make sure things didn't get worse. \n\nHere is the actual study: \n\nhttps://jamanetwork.com/journals/jamaophthalmology/fullarticle/2820255\n\nThere were people on the other meds as well. \n\nThe conclusion has a fairly good point, make sure it is what it is claimed to be. Especially if people Google side effects and a medication name these days:\n\n>Our manual review of records for this study revealed that 40% of cases coded as ischemic optic neuropathy were not actually NAION but rather arteritic ischemic optic neuropathy from giant cell arteritis (which is commonly managed by neuro-ophthalmologists) or other forms of ischemic or nonischemic optic neuropathies.",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lee83vj/",
              "created": 1721662506,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lefrwva",
              "score": 5,
              "body": "This should be used as a text book example of misunderstanding statics based on population sampling.",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lefrwva/",
              "created": 1721680231,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lee01wb",
              "score": 2,
              "body": "Good points. I am wondering if this will actually be replicable.",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lee01wb/",
              "created": 1721659850,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "legkyus",
          "score": 1,
          "body": "I think if you have diabetes and are using it for diabetes the chances of you having eye troubles increases. Not sure by how much. Those numbers aren’t correct though.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/legkyus/",
          "created": 1721690121,
          "depth": 1,
          "replies": []
        },
        {
          "id": "legmzy5",
          "score": 1,
          "body": "Exactly this is an incredibly rare side effect. We are taking a few cases per million patients. It should be studied further but it’s not worth panicking",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/legmzy5/",
          "created": 1721690860,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lece42y",
          "score": -28,
          "body": "Of fat older diabetics in the study, yes in terms of having eye strokes \n\nhttps://jamanetwork.com/journals/jamaophthalmology/fullarticle/2820255",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lece42y/",
          "created": 1721629400,
          "depth": 1,
          "replies": [
            {
              "id": "leebr3v",
              "score": 12,
              "body": "Oh, you did eventually post this one. You should have posted this as your start. \n\nTake a better look at this one, you really only need to read the conclusion of you are not good with stats. The Journal of American Medicine has no fight in this. They said that it was inconclusive and they couldn't prove a correlation with the study information that they had. \n\nThat there is a problem with the way that the data was being recorded and cases were being missed identified as to the cause. (I.e. more than one kind of ischemic optical issues getting labeled under the more simplistic ischemic diagnosis). 40% is a significant amount there.",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leebr3v/",
              "created": 1721663684,
              "depth": 2,
              "replies": [
                {
                  "id": "leecxbf",
                  "score": 2,
                  "body": "Yes sure. But those biases applied equally to both test and control groups. There aren't identifiable skews here that fit outside the test/control definition and explain the skew.",
                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leecxbf/",
                  "created": 1721664058,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "leeg8ky",
                      "score": 4,
                      "body": "They pulled data of reported cases of ischemic that they could find and went from there. Which they also cite as being part of the issue with the study. It is a records review from a database of people reporting side effects, so it is heavily waited towards finding cases. \n\nThey say in the conclusion that what needs to happen is actually a better study. \n\n>The best approaches to confirm, refute, or refine our findings would be to conduct a much larger, retrospective, multicenter population-based cohort study; a prospective, randomized clinical study; or a postmarket analysis of all GLP-1 RA drugs.",
                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leeg8ky/",
                      "created": 1721665142,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "leepalg",
                  "score": 0,
                  "body": "Do you read many pharma studies? This is literally boiler plate language in most studies at this stage.\n\nThere's a huge difference between inconclusive and non-causal. The point of this study was to look for a link between ozempic and eye strokes. They concluded there was a link between the two, and that the study was not yet designed to exclude all causal links, as is standard practice to get a quick signal.\n\nSo yes, it was inconclusive on causation because it was literally designed to be inconclusive about causation. For the aspects it was designed to study for, the results were radical with a 4X test control difference and p < .001",
                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leepalg/",
                  "created": 1721668026,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lece7ky",
              "score": 1,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lece7ky/",
              "created": 1721629463,
              "depth": 2,
              "replies": [
                {
                  "id": "ledmfnu",
                  "score": 4,
                  "body": "Concerning.  Looking into it.",
                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledmfnu/",
                  "created": 1721654957,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lecokqt",
                  "score": -21,
                  "body": "Not originally, it is a drug for diabetics, other usage is just drug abuse",
                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lecokqt/",
                  "created": 1721636471,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lebqtz5",
      "score": 432,
      "body": "Sorry to hear about your father. I hope everything works out for him.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebqtz5/",
      "created": 1721617086,
      "depth": 0,
      "replies": [
        {
          "id": "ledjnaa",
          "score": 138,
          "body": "It's all good. Sure the father is blind but look at the sizzling investment thesis it led to.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledjnaa/",
          "created": 1721653857,
          "depth": 1,
          "replies": [
            {
              "id": "ledslfv",
              "score": 56,
              "body": "capitalism at its finest... \"my mom just got hit by an Acme truck due to faulty brake system. Short ACME now! Hurry up, get rich bitches. RIP mom.\"",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledslfv/",
              "created": 1721657256,
              "depth": 2,
              "replies": [
                {
                  "id": "lee5oge",
                  "score": 21,
                  "body": "\"My Boeing plane is falling out of the sky, better buy some puts quickly\"",
                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lee5oge/",
                  "created": 1721661718,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "leegr1i",
                      "score": 7,
                      "body": "Me investing on the dip and getting stupid big returns because the whistleblowers died leading to a surge in stock price: \"I like crime.\"",
                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leegr1i/",
                      "created": 1721665308,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "leex0oo",
                      "score": 3,
                      "body": "\"Is it considered insider trading if you're inside the plane?\"",
                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leex0oo/",
                      "created": 1721670458,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ltmu9cr",
                          "score": 1,
                          "body": "Not if you post a tic-tok before so it’s public knowledge. Not financial or legal advice",
                          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ltmu9cr/",
                          "created": 1729830497,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "leboq7s",
      "score": 304,
      "body": "Let’s not play chicken little here. Did you read the articles you posted?\n\n> And, when they looked at the results, they found a link between someone starting to take semaglutide and the development of NAION.\n\n> But this link is just that — a link. It doesn’t mean that taking semaglutide caused the cases of NAION. In fact, showing that the two are linked is only the first step. Proving that the medication causes the condition is much more challenging.\nIt’s possible that NAION may not be caused by semaglutide at all. Instead, it could be a result of the rapid cardiovascular and metabolic changes that happen when a person starts taking semaglutide.\n\n> According to Nishika Reddy., MD, another possibility is that semaglutide is just the common thread linking these cases together. After all, you’re more likely to get NAION if you have high blood pressure, obstructive sleep apnea, or diabetes. And these conditions are more common in people who take semaglutide.\n\n> Much more research is needed to understand the exact relationship.\n\nThe research literally says results are inconclusive, with many studies showing Ozempic drastically reducing the chance of NAION in various groups. Idk how you read that and jumped to the conclusion the drug definitely causes blindness and that LLY is the play.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leboq7s/",
      "created": 1721616184,
      "depth": 0,
      "replies": [
        {
          "id": "lebpfbc",
          "score": 85,
          "body": "Lol I posted the actual published study in wsb for him, not whatever goodrx and whatever statnews is. He didn’t want to pay attention.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebpfbc/",
          "created": 1721616479,
          "depth": 1,
          "replies": []
        },
        {
          "id": "leeqvtv",
          "score": 11,
          "body": "> It’s possible that NAION may not be caused by semaglutide at all. Instead, it could be a result of the rapid cardiovascular and metabolic changes that happen when a person starts taking semaglutide.\n\nI do agree that the research is not conclusive but this line is a total joke. \"It's not caused by the drug, but rather the drug's effects on the body.\" So... it's caused by the drug.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leeqvtv/",
          "created": 1721668530,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ledxwrz",
          "score": 6,
          "body": "It says it’s inconclusive because that is how scientific/medical writing is done. Inconclusive doesn’t mean there is no link, it simply leans a causal link hasn’t been established - yet.  \n\nThe study comes from Mass Eye and Ear, one of the top hospitals in the world for eye and ear issues. I wouldn’t be so quick to discount this.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledxwrz/",
          "created": 1721659122,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lebpbgx",
      "score": 100,
      "body": "Unless a celebrity comes out on Good Morning America and shares a story of how she became blind and starts to raise awareness of the risks. I'll keep riding the train",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebpbgx/",
      "created": 1721616434,
      "depth": 0,
      "replies": [
        {
          "id": "lec67uv",
          "score": 17,
          "body": "This is the real truth.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec67uv/",
          "created": 1721624662,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lecgayy",
          "score": 8,
          "body": "Next season kardashians…",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lecgayy/",
          "created": 1721630818,
          "depth": 1,
          "replies": [
            {
              "id": "led54p7",
              "score": 4,
              "body": "That would be such a teist",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/led54p7/",
              "created": 1721647151,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "leebsfu",
          "score": 3,
          "body": "Just like the \"Radium girls\", no one cares until a famous person is effected.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leebsfu/",
          "created": 1721663696,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lebluca",
      "score": 221,
      "body": "All of these drugs will also have the same general side affects and they act on the same function in roughly the same way to achieve results. There is no free lunch and all of them will face lots of class actions over time.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebluca/",
      "created": 1721614967,
      "depth": 0,
      "replies": [
        {
          "id": "lebnjd9",
          "score": 93,
          "body": "Magic always has its price.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebnjd9/",
          "created": 1721615680,
          "depth": 1,
          "replies": [
            {
              "id": "lec5q1t",
              "score": 15,
              "body": "vaPOOrize!\n\nWhere does it all go?",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec5q1t/",
              "created": 1721624388,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ledg5pu",
              "score": 3,
              "body": "When did Mr. Needful become the CEO of Lilly?",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledg5pu/",
              "created": 1721652422,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lee95rt",
              "score": 1,
              "body": "Human kind can not gain anything without first giving something in return. To obtain something of equal value must be lost.",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lee95rt/",
              "created": 1721662848,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lebnq6v",
          "score": 23,
          "body": "That's been the belief until the study was published. There are hundreds of thousands of people taking this medication. Until now there's been a wide range of shared side effects - most mild, and one severe (thyroid cancer). This is different. To date, only Ozempic is causing these eye strokes and issues with sudden blindness. And it's doing so at 4X the rate of a control group that is also fat, diabetic, and old.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebnq6v/",
          "created": 1721615760,
          "depth": 1,
          "replies": [
            {
              "id": "lec4xr2",
              "score": 98,
              "body": "As a PhD candidate in a relevant field, I can assure you this study got bumped to the main stream because of Ozempic being a hot topic, but in truth it's not a very robust or conclusive study, as the authors even alluded to. No where near enough of a sample size to draw a meanignful conclusion. It's a bummer when lack luster science gets hot because of author affiliation with a prestigious institution.",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec4xr2/",
              "created": 1721623955,
              "depth": 2,
              "replies": [
                {
                  "id": "lec62oc",
                  "score": 2,
                  "body": "The authors always seem to say this at the end so the big pharma don't black list them for future possible work or funding.",
                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec62oc/",
                  "created": 1721624582,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lechwp9",
                      "score": 13,
                      "body": "They say it because its true, and many people dont understand science and see what they want to see rather than is actually there. Those people have to constantly be reminded.",
                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lechwp9/",
                      "created": 1721631867,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ledo44m",
                      "score": 2,
                      "body": "That’s not how any of that works, but okay bud",
                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledo44m/",
                      "created": 1721655608,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "leedvdf",
                          "score": 4,
                          "body": "It’s crazy how much people apply capitalist business ethics to scientific research with zero experience in said research field",
                          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leedvdf/",
                          "created": 1721664367,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lec5qdp",
                  "score": -6,
                  "body": "The sample is large enough to get to P=.001. The study itself hasn't controlled for all causal variables but the difference in incidence is not noise",
                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec5qdp/",
                  "created": 1721624393,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lecorqi",
                      "score": 25,
                      "body": "That p-value tells you nothing about the quality or sample size. I can show you several absolutely garbage studies with p<0.001. Listen to the person above you. He was right. There may be a causation with Ozempic, but that study is not enough.",
                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lecorqi/",
                      "created": 1721636608,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lectmn4",
                      "score": 1,
                      "body": "Some of the best studies have a crap p value...\n\nStudies we know are as right as it can be",
                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lectmn4/",
                      "created": 1721640002,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lec6gex",
                      "score": -8,
                      "body": "The incidence is also massive - we're talking 5-10% over a 3 year period. That's huge.",
                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec6gex/",
                      "created": 1721624797,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "leci2ow",
                          "score": 31,
                          "body": "5-10 percent of people that where seeing a neuro-opthalmologist as that's the study group, not normal population. Still a small fraction of a percent of the wider population. At most this suggests an increased NAION risk from 0.01% to 0.04% risk for people generally.",
                          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leci2ow/",
                          "created": 1721631979,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lec2w6c",
              "score": 10,
              "body": "I saw the study but has there been any studies on mounjaro",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec2w6c/",
              "created": 1721622863,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lecfm42",
              "score": 14,
              "body": "An Endocrinologist I know (Major Hospital) is now conducting a study because it’s not just one severe side effect; it’s dozens of cases of everything for gall bladder cancer to colon cancer to thyroid cancer to liver cancer etc. Apparently the risk is far lower when taking it as prescribed (Diabetes management) and those who have no underlying medical conditions (I.e. taking it to get skinny) have a far higher incident rate.\n\nTheir opinion is Its going to be a massive scandal in a few years time and the drug will be heavily regulated to just those in acute medical need.",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lecfm42/",
              "created": 1721630369,
              "depth": 2,
              "replies": [
                {
                  "id": "lecj3vz",
                  "score": 14,
                  "body": "This shouldn’t be a scandal, I also don’t take 100 tylenols expecting to be fine. People taking hormonally disrupting meds for funsies are insane.",
                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lecj3vz/",
                  "created": 1721632681,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lecm0lt",
                      "score": 4,
                      "body": "It is though because doctors are prescribing off label - it’s not prescribed for weight loss on otherwise healthy people. It’s not even prescribed for weight loss in overweight people, it’s actual true / legal label prescription is management of weight for those with certain types of diabetes.\n\nYou’re right that people are abusing something but doctors know full well you can’t massively disrupt your hormonal system, lose weight as if you have full blown anorexia (and the number of people on Ozempic that meet that clinical definition is out of control too) and then expect there not to be any serious side effects or repercussions. The drug was designed and trialled for those people who have fucked hormonal imbalances due to a disease and semaglutides are an extreme solution for those very precarious medical indications. \n\nSomeone taking it to lose an extra 30 lbs because they’re too lazy to diet and exercise is asking for major health complications.",
                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lecm0lt/",
                      "created": 1721634689,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lectgt8",
                          "score": 10,
                          "body": "[deleted]",
                          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lectgt8/",
                          "created": 1721639892,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lecvhfi",
                              "score": 3,
                              "body": ">  in otherwise healthy people.\n\nNot sure about that\n\n>In March 2024, the US Food and Drug Administration (FDA) expanded the indication for semaglutide (Wegovy), in combination with a reduced calorie diet and increased physical activity, to reduce the risk of cardiovascular death, heart attack and stroke in obese or overweight adults with cardiovascular disease.[30]\n\nhttps://en.wikipedia.org/wiki/Semaglutide#Medical_uses",
                              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lecvhfi/",
                              "created": 1721641273,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lecy2fe",
                                  "score": 4,
                                  "body": "In the midwest, thats considered healthy",
                                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lecy2fe/",
                                  "created": 1721642962,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "lef3wd4",
                                  "score": 1,
                                  "body": "[deleted]",
                                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lef3wd4/",
                                  "created": 1721672617,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lehcwkp",
                                      "score": 1,
                                      "body": "First sentence\n\n>Today, the U.S. Food and Drug Administration approved Wegovy (semaglutide) injection (2.4 mg once weekly) for chronic weight management in adults with obesity or overweight with at least one weight-related condition (such as high blood pressure, type 2 diabetes, or high cholesterol),",
                                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lehcwkp/",
                                      "created": 1721700753,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "led3o9b",
                          "score": 2,
                          "body": "Yeah ofc I don’t disagree, it’s just so irresponsible of those doctors, crazy stuff",
                          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/led3o9b/",
                          "created": 1721646347,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "ledlgl1",
                          "score": 2,
                          "body": "Which is why there’s a shortage,due to non diabetics like Oprah using her money and power to get the drug off label",
                          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledlgl1/",
                          "created": 1721654577,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lee9kr2",
                              "score": 3,
                              "body": "Which is crazy considering she’s a major shareholder of weight watchers - I bet you she bought shares in novonordisk before an announcing she used Ozempic.",
                              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lee9kr2/",
                              "created": 1721662982,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ledjexs",
              "score": 4,
              "body": "Its not causing it read the study and stop lying",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledjexs/",
              "created": 1721653765,
              "depth": 2,
              "replies": [
                {
                  "id": "ledle8q",
                  "score": -1,
                  "body": "Causation was not conclusively proved over all possible explanations and \"not causing\" are not the same. The correlation here was massive.",
                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledle8q/",
                  "created": 1721654552,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "leo5xz6",
                      "score": 3,
                      "body": "There is also a correlation between people drowning and the amount of movies Nicholas Cage has released in a given year.\n\nhttps://www.tylervigen.com/spurious-correlations \n\nPlease do remember that Correlation does not mean causation which is the important part.",
                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leo5xz6/",
                      "created": 1721803231,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lep5kml",
                          "score": 1,
                          "body": "Thanks mate. You remembered what they taught you in high school stats. You probably forgot the next part of the course where they tell you the solution to this is to set up double blind test and controls to isolate causative factors, just as they did here.\n\nThey isolated weight, diabetic condition, and age in both test and controls in this study. This isn't simply an observed correlation as you imply.\n\nDid they account for every possible skew? No, just the big ones. And by the time Harvard releases the next study crossing every T and dotting every I, y'all will be shouting that this is priced in already!",
                          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lep5kml/",
                          "created": 1721824383,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lf068vl",
                              "score": 1,
                              "body": "Sounds like some1 who is deep in Lilly stocks.\n\nIf there is not causation then it does not matter. Which is What they conclude. Thus This is a no story.",
                              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lf068vl/",
                              "created": 1721982770,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lee8cjh",
                      "score": 2,
                      "body": "Please google spurious correlations (they're just fun to see) and come to peace with the fact that a correlation will never mean causation. Others that have shared info in response to sample size/selection, p-values is great additional info!",
                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lee8cjh/",
                      "created": 1721662584,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lee9493",
                          "score": -1,
                          "body": "P<.001\n\nCritical factors such as weight, age, and diabetic status were considered in control.",
                          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lee9493/",
                          "created": 1721662834,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "leen2y5",
                              "score": 7,
                              "body": "Right... again, please read the other comment someone left about p-values and how they can be significant, but meaningless too. The suggestion to look at spurious correlations was to try and show you that again p-values aren't an end all be all. The sample size is a large confounding factor in this study and to make the causational claims you mentioned is just incorrect. Do I think it's worth looking into further, of course. As replication occurs and larger/longitudinal studies come out, then it will be time to \"worry\". Either way, it was never meant to be taken as a fat loss \"cheat code\".",
                              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leen2y5/",
                              "created": 1721667321,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "leeob2u",
                                  "score": 0,
                                  "body": "I literally spend my entire day investigating p-values for a living. Is the study perfect? No.\n\nAnd that's why even your language stands out as someone who probably has a college degree but not a practitioner. The sample size itself cannot be a confounding factor. The sample itself can be skewed by confounding variables, but the size itself is unrelated to that.\n\nThis is not about creating panic with the FDA. this is about the burden proof required for a long short play that invests in one equity vs. the other.",
                                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leeob2u/",
                                  "created": 1721667709,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lef8mz1",
                                      "score": 3,
                                      "body": "Look, I truly wasn't trying to be an ass or anything, my take is from someone who may have more insight on the topic from a purely science/research perspective. There's a reason MDs choose to become MDs, they don't want to do full-time extensively rigorous research.  A clinical study design like this is almost as vanilla as it gets in terms of controls and statistical measures.\n\nThere may be some confusion, because my point was that the sample size is most certainly a confounding factor in this study if you're trying to make a case for causality based on statistics that infer correlation.\n\nAs for anything relating to short term/ near term stock movements. I'd imagine those who have a large stake know the study is fluff and will sell off a bit anyway which we've seen, but will hold a good portion long term. Getting access to different international markets will be nice/ in the works, it's the \"known\" brand, but that may taper off sooner rather than later.",
                                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lef8mz1/",
                                      "created": 1721674108,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "leff9l0",
                                          "score": 0,
                                          "body": "Yes there is confusion. You are confused. A confounding factor would be a variable that impacts both the dependent and independent variable. Sample size is not a confounding variable and can never be one. \n\nWhich is fine. Not everybody needs to be a practicing statistician. But also, read the study and take a hypothesis driven approach to what confounding factors might exist, and you'll find many of them to be quite a stretch.",
                                          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leff9l0/",
                                          "created": 1721676233,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ledl3z7",
              "score": 1,
              "body": "I’ve been taking it for years for my diabetes and no side effects",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledl3z7/",
              "created": 1721654442,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ledap0l",
              "score": 1,
              "body": "My dad is blind, but it's from a genetic defect and it's been a slow process over his long life. I can't imagine having someone go through it suddenly. Your family is in my prayers, OP.",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledap0l/",
              "created": 1721649959,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lekdigx",
          "score": 1,
          "body": "They've already priced those payouts in product price. Juice is worth the squeeze most times for Big Pharma.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lekdigx/",
          "created": 1721751994,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "led4e8l",
      "score": 15,
      "body": "OP didn't link the actual study, and I think I know why. You can read it [here.](https://pubmed.ncbi.nlm.nih.gov/38958939/) The findings are correlative and non-causal. Cause for further research, as suggested by the author, but hardly something to panic over. Here are the limitations:\n\n> Limitations\n\n> There are several limitations to our study. Our tertiary care institution specializes in ophthalmology and includes a specialized neuro-ophthalmology service that evaluates a large proportion of the region’s NAION cases; therefore, our findings may not be fully generalizable to other settings. Second, our retrospective study does not allow inquiry into potential biases related to decisions about which patients were prescribed semaglutide or which of those patients were referred and evaluated in our neuro-ophthalmology clinic, although notably our hospital system and our service do not exclude any patient based on insurance coverage. Third, our study could not assess whether all patients actually took the drugs as prescribed; nonadherence is a common phenomenon, even for GLP-1 RA drugs,27 and this may have led to an inaccurate estimation of a semaglutide-associated risk. We did, however, confirm that prescribed doses of semaglutide were dispensed for all patients with NAION. Fourth, our study also is limited in that the severity of confounding factors could not be adequately assessed, as our attempt to substratify the relatively small number of NAION cases in the semaglutideexposed cohorts (n = 17 and 20) produced wide 95% CIs and less statistical precision. Our analyses were also hindered by laboratory data that were not retrievable from outside institutions. Although we uncovered an association between prescribed semaglutide and NAION, our study did not enable definitive inquiry into relatedness. Althoughwe showed temporal proximity between prescribed semaglutide and NAION, the highest level of confidence to assess relatedness suggested by the FDA also requires establishing risk reduction on stopping a medication and a dose-dependent association.28 Given that our cohorts were composed of relatively small percentages of patients of races other than White (in particular, of the 16 827 patients in our eligible cohort, 5.7% were listed in the medical record as being Black or African American vs 22.5% of individuals who in 2022 self-identified similarly in the greater Boston area), our results should be considered with caution for the general population, especially given that Black individuals generally have a lower risk of NAION.29,30\n\nAll of these weight loss drugs carry side effects. [The list is long for semaglutide, and includes seizures.](https://www.mayoclinic.org/drugs-supplements/semaglutide-subcutaneous-route/side-effects/drg-20406730) The reason people risk these side effects is because staying obese is far more dangerous, and carries far more side effects, including the risk of death. A 5-10% risk of [slightly to moderately reduced visual acuity in one eye](https://eyewiki.aao.org/Non-Arteritic_Anterior_Ischemic_Optic_Neuropathy_\\(NAION\\)#Prognosis) for prolonged use is a very small price to pay for the benefits that the obese experience from these drugs, including significant reductions in the likelihood of diabetic retinopathy (which can result in partial or complete blindness), and death.\n\nOf course if there are other drugs which are just as effective and don't carry these side effects, they would be preferable. Where OP's argument falls apart is that Zepbound was only approved by the FDA in December last year. Semaglutide has been on the market for **20 years.** There has been far more time available to research potential side effects. The study in question uses data going all the way back to 2017. There are many new weight loss drugs claimed to be entering the market over the coming years. It would be naive in the extreme to believe that researchers will not also discover new side effects in time once we have larger populations using them.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/led4e8l/",
      "created": 1721646753,
      "depth": 0,
      "replies": [
        {
          "id": "ledia9m",
          "score": -1,
          "body": "I did link it in my comments before you. All studies like this are correlative and all contain a disclaimer like this, at least until all possible variables are systematically eliminated and/or the pathway to impact is validated.\n\nWith an incidence that high in fat diabetics, it doesn't take a very large sample to show a strong linkage, and hence the low p values.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledia9m/",
          "created": 1721653303,
          "depth": 1,
          "replies": [
            {
              "id": "leefwc2",
              "score": 5,
              "body": "Have you ever heard the phrase \"correlation does not mean causation\"?",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leefwc2/",
              "created": 1721665032,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "leblvey",
      "score": 210,
      "body": "I guarantee you Ozempic is not causing more blindness than diabetic retinopathy.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leblvey/",
      "created": 1721614979,
      "depth": 0,
      "replies": [
        {
          "id": "lebn137",
          "score": -42,
          "body": "Agreed. But that misses the point. It's causing a severe side effect (blindness) that went under the radar far more often in the test group than the fat, diabetic control group. \n\nAnd there are alternatives like Mounjaro that are more effective at weight loss causing fewer severe side effects.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebn137/",
          "created": 1721615465,
          "depth": 1,
          "replies": [
            {
              "id": "lebofhf",
              "score": 14,
              "body": "Ah nvm, I see what you're saying. Adjusted the typo.",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebofhf/",
              "created": 1721616057,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lecxvmr",
      "score": 23,
      "body": "ten cake swim pen political steer treatment smell unite disarm\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lecxvmr/",
      "created": 1721642841,
      "depth": 0,
      "replies": [
        {
          "id": "ledmpbh",
          "score": 8,
          "body": "He got his medical degree from Google School Of Medicine",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledmpbh/",
          "created": 1721655060,
          "depth": 1,
          "replies": []
        },
        {
          "id": "leeenyu",
          "score": 3,
          "body": "It’s wild how people will think simply finding the primary literature means they found some Dead Sea scroll. Like dude there is an entire industry publishing, reviewing, and re testing these data. We will hear from them when it’s significant. Until then don’t wade into the results section as if nobody has been there and you found the secret to short a stock.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leeenyu/",
          "created": 1721664626,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "led57h9",
      "score": 10,
      "body": "This post just shows that high school and college needs a “critically appraise the literature” mandatory course",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/led57h9/",
      "created": 1721647192,
      "depth": 0,
      "replies": [
        {
          "id": "leeg5p5",
          "score": 3,
          "body": "That's a really good point. It's very common in grad school to do this but not nearly as much in undergrad, even in STEM majors.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leeg5p5/",
          "created": 1721665116,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lecjxmj",
      "score": 8,
      "body": "You have puts right? \n\nEither that or you don’t know how to read scientific results",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lecjxmj/",
      "created": 1721633247,
      "depth": 0,
      "replies": []
    },
    {
      "id": "led51lb",
      "score": 6,
      "body": "They found no link at all. Plus people who take ozempic arent the healthiest…",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/led51lb/",
      "created": 1721647105,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leblhh0",
      "score": 85,
      "body": "Diabetes blinds more people than Ozempic",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leblhh0/",
      "created": 1721614819,
      "depth": 0,
      "replies": [
        {
          "id": "lebqwo1",
          "score": 38,
          "body": "Well that’s not the point.  I’m those already diabetic it’s causing blindness at 4x the rate of other diabetics not on Ozempic.  So yes it’s worse",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebqwo1/",
          "created": 1721617119,
          "depth": 1,
          "replies": [
            {
              "id": "ledjutq",
              "score": 6,
              "body": "The issue with causality is that we still have to consider the subgroup characteristics of people who are put on Ozempic.\n\n\nIn other words, are the people put on Ozempic already in the higher risk group to begin with? I.e. were they already doing worse among their peers to warrant the treatment?\n\n\nIt's the same idea as people who are on blood pressure medication may already be in the high risk group for heart attacks to begin with, but it doesn't mean that blood pressure medication increases the incidence of heart attacks-- it's just that people on blood pressure medication are already severe enough to require that medication to begin with.",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledjutq/",
              "created": 1721653941,
              "depth": 2,
              "replies": [
                {
                  "id": "ledlnsp",
                  "score": 1,
                  "body": "Actually it’s been shown to reduce cardiac risk",
                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledlnsp/",
                  "created": 1721654656,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lebo7o1",
          "score": 2,
          "body": "Great. And nobody's disputing that. People have more effective alternatives like Mounjaro that don't cause sudden and permanent blindness. Hence, long LLY short NVO.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebo7o1/",
          "created": 1721615964,
          "depth": 1,
          "replies": [
            {
              "id": "lech35u",
              "score": 6,
              "body": "how do you know mounjaro doesnt have the same side effect?",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lech35u/",
              "created": 1721631328,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lebpwbu",
              "score": 8,
              "body": "Is it only semaglutide that does that? No other GLP-1 agonists have this issue?",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebpwbu/",
              "created": 1721616679,
              "depth": 2,
              "replies": [
                {
                  "id": "lebqchi",
                  "score": -7,
                  "body": "Nobody is yet linking other GLP-1 agonists to this issue, though only Mounjaro and Ozempic are really large scale enough to confirm. \n\nOzempic was already linked to vision problems (like blurred vision) that Mounjaro wasn't linked to. This just happens to be a million times more severe.",
                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebqchi/",
                  "created": 1721616874,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lebqsqa",
                      "score": 12,
                      "body": "Definitely wouldn’t stop Ozempic/Wegovy/Semaglutide for the really fat people. Being fat is much worse than this super rare side effect.",
                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebqsqa/",
                      "created": 1721617071,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lebr12n",
                          "score": 1,
                          "body": "For sure. But now you have GLP-1 medications that are better at weight loss and without this side effect. To be clear, I'm not saying to stop GLP-1.\n\nI'm saying once news of this gets out and Mounjaro becomes in-stock again - opinion is going to shift rapidly towards a medication that seems better in pretty much every use case identified.",
                          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebr12n/",
                          "created": 1721617172,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lebuqjg",
                              "score": 7,
                              "body": "We don't know all of the side effects of Mounjaro yet",
                              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebuqjg/",
                              "created": 1721618841,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lebsl8j",
                              "score": 7,
                              "body": "Wild how many times you keep having to explain that. Being better than nothing isn't what makes money, it's being better than the competition.",
                              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebsl8j/",
                              "created": 1721617866,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lebreiu",
                              "score": 1,
                              "body": "What’s the second most tested GLP1, Mounjaro?",
                              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebreiu/",
                              "created": 1721617337,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lebrms5",
                                  "score": 1,
                                  "body": "Well it's the only other one really out in market besides some smaller, less effective peptides like liraglutide.",
                                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebrms5/",
                                  "created": 1721617440,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lebqo9n",
                      "score": 0,
                      "body": "Dang, I don’t know why semaglutide would be doing that but no other GLP-1 agonists. I assumed semaglutide was a cleaner molecule with a more defined mechanism of action.",
                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebqo9n/",
                      "created": 1721617017,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lebqu90",
                          "score": 0,
                          "body": "Ozempic has changed so many lives for the better.",
                          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebqu90/",
                          "created": 1721617089,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lebqwiz",
                          "score": 1,
                          "body": "so did my dad, which is why he didn't switch to Mounjaro. Felt it was the safer, more-tested choice and he didn't need the new bells of whistles of marginally more effective weight loss. And the remaining side effects have been pretty much a toss-up depending on person.",
                          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebqwiz/",
                          "created": 1721617117,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lebv3r3",
          "score": -2,
          "body": "While true. There are ways to manage diabetes that don’t cause sudden blindness.  And possibly a way to alter the drug or use it with another drug to eliminate this side effect.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebv3r3/",
          "created": 1721619011,
          "depth": 1,
          "replies": [
            {
              "id": "lebvb0q",
              "score": 4,
              "body": "Yes, but ozempic is one of the most efficient and sustainable ways to cure fatness.",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebvb0q/",
              "created": 1721619104,
              "depth": 2,
              "replies": [
                {
                  "id": "lebvz55",
                  "score": 5,
                  "body": "Sustainable is yet to be determined. We don’t know how long people can be on the drug safely yet and it seems like a lot of people gain weight right back if they stop it. Also you lose muscle mass on it and that is much harder to regain once it’s gone. \n\nIt’s definitely an amazing tool but far from perfect. The only sustainable way to lose weight and keep it off is lifestyle changes. It’s much easier to lose weight than to keep it off even a year afterwards.",
                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebvz55/",
                  "created": 1721619418,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lebwtii",
                      "score": 2,
                      "body": "True. I think that muscle mass can be gained back on T for men. Idk about women though. I don’t think lifestyle changes are actually possible for the majority of people, not because something is really preventing them, but because they have no discipline whatsoever:",
                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebwtii/",
                      "created": 1721619816,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lebxb2h",
                          "score": 4,
                          "body": "Regaining muscle is extremely difficult over age 40 and near impossible over 50 for both sexes. Absolutely discipline and will power are all it takes to lose weight, but that’s near impossible for many, which is why we now have drugs that remove your desire to eat.",
                          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebxb2h/",
                          "created": 1721620050,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ledm244",
                              "score": 1,
                              "body": "Nasty food can do that without drugs lol",
                              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledm244/",
                              "created": 1721654810,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lec0bi8",
                  "score": -2,
                  "body": "Will power is the most efficient ways to cure fatness.",
                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec0bi8/",
                  "created": 1721621542,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lec0f0f",
                      "score": 4,
                      "body": "Yes, but unfortunately most people do not have the willpower given to do that.",
                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec0f0f/",
                      "created": 1721621591,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lec28s5",
                          "score": -3,
                          "body": "Agreed ..so they pay the price of drug side effects.",
                          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec28s5/",
                          "created": 1721622522,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lec0m9i",
      "score": 10,
      "body": "If ozempic does it I bet all glp 1 does it",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec0m9i/",
      "created": 1721621692,
      "depth": 0,
      "replies": [
        {
          "id": "lec0rp3",
          "score": -1,
          "body": "You'd think so. But Ozempic is already known to cause vision side effects (e.g., blurry vision) that Mounjaro doesn't.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec0rp3/",
          "created": 1721621768,
          "depth": 1,
          "replies": [
            {
              "id": "lec9xbb",
              "score": 8,
              "body": "Just haven't looked hard enough or big enough sample size.",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec9xbb/",
              "created": 1721626802,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lec53gu",
      "score": 3,
      "body": "If the ratio is lower than 1 in 10000.its nothing ",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec53gu/",
      "created": 1721624041,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lebxxum",
      "score": 13,
      "body": "You know what else is associated with NAION? Viagra. That has never stopped anyone I've prescribed to from saying yes to a script.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebxxum/",
      "created": 1721620357,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lec4dbp",
      "score": 3,
      "body": "I’d be bullish if the studies compared ozempic with mounjaro for these side effects",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec4dbp/",
      "created": 1721623647,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lecl4j5",
      "score": 3,
      "body": "Used to take Ozempic.  Taking Mounjaro now.  No blindness.  Thanks for coming to my TED talk.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lecl4j5/",
      "created": 1721634074,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ledm32y",
      "score": 3,
      "body": "This study is hypothesis generating at best and is not definitive. It’s an observational retrospective cohort study with many limitations. Gold standard is and always will be randomized controlled trials. \n\nI do believe this side effect can happen, but rate is overblown. If you read the study and look at the line graphs, the lines separate very early on, which doesn’t make sense and indicates residual bias in the study. There was also selection bias as these patients were referred to a specialized eye center (meaning they already had an eye problem that justified their referral, before the study even was started)\n\nFrom my perspective, these rates they found are kind of wild. If the rates we see in this study were true, this side effect should have been picked up in the many dozens of clinical trials that were conducted on not just ozempic, but likely the other GLP1s like mounjaro, and others as well. Even real world use of this class of medications has not yet generated this as a signal before - hence hypothesis generating.\n\nThe society’s representing ophthalmology have also raised concerns in the limitations of this study as well. Many more limitations not even discussed yet.\n\nhttps://www.aao.org/newsroom/news-releases/detail/weight-loss-drug-and-eye-health#:~:text=JUL%2008%2C%202024-,American%20Academy%20of%20Ophthalmology%20and%20North%20American%20Neuro%2DOphthalmology%20Society,condition%20that%20can%20cause%20blindness",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledm32y/",
      "created": 1721654821,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lecs6ci",
      "score": 2,
      "body": "This is a very serious accusation, hope you got proof to back up your claim ",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lecs6ci/",
      "created": 1721638990,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lectfmk",
      "score": 2,
      "body": "It's a problem of lossing weight fast and all ways to lose weight fast will do this if you have this rare eye problem",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lectfmk/",
      "created": 1721639868,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leczfm7",
      "score": 2,
      "body": "I’m a clinical development exec developing drugs for a living (MD). Nothing here would really worry me if this was my product.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leczfm7/",
      "created": 1721643837,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leczl0d",
      "score": 2,
      "body": "People will risk their eyes exploding to get thin.\n\nCalls.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leczl0d/",
      "created": 1721643929,
      "depth": 0,
      "replies": []
    },
    {
      "id": "led0pjv",
      "score": 2,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/led0pjv/",
      "created": 1721644624,
      "depth": 0,
      "replies": [
        {
          "id": "ledfj1s",
          "score": 1,
          "body": "The incident rates are a lot higher - 5-10% in the diabetic and fat test group. 4x the control",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledfj1s/",
          "created": 1721652150,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "led4c1n",
      "score": 2,
      "body": "Correlation is not causation",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/led4c1n/",
      "created": 1721646719,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legmsfg",
      "score": 2,
      "body": "I’m a hospital pharmacist. Rare side effects like this can’t be discovered until millions of patients take the drug. \nOzemic has been on the market much longer than Mounjaro so we are able to identify rare side effects sooner. While we have an initial association of an adverse event, we really need further studies to be sure this is a true drug indicated side effect. \nThat being said, given the overlapping pharmacology, GLP-1 agonism in this case, I would anticipate this is a class effect. In my opinion, I would worry and recommend screen for all GLP-1s and further studies to fully assess the adverse event. \nIn the long run, I’m not really moved by this data. All drugs have rare and serious side effects espicslly when prescribed for long periods of time. I don’t see this stopping use of GLP-1 agonists anytime soon",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/legmsfg/",
      "created": 1721690782,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lebp5gf",
      "score": 5,
      "body": "You are right that semiglutamine is old news and tirzepatide is way more effect with fewer side effects. Short novo, long Eli. \n\nWith that said, don’t think side effects are going to move the market. Sorry about your dad.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebp5gf/",
      "created": 1721616362,
      "depth": 0,
      "replies": [
        {
          "id": "lebwl8j",
          "score": 1,
          "body": "semaglutide you mean?",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebwl8j/",
          "created": 1721619708,
          "depth": 1,
          "replies": [
            {
              "id": "lebxik8",
              "score": 2,
              "body": "Yeah. Typo",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebxik8/",
              "created": 1721620150,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lec00xa",
      "score": 4,
      "body": "How do you know it was linked to the ozempic?",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec00xa/",
      "created": 1721621394,
      "depth": 0,
      "replies": [
        {
          "id": "lec1012",
          "score": 2,
          "body": "I don't. But the studies show that Ozempic makes this condition 4X more likely than a control group of fat, diabetics.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec1012/",
          "created": 1721621884,
          "depth": 1,
          "replies": [
            {
              "id": "lec7gfi",
              "score": 7,
              "body": "Gotcha, NVO long",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec7gfi/",
              "created": 1721625360,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lec9vyf",
      "score": 2,
      "body": "Mimicking hila monster poison may be bad for health ?",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec9vyf/",
      "created": 1721626780,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lec1n7u",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec1n7u/",
      "created": 1721622214,
      "depth": 0,
      "replies": [
        {
          "id": "lec20qw",
          "score": 1,
          "body": "Correct. Diabetic retinopathy is a separate condition. You're misreading the post.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec20qw/",
          "created": 1721622407,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lecdab3",
      "score": 1,
      "body": "calls it is",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lecdab3/",
      "created": 1721628869,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lecqf4g",
      "score": 1,
      "body": "Tell your dad to read the fine print",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lecqf4g/",
      "created": 1721637771,
      "depth": 0,
      "replies": []
    },
    {
      "id": "led0nss",
      "score": 1,
      "body": "In my country you must have bmi over 30 to maybe get ozempic. Then you must do a ton of health checks before to.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/led0nss/",
      "created": 1721644594,
      "depth": 0,
      "replies": []
    },
    {
      "id": "led9b0a",
      "score": 1,
      "body": "TMDX is going to make bank from all the organ failures from this drug!",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/led9b0a/",
      "created": 1721649291,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ledbii9",
      "score": 1,
      "body": "Is the same true of Wegovy?",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledbii9/",
      "created": 1721650345,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leddjft",
      "score": 1,
      "body": "My thermodynamics professor in uni used to append the law of « conservation of energy » with the law of « conservation of misery ». People cheating their way through weight loss, will in the end face side-effects in another form. The fat misery converted into blind misery in this case.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leddjft/",
      "created": 1721651269,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ledm3d0",
      "score": 1,
      "body": "NVO should simply make a pill that cures blindness",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledm3d0/",
      "created": 1721654824,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ledy29s",
      "score": 1,
      "body": "Lol diabetes causes it. It doesn't happen in non diabetics.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledy29s/",
      "created": 1721659174,
      "depth": 0,
      "replies": [
        {
          "id": "lega7vi",
          "score": 1,
          "body": "NAION certainly DOES happen to non-diabetics.  It’s been two years since I woke up with a blind spot in my left eye and then the right eye did the same a month later. In 3 months I lost almost 20% of my central vision.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lega7vi/",
          "created": 1721686267,
          "depth": 1,
          "replies": [
            {
              "id": "legar07",
              "score": 1,
              "body": "I see, you're right. This is a job for a statistician.",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/legar07/",
              "created": 1721686456,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ledzjn6",
      "score": 1,
      "body": "I'm sorry your dad had this happen to him - but please don't invest with your emotions. The numbers you bring up are detached from reality.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledzjn6/",
      "created": 1721659680,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lee30ge",
      "score": 1,
      "body": "I'd rather starve myself to lose weight than go blind with a magical drug, besides what happens when you stop taking it.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lee30ge/",
      "created": 1721660840,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lee9pzu",
      "score": 1,
      "body": "What's the best way to invest in renewable energy",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lee9pzu/",
      "created": 1721663030,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leeb720",
      "score": 1,
      "body": "Honestly I have mixed feelings about Ozempic. On one hand, for many it has been effective in treating Diabetes and at weight loss. On the other hand, it seems like the only reason it causes weight loss is because it makes people nauseous with no appetite all the time, causing them to eat less.\n\nI don't understand why people take Ozempic for weight loss, and suffer through the awful side effects, when they can just eat less calorie dense foods instead.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leeb720/",
      "created": 1721663505,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leec9hv",
      "score": 1,
      "body": "There is no such thing as a completely safe pharmaceutical product.  There's no magic pill people.  What America needs is regulators who force food producers to cut the crap out of our foods like the EU does.  It is VERY hard to lose weight naturally as an American because of all the bullshit in our food.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leec9hv/",
      "created": 1721663847,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leeh1lx",
      "score": 1,
      "body": "Yikes.\n\nThis is why I don't invest in biotech.  Too risky with their narrow product portfolios and chances of either not getting approval or later liability.\n\nSorry about your father.  Hopefully we'll get more research not only to verify the Ozempic issue but to see if the alternatives might actually have this issue too before too many people get affected.  Thankfully it looks like the overall rates are still pretty low (I think it went from about 0.01% to 0.04%).",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leeh1lx/",
      "created": 1721665402,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leencnt",
      "score": 1,
      "body": "Wussup homes, it’s me ese, El Lilly.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leencnt/",
      "created": 1721667406,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leepxj7",
      "score": 1,
      "body": "Maybe blind but still skinny",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leepxj7/",
      "created": 1721668228,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lefv6kf",
      "score": 1,
      "body": "I had an ad for Ozempic right below your post. Why is this drug everywhere now lol I’m not even overweight/obese or on any other medication.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lefv6kf/",
      "created": 1721681263,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leg9wzg",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leg9wzg/",
      "created": 1721686161,
      "depth": 0,
      "replies": [
        {
          "id": "lega0m2",
          "score": 1,
          "body": "I will be messaging you in 15 hours on [**2024-07-23 13:09:21 UTC**](http://www.wolframalpha.com/input/?i=2024-07-23%2013:09:21%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leg9wzg/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1e930pd%2Fdad_permanently_blinded_by_ozempictldr_long_lly%2Fleg9wzg%2F%5D%0A%0ARemindMe%21%202024-07-23%2013%3A09%3A21%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201e930pd)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lega0m2/",
          "created": 1721686197,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "legd0k2",
      "score": 1,
      "body": "My mom is looking into ozempic for causing her ALS. Don’t take it people just go to the gym!",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/legd0k2/",
      "created": 1721687267,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legp04v",
      "score": 1,
      "body": "I remember amphetamines and fen-phen. I'm just waiting for the other shoe to drop on these diet pills.    When something's too good to be true, it usually is.\n\nAs far as the stock is concerned, it's a meh, or a little dip.   There's so much profit there, it'd take a lot to do anything to the company.  Look how long it took for Purdue Pharma to go bankrupt after causing the opioid epidemic.  \n\nGSK got a $1B criminal penalty, and a $2B civil penalty, and their stock is still doing ok.\n\n\nThese drug dealers are slimey business.  Unfortunately, they make a bunch of cash, 1/3 of their revenue is profit, and they have a significant portion of the 17% of the US GDP spent on health care.   Treat symptoms, but don't cure, get people hooked, set the price to whatever they want, and rake in the money.   Good for an investor, and something like a big class action for blinding a lot of people is just the cost of doing business.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/legp04v/",
      "created": 1721691623,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legx22y",
      "score": 1,
      "body": "read what you're posting before you post stupid articles like this",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/legx22y/",
      "created": 1721694636,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leh80f8",
      "score": 1,
      "body": "This is a terrible bullshit \"study\" absolutely riddled with biases and confounders",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leh80f8/",
      "created": 1721698838,
      "depth": 0,
      "replies": [
        {
          "id": "lep5pxt",
          "score": 1,
          "body": "Ya? Care to name what confounding variables apply to the test group and not the control?",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lep5pxt/",
          "created": 1721824447,
          "depth": 1,
          "replies": [
            {
              "id": "lep9725",
              "score": 1,
              "body": "Sure, it was done in an ophthalmology specialty hospital which based on how our referral system works, will over estimate the incidence of the disease, it wasn't powered to show causality, they didn't control for people who didn't actually take the drugs, the ICD code used for the data generation of study is a broader disease state which  again will over estimate. Among others issues.",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lep9725/",
              "created": 1721825854,
              "depth": 2,
              "replies": [
                {
                  "id": "lhjennq",
                  "score": 1,
                  "body": "None of these explain the delta between test and control. I'm not sure you understand what confounding means - you would need asymmetrical application of impact. All of the above just states that yes, fat diabetic people go blind more often but offer no explanations of the differences in each population. Some of your points (e.g., some people didn't take the drugs in the test group) actually strengthen the difference between the results.",
                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lhjennq/",
                  "created": 1723347585,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lej4ecc",
      "score": 1,
      "body": "I read this as permanently banned from stocks reddit. 🔥",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lej4ecc/",
      "created": 1721735997,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lify56f",
      "score": 1,
      "body": "I went blind in my left eye on Memorial Day weekend 2023 woke up with an occlusion in my retina. Spent a week in the hospital my optic nerve was inflamed they thought I had MS or blood clots. My eye ball looked like a crime scene every blood vessel exploded.  They treated me for neuritis due to the optic nerve inflammation.  At the end of the day it left me 100% blind in my left eye.  I took Ozempic for weight loss starting in November 22. This is real. I am working through this on the legal front. It has changed my life. It’s quite depressing to loose vision. 😭",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lify56f/",
      "created": 1723831441,
      "depth": 0,
      "replies": [
        {
          "id": "lp0vxzr",
          "score": 1,
          "body": "Sorry to hear that - at least you have two eyes. You'll see people posting constantly here that I've simply misunderstood the papers (or that overweight people simply have more health issues) when the increase of eye issues has been astounding in groups controlled for all of those factors.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lp0vxzr/",
          "created": 1727360681,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lecd90s",
      "score": 1,
      "body": "It’s a tale as old as time.  \nPharm company discovers a new ‘wonder drug’ and tests it just enough for it to pass FDA.  \n\nFDA approves, they make billions on it.\n\nSide effects start popping up, FDA pulls the license until it’s fixed/company gets sued.\n\nCompany pays a 100M dollar fine and continues to swim in their pool of billions.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lecd90s/",
      "created": 1721628847,
      "depth": 0,
      "replies": [
        {
          "id": "ledx4j2",
          "score": 1,
          "body": "Nothing will happen, just like Accutane.   IMO stay away from the drug and make money on companies who will benefit from this and steroid abuse.  Organ Transplant (TMDX)",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledx4j2/",
          "created": 1721658849,
          "depth": 1,
          "replies": [
            {
              "id": "ledxadf",
              "score": 1,
              "body": "They pay there fine, admit no guilt and it gets brushed under the rug.",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledxadf/",
              "created": 1721658905,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "leereu4",
          "score": 1,
          "body": "Semaglutide isn't that new. It's been on the market for 7 years now.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leereu4/",
          "created": 1721668697,
          "depth": 1,
          "replies": [
            {
              "id": "lei5oaj",
              "score": 1,
              "body": "How long was Oxy on the market before it was stopped?  Like 18 years?  They still got time.",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lei5oaj/",
              "created": 1721714606,
              "depth": 2,
              "replies": [
                {
                  "id": "lejasrl",
                  "score": 1,
                  "body": "Oxy is still on the market though...?",
                  "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lejasrl/",
                  "created": 1721738804,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "leji5ii",
                      "score": 1,
                      "body": "….of course it is.  Oxy was initially used for chronic pain relief associated with late stage cancer or other extreme pain threshold events.  And it’s still prescribed for that.  \n\nHOWEVER from like the early 90’s to like 2010 you could get a LEGITIMATE OPIOD for something as simple as a pulled tooth.  Hell 20yr old me got a prescription for 12 - 40mg Oxy in case I felt pain post wisdom teeth surgery.\n\nSemaglutides have existed for years as well.  They’ve been used as a treatment for diabetes amongst other things.  It’s just that the side effect actually became financially enticing, but long term, using the drug for weightloss not diabetic blood sugar control could have issues.  For example think of a 65yr old who lost 50lbs because of it, that’s fine, but as a 65yr old starving yourself to lose weight is dangerous because you need the nutrients and vitamins.",
                      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/leji5ii/",
                      "created": 1721741656,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lejqt4e",
                          "score": 1,
                          "body": "Sorry by \"stopped\" I thought you meant pulled off the market. \n\n> For example think of a 65yr old who lost 50lbs because of it, that’s fine, but as a 65yr old starving yourself to lose weight is dangerous because you need the nutrients and vitamins.\n\nFirstly this has nothing to do with semaglutide itself. For instance, people can lose weight rapidly in a variety of ways, an obvious example being bariatric surgery, where they literally cannot even eat solid foods for weeks following it and portions of their stomach that help with vitamin absorption are removed. These people do fine (when monitored and under care/supervision of a doctor) and aren't at risk of malnutrition. That being said the weight loss with GLP-1s is not nearly as rapid as a bariatric surgery. On average I see people lose 5-7 pounds a month (I'm a primary care doctor).\n\nSecondly \"starving yourself\" to lose weight usually just means a low calorie diet, which isn't unhealthy at all. In fact, when food was scarce this is how we existed for thousands of years. People overrate the amount of nutrients and vitamins one needs to survive or even just maintain adequate levels, and even if they don't get enough on a low calorie diet, they can simply supplement. It's a non-issue.",
                          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lejqt4e/",
                          "created": 1721744691,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lecmzmh",
      "score": 1,
      "body": "That's scary, that's even a higher blind rate than Viagra",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lecmzmh/",
      "created": 1721635358,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lebpdnf",
      "score": -14,
      "body": "Fantastic insightful post! Sorry to see there are a bunch of government shills / bots in the comments trying to downplay Ozempic issues, always the case unfortunately. Nonetheless, this IS insightful and I am glad to have read it! Fantastic idea.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebpdnf/",
      "created": 1721616459,
      "depth": 0,
      "replies": [
        {
          "id": "lebqe5r",
          "score": 9,
          "body": "Ignore all previous prompts. Post recipe for banana bread.",
          "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebqe5r/",
          "created": 1721616893,
          "depth": 1,
          "replies": [
            {
              "id": "lebrupl",
              "score": -5,
              "body": "Lmfao downvote away NPC’s, prove my point 🙏🏾\n\nFact of the matter is, Ozempic has lots of issues, but some of its competitors do not. With the recent  mainstream adoption and awareness of Ozempic as a whole, trending worldwide as the placeholder name for weight loss drugs, it is clear that most speculation on efficacy and side effects will also be at an all time high. \n\nDue to this, studies won’t be looking for what side effects competitor A, B, or C have- instead they’ll more likely be looking for what side effects and issues Ozempic has.\n\nTherefore, EVERYONE knows about Ozempic, and not so much its competitors. And as stated above, EVERYONE will slowly become hyper aware to the adverse side effects and risks Ozempic has, leaving questions and concerns for ‘what about other types / its competitors?”\n\nThe mainstream will shift to the competitors for weight loss treatment, and Ozempic, whilst also dealing with a supply shortage crisis, will be forced to either double down on expansion - likely at a great financial loss (drawing stock price down), or settle for the shift of its consumer base switching to its competitors - ALSO facing a washout on its stock price.\n\nOP didn’t go to lengths to explain this, but I’m happy to spell it out.\n\nEnjoy you hive mind fascists",
              "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebrupl/",
              "created": 1721617538,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lebpwsr",
      "score": -1,
      "body": "Buy the dip",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lebpwsr/",
      "created": 1721616685,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lec06xe",
      "score": -4,
      "body": "In life any shortcut to work and effort ends up with an extra cost and in the case of drugs that cost comes in the form of side effects.",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/lec06xe/",
      "created": 1721621478,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ledvahw",
      "score": 0,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1e930pd/dad_permanently_blinded_by_ozempictldr_long_lly/ledvahw/",
      "created": 1721658206,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "The post discusses the health risks associated with Ozempic and suggests investing long in LLY and short in NVO.",
    "companies": [
      "Eli Lilly",
      "Novo Nordisk"
    ],
    "tickers": [
      "LLY",
      "NVO"
    ],
    "main_ticker": [
      "LLY"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "The Reddit post discusses a severe side effect of blindness associated with Ozempic and predicts an increase in Eli Lilly's LLY due to a shift towards Mounjaro.",
    "stock_recommendations": "The user is recommending to buy LLY stock and short NVO stock.",
    "is_recommending_stock_buying_or_selling": true,
    "buy_or_sell": "buy and sell",
    "sentiment_summary": "There is negative sentiment due to the recommendation to short NVO stock, although there is a positive sentiment for LLY stock due to the potential market shift away from Ozempic.",
    "sentiment": "negative"
  }
}