{
  "title": "Berkshire trims Bank of America stake for the first time since 2019 ",
  "score": 78,
  "selftext": "Berkshire Hathaway trimmed its gigantic Bank of America holding for the first time in four and a half years following the bank’s strong 2024 run.\n\nWarren Buffett’s conglomerate sold 33.9 million shares of Bank of America shares for almost $1.5 billion in separate sales on Wednesday, Thursday, and Friday at an average selling price of $43.56, a regulatory filing showed.\n\nIt marked the first time since the fourth quarter of 2019 that the Omaha-based conglomerate has reduced the stake. Still, Bank of America remains Berkshire’s second largest equity position after Apple, holding 999 million shares with a market value of almost $43 billion. Meanwhile, Berkshire is still Bank of America’s largest shareholder with a 10.8% stake.\n\nBerkshire could be taking some profits as Bank of America has rallied 27.4% so far this year to its highest levels since March 2022. In the first quarter, Buffett trimmed Berkshire’s Apple holding by 13% for tax reasons following sizable gains.\n\nShares of Bank of America dipped slightly on Monday following the news.\n\nBathtub idea\n\nThe Oracle of Omaha’s purchase of Bank of America has become one of the most endearing Wall Street tales. In 2011, the legendary investor bought $5 billion worth of the bank’s preferred stock and warrants to shore up confidence in the lender as it grappled with losses related to subprime mortgages in the aftermath of the financial crisis.\n\nBuffett later revealed that he got the idea while taking a bath in his tub.\n\n“Incidentally, that BofA purchase, it literally was true that I was sitting in the bathtub when I got the idea of checking with ... BofA, whether they’d be interested in that preferred,” he said at Berkshire’s annual meeting in 2017, when he first converted the warrants and added the bank stock to his portfolio.\n\nThe 93-year-old investor said he was attracted to CEO Brian Moynihan’s leadership and the profit-generating abilities of the franchise.\n\nMoynihan later recalled that Buffett initially tried to reach him through Bank of America’s public phone line, but got rejected by the call center. Despite the snafu, the deal still came together within hours, he said.\n\nSource: https://www.cnbc.com/2024/07/22/warren-buffetts-berkshire-trims-bank-of-america-stake-for-the-first-time-since-2019-after-strong-rally.html",
  "link_flair_text": null,
  "id": "1e9ewxp",
  "num_comments": 7,
  "created_utc": 1721656544,
  "permalink": "/r/stocks/comments/1e9ewxp/berkshire_trims_bank_of_america_stake_for_the/",
  "comments": [
    {
      "id": "leef0tc",
      "score": 52,
      "body": "Sold ~4% of their shares for those who don’t want read all the rambling",
      "permalink": "/r/stocks/comments/1e9ewxp/berkshire_trims_bank_of_america_stake_for_the/leef0tc/",
      "created": 1721664744,
      "depth": 0,
      "replies": [
        {
          "id": "legj9cp",
          "score": 7,
          "body": "This is the only piece of important/relevant info. Idgaf if you tell me X money manager trims $1.5B of X company. All that matters is the percentage of their total holdings, ~4% ain’t nothin.",
          "permalink": "/r/stocks/comments/1e9ewxp/berkshire_trims_bank_of_america_stake_for_the/legj9cp/",
          "created": 1721689502,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lefibdq",
          "score": 6,
          "body": "almost newsworthy",
          "permalink": "/r/stocks/comments/1e9ewxp/berkshire_trims_bank_of_america_stake_for_the/lefibdq/",
          "created": 1721677216,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leeetoy",
      "score": 5,
      "body": "Has Berkshire sold any AAPL since Q1? I would’ve guessed he’d be trimming by now just because the position has ballooned and the stock has done extremely well in Q2.",
      "permalink": "/r/stocks/comments/1e9ewxp/berkshire_trims_bank_of_america_stake_for_the/leeetoy/",
      "created": 1721664679,
      "depth": 0,
      "replies": [
        {
          "id": "leeoxpq",
          "score": 10,
          "body": "Berkshire recently [sold 13% of its APPL holdings and no one freaked out](https://www.cnbc.com/2024/05/04/warren-buffetts-berkshire-hathaway-cut-apple-investment-by-about-13percent-in-the-first-quarter.html). Dont know why selling 3% ofs its BOA holdings is such a big deal.",
          "permalink": "/r/stocks/comments/1e9ewxp/berkshire_trims_bank_of_america_stake_for_the/leeoxpq/",
          "created": 1721667911,
          "depth": 1,
          "replies": [
            {
              "id": "leer3vp",
              "score": 2,
              "body": "Right but my question was more focused on the fact that AAPL is significantly higher than it was earlier in the year. I remember seeing it for $165 I think? Now it’s over $220 just after a pullback. But I guess if the reason was for taxes and not because he wanted less concentration in Berkshire’s portfolio than it could make sense.",
              "permalink": "/r/stocks/comments/1e9ewxp/berkshire_trims_bank_of_america_stake_for_the/leer3vp/",
              "created": 1721668599,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lefrkvo",
      "score": 5,
      "body": "Long overdue.",
      "permalink": "/r/stocks/comments/1e9ewxp/berkshire_trims_bank_of_america_stake_for_the/lefrkvo/",
      "created": 1721680126,
      "depth": 0,
      "replies": []
    }
  ]
}