{
  "title": "Nvidia preparing version of new flagship AI chip for Chinese market, Reuters reports",
  "score": 236,
  "selftext": "Nvidia is working on a version of its new flagship AI chips for the China market that would be compatible with current U.S. export controls, four sources familiar with the matter said.\n\nThe AI chip giant in March unveiled its “Blackwell” chip series, which is due to be mass-produced later in the year. The new processors combine two squares of silicon the size of the company’s previous offering. Within the series, the B200 is 30 times speedier than its predecessor at some tasks like serving up answers from chatbots.\n\nNvidia will work with Inspur, one of its major distributor partners in China, on the launch and distribution of the chip which is tentatively named the “B20”, two of the sources said. Shipments of the “B20″ are planned to start in the second quarter of 2025, a separate source told Reuters.\n\nThe sources declined to be identified as Nvidia has yet to make a public announcement.\n\nA spokesperson for Nvidia declined to comment. Inspur did not respond to requests for comment.\n\nShares of Nvidia rose 1.4% to $119.67 in U.S. premarket trading after publication of the Reuters story.\n\nWashington tightened its controls on exports of cutting-edge semiconductors to China in 2023, seeking to prevent breakthroughs in supercomputing that would aid China’s military.\n\nSince then, Nvidia has developed three chips tailored specifically for the Chinese market.\n\nThe advent of tighter export U.S. controls has helped Chinese technology giant Huawei and startups like Tencent-backed Enflame make some inroads into the domestic market for advanced AI processors.\n\nA version of a chip from Nvidia’s Blackwell series for the Chinese market would boost the U.S. firm’s efforts to fend off those challenges.\n\nChina accounted for around 17% of Nvidia’s revenue in the year to end January in the wake of U.S. sanctions, sliding from 26% two years earlier.\n\nNvidia’s most advanced chip for the China market, the H20, initially got off to a weak start when deliveries began this year and the U.S. firm priced it below a rival chip from Huawei, Reuters reported in May.\n\nBut sales are now growing rapidly, two of the sources said.\n\nNvidia is on track to sell over 1 million of its H20 chips in China this year, worth upwards of $12 billion, according to an estimate from research group SemiAnalysis.\n\nExpectations are high that the U.S. will continue to keep up the pressure on semiconductor-related export controls.\n\nThe U.S. wants the Netherlands and Japan to further restrict chipmaking equipment to China, sources have said.\n\nThe Biden administration also has preliminary plans to place guardrails around the most advanced AI Models, the core software of artificial intelligence systems like ChatGPT, sources have said.\n\nChip stocks globally tumbled last week after Bloomberg News reported that Biden’s administration was weighing a measure called the foreign direct product rule that would allow the U.S. to stop a product from being sold if it was made using American technology.\n\nSource: https://www.cnbc.com/2024/07/22/-nvidia-preparing-version-of-new-flagship-ai-chip-for-chinese-market-reuters-reports.html",
  "link_flair_text": null,
  "id": "1e9eymb",
  "num_comments": 39,
  "created_utc": 1721656671,
  "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/",
  "comments": [
    {
      "id": "lee8f8x",
      "score": 122,
      "body": "Two big headwinds for Nvidia in this report:\n\n1. If the chips are good, there is a good chance the US government will block them. The US government is determined to stop China from having access to top quality AI chips. If nvidia found a loop hole in sanctions, it will be closed.\n\n2. If the chips are subpar, china may turn to alternate manufacturers (domestic or otherwise) not hindered by US sanctions.\n\nEither way, china is a difficult issue for Nvidia. We shall see how it goes.",
      "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/lee8f8x/",
      "created": 1721662609,
      "depth": 0,
      "replies": [
        {
          "id": "leed76z",
          "score": 53,
          "body": "Restricting NVDA for Chinese markets is quite the boon for Huawei et al, as it let's them be a competitive product while they improve; Free-sale of NVDA would leave very little demand for others.\n\n\nIronically, limiting China from NVDA chips may ultimately be the perfect spur for China to develop their own, properly competitive, NVDA equivalents; by holding back the good stuff, we encourage them to actually develop in a way that the US is expressly stating they don't want.\n\n\nWhich, double ironically, could be good for NVDA as such a development could lower the tensions on Taiwan as TSMC becomes less uniquely important.\n\n\nOverall - it's best for everyone if we keep the missles on the ground.",
          "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/leed76z/",
          "created": 1721664146,
          "depth": 1,
          "replies": [
            {
              "id": "leexsay",
              "score": 18,
              "body": "> Ironically, limiting China from NVDA chips may ultimately be the perfect spur for China to develop their own, properly competitive, NVDA equivalents; by holding back the good stuff, we encourage them to actually develop in a way that the US is expressly stating they don't want.\n\nI mean that's basically what happened with the International Space Station. The US said no to letting China participate in it, citing how they could steal our tech, so the Chinese made their own space station, which is more advanced then the ISS (though part of that is because it was built years later).",
              "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/leexsay/",
              "created": 1721670700,
              "depth": 2,
              "replies": []
            },
            {
              "id": "leexb7u",
              "score": 22,
              "body": "If the sanctions weren't in place China would offer sweet heart government subsidized deals to manufacturers to set up AI chip production in mainland China, then steal all the technology and take it for themselves. At least this way they are going to have to reverse engineer it from scratch or do their usual corporate espionage and infiltration to steal the technology the old fashioned way.",
              "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/leexb7u/",
              "created": 1721670551,
              "depth": 2,
              "replies": [
                {
                  "id": "lehftrf",
                  "score": 6,
                  "body": "I support anything that slow down China surveillance and monitoring progress",
                  "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/lehftrf/",
                  "created": 1721701921,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "leekua2",
              "score": 8,
              "body": "I don't see china catching up to TSMC anytime soon",
              "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/leekua2/",
              "created": 1721666614,
              "depth": 2,
              "replies": [
                {
                  "id": "leel68f",
                  "score": 8,
                  "body": "Definitely not soon, but the current course favours it more than just letting them buy all they want.\n\nI think the 7nm, while far behind TSMCs cutting edge, was a surprising development.\n\n\nAlthough, maybe I recant a little - it depends when using AI to help design the chips becomes pivotal. NVDA suggests it's been a thing for a few years, so 7nm could be on the border of where you want to be able to train models to assist chip design - in which case, restricting the chips will have the intended effects.",
                  "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/leel68f/",
                  "created": 1721666718,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lefmc49",
                      "score": 1,
                      "body": "Smuggling chips isn't hard though when you're talking about a supercomputer or five (as opposed to supplying a retail product line). Pretty much fly to Dubai and put it in a suitcase.",
                      "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/lefmc49/",
                      "created": 1721678487,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "leevzcs",
              "score": 5,
              "body": "Restricting exports to the Chinese market also weakens the silicon shield that Taiwan has.",
              "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/leevzcs/",
              "created": 1721670135,
              "depth": 2,
              "replies": []
            },
            {
              "id": "leere2y",
              "score": 2,
              "body": "That's the point. \n\nThey can make their own. It's gonna take a long time to catch up. But it'll hinder them severely until then. \n\nIt's a win win",
              "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/leere2y/",
              "created": 1721668690,
              "depth": 2,
              "replies": []
            },
            {
              "id": "leeod9d",
              "score": -2,
              "body": "All they've been able to do is reverse engineer so it doesn't sound like a good idea to give them anything to work with. Depending on who wins in November, it wouldn't make sense for the US to block some chips but others.",
              "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/leeod9d/",
              "created": 1721667728,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lehmruu",
          "score": 1,
          "body": "The fuck is an “ai chip”",
          "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/lehmruu/",
          "created": 1721704838,
          "depth": 1,
          "replies": [
            {
              "id": "leijadv",
              "score": 6,
              "body": "A chip designed specifically to handle tasks that are used by AI algorithms in LLMs, for example.   \nSpecialized chips are not that rare. Most chips on the motherboard, cpu aside, are in that category.",
              "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/leijadv/",
              "created": 1721723474,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lejo1a8",
              "score": 2,
              "body": "A chip that handles matrix multiplication and addition very well (These come in the forms of brain cell imitation structures).",
              "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/lejo1a8/",
              "created": 1721743752,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lefds70",
          "score": 1,
          "body": "I don't see the point of NVDia even trying. Scaled down versions can be parallelized more to achieve the same results right?",
          "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/lefds70/",
          "created": 1721675754,
          "depth": 1,
          "replies": []
        },
        {
          "id": "legephm",
          "score": 1,
          "body": "Allowing China to get NVDA can be a bargaining chip (pun intended) to calm that tiger.",
          "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/legephm/",
          "created": 1721687869,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leeefkn",
      "score": 29,
      "body": "Wouldn’t it be a better strategy to tax high end chips sold to China and use the tax revenue to support domestic R&D? What we are doing is only going to help the Chinese get self sufficient faster, and when they do, we will be left behind.\n\nThe Chinese were able to get their hands on high end GPUs by the means of training on cloud providers through middlemen. In a sense, they are paying “taxes”, and we not getting the benefits. Well, the middlemen, the shareholders of the cloud providers, and Nvidia benefited, but I’d like to see public schools and research labs get some of that money.",
      "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/leeefkn/",
      "created": 1721664551,
      "depth": 0,
      "replies": [
        {
          "id": "lefe866",
          "score": -6,
          "body": "Tax on high end chips does not work. They will steal the tech and start producing them cheaply for domestic consumption.",
          "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/lefe866/",
          "created": 1721675897,
          "depth": 1,
          "replies": [
            {
              "id": "lefyysh",
              "score": 11,
              "body": "Steal how? If they were able to copy the chip, not selling them the chip won’t make an iota of difference.",
              "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/lefyysh/",
              "created": 1721682462,
              "depth": 2,
              "replies": []
            },
            {
              "id": "legjeii",
              "score": 4,
              "body": "If that were true, then Moore Threads would have already done it by reverse engineering the 4090 and 7900XTX; yet today, the best MT gaming card isn't much better than an GTX 900 series.\n\nThere's also the fact that even if they had access to the engineering drawings into order to make their own, they'd still need to construct the equipment to do it; which, as shown during Linus Tech Tip's Intel Fab tour, is not a cheap thing to do.",
              "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/legjeii/",
              "created": 1721689554,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "leeb6df",
      "score": 16,
      "body": "Difficult needle to thread, both by nvidia and the US Govt. On the one hand, sure you don't want China to get ahold of high quality tech. On the other, you don't want them going completely domestic either because it's makes the US less secure.",
      "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/leeb6df/",
      "created": 1721663499,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leedqbm",
      "score": 10,
      "body": "They tried it just a couple of months ago, but it didn't work as hoped for\n\nhttps://www.reuters.com/technology/nvidias-new-china-focused-ai-chip-set-be-sold-similar-price-huawei-product-2024-02-01/?utm_source=reddit.com",
      "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/leedqbm/",
      "created": 1721664321,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leelu8z",
      "score": 2,
      "body": "US is going against the free market. It probably will back fire.",
      "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/leelu8z/",
      "created": 1721666928,
      "depth": 0,
      "replies": [
        {
          "id": "lefefbk",
          "score": 12,
          "body": "US never had free market. In a free market, there will be no negotiations with countries",
          "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/lefefbk/",
          "created": 1721675961,
          "depth": 1,
          "replies": [
            {
              "id": "lefjjto",
              "score": 3,
              "body": "As long as Americans believe there is free market. America has poor score in the freedom index. However most Americans still believe in freedom and will fight to defend this dream. Freedom is also in her DNA.",
              "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/lefjjto/",
              "created": 1721677608,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "leenp08",
          "score": 2,
          "body": "Unlike CHINA?",
          "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/leenp08/",
          "created": 1721667513,
          "depth": 1,
          "replies": [
            {
              "id": "leeoekf",
              "score": 5,
              "body": "China is not free market to start with. However, free market is in the DNA of USA. She is fighting against herself.",
              "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/leeoekf/",
              "created": 1721667740,
              "depth": 2,
              "replies": [
                {
                  "id": "leijvhu",
                  "score": 2,
                  "body": "Is it though?    \nFree markets have unchecked cartels, monopolies etc. Because the government doesn't intervene.    \nIn theory the free market should only be dependent on demand and supply but we know that this doesn't work.",
                  "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/leijvhu/",
                  "created": 1721723873,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lekh6jx",
      "score": 1,
      "body": "NVIDIA TO THE MOOOOOOOOOOOOON!!! - [https://baptistaresearch.substack.com/p/inside-nvidias-china-play-going-beyond](https://baptistaresearch.substack.com/p/inside-nvidias-china-play-going-beyond)",
      "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/lekh6jx/",
      "created": 1721753152,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lemo9uz",
      "score": 1,
      "body": "I have 300 Shares of NVDA and 300 of NVDL. While these past 2 weeks have been a downer, I have managed to earn some decent money. Selling covered calls on NVDL is very profitable. And with the stock trading sideways, you can buy to close, sell again.",
      "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/lemo9uz/",
      "created": 1721778987,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lef163u",
      "score": 2,
      "body": "On one end, people say US should keep sanctioning Russia and supplying weapon/money to Ukraine, on the other end, same group of people say US should sell Nvidia chips to China so their stock value can stay high.",
      "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/lef163u/",
      "created": 1721671762,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leh0fzw",
      "score": 1,
      "body": "Foolishness on NVDA's part... while I understand the urge to make money, China is notorious for stealing technology. Any investment in China is an investment in the CCP.",
      "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/leh0fzw/",
      "created": 1721695922,
      "depth": 0,
      "replies": [
        {
          "id": "leik1vf",
          "score": 5,
          "body": "There is a lot more to chip making than seeing and reverse engineering a chip. You have to be able to produce it at a high yield and that takes so much time that by the time you get there, the chip is outdated.     \nYou see with the struggles of intel how much time it takes.     \nThey will probably need a decade to be competitive with the TMSC of today.",
          "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/leik1vf/",
          "created": 1721723993,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lefg5bv",
      "score": 0,
      "body": "Nice work nvda",
      "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/lefg5bv/",
      "created": 1721676517,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lee8kjt",
      "score": -4,
      "body": "How about sending B21s instead ;)",
      "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/lee8kjt/",
      "created": 1721662657,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lefdtx9",
      "score": -2,
      "body": "Lisan Al Galib! Let it rise!",
      "permalink": "/r/stocks/comments/1e9eymb/nvidia_preparing_version_of_new_flagship_ai_chip/lefdtx9/",
      "created": 1721675769,
      "depth": 0,
      "replies": []
    }
  ]
}