{
  "title": "India sends 100 antitrust queries for Reliance, Disney $8.5 billion merger",
  "score": 40,
  "selftext": "India's antitrust body has asked Reliance Industries and Walt Disney around 100 questions linked to their $8.5 billion India media assets merger, including details on sports rights as it heightens its scrutiny of the deal, two sources told Reuters.\n\nAntitrust experts had warned that the Reliance and Disney deal, which was announced in February, could face intense scrutiny as it will create India's biggest entertainment player with 120 TV channels and two streaming services.\n\nThe companies will also together own lucrative rights for cricket, India's most popular sport.\n\nIn a confidential submission to the Competition Commission of India (CCI) in May, the companies said their merger would not hurt the competition, and argued that cricket rights will expire in 2027 and 2028 and allow bidding by rivals, and advertisers can target cricket-watching consumers on many rival platforms including YouTube, Reuters reported in May.\n\nThe CCI has now sought more details via two sets of questions, including why YouTube - which mostly has free, user-generated content - should be treated in the same market as subscription streaming services like Netflix and Disney, two sources familiar with the matter said.\n\nReliance and Disney have responded to the CCI questions and argued YouTube too has its own licensed, paid content as well as a wide reach, said the sources, who declined to be named as the information is confidential.\n\nData from Media Partners Asia last year showed that YouTube accounted for 88% of the online video market in India, while the premium video market of 12% is dominated by streaming services which \"curate premium long-form content\".\n\nReliance-Disney will also own digital and TV cricket rights worth billions of dollars for top cricket tournaments as well as for the Wimbledon tennis championship, which has raised more antitrust concerns.\n\nThe CCI has also asked the companies details on which entity owns which sports rights and for how long, as well as information on who had bid for them previously.\n\n\"The CCI is so far not raising concerns on the rights but is gathering information,\" said one of the sources.\n\nThe requests for so much information could be because of the large size of the deal, said the first source. The second source, however, said the CCI was asking an unusually large number of questions.\n\nReliance, which is led by billionaire Mukesh Ambani, and the CCI did not respond to Reuters requests for comment. Disney declined to comment. The CCI is still reviewing the merger.\n\nIf it closes, the Reliance-Disney deal will reshape India's $28 billion entertainment market where Zee Entertainment and Sony also operate.\n\nJefferies estimates Disney-Reliance will command 40% of the advertising market share in the TV and streaming segments.\n\nSource: https://ca.finance.yahoo.com/news/india-sends-100-antitrust-queries-092540877.html",
  "link_flair_text": null,
  "id": "1e9kp03",
  "num_comments": 5,
  "created_utc": 1721670916,
  "permalink": "/r/stocks/comments/1e9kp03/india_sends_100_antitrust_queries_for_reliance/",
  "comments": [
    {
      "id": "lef9l5z",
      "score": 3,
      "body": "The problem is that Sony / Zee can’t act as a counterweight since that merger imploded earlier this year.",
      "permalink": "/r/stocks/comments/1e9kp03/india_sends_100_antitrust_queries_for_reliance/lef9l5z/",
      "created": 1721674407,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lekkk4e",
      "score": 4,
      "body": "People here aren't aware of Reliance's influence in India. \n\nThey can sway the government, control the media, sponsor politicians, and place bureaucrats in key positions. \n\nDo you think an organization with such power would fear Indian antitrust laws?",
      "permalink": "/r/stocks/comments/1e9kp03/india_sends_100_antitrust_queries_for_reliance/lekkk4e/",
      "created": 1721754202,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leipmwu",
      "score": 6,
      "body": "Reliance owns the country.  No chance this merger doesn’t pass",
      "permalink": "/r/stocks/comments/1e9kp03/india_sends_100_antitrust_queries_for_reliance/leipmwu/",
      "created": 1721727788,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lefp9m0",
      "score": -7,
      "body": "So many businesses named Reliance these days. You're probably talking about RELIANCE (on the NSE), but it could be RS or (very unlikely) a microcap of the same name. It's like CMCSA, UMGNF and a microcap of the same name.",
      "permalink": "/r/stocks/comments/1e9kp03/india_sends_100_antitrust_queries_for_reliance/lefp9m0/",
      "created": 1721679408,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lefp8ab",
      "score": -9,
      "body": "So many businesses named Reliance these days. You're probably talking about RELIANCE (on the NSE), but it could be RS or (very unlikely) RELI. It's like CMCSA, UMGNF and UMGP.",
      "permalink": "/r/stocks/comments/1e9kp03/india_sends_100_antitrust_queries_for_reliance/lefp8ab/",
      "created": 1721679396,
      "depth": 0,
      "replies": []
    }
  ]
}