{
  "title": "Should I invest in a Roth IRA as a 19 year old?",
  "score": 148,
  "selftext": "I’m currently a 19 year old who is looking to invest for my future, I currently have savings amounting to $15,000 and I have been considering opening a Roth IRA, however I plan on retiring prior to being 59 1/2 years old. I have a full ride scholarship to college and don’t have many expenses currently. I feel like I can contribute more than the $7000 Roth IRA limit to VOO stock in my regular stock portfolio and I kinda feel like overtime it would grow much more rapidly than just sitting in my Roth until I’m 60. Tell me what you guys think.",
  "link_flair_text": "Read the wiki",
  "id": "1e9qxcn",
  "num_comments": 287,
  "created_utc": 1721685974,
  "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/",
  "comments": [
    {
      "id": "leg9e8p",
      "score": 1,
      "body": "Welcome to r/stocks!\n\nFor stock recommendations please see our portfolio sticky, sort by hot, it's the first sticky, or see [past portfolio stickies here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all)\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leg9e8p/",
      "created": 1721685975,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legcoqf",
      "score": 68,
      "body": "Always max out your ROTH IRA if it’s within your means.  Honestly, I wish I knew about this stuff at your age.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legcoqf/",
      "created": 1721687149,
      "depth": 0,
      "replies": [
        {
          "id": "lejlfnt",
          "score": 1,
          "body": "Do you know, if I pay 3% into my employer provided Roth which they match, so 6%, do I have to count their match toward the $7,000 limit, or just the amount that I put in? I ask because I'm considering opening my own Roth IRA and I don't know if I'm limited in how much to put in based on what they've put in as well?",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lejlfnt/",
          "created": 1721742845,
          "depth": 1,
          "replies": [
            {
              "id": "lekd69p",
              "score": 4,
              "body": "What you have with the employer is likely a roth 401k, IRA stands for individual retirement account so is not tied to any employer. Roth is an adjective just meaning money is going in post-tax but can apply to multiple different retirement account types. 401ks have annual employee contribution limit of ~23,000 per year, and employer match does not count toward this limit. This limit is separate from 7,000 IRA limit, so maxing both accounts you could put away 30k each year + your employer match.",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lekd69p/",
              "created": 1721751887,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lejthse",
              "score": 2,
              "body": "I don’t know, my ROTH IRA has always been separate from my employer.  I always made sure to put in at least what was needed for my employer match for the 401K, while also maxing out my ROTH IRA.  But if your employer is putting money in your ROTH IRA, then my guess would be that the $7k is the hard limit which includes employer contributions (like HSAs).  I’d encourage you to confirm that with your own research or by consulting your financial advisor.",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lejthse/",
              "created": 1721745591,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lekbkn1",
              "score": 2,
              "body": "Employer match counts to contribution limits, no matter which type of account you are using",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lekbkn1/",
              "created": 1721751376,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "legbim4",
      "score": 273,
      "body": "If the question is “should I invest in my retirement” then the answer is always “yes”.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legbim4/",
      "created": 1721686732,
      "depth": 0,
      "replies": [
        {
          "id": "leh7bra",
          "score": 44,
          "body": "What? Absolutely not.\n\n\"I have a 30% payday loan and live paycheck to paycheck and have no emergency fund, should I invest into retirement?\"\n\nInvesting in retirement makes sense for a lot of people, but not ALL people.\n\nIf someone doesn't have a safety budget or has high interest debt, they absolutely should not invest in retirement",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leh7bra/",
          "created": 1721698573,
          "depth": 1,
          "replies": [
            {
              "id": "leifbgm",
              "score": 6,
              "body": "istg redditors are incapable of nuance. If someone says “don’t give up. If you fall, get back up,” this dude is gonna go like \n\n“well, what if I don’t have legs?”",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leifbgm/",
              "created": 1721720777,
              "depth": 2,
              "replies": []
            },
            {
              "id": "leh9mel",
              "score": 10,
              "body": "Not true.  Everyone should invest in their retirement.  That its a little painful and may feel like something you can’t quite afford indicates you may be doing it right.  It’s easy to come up with a reason not too … budget too tight, I have a car loan, too much on my credit card etc.  Make enough excuses and you’ll one day wonder why you listened to yourself.",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leh9mel/",
              "created": 1721699464,
              "depth": 2,
              "replies": [
                {
                  "id": "lehb5lb",
                  "score": 48,
                  "body": "No. Investing in a retirement fund *probably* averages you around 10% a year compounded in the long run. But paying off debt at 20% interest (just an example) *guarantees* you 20% compounded\n\nPaying off high interest debt should always be the first choice before investing\n\nOn the flip side, investing always comes before paying off low interest debt\n\nBut having a rainy day stash for emergencies, in cash or liquid assets, is also vital. Your advice is too heavy handed",
                  "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehb5lb/",
                  "created": 1721700058,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "leihz43",
                      "score": 10,
                      "body": "He is 19 with 15k cash on full scholarship with low expenses. I can assure u the dude most likely doesnt have high intrest debt, he wouldnt be where he is now if he is the kind that sprue his cash like an idiot on credit card debt for vacations and clubbing. He most likely doesnt have a predatory car loan, he would be burning through his 15k on mods if he was a 19yo car dude.",
                      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leihz43/",
                      "created": 1721722571,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "leiinuy",
                          "score": 2,
                          "body": "[deleted]",
                          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leiinuy/",
                          "created": 1721723045,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "leiix5n",
                              "score": 1,
                              "body": "Honestly a rule of thumb is if the dude is in these investment sub u can skip the pay off debt part. Most of us alrd understand the basics so there is no point in pointing it out, however if u are having this conversation with family members or friends yes pay of the high intrest debt over saving for roth. Only save once u have no debt, but rule of thumb if people ask for advice here skip the pay off debt part most of them are here becuz they look past the illusion of leisure spending.",
                              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leiix5n/",
                              "created": 1721723222,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "leijc29",
                                  "score": 1,
                                  "body": "[deleted]",
                                  "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leijc29/",
                                  "created": 1721723505,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lelqsny",
                          "score": 1,
                          "body": "While you may be correct, it’s not impossible that he has a credit card balance or a car loan. It’s important that he know it’s probably more prudent to pay that down first before contributing to a retirement account.",
                          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lelqsny/",
                          "created": 1721767419,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lekee4o",
                      "score": 1,
                      "body": "Don’t get into debt, first of all!",
                      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lekee4o/",
                      "created": 1721752274,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lehg8z0",
                  "score": 16,
                  "body": "It is asinine to tell someone with a 30% interest liability who has extra cash and is asking what to do with said cash to contribute to an investment account.\n\nThe total return potential needs to be considered here. No amount of tax benefits for investments are going to outpace a 30% interest rate.",
                  "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehg8z0/",
                  "created": 1721702090,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lehlsvv",
                  "score": 15,
                  "body": "Dude no no no no no no holy shit no this is so fucking wrong no no no no no\n\n\nYou will be objectively worse off by not paying off high interest debt. Credit cards are 30% interest, the stock market is 10%. Pay off credit cards before saving for retirement.",
                  "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehlsvv/",
                  "created": 1721704413,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lelqf0m",
                  "score": 1,
                  "body": "There’s an accepted order to allocation of money and retirement is high on the list but *not* the top. \n\nThis is the order you should think about allocating money, as sort of tiered buckets:\n\n1. High interest debt \n2. Emergency fund \n3. 401k up to match \n4. Max Roth IRA\n5. Max 401k \n6. 529 or similar (if you have kids)\n7. Other non-tax-advantaged investing\n\nThe reason for this is high interest debt is not only limiting your funds for further investing but it is likely compounding (negatively) at a higher rate than you would get by investing the money (with even great returns). Every dollar you pay off a 25% credit card loan is the same as investing 25% and making a 25% return. Except that loan keeps compounding at 25% every year and no investor is making 25% returns year over year. \n\nThen you want to max at your 401k company match if your employer offers one. That’s because this is literally free money. If you make 100k and your employer has a 4% match, when you invest 4k, they give you 4k for free, untaxed, that gets to grow tax free until retirement. Congrats you just made a 100% return on your investment! And that now gets compounded over time too. \n\nAfter that it’s prudent to contribute the max to a Roth IRA. The limit is something like 7k right now. That’s because you never have to pay tax on that money (it’s post-tax so you already did when you earned it, but you never pay tax on the gains either). \n\nAfter that, you can go back to your 401k and max that out. You’re not getting a match anymore, but that money is tax deductible and the gains are tax-deferred. You’re also able to borrow against it down the line if that will advance your investing strategy. \n\nIf you have kids, you can contribute to a 529 for education expenses. The contributions are not tax deductible federally, but they often are for state up to a point. The money is allowed to grow tax free as long it’s used for education expenses. \n\nAfter that, any investments will be post tax, and subject to tax. There are more options with these types of investments, but they should be done last unless you are convinced it will yield such a high return that it’s worth it. But this is generally assuming equal returns on each. \n\n\nOf course you may have different plans with your employer or whatnot that can change these slightly but this is likely going to be the case for most people, or the principle should be similar.",
                  "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lelqf0m/",
                  "created": 1721767303,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "leo06dl",
                      "score": 1,
                      "body": "If you have a 401k with a company match … that is free money that exceeds any debt interest you might have short of a loan shark.  100% match to 8% should be taken at 8%.  Not to mention the pre-tax benefit that is reducing the taxable portion of your paycheck.  Nothing short of wild horses should prevent you from taking advantage of that.  Even if the match is 50% … that’s still 50%.  Unless your loan came from Vito at the Pork Store and the interest is actually a vig … you still need to be taking that match to it’s full.\nAnd this does not even take into account the psychology of simply getting yourself in the habit of setting something aside automatically.  Set it and forget it and then operate as if your paycheck (less that investment in your retirement) is what it is.  Pay your bills, live your life.",
                      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leo06dl/",
                      "created": 1721799718,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "leymlnm",
                          "score": 1,
                          "body": "That’s not even necessarily true depending on how long you estimate it will take to pay off your high interest debt. A 401k match might be 100% return immediately *but* it’s only compounding at 10% after that if we’re assuming average market returns. \n\n**Consider this:**\nYou have a $10,000 loan at 30% interest compounding monthly. Let’s say your employer will match up to $2000 per year at 100% in your 401k. If you took your own advice and deposited the $2000 to get the $2000 match every year (distributed quarterly is how it’s usually done) and got 10% returns annually, after 10yrs you’d have almost $68,000. But your loan would have ballooned from $10,000 to over **$200,000!!!** so what good is your retirement account?\n\nConversely, if you contributed that $2000/yr ($500 quarterly with no match) to paying down your loan, you would have it entirely paid off in the 9th year and could start saving for retirement!\n\n\nMath is your friend! It doesn’t have biases!",
                          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leymlnm/",
                          "created": 1721954558,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "leyy47j",
                              "score": 1,
                              "body": "Anyone who would be advising anyone not to take advantage of a 100% match to 8% in a 401k for any reason short of having their legs broken would have no credibility from that moment forward.\nAnd you keep talking about your fictional loan as if it is being totally ignored … nothing paid and as if rates are going to remain where they are.  Neither is true.",
                              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leyy47j/",
                              "created": 1721959216,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "leziexf",
                                  "score": 1,
                                  "body": "You clearly arent grasping this. You shouldn’t put a cent towards anything you would consider an “investment,” that is, 401k, Roth, nothing, until\nYou pay down your high interest debt. \n\nWhat are you talking about rates? Your credit card’s APR doesn’t care what interest rates are, they’re charging you 30% regardless. \n\nIf you feel this way, explain to me in numerical terms why you would put any amount of money in a 401k when you have a loan compounding DAILY at 30%.",
                                  "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leziexf/",
                                  "created": 1721968310,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "leyn0y5",
                          "score": 1,
                          "body": "This is an excellent example of cognitive bias and why you should always write out the math when making these decisions! I would much rather have a 30% return every year than get a 100% match with only a 10% annual return. And this is exactly the decision you’re making when you correctly choose to pay off your high interest debt *before* even contributing to a 100% match! Write it out! You’ll see!",
                          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leyn0y5/",
                          "created": 1721954726,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "leyyk6f",
                              "score": 1,
                              "body": "Math ignores psychology.  I’ve seen many who felt they had a good debt related reason not to invest in their retirement.  Once that debt was addressed, there was something else and something else after that.  Life generally will not let up.  There will always be a reason … something else you think you should be using the money for and you can always begin saving later.  Before you know it … you’re 60 and your realizing you will never be able to retire.",
                              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leyyk6f/",
                              "created": 1721959395,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lezhgsn",
                                  "score": 1,
                                  "body": "Ok so that’s not a reason to make a terrible decision by not paying off your debt. I would actually think that paying off your debt every month would give you the discipline to keep investing once it’s paid off. \n\nYou’d throw away tens of hundreds of thousands of dollars in interest on your debt for psychology?",
                                  "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lezhgsn/",
                                  "created": 1721967825,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lf34oz3",
                                      "score": 1,
                                      "body": "You’d think … but it doesn’t.  Like I said … nearly everybody I have ever seen (and I work in a related business) that puts off saving for retirement for one debt does it again for the next thing and the thing after that.  You cannot recover time.  For that reason you should not give it up.  It’s clear the psychology of getting yourself into paying yourself (saving for retirement) as if its a bill on a regular basis plays no part in your equation.  And you will not convince me that it shouldn’t.  I’ve seen too many people put it off and … every single one of them regrets it.  Every one.  I have not once ever come across someone who said … “boy, I wish I delayed saving for retirement so I could pay off that credit card faster”.  Do both.  You won’t convince me otherwise so it’s time to move on.",
                                      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lf34oz3/",
                                      "created": 1722024395,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lf4yhk7",
                                          "score": 1,
                                          "body": "Do both?? Obviously but you do one first! And that’s pay the debt. \n\nYou said you’ve never heard someone say that but that’s because no one who doesn’t pay off their high interest debt ever gets to retire! Those people don’t exist!",
                                          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lf4yhk7/",
                                          "created": 1722049971,
                                          "depth": 9,
                                          "replies": []
                                        },
                                        {
                                          "id": "lf4yrk0",
                                          "score": 1,
                                          "body": "I’m legitimately asking because you don’t seem to actually be this dense. \n\nDo you not understand how you’re LOSING money by accumulating more debt than you’re gaining in retirement? Can you just explain using real numbers? Because at the end of the day you can be on your high horse about oh I always saved for retirement and you can still not only have less money but actually have NEGATIVE retirement because your debt has outgrown what you’ve saved in the same time period.",
                                          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lf4yrk0/",
                                          "created": 1722050099,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lejv86q",
              "score": 1,
              "body": "I'd argue that paying off stupid debt is an investment in retirement. An increase to net worth which compounds at an especially high rate. Basically buying a bond with a stupidly high yield.",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lejv86q/",
              "created": 1721746163,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "legcd2q",
      "score": 37,
      "body": "Yes but don't put all of it in.\n\nBy all means max out a Roth IRA but save some money for emergencies. If something happens to your car or your health, you'll be glad to have some of that money available.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legcd2q/",
      "created": 1721687034,
      "depth": 0,
      "replies": [
        {
          "id": "lejckt4",
          "score": 3,
          "body": "You can withdraw contributions from a roth at any time so you don't need to be stingy about having a separate emergency fund especially at 19 lol",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lejckt4/",
          "created": 1721739522,
          "depth": 1,
          "replies": [
            {
              "id": "lek8xfp",
              "score": 2,
              "body": "Is there not a penalty applied to early withdrawal?",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lek8xfp/",
              "created": 1721750534,
              "depth": 2,
              "replies": [
                {
                  "id": "leko900",
                  "score": 5,
                  "body": "Contributions can be taken out tax-free, penalty free. Any earnings would be penalized for early withdrawal and most likely taxed barring a 5 yr holding period.",
                  "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leko900/",
                  "created": 1721755337,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lelujqt",
              "score": 1,
              "body": "While you can always withdraw the contributions penalty free, that’s assuming the contributions are still there. That isn’t specific to a retirement account but if you think you’ll need to use the money anytime soon and you hit a year like 2022, your 7k just turned into 5k.",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lelujqt/",
              "created": 1721768596,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "legdj2i",
      "score": 17,
      "body": "Yes! I started around the same age and the growth is kind of insane. If possible always max it out but ideally just put what you can depending on your situation.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legdj2i/",
      "created": 1721687451,
      "depth": 0,
      "replies": [
        {
          "id": "legfh30",
          "score": 0,
          "body": "For example I have been considering dropping around $13,000 of my current savings right into VOO and having $2k aside for emergencies and still continuously investing in it aggressively",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legfh30/",
          "created": 1721688143,
          "depth": 1,
          "replies": [
            {
              "id": "legfsix",
              "score": 8,
              "body": "Keep 6 months living expenses and then dump the rest into like voo/vti in your roth  ira would be my suggestion.\n\nEdit: Also keep in mind the Roth IRA limit is like 7K and slowly goes down based on your income.",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legfsix/",
              "created": 1721688258,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lehjnht",
              "score": 1,
              "body": "Do it. Max out your Roth IRA in either VT VTI or VOO. Forget about it for a while. You’ll watch the magic happen. Always reinvest dividends.",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehjnht/",
              "created": 1721703490,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "legf2ti",
          "score": 1,
          "body": "Yea for me the issue is that I think I could more than max it out which is why I feel like my long term growth would be capped by the $7k limit",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legf2ti/",
          "created": 1721688000,
          "depth": 1,
          "replies": [
            {
              "id": "legi723",
              "score": 8,
              "body": "From my understanding I don’t think there would be the cap you think there will be. If you put 10k into voo in an individual account it would go up and down just the same as if you put 7k into a Roth and then the other 3k in your individual. Especially if you are using a broker that allows you to buy a certain dollar amount instead of share amount. The only difference would be taxes which would be less over time in the Roth.",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legi723/",
              "created": 1721689116,
              "depth": 2,
              "replies": [
                {
                  "id": "legyvdx",
                  "score": 5,
                  "body": "Taxes would be zero in a Roth…eventually. 59.5 years old for a teenager is very hard to imagine. \n\nSame growth different tax structure. Really depends on what this 19 year old is interested in doing with the money",
                  "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legyvdx/",
                  "created": 1721695321,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lehorc1",
                      "score": 2,
                      "body": "Okay yeah, I’m 19 myself. Wasn’t trying to criticize him because I don’t fully know what I’m talking about, still have a lot to learn. What do you mean different tax structure? Just between individual and Roth? Or like is there something else I’m missing? Also I just got off of work so I might not be thinking straight at the moment, so hopefully you don’t take anything as disrespectful cause that was not my intention",
                      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehorc1/",
                      "created": 1721705718,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lejea7i",
                          "score": 2,
                          "body": "No worries! Both a personal brokerage account and a Roth are funded by after tax money. You have total control over what you invest in either account. The tax difference is for example\n\nYou invest 5k in a personal brokerage that increases to 10k. You can take that money out at anytime but you are liable for the 5k of capital gains, the money that grew. Depending on how long you held that stock (short term, long term) as well as what your income tax bracket is the tax rate can vary. So you’d owe the govt somewhere between $750-$1,850. Potentially zero if you have no income \n\nYou invest 5k in a Roth that increases to 10k. If you wait until you are 59.5 yrs old you will pay $0 in taxes regardless of your income tax bracket.\n\nRemember you can always take out all contributions to the Roth prior to 59.5 with no penalty and obv not taxed because you’ve already paid taxes before putting it in. Any gains will be taxed and penalized if withdrawn before 59.5.\n\nIf I was 19 I would try to contribute the max amount to a Roth every year and reinvest the dividends to achieve the highest compounded growth possible.\n\nThis all depends on your investment horizon as in how far out you will need this money. Look up a compound interest calculator with an average growth rate of 7% and your mind will be blown after a few decades of growth and contributing. Good luck",
                          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lejea7i/",
                          "created": 1721740193,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "legipie",
              "score": 4,
              "body": "It's not an either/or.... Max out the Roth, then do any extra into your Retirement account .. the Roth account grows tax free, that's the benefit..the trade off is having to wait to collect on it (tax free)..",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legipie/",
              "created": 1721689303,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lehjy7u",
              "score": 2,
              "body": "The growth isn’t capped because you can do both if you can contribute 20k in a year put 7k into a Roth and the rest into other accounts.",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehjy7u/",
              "created": 1721703619,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "legn8df",
      "score": 10,
      "body": "You can only contribute earned income.  Are you working? Grad student scholarships/fellowships may also count.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legn8df/",
      "created": 1721690947,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leh2t9y",
      "score": 8,
      "body": "10000% yes, I'm now 27 and literally the best decision I have made financially thus far was getting started investing in Roth + brokerage at 19, you will have a step up on the game if you start now no matter the short term conditions of the market simply with the knowledge + time you will have to learn",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leh2t9y/",
      "created": 1721696834,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leggmvx",
      "score": 19,
      "body": "Yo bro I’m 19, started investing $10 mon-fri everyday into VOO in my Roth IRA soon as I turned 18. \n\nI don’t view the money in that account as mine tbh. That shits for my kids and wife in 3739 years. \n\nOfc I’d like to be able to retire before 59.5 too and I like to think the chances of that aren’t going to change whether I’m investing $7k/yr or not. \n\nI’m focusing on getting experience with internships early in college (scholarships too) so I stay ahead of classmates and I can get a high income job that I find some meaning in. \n\nI think it makes more sense to maximise income because you can only save so much. I’d like to think that the $7k ($10k next year) that I’m investing into my Roth IRA won’t impact my retirement plans that much and it will just be icing on the cake when I’m a dinosaur. \n\nGoodluck bro 👊",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leggmvx/",
      "created": 1721688563,
      "depth": 0,
      "replies": [
        {
          "id": "lehigr1",
          "score": 4,
          "body": "ROTH contribution limit is really being lifted to $10K starting next year? Sheesh maybe inflation is nuts",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehigr1/",
          "created": 1721702991,
          "depth": 1,
          "replies": [
            {
              "id": "leijwm6",
              "score": 3,
              "body": "Yes but only for catchup contributions for folks 60-63",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leijwm6/",
              "created": 1721723893,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lehhx01",
          "score": 1,
          "body": "Holy shit you're a mature 19 year old",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehhx01/",
          "created": 1721702762,
          "depth": 1,
          "replies": [
            {
              "id": "lehj0s4",
              "score": 2,
              "body": "I’m 20 and reading their comment was the first time I’ve felt like I wasn’t the only non-idiot in my age bracket lmao",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehj0s4/",
              "created": 1721703224,
              "depth": 2,
              "replies": [
                {
                  "id": "lehje6b",
                  "score": 3,
                  "body": "At 19 I was an idiot. You guys will do well lol.",
                  "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehje6b/",
                  "created": 1721703381,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "legc74p",
      "score": 5,
      "body": "Yes the answer is yes",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legc74p/",
      "created": 1721686975,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legm3uk",
      "score": 5,
      "body": "YES!!!! Easy answer! Put as much into a Roth IRA every year for as long as you possibly can.  If you eventually exceeded the income limitations to contribute to a Roth IRA, then max out your traditional IRA annually. Unless you inherit mega wealth, this is the best way to ensure your retirement.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legm3uk/",
      "created": 1721690531,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leh7hee",
      "score": 4,
      "body": "Roth IRA is a fantastic retirement planning tool. The sooner you achieve $100,000 in the Roth IRA, the sooner you can stop making contributions and allow your portfolio to grow. Don't think now that a retirement plan will fail for you because of what you might think will happen in the future. Better to be financially prepared for changes in your life that you are not prepared to see.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leh7hee/",
      "created": 1721698633,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legsdqn",
      "score": 6,
      "body": "Yes. Yes. And yes. Even if you only invested in a fund that mimics the sp500, you will end up a winner long term. Don't get caught up in any meme stocks.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legsdqn/",
      "created": 1721692884,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legbsej",
      "score": 5,
      "body": "Yes",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legbsej/",
      "created": 1721686828,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legdob3",
      "score": 5,
      "body": "Max out Roth first",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legdob3/",
      "created": 1721687503,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leghzlh",
      "score": 4,
      "body": "Yeeeeeeeeeeeessssssss!!!!!!!!!!!! Compound gains baby!!!",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leghzlh/",
      "created": 1721689041,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legezmr",
      "score": 2,
      "body": "Emergency fund and then put into retirement account",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legezmr/",
      "created": 1721687969,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leghk45",
      "score": 2,
      "body": "Yes as much as you can. Max it out every year.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leghk45/",
      "created": 1721688889,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legj8cx",
      "score": 2,
      "body": "You should absolutely maximize your Roth",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legj8cx/",
      "created": 1721689492,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legln8w",
      "score": 2,
      "body": "Yes",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legln8w/",
      "created": 1721690364,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leglyjs",
      "score": 2,
      "body": "Put the max in the Roth and invest the rest.\n\n60 year old you will be thanking 19 year old you in 40 years.\n\nI started when I was 23,  then hit some lean years where I couldn’t contribute, and I can’t be more thankful for starting early.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leglyjs/",
      "created": 1721690477,
      "depth": 0,
      "replies": [
        {
          "id": "lemjksd",
          "score": 2,
          "body": "invest the rest as in buying shares of voo or something?",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lemjksd/",
          "created": 1721777272,
          "depth": 1,
          "replies": [
            {
              "id": "lemkl8g",
              "score": 1,
              "body": "The would work.",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lemkl8g/",
              "created": 1721777643,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "legnhjn",
      "score": 2,
      "body": "Yes open a Roth and max it out while you can.  You’ll regret it once your income is over the limit and you cant.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legnhjn/",
      "created": 1721691040,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legny9z",
      "score": 2,
      "body": "Yes, the early money in pays the most money out!",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legny9z/",
      "created": 1721691226,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legofga",
      "score": 2,
      "body": "The money sitting in your ROTH won't be accessible until later in life yes, but the benefit is you get to enjoy the growth in the ROTH tax free which will not be the case in a non tax advantaged account.\n\nThis is why people are telling you to max out your ROTH first then invest in a different account if you have left over.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legofga/",
      "created": 1721691408,
      "depth": 0,
      "replies": [
        {
          "id": "leidw61",
          "score": 2,
          "body": "You can always access your money if needed to buy a house.or pay a penalty for early withdrawal ,but you should try and max out your Roth every year because of the No tax advantage",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leidw61/",
          "created": 1721719825,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "legpd9c",
      "score": 2,
      "body": "Never too early to start. Time is on your side at 19. 👍🏼",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legpd9c/",
      "created": 1721691758,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legpu4d",
      "score": 2,
      "body": "Yes. \n\nMax it out and be angry later that you have too much money waiting for your old person self. Blame us for your troubles.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legpu4d/",
      "created": 1721691932,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legq7y8",
      "score": 2,
      "body": "Yes\n\nGive me another Q, I’m on a roll here!",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legq7y8/",
      "created": 1721692076,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legvtqz",
      "score": 2,
      "body": "I'm kind of curious at what age you'll run for president. I hope more of your generation is thinking along this line and preparing themselves for the future in the same way you are. Congrats.  \n\nI'd also recommend staying in VOO; then every now and then dipping into international funds.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legvtqz/",
      "created": 1721694173,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legxg2x",
      "score": 2,
      "body": "If you are strongly against it. Why not just open both stock brokerage account and a Roth IRA. Put your money in the mean time in a money market or a high yield savings account. Then do some research on how you plan to actually achieve early retirement with actual details and steps to reach it. \n\nTo be able to actually visualize it. But also look into why people are telling you why you should reconsider putting your funds towards retirement account.  \n\nRoth IRA has their benefits, there is a reason why Roth IRA has a max amount you are allowed to put into it. While a stock brokerage account doesn’t.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legxg2x/",
      "created": 1721694784,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lehdrfd",
      "score": 2,
      "body": "It's not a bad idea, but I would build up a 20% down payment for a house before putting a lot in retirement. If you start funding retirement, I wouldn't do more than 15% of your yearly income until you have a home.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehdrfd/",
      "created": 1721701094,
      "depth": 0,
      "replies": [
        {
          "id": "lehqmc9",
          "score": 1,
          "body": "You have to think this through for yourself.  Advice from strangers who do not know your full personal situation could be exactly wrong for you.  For financial planning, I believe one needs to consider all the worst-case scenarios you can imagine, not the best-case scenario.  One also needs to consider the opportunity costs of saving for retirement at an age when you might be better off doing other things.  What else might you want that money for?  \n\nOne problem with a Roth IRA is you give up the option to do many other things you might need to do with that money.  If your life goes smoothly, it won't matter that much when you started to save for retirement - you'll be set for life in a reasonable amount of time no matter what.  The big money for retirement comes later in your life and is much larger than $7000/year (even with 20 years of growth).  And if your life gets derailed by an unexpected life event (you or a close family member), it may matter quite a bit whether your money is locked up in some way.  Even if you can make a withdrawal without penalties, the paperwork / forms become a hassle just when you least need it.  \n\nPersonally, our financial priorities here were:\n\n(1) Zero debt\n\n(2) 6-month Emergency Fund\n\n(3) Own computer and car, debt-free, and be saving for the next one.\n\n(4) Down Payment for House\n\n(5) Support for Children (e.g. college fund), \n\n(6) Retirement.   \n\nWe took care of (1) and (2) right away and it sounds like you have too. The importance of (3) and (4) is less obvious than the sales pitches made by retirement companies, but if you're ever injured or sick and end up unemployed facing a repo man, you'll understand the value of (3).  And if you're ever married with children, or just wanting to settle down, you'll understand (4) - it can very well be worth postponing retirement by a few months in order to have a better place to live without the hassles of renting and moving around. As for (5), this is more of a judgment call but suppose you reach 55 and healthy, and financially able to retire - but your 2 children were in college:  Would you choose to help support them (as you were once supported), or would you make them work their way through school so you could relax?  And what would your spouse say about the matter?\n\nWithin the priorities, we nibbled on Retirement while focusing on (4), then (5). \n\nP.S. It's also potentially a mistake to assume Roth rules will last your lifetime. Congress can change the law at any point that it becomes politically convenient.  The crisis point hasn't hit yet, but it's obvious to anyone who looks that the federal finances have not been this difficult since the end of WW2, and extreme policy choices will need to be made within a few years.",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehqmc9/",
          "created": 1721706571,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leheave",
      "score": 2,
      "body": "Absolutely. You'll thank yourself sooner than you realise. You don't have to grow old to see benefit, knowing that money's there will give you a different outlook on life and more flexibility as expenses start mounting up in your late 20s early 30s",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leheave/",
      "created": 1721701308,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lehf5c6",
      "score": 2,
      "body": "I wish I had maxed Roth at 19, let alone 30.\n\nYou don’t need all your retirement money at 59 1/2 on day one.\n\nA Roth is just a tax advantaged investment account…it will essentially grow at the same rate only tax free.\n\nYou can withdraw contributions before 59 1/2 penalty free…20y @ 7k is 140k (assuming no YoY contributions increases)",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehf5c6/",
      "created": 1721701646,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legl0ax",
      "score": 4,
      "body": "Read the rules on a Roth IRA.  The money has to stay in your account at least 5 years.  Once that clock starts, IT NEVER RESETS with additional deposits.  By age 25 you are good to go to withdraw (again read the rules as to parameters) but you have forever met the 5 year requirement.\n\nBoth of my kids have a $5 Roth IRA but their clock is ticking.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legl0ax/",
      "created": 1721690136,
      "depth": 0,
      "replies": [
        {
          "id": "legv9fk",
          "score": 4,
          "body": "The 5 year rule simply prevents you from paying a fee if you pull it out prior to 59 1/2.  Even after 5 years, you can only pull out contributions tax free.  Until you reach 59 1/2, any withdrawal of earnings is taxed.  Getting past the 5 year rule early is not that beneficial unless you compare to waiting until mid fifties.",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legv9fk/",
          "created": 1721693958,
          "depth": 1,
          "replies": []
        },
        {
          "id": "legl760",
          "score": 1,
          "body": "But you still pay gains tax after removing it right? After 5 years you are just spared from the early removal penalty",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legl760/",
          "created": 1721690204,
          "depth": 1,
          "replies": [
            {
              "id": "legzqn3",
              "score": 3,
              "body": "You are correct. However you can take out any contribution amount without penalty or taxes (since you’ve already been taxed on contributions of a Roth)",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legzqn3/",
              "created": 1721695651,
              "depth": 2,
              "replies": []
            },
            {
              "id": "legmwwz",
              "score": 3,
              "body": "Not on a Roth.  Roth IRA grows tax free.  Gains are tax free upon withdrawal.\n\nFor example.  When I bought 200 shares of Nvidia at $375 way back when, ALL of my gains are growing tax free upon withdrawal.  And even when I trimmed my position 2 weeks ago and reinvested in other, all of my trimmings are tax free.  I just keep everything under the Roth IRA umbrella.  \n\nAnd I am also allowed to add up to $8,000 per year to my IRA and my wife added another $8,000 as a spousal IRA (traditional) and we take a reduction to our AGI for that.  Knowledge goes along way.",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legmwwz/",
              "created": 1721690828,
              "depth": 2,
              "replies": [
                {
                  "id": "leh3upl",
                  "score": 4,
                  "body": "Yes, but if you were to withdraw it before 59 1/2, those gains would be taxed.",
                  "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leh3upl/",
                  "created": 1721697232,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "legsudw",
      "score": 2,
      "body": "Don’t overdo the tax deferred accounts, you have a long life ahead of you.  Have a balance between savings and the Roth.  You can invest in many things such as VOO within your Roth.\nIn the future you will need your savings for cars, a house, marriage and kids most likely.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legsudw/",
      "created": 1721693057,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leh3fld",
      "score": 1,
      "body": "Yes!   It’s never too early to invest in yourself and your future!",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leh3fld/",
      "created": 1721697071,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leh3fyp",
      "score": 1,
      "body": "You still have some tough education to go through if you think you can consistently beat the market.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leh3fyp/",
      "created": 1721697075,
      "depth": 0,
      "replies": [
        {
          "id": "leh3j2o",
          "score": 1,
          "body": "To be fair VOO literally tracks the market lol",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leh3j2o/",
          "created": 1721697108,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leh3ogh",
      "score": 1,
      "body": "YES.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leh3ogh/",
      "created": 1721697165,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leh51fh",
      "score": 1,
      "body": "If you can contribute more than 7k. Max out the Roth in large cap growth. And put additional money in a taxable brokerage account. Then pick your own stocks or ETFs, crypto, etc.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leh51fh/",
      "created": 1721697686,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leh6uot",
      "score": 1,
      "body": "100 bucks now is thousands in 40 years, something is always better than nothing",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leh6uot/",
      "created": 1721698388,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lehajri",
      "score": 1,
      "body": "Max out your roth ira but don't just let it sit as cash. Put in an index fund. Too many people just leave cash in their IRA for years never realizing they had to put it in stocks/index fund.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehajri/",
      "created": 1721699826,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lehbq5y",
      "score": 1,
      "body": "A Tale of Two Savers ([Graphic](https://i.pinimg.com/originals/a3/47/d3/a347d3e6beb3f9a6dbea41482e807b77.jpg))",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehbq5y/",
      "created": 1721700282,
      "depth": 0,
      "replies": [
        {
          "id": "lehbvhm",
          "score": 1,
          "body": "Imagine if guy #2 didn’t stop investing too😭",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehbvhm/",
          "created": 1721700342,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lehbr1c",
      "score": 1,
      "body": "I have my emergency funds and all that other shit.  Every year in January I drop the whole 6500 into the Roth and it will drip from there into an index fund.  I save up the next 6500 and do that forever.  Got about 40000 in there meow.  \n\n\nI trade in my other account for extra, but I mostly save cash for a down-payment.   ",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehbr1c/",
      "created": 1721700292,
      "depth": 0,
      "replies": [
        {
          "id": "lejen53",
          "score": 2,
          "body": "You know the 2024 limit is $7k right.\n\nSorry if you already knew that, just would hate for you to not max it for the year.",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lejen53/",
          "created": 1721740333,
          "depth": 1,
          "replies": [
            {
              "id": "lew0ob3",
              "score": 1,
              "body": "I'm gonna go make sure I loaded it up! ",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lew0ob3/",
              "created": 1721923134,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lehff1m",
      "score": 1,
      "body": "Thank you everybody for the feedback! Definitely a lot of great thoughts to consider",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehff1m/",
      "created": 1721701754,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lehfsxp",
      "score": 1,
      "body": "First, I’ll admit to not reading all comments.  I apologize if someone has already addressed this.  You stated you have money in savings.  Did you earn it from a job during the year?  You can only contribute to a IRA to the extent of your EARNED” income during the year.  (Traditional or Roth IRA are the same.). Earnings for 2024 would allow for a contribution in the calendar year 2024, and up to the deadline for filing, April 15th, 2025.  \nHere is some information.  The site link is below.  \n\n“You can open a Roth IRA at an online broker and then choose your own investments. You can build a diversified portfolio with just three or four mutual funds that are in different asset classes. When comparing brokers, look at trade commissions and the investment fees of their offered funds (also called expense ratios).”\n\n[https://www.nerdwallet.com/article/investing/how-and-where-to-open-a-roth-ira](https://www.nerdwallet.com/article/investing/how-and-where-to-open-a-roth-ira)",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehfsxp/",
      "created": 1721701911,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lehhtb4",
      "score": 1,
      "body": "You are on the right track! Here is the difficult part we dont know about all your finances to give you spot on advice.  Living expenses sneak up in College, is your room and board included in the scholarship? Do you need a car in college or have emergency fund for a repair?  \n\nI would start a roth with putting $2k in voo and see how college expenses impact your budget.  If you’re fine and savings are growing try to slip another $1k here and there over to the Roth.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehhtb4/",
      "created": 1721702720,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lehicxd",
      "score": 1,
      "body": "Before roths, when I was young I put what was then the 2 k limit into a 401k for four years.  At 65, that account is now 150 k and I think that it would be bigger had I picked a better mutual fund family",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehicxd/",
      "created": 1721702946,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lehijmt",
      "score": 1,
      "body": "Yes",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehijmt/",
      "created": 1721703025,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lehjys6",
      "score": 1,
      "body": "Man, I wish I would have",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehjys6/",
      "created": 1721703625,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lehkjvd",
      "score": 1,
      "body": "Invest in your IRA as early as you can.\n\nThat will rack up in value before you it.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehkjvd/",
      "created": 1721703874,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lehrq1r",
      "score": 1,
      "body": "OP. In your situation I would have a Roth IRA, an individual IRA, an interest bearing savings account and a checking account. Good luck 👍",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehrq1r/",
      "created": 1721707087,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lehv68m",
      "score": 1,
      "body": "Yeah but it’s kinda like the gambling ideology; only put in what you’re willing to “lose” although lose is the wrong word because it’s tax free after 67.5 I believe. It might change in coming years but it’s a pretty safe bet",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehv68m/",
      "created": 1721708770,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lehvmda",
      "score": 1,
      "body": "$7,000 now, assuming you don’t pull any money out, and hit a general return of 7.5% on average until you are 65 is worth about $200,000.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehvmda/",
      "created": 1721708997,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lehz9aj",
      "score": 1,
      "body": "I have a Roth IRA through E\\*TRADE. It's a full featured brokerage account, I requested and am approved for level 2 options trading in it. You can just contribute the max for this year, then buy VOO in the Roth account and when you eventually need it, all the gains will be tax-free.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lehz9aj/",
      "created": 1721710919,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lei3tsz",
      "score": 1,
      "body": "I have a question pertinent to this discussion. An 19 year old has lots and lots of time until retirement. Is there any reason you wouldn’t recommend Vanguard’s growth ETF VOOG over VOO?",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lei3tsz/",
      "created": 1721713519,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lei9r38",
      "score": 1,
      "body": "Only if you want to guarantee you’re set at retirement. If you max it out every year from now  till 30 and never touch it again you’d be over 1m easily",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lei9r38/",
      "created": 1721717127,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leibalc",
      "score": 1,
      "body": "It’s going to grow at the same rate just gonna get taxed differently if you have no debt go for it but there is a limit on how much you can put in roth so max that out then put the rest in your regular account.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leibalc/",
      "created": 1721718108,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leicssb",
      "score": 1,
      "body": "I feel like you may be confused on some points regarding the Roth. You choose what to invest your Roth funds in. So you can invest it in VOO if you want. Or do a mix, or whatever. If you just let money sit in the Roth WITHOUT investing it, then it won’t grow. I’ve observed lots of people who don’t understand that you don’t just put your money into an IRA or 401k, you have to pick investments for that money. People *do* make that mistake, failing to invest it.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leicssb/",
      "created": 1721719096,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leig4b8",
      "score": 1,
      "body": "Yes.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leig4b8/",
      "created": 1721721313,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leip5g2",
      "score": 1,
      "body": "You said you have saved $15,000. You never mentioned that you have Earned Income. So based on that you CAN’T open a Roth IRA or a Traditional IRA or make contributions to either one. Now, a couple of things: 1st, if you already have a Traditional IRA you can convert it to a Roth IRA. 2nd, if you were able to have an IRA you can buy VOO there, your earnings will be larger since you will not be taxed on them and they will compound tax free year after year, while they will be taxed in a regular brokerage account. Remember, though that for your earnings to be considered qualified and be a tax free (in a Roth IRA) distributions, they have to remain in the Roth until after (you are 59 and a half, current law) you can always take your contributions any time, since they have been taxed prior to entering the Roth IRA.\nEdit: this where you can find all the information related to IRA. Pub 590-A, contributions, 590-B, distributions. https://www.irs.gov/site-index-search?search=Publications+590&field_pup_historical_1=1&field_pup_historical=1",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leip5g2/",
      "created": 1721727465,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leipva1",
      "score": 1,
      "body": "Yes!  Even if you plan to retire before 59 1/2 you’ll still need money after you are 59 1/2.\n\nIf you max out a Roth at $7500 per year, (the max will go up, but let’s just say $7500 per year), and get a 6% annual return then your total account balance at 60 years old would be around $1,329,000 of TAX FREE MONEY.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leipva1/",
      "created": 1721727944,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leirgt6",
      "score": 1,
      "body": "I’m 40 and no Roth IRA. I invest in QQQM, SPLG and BTC. (Nasdaq, S&P 500 and crypto) I prefer to have my money now rather than when I’m in my 70’s",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leirgt6/",
      "created": 1721728974,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leite6x",
      "score": 1,
      "body": "yes invest in the roth---you can buy whatever stock you want in the roth\n\nanything above the Roth investment can be invested in whatever you want",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leite6x/",
      "created": 1721730182,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leiyssd",
      "score": 1,
      "body": "If I could go back in time and be 19 again I sure as hell would.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leiyssd/",
      "created": 1721733247,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lej5pz6",
      "score": 1,
      "body": "If you don't have any taxable income you won't be able to invest into either IRAs.\n\nIf you do max out that Roth this year save the other amount for emergency expenses or into a rolling 6mo CD",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lej5pz6/",
      "created": 1721736605,
      "depth": 0,
      "replies": [
        {
          "id": "lej839g",
          "score": 2,
          "body": "I should have probably included this but I made around 12,000 in profit from online ebay selling this year and I have 2 jobs as well",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lej839g/",
          "created": 1721737651,
          "depth": 1,
          "replies": [
            {
              "id": "lejatwi",
              "score": 1,
              "body": "Well shit my guy your good to go then! Your going Fat Fire GL!",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lejatwi/",
              "created": 1721738818,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lej9506",
      "score": 1,
      "body": "Yes.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lej9506/",
      "created": 1721738102,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lejcq4k",
      "score": 1,
      "body": "> I’m currently a 19 year old...\n>\n>  I plan on retiring prior to being 59 1/2 years old\n\nAlso you\n\n> Should I invest in a Roth IRA\n\nLots to learn before early retirement is on the table :D",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lejcq4k/",
      "created": 1721739581,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leje6sj",
      "score": 1,
      "body": "Yes.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leje6sj/",
      "created": 1721740157,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lejeag5",
      "score": 1,
      "body": "Yes",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lejeag5/",
      "created": 1721740195,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lejhonf",
      "score": 1,
      "body": "Absolutely yes. And just read a bit about this: just save like 15% of every income you have into it, compounding is astronomical from 19!!",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lejhonf/",
      "created": 1721741483,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lejmdri",
      "score": 1,
      "body": "From a tax perspective, investing in roth early in your career will typically work out better than traditional IRA. Then, consider switching to traditional IRA between 35 and 40. This is just my opinion, consult your tax advisor for specifics.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lejmdri/",
      "created": 1721743177,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lejp5en",
      "score": 1,
      "body": "You can invest in a self directed Roth just like a self directed IRA. The only difference is that you are investing after tax dollars and there will not be tax able event when you take money out. Your Roth could mirror your regular investment account of you could be more aggresive.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lejp5en/",
      "created": 1721744132,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lejr0yy",
      "score": 1,
      "body": "for various tax reasons, if i had it to do over again, i would have maybe 2/3 in a ROTH, and 1/3 in a standard IRA.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lejr0yy/",
      "created": 1721744764,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lejv42o",
      "score": 1,
      "body": "Yes.  The answer is always yes.\n\nIt doesn't matter when you plan on retiring. The answer is yes.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lejv42o/",
      "created": 1721746126,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lejw3nr",
      "score": 1,
      "body": "Remember you can always take out your contributions from the Roth tax and penalty free. \n\nThe gains you’ll have to wait on, but isn’t a 15-20%+ tax negation worth it?\n\nWhen do you think you’ll retire? If you’re gonna retire before 60 you’ll have to make a lot of money. You think $7k per year is gonna stop that from happening if you’re making a lot of money? Just invest outside the Roth (and 401k for that matter) as well if you wanna invest more.\n\nExample - put $7k in your Roth IRA and invest that in VOO. Use your remaining $1k to invest in VOO inside a normal brokerage. Years from now you can take that $7k back out of the Roth tax and penalty free.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lejw3nr/",
      "created": 1721746448,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lejyu2p",
      "score": 1,
      "body": "If you can you definitely should. Everyone who did start one at 19 wishes they did. You’ll have a boat load of money when you retire if you max out every year or at least put in some value every year",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lejyu2p/",
      "created": 1721747338,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lejzkkk",
      "score": 1,
      "body": "Max out roth, then max out traditional. You realistically shouldnt have a regular stock portfolio untill/unless you have already maxed those out. ",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lejzkkk/",
      "created": 1721747575,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lek4wgw",
      "score": 1,
      "body": "Do you have emergency fund for expense worth 4-6 months? If not I would first put that money aside in HYSA for emergency fund. Once cover 4-6 months of expense, then start Roth IRA. You can’t withdraw money you will transfer in Roth IRA. So think twice. If you have emergency fund, you can start saving in Roth IRA.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lek4wgw/",
      "created": 1721749267,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lekeqph",
      "score": 1,
      "body": "Save your money so you can pay cash!\nWhen you owe money to someone, you will become their servant or slave!",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lekeqph/",
      "created": 1721752385,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lekfmdk",
      "score": 1,
      "body": "Short answer: Yes\n\nLong answer: Heck yes",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lekfmdk/",
      "created": 1721752661,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lekl6vq",
      "score": 1,
      "body": "A Roth is pay now and not later when it comes to taxes. If you think you’ll have a larger income later then taxes are essentially on sale now if you invest in a Roth. If you think you’ll have less income later in life then you may want to prioritize 401k/IRA for the tax deduction now (spend less on taxes when you’re making more $$). That said, laws change, life changes, so I’m a fan of balancing out savings within a Roth and a 401(k)/IRA to give you flexibility. There are certain times you can withdraw without penalty before 59.5 years old btw (such as paying for education or buying a first home). \nYou can invest in what you want to in a Roth btw (depending on the provider you choose). So you can have the same VOO growth but with paying the taxes now and not later. \nFood for thought and hope it helps. \n\nKeep in mind, although I’m a Financial Advisor this is not specific advice as I don’t know your entire situation and you are not engaged with me as a client. Also, investments carry risk of loss.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lekl6vq/",
      "created": 1721754400,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leklv51",
      "score": 1,
      "body": "I really need someone to explain this to me because it’s not adding up.😂\n\nSo yes I understand that the tax advantage of maxing out your Roth makes sense but not being able to take it out before 59 years old is what is making me reconsider why it’s the best to do so first. How isn’t putting money away into a apy 5% savings account where you can always withdraw your money or use it for a downpayment not a better choice? Let’s say you are in your 30s and want to invest into a property. How would you be able to do it with your Roth account without getting taxed? Also why would you even need money at age 60? That age is so depressing and if you haven’t lived your life to the fullest before that age that money won’t do anything for you in my opinion. You are already old. Who in that age out here hustling and getting into buying property when your knees hurt? I understand that the potential amount to make money is crazy but again being that old who really needs money rather than health. Feel like while we are young we are gonna be needing a property for starting a family not when your 60 and almost third of your life is up. \n\nWhat do you guys think?",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leklv51/",
      "created": 1721754611,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lekvw6a",
      "score": 1,
      "body": "Just open a brokerage account and buy an index fund.  Do not put the money away in some tax-deferred vehicle where you won't be able to use it for some major life expeditures coming your way (cars, housing).  Putting aside money in a retirement account, that you clearly won't be able to afford to leave there until retirement, is an expensive mistake.\n\nYou can save money and get a good return and pay taxes on the return every year, it'll work better at your age.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lekvw6a/",
      "created": 1721757717,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lel7f9h",
      "score": 1,
      "body": "For some reason, I’m giggling at 59 ½ years old (in a good way). It’s just so specific, lol. Anyway, look into alphaAI.capital. It’s an AI robo advisor. It manages your stock portfolio with leveraged ETF strategies for high returns.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lel7f9h/",
      "created": 1721761343,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leljo2c",
      "score": 1,
      "body": "If it is within your means to max out your ROTH then yes you absolutely should. My biggest regret is not starting one earlier. If you cannot max it every year that is totally fine but getting one started and contributing what you can this early on is a huge deal.\n\n  \nAlso realize this is rare for someone in your age group. Take it seriously and try not to be arrogant about it to others.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leljo2c/",
      "created": 1721765203,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lelkfyy",
      "score": 1,
      "body": "Yes. I started when I was 20. Turning 27 now and it's the best decision I've made.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lelkfyy/",
      "created": 1721765443,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lelo3c2",
      "score": 1,
      "body": "Might as well.\n\nBut remember,  even if it makes millions of bagillions of dollars....who wants to be rich when you're about to die from old age lmao.\n\nIdeally you should use extra money to buy assets and businesses that return something up front",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lelo3c2/",
      "created": 1721766578,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lelzokh",
      "score": 1,
      "body": "Hmm... So, apparently U have never heard of taxes, huh?\n\n**The benefits of a Roth IRA vs a standard non-tax-deferred investment account:**\n\n**Tax Treatment:**\n\n**Roth IRA:** You contribute post-tax dollars to a Roth IRA. The account grows tax-free, and qualified withdrawals (after age 59½, and the account must have been opened for at least five years prior) are also tax-free. Roth IRA contributions are not deductible, but your account grows tax free, and you pay no taxes when you withdraw your funds in retirement.\n\n**Standard Non-Tax-Deferred Account:** In a non-tax-deferred account (such as a regular brokerage account), you pay taxes on capital gains, dividends, and interest each year.\n\n**Roth IRA:**\n\n**Tax Treatment:**\n\n* Contributions are not tax-deductible.\n* Account grows tax-free.\n* No taxes on withdrawals in retirement.\n* Contribution Limits: Annual contribution limits apply.\n* Withdrawals: No early withdrawal penalties (after age 59½).\n* Tax Reporting: No need to report investment earnings on taxes.\n* Ideal For: Long-term retirement savings.\n\n**Standard Non-Tax-Deferred Investment Account (Brokerage Account):**\n\n**Tax Treatment:**\n\n* Contributions are not tax-deductible.\n* Capital gains taxes on investment gains.\n* Contribution Limits: No contribution limits.\n* Withdrawals: No early withdrawal penalties.\n* Tax Reporting: Must report investment earnings annually.\n* Ideal For: Investing additional money beyond retirement accounts.\n\nIn summary, if you’re saving for retirement, prioritize a Roth IRA for its tax-free growth and tax-free withdrawals. A brokerage account offers more flexibility but lacks the tax advantages of a Roth IRA.\n\n\\*\\*\\*",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lelzokh/",
      "created": 1721770277,
      "depth": 0,
      "replies": [
        {
          "id": "lelzqve",
          "score": 1,
          "body": "**Hypothetical investment model** \n\nHypothetical investment model showing a $15,000 investment earning 6.5% compounded interest **over 40 years** in 2 separate accounts. One account is a Roth IRA, and the other account is regular brokerage account for a person in a 15% tax bracket.\n\n**Roth IRA:**\n\n* Annual contribution: $15,000 (max allowed)\n* Estimated rate of return: 6.5%\n* Tax treatment: Tax-free growth and withdrawals after age 59½\n* Balance at retirement: Approximately **$1,319,7411**.\n\n**Standard Brokerage Account:**\n\n* Same initial investment: $15,000\n* Estimated rate of return: 6.5%\n* Capital gains taxes apply (15% tax bracket)\n* The result is approximately **$249,728**. ",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lelzqve/",
          "created": 1721770298,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lem009z",
          "score": 1,
          "body": "Ofc Ik abt taxes, I just think I can contribute much more than the 7k limit every year so overtime I was wondering if the corresponding growth including the gains tax hit would be better than Roth gains",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lem009z/",
          "created": 1721770385,
          "depth": 1,
          "replies": [
            {
              "id": "lem27jn",
              "score": 1,
              "body": "Umm... Uncle Sam wants his cut. So, if you're cool giving away your money, just keep it a regular brokerage account then. And when U turn 59 you'll see for yourself how good Uncle Sam can rob U, without U even noticing it...",
              "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lem27jn/",
              "created": 1721771118,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lem9dxr",
      "score": 1,
      "body": "you can always withdraw the original amount deposited. Just not the growth. so if you deposit 7k this year and it grows to 8k you can withdraw 7k at anytime without penalty. Just can’t withdraw the growth without paying taxes and penalties",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lem9dxr/",
      "created": 1721773604,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leml6j1",
      "score": 1,
      "body": "Yes, the earlier you start saving the better off you will be later.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leml6j1/",
      "created": 1721777858,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lemx9mn",
      "score": 1,
      "body": "Nah bro invest in stocks on robinhood then use the profits to invest in roth IRA",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lemx9mn/",
      "created": 1721782367,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leowch8",
      "score": 1,
      "body": "YES.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/leowch8/",
      "created": 1721820110,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lesrba3",
      "score": 1,
      "body": "Yes, max it ",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lesrba3/",
      "created": 1721868295,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lexrtqa",
      "score": 1,
      "body": "One of the best moves you could make",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lexrtqa/",
      "created": 1721943168,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf6b18u",
      "score": 1,
      "body": "If I were you I'd invest in knowledge. Training, courses...many things have changed in the last 15 years. And many more tools available, indeed. If you want more especific advice let me know.",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/lf6b18u/",
      "created": 1722080137,
      "depth": 0,
      "replies": []
    },
    {
      "id": "legel1t",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legel1t/",
      "created": 1721687825,
      "depth": 0,
      "replies": [
        {
          "id": "legloks",
          "score": 3,
          "body": "You can always take the contributions out with no penalty from a Roth IRA. No taxes or penalties.",
          "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legloks/",
          "created": 1721690378,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "legqatz",
      "score": 1,
      "body": "**YES**",
      "permalink": "/r/stocks/comments/1e9qxcn/should_i_invest_in_a_roth_ira_as_a_19_year_old/legqatz/",
      "created": 1721692107,
      "depth": 0,
      "replies": []
    }
  ]
}