{
  "title": "GM far exceeds second-quarter estimates, will restructure struggling China unit",
  "score": 38,
  "selftext": "General Motors is raising several key financial targets for 2024 after easily beating Wall Street’s earnings expectations for the second quarter, while it restructures money-losing operations such as autonomous vehicles and its China business.\n\nThe Detroit automaker now expects full-year adjusted earnings before interest and taxes of between $13 billion and $15 billion, or $9.50 and $10.50, up from previous guidance of $12.5 billion to $14.5 billion, or $9 and $10, previously. It also raised its adjusted automotive free cash flow forecast, while slightly lowering the range for its net income attributable to stockholders by less than 1%.\n\nHere’s how the company performed in the second quarter, compared with average estimates compiled by LSEG:\n\nEarnings per share: $3.06 adjusted vs. $2.75 expected\nRevenue: $47.97 billion vs. $45.46 billion expected\nShares of GM were up about 4% during pre-market trading. The stock is up roughly 38% in 2024.\n\nGM’s second-quarter results included net income attributable to stockholders, which excludes some dividend payouts, of $2.93 billion, up 14.3% from $2.57 billion a year earlier. On a per-share basis, GM reported earnings of $2.55, up from $1.83 a year earlier. Adjusted earnings before interest and taxes came in at $4.44 billion, up 37.2%, and adjusted earnings per share were $3.06.\n\nIts unadjusted net income was $2.88 billion, up 14.8% from a year earlier. GM said its revenue for the second quarter was a new quarterly record for the automaker, up 7.2% compared to $44.75 billion a year earlier.\n\n“It was truly a great first half and second quarter, and we’re positioned to have a very strong year,” GM CFO Paul Jacobson said during a media briefing. “We expect to see some seasonally higher commodity costs, as well as some pricing headwinds that we’ve assumed in the second half of the year.”\n\nAlongside the strong earnings, GM on Tuesday said it is indefinitely pausing production of its Cruise Origin autonomous vehicle, triggering a $600 million special charge in the second quarter. It also said it’s attempting to restructure a joint venture in China with SAIC amid continuing losses, including a $104 million loss in equity income during the second quarter.\n\nNorth America leads\n\nAs they have in recent years, GM’s North American operations, driven by truck sales, were largely responsible for the company’s second-quarter beat and guidance raise. Specifically, pricing on the vehicles has remained more resilient than GM anticipated at the beginning of the year, according to Jacobson.\n\nGM said its average transaction price during the second quarter was roughly $50,000, with incentives lower than the U.S. industry average.\n\nThe North America division increased adjusted earnings during the quarter to $4.43 billion, up nearly 40% from a year earlier. The unit reported a profit margin of 10.9%, up 2.3 percentage points from a year earlier.\n\nWhile GM outperformed in several areas, it did not achieve an anticipated return to profitability in China, where the automaker has experienced significant declines in earnings.\n\nThe automaker’s Chinese operations posted an equity loss of $104 million – its second consecutive quarterly loss after hitting a roughly 20-year low in 2023.\n\n“In China, we’ve been taking steps to reduce our inventories, align production to demand, and reduce our fixed costs, but it’s clear that the steps that we’ve taken, while significant, have not been enough,” Jacobson said during a media briefing. “We’re working closely with our JV partner to restructure the business, to make it profitable and sustainable, while ensuring that it doesn’t require incremental capital.”\n\nGM’s international operations, which include South Korea, Brazil and the Middle East, reported adjusted earnings of $50 million during the second quarter, down 78.8% from a year earlier. Its financing arm reported adjusted earnings of $822 million, up 7.3% from a year earlier.\n\nEVs\n\nGM continues to target production and vehicle wholesales of between 200,000 and 250,000 all-electric vehicles in North America, despite slower-than-expected adoption.\n\nIts EV deliveries during the quarter increased 40% compared to a year earlier to 21,930 units. Still, EVs made up only 3.2% of its total second-quarter U.S. sales.\n\nJacobson reconfirmed that GM expects its EVs to be profitable on a production, or contribution-margin basis, once it reaches production of 200,000 units by the fourth quarter.\n\n“EVs are going to be an earning headwind as we scale, until we reach variable profits positive during the fourth quarter, then they should start to become a tailwind for EBIT,” he said.\n\nJacobson declined to discuss potential plans to delay or cancel the automaker’s plans for EV battery cell production in North America, aside from two joint venture plants currently producing cells with LG Energy Solution in Ohio and Tennessee.\n\n“We’re going to continue to be guided by the customer. We’re rapidly scaling in cell plants one and two,” Jacobson said. “We have nothing to comment on right now.”\n\nLast week, GM CEO Mary Barra said the automaker’s goal of reaching EV production capacity of 1 million vehicles in North America by the end of 2025 was heavily in doubt..\n\nSource: https://www.cnbc.com/2024/07/23/general-motors-gm-earnings-q2-2024.html",
  "link_flair_text": null,
  "id": "1ea5982",
  "num_comments": 17,
  "created_utc": 1721733362,
  "permalink": "/r/stocks/comments/1ea5982/gm_far_exceeds_secondquarter_estimates_will/",
  "comments": [
    {
      "id": "leiz0t1",
      "score": 1,
      "body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1ea5982/gm_far_exceeds_secondquarter_estimates_will/leiz0t1/",
      "created": 1721733363,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lej9qjd",
      "score": 21,
      "body": "How? I just don't understand. I see their trucks sitting on lots unsold and growing inventory everywhere. It just doesn't make sense.",
      "permalink": "/r/stocks/comments/1ea5982/gm_far_exceeds_secondquarter_estimates_will/lej9qjd/",
      "created": 1721738361,
      "depth": 0,
      "replies": [
        {
          "id": "lejh9nw",
          "score": 25,
          "body": "That's exactly why. They are selling to dealers. dealers aren't moving inventory. This'll blow up in the long term",
          "permalink": "/r/stocks/comments/1ea5982/gm_far_exceeds_secondquarter_estimates_will/lejh9nw/",
          "created": 1721741327,
          "depth": 1,
          "replies": [
            {
              "id": "lejopj1",
              "score": 13,
              "body": "It's basically the calm before the storm. Eventually the dealers won't be able to keep buying. I do think the auto industry is in for a rude awakening within the next 1 to 2 years.",
              "permalink": "/r/stocks/comments/1ea5982/gm_far_exceeds_secondquarter_estimates_will/lejopj1/",
              "created": 1721743983,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lejuvuo",
      "score": 17,
      "body": "GM is probably a great stock to own in the short term, but it’s fascinating watching them throw away their entire future for these short term profits.\n\nThis was the company that just a few years ago was claiming that they’d surpass Tesla in EV deliveries by 2025. Here we are just a few quarters out and they’re literally 20x behind and the gap has only widened. They’ve walked away from EV partnerships, shelved their autonomous vehicle research, massively delayed or outright cancelled multiple EV manufacturing and battery facilities… \n\nThey’ve just buried their head in the sand that the world is still transitioning to electric by 2035 and chosen to squeeze the last drops of demand out of ICE.",
      "permalink": "/r/stocks/comments/1ea5982/gm_far_exceeds_secondquarter_estimates_will/lejuvuo/",
      "created": 1721746051,
      "depth": 0,
      "replies": [
        {
          "id": "lek5uvc",
          "score": 15,
          "body": "The world is not transitioning to EVs by 2035. Other brands are already walking back EV targets and even Europe is admitting the 2035 goal is looking increasingly impossible. \n\nToyota is probably on the money by suggesting the EV market cap in the US could reach around 30%. Hybrid, PHEV, alternative fuels, and regular ICE vehicles will still have a place.",
          "permalink": "/r/stocks/comments/1ea5982/gm_far_exceeds_secondquarter_estimates_will/lek5uvc/",
          "created": 1721749564,
          "depth": 1,
          "replies": [
            {
              "id": "leke0r0",
              "score": 3,
              "body": "Not a full transition, but I can see half the vehicle sales being EV by 2035. The country spearheading this will be China (just look at the vehicle export number since last year) who can make EVs for cheap. The nations adopting them will be non-oil producers who have every incentive to transition for energy security reason.",
              "permalink": "/r/stocks/comments/1ea5982/gm_far_exceeds_secondquarter_estimates_will/leke0r0/",
              "created": 1721752156,
              "depth": 2,
              "replies": [
                {
                  "id": "lekflfi",
                  "score": 1,
                  "body": "The IEA can make that 50% estimate but I doubt we will get close by 2035. IMO the big question is if China tensions continue to escalate leading to high tariffs and bans on the export of cheap Chinese EVs + batteries. In the worst case a Chinese invasion of Taiwan will have consequences for the global EV market.",
                  "permalink": "/r/stocks/comments/1ea5982/gm_far_exceeds_secondquarter_estimates_will/lekflfi/",
                  "created": 1721752653,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lekh0c4",
                      "score": 4,
                      "body": "High tariffs for nations that have auto industry to save, and not many nations actually have a domestic vehicle champion. \n\nOther countries that fully import vehicles could careless. \n\nJust look at Australia. Chinese vehicle imports are surging because they have no domestic industry to save.",
                      "permalink": "/r/stocks/comments/1ea5982/gm_far_exceeds_secondquarter_estimates_will/lekh0c4/",
                      "created": 1721753097,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "leo7fsb",
                          "score": 3,
                          "body": "Where are the major economies that don’t produce vehicles?\n\nI just checked, the only g20 countries that don’t have huge car industries (1m+ vehicles per year) are Russia, Australia, Italy(900k), and Saudi Arabia.\n\nEvery major country maintains vehicle production as its critical heavy industry.  Those Sherman tanks were made by Chrysler.  I’m pretty sure ford’s first mustang was the p51 fighter escort.\n\nNo one is gonna conquer the world of automotive by export.",
                          "permalink": "/r/stocks/comments/1ea5982/gm_far_exceeds_secondquarter_estimates_will/leo7fsb/",
                          "created": 1721804177,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lekiine",
                          "score": -1,
                          "body": "Australia could be one of many countries that curtail Chinese imports if an invasion of Taiwan occurs.",
                          "permalink": "/r/stocks/comments/1ea5982/gm_far_exceeds_secondquarter_estimates_will/lekiine/",
                          "created": 1721753568,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lekjo58",
                              "score": 8,
                              "body": "Sure, but they'll keep buying till it happens. Consumers like cheap things.",
                              "permalink": "/r/stocks/comments/1ea5982/gm_far_exceeds_secondquarter_estimates_will/lekjo58/",
                              "created": 1721753924,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lekcxjx",
          "score": 1,
          "body": "> They’ve just buried their head in the sand that the world is still transitioning to electric by 2035 and chosen to squeeze the last drops of demand out of ICE.\n\nMost legacy automakers will simply not pull off the EV transition. \n\nI don’t know if it’s Tesla haters or GM/Toyota/VW/BMW fans but we’ve already seen BlackBerry and Nokia go kaput during the smartphone transition. \n\nIt’s the same song and dance time and time again and investors should be smarter than this.",
          "permalink": "/r/stocks/comments/1ea5982/gm_far_exceeds_secondquarter_estimates_will/lekcxjx/",
          "created": 1721751810,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lek03l9",
      "score": 3,
      "body": "Down 7 percent sheesh",
      "permalink": "/r/stocks/comments/1ea5982/gm_far_exceeds_secondquarter_estimates_will/lek03l9/",
      "created": 1721747742,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lejsuxn",
      "score": 2,
      "body": "For clarity is a vehicle delivered to a dealership 'sold' in gms accounting? I'm not Haring just trying to grasp how they beat here when they are getting killed in China.",
      "permalink": "/r/stocks/comments/1ea5982/gm_far_exceeds_secondquarter_estimates_will/lejsuxn/",
      "created": 1721745378,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lepcptg",
      "score": 1,
      "body": "GM, like VW, had a huge lead in China and they fucked it up by managing like westerners rather than Chinese.  Now they get to lick BYD scraps if they are lucky.",
      "permalink": "/r/stocks/comments/1ea5982/gm_far_exceeds_secondquarter_estimates_will/lepcptg/",
      "created": 1721827220,
      "depth": 0,
      "replies": []
    }
  ]
}