{
  "title": "UPS again .… ",
  "score": 40,
  "selftext": "I looked at the earnings. yes they were shit. But if you change the perspective, then the stock was unfairly penalized. Sales and freight demand have stagnated, which can sometimes happen in an economic phase like the one we are in. \nWe have already seen this in the past. However, its competitor Fedex did better in the last quarter. \nWhy could the company’s stock \nbe suffering so much? \n\nYesterday my position was the 4th largest, now it's somewhere in the middle again. I will continue to purchase UPS because my opinion of the company has not changed. \n\nif you are a UPS investor, please share your opinion",
  "link_flair_text": "Company Discussion",
  "id": "1eac9y4",
  "num_comments": 35,
  "created_utc": 1721752297,
  "permalink": "/r/stocks/comments/1eac9y4/ups_again/",
  "comments": [
    {
      "id": "lel2n3j",
      "score": 32,
      "body": "I'm curious why you believe in the stock. To me, it looks horrible. Technologically advanced and cash rich Amazon is coming for them hard. They have no real plan on how to counter this. They continue to raise their dividend and underfund their own tech advancements. The union has them by the balls. The company was once considered an incredibly stable career for salary workers and they just had salaried layoffs and are forcing attrition by forcing employees back into the office. On top of this, they're outsourcing business functions overseas and sold their freight business. None of these moves toward a higher EPS have worked. \n\nIt is a company scrambling to find permanence in an industry it once dominated. management (not to be confused as Leadership) is unfit. If all you're looking for is dividends you can trust that their board will continue to approve increases until the end.",
      "permalink": "/r/stocks/comments/1eac9y4/ups_again/lel2n3j/",
      "created": 1721759841,
      "depth": 0,
      "replies": [
        {
          "id": "lele3g6",
          "score": 9,
          "body": "Not being able to fire bad workers is their biggest impediment to competing with Amazon. One more bad union contract, and they could be in serious trouble. ",
          "permalink": "/r/stocks/comments/1eac9y4/ups_again/lele3g6/",
          "created": 1721763469,
          "depth": 1,
          "replies": [
            {
              "id": "lfe2dip",
              "score": 0,
              "body": "It wasn't a bad union contract",
              "permalink": "/r/stocks/comments/1eac9y4/ups_again/lfe2dip/",
              "created": 1722199386,
              "depth": 2,
              "replies": [
                {
                  "id": "lffbjei",
                  "score": 1,
                  "body": "The union thugs made a lot of money while the real workers all got screwed. ",
                  "permalink": "/r/stocks/comments/1eac9y4/ups_again/lffbjei/",
                  "created": 1722217284,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "leoaww7",
              "score": -5,
              "body": "In the end, this is good because the state is offering a bailout package to save the company and protect the jobs of hundreds of thousands of people",
              "permalink": "/r/stocks/comments/1eac9y4/ups_again/leoaww7/",
              "created": 1721806455,
              "depth": 2,
              "replies": [
                {
                  "id": "leocsef",
                  "score": 9,
                  "body": "Keeping bad companies afloat by taking money from workers at the threat of violence hurts us all. Biden is giving out billions in corporate welfare to keep horrible companies from dying. We need to let the grifters fail. ",
                  "permalink": "/r/stocks/comments/1eac9y4/ups_again/leocsef/",
                  "created": 1721807719,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "leoxgnt",
          "score": 1,
          "body": "> Technologically advanced and cash rich Amazon is coming for them hard.\n\nThey basically practised in India, one of the most challenging logistics markets in the world. \"Hard\" is an understatement for the kinds of experience they gained and lessons they learned. Operating in developed markets will be child's play by comparison.",
          "permalink": "/r/stocks/comments/1eac9y4/ups_again/leoxgnt/",
          "created": 1721820673,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lekgbmv",
      "score": 22,
      "body": "Good luck fighting the market. Whether you are right or wrong is irrelevant. Only the price of the stock pays.\n\nI am not an investor, but certainly would not consider stepping in front of a falling knife. If you are correct in our assessment, the institutions will agree and purchase the stock. Based on the technicals, this stock could fall to the 111 area before finding such support.",
      "permalink": "/r/stocks/comments/1eac9y4/ups_again/lekgbmv/",
      "created": 1721752882,
      "depth": 0,
      "replies": [
        {
          "id": "lelmo66",
          "score": 7,
          "body": "Yes market sentiment is a monster to fight. Every trained investor would have looked at Teslas revenue and growth rate and said it's overvalued but it's continued to climb hundreds of percents since then.",
          "permalink": "/r/stocks/comments/1eac9y4/ups_again/lelmo66/",
          "created": 1721766138,
          "depth": 1,
          "replies": [
            {
              "id": "lemnl6m",
              "score": 7,
              "body": "94% of trained investors don't beat the S&P 500 over time.   They are perhaps the worst performing group of experts in any field in the history of mankind.   That is not an exaggeration.   Don't put your faith in them.  \n\n[https://www.ginsglobal.com/articles/94-of-us-fund-managers-underperform-sp-500-over-20-years/](https://www.ginsglobal.com/articles/94-of-us-fund-managers-underperform-sp-500-over-20-years/)",
              "permalink": "/r/stocks/comments/1eac9y4/ups_again/lemnl6m/",
              "created": 1721778738,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lem1knt",
              "score": 2,
              "body": "Why I do not attribute any \"value\" to a stock other than its price. Value is what the market is willing to pay, not some magic PE ratio. AMZN was \"overvalued\" for most of its big run while it was a 10-bagger.",
              "permalink": "/r/stocks/comments/1eac9y4/ups_again/lem1knt/",
              "created": 1721770905,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "leochn2",
          "score": 1,
          "body": "There is some long-term support around the century area for sure.",
          "permalink": "/r/stocks/comments/1eac9y4/ups_again/leochn2/",
          "created": 1721807515,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lel5zce",
      "score": 7,
      "body": "Lots of business left UPS last year due to strike fears.  Most of that business was 1 year contracts with FedEx, LazerShip, etc.  Let’s see how much of it comes back.",
      "permalink": "/r/stocks/comments/1eac9y4/ups_again/lel5zce/",
      "created": 1721760888,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lekh3qy",
      "score": 9,
      "body": "You just mentioned it yourself, FedEx did better last quarter. The market looks at potential gains within the near future, why would they hold a stock that did worse than their rival?\n\nThis isn't to say the stock won't recover, but from a straight financial perspective, you would obviously buy the winner and dump the loser. It's a similar situation with Airbus and Boeing",
      "permalink": "/r/stocks/comments/1eac9y4/ups_again/lekh3qy/",
      "created": 1721753128,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lelufr4",
      "score": 7,
      "body": "Not a UPS holder because their service is terrible. \n\nPaid nearly $40 to have my son's ID *overnighted* to him for a flight in a couple days. According to their online tracking, it sat at the intaking UPS store for 2 days. I was treated with arrogance when I called to ask about it.\n\nThen the shipment dropped off the radar for 2 more days. Now, not only was he not getting his ID in time, but it was lost. Called again. Told I could not even get a refund until it was located.\n\nThe envelope eventually got bounced illogically from station to station until it arrived a week late, after he had returned from said trip, using an expired DL. Was instructed I had to physically go to the originating UPS store to file for a refund, which I resentfully did.\n\nWhen I finally got the check, they had *subtracted their fuel cost*. No apology. No attempt to make amends for the inconvenience and possibly retain my patronage.\n\nThis was failure on multiple levels. I said never again. I can't be the only one.",
      "permalink": "/r/stocks/comments/1eac9y4/ups_again/lelufr4/",
      "created": 1721768560,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lekl4je",
      "score": 5,
      "body": "Not a UPS holder, but UPS priced us out this year significantly. We loyally used them for every package for years. The new contract they sent us was a fucking joke. Fedex responding by slashing prices by like 75% of what UPS was asking.\n\nEven with 3rd party sellers, like PirateShip/eBay/Amazon, UPS is BY FAR the highest cost for EVERY package. Most people utilizing shipping services, are looking to ship the cheapest. Quality and Speed are not even a thought.\n\nI know other E-Commerce sellers reporting the same thing. I used to also receive packages daily from UPS. This year, I rarely even seen them in my neighborhood. Everyone switched to Fedex/USPS.",
      "permalink": "/r/stocks/comments/1eac9y4/ups_again/lekl4je/",
      "created": 1721754379,
      "depth": 0,
      "replies": [
        {
          "id": "leoxrkn",
          "score": 1,
          "body": "UPS likely fired a lot of unwanted business last year: low volume shippers, shippers with small and lightweight parcels etc.",
          "permalink": "/r/stocks/comments/1eac9y4/ups_again/leoxrkn/",
          "created": 1721820826,
          "depth": 1,
          "replies": [
            {
              "id": "lepats0",
              "score": 1,
              "body": "They make the most profit per package off low volume shippers and lightweight parcels.",
              "permalink": "/r/stocks/comments/1eac9y4/ups_again/lepats0/",
              "created": 1721826498,
              "depth": 2,
              "replies": [
                {
                  "id": "leqkdcq",
                  "score": 2,
                  "body": "trust me on this, you're incorrect. i work in the industry including working directly with UPS (and my organization ships millions of parcels per year, of varying sizes including with UPS - i'm intimately familiar with all levels of their pricing and their costs). \n\nno carrier wants low volume lightweight clients. this is the worst margin profile possible in the shipping industry. it's why USPS is blowing up its lightweight parcel products.\n\nanyone with keen eyes ought to be laser focused on the shipping industry next year. i've just handed you a gold nugget wrapped in a trash bag, do what you will with it",
                  "permalink": "/r/stocks/comments/1eac9y4/ups_again/leqkdcq/",
                  "created": 1721841447,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "leo1m2w",
      "score": 2,
      "body": "Between here and 110 you have a pretty good trading range on the monthly. UPS has effectively given back the entire pandemic run up. \n\nAre you going to lose money if you cost average in at this point? It's unlikely. The second question though, will you beat the s&p 500 over the next 5 years? That's where it gets a little less certain",
      "permalink": "/r/stocks/comments/1eac9y4/ups_again/leo1m2w/",
      "created": 1721800566,
      "depth": 0,
      "replies": [
        {
          "id": "leo2ds1",
          "score": 2,
          "body": "My strategy is mainly to collect dividends. UPS was and is a wonderful dividend payer. Beating the S&P is not my goal. I am only slightly worried about my dividend portfolio. \nI will watch the situation, as UPS is under pressure hopefully management will take care of it and clean it up a bit. \nmaybe they want to start outperforming the competition again.",
          "permalink": "/r/stocks/comments/1eac9y4/ups_again/leo2ds1/",
          "created": 1721801028,
          "depth": 1,
          "replies": [
            {
              "id": "leo3686",
              "score": 0,
              "body": "If you're building a dividend portfolio there is an excellent argument for UPS, TLT, potentially STT, I wish it wouldn't have ran up so much. Maybe watch that one and get it in the '70s if there's a pullback. \n\nGlobal shipping is not slowing down in the long run, there are near-term issues but look at the discount you're getting the stock at and where you're at on the monthly chart. I don't think I would go balls deep but slowly cost averaging in. Sure, especially with what you just said about a dividend portfolio. Same thing with TLT. We straight up tested the highs or lows depending on how you look at it of the financial crisis. Basically TLT tested all time lows on the monthly, you're building this pattern of higher highs and higher lows very slowly, it's actually at a great accumulation point right now. If I was looking to build a dividend portfolio of those two would be on the list only I would lean harder on TLT, less risk. UPS, acquire slowly, maybe some funds pick it up and it pops back to 140, if that happens within 30 or 60 days probably dump the shares, take your profit, that's one of the reasons I like picking up these high quality companies when they have massive sell-offs. It seems like about 50% of the time there's a quick rebound and you can get a good fast trade out of it, if not you still have your fundamental and long-term views and a strategy for going into it",
              "permalink": "/r/stocks/comments/1eac9y4/ups_again/leo3686/",
              "created": 1721801508,
              "depth": 2,
              "replies": [
                {
                  "id": "leobhlo",
                  "score": 2,
                  "body": "That sounds logical, thank you. \nI think UPS is just going through a bad phase, as all companies have already had. \nIt is very important that UPS manages to get out of this „crisis“ so that it can prove its competitive advantage. Because a company that proves to be strong in tough times wins on the stock market.",
                  "permalink": "/r/stocks/comments/1eac9y4/ups_again/leobhlo/",
                  "created": 1721806844,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "leqivh2",
                      "score": 2,
                      "body": "100% agree",
                      "permalink": "/r/stocks/comments/1eac9y4/ups_again/leqivh2/",
                      "created": 1721840982,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "leqk8i2",
                          "score": 1,
                          "body": "Analysts expect an improvement in the 4th quarter.\nHowever, profits and cash flow should not fall much further. At the moment, it is just enough to cover the current dividend and the 500 million share buyback programme.",
                          "permalink": "/r/stocks/comments/1eac9y4/ups_again/leqk8i2/",
                          "created": 1721841406,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lekgcg5",
      "score": 7,
      "body": "EPS is declining rapidly ever since they signed the deal to increase wages to $170k. Unfortunately now they need to do layoffs if they want to get the stock back on track.",
      "permalink": "/r/stocks/comments/1eac9y4/ups_again/lekgcg5/",
      "created": 1721752890,
      "depth": 0,
      "replies": [
        {
          "id": "lekp3e8",
          "score": 2,
          "body": "They already have cut ties with 12k non union people. Contractually, they have some different lay-off language that allows daily layoff, but those people still can work in other functions.",
          "permalink": "/r/stocks/comments/1eac9y4/ups_again/lekp3e8/",
          "created": 1721755591,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lelilug",
          "score": -1,
          "body": "They have been laying off union people left and right, thousands of my union brothers and sisters have lost their jobs. Btw we do not make 170k, that’s some bs the company put out.",
          "permalink": "/r/stocks/comments/1eac9y4/ups_again/lelilug/",
          "created": 1721764870,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lemggho",
          "score": 0,
          "body": "$170k is some pretty sweet pay",
          "permalink": "/r/stocks/comments/1eac9y4/ups_again/lemggho/",
          "created": 1721776136,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lenrdf2",
      "score": 1,
      "body": "Bullish AMZN",
      "permalink": "/r/stocks/comments/1eac9y4/ups_again/lenrdf2/",
      "created": 1721794961,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leo8pxd",
      "score": 0,
      "body": "maybe the stock going down since 2020 is because you’re getting 5% of the company in dividends every year. as opposed to 2% with fedex. also market cap for UPS is higher and eps is lower, so yeah good company but they’re worldwide already, where will the growth come from?",
      "permalink": "/r/stocks/comments/1eac9y4/ups_again/leo8pxd/",
      "created": 1721805000,
      "depth": 0,
      "replies": [
        {
          "id": "leoangw",
          "score": 1,
          "body": "UPS has such a high dividend yield because the stock keeps falling. average is at the same level as Fedex.\nThe demand for freight delivery is growing with the world’s population. More new people = more consumption = more work = more companies = more homes = more delivery, ...",
          "permalink": "/r/stocks/comments/1eac9y4/ups_again/leoangw/",
          "created": 1721806279,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}