{
  "title": "Tesla v. Volkswagen",
  "score": 204,
  "selftext": "Here are some key metrics for Tesla\n\n* Revenue is $95B\n* Net Income is $13B\n* Market Cap is $785B\n* P/S is 8.3\n* P/E is 60.4\n\nHere is some data for Volkswagen\n\n* Revenue is $322B\n* Net Income is $15B\n* Market Cap is $58.4\n* P/S is 0.2\n* P/E is 3.9\n\nIf Tesla were priced like VW, then it would be worth about $50/share, tops. Yet it sits at $250/share.",
  "link_flair_text": "Company Discussion",
  "id": "1eamluh",
  "num_comments": 170,
  "created_utc": 1721777605,
  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/",
  "comments": [
    {
      "id": "lemrna3",
      "score": 187,
      "body": "VW actually became the most valuable stock in the world in 08 lmao shit has a crazy history aswell.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lemrna3/",
      "created": 1721780239,
      "depth": 0,
      "replies": [
        {
          "id": "leo7hxr",
          "score": 49,
          "body": "VW stock becomes a lot of shit as an investment, nevertheless longterm it was a good investment and does what a company should do: since decades one of the largest companies on the planet producing profit and returning it to its investors. Not just hyping stock price. Always crazy when an established 300bn return global market player is compared to return scenarios of shitty startups (not meaning tesla).\n\nI am German and many older guys are invested since forever. Getting crazy returns and dividends on their initial investment. But sure, at 300bn revenue over a dozen brands and all over the planet with a lot of legacy problems, it’s not a giant growth story.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leo7hxr/",
          "created": 1721804216,
          "depth": 1,
          "replies": [
            {
              "id": "leuhxh2",
              "score": 3,
              "body": "We need an easy way to include dividends in these comparisons. But then it gets hazy wrt reinvesting those cause for most people it's not technically feasible.",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leuhxh2/",
              "created": 1721900786,
              "depth": 2,
              "replies": []
            },
            {
              "id": "leoqsyp",
              "score": -18,
              "body": "Nah i wouldn't invest in car companies period, it had the biggest short squeeze ever though went to 1000 euros per share was actually a contributing factor to the crash in 2008.",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leoqsyp/",
              "created": 1721817058,
              "depth": 2,
              "replies": [
                {
                  "id": "leovk0p",
                  "score": 12,
                  "body": "Oh yeah? How did it contribute exactly? I’m asking, because I don’t know.",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leovk0p/",
                  "created": 1721819703,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "leoxogx",
                      "score": -1,
                      "body": "In sequence of events it was interest rates raised effecting people with ARM mortgages, VW squeeze sucking liquidity from SPY,  ARM borrowers defaulting, Bear Stearns going bankrupt from MBS bonds. Then retail panic.",
                      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leoxogx/",
                      "created": 1721820784,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lep308z",
                          "score": 7,
                          "body": "That’s not true.  It was a closing of a spread ppl had on between Porsche and vw. There was no borrow in the vw part.   It was a symptom of market stress but in no way affected spy other than general get risk off books sentiment",
                          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lep308z/",
                          "created": 1721823272,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lep3t8p",
                              "score": 1,
                              "body": "The shorts lost 40B i linked a graph further down the thread, definitely added fuel too the fire spy was trending down and tanked when VW hit its peak",
                              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lep3t8p/",
                              "created": 1721823624,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lep55j4",
                                  "score": 2,
                                  "body": "It didn’t influence spy at all imho. All it reflected was hedge funds doing their brains in a spread that blew out (partly as a result of risk off elsewhere due to the gfc).  vw spike culminated in Oct 30th 2008 whereas spy bottomed in march 6/9 2009.\n\nWhat I’m trying to say it was a symptom of the gfc and not a cause of the spy crash. Spy would have crashed regardless of a few hf doing their brains in Europe.",
                                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lep55j4/",
                                  "created": 1721824203,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lep8k9x",
                                      "score": 3,
                                      "body": "Yea i agree it did not cause the crash the federal reserve/investment banks taking 2 trillion in losses on MBS bonds obviously way bigger issue. This is more of a case of adding fuel to the fire 40b in liquidity being sucked from the market accelerated the initial losses and momentum and lack of liquidity took over from there.",
                                      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lep8k9x/",
                                      "created": 1721825606,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "leoyuh9",
                          "score": 1,
                          "body": "Right. Cheers.",
                          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leoyuh9/",
                          "created": 1721821351,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lep1n3m",
                  "score": 1,
                  "body": "https://imgur.com/a/9ysmzII",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lep1n3m/",
                  "created": 1721822659,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "leq0upx",
          "score": 11,
          "body": "ah. I remember the day Porsche family told short sellers to fuck off.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leq0upx/",
          "created": 1721835337,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lemp8sf",
      "score": 140,
      "body": "Just wait until robotaxis come along. Any day now.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lemp8sf/",
      "created": 1721779342,
      "depth": 0,
      "replies": [
        {
          "id": "len819f",
          "score": 80,
          "body": "Robotaxi may be the worst product launch of the decade.\n\n- Tight tight Margins \n- Highly competitive market \n- liability issues \n\n- Would you ride in a driverless vehicle if the App required your insurance to cover the vehicle or simply call an Uber?\n\n- Would you lend your car for strangers to ride in, % taken off the top to Tesla, Battery used, & pay liability coverage?\n\n- Would Tesla cover insurance for an entire fleet?\n\nRobotaxi will be a failure upon the 6 month mark.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/len819f/",
          "created": 1721786559,
          "depth": 1,
          "replies": [
            {
              "id": "len8y6u",
              "score": 113,
              "body": "Can't be the worst product launch if it never launches",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/len8y6u/",
              "created": 1721786916,
              "depth": 2,
              "replies": [
                {
                  "id": "leqwums",
                  "score": 10,
                  "body": "Elon really has thought of everything",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leqwums/",
                  "created": 1721845311,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lesphwk",
                  "score": 2,
                  "body": "Looks like a future tax write off for all that revenue they don’t really have",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lesphwk/",
                  "created": 1721867597,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lenctqu",
              "score": 20,
              "body": "Also to add:\n\n* Regulation would slow ANY rollout while $TSLA fanboys seem to think it can be turned on like a light switch.\n* Tesla Robotaxi has 0 paid rides/0 paid miles while Waymo hit 2m paid rides/20m paid miles recently with the expectation of ending the year around 5-6m rides.\n* FSD has literally reverted due to liability to FSD-S\n* Economic disincentive to sell cars capable of robotaxing if they had a NPV of 120k/4years. Why would Tesla give up something that could make that much per vehicle?\n* No discussion of any infrastructure that would reasonable support a fleet of robotaxis.\n* Uber/Lyft exists yet people haven't given up their cars (at least in America) and neither companies are really that profitable to justify a 3/5 Trillion dollar valuation.",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lenctqu/",
              "created": 1721788454,
              "depth": 2,
              "replies": [
                {
                  "id": "lenqi6y",
                  "score": 13,
                  "body": "Who cleans up the taxi when the previous customer, for example, vomits? ",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lenqi6y/",
                  "created": 1721794528,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lenuqup",
                      "score": 14,
                      "body": "Optimus of course",
                      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lenuqup/",
                      "created": 1721796694,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lenrtuk",
                      "score": 12,
                      "body": "When $TSLA was having issues with their service department, people on Twitter were hoping to volunteer to help $TSLA get more cars to their owners. \n\nSo those idiots I suppose.",
                      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lenrtuk/",
                      "created": 1721795191,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "leouzbe",
                          "score": -4,
                          "body": "I'm just curious: What does your returns look like?",
                          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leouzbe/",
                          "created": 1721819401,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lep8wku",
                      "score": 5,
                      "body": "Uber and Lyft have the exact same issue, it should be easy to identify which customer threw up and fine them",
                      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lep8wku/",
                      "created": 1721825739,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ler38k6",
                          "score": 2,
                          "body": "No Uber and Lyft have drivers that must also cleanup puke.",
                          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/ler38k6/",
                          "created": 1721847315,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "leph6vq",
                      "score": 0,
                      "body": "This is clearly the least difficult problem to solve. I think the reality is that customers puking, while it does happen, is fairly rare. Probably less than one ride out of 300. If you get a robotaxi that is dirty, you signal it in the app, they send the dirty robotaxi back to get cleaned and you get a new one a few minutes later. It sucks, but maybe Tesla gives you a free ride to compensate you (sorry we made you late! here's a free ride or two!).\n\nThere's also going to need to be one or more charging parks somewhere in the city. You can pay students minimum wage to inspect the cars once a day and clean them up as needed while the cars are charging, which will take between 20 minutes to an hour per charging session.\n\nLong term, the cars do have an internal camera. You should be able to detect some strange behavior. It's not impossible to train a deep learning model to detect people puking. Even if the model is not 100% accurate, you have to figure Tesla is going to have some kind of control center that can review footage. Someone somewhere is going to get a popup that says \"DID THIS PERSON JUST PUKE YES/NO?\".\n\nI also feel like training Optimus to inspect and clean cars is not that far fetched. The inspection part should definitely not be hard because those cars are going to have self-opening doors, so Optimus just needs to walk around and look inside, have enough training data to know what a dirty car seat/floor looks like. Having optimus actually clean a car is a harder task, but I can imagine that it should be able to hold and use a small vacuum cleaner to clean crumbs. The outside of the car you can clean in a fully-automated car wash. Can Optimus clean car seats? Maybe it can, because Tesla will likely design their robotaxis with non-porous, easy to clean seats on purpose.",
                      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leph6vq/",
                      "created": 1721828862,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lerhorh",
                          "score": 1,
                          "body": "Anytime now",
                          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lerhorh/",
                          "created": 1721851887,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lep9e0o",
                  "score": 3,
                  "body": "Even if they somehow allow it to be \"turned on instantly\", the moment an accident happens, the entire network should be stopped - same as with planes. Whatever SW bug made the first car crash, it could potentially affect any other car in the fleet. That's why it's critical that the system is scaled slowly, while putting in place the necessary infrastructure to make sure:\n\n1. The car doesn't move unless it's 100% sure it won't cause an accident.\n\n2. There are processes in place to quickly get unstuck any car that for whatever reason can't continue autonomously in a certain situation.",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lep9e0o/",
                  "created": 1721825931,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "leqdq9b",
                  "score": 1,
                  "body": "FSD  works (almost) in dry good weather conditions. How will it work in snowy conditions.",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leqdq9b/",
                  "created": 1721839379,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "leo73wc",
              "score": 7,
              "body": "Interestingly, Tesla likes to go after all the low margin industries: cars, solar panels, batteries, electricity, taxis. None of these are high margins and most are commodities. Nobody cares about the brand of their battery or solar panel, they just want the most kWh for their bucks",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leo73wc/",
              "created": 1721803967,
              "depth": 2,
              "replies": [
                {
                  "id": "lepf55t",
                  "score": 7,
                  "body": "> Nobody cares about the brand of their battery or solar panel, they just want the most kWh for their bucks\n\nFor batteries I think that's definitely not true. Batteries can catch fire and burn down your house, so you definitely don't want to go with some random Chinese outfit with a brand name like LiveHappyPower or YuiCell. You also want to couple your home batteries with a good inverter. Tesla offers a fully-integrated system. That being said, the money is likely not in home solar and batteries, Tesla is clearly aiming for grid-scale batteries.",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lepf55t/",
                  "created": 1721828122,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "let8pll",
                      "score": 1,
                      "body": "I mean sure there's some baseline safety requirement, but ultimately most batteries use the same cells from one of the big Asian manufacturers. Because those batteries aren't moving, issues like weight or density aren't really important, and getting the most kWh for your money becomes the critical factor.\n\nNow I'm not saying you can't make money selling these, but this is never gonna be Apple or Google-like margins and hence that business can't command valuation similar to big tech. Certainly not the PE that Tesla has right now.",
                      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/let8pll/",
                      "created": 1721875116,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lezhbpf",
                          "score": 1,
                          "body": "Big tech has big margins because of fast growth. The world will need a huge amount of grid-scale batteries to electrify the grid. It's the only way to use renewable power when the sun doesn't shine and the wind isn't blowing.",
                          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lezhbpf/",
                          "created": 1721967755,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lezhulu",
                              "score": 2,
                              "body": "No they have big margins because of low marginal cost. Once you have paid to develop Window 11 and sold enough to pay for it, any extra copy of Windows you sell is almost pure profit. This makes scaling up extremely profitable.\n\nCars or batteries don't work the same, marginal cost is high because you actually need all the materials and energy to make the extra car even if you have amortized the R&D.",
                              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lezhulu/",
                              "created": 1721968020,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lf14lz8",
                                  "score": 1,
                                  "body": "Apple.",
                                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lf14lz8/",
                                  "created": 1722000694,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lf51rsf",
                                      "score": 2,
                                      "body": "R&D is a huge proportion of the cost of an iPhone and software/IP is a large reason people buy them, because without iOS and Apple CPU it's just another made-in-China phone and Xiaomi will sell you not even half the price. This software/IP have low marginal cost (iOS has a virtually zero marginal cost and an A16 CPU cost about $100 to produce) and with 200 million units per year, the R&D amortization is fast.\n\nSure you are gonna tell me Tesla will come up with some amazing software and processors that they can pump up their prices way above the competition, but so far we are not seeing it. And they will just never sell 200 million cars per year either anyway.",
                                      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lf51rsf/",
                                      "created": 1722051523,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ler85zq",
                      "score": 1,
                      "body": "But where’s the profit in grid-scale batteries. I understand Tesla doesn’t produce the batteries but buys them from other companies.",
                      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/ler85zq/",
                      "created": 1721848897,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "les1yiw",
                          "score": 2,
                          "body": "They buy cells from other companies, but there's still a lot of work involved in turning that into a container-size battery with a built in inverter.\n\nTesla is also producing its own cells. Not enough to cover all of its needs, but that may eventually be the case as they scale up production.",
                          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/les1yiw/",
                          "created": 1721858455,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lere2rq",
              "score": 2,
              "body": "* Tight tight Margins\n   * How so? Show your work.\n* Highly competitive market\n   * What competitors? This market doesn't exist yet.\n   * It's unclear what is needed to reach level 5 and how easy other companies can ramp up once level 5 is achieved.\n* liability issues\n   * Insuring a massive fleet with high probability of safety would be very cheap to insure against (reasons detailed in last bullet point)\n* Would you ride in a driverless vehicle if the App required your insurance to cover the vehicle or simply call an Uber?\n   * Where are you getting this information???\n   * Does Waymo require this? No.\n   * No robotaxi company is going to require patrons to have insurance. Again, pure nonsense.\n* Would you lend your car for strangers to ride in, % taken off the top to Tesla, Battery used, & pay liability coverage?\n   * It's purely going to come down to the finances. \n   * A lot of people don't care about their vehicles very much and would happily allow for its usage if the numbers were right and they didn't have any headaches in terms of cleaning up after people periodically.\n   * Battery usage is covered by the network operator.\n   * Battery usage does cause degradation (as everything degrades per-mile-driven) but then again, if the finances make sense do you really care? If so, don't opt-in to the network with your network. \n   * Liability is purely on the robotaxi provider the moment the car is summoned.\n* Would Tesla cover insurance for an entire fleet?\n   * Yes. A true level 5 system will have an incredibly low failure rate. There will be sufficient insight into these failures that make it really easy to reason about probabilities of various incidents.\n   * Most incidents in a level 5 system will be caused by other human drivers. In a level 5 world with no human drivers incidents will be extremely rare",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lere2rq/",
              "created": 1721850765,
              "depth": 2,
              "replies": [
                {
                  "id": "leszmgw",
                  "score": 1,
                  "body": "Saying Robotaxi has no competitors is like saying Apple has no competitors because no other company is selling Phones with iOS. Blaming human error for the entirety accidents is just a non-logical claim as FSD is promoted as full self driving but many accidents have occurred but liability is placed on the customer not the software.",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leszmgw/",
                  "created": 1721871511,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lenife4",
              "score": 4,
              "body": "Well, it already works with Waymo. I see their cars, usually with actual passengers in them, often in LA.\n\nMy issue is that I don't foresee Tesla  catching up to Waymo anytime soon.",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lenife4/",
              "created": 1721790799,
              "depth": 2,
              "replies": [
                {
                  "id": "lep0hn7",
                  "score": 0,
                  "body": "Catching up in what way? Tesla is already superior",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lep0hn7/",
                  "created": 1721822130,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lerms6f",
                      "score": 2,
                      "body": "Tesla's tech is superior in that it is going to work anywhere. Waymo is geo-bound and not scalable. The cars are also much cheaper, so they will be able to either lose less money or even make a profit on rollout.\n\nProblem is, even if it works, we have a CEO who just endorsed Trump. This is election season. People who wear a MAGA hat aren't going to be seen in an EV, and people who don't aren't going to hail a MAGA cab. I don't know how much of an effect this is going to have, but he said it, and people have noticed. And then he backed out of it, which isn't like to appease anyone. So ... take that with a grain of salt. Time will tell how this works out for Tesla.",
                      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lerms6f/",
                      "created": 1721853474,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "leq1air",
                      "score": 1,
                      "body": "RemindMe! 3 years",
                      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leq1air/",
                      "created": 1721835474,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "leqndxs",
                      "score": 1,
                      "body": "In the way that Waymo has people riding in those driverless taxis right now. Where are Tesla's riders?",
                      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leqndxs/",
                      "created": 1721842378,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lenkxon",
                  "score": -1,
                  "body": "Im not saying Robotaxi won’t exist. I’m just saying as a product it will be a dragged service until it eventually discontinues. 6 months is an extreme exaggeration but it will show their issues.",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lenkxon/",
                  "created": 1721791910,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lenc629",
              "score": 2,
              "body": "And you think Uber is NOT going to run driverless? Are you sure?",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lenc629/",
              "created": 1721788192,
              "depth": 2,
              "replies": [
                {
                  "id": "leniy29",
                  "score": 7,
                  "body": "I genuinely believe their current model is better than using over engineered driverless vehicles. Current Uber Drivers pay their own Insurance, Gas, Maintenance, and Car Payments. Why would Uber want to take on that role with their own fleet of expensive vehicles? It would take potentially thousands of rides to break even on the initial cost of the vehicles alone.",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leniy29/",
                  "created": 1721791024,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lenmfkr",
                      "score": 0,
                      "body": "Uber will go driverless when the technology is mature.",
                      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lenmfkr/",
                      "created": 1721792598,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lenundp",
                          "score": 1,
                          "body": "I don’t see the benefit of driverless vehicles due to their high cost to manufacture & maintain. You’re manufacturing a $20-30k vehicle to earn maybe $10-$30 a ride. You’re looking at thousands of rides to just break even on the initial investment (not including insuring the vehicles, maintenance, gas/electricity, space to park the vehicle etc). All of this for a vehicle that will likely not have much of a Salvage Value is an incredibly inefficient model when you can pay drivers $3 out $10 to use & maintain their own vehicles.",
                          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lenundp/",
                          "created": 1721796643,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "leo9hyv",
                              "score": 4,
                              "body": "[deleted]",
                              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leo9hyv/",
                              "created": 1721805513,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lep3sra",
                                  "score": 3,
                                  "body": "The problem with this is that most people want cars at the same time. During rush hour or in the morning commute the robot taxies will be booked out and the rest of the day it will be slow.",
                                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lep3sra/",
                                  "created": 1721823619,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ler840m",
                                      "score": 2,
                                      "body": "You manage this with dynamic pricing and parking lots.",
                                      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/ler840m/",
                                      "created": 1721848879,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "leq9qe1",
                                  "score": 1,
                                  "body": "I just don’t think Consumers want to pay a monthly subscription to schedule their day around availability of a Robotaxi when they can just purchase their own vehicle. Also if Uber/Lyft operate a cheaper service, do you think consumers will choose the more expensive service?",
                                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leq9qe1/",
                                  "created": 1721838121,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lerbuj9",
                              "score": 1,
                              "body": "Math is why, at $15 per hr to pay a driver its $28,800 per year, simplified. Not including any benefits, insurance, etc. needed to support human workers.",
                              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lerbuj9/",
                              "created": 1721850064,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "leod60y",
              "score": 0,
              "body": "How can you even think that a taxi without having to pay a driver is going to be \"tight margin\".",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leod60y/",
              "created": 1721807978,
              "depth": 2,
              "replies": [
                {
                  "id": "leqc8xt",
                  "score": 2,
                  "body": "I don’t think you’re understanding the true cost of this business line. Initial investment for one of these vehicles is roughly $30k per vehicle (Cash, if not then add financing costs). Now add operating expenses of maintenance, electric charging costs, storage/parking expense, liability coverage, and damages. The normal Uber ride is probably $10-$30 maybe. How many rides a month would each vehicle require to pay off their own respective expenses? \n\nEach month is essentially a battle to break even. These vehicles don’t just appear & operate without expenses. Cars are horrible business.",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leqc8xt/",
                  "created": 1721838916,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "leql7xw",
                      "score": 1,
                      "body": "No the cost of charging and maintenance of an EV is very low.  Per mile charging is cheaper than fueling ICE cars, and EVs need very little maintenance of internals. No oil changes, motors run basically forever, Tesla batteries are being shown to go 500,000 miles+. \n\nIf Tesla wants to roll out their own fleet it will be ~$15k to make each compact, and let's say $1k per year per car to cover a parking lot/charging infrastructure. \n\nIt's absurd to think an uber without needing a driver would have low margin.",
                      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leql7xw/",
                      "created": 1721841711,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "leqn91t",
                          "score": 1,
                          "body": "Uber can’t become profitable & they don’t even cover liability, cost of the vehicle, fuel/charging, etc. Giving a driver 10-20% of the fee is a better model & provides income to humans.",
                          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leqn91t/",
                          "created": 1721842336,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "leqoe8m",
                              "score": 1,
                              "body": "Their issue for profit is the human. That's the point. Humans cost a shitton to pay for.",
                              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leqoe8m/",
                              "created": 1721842690,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lercc2d",
                              "score": 1,
                              "body": "$30 per ride, 12 rides per day, 365 days per year =$131.400.",
                              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lercc2d/",
                              "created": 1721850216,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lero42c",
                                  "score": 0,
                                  "body": "I pay $30 per ride if a human is driving. If not, I expect to pay half, or less. I can afford an extra $15 so I don't have to deal with a glitch AI. It will take some time for people to accept these robot drivers, and there will need to be a price difference that is big enough to force the human drivers to find other work.\n\nNot that it won't happen. Just thinking there will be some things to work out in the first year or two.",
                                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lero42c/",
                                  "created": 1721853890,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ler8asc",
                  "score": 2,
                  "body": "Because the service A->B transportation, people care very little about the vehicle transporting them. Very low pricing power.",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/ler8asc/",
                  "created": 1721848939,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "let2ifr",
                      "score": 1,
                      "body": "The point is robotaxi offers a much lower priced ride than traditional taxi, plus the benefit of privacy. But because a robot can work 18+ hr days, the profit per robotaxi is huge.",
                      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/let2ifr/",
                      "created": 1721872637,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "let3xdq",
                          "score": 1,
                          "body": "Human rides are already very cheap. Mostly because they’re using used cars with low depreciation and low insurance. Yes they save some money on not having to share the revenue with the driver, but all of their costs are sufficiently high that it ends up evening out. That may change in the future if they can make do with cheaper cars.",
                          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/let3xdq/",
                          "created": 1721873188,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "letu18q",
                              "score": 1,
                              "body": "Owning a car is cheaper than taking taxis everywhere. Using robotaxi everywhere will be cheaper than owning a car.",
                              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/letu18q/",
                              "created": 1721885273,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "leolwft",
              "score": -4,
              "body": "Yikes am I in the Amish sub or something? This has got to be the worst take I’ve seen in a longggg time. \n\nThey don’t have self driving ready yet but if/when they do, it will be the exact opposite. Great product of all time (besides electricity) until robots.\n\nRemindMe! 2 years",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leolwft/",
              "created": 1721813943,
              "depth": 2,
              "replies": [
                {
                  "id": "leolzoi",
                  "score": 1,
                  "body": "I will be messaging you in 2 years on [**2026-07-24 09:39:03 UTC**](http://www.wolframalpha.com/input/?i=2026-07-24%2009:39:03%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1eamluh/tesla_v_volkswagen/leolwft/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1eamluh%2Ftesla_v_volkswagen%2Fleolwft%2F%5D%0A%0ARemindMe%21%202026-07-24%2009%3A39%3A03%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201eamluh)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leolzoi/",
                  "created": 1721814004,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "leq4p0e",
              "score": -4,
              "body": "Just like how X is dead now right? Oh and that Cybertruck  that never shipped.",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leq4p0e/",
              "created": 1721836532,
              "depth": 2,
              "replies": [
                {
                  "id": "leqdpg2",
                  "score": 0,
                  "body": "I like Elon, I hate Robotaxi. How many years would it take for a single vehicle to generate profit? $30k initial investment to manufacture, Electrical expense to charge vehicles, parking expenses/storage of vehicles, liability coverage of vehicle, potential user damages, and maintenance (tires, electric malfunctions, etc). \n\n\nThis isn’t even including customer support, app maintenance, salary expenses etc etc. To make it worse you have incredible competition already in the market. (Uber, Lyft, Waymo, CAR OWNERSHIP, Rent a Car) I don’t see a great business line with all these expenses making $10-$30 a ride.",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leqdpg2/",
                  "created": 1721839372,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "leovl2e",
          "score": 2,
          "body": "Could be tonight.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leovl2e/",
          "created": 1721819718,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lerouof",
          "score": 2,
          "body": "You mean Waymo? 😏",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lerouof/",
          "created": 1721854121,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lemm96b",
      "score": 104,
      "body": "Damn I thought Volkswagen would look better. 332B revenue with 15B net income? 3x the same revenue with similar income as tesla? Those are some terrible gross margins for Volkswagen.\n\nTesla at least has growing revenue streams outside of auto like battery or solar. I own neither stock nor plan on owning.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lemm96b/",
      "created": 1721778252,
      "depth": 0,
      "replies": [
        {
          "id": "len6dvl",
          "score": 69,
          "body": "One thing to note for tesla:\n\nPre-tax income = 8.7b\n\nNet income = 13.6b\n\nSo, about 5b of their TTM income is from tax credits. \n\nOn the other hand, Volkswagen paid 5b in taxes\n\nAnother thing is that car companies require a ton of reinvesting into r&d.\n\nR&d to gross profit\n\nTesla: 25% of gross profit spent on r&d\n\nVolkswagen: 27% of gross profit spent on r&d\n\nI think one of the biggest factors is scale, though. Volkswagen is a much bigger company.\n\nSG&A to gross profit \n\nTesla: 30%\n\nVolkswagen: 50%\n\n\nI'm still a novice when it comes to stocks, but at face value, it seems like tesla is more efficient at turning a profit while also benefiting from the tax credits.  How much of that efficiency is due to scale? I couldn't tell you. Does that justify it having 10x higher market cap than Volkswagen? Probably not lol\n\nhttps://stockanalysis.com/stocks/vwagy/financials/\n\nhttps://stockanalysis.com/stocks/tsla/financials/",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/len6dvl/",
          "created": 1721785918,
          "depth": 1,
          "replies": [
            {
              "id": "leo8l6l",
              "score": 32,
              "body": "Generally, automotive companies have higher gross margins for higher segment cars. You can easily see that within Volkswagen (but also any other car company) where Porsche has much higher margins than Audi and Audi much higher than Volkswagen.\n\nTesla's master plan is to move into the small car segment so their margins will basically go down the Volkswagen route.",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leo8l6l/",
              "created": 1721804912,
              "depth": 2,
              "replies": [
                {
                  "id": "leovyj9",
                  "score": 8,
                  "body": "That makes sense. One of my favorite reasons to leave comments / analysis on stocks is that someone more knowledgeable than me usually comes along and educates me on certain sectors or stuff I've done wrong. I appreciate it!",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leovyj9/",
                  "created": 1721819911,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lerk76d",
                  "score": 1,
                  "body": "Obviously so yes, but I disagree with Tesla going doing that same route. It's likely their margins will be higher indefinitely due to software & services growth.",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lerk76d/",
                  "created": 1721852665,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lenqh79",
          "score": 26,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lenqh79/",
          "created": 1721794514,
          "depth": 1,
          "replies": [
            {
              "id": "lep5o59",
              "score": 4,
              "body": "Either way you look at it VW is a loser. It means Tesla is making more money by doing less work, which is what matters.\n\nWould you rather work 13 times more per month for the same pay, or work 13 times less for the same pay?",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lep5o59/",
              "created": 1721824425,
              "depth": 2,
              "replies": [
                {
                  "id": "ler9p5t",
                  "score": 2,
                  "body": "You could also say VW is a loser and Tesla a winner but at current stock price VW investors will be winners and Tesla investors will be losers.",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/ler9p5t/",
                  "created": 1721849387,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "leo6j1u",
          "score": 5,
          "body": "Overall agree on the low VW margins, nevertheless it’s hard to compare a „newly“ setup from scratch  (US) car company with limited product range with an established European company operating globally for decades (via many different brands and targeting many different client groups). Completely different product range and legacy business. Therefore I am not convinced it makes sense to compare revenue vs. profit vs. margin.\n\nNo doubt that Tesla is more efficient, Volkswagen is a slow and clumsy monster of a conglomerate. Like most of the legacy car producers. But I am convinced once Tesla matures and operates globally, if it would ever reach the significance of VW / Toyota etc., they would face similar constraints and margins under pressure.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leo6j1u/",
          "created": 1721803603,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lesgc2u",
          "score": 2,
          "body": "There are one time items in Volkswagens net income (but there is always something in there for them) \n\nI can’t remember the exact numbers off hand, but almost all their profits are from Porsche too, VW on its own is immensely low on profit margins",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lesgc2u/",
          "created": 1721864176,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lerk0r1",
          "score": 1,
          "body": "That and no debt",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lerk0r1/",
          "created": 1721852608,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lemo67g",
          "score": -5,
          "body": "Tsla NI is incorrect.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lemo67g/",
          "created": 1721778950,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lep8x8p",
      "score": 10,
      "body": "VW knows how overvalued TSLA is too; that's why they threw $5B at RIVN",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lep8x8p/",
      "created": 1721825747,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leposef",
      "score": 6,
      "body": "recognise crown edge nail instinctive worm bored makeshift zesty like\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leposef/",
      "created": 1721831472,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lemn0mw",
      "score": 48,
      "body": "Tesla will continue to sink as long as Musk keeps mixing politics into his company.  \nHe also keeps insulting the demographics which actually buy what he's selling. Whilst backing a candidate that does not believe in his product. What a genius!",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lemn0mw/",
      "created": 1721778529,
      "depth": 0,
      "replies": [
        {
          "id": "lemre1c",
          "score": 19,
          "body": "Given the way it is priced, Tesla could perform fantastically and still the stock price could underperform",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lemre1c/",
          "created": 1721780143,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lemtouo",
          "score": 10,
          "body": "That fucker is why LOTS of U.S. won't buy a Tesla.  It's failed at EVERYTHING else they've done out of the realm of cars and battery storage, and it keeps wasting investors' money on dumb shit.  He ought to settle for $25 Billion, sell the loss twitter is to avoid paying taxes for a decade (like trump did) and fund his own damned robot company.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lemtouo/",
          "created": 1721781012,
          "depth": 1,
          "replies": [
            {
              "id": "leroz7l",
              "score": 1,
              "body": "He would do a lot better financially if he took advice from smart people.",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leroz7l/",
              "created": 1721854161,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lemnppj",
          "score": -14,
          "body": "I know, right! Some genius, can’t believe he’s worth over 200 billion. To think that he would insult liberals since they’re the only people who buy his cars. Maybe he should be a closet scumbag and keep this thoughts to himself.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lemnppj/",
          "created": 1721778785,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lemyoa9",
          "score": -13,
          "body": "No matter if you agree or not, he is standing for what he believes in.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lemyoa9/",
          "created": 1721782908,
          "depth": 1,
          "replies": [
            {
              "id": "leoag8q",
              "score": 0,
              "body": "Reddits philosophy: Stand up for your beliefs. Unless those beliefs are not mine.",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leoag8q/",
              "created": 1721806145,
              "depth": 2,
              "replies": [
                {
                  "id": "leofmpc",
                  "score": -3,
                  "body": "And then blame billionaires for wanting just money and ignoring injustices 🤣. \n\nWe live in a crazy world!",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leofmpc/",
                  "created": 1721809656,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lent4tz",
          "score": -11,
          "body": "It’s actually pretty impressive that Elon values common sense more than his money. Elon is a very liberal person. He’s just not a mindless sheep.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lent4tz/",
          "created": 1721795855,
          "depth": 1,
          "replies": [
            {
              "id": "leqnrbx",
              "score": 3,
              "body": "I don't think those words mean what you think they mean",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leqnrbx/",
              "created": 1721842493,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "leo9b8n",
      "score": 11,
      "body": "Man, VW has terrible net income.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leo9b8n/",
      "created": 1721805388,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lepc1ac",
      "score": 3,
      "body": "Except VW is controlled via a minority stake of preferential shares by a holding company controlled again via a minority stake of preferential share. \n\nSo, you can bring your capital and we’ll give you back a little bit of dividends if we don’t fuck it up. But you have no say whatsoever no matter how much capital you bring.  No thanks.\n\nVW is a control and pride play by a “noble” family with little skin in the game. When it will come on the free market with 1 share = 1 vote i may consider it adding to my portfolio. Until then good luck to you.  \n\nThis is how the market views these incredible nice and undervalued companies. America is no.1 for a reason.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lepc1ac/",
      "created": 1721826960,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lemztzq",
      "score": 28,
      "body": "Let's just use common sense here.\n\nAll the OP did was Google some metrics and thinks that's a solid review case.\n\nDoes the OP believe that the rest of the highly sophisticated investors who have access to Bloomberg Terminal, insider info, etc., also don't have this info? Do you think they're just looking at these two companies thinking \"Wow, VW is such a great buy! It's 15x less market cap than Tesla with larger revenue and profit. It's a steal at this price.!\"\n\nIf stock investing was as easy as using a stock screener that takes 30 seconds to dig up, it wouldn't be called 'investing'. Anyone can see that $100 is more than $20. You don't need a brain to do what the OP did here.\n\nWhat the OP fails to mention is that VW has no growth and an inability to generate future growth. That's what Tesla is trying to do. Will it work out? Maybe, maybe not. But investing requires having faith in that the company will be able to create future products/services to continue growing. By OP's logic, why invest in Apple when Nokia had far better financials in the early 00's? According to the OP, Blockbuster is a way better company than Netflix!\n\nThe market cap of VW depends on the price per share people are willing to pay based on the amount of shares available. Maybe the OP should ask himself, why do the smartest and brightest investors REFUSE to buy VW? This really isn't about VW, F, GM, etc., anymore. OP believes Tesla is overvalued but being the novice that he is, the only way he can do that is by comparing a legacy OEM with stagnant revenue to a company that plans to create automated driving, the largest battery storage systems in the world, has the largest and most sophisticated supercharging network in the world, robotics, and by far the most profitable EV automaker in the world. When other auto companies are losing billions selling a few thousand EV's but Tesla is earning billions, you should ask yourself how did that happen.\n\nThe two largest reasons why people are betting on Tesla is FSD/Optimus. By all means, if you don't think Tesla will achieve either of those, yes, Tesla is incredibly overvalued. If you do believe Tesla can, then that's why Tesla is being priced the way it is. I'll be honest, the only reason I've been investing and still holding onto Tesla for the past decade is because the guy makes reusable space rockets that has billion dollar contracts with NASA and a Starlink system that generates $7 billion per year in revenue. I have faith that this same guy will accomplish great things for Tesla as well. And I'm willing to take the risk for that in hopes of higher returns. That's how investing works.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lemztzq/",
      "created": 1721783355,
      "depth": 0,
      "replies": [
        {
          "id": "lepgpk1",
          "score": 4,
          "body": "i would not call “stagnant” +100B/year at top line in only 5 years.\n\nbut we get it you love musk.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lepgpk1/",
          "created": 1721828690,
          "depth": 1,
          "replies": []
        },
        {
          "id": "len0so3",
          "score": 4,
          "body": "Just Reddit being Reddit, Elon/Tesla bad",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/len0so3/",
          "created": 1721783728,
          "depth": 1,
          "replies": [
            {
              "id": "len1c1e",
              "score": -17,
              "body": "If you're asking if I can use models like DCF and DDM to justify present values, it's game on. I just choose to show the obvious over evaluation of TSLA in relationship to another player in the market.",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/len1c1e/",
              "created": 1721783938,
              "depth": 2,
              "replies": [
                {
                  "id": "lenazn9",
                  "score": 13,
                  "body": "If only we could use those DCF and DDM, everyone would have been billionaires already lmao.\n\nThey provide useful aspects but I don't think they are that useful.\n\nI'm not saying Tesla would grow 10x. But I'm saying you can't just invest using theories that are read by millions and maybe billions of people at this point .",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lenazn9/",
                  "created": 1721787719,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lenuqf9",
                  "score": 6,
                  "body": "Your definition and method of overvalued does not measure up to what most Tesla investors see it as.\n\nYou're just issuing numbers. Nothing about the future of this company. If you are inclined to believe that Tesla is just a car company, by all means, it's overvalued. No debate about that. It would be pointless for me to convince you about everything else Tesla is doing if you're solely fixated on it just being an auto company. It's the same discussions I've had with people who thought EV's weren't possible and that Tesla was just a fad. That time period was way worse in terms of Tesla pessimism. \n\nPeople in the industry and those who follow TSLA actively don't see it the way you do for a variety of reasons. TSLA is arguably the most followed company with people constantly creating content about the company daily.\n\nYour financial models are largely irrelevant because the market for self-driving and Optimus is a wide range. And that's what you are simply missing: the vision.\n\nAs I've stated, I've been investing in Tesla for over a decade. In 2014, all this company had going for it was two vehicles and some superchargers. Today, it's the only profitable purely EV company in the world by a wide margin, largest charging infrastructure, developing the most widely accessible self-driving tech in the market, and many other projects. That's just in ten years. The landscape in ten more years will be vastly different and Tesla is one of those companies that will continuously innovate beyond what most companies are capable of.",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lenuqf9/",
                  "created": 1721796688,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "len6gyx",
                  "score": -6,
                  "body": "If it’s so overvalued like you say then bet against it… The Tesla bulls will welcome your wealth in our pockets.",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/len6gyx/",
                  "created": 1721785951,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "len7avq",
                      "score": 5,
                      "body": "I don't have to bet against it, I just won't buy it. Big difference.",
                      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/len7avq/",
                      "created": 1721786276,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "leoax6h",
                          "score": 3,
                          "body": "Sure, but why do all this work and research on Tsla (plus make a Reddit post) just to do nothing? Sounds like a waste of time. If you’re confident in the conclusion based on the work you’ve put into this, then it doesn’t hurt to try to make some money off of it",
                          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leoax6h/",
                          "created": 1721806461,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lepvsed",
                              "score": 1,
                              "body": "A company being overvalued does not automatically translate to shorts being profitable. Just in general, I'm indifferent about Tesla.",
                              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lepvsed/",
                              "created": 1721833741,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ler1z1e",
                                  "score": 1,
                                  "body": "Sure. There’s tons of companies I think are overvalued but won’t short. I also don’t spend much time talking or thinking about them. And certainly won’t make posts on Reddit about them. \n\nI just find it strange to spend so much time and energy on a company you have no position in",
                                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/ler1z1e/",
                                  "created": 1721846914,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lenb97b",
                          "score": -1,
                          "body": "You are also not buying 10000+ other tickers. I bought like may 20 tickers.\n\n\"Not buying\" is not interesting in anyway.",
                          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lenb97b/",
                          "created": 1721787825,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "leo1tvy",
          "score": 1,
          "body": "Vw can grow a lot, just maybe not in sales numbers but by profitability. This means the net warning could get much higher.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leo1tvy/",
          "created": 1721800696,
          "depth": 1,
          "replies": [
            {
              "id": "leodh2i",
              "score": 3,
              "body": "I think that the point is: old automotive brand, can be profitable with the transition to electric vehicles? Because Tesla already made profit and is trying to sell a lot of other things like the first comment says.\n\nMany people think (me too) that there are too many brand at the moment. A lot of them will be swept away from the transition and replaced from other brands.\n\nLike smartphone (= electric car) and Nokia (= VW) with Apple ( = Tesla).\nOf course, these are just hypotheses. Only time will tell the truth.",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leodh2i/",
              "created": 1721808184,
              "depth": 2,
              "replies": []
            },
            {
              "id": "letcp6k",
              "score": 2,
              "body": "About 40% of VW's profit and revenue come from China. This is mainly through ICE vehicles - something China is rapidly phasing out from. Because China previously did not have a strong auto manufacturing industry, their rapid increase in EV is tied to China wanting to be a powerhouse in this industry so they can take market share.\n\nVW is in serious trouble with this EV transition. Chinese buyers are going to start buying local and with tariffs/trade tensions with Europe imposing on China, China will have no choice but to do the same to European automakers and then Chinese will just buy domestic car brands such as BYD, Xpeng, Nio, Tesla, etc.,\n\nI'd hate to beat around the bush but EV sales will outpace ICE sales in the near future. It's not an if but when. Very few companies are equipped to handle this transition and stay profitabile. Ford/GM have no chance. Toyota/Hyundai/BYD are the top three outside of Tesla that will continue their dominance. The rest are at severe risk of bankruptcy or will likely be merged or bought out if they do not transition away from ICE.",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/letcp6k/",
              "created": 1721876789,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lpth9og",
          "score": 1,
          "body": "We might end up again in a situation where Wallstreet bets against Mainstreet. The Development and Spreads just got way far off.\n\nPlease dont hate me, but I just bought some more VW today. In a few months we will have some discussion about how to direct register VW shares.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lpth9og/",
          "created": 1727793650,
          "depth": 1,
          "replies": []
        },
        {
          "id": "leocupo",
          "score": 0,
          "body": "Great comment 🚀",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leocupo/",
          "created": 1721807762,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leolgo9",
      "score": 9,
      "body": "why didn't you list both companies debt? didn't match the story you were telling? \n\n  \nwhy not also mention margins, growth and guidance - which is what moves stock prices much more than past performance",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leolgo9/",
      "created": 1721813650,
      "depth": 0,
      "replies": [
        {
          "id": "leou52p",
          "score": 1,
          "body": "Why didn't I list that Morningstar rates VW as 5-star and Tesla as 3-star? There are a lot of things I could have listed.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leou52p/",
          "created": 1721818954,
          "depth": 1,
          "replies": [
            {
              "id": "leouxei",
              "score": 4,
              "body": "I don't own stock in either - just saying, there are reasons tsla is priced like a growth tech company and legacy car manufacturers are priced like...legacy car manufacturers.",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leouxei/",
              "created": 1721819373,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "leos8xf",
      "score": 2,
      "body": "Hold Tesla, hold the bag.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leos8xf/",
      "created": 1721817909,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leqj96i",
      "score": 2,
      "body": "Hmm Tesla's overvaluation is a point of concern for sure especially with the product delays .... Interesting read supporting a cautious outlook on $TSLA - [https://baptistaresearch.substack.com/p/teslas-bold-ambitions-vs-harsh-realities](https://baptistaresearch.substack.com/p/teslas-bold-ambitions-vs-harsh-realities)",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leqj96i/",
      "created": 1721841099,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lerjxqy",
      "score": 2,
      "body": "Now do debt and future outlook",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lerjxqy/",
      "created": 1721852582,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lepzxgo",
      "score": 3,
      "body": "VW has over 200 Billion in debt. Almost 4x their marketcap.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lepzxgo/",
      "created": 1721835047,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lempxea",
      "score": 8,
      "body": "reddit being bearish? Gotta inverse it. \n\nWon't be surprised if this is at $350 again next year.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lempxea/",
      "created": 1721779595,
      "depth": 0,
      "replies": [
        {
          "id": "lemzlr0",
          "score": 10,
          "body": "It shouldn’t be, but it probably will be",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lemzlr0/",
          "created": 1721783267,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lencb8d",
          "score": 3,
          "body": "you have never been on Reddit before this post?",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lencb8d/",
          "created": 1721788248,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lemze09",
      "score": 8,
      "body": "Now factor in debt, cash, the weight of a failing ICE business, everything else you missed (margins, declining cogs, etc) and a lot of people still buying Tesla at these prices.\n\nThere’s your answer",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lemze09/",
      "created": 1721783184,
      "depth": 0,
      "replies": []
    },
    {
      "id": "len1dcc",
      "score": 2,
      "body": "We get it, not like this is parroted every other day. Bring some new perspective at least you bot",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/len1dcc/",
      "created": 1721783952,
      "depth": 0,
      "replies": []
    },
    {
      "id": "len4qee",
      "score": 3,
      "body": "What happens first: Tesla bankruptcy, or a robotaxi?",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/len4qee/",
      "created": 1721785272,
      "depth": 0,
      "replies": [
        {
          "id": "lenbjdb",
          "score": 8,
          "body": "I'd say robotaxi.\n\nI know Tesla might not grow but going bankrupt is so unlikely.\n\nI mean just look at Rivian who loses money on every car and its net income is like negative 1 billions for 8 quarters straight. And it is still going.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lenbjdb/",
          "created": 1721787937,
          "depth": 1,
          "replies": []
        },
        {
          "id": "leo5jn3",
          "score": 1,
          "body": "\"A\" robotaxi first. Not \"the\" robotaxi, though.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leo5jn3/",
          "created": 1721802981,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leof1u3",
      "score": 3,
      "body": "Doesnt VW have a lot of debt?",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leof1u3/",
      "created": 1721809255,
      "depth": 0,
      "replies": [
        {
          "id": "leogf5o",
          "score": 3,
          "body": "yeah they do have a large amount of liabilites but its a common myth that this is basic debt. In the automotive industry its pretty common to shift money between suppliers and customers, so basically they owe their suppliers but generally generate more through e.g. leasing agreements with customers, hence looking at their liabilities on their own doesnt make sense, but in the context of also their assets it doesnt seem so bad any more. \n\nthe problem of vw isnt their current financials, its their inability to innovate imo.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leogf5o/",
          "created": 1721810204,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leoupqh",
      "score": 1,
      "body": "Long-term investors are investing in humanoid projects such as their autonomous taxi. Most tech companies are priced for future earnings. Of the Mag 7, they are the most volatile. Tesla also has the most potential upside.\n\nI have no position in Tesla, but it's on my watch list.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leoupqh/",
      "created": 1721819260,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leov8z3",
      "score": 1,
      "body": "Why don't you compare Tesla to other manufacturer EV sales? Or take into consideration that EVs aren't for everyone and perhaps the market is saturated already by those that wanted them and have them already.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leov8z3/",
      "created": 1721819541,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lep4nmi",
      "score": 1,
      "body": "Yeah, but Tesla is about to release Humanoid-Taxi-Robo-Batteries...\n\nThat's why it makes sense.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lep4nmi/",
      "created": 1721823988,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lepp1g3",
      "score": 1,
      "body": "You should compare Teska stock to Porsche SE (!) holding stock. The latter is a holding, basically runs VW (50+% votes) and has a lot of other stocks.\nAnd it costs less than 10 billion $. That's ridiculous if you ask me.\n\nhttps://www.porsche-se.com/fileadmin/downloads/investorrelations/mandatorypublications/interimreport-24/PSE_Q1_2024_eng.pdf",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lepp1g3/",
      "created": 1721831557,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ler4uni",
      "score": 1,
      "body": "Stocks aren’t based on financials and fundamentals alone - it’s human psychology, supply and demand. \n\nTesla continues to sell a dream and a track record (albeit a progressively less than ideal) and thus investors hold and or buy.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/ler4uni/",
      "created": 1721847827,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ler810a",
      "score": 1,
      "body": "This is only one point in a timeline. You need to look at the whole timeline. Investors invest in future profits, not just todays.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/ler810a/",
      "created": 1721848852,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lerdglp",
      "score": 1,
      "body": "Why not ~~both~~ neither.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lerdglp/",
      "created": 1721850571,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lerlbtr",
      "score": 1,
      "body": "You forgot a metric. VW revenue growth is around 20%? right now. Tesla is 2%. Tesla is priced as a growth company, where the expectation is for growth to accelerate to around 40% to 50% and stay there until the end of the decade. This is based on speculation for full self-driving, optimus both working and scaling without meaningful competition (building robots is not easy, but training them is pure magic). Energy storage is a bright point, and auto sales are likely to get worse. \n\nElon came out very publicly in favor of a certain candidate when most of the people who traditionally buy EVs in the US are not for that certain candidate, and the people who are for that certain candidate won't be caught in an EV. And also this will like affect early adoption of robo-taxis - so that endorsement could have some big effects. \n\nSo I am thinking we have a short term revenue problem, lasting at least a year, where Tesla will need to completely remake its image - and that would require someone to maybe hire a marketing department... \n\nRemember, alternative energy sources and EVs appeal to greens, and greens are largely blue and hardly ever red.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lerlbtr/",
      "created": 1721853016,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leroqxd",
      "score": 1,
      "body": "I am all for shitting on Tesla, but based on this their margins are also significantly higher. They have 30% of the revenue but 90% of the income",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leroqxd/",
      "created": 1721854088,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lerqgwe",
      "score": 1,
      "body": "Okay, someone tell me... is this stock manipulation? Bots run amuck? Tesla was below $200. \n\n- It jumped to 210 and held there. Zoom out a bit and it looks flat until ...\n\n- it jumped to $230. Exactly $230. And held there. Until ...\n\n- it jumped to $250. Then it flailed up and down a bit, but kept returning to $250, and you can see it holding that line.\n\n- The peak value was, for a moment, almost exactly $270.\n\nWhat stock that is work $1 trillion in cap jumps in exactly $20 increments?",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lerqgwe/",
      "created": 1721854633,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lersgly",
      "score": 1,
      "body": "Long PAH (Porsche Holding), Short Tesla (and a happy camper today).\n\nTesla price target: 150 by Oct 2024",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lersgly/",
      "created": 1721855281,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lesvylk",
      "score": 1,
      "body": "margin difference is kind of absurd if i'm being honest ",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lesvylk/",
      "created": 1721870087,
      "depth": 0,
      "replies": []
    },
    {
      "id": "let5wuk",
      "score": 1,
      "body": "Tesla has way better margins if this is accurate. So there's your answer.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/let5wuk/",
      "created": 1721873978,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezmz9f",
      "score": 1,
      "body": "You did not consider debt. VW has insane amount of debt.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lezmz9f/",
      "created": 1721970720,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lenhdk2",
      "score": 0,
      "body": "Because they don't just manufacture cars. They have an insane amount of data, and data is the new gold. They also have batteries, and heavy R&D into breakthrough technology.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lenhdk2/",
      "created": 1721790343,
      "depth": 0,
      "replies": [
        {
          "id": "leojh8i",
          "score": 1,
          "body": "what kind of data do they have insane amounts of? genuinely curious, not familiar with this.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leojh8i/",
          "created": 1721812299,
          "depth": 1,
          "replies": [
            {
              "id": "leove98",
              "score": 0,
              "body": "Driving data, from their cameras. It's how they are building true autonomous driving..",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leove98/",
              "created": 1721819619,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lepc9oy",
      "score": 1,
      "body": "VW sucks.  They relied too much on China but the German speed couldn’t match the Chinese companies and they missed the move to battery operated.  Went from number one to number bum in one of their largest markets.  Herr Doktor Schmidt MBA, PHD, ETC couldn’t make the decisions needed fast enough to compete with the agile risk takers in China.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lepc9oy/",
      "created": 1721827049,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leprm0l",
      "score": 1,
      "body": "Volkswagen is a car company. Tesla is a data company.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leprm0l/",
      "created": 1721832401,
      "depth": 0,
      "replies": [
        {
          "id": "leq7ijk",
          "score": 2,
          "body": "What data do you think Tesla is getting that the other car manufacturers aren't? Every manufacturer has sensors tracking driver behavior, the roads, etc.",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leq7ijk/",
          "created": 1721837422,
          "depth": 1,
          "replies": [
            {
              "id": "leqj0da",
              "score": -1,
              "body": "They have so much more data of traffic and pedestrian behavior that they’re far ahead of the other companies. And ultimately it’s that data that ensures their cars to drive optimally",
              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leqj0da/",
              "created": 1721841024,
              "depth": 2,
              "replies": [
                {
                  "id": "leqkf8l",
                  "score": 2,
                  "body": "So if they are so much further ahead, how does mercedes have level 3 before them, and other companies already have autonomous taxi's?",
                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leqkf8l/",
                  "created": 1721841463,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "les1c2l",
                      "score": 0,
                      "body": "Mercedes level 3 is a gimmick. Needs perfect road conditions, only available on certain highways, only under 40 mils per hour, it's nowhere near Tesla's FSD. \n\nAnd most autonomous taxi's have loads of problems, including not even able to pick people up properly.",
                      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/les1c2l/",
                      "created": 1721858241,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "les6vmd",
                          "score": 0,
                          "body": "Level 3 approval is level 3 approval, if Tesla could announce a level 3 approval capped at 40mph they would have simply to try and pump their stock.\n\nTaxis with far less problems than Tesla's FSD? think for a second FSD was on their level they wouldn't have launched already? There is a reason they can't get approved and/or haven't launched yet. They are a company that over promises and under delivers, if they were even close they would have launched in select areas as another beta.\n\nTesla has been using owners to beta test the existing software since it came out. Some would say it's the gimmick. Do u think it's a fluke that Tesla skyrocketed and bounced between number 1 and 2 as involved in the most car accidents?\n\nThanks for the fun. It's always entertaining to hear a Tesla cult member cope.",
                          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/les6vmd/",
                          "created": 1721860677,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lesfrkn",
                              "score": 0,
                              "body": "Lol they have level 3 self driving on a technicality. Legal approval of level 3 in two states does not mean it has better self-driving technology than Tesla. Not to mention the conditions it has to meet before it can even activate self drive. Like it needs bumper to bumper traffic jam on a highway to use it? Is this a fking joke lol? Tesla has been doing that for years. \n\nThe reason Tesla has the most accidents is because they're the only ones that has put out real self driving so far. Of course other cars are not going to have self driving accidents if they don't even have self driving technology. \n\nI'm not saying Tesla has the best cars or the best company, but in terms of self driving they are miles ahead of every other car company. Love the Tesla haters coping for a Tesla demise but it never comes true.",
                              "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lesfrkn/",
                              "created": 1721863967,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "leto2xn",
                                  "score": 0,
                                  "body": ">The reason Tesla has the most accidents is because they're the only ones that has put out real self driving so far. Of course other cars are not going to have self driving accidents if they don't even have self driving technology.\n\nIts not that the other companies don't have it, its that they don't recklessly release it until its bulletproof... that's my point. Other companies have far better tech, and the only reason Tesla has remained the slightest bit competitive is they use their userbase as beta testers vs pay for it. Its a business decision that puts its user base at risk where as other businesses have invested money into testing internally.\n\n>I'm not saying Tesla has the best cars or the best company, but in terms of self driving they are miles ahead of every other car company. Love the Tesla haters coping for a Tesla demise but it never comes true.\n\nI think you need to talk to a couple more insiders. If you admit that they are not the best company as far as business practices, with some digging you will realize that they are nothing more than a pump play to sell stock rather than sell cars.",
                                  "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leto2xn/",
                                  "created": 1721882083,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lenh5v8",
      "score": 1,
      "body": "What’s the TLDR?",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lenh5v8/",
      "created": 1721790251,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lemwh0n",
      "score": 0,
      "body": "Brilliant let’s see you short it then.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lemwh0n/",
      "created": 1721782063,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leptcpz",
      "score": 0,
      "body": "people tell me im exaggerating when i say tesla wouldnt be worth buying above $30, but the valuation really is that insane",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leptcpz/",
      "created": 1721832961,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lenxyqq",
      "score": 0,
      "body": "they want to pay elon the value of VW---",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lenxyqq/",
      "created": 1721798448,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leps1h3",
      "score": 0,
      "body": "Everything about future growth potential. \n\nwhether it will come to fruition or not, the market thinks Tesla has potential. The market doesn’t think VW will ever grow beyond legacy automaker.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leps1h3/",
      "created": 1721832541,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leqdfof",
      "score": 0,
      "body": "If Tesla were priced like VW based on earnings multiple, it would be $16.14 per share. No where near $50.",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leqdfof/",
      "created": 1721839289,
      "depth": 0,
      "replies": [
        {
          "id": "leqebsc",
          "score": 1,
          "body": "I was being generous and used P/S valuation",
          "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/leqebsc/",
          "created": 1721839564,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lepamkq",
      "score": -1,
      "body": "Or maybe volkswagen isnt very good too...",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lepamkq/",
      "created": 1721826420,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lepixog",
      "score": -1,
      "body": "VW doesn't have Elon. That's the differences",
      "permalink": "/r/stocks/comments/1eamluh/tesla_v_volkswagen/lepixog/",
      "created": 1721829474,
      "depth": 0,
      "replies": []
    }
  ]
}