{
  "title": "Deutsche Bank shares drop 6% after lender snaps 15-quarter profit streak ",
  "score": 41,
  "selftext": "Deutsche Bank on Wednesday snapped a 15-quarter profit streak with a narrower-than-expected loss, as it made a provision for an ongoing lawsuit over its Postbank division and confirmed it would not make a second share buyback this year.\n\nShares fell more than 8% in early deals, despite analysts characterizing the results as broadly solid. The decline had eased to around 6% by 11:10 a.m. in London.\n\nNet loss attributable to shareholders was 143 million euros ($155.1 million), against an LSEG poll of analysts which had predicted a loss of 145 million euros.\n\nGermany’s biggest bank had previously flagged it would take a hit in the quarter on the back of the Postbank provision, which it confirmed Wednesday would amount to 1.3 billion euros. The long-running lawsuit by investors alleges Deutsche Bank underpaid to take over the retail banking giant in 2010.\n\nThe bank said it remained on track with its distribution commitment to shareholders, which it has previously stated is for a sum in excess of 8 billion euros in share buybacks across the 2021-2025 financial year period.\n\n“On the share repurchase side...unfortunately, prudently we had to step back from the idea of a second repurchase this year, what our focus is now is building excess capital through the back of the year,” Chief Financial Officer James von Moltke told CNBC’s Caroline Roth in a Wednesday interview.\n\nThe lender reported net revenue was up 2% to 7.6 billion euros in the second quarter, while efficiency savings reached 1.5 billion euros.\n\nRevenue reports varied across the business. At its investment bank division, a recent area of strength, they jumped 10% year-on-year to 2.6 billion euros — but fell 3% to 2.1 billion euros in fixed income and currencies. Revenue in corporate banking was nearly flat at 1.9 billion euros.\n\nOther highlights included:\n\nProfit before tax excluding the Postbank provision was 1.7 billion euros, up from 1.4 billion euros in the second quarter of 2023.\nProvision for credit losses was 476 million euros, up from 401 million euros a year ago.\nCET 1 capital ratio, a measure of bank solvency, nudged up to 13.5% from 13.4% in the first quarter of the year.\nIn a Wednesday note, Citi analysts called it a “solid quarter,” with some divisions above consensus, net interest margins fading at a slower pace than initially expected and a largely-unchanged outlook for 2024 and 2025.\n\nRBC analysts labelled the results “good,” particularly in investment banking, but said loan losses were higher than expected.\n\nDeutsche Bank’s Von Moltke told CNBC he saw several positive drivers for the second half, including in net interest income — which fell 2% in corporate banking the second quarter, according to the Wednesday earnings.\n\n“We had called earlier this year on the net interest income side for a downdraft relative to [20]23, we actually think the banking book segments may be stable, essentially flat to last year, and that’s actually very encouraging, reflecting lower funding costs, better spreads on both the deposit and the loan side. Still more sluggish loan growth than we’d like to see, but overall an encouraging picture,” Von Moltke said.\n\n“On the financial market and corporate finance side, we see the momentum there coming through that we’d hoped to see,” he added, pointing to revenue doubling in its origination and advisory business year-on-year.\n\nThe second-quarter result maintains a recent trend of earnings beats for the lender. Back in April, the bank posted 10% higher profit, logging its best quarterly result for the metric since 2013.\n\nIt also comes on a busy day for European bank earnings, with Italy’s UniCredit maintaining a 14-quarter profit streak as Spain’s Santander reported a 20% leap in net profit.\n\nSource: https://www.cnbc.com/2024/07/24/deutsche-bank-dbk-q2-earnings.html",
  "link_flair_text": null,
  "id": "1eb1jub",
  "num_comments": 1,
  "created_utc": 1721827871,
  "permalink": "/r/stocks/comments/1eb1jub/deutsche_bank_shares_drop_6_after_lender_snaps/",
  "comments": [
    {
      "id": "lerg6qu",
      "score": 1,
      "body": "A lot of stocks have dropped 5-6% today",
      "permalink": "/r/stocks/comments/1eb1jub/deutsche_bank_shares_drop_6_after_lender_snaps/lerg6qu/",
      "created": 1721851422,
      "depth": 0,
      "replies": []
    }
  ]
}