{
  "title": "Is Ubisoft dying?",
  "score": 276,
  "selftext": "I know l, I know, crazy post. But I keep an eye on Ubisoft's stock prices in the hopes they DIE (because... It's Ubisoft. Like the Nazi Germany of gaming corporations). \n\nEither way, I learned at 10:50 A.M. today, they hit a stock price of $4.00. The last time I could find it lower was when it hit $3.84 back in September 18, 2015...\n\nHOLY FUCK\n\nUbi has hit a nearly 9 year low. That's actually bonkers. Are they actually in danger of folding due to the whole Assasins Creed Shadows controversy and the disasterous launch of Skull and Bones? Because if they eventually fold... Lemme get out the fireworks, this would be a day to celebrate.",
  "link_flair_text": null,
  "id": "1ebbiob",
  "num_comments": 245,
  "created_utc": 1721852445,
  "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/",
  "comments": [
    {
      "id": "lerna8d",
      "score": 460,
      "body": "Have you played their games? It’s recycled garbage. Rainbow 6 was my last hope they completely ruined that too",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lerna8d/",
      "created": 1721853634,
      "depth": 0,
      "replies": [
        {
          "id": "lesm2g0",
          "score": 59,
          "body": "I miss 2017 R6",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesm2g0/",
          "created": 1721866301,
          "depth": 1,
          "replies": [
            {
              "id": "let0y8j",
              "score": 9,
              "body": "I feel that",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/let0y8j/",
              "created": 1721872028,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lesmfcv",
          "score": 34,
          "body": "Jynxzi is the only reason R6 is alive tbh",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesmfcv/",
          "created": 1721866435,
          "depth": 1,
          "replies": []
        },
        {
          "id": "leskerf",
          "score": 11,
          "body": "R6 is dying/on life-support, ton of their upcoming games are overpriced and people hate them since they're recycled. Yeah probably",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leskerf/",
          "created": 1721865681,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lev8s2r",
          "score": 8,
          "body": "They take the same soulless open world formula and apply it to different world settings or gameplay loops, it is really tiring. If you have played one open world Ubisoft game in the last 6-7 years, you actually played them all.",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lev8s2r/",
          "created": 1721913885,
          "depth": 1,
          "replies": [
            {
              "id": "levt8rk",
              "score": 2,
              "body": "You meant the last 15 years. Nothing has changed fundamentally since Assassin's Creed 2 back in 2009.",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/levt8rk/",
              "created": 1721920794,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lescbgj",
          "score": 10,
          "body": "Any good Rainbow campaign?",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lescbgj/",
          "created": 1721862697,
          "depth": 1,
          "replies": []
        },
        {
          "id": "leuc8an",
          "score": 5,
          "body": "I really like the Far Cry series. They always get the villains spot on. Also Anno and Watchdogs are pretty  good. I think their problem is a common one with EA and Activision. They are MASSIVE producers and are earning billions where studios like CDPR are just in the millions. And with being a mass producer the image always tends to go to deteriorate as you produce so much, there is also a lit of crap.",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leuc8an/",
          "created": 1721896918,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lers2lg",
          "score": 10,
          "body": "Yeah it had a good run, but they soiled it",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lers2lg/",
          "created": 1721855150,
          "depth": 1,
          "replies": [
            {
              "id": "les4cdf",
              "score": 11,
              "body": "R6 could be so good if they would just hire developers with a brain. Cheater running rampant? We don’t care. Balancing the game? Whats’s that? Here is a new membership that gives you barely anything so we can fill our pockets",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/les4cdf/",
              "created": 1721859314,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lesvdt7",
          "score": 6,
          "body": "? Anno 1800 is very good and all the DLC has been great.",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesvdt7/",
          "created": 1721869863,
          "depth": 1,
          "replies": [
            {
              "id": "letz4ee",
              "score": 5,
              "body": "Anno isn't developed by Ubisoft, just published",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letz4ee/",
              "created": 1721888290,
              "depth": 2,
              "replies": [
                {
                  "id": "leuelai",
                  "score": 6,
                  "body": "Blue Byte was bought by Ubisoft in 2001 so idk what you mean.",
                  "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leuelai/",
                  "created": 1721898535,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "letp6u4",
          "score": 1,
          "body": "Havent played rb6 in a long while, i was wondering whats the state of the game and strats. Might go look up beaulo on youtube see how he doing and if he still plays",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letp6u4/",
          "created": 1721882657,
          "depth": 1,
          "replies": [
            {
              "id": "leuo93l",
              "score": 3,
              "body": "It’s a state where they only care about monetizing because that’s what keeps them afloat",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leuo93l/",
              "created": 1721904667,
              "depth": 2,
              "replies": [
                {
                  "id": "lewaet8",
                  "score": 2,
                  "body": "Mannn, why dont they just monetize the tournaments? All those grand prizes i use to wish i could get doing esports, they could capitalize off that somehow. Because if the game is only about money i assume they put a season “pass” on it like every other desperate game on the market. Pay for the pass, get extra stuff. But rb6 would be better doing paywall tournaments, instead of adding a pass. Make ppl pay to try to earn the money, and use it like a raffle",
                  "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lewaet8/",
                  "created": 1721926206,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lewhq6q",
                      "score": 1,
                      "body": "Esports only takes off with a big following. Unfortunately rainbow 6 is much smaller than CS, dota, league",
                      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lewhq6q/",
                      "created": 1721928494,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lev5xam",
          "score": 1,
          "body": "Can you imagine what I massive pile of flaming garbage a new Splinter Cell would be right now?",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lev5xam/",
          "created": 1721912797,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lez43sg",
          "score": 1,
          "body": "Really? I had a couple of them and they used to be huge.",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lez43sg/",
          "created": 1721961683,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leryn0l",
      "score": 224,
      "body": "I don’t think it’s two games that is causing Ubisoft to have issues.\n\nIMO, they haven’t really created a “new” product since Far Cry 3. It seems like all of their single player games use the same Far Cry formula.\n\nYou can only reskin the same product and sell it to the same consumer base so much, eventually they will get sick of it.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leryn0l/",
      "created": 1721857326,
      "depth": 0,
      "replies": [
        {
          "id": "letcava",
          "score": 31,
          "body": "The far cry formula was already dated and boring going all the way back to far cry 4. Will never understand people who have played that entire series when you can literally just play far cry 3 and have essentially experienced every far cry game that came after (except 3 actually has a decent story and a few semi interesting characters).",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letcava/",
          "created": 1721876618,
          "depth": 1,
          "replies": [
            {
              "id": "letvbsw",
              "score": 4,
              "body": "Vaas was a maniac.",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letvbsw/",
              "created": 1721886023,
              "depth": 2,
              "replies": []
            },
            {
              "id": "leu0xfo",
              "score": 6,
              "body": "You can say that about almost all game franchises. Like it or not, ubisoft has made a game formula that gets people engaged and sells. Even though new games use the same formula, they have new stories and graphical updates, new setting, etc, that's what people are in for. Look at FIFA, NHL, CoD, that are basically reskins of the earlier games and people still buy them. Though I'll admit, using the same formula for all their franchises seems lazy.",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leu0xfo/",
              "created": 1721889416,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "letd2ec",
          "score": 17,
          "body": "Everyone in your thread is talking about Far Cry. I just assumed Assassin's Creed would be Ubisoft's biggest franchise. Is it not?",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letd2ec/",
          "created": 1721876950,
          "depth": 1,
          "replies": []
        },
        {
          "id": "leu3z1l",
          "score": 3,
          "body": "I‘m even surprised they are surviving that long.As you said the games are the same recycled garbage all year long. It was an incredible formula in the PS3 era, but holy hell it basically didn‘t changed a bit.",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leu3z1l/",
          "created": 1721891369,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lev4d0l",
          "score": 1,
          "body": "They seemed to have a big swing and miss with Skull and Bones. I didn't try it but heard it was broken. Did they copy far cry again? I assume it was just assassin's creed black flag stripped of ip. \n\nBethesda's business model for years was release a broken game and let the mod community fix it now release updates. If skull and bones was broken why have they not tried to fix it the same way",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lev4d0l/",
          "created": 1721912182,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgw7lih",
          "score": 1,
          "body": "Star wars outlaws will probably use the wildlands formula tho which is…….oh.",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lgw7lih/",
          "created": 1723007671,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leru4qs",
      "score": 198,
      "body": "As someone who left that company right before S&B was released (cause I didnt want to be associated with that piece of corporate shit in any way) I wish them die and never make games again. They are literally ruled by people who dont give a single fuck about games and players. They treat their community like idiots.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leru4qs/",
      "created": 1721855828,
      "depth": 0,
      "replies": [
        {
          "id": "lervfq5",
          "score": 63,
          "body": "Please say more",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lervfq5/",
          "created": 1721856259,
          "depth": 1,
          "replies": []
        },
        {
          "id": "les73us",
          "score": 22,
          "body": "Did you see what happened with Skull and Bones? I couldn't believe how bad that game came out and would love some explanation",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/les73us/",
          "created": 1721860766,
          "depth": 1,
          "replies": [
            {
              "id": "lezipic",
              "score": 5,
              "body": "I live in Singapore where the game was made. Ubisoft had an agreement with the government to set up a studio here and make a game in return for a sum of money. \n\nThe speculation is that the execs here basically treated it like a paid vacation and put out the minimum garbage product to satisfy the agreement. IMO they would have canceled the game if not for the contract with the government.",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lezipic/",
              "created": 1721968461,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lerwtg2",
          "score": 49,
          "body": "Ooo shit you about to whistleblow?! Lay it on us!!!",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lerwtg2/",
          "created": 1721856718,
          "depth": 1,
          "replies": [
            {
              "id": "letpf9s",
              "score": 10,
              "body": "He better quiet down before we hear a story about him like those boeing pilots 😓",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letpf9s/",
              "created": 1721882778,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "let1i2t",
          "score": 18,
          "body": "Break the NDA homie, spill those beans immediately and anonymously or else you are speaking pure BS",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/let1i2t/",
          "created": 1721872243,
          "depth": 1,
          "replies": []
        },
        {
          "id": "leuzeub",
          "score": 1,
          "body": "Bobby Kotick didn’t either and he’s one of the richest people in the industry.",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leuzeub/",
          "created": 1721910111,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leroi81",
      "score": 70,
      "body": "Pretty much every gaming company has been \"dead\" for years, imo. Their valuations have never really been justified looking at past earnings growth of most of them. Some exceptions exist of course, as they always do, but I just can't see a justification to buy any of them outside of specific theses such as GTA Online becoming a money printer no one expected, or mobile gaming exploding like when Activision Blizzard bought King. But in general? Not growing all that much.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leroi81/",
      "created": 1721854012,
      "depth": 0,
      "replies": [
        {
          "id": "lesdc6r",
          "score": 31,
          "body": "The only gaming companies that make a ton of profit are those that are online and filled with either gacha or other microtransaction mechanics.\n\nVast majority being mobile games with a heavy fanbase in Asia.\n\nJust look at the revenue of the top mobile games:\n\n[https://vgsales.fandom.com/wiki/List\\_of\\_highest-grossing\\_mobile\\_games](https://vgsales.fandom.com/wiki/List_of_highest-grossing_mobile_games)",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesdc6r/",
          "created": 1721863070,
          "depth": 1,
          "replies": [
            {
              "id": "lety60x",
              "score": 3,
              "body": "So that is why they stopped making Command And Conquer games. The day they stopped using Hollywood actors in the cutscenes was a sad day.",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lety60x/",
              "created": 1721887702,
              "depth": 2,
              "replies": []
            },
            {
              "id": "leubq2y",
              "score": 1,
              "body": "Or the ones who make consoles or good games I e. Nintendo and Sony",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leubq2y/",
              "created": 1721896570,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lesn188",
          "score": 14,
          "body": "Well, they're taking 5-10 years to make uninspired, copy-paste sequels or prequels to their successful games. Things have gotten stale, and they're too afraid to experiment and create something exciting",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesn188/",
          "created": 1721866663,
          "depth": 1,
          "replies": []
        },
        {
          "id": "letltzj",
          "score": 9,
          "body": "Look at CDPR earnings. Their last release was Cyberpunk in 2020 and then DLC in 2023 September. Yet in 1st quarter of 2024 they increased their earnings and have profit margin of about 40%. Their cash on hand is increasing every quarter and they are now set to release atleast 4 games in decade on their own with maybe 2-4 more smaller games. And they are yet to enter the whole online multiplayer/MMO scene. And still tshey are trading at pre Cyberpunk prices. I think Cyberpunk release has made people doubtful and hence the lowish price but I'm very bullish on them since their roadmap clearly shows an increased number of games at shorter timescale which should increase tree revenue/profit.",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letltzj/",
          "created": 1721880963,
          "depth": 1,
          "replies": [
            {
              "id": "leui05j",
              "score": 3,
              "body": "CDPR is valued at 3,67 billion €. That's overvalued as f*** compared to Ubisoft or Embracer who have both much higher earnings. There're very few gaming stocks that are less of a buy than CDPR at this orice.",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leui05j/",
              "created": 1721900834,
              "depth": 2,
              "replies": [
                {
                  "id": "lev8phk",
                  "score": 2,
                  "body": "Ubisoft had a profit margin of 12% from what I saw while CDPR has profit margin of over 30-40%. Ubisoft is a mature studio with no room for growth while CDPR has only 4 games in their catalog and is expected to release 5-7 more in next decade. So it is being valued as a growing company with very high profit margin. I don't see it as being overvalued - definitely not compared to Ubisoft.\n\nEdit - Last 4-5 years profit margin in % (from stockanalysis.com)\n\nUbisoft  : 6, -27, 3, 4, \n\nCDPR - 40, 39, 26, 54, 35\n\nThe revenue of cdpr is 1/4th of Ubisoft. But that is why they are trying to increase the output of games. If they indeed double the number of games as planned (now they have a separate studio for Cyberpunk) then their PE will suddenly drop from 31 to 15 making it a great buy. They also have 3rd IP in the works. So now if they can cycle 3 games every 2-3 years with similar profit margin, instead of every 5-6 years then the current stock price will be a bargain. Of course we don't know how successful they will be - but if we knew then everyone would have already bought them and we would have no opportunity.\n\nMore info - Ubisoft had 170 million net income with over 2.5 billion revenue. CDPR had net income of 130 million with 330 million revenue. Still think CDPR is overvalued?",
                  "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lev8phk/",
                  "created": 1721913859,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lexpnmx",
              "score": 1,
              "body": "CDPR doesn't just make revenue from direct game sales. They own [GOG.com](http://GOG.com) and some random Polish media resale licenses or something.",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lexpnmx/",
              "created": 1721942431,
              "depth": 2,
              "replies": [
                {
                  "id": "lexsfdr",
                  "score": 4,
                  "body": "Yeah but GOG is basically a charity lol. They are running with almost not profits and I think they do it out of goodwill. For example, today they released Fallout:London. That is a mod for a game, but it is so big theat it can't be hosted on mod sites. But since it is a mod it can't be sold on steam etc. So they are hosting a mod on their site which will bring in zero revenue. Just for goodwill and bring in traffic I suppose.\n\nBut I get your point - they have several revenue streams - all pointing towards future success.",
                  "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lexsfdr/",
                  "created": 1721943374,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "leruhny",
          "score": 14,
          "body": "Capcom seems relatively decent from what I can tell. Resident Evil is more beloved than ever and Monster Hunter is one of the biggest arpgs on the planet. SF6 is also generally pretty well liked. Other than Dragon's Dogma 2 launch, they seem pretty well liked rn.",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leruhny/",
          "created": 1721855947,
          "depth": 1,
          "replies": [
            {
              "id": "les3to8",
              "score": 21,
              "body": "Capcom was near bankruptcy during the PS4 days, they kept reselling the same product over and over. They really really piveted hard and made good choices on some cornerstone franchises. \n\nAll of their online games have pretty predatory pricing though. They tried to gouge more in Dragons Dogma 2 and the community didn't go for it.",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/les3to8/",
              "created": 1721859106,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lerx4ws",
              "score": 2,
              "body": "Ugh I love monster hunter, can't wait for the new one!!! Great game to play with friends",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lerx4ws/",
              "created": 1721856823,
              "depth": 2,
              "replies": [
                {
                  "id": "leuu0ru",
                  "score": 1,
                  "body": "If anything keeps Capcom afloat it's going to be MH. Once you're in, you're in for life",
                  "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leuu0ru/",
                  "created": 1721907648,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lesaimc",
              "score": 1,
              "body": "Cap has been on fire of late, only exception being Exoprimal. Big L there from the gamerverse.",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesaimc/",
              "created": 1721862028,
              "depth": 2,
              "replies": [
                {
                  "id": "leu5gsb",
                  "score": 2,
                  "body": "I really enjoyed the beta, but the main game just didn’t seem to have the same fun factor.",
                  "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leu5gsb/",
                  "created": 1721892347,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lerx03x",
          "score": 7,
          "body": "I've been playing older games I never got to touch since all new games are garbage anymore.",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lerx03x/",
          "created": 1721856779,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lerm25w",
      "score": 144,
      "body": "No gaming company deserves it more.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lerm25w/",
      "created": 1721853246,
      "depth": 0,
      "replies": [
        {
          "id": "lersd5p",
          "score": 145,
          "body": "EA?",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lersd5p/",
          "created": 1721855249,
          "depth": 1,
          "replies": [
            {
              "id": "lerykpj",
              "score": 53,
              "body": "Look how they massacred my bioware",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lerykpj/",
              "created": 1721857305,
              "depth": 2,
              "replies": [
                {
                  "id": "letirwe",
                  "score": 18,
                  "body": "Look how they massacred my Westwood studios",
                  "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letirwe/",
                  "created": 1721879502,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "letzid1",
                  "score": 1,
                  "body": "Its a bit also their own fault",
                  "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letzid1/",
                  "created": 1721888530,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lr1b48h",
                      "score": 1,
                      "body": "Wasn't it EA that forced them to do live-service in the first place, causing a lot of the old Bioware staff to gradually leave? Correct me if I'm wrong though.",
                      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lr1b48h/",
                      "created": 1728441207,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lertfs7",
              "score": 57,
              "body": "EA!",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lertfs7/",
              "created": 1721855600,
              "depth": 2,
              "replies": [
                {
                  "id": "lesdbrq",
                  "score": 16,
                  "body": "They’re somewhat redeemed by Jedi Fallen Order/Survivor. Just a smidge though.",
                  "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesdbrq/",
                  "created": 1721863065,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "leu0o2r",
                      "score": 8,
                      "body": "That's mostly Respawn Entertainment though, and from what I understand, it's because they said EA had to keep out of their games except for marketing and publishing them. Otherwise the games would have probably gone downhill quickly just like most other studios under EA.",
                      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leu0o2r/",
                      "created": 1721889253,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "leufy8p",
                      "score": 1,
                      "body": "They were too lazy to update the engine for survivor. It's just a reskin on top of fallen order but with worse performance",
                      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leufy8p/",
                      "created": 1721899454,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lexa1b8",
                          "score": 1,
                          "body": "I do agree I expected more…",
                          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lexa1b8/",
                          "created": 1721937431,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lerthyo",
              "score": 14,
              "body": "A close second for sure.",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lerthyo/",
              "created": 1721855619,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lerzr14",
              "score": 11,
              "body": "I respect your opinion bro but Ubisoft is the GOAT in this category.",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lerzr14/",
              "created": 1721857700,
              "depth": 2,
              "replies": []
            },
            {
              "id": "les2pg7",
              "score": 9,
              "body": "They gave me EA College football 25 though.",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/les2pg7/",
              "created": 1721858718,
              "depth": 2,
              "replies": []
            },
            {
              "id": "leutw8o",
              "score": 2,
              "body": "Eh, As shitty as they can be to consumers and the spreading of FIFA addiction I don't think they're shit to their employees, I've heard pay and benefits are pretty good but I've not checked in for a while",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leutw8o/",
              "created": 1721907588,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "les6xjl",
          "score": 23,
          "body": "Blizard/Activision?",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/les6xjl/",
          "created": 1721860698,
          "depth": 1,
          "replies": [
            {
              "id": "les7rxx",
              "score": 4,
              "body": "Definitely no better than Ubisoft",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/les7rxx/",
              "created": 1721861019,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lerv3q9",
      "score": 22,
      "body": "They refused to release the survival mode from division 1 to div2 despite all players want it, to release it for the now dead online spinoff in a game starving for content.\n\nOne bad decision after another...",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lerv3q9/",
      "created": 1721856148,
      "depth": 0,
      "replies": []
    },
    {
      "id": "les8h9o",
      "score": 25,
      "body": "I love Anno 1800",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/les8h9o/",
      "created": 1721861285,
      "depth": 0,
      "replies": [
        {
          "id": "les9o0z",
          "score": 3,
          "body": "Me too",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/les9o0z/",
          "created": 1721861716,
          "depth": 1,
          "replies": [
            {
              "id": "letwo55",
              "score": 2,
              "body": "+2 \nAnd farcry was good until fc6. \n\nBut comparing with their passt Ubisoft Looks pretty bad nowadays. And If the YouTube Video i've watched recently was right all their good developers left.",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letwo55/",
              "created": 1721886805,
              "depth": 2,
              "replies": [
                {
                  "id": "leu8krb",
                  "score": 4,
                  "body": "they have many different studios. The teams did not all leave. Afaik the studio on Anno is complete and running smoothly",
                  "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leu8krb/",
                  "created": 1721894432,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "leucyxw",
          "score": 1,
          "body": "Ubischrott has zero contribution to Anno but the intro Logo; they just grabbed the studio with their dirty claws\n\nhope Ubischrott dies so Blue Byte, the actual developer behind Anno, can become independent or have a decent publisher\n\nmade the mistake buying Anno 1800 on Ubisoft years back and now cannot get the missing DLC on Steam where prices are much better unless I buy the base game on Steam again\n\nI'd be willing to buy the next Anno when it releases at full price but for the reason mentioned above will probably wait that there is a Gold edition in a discount available on Steam; anyway too many games too little time so I can wait  :-D\n\nto add insult to injury, their store is only in French without possibility to change language, in a German speaking country; why on Earth would they actively program an online store to geoblock the language instead of just being able to chose like Steam or GoG are they dumb???",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leucyxw/",
          "created": 1721897422,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpp5mx7",
          "score": 1,
          "body": "Best city builder game IMO",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lpp5mx7/",
          "created": 1727724975,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lesbz1g",
      "score": 10,
      "body": "You can only make the same game over and over so many times before it stops selling. When I think of what was most enjoyable from them I think of far cry 3 and assassin's Creed Black flag. What was that 10 years ago or so? Not really the best image for a company",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesbz1g/",
      "created": 1721862570,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lerucjb",
      "score": 22,
      "body": "I just wish my government stop financing them. Underpaid worker when the tax-payer already contribute a large part of it, that's greedy.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lerucjb/",
      "created": 1721855900,
      "depth": 0,
      "replies": []
    },
    {
      "id": "les4lf0",
      "score": 40,
      "body": "Well well well. I guess WE ARE GETTING USED TO NOT OWNING ANY UBISOFT GAMES. \n\nHAHA The ceo got what he ASKED for",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/les4lf0/",
      "created": 1721859473,
      "depth": 0,
      "replies": [
        {
          "id": "letf99u",
          "score": 3,
          "body": "Can you elaborate on this?  I love me some ~~god~~ good schadenfreude!\n\nEdit: weird autocorrect.",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letf99u/",
          "created": 1721877910,
          "depth": 1,
          "replies": [
            {
              "id": "letfjs0",
              "score": 21,
              "body": "he made a comment , something along the lines of \"people should get used to not owning\" the games they buy.",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letfjs0/",
              "created": 1721878041,
              "depth": 2,
              "replies": []
            },
            {
              "id": "levn56z",
              "score": 5,
              "body": "It was not the CEO.\n\nIt was the Director of Subscriptions in an interview. He was asked \"how can subscription services grow\", in this case concerning Ubisoft+.\n\nHe responded that people need to \"feel comfortable not owning their games\", which imo, is a perfectly rational response to the question he was asked.\n\nHe even continued \"The point is not to force users to go down one route or another. We offer purchase, we offer subscription, and it's the gamer's preference that is important here. We are seeing some people who buy choosing to subscribe now, but it all works.\" In other words, his first quote was specifically targeting the subscription audience - NOT those who prefer to buy games.\n\nOf course that quote spread like wildfire and made headlines along the lines of \"CEO says people need to get used to not owning games\", even though it wasn't the CEO who said that it's lacking all context.",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/levn56z/",
              "created": 1721918851,
              "depth": 2,
              "replies": [
                {
                  "id": "levohq7",
                  "score": 2,
                  "body": "It's funny because people don't own music or movies the way they used to. It makes total sense to have this perspective on games. I mean it's the core aspect of GamePass and part of PS Plus in a way too. People just inserted their dislike of Ubisoft to justify any stock movement.",
                  "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/levohq7/",
                  "created": 1721919282,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "levngra",
      "score": 8,
      "body": "> the Nazi Germany of gaming corporations\n\nHoly cringe",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/levngra/",
      "created": 1721918955,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lesqhgi",
      "score": 14,
      "body": "Fuck Ubisoft",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesqhgi/",
      "created": 1721867975,
      "depth": 0,
      "replies": [
        {
          "id": "lf0pbjp",
          "score": 2,
          "body": "🏅",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lf0pbjp/",
          "created": 1721994264,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lernv8r",
      "score": 11,
      "body": "I agree with your general shitco thesis but oddly enough they've been profitable recently, and the balance sheet is actually in decent shape so they can probably just keep muddling along until the Guillemot clan decides they've had enough and want an exit.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lernv8r/",
      "created": 1721853814,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lesase6",
      "score": 16,
      "body": "Yes. They are making bad decisions in the gaming industry right now and it will not get any better. They are out of touch morons.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesase6/",
      "created": 1721862128,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lete1xa",
      "score": 4,
      "body": "Stock price doesn’t indicate the health of a company. You have to look at their underlying financials. \n\nThere are tons of companies that have very low stock prices but have healthy financials, and plenty of others that have very high stock prices, but is on the verge of bankruptcy (think GameStop and remember when Hertz’s stock price shot up AFTER they had filed for bankruptcy a few years ago?)",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lete1xa/",
      "created": 1721877378,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lesi1p6",
      "score": 2,
      "body": "Yes they have no vision.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesi1p6/",
      "created": 1721864808,
      "depth": 0,
      "replies": [
        {
          "id": "leua2oa",
          "score": 4,
          "body": "Their vision is greed and political DEI bullshit. They literally put ads in a game. And after years of finally making an AC game in japan, they made the character a black guy instead of a bad ass japanese samurai. Don't support such a company",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leua2oa/",
          "created": 1721895438,
          "depth": 1,
          "replies": []
        },
        {
          "id": "leu7gmh",
          "score": 1,
          "body": "Not a good sign to any investor",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leu7gmh/",
          "created": 1721893681,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "les77bg",
      "score": 10,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/les77bg/",
      "created": 1721860803,
      "depth": 0,
      "replies": [
        {
          "id": "letfz4x",
          "score": 2,
          "body": "I agree so much. Everything is seasons and micro-transactions. Like, wtf man?!  Just release a fully fleshed-out, high-quality game!  Is that too much to ask for?!\n\nEdit:  I am looking forward to gta 6 though…",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letfz4x/",
          "created": 1721878232,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lew73s2",
      "score": 3,
      "body": "Happy to see others seeing the light with Ubisoft. The last title I played was Black Flag and that was ok. Their games have always been clunky and rough around the edges. It seems like they put in just enough effort for it to be a \"game\" and nothing more. \n\nI haven't seen any titles that go above and beyond, Far Cry doesn't count. It's basically been the same copy pasted game since Far Cry 3. Assassins Creed games have been ass and near copies of each other for the longest time, Tom Clancy's Ghost Recon was dog shit, WatchDogs had potential and they fucked that too. I don't know who buys their games anymore. \n\nUbisoft is just a weird company to me, never been a AAA studio in my eyes.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lew73s2/",
      "created": 1721925172,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lesorkf",
      "score": 8,
      "body": "How exactly are they the nazi Germany of gaming?",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesorkf/",
      "created": 1721867317,
      "depth": 0,
      "replies": [
        {
          "id": "leug8g9",
          "score": 2,
          "body": "Microtransactions and they pump out very mediocre franchise games like Assasins creed and Far cry every year",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leug8g9/",
          "created": 1721899647,
          "depth": 1,
          "replies": [
            {
              "id": "levp3g9",
              "score": 2,
              "body": "Eh I enjoy the far cry series. Mirage was average at best, but the previous 3 open world assassin’s creeds were enjoyable (to me, of course). Ubisoft’s micro transactions are no where near in the level of a few companies like Bungie (going off of assassin’s creed’s micros). Regardless, micro transactions that don’t affect gameplay significantly don’t matter anyways, especially for single player games.",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/levp3g9/",
              "created": 1721919474,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lert27m",
      "score": 9,
      "body": "They just don't produce anything worth playing I honestly wouldn't mind seeing them go bankrupt, EA is just as garbage",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lert27m/",
      "created": 1721855477,
      "depth": 0,
      "replies": [
        {
          "id": "leu7arj",
          "score": 2,
          "body": "EA is garbage, but ill give them one thing. They do know how to milk their fanbase enough to keep them floating. They know who their small customers are, and they know how to keep them.",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leu7arj/",
          "created": 1721893573,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lesghn5",
      "score": 2,
      "body": "Ubisoft has been on the slide for long time, the controversy with the new ass creed won’t kill them. If it does poorly it will mean layoffs and cut projects, with talk of refocusing. It will be the next few games that kill them off for good if they bomb.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesghn5/",
      "created": 1721864233,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lesk0py",
      "score": 2,
      "body": "There was a post about this in stonks/memestocks awhile ago. \n\nA mixture of not giving a shit about their IPs, devs, and micro transactions, on top of an extreme fetish for open world only games (AC Mirage is an exception, and not the rule) \n\nIf SW Outlaws does poorly, I don't expect them to be cranking out as many games/expect lay offs\n\nThey're a huge studio, though- with multiple locations across the globe (which is common for larger dev companies) \n\nCould go either way; I thought people would vote with their wallets years ago and I was sadly mistaken",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesk0py/",
      "created": 1721865534,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leswaky",
      "score": 2,
      "body": "Hope so. Their games are ass and are just out to rob gamers",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leswaky/",
      "created": 1721870215,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lesx4ob",
      "score": 2,
      "body": "Honestly hope they go under been burnt way tomany times by ubisoft games to even consider buying games from them, all ubisoft does is ruin gaming",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesx4ob/",
      "created": 1721870543,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leuajaq",
      "score": 2,
      "body": "They absolutely FUMBLED a new Rocket League type game called Roller Champions by keeping it on their awful launcher instead of putting it on Steam. Huge shame because the game was fun as fuck, but hey look at that Ubi shits on thier own IP until it dies, nothing new to see here.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leuajaq/",
      "created": 1721895749,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leuho12",
      "score": 2,
      "body": "Their new Star Wars Outlaws game looks genuinely good to me. I think it will be a success.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leuho12/",
      "created": 1721900611,
      "depth": 0,
      "replies": [
        {
          "id": "leukiyp",
          "score": 3,
          "body": "The latest gameplay from the game received a lot of negative feedback in the comments.",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leukiyp/",
          "created": 1721902445,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leuio0r",
      "score": 2,
      "body": "Sorry, i dont get the 4$  stock price, i just checked and they have 18. ",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leuio0r/",
      "created": 1721901263,
      "depth": 0,
      "replies": [
        {
          "id": "lf02nu4",
          "score": 1,
          "body": "US ADR",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lf02nu4/",
          "created": 1721980353,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lev4ipp",
      "score": 2,
      "body": "Ubisoft hired Boston Consulting Group. It's not surprising that Ubi is now slowly dying.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lev4ipp/",
      "created": 1721912245,
      "depth": 0,
      "replies": []
    },
    {
      "id": "les65mp",
      "score": 4,
      "body": "I hope so, Ubisoft games have gone down the drain and their support is truly awful.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/les65mp/",
      "created": 1721860397,
      "depth": 0,
      "replies": []
    },
    {
      "id": "letpyf0",
      "score": 4,
      "body": "Ubisoft is currently the biggest shit stain in gaming. Hope their IPs go to better publishers one day",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letpyf0/",
      "created": 1721883058,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lernzcq",
      "score": 4,
      "body": "Praying they sell off IP to pretty much anyone else",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lernzcq/",
      "created": 1721853849,
      "depth": 0,
      "replies": []
    },
    {
      "id": "les0xpb",
      "score": 3,
      "body": "Yes, their games are trash.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/les0xpb/",
      "created": 1721858104,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lerre2e",
      "score": 4,
      "body": "As someone addicted to rainbow 6 siege, fuck Ubisoft",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lerre2e/",
      "created": 1721854927,
      "depth": 0,
      "replies": []
    },
    {
      "id": "les0gwh",
      "score": 4,
      "body": "Maybe piss off the entire country Japan was worth it for Ubisoft.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/les0gwh/",
      "created": 1721857944,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lerz4v4",
      "score": 1,
      "body": "Ubisoft is a disgusting Company. They have greedy systems in their Games. Im glad everyone noticed how its More Important to them to push a political agenda than creating a believable world. I will Never buy any of their Games ",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lerz4v4/",
      "created": 1721857492,
      "depth": 0,
      "replies": []
    },
    {
      "id": "les9iz2",
      "score": 2,
      "body": "Ubisoft goes steamworks bye bye?",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/les9iz2/",
      "created": 1721861664,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lesh13b",
      "score": 2,
      "body": "Can they take EA, Epic and Rockstar with them?",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesh13b/",
      "created": 1721864431,
      "depth": 0,
      "replies": [
        {
          "id": "leslg33",
          "score": 4,
          "body": "Hopefully. \n\nBut if rockstar dies, who will make GTA6?",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leslg33/",
          "created": 1721866071,
          "depth": 1,
          "replies": [
            {
              "id": "leso6n7",
              "score": 3,
              "body": "yeah, I know… I’m just bitter over those shark cards! i’ll just grumble from my rocking chair. Don’t mind me.",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leso6n7/",
              "created": 1721867097,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "let6n8l",
      "score": 2,
      "body": "Microsoft likes this post",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/let6n8l/",
      "created": 1721874273,
      "depth": 0,
      "replies": []
    },
    {
      "id": "letc8dd",
      "score": 2,
      "body": "Much like EA, there is an overblown sense of hatred and \"die already\" attitude directed towards Ubisoft but this is largely on reddit and other social media.\n\nFact is, gaming isn't all the profitable these days and is far from a growth story, so the stocks are boring and flat.\n\nUbisoft actually makes some decent games, has some good IP and loyal fans. They could certainly do better, be a bit more innovative and work harder on their stories.\n\nAssassin's Creed and Far Cry franchises offer solid games, with decent stories and lore, fun gameplay and are usually good for 80-100+ hours of gameplay (and usually available for steep discounts 3m after release). Do they get a bit repetitive? Sure. Do they have flaws? Yup. Are the stories going to blow your mind, deserving GOTCentury, Oscar's and Emmys? No. But they are solid games, with nice graphics, engaging story and gameplay.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letc8dd/",
      "created": 1721876588,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lesnoci",
      "score": 3,
      "body": "Go woke get fucked.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesnoci/",
      "created": 1721866903,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lesh4ia",
      "score": 1,
      "body": "I haven't enjoyed an Ubisoft game since the original PoP trilogy. Most of their games are pure garbage, so the stock price isn't surprising.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesh4ia/",
      "created": 1721864466,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lesheq4",
      "score": 1,
      "body": "their creativity is dead for sure, lots of hard work and restructuring of how they've developed games could save them",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesheq4/",
      "created": 1721864570,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lesmn5d",
      "score": 1,
      "body": "The video game industry is doing poorly as a group. ",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesmn5d/",
      "created": 1721866516,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lesnkru",
      "score": 1,
      "body": "I think they’re probably a good acquisition target",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesnkru/",
      "created": 1721866865,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lesstgf",
      "score": 1,
      "body": "When do companies start the bidding war",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesstgf/",
      "created": 1721868871,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lestskz",
      "score": 1,
      "body": "Thanks for this,  ubi is garbage even though I enjoy xdefient rn.. but I've never personally never checked there ticker. I'd love to see",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lestskz/",
      "created": 1721869245,
      "depth": 0,
      "replies": [
        {
          "id": "lesudrs",
          "score": 2,
          "body": "Actually after looking for 5 seconds,  looks about ready to start lifting the ask. These are multi year. value area lows that could lead to price appreciation short to medium term. It's risky though I'd wait for the pump and enter on a retrace",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lesudrs/",
          "created": 1721869473,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "let2hd4",
      "score": 1,
      "body": "Yes. The only saving grace is when Ubisoft was about to bankrupt and is looking for buyers to bail em out and Microsoft buy em for cheap",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/let2hd4/",
      "created": 1721872626,
      "depth": 0,
      "replies": []
    },
    {
      "id": "let352t",
      "score": 1,
      "body": "I feel like they have enough of a backlog where if they really nail down a string of remasters they could get some momentum.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/let352t/",
      "created": 1721872882,
      "depth": 0,
      "replies": []
    },
    {
      "id": "let3osg",
      "score": 1,
      "body": "they have been a flop for a long time and with all there damn dealings with sweet baby inc I hope to God they both disappear forever",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/let3osg/",
      "created": 1721873096,
      "depth": 0,
      "replies": []
    },
    {
      "id": "letc0dx",
      "score": 1,
      "body": "Here’s to hoping their next few releases flop hard and put the death nail into the company. It would suck to see the good devs lose their jobs, but if they really are good devs then there are 100 other quality studios that will take them.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letc0dx/",
      "created": 1721876493,
      "depth": 0,
      "replies": []
    },
    {
      "id": "letcsni",
      "score": 1,
      "body": "Ubisoft used to be good. But the money men are calling the shots on game development. They also think they can compete with steam, losing out on day one sales to the majority of gamers. Why would I buy from ubisoft and have another bloat ware launcher with nothing to add when ibcna wait, get it cheaper and on steam?",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letcsni/",
      "created": 1721876832,
      "depth": 0,
      "replies": []
    },
    {
      "id": "letd33x",
      "score": 1,
      "body": "Has anyone mentioned their online only requirement for PC games…even single player games. Yeah, Ubiconnect killed this company. They even deleted customers games if they hadn’t logged on in a few years. I’m sorry, but if you mandate that I have to be connected to the internet to play your games, you better not get stingy with the server space just because I haven’t played in a few years. OP is right. This company deserves to die.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letd33x/",
      "created": 1721876959,
      "depth": 0,
      "replies": []
    },
    {
      "id": "letezcp",
      "score": 1,
      "body": "All they need to do is start pumping out Assassin's Creed even faster, maybe 3 or 4 per year. Since it's basically a copy paste job it shouldn't be that hard.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letezcp/",
      "created": 1721877788,
      "depth": 0,
      "replies": []
    },
    {
      "id": "letlj77",
      "score": 1,
      "body": "Hopefully",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letlj77/",
      "created": 1721880814,
      "depth": 0,
      "replies": []
    },
    {
      "id": "letpxch",
      "score": 1,
      "body": "If I wouldn’t buy a product from someone, I sure as hell wouldn’t buy their stocks either.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letpxch/",
      "created": 1721883041,
      "depth": 0,
      "replies": []
    },
    {
      "id": "letq29a",
      "score": 1,
      "body": "Puts?",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letq29a/",
      "created": 1721883115,
      "depth": 0,
      "replies": []
    },
    {
      "id": "letsi4u",
      "score": 1,
      "body": "The only AAA game studios I trust these days are Rockstar, CPRD.l and larian studios.    Indie developers are way better.  ",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letsi4u/",
      "created": 1721884418,
      "depth": 0,
      "replies": []
    },
    {
      "id": "letud8x",
      "score": 1,
      "body": "Well, nothing’s going their way, is it—and their upcoming “hits” (SW Outlaws & AC Shadows) look like fiascos already.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letud8x/",
      "created": 1721885466,
      "depth": 0,
      "replies": []
    },
    {
      "id": "letzo6u",
      "score": 1,
      "body": "On the other hand though, if they ever manage to get their shit together, $4 entry price is pretty good. \n\nStill, a very tough proposition. It's fucking *Ubisoft* after all. I think the reason the stock is this low to begin with is because they've had tons of time to course-correct...",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/letzo6u/",
      "created": 1721888631,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leu197u",
      "score": 1,
      "body": "Ubisoft won't die. They will just get bought over for their IP which is quite valuable if managed right. It's sort of like Marvel 30 years ago and Marvel now. We just won't know them as Ubi anymore.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leu197u/",
      "created": 1721889623,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leu4k63",
      "score": 1,
      "body": "It deserves to. Before they released buggy games too early and had annoying DRM. Now they've added predatory live service and DEI to the menu and the games look unplayable.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leu4k63/",
      "created": 1721891746,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leu6vbr",
      "score": 1,
      "body": "I havent bought their games in a very long time. Once you played one or two of their games, then you have played all of their games. I do see that they will fall into bankruptcy at some point, maybe follow the same fate as VICE?",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leu6vbr/",
      "created": 1721893286,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leuhokc",
      "score": 1,
      "body": "All I know is that the Mario + Rabbids games were dope. But I suspect that was Nintendo's doing.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leuhokc/",
      "created": 1721900621,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leutivi",
      "score": 1,
      "body": "I certainly have no love lost for Ubisoft but man I will be devastated if something happens to Blue byte studios. Anno is one of my all time favorite gaming franchises.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leutivi/",
      "created": 1721907409,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leuwkmq",
      "score": 1,
      "body": "My opinion is AAA game aren’t what it used to be before, Ubi is still called as a AAA studio but the profit ain’t there anymore, some independent studio are doing way better with less budget. Ubi as one of the “smallest-big” studio is within the firsts to get rekt.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leuwkmq/",
      "created": 1721908838,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lev9b45",
      "score": 1,
      "body": "Let’s hope not. Assassins creed. Tom Clancy. Far Cry.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lev9b45/",
      "created": 1721914080,
      "depth": 0,
      "replies": []
    },
    {
      "id": "levfq2o",
      "score": 1,
      "body": "shit stain on video games",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/levfq2o/",
      "created": 1721916377,
      "depth": 0,
      "replies": []
    },
    {
      "id": "levwxjn",
      "score": 1,
      "body": "They didn’t release any good games since R6.\nAlso they killed R6 completely with making the casual + microtransactions. Haven’t played a Ubisoft game in years now.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/levwxjn/",
      "created": 1721921964,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lewf9hh",
      "score": 1,
      "body": "They don’t care about what gamers want. Pretty dumb idea when your entire customer base is gamers. The money will come only if you make good games - plain, simple and painfully obvious. They’re too clueless to see even that.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lewf9hh/",
      "created": 1721927728,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lewspbd",
      "score": 1,
      "body": "Honestly at this point, that splinter cell remake better be very good or I would be dumping this stock",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lewspbd/",
      "created": 1721931952,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lexi16w",
      "score": 1,
      "body": "If they stop making AC games, I may finally be able to catch up with them!",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lexi16w/",
      "created": 1721939943,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezcacv",
      "score": 1,
      "body": "Gamers keep telling me Ubi sucks",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lezcacv/",
      "created": 1721965318,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf028ob",
      "score": 1,
      "body": "0% chance they dying. Tencent has been very commissary to strengthen their partnership and valuee their stock at 10$B in 2022. Ubi CEO Guillemot just hates investors and doesn’t listen for advice. They could have fired 50% of their staff long ago and ditch the unprofitable games. They finally have a big new game with Shadows this holiday after 4(!) years. I’m 15% down on my investment now. Their last quarter was profitable. With AC Shafows released they will be valued at single digit PE and the game should sell for 1-2 years",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lf028ob/",
      "created": 1721980070,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgb8pzd",
      "score": 1,
      "body": "Hope so. I hope they disappear. Let them burn in hell for the insults they brought to the gaming community.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lgb8pzd/",
      "created": 1722699117,
      "depth": 0,
      "replies": [
        {
          "id": "lgb97ti",
          "score": 1,
          "body": "We may be in luck. It's no longer $4.00\n\nMore like $3.77 now",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lgb97ti/",
          "created": 1722699285,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljptes1",
      "score": 1,
      "body": "Hopefully. Their glory days over",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/ljptes1/",
      "created": 1724513332,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lldqgow",
      "score": 1,
      "body": "New lows hit after Star Wars outlaws",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lldqgow/",
      "created": 1725404068,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmqrg40",
      "score": 1,
      "body": "I had similar post recently",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lmqrg40/",
      "created": 1726135793,
      "depth": 0,
      "replies": []
    },
    {
      "id": "loqvv79",
      "score": 1,
      "body": "I hate Ubisoft worse than the Nazis. The Nazis? At least they had the decency to be entirely inhumane and despicable, and never did 1 single thing worth of praise or admiration in any capacity.  \nUbisoft on the other hand? They released fucking GEMS of games during their Golden Age, and then continue to just ignore that and try to become as evil as possible...",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/loqvv79/",
      "created": 1727208874,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp1x32e",
      "score": 1,
      "body": "lol as garbage as most people say these game are nobody’s getting what needs to be done. The only thing that devs respect is sales. Don’t complain about a game after it’s bought because that means absolutely nothing. That’s why I stopped getting them first release. I watch gameplay and see if I want it. I don’t go by reviews, I don’t go by what friends say none of that it’s your money and you’re a consumer so the only way to stop it is to stop getting games because of the title then get pissed later",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lp1x32e/",
      "created": 1727372272,
      "depth": 0,
      "replies": [
        {
          "id": "lp277g8",
          "score": 1,
          "body": "I don't buy Ubisoft games. But I have a general lack of respect for how they seem to detest their players and employees alike.",
          "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lp277g8/",
          "created": 1727375418,
          "depth": 1,
          "replies": [
            {
              "id": "lp2jpvd",
              "score": 1,
              "body": "Well then that’s most devs these days are every one of them has had employees complaints over the last 10 years",
              "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lp2jpvd/",
              "created": 1727379371,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lr253hy",
      "score": 1,
      "body": "Ubisoft should start getting used to not owning any capital.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lr253hy/",
      "created": 1728458956,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ltd7bv8",
      "score": 1,
      "body": "Yes, i hope so. Only good recent game prince of persia lost crown, its successor being scrapped....",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/ltd7bv8/",
      "created": 1729701650,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leru9zl",
      "score": 1,
      "body": "Ubisoft shouldn't be allowed to portray people in media, fiction or not.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/leru9zl/",
      "created": 1721855877,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lern7b1",
      "score": 0,
      "body": "Stagnating and rotting",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lern7b1/",
      "created": 1721853608,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lero2ww",
      "score": 1,
      "body": "Fingers crossed. Hopefully the employees are able to spin off into successful indie studios.",
      "permalink": "/r/stocks/comments/1ebbiob/is_ubisoft_dying/lero2ww/",
      "created": 1721853879,
      "depth": 0,
      "replies": []
    }
  ]
}