{
  "title": "What justifies Tesla's high P/E ratio amid all of the headwinds? (Unbiased answers please)",
  "score": 114,
  "selftext": "Tesla's fundamentals are weak. Revenue and income has been declining YoY for two consequtive quarters now. Vehicle deliveries declining. Their market is getting eaten away by competitors and they have no strategy to combat that. Reliability (a proxy for product quality) is mid-tier. Their R&D projects are missing schedules for a while, and has no substance. \n\nEven though there aren't much positive indicators around the stock for a while now, why do they have such a high P/E ratio (60 as of this post)? What is the justification?\n\nA typical response may be \"because Elon is a good liar\" or some anti-Elon emotional take, but I refuse to believe that such a superficial factor can support such a high P/E ratio. The average P/E ratio of other top car manufacturers is around 18. I can believe it if the Elon factor pushes it up to around 30, but 60 is just ridiculous. \n\nWhat are the investors and traders looking at? Am I missing something? Or is this a purely speculative bubble and are we in for a royal shitstorm when it pops?",
  "link_flair_text": null,
  "id": "1eblyij",
  "num_comments": 182,
  "created_utc": 1721881541,
  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/",
  "comments": [
    {
      "id": "letoogo",
      "score": 133,
      "body": "Tesla has other supposedly promising projects in the pipeline (like robots). Imagine if they were first to market with a general-purpose robot that could replace a human laborer? I don’t think that’ll happen, but some do. They’re somewhere in between a car manufacturer and a speculative stock. And yeah, the whole Elon cult of personality is a huge part of that. People have faith in him.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letoogo/",
      "created": 1721882394,
      "depth": 0,
      "replies": [
        {
          "id": "letqvu4",
          "score": 84,
          "body": "I understand, but it's still basically pipe dreams at this point. Boston Dynamics are miles ahead in terms of robotics that replace labor, so Hyundai (who owns a majority stake in BD) should have a P/E premium. Same goes for GM who owns autonomous driving company Cruise, which is already ahead of Tesla in robo taxis.\n\nSo maybe it's those R&D projects combined with high effort PR by Elon in order to hype it up?",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letqvu4/",
          "created": 1721883548,
          "depth": 1,
          "replies": [
            {
              "id": "leuw80a",
              "score": 31,
              "body": "Right, so we go back to the cult of personality thing. Elon for example recently said he believes the market for general purpose humanoid robots is 20 billion units. One for every person in the planet plus industrial use. Now, of course, that’s a preposterous number, and even if true, there’s absolutely no reason to believe Tesla’s Optimus will be the winner in that space. But the Elon cultists believe it because they will believe anything he says. Similarly with robo taxi services. Will Tesla be the winner and will it really turn into a multi trillion dollar industry? Very likely not on both counts, but again, people believe it because Elon said it. And that’s how you get to Tesla’s ludicrous valuation. Trying to rationalize it with observable facts is an exercise in futility.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuw80a/",
              "created": 1721908679,
              "depth": 2,
              "replies": []
            },
            {
              "id": "leuq7d0",
              "score": 5,
              "body": "Does Hyundai have that P/E premium?",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuq7d0/",
              "created": 1721905731,
              "depth": 2,
              "replies": [
                {
                  "id": "levby7z",
                  "score": 8,
                  "body": "Unfortunately no. I don't think most people know what Hyundai owns the majority of BD now so might be a PR issue.",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/levby7z/",
                  "created": 1721915051,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lewu1jk",
                      "score": 3,
                      "body": "This is news to me and I click on every BD video/thread I see!",
                      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lewu1jk/",
                      "created": 1721932378,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "leuf0bp",
              "score": 16,
              "body": "Elon saying he's going to do something that's a pipe dream, falling short, but still getting close enough to be impressive is basically his gimmick at this point.  A lot of people have gotten rich off of that happening.  People aren't going to stop believing it until they all lose their shirts.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuf0bp/",
              "created": 1721898820,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lf15phe",
              "score": 2,
              "body": "I always wonder how people can think either cruise or even waymo are ahead of tesla fsd. Do you mind explaining?",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lf15phe/",
              "created": 1722001102,
              "depth": 2,
              "replies": [
                {
                  "id": "lf4j30n",
                  "score": 2,
                  "body": "Okay! I just formulate my opinion based on what is actually commercially available. Disregard any plans, roadmaps, and promises. Also I disregard R&D showcase demos because Tesla is guitly of too many false claims, false numbers, and fabrications of fake demo videos in the past.\n\nBased on that, what do they actually have commercially?\n\nTesla has: human-supervised self-driving. No actual track record of fully driverless driving approved by regulators. This is a Level 2-3 autonomy based on the SAE's official criteria. It is available worldwide and I think that is awesome, and I know it's a great experience under human supervision, but still objectively a Level 2-3 autonomy.\n\nWaymo, Cruise has: Fully driverless self-driving. It has cleared regulatory compliance to be actually able to drive around driverless, and is actually doing so. Geographically limited though, meaning it is a Level 4 autonomy based on the SAE criteria. It is commercially available to average customers, meaning that you and I can sign up and ride it today. \n\nSo based on 1) The SAE's official hierachy of Levels of Autonomy, and 2) Actual commercial availability and regulatory clearance of fully autonomous cars, I think it is safe to claim that Waymo and Cruise are way ahead of Tesla.",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lf4j30n/",
                  "created": 1722043255,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lg7l61g",
                      "score": 1,
                      "body": "The only reason waymo is classified on a higher level than tesla is because they can drive „driverless“. In reality that means they have to be regularly controlled digitally. So whenever a waymo car stops in the road because of a traffic cone a waymo employee steps in and controls it digitally. From what i understand, tesla makes more miles than waymo before these instances occur. So essentially they are both not fully autonomous yet, but tesla is far ahead even though they work worldwide, which is a big thing because waymo really isnt too scalable at all. Additionally waymo cars cost an insane amount because of all the radars etc.",
                      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lg7l61g/",
                      "created": 1722636268,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "letx4m0",
              "score": 9,
              "body": "Prototype is one thing, mass production is another. One thing Elon is good at is going from prototype to mass production. Just look at Tesla and SpaceX. One of the reasons they are successful is because he succeeded in the production part. Also they are not afraid to take wild different approaches to problems. Sure many of those look stupid and fail (haha Elon is an idiot) but some look stupid and succeed (he only succeeds because of his engineers), bringing a massive boost. \n\nHis success is that he dares put the money and resources in the stupid ideas, he is not afraid to fail and adapt whereas many old industries are too afraid to take risks. So it is a high risk approach. Invest accordingly :)",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letx4m0/",
              "created": 1721887078,
              "depth": 2,
              "replies": [
                {
                  "id": "leuy9wq",
                  "score": 25,
                  "body": "This seems like a common mistake - \"Elon\" wasn't the brains behind any of those innovations. He raised the money and recruited brilliant people, often with a pitch that the mission was vital to the future of humanity. \n\n\nThis is something people don't realize about his toxicity over the past few years - his ability to attract brilliant people has been substantially reduced. There's no longer mystique and halo effect saying you're going to work for one of his companies - instead, you'll have to explain to all your friends & family why you would do such a thing.\n\n\nThat's a major issue for Tesla as a brand, and any future Elon endeavor. SpaceX is so far ahead of its competitors that it will likely be fine, but a hypothetical robotics or AI division most certainly isn't.",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuy9wq/",
                  "created": 1721909609,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "leu0v00",
                  "score": 22,
                  "body": "Boston Dynamics already sold at least 1,000 units of Spot ( [source](https://www.strategy-business.com/article/Boston-Dynamics-wants-to-change-the-world-with-its-state-of-the-art-robots) ). It's not a massive number but it is mass production and it is ahead of Tesla. Cruise driven one million REAL driverless miles ( [source](https://www.getcruise.com/news/blog/2023/cruises-safety-record-over-one-million-driverless-miles/) ). Waymo did 7 million ( [source](https://www.theverge.com/2023/12/20/24006712/waymo-driverless-million-mile-safety-compare-human) ).\n\nAll three are way ahead of Tesla in terms of actual deployment and commercialization. \n\nSure Elon succeeded at mass production of the S3XY cars, and that's a big feat, but those aren't exactly moonshot inventions. Multiple commercial EVs existed before Tesla, and the general form factor of the cars were similar to ICE cars (for their first car, the Roadster, they just used the body of an ICE car). Their first radical departure from a \"typical\" car was the Cybertruck, and we all know how that went down.\n\nReusable rockets are actualy novel inventions though. No dispute on that.",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leu0v00/",
                  "created": 1721889373,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "leuadst",
                      "score": 16,
                      "body": "1000 units is not mass production... It's not even 1% of mass production.\n\nNever mind 1,000 units over 5 years... :')",
                      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuadst/",
                      "created": 1721895646,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "leuavgn",
                          "score": 0,
                          "body": "It's mathematically infinitely more massive than 0. Name one other company that has been able to develop, produce, and actually sell more than 1,000 general-use autonomous AI robots.",
                          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuavgn/",
                          "created": 1721895979,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "leuj1b9",
                              "score": 3,
                              "body": "liquid ripe bake jar aloof mourn resolute steer muddle paint\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuj1b9/",
                              "created": 1721901499,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "leumc09",
                                  "score": 4,
                                  "body": "Wow I totally embarassed myself there. Thanks for the correction!",
                                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leumc09/",
                                  "created": 1721903554,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lev01iw",
                                      "score": 4,
                                      "body": "Infinity is an acceptable answer technically.",
                                      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lev01iw/",
                                      "created": 1721910385,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "leuhtoy",
                              "score": 0,
                              "body": "I have to respectfully deny or want to hear more about your opinion because I thought Tesla was the first to mass market and gave away their IP for free",
                              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuhtoy/",
                              "created": 1721900715,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "leumrs5",
                                  "score": 5,
                                  "body": "There were several different topics in my one comment so maybe that confused you - I was only referring to Optimus, their R&D effort on general-purpose autonomous robots. In that field Tesla doesn't have anything more than a R&D showcase, while Boston Dynamics actually developed and is selling more than a thousand of their \"Spot\" robots. They are quadruped robots (like a dog) and aren't humanoid, but they are autonomous, meaning they can walk around and reach a destination based on a goal. They can avoid obstacles and walk through uneven terrain like stairs or off-roads without being preprogrammed. \n\nOn a sidenote Boston Dynamics also does have their autonomous humanoid robot Atlas, but that's still in R&D",
                                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leumrs5/",
                                  "created": 1721903815,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "leuj51c",
                      "score": 2,
                      "body": "Cruise is not scalable. It is geo locked, costs a fortune with all the sensors, has to follow specific routes, cannot go over a certain speed limit and is restricted certain weather conditions. All of these things Tesla has more of less solved.\nWith the flick of a switch vision base fsd (which is miles ahead of cruise) can enable autonomous driving for every Tesla anywhere in the world. That's where the value lies. Tesla has more data to train their AI than anyone else. No one even comes close. It's just a matter of time (1-3 years if I had to guess  before FSD is completely unassisted given how fast its progressing) just my 2cents",
                      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuj51c/",
                      "created": 1721901565,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "leum6lk",
                          "score": 9,
                          "body": "As far as I am aware, the geofencing is a result of regulatory compliance. In order to run as a Level4 autonomous vehicle (compared to Tesla being Level2-3) , they had to comply with strict standards, hence geofencing. \n\nSetting aside which one MIGHT be better, if we use the Levels of Autonomy as a  quantitative metric, Level4 Autonomy is defined as basically \"fully autonomous in controlled areas\". So according to the SAE(Society of Automotive Engineers), being fully autonomous in a defined area is closer to full autonomy than not being fully autonomous, however large the covered area may be. \n\nI don't have enough technical knowledge to argue against the SAE so I rely on their metric.",
                          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leum6lk/",
                          "created": 1721903464,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "leuw5pp",
                              "score": -2,
                              "body": "I don't think you need to be an expert in the area to understand the concept of scalability and addressible market though. Tesla is betting on a generalized approach that can be scaled much more easily than Waymo and Cruise's approach. No clue whether that will come to fruition, but that's the difference investors are betting on as well, which is the answer to your original question.",
                              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuw5pp/",
                              "created": 1721908649,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lexghuc",
                                  "score": 2,
                                  "body": "Search up any video of FSD 12.5 that got out yesterday, it's basically solved at this point. Those that have followed closely knows.",
                                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lexghuc/",
                                  "created": 1721939455,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lrx4kdq",
                      "score": 0,
                      "body": "I know your comment is 3 months ago.\n\nI looked up Spot, it’s just a robot dog.\n\nThe latest Tesla event showed full humanoid robots with functioning hands and legs. Do you know how impressive it is to get hands working on a robot?\n\nHas Robot Dynamics even tried?\n\nWhat Elon does, and nobody else does for some reason, is have moon shot goals for his engineers, and he will only abandon a goal if someone argues that the laws of physics does not allow it (First Principals)\n\nSo while companies are creating robot dogs, he’s pushing his engineers to make robot humans.\n\nWhile companies create hybrid cars, he pushes for a mass production ev.\n\nWhile companies not even try for a reusuable booster, he has created a reusuable super booster, and aims for a system where the entire launch vehicle is also rapidly reusable.",
                      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lrx4kdq/",
                      "created": 1728932438,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "leuoed7",
                      "score": -7,
                      "body": "Tesla has over 1.3 Billion FSD miles ( [source](https://www.teslarati.com/tesla-fsd-users-pass-1-3-billion-cumulative-miles/) ) so not sure how you came up with \"all three are way ahead of tesla in actual deployment\", lol.",
                      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuoed7/",
                      "created": 1721904749,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "leuounv",
                          "score": 12,
                          "body": "Again, that is not actual driverless miles. Refer to [this comment](https://www.reddit.com/r/stocks/comments/1eblyij/comment/leum6lk/) .",
                          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuounv/",
                          "created": 1721905001,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "leupb85",
                              "score": -14,
                              "body": "And again, those methods aren't scalable and don't meaningfully solve the driving problem.\n\n\nWatch those level 4 systems fall to their knees due to a few simple traffic cones or construction - they don't know how to how to drive, it's just expert systems/a short leash.\n\nA true level 4 system doesn't need geofence... should be obvious.",
                              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leupb85/",
                              "created": 1721905254,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "leuscoi",
                                  "score": 11,
                                  "body": "The literal definition of Level4 autonomy is \"full autonomy under limited conditions\" ( [SAE source](https://www.sae.org/blog/sae-j3016-update) ).\nFull autonomy with no limitations(geographical ones included) is Level 5.",
                                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuscoi/",
                                  "created": 1721906832,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lev9smr",
                                      "score": -1,
                                      "body": "It's hard to deny Tesla's progress. I have been trying out fsd every once in a while over the last 2 years. It was pretty bad when I initially used it. Got another free trial last week and I have used it to drive most places with almost 0 take overs (I would take over when pedestrians are present because I don't feel like testing that scenario out).\n\nI went from skeptic to believer in the sense that Tesla will be able to accomplish it. One of the roads near me started repair work, and FSD navigated it well before and after the construction started.",
                                      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lev9smr/",
                                      "created": 1721914262,
                                      "depth": 8,
                                      "replies": []
                                    },
                                    {
                                      "id": "leut49g",
                                      "score": -9,
                                      "body": "Limited conditions being Limited locations is kind of shitty - doesn't look promising when you compare it to how we learn to drive.\n\n\nSo, that is why tesla gets the p/e.\n\n\nCan you understand? It seems like you purposely don't want to.",
                                      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leut49g/",
                                      "created": 1721907212,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "leut39v",
                  "score": -11,
                  "body": "You've perfectly captured the ridiculousness of the hate towards Elon in 2 sentences. \n\nI seriously cannot deal with the stupidity of this society - where a guy who's willing to use billions of his own money to help fund potentially life-changing technology experiments gets all this hate because _HiS tWeEt OfFeNDeD Me_.",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leut39v/",
                  "created": 1721907199,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "letrdht",
              "score": 5,
              "body": "A large portion of the future projection/valuation of TSLA is based on a massive percentage of US consumers  switching over to an EV after their current ICE vehicle- we're not seeing that mainly because even the Model 3 is out of reach for the average American. (Which is also why that low-cost model is in development)\n\nIf tariffs protecting and subsidizing the American EV industry didn't exist then BYD would have crushed TSLA.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letrdht/",
              "created": 1721883811,
              "depth": 2,
              "replies": [
                {
                  "id": "letxw1y",
                  "score": 3,
                  "body": "BYD wouldn't crush Tesla, but they could lead. What their gross margins are would be the concern, and they would crush all the other competition for certain. Tesla still does fine in China.",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letxw1y/",
                  "created": 1721887535,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "letrv7w",
                  "score": 0,
                  "body": "Okay that makes a lot of sense! What you are saying is that the US market is protected from the Chinese EVs, and therefore Tesla still has a lot of growth potential domestically right? I haven't thought of that perspective. That's definitely a positive indicator from an investors point of view.",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letrv7w/",
                  "created": 1721884075,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lets1se",
                      "score": 7,
                      "body": "Yep, the entire American auto industry is protected from China- TSLA just has it better because it gets EV credits too. There is literally a 100% tariff on non-American EVs this year.\n\nI wouldn't necessarily say that TSLA has a lot of growth potential domestically, there are a ton of competitors coming out with decent EV cars and Musk has politically turned away a LOT of his customer base.",
                      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lets1se/",
                      "created": 1721884173,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "letwqz9",
                          "score": 6,
                          "body": "You realize EV credits aren't Tesla exclusive right. Protection from foreign companies dumping product in the US has been around for a while, nothing new.",
                          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letwqz9/",
                          "created": 1721886851,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lev5v98",
                              "score": 3,
                              "body": "Yes, that's what a tariff is. (Antidumping duties are considered specific types of tariffs). What I meant is that TSLA gets both auto-manufacturing protections AND EV credits because they exclusively manufacture EV cars. \n\nTesla has been the biggest user of EV credits in the US since the Model 3 was sold.",
                              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lev5v98/",
                              "created": 1721912775,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "letsfch",
                          "score": 1,
                          "body": "> I wouldn't necessarily say that TSLA has a lot of growth potential domestically, there are a ton of competitors coming out with decent EV cars and Musk has politically turned away a LOT of his customer base.\n\nI personally share your view there. But your comment about a protected market is still valid, and I can definitely put myself in the shoes of some investors pointing to that to justify a premium on the stock.",
                          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letsfch/",
                          "created": 1721884376,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "leu05tu",
                          "score": 1,
                          "body": "Didn't Trump say he was going to get rid of the tariffs and have those companies build in the USA and also do away with the credits ... I'm keeping my eye on that.",
                          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leu05tu/",
                          "created": 1721888934,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lev63ub",
                              "score": 2,
                              "body": "I wouldn't take anything he says at face value lol, a lot of politicians make promises to get elected. Remember student loan forgiveness from Biden? or the WALL that Mexico would pay for from Trump?",
                              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lev63ub/",
                              "created": 1721912867,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lev8jk6",
              "score": 1,
              "body": "I think you are really overthinking this.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lev8jk6/",
              "created": 1721913798,
              "depth": 2,
              "replies": []
            },
            {
              "id": "leuz37s",
              "score": 0,
              "body": "Are you aware of the progress of Tesla on self driving and the Dojo supercomputer, as well as their in house NPUs? How about the 1B+ miles of driving data for training the neural net? If you are up to speed on the latest AI developments, you will know that training data (quality and quantity) is one of the core pillars of effective AI.\n\nOptimus, their humanoid robot, is already doing work in Tesla factories, training\n\nLet’s also not forget about Teslas energy storage business…\n\nCombine all of this and you’ll see Tesla is not a vehicle company. They are a technology company that sells cars, which also happens to have been the first of their major products.\n\nNot comparable to other automakers",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuz37s/",
              "created": 1721909970,
              "depth": 2,
              "replies": []
            },
            {
              "id": "leuabm4",
              "score": -2,
              "body": "I can totally understand if people don't want to touch Tesla because they don't believe in their autonomous software and bots, and if you don't believe in those there's little reason to own the stock. The car business will probably justify its current valuation over the next decade, but that's a poor investment. The ROI is in the FSD and Bot.\n\nThe problem though is that a lot of people who don't believe in those, don't believe in them for the wrong reasons and you appear to be one of them:\n\n> Boston Dynamics are miles ahead in terms of robotics that replace labor\n\nTesla is NOT competing with Boston Dynamics, which makes pre-programmed robots not autonomous robots. To say BD is \"ahead\" is extremely silly. It's like saying Usain Bolt is miles ahead of Messi. Sure, he might run faster, but Messi is not trying to just run in a straight line.\n\n> Same goes for GM who owns autonomous driving company Cruise, which is already ahead of Tesla in robo taxis.\n\nI read this a bit too late. You're clearly not actually trying to understand anything but acting in bad faith. Cruise is not only working on geofenced autonomous cars, not fully autonomous cars, but they've also all but shut down after the recent scandal. To say they're \"ahead\" of Tesla just shows you're not being genuine.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuabm4/",
              "created": 1721895604,
              "depth": 2,
              "replies": [
                {
                  "id": "leubp3m",
                  "score": 9,
                  "body": "If your knowledge of BD is that it is preprogrammed, let's not even have this conversation. I'm not trying to be hurtful; Researching about BD has not been your priority in your life and that's perfectly fine.\n\nAs for Cruise, yes they have been geo fenced, but they have done 1 million miles ACTUALLY being driverless and are being put to ACTUAL commercial use compared to Tesla's FSD which hasn't even been able to get passed human-supervised autonomous driving. (This is the extent of my knowledge so please correct me if I'm wrong; but in that case appreciate it if you can cite non-Elon sources)\nAnd Tesla's FSD had enough scandals too so let's just cancel them out.",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leubp3m/",
                  "created": 1721896550,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfs83g8",
                      "score": 1,
                      "body": "I could've worded that better. I don't mean preprogrammed as in the exact movements are preprogrammed, but that they're using heuristics to determine how to react. Also many of the flips and jumps that they do are not decision-based, but actually preprogrammed. That's very different than what Tesla is trying to do with both FSD and the bot.\n\n> As for Cruise, yes they have been geo fenced, but they have done 1 million miles ACTUALLY being driverless and are being put to ACTUAL commercial use compared to Tesla's FSD which hasn't even been able to get passed human-supervised autonomous driving. (This is the extent of my knowledge so please correct me if I'm wrong; but in that case appreciate it if you can cite non-Elon sources)\n\nYou are correct, but I fail to see the significance. In the end the only thing that matters is how fast can you service the entire planet (or at the very least the vast majority of wealthy populations). Cruise is not even trying to achieve that. At best their system would allow them to service major cities and highways in 50 years or so, but 90% of roads would still be unserviced.\n\nTesla on the other hand is actually on a clear path to achieving a system that could drive anywhere on the planet within a decade conservatively, especially after seeing the data from the 12.5 release.\n\n> And Tesla's FSD had enough scandals too so let's just cancel them out.\n\nTesla's FSD hasn't had any scandals that I'm aware of, and certainly not to the extend of trying to hide evidence from regulators.",
                      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lfs83g8/",
                      "created": 1722414498,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "levpzxq",
              "score": -2,
              "body": "Boston Dynamics isn't actually that far ahead of them as their technology is totally tied up with very high cost manufacturing methods. They have a significant head start on the function of the actual tech, which is the highest visibility aspect, but Tesla ALSO has a significant head start in terms of mass scale manufacturing, and DFM with cheaper components and materials. I am not saying BD isn't more advanced, I just think its a much tighter race between the two than it seems. I ALSO think cost viable humanoid robotic labor replacement is one of these \"always ten years out\". Like the cure for baldness, truly available self flying cars, and jet packs. At its core there are major cost benefit problems. Robots are COMPLICATED. Never mind if you can actually build a robot capable of replacing human labor, a LOT of labor and components goes into making it, and a TON of cost goes into supporting it.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/levpzxq/",
              "created": 1721919759,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "letzscp",
          "score": 5,
          "body": "I'm finding it difficult to believe he'll be first to market when they are still working on the robotaxi while gm and Google already have theirs on the road. They keep missing deliveries and acting like no one else is doing what they're doing.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letzscp/",
          "created": 1721888703,
          "depth": 1,
          "replies": []
        },
        {
          "id": "letpkf5",
          "score": 11,
          "body": "Correct me if I'm wrong but doesnt Toyota and Honda already use humanoid roboters in their production line.\n\nNo Idea what the big difference is, but there is already market for that.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letpkf5/",
          "created": 1721882851,
          "depth": 1,
          "replies": [
            {
              "id": "lets5zx",
              "score": 16,
              "body": "Everyone uses a form of robotics. \n\nTesla wants to create a robot that they claim can basically act as a human, do your chores, etc., \n\nCrazy aspirations but I would 100% buy one if it comes to fruition.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lets5zx/",
              "created": 1721884235,
              "depth": 2,
              "replies": [
                {
                  "id": "leu2htp",
                  "score": 1,
                  "body": "Nahh i just wanna play basketball woth my homie CUE\n\nToyota literally developed a basketball playing robot. \nNo idea how that does help anyone but it is cool asf and probably made some general improvments along the way",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leu2htp/",
                  "created": 1721890414,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "letr71z",
              "score": 7,
              "body": "General purpose robots ~ not car specific",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letr71z/",
              "created": 1721883714,
              "depth": 2,
              "replies": [
                {
                  "id": "leu2642",
                  "score": 0,
                  "body": "There arent car specific.\n\nCUE plays basketball like a true gentleman.\nPunyo goes shopping.\n\nLike I already explained in another comment. These robots just look like iRobot or something in that ballpark for me.\n\nNo idea what the difference between a shopping, basketballer and working robot is.\n\nAt least they look cool and maybe in the future we will be hanging out with roboters...",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leu2642/",
                  "created": 1721890207,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "letppmp",
              "score": -8,
              "body": "Why even comment rather than post the proof?\n\nHow lazy are people now",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letppmp/",
              "created": 1721882927,
              "depth": 2,
              "replies": [
                {
                  "id": "letqr0i",
                  "score": 6,
                  "body": "Why leave this comment rather than look for the proof yourself?\n\nHow lazy are people now",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letqr0i/",
                  "created": 1721883477,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "letqtrg",
                      "score": -8,
                      "body": "Im not asking for proof or the facts",
                      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letqtrg/",
                      "created": 1721883517,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "leu1urp",
                  "score": 0,
                  "body": "They have robots but no idea what the difference is.\n\nToyota and Honda use humanoid roboter since over a decade. \n\nBut I think for truly understanding the difference you need to see all of them and have some sort of idea of robotic.\nFor me they are just cool robots which \"amplify and empower\" the laborers work.\nThe ones from toyota literally look like iRobot for me, but probably are completely different than roboters from movies",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leu1urp/",
                  "created": 1721890004,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "levnfqa",
          "score": 2,
          "body": "Doesn’t come close to justifying the valuation but one thing that people around here seem to miss is they have an energy business that growing at a 2x rate while being hamstrung by supply constraints. Again that doesn’t come close to justifying the valuation but the idea that Tesla isn’t just a car company isn’t just bullshit bulls say, it’s fact. \n\nYou can tell by how emotional people are about the stock that the Reddit communities dislike of the stock has way more to do with there dislike of Elon than the company. Though again, the valuation doesn’t make sense and never has.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/levnfqa/",
          "created": 1721918945,
          "depth": 1,
          "replies": [
            {
              "id": "levplfe",
              "score": 1,
              "body": "And why do people think that Tesla will somehow be immune to the margins of the energy industry?",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/levplfe/",
              "created": 1721919629,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "letorvl",
      "score": 58,
      "body": "The short version has people have been making that argument for years and losing lots of money trying to short that thing. Yes I agree with that argument, so do a lot of people, still won't touch the stock, there are still too many Tesla Bros that have various funds convinced that it's some type of tech company. Will it finally drive down to $60 or so where it belongs? Maybe but I'm not shorting it, not longing it, that is one company I avoid at all costs",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letorvl/",
      "created": 1721882443,
      "depth": 0,
      "replies": [
        {
          "id": "leu4tad",
          "score": 10,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leu4tad/",
          "created": 1721891912,
          "depth": 1,
          "replies": [
            {
              "id": "lev6384",
              "score": 2,
              "body": "Thanks, Marla Daniels.\n\n\nIf this is not a wire reference I will be disappointed.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lev6384/",
              "created": 1721912861,
              "depth": 2,
              "replies": [
                {
                  "id": "lexq2t3",
                  "score": 1,
                  "body": "\"Wargames\"",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lexq2t3/",
                  "created": 1721942572,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "letymw0",
          "score": 9,
          "body": "How do you stay away from it when basically every index has it in their top 10 holdings?",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letymw0/",
          "created": 1721887989,
          "depth": 1,
          "replies": [
            {
              "id": "letyyza",
              "score": 8,
              "body": "The only index I have in sizes the s&p 600. Loaded to the brim with small caps. If I was going to do anything with large caps which there's an argument for to be fair, I would be in equal weight. \n\nEven if you're just using spy . Tesla is less than 2% of the s&p 500.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letyyza/",
              "created": 1721888196,
              "depth": 2,
              "replies": [
                {
                  "id": "leu0ao6",
                  "score": 3,
                  "body": "That makes sense. I am just getting started investing, and everything I have been reading has been \"ETFs for beginners\"... but the idea of trusting any of my money with Elon kind of makes my skin crawl.  If there was an SPY - TSLA, I would be all onboard for that. Right now, I have settled on IJR + Mag 6  + 12 large/mid caps that I know a lot about their business model and love the companies products and use them professionally daily. I just question if I get wrecked for not being diversified enough, as I'm not willing to expose myself to any fund holding TSLA.",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leu0ao6/",
                  "created": 1721889019,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "leusq63",
              "score": 1,
              "body": "Only funds you looking at lol",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leusq63/",
              "created": 1721907021,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "letr51x",
          "score": 6,
          "body": "I'm with you there. Long or short, this thing is too volatile I ain't going near it. Hence this post, so that I can try to get an idea of what is actually happening with this stock.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letr51x/",
          "created": 1721883684,
          "depth": 1,
          "replies": [
            {
              "id": "leus2sf",
              "score": -4,
              "body": "If you have no plans to invest or short the stock focus your research somewhere else and stop wasting your time.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leus2sf/",
              "created": 1721906693,
              "depth": 2,
              "replies": [
                {
                  "id": "leuso2q",
                  "score": 5,
                  "body": "We all have our hobbies and pastimes. Learning about the stock market is one of mine. But thanks for your advice!",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuso2q/",
                  "created": 1721906992,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "levay1q",
                      "score": 2,
                      "body": "How dare you be interested in something for the sake of knowledge and enjoyment not just for pure profit!   /s\n\nWe are so screwed as a species.",
                      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/levay1q/",
                      "created": 1721914688,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lev6026",
          "score": 1,
          "body": "“The market can remain irrational longer than you can stay solvent.”  ",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lev6026/",
          "created": 1721912827,
          "depth": 1,
          "replies": []
        },
        {
          "id": "leuelym",
          "score": -3,
          "body": "Tesla bros of today saying its not just a car company are just like amazon bros of the past saying it was not just a online book store.\n\nTesla should have the same PE of Ford, just like Amazon should of had the same PE of Barnes & Noble back then.\n\nThe argument never changes for those that can't understand new tech just the topic.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuelym/",
          "created": 1721898547,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "letud0f",
      "score": 21,
      "body": "My take… TSLA should just be MUSK… people are investing in Elon and not in Tesla.  That’s probably the bottom line.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letud0f/",
      "created": 1721885462,
      "depth": 0,
      "replies": [
        {
          "id": "leultvk",
          "score": 1,
          "body": "It's Pheromones; it has to be",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leultvk/",
          "created": 1721903250,
          "depth": 1,
          "replies": []
        },
        {
          "id": "leu50ur",
          "score": -3,
          "body": "It’s the cult of Elon.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leu50ur/",
          "created": 1721892052,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lettz80",
      "score": 44,
      "body": "1. Fundamentals aren't weak. They are the only profitable EV automaker in the world with a $30b cash stack and little to no debt. Other automakers lose billions selling a few thousand EV's. Ford just reported results and loses $44k per EV sold - the same amount they sell EV's for. For this entire year, Ford is expected to lose $5.5b selling EV's. \n2. P/E ratio is such a horrible metric to use. Companies grow in stages. P/E ratio only works when you're comparing mature companies in similar industries. It's a metric highly valuable in 1990's but largely phased out as soon as tech companies burst into the scene. Tech companies take time for R&D to pay off. Often times, losing money for many years (increases P/E ratio) for a payoff in the future. Think companies like Amazon.\n3. EV sales are a downward trend in high inflation, high rates, and declining incomes. It's common sense. If you're struggling due to a higher cost-of-living, you're not going to take a chance buying an EV (new technology) and will buy what you know because it's consistent. When these factors reverse, EV's will benefit more than ICE sales.\n4. You forgot to mention energy storage, supercharging network, self-driving tech, and robotics. Self-driving tech/robotics, you either believe it will happen or not. These are very difficult products/services because they are revolutionary. So it will take time, R&D, and insane amounts of effort to perfect it. There are lots of YouTube videos for you to make a decision on whether self-driving will happen. I'm betting that it will. Robotics is tricky because Tesla wants to make it a humanoid robot with human actions. I'm not as high as they are on it and think it's better suited as a commercial robot that can replace tedious work in a factory or work environment.\n5. The only thing that affects a stock price is what people are willing to pay for it. The low P/E ratio with other automakers has to do with the fact that no one wants to buy those companies. Low growth, highly leveraged debt, and an inability to innovate. Ford's stock price today is the same price it was in 1996. Imagine holding for nearly 30 years and you've made nothing except paltry dividends.\n6. The Elon factor is huge. And why wouldn't it be? People hate on him because of his politics but one thing you can't question is his vision and innovative mindset. EV's don't exist without Elon. FACT. What other auto companies are trying to accomplish by having a profitable EV, Elon led Tesla to accomplishing it without having any experience previously working with vehicles. He wanted to buy a rocket from Russia to launch his own space rocket. Russia laughed at him because of his lowball offer. What did he do? Started SpaceX. Last year, they launched the largest space rocket into space in human history. And btw, it's a REUSABLE rocket. People all across the world can now access the internet using Starlink, a product that uses satellites launched into space via SpaceX rockets. It went from doing $1.4 billion in revenue in 2022 to expected revenue of $6.5-7 billion this year. They're securing contracts from cruise and airline companies because it's the best option by far. My point is, whilst I disagree with Elon being as politically involved as he is, the market loves a visionary and innovative individual and no one can deny that he isn't. It's the same reason why Steve Jobs is a notorious dick but you couldn't question his vision for Apple.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lettz80/",
      "created": 1721885241,
      "depth": 0,
      "replies": [
        {
          "id": "leyll3z",
          "score": 5,
          "body": "This should be the top answer, in my opinion. Ignored by most folks because there's not much you can do but agree, unless you're just contrarian or incredibly pessimistic about anything Elon. Odds favor the Elon optimists.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leyll3z/",
          "created": 1721954161,
          "depth": 1,
          "replies": [
            {
              "id": "lf08ja1",
              "score": 1,
              "body": "There’s. Quote. From Buffett about in a battle between bad industry (autos) and great mgmt, only the mgmt lose their reputation.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lf08ja1/",
              "created": 1721984310,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "leugxmn",
          "score": -3,
          "body": "1 their fundamentals are weak for a company with 60 P/E ratio. They maybe better the legacy auto but that bar is pretty low. \n\n2 they stop growing and anticipate flat sales in the foreseeable future. \n\n3 stop using interest rate as excuse. Tesla offer ultra low interest loan this quarter yet the sales are still down. And also average income of US rise 0.8 % while Tesla average selling price decrease yoy, which means it more affordable\n.\n4 all of them are pipe dreams just like “FSD in two weeks” from 7 years ago.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leugxmn/",
          "created": 1721900117,
          "depth": 1,
          "replies": [
            {
              "id": "leujiv5",
              "score": 11,
              "body": "Your comments are only valid if your focus is extremely short term. Most institutional and large private investors have a much longer investment time horizon.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leujiv5/",
              "created": 1721901811,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lew7lel",
              "score": 1,
              "body": "They offered low interest (0.99 and 1.99%) on the model Y, not really the other cars. Why the model y? Because the refresh is most likely going to be released early 2025.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lew7lel/",
              "created": 1721925327,
              "depth": 2,
              "replies": []
            },
            {
              "id": "leurpg5",
              "score": -4,
              "body": "They’ve also alienated their core market and are backing a presidential candidate that has pledged to repeal the tax cuts that were responsible for the majority of Tesla’s profit last quarter. I guess that’s what having a schizoposter CEO will do to you.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leurpg5/",
              "created": 1721906506,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "letrste",
      "score": 11,
      "body": "Haha is an unbiased answer about Tesla stock even possible at this point XD",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letrste/",
      "created": 1721884039,
      "depth": 0,
      "replies": [
        {
          "id": "lets3w0",
          "score": 7,
          "body": "I decided to try my luck with this community... But hey there are actually a good number of unbiased and logical points being made in the comments and I am grateful for them",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lets3w0/",
          "created": 1721884205,
          "depth": 1,
          "replies": []
        },
        {
          "id": "letxcnu",
          "score": 7,
          "body": "The unbiased answer is that TSLA investors are all biased",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letxcnu/",
          "created": 1721887212,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf3fssn",
          "score": 2,
          "body": "Sure there is. It is a complicated company, and it is risky to own it. The risk might pay off big. I will say, and this might be biased, I think they are in for a very rough couple of quarters, and the price to drop to levels we have not seen in a while.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lf3fssn/",
          "created": 1722028088,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "letq4uo",
      "score": 12,
      "body": "It never pops like some grand finale. It deflates, then runs up, then deflates, then runs back up, albeit lower, people lose confidence, they sell off. The air gets let out and people forget it altogether, perhaps it takes years for this process. The market is a weighing machine in the long term.\n\nThat's how bubbles burst. Its a slow death, that's why its so dangerous. Because it slowly boils the frog (the bag holder)",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letq4uo/",
      "created": 1721883154,
      "depth": 0,
      "replies": [
        {
          "id": "letrk42",
          "score": 3,
          "body": "Yeah that's true, I take back my opinion about a bubble popping. I'm also assuming that the price is artificially supported by larger institutions, since the US stock market as a whole cannot afford to deal with a stock the size of Tesla suddenly popping. The weight it has in the index funds are non-negligible.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letrk42/",
          "created": 1721883908,
          "depth": 1,
          "replies": []
        },
        {
          "id": "leuwjgh",
          "score": 1,
          "body": "Respectfully, what the heck are you talking about. Bubbles burst relatively quickly, just look at the charts for the tech bubble, 08, 87 flash crash, covid. These didn’t take years for the market to adjust, you would have seen a healthy decrease in your market value (over 30%) in less than a year",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuwjgh/",
          "created": 1721908824,
          "depth": 1,
          "replies": [
            {
              "id": "lev1j2r",
              "score": 1,
              "body": "The bubble burst in March 2000, after the tech-heavy Nasdaq composite peaked on March 10, 2000. The Nasdaq fell by 75% from March 2000 to October 2002, wiping out more than $5 trillion in market value.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lev1j2r/",
              "created": 1721911026,
              "depth": 2,
              "replies": [
                {
                  "id": "lev34ug",
                  "score": 1,
                  "body": "I guess it really depends on the index we focus on. S&P isn’t really as bad, but I would argue looking for market bottoms spreads out the time frame but in a year’s time the Nasdaq fell by 60% from March 10 2000 to March 16 2001. So yeah, took another year and a half to reach the full bottom but most of the losses were sustained much earlier than that.",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lev34ug/",
                  "created": 1721911691,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lev3w3w",
                      "score": 2,
                      "body": "Well a bubble can occur in any asset class, outside of indexes . It behaves similarly. $GME for example, never achieved same high, slow deflating death, then a run up, and well? what happens after that run up, downward it goes. Same with $AMC\n\nThings can only stay afloat for so long. At some point the market will get it right when it comes to intrinsic pricing.",
                      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lev3w3w/",
                      "created": 1721911997,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lev2wy3",
              "score": -1,
              "body": "We might be seeing the same for $TSLA bubble bursting now. Each dagger to the balloon from each earnings report this year. TSLA peaked in 2021, it’s now 2024, never achieving the same high, hitting lows.\n\nBTC in the same boat? Peaked 2021, it’s now 2024, no where near the same high.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lev2wy3/",
              "created": 1721911602,
              "depth": 2,
              "replies": [
                {
                  "id": "lev8iq8",
                  "score": 2,
                  "body": "Bitcoins all time high was this year…but yes lets just make stuff up.",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lev8iq8/",
                  "created": 1721913789,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "levbb68",
                      "score": 1,
                      "body": "Oo you’re right, my mistake. For some reason I thought it peaked at $100k",
                      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/levbb68/",
                      "created": 1721914821,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "letwwaf",
      "score": 5,
      "body": "Never bet against religion. If you want to justify your puts them by all means do it then post your result on other sub",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letwwaf/",
      "created": 1721886939,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leu0t1c",
      "score": 8,
      "body": "I don't directly own Tesla stock as I only buy ETFs but I do drive a M3. I have never experienced a car like that ever, in ANY EV, and it's the tech that makes the difference. I've driven Mercedes, BMW, Rivian, etc. and they don't come close. I truly belelive their software team has the potential to make Tesla cars the equivalent of what the iPhone was to the cellphone industry. People harp on build quality and stuff that only car nerds may truly care about. The normies like me only care about the full experience, and typically ignore tiny details like slight panel gaps. Their cars are incredibly reliable, safe and provide that \"magic\" experience. Within 5 minutes of doing my first test drive, I was hooked.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leu0t1c/",
      "created": 1721889339,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lettlg2",
      "score": 12,
      "body": "It’s not priced as a car company \n\nIt’s priced as a tech company",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lettlg2/",
      "created": 1721885025,
      "depth": 0,
      "replies": [
        {
          "id": "leu10id",
          "score": 0,
          "body": "To the point!!((\n\nBut then, is Tesla a car or tech company?",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leu10id/",
          "created": 1721889470,
          "depth": 1,
          "replies": [
            {
              "id": "lev1l87",
              "score": 1,
              "body": "The overwhelming majority of their revenue is from making cars. Definitely a car company.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lev1l87/",
              "created": 1721911051,
              "depth": 2,
              "replies": [
                {
                  "id": "lewtieo",
                  "score": 1,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lewtieo/",
                  "created": 1721932208,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lewvjjx",
                      "score": 1,
                      "body": "They are not the only company that makes software for their cars. The overwhelming majority of their revenue is from selling cars, so it's still a car company.",
                      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lewvjjx/",
                      "created": 1721932860,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "letwzou",
      "score": 6,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letwzou/",
      "created": 1721886996,
      "depth": 0,
      "replies": [
        {
          "id": "leujgmz",
          "score": 1,
          "body": ">So it boils down to 'Will Tesla nail FSD?' AND  'Can they beat everyone else to it?'.\n\nTo a degree it also depends on how well they leverage their position in the energy storage market for future growth. Not just in terms of building home and grid storage installations and but also as a VPP provider. If you can make a tiny fraction off of every kWh that you supply to the grid simply because it's running on your software that adds up quickly.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leujgmz/",
          "created": 1721901770,
          "depth": 1,
          "replies": []
        },
        {
          "id": "leu8cj3",
          "score": -3,
          "body": "> If you believe Tesla can achieve FSD and Robotaxis AND they will be the first, then the stock is way undervalued. It will be trillions of dollar business. \n\nThey aren't first, and the entire global taxi market is like $250B.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leu8cj3/",
          "created": 1721894277,
          "depth": 1,
          "replies": [
            {
              "id": "leuj61l",
              "score": 3,
              "body": "Robotaxi (assuming they can get it to work) will not be the same as the taxi market. This has the potential to replace individual ownership of cars for a *lot* of people.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuj61l/",
              "created": 1721901583,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "leuvqd2",
      "score": 2,
      "body": "It's a speculative bubble. Tesla either hits on fsd or the stock will come down significantly.  I wouldn't pay the inflated tech valuation until we see some results, earnings growth from fsd.\n\nI remember when Nvidia was priced with a 60 forward pe in 2019. That was a high valuation but their data center business (now referred to as AI) revenue and earnings was growing at a rapid pace.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuvqd2/",
      "created": 1721908456,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lev04nx",
      "score": 2,
      "body": "I was the ultimate Tesla bull 2019-2021, then sold all of my stock and now I have a small short position. Tesla is not about selling the product, it's about selling the shares now. And Musk has gotten incredibly good at storytelling a vision that people want to believe in, then showing a demo and promising (for 8 years with FSD) that the demo is one step away from the real thing. This was multiplied by 100x when they were the first ones to really make a proper mass-market BEV. The story then became how all the other legacy auto can't make EVs profitable, when in fact they just prefer selling as few of them as possible and selling ICE and PHEVs instead. The story about how hard it is to mass-manufacture BEVs has finally been popped by all the Chinese companies that essentially ate Tesla's lunch and are out-competing it in a price war.\n\nSo people have took that to mean that, because Elon's company was able to make happen something which looks hard (mass-manufacture cool BEVs) they'll be able to accomplish anything. Including things that are truly hard (maybe impossible?) and where there's true competition - autonomous driving. We are at the point where Musk needs to either deliver on some outlandish project or see the vision he propped up be taken down.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lev04nx/",
      "created": 1721910422,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leu407x",
      "score": 1,
      "body": "Elon musk…as much as i dislike him and tesla’s fundamentals, i still wouldnt short the stock though. It could even bounce back 10-15% green when the market opens today",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leu407x/",
      "created": 1721891391,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leuqnec",
      "score": 1,
      "body": "I can start talking about all the false promises. But for now, I think it was the overall momentum and sentiment that was the major moving force. Yes, sure, Elon was depending on his success stories of Space x and such, but he seems eager to destroy his credibility now.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuqnec/",
      "created": 1721905965,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leuuv8g",
      "score": 1,
      "body": "Tesla and E. Musk are both overvalued as f***. Tesla is losing ground to other EV manufacturers and their side hustles fail to achieve breakthroughs into marketability.\nMeanwhile Musk becomes a toxic asset the more he becomes politically engaged. So, long story short, Tesla will probably drop a whole lot over the next few years, I suppose. They will turn into a 'normal' car manufacturer which implies a drop in market value of, let's say, 450 billion $$$ to 170 billion. And that'd still be more than double of Volkswagen who continuesly make more profits.\n\nMy two cents...",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuuv8g/",
      "created": 1721908050,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leuv1lr",
      "score": 1,
      "body": "Part of it is the \"cult company\" bump that certain stocks get just by their fan club.  \n\nI wont say it's overbought, exactly, but there are only so many shares to go around, and it seems everyone wants to be part of a \"new\" technology/trend, even at the expense of running up the P/E ratio.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuv1lr/",
      "created": 1721908133,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leuvwb9",
      "score": 1,
      "body": "Gung Ho investors are betting on some huge AI play, like maybe real robot taxis, is just around the corner.\n\nNot sure why it suddenly rose way too high recently.....that was all smoke and mirrors.  AI stuff is at least a year away",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuvwb9/",
      "created": 1721908530,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leuy9f0",
      "score": 1,
      "body": "Low cost EV, Robo taxi, DoJo, Mega Pack, energy arbitrage, Optimus, integration of products with Starlink, integration of product with neural Link. Markets look ahead and adjust for likely outcomes.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuy9f0/",
      "created": 1721909603,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leuz0kb",
      "score": 1,
      "body": "Robo taxis and autonomous driving. If it happens Tesla is a multi trillion company for getting there first in the US and either first or second in the world. \n\nThe question is how long to wait for it and what is the percentage of it likely happening. Perma bulls like Cathy give it close to 100 percent. Value investors close to zero. I’m somewhere in between.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuz0kb/",
      "created": 1721909937,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lev7q5t",
      "score": 1,
      "body": "Promises and hopes keep the valuation high. Cash flows and lack of growth keep the stock range bound.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lev7q5t/",
      "created": 1721913491,
      "depth": 0,
      "replies": []
    },
    {
      "id": "levcs9c",
      "score": 1,
      "body": "They are a cyclical business with trough margins. When margins are high, p/e should be lower, when margins are low p/e should be high. Evaluate a company from mid-cycle margin expectations",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/levcs9c/",
      "created": 1721915348,
      "depth": 0,
      "replies": []
    },
    {
      "id": "levi8cp",
      "score": 1,
      "body": "They were into big data, then crypto, now AI.  They are fueled by whatever the speculative boom is at the time.\n\n\nThe reason its rewarded is growth outperforms value when money is cheap, and when interest rates are low.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/levi8cp/",
      "created": 1721917230,
      "depth": 0,
      "replies": []
    },
    {
      "id": "levs5s3",
      "score": 1,
      "body": "Is this a joke, How specifically are the fundamentals weak? You’re clearly biased on being a tsla bear so how bout we cut to the chase and you sell me some calls and we’ll see who is right in the long run eh",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/levs5s3/",
      "created": 1721920447,
      "depth": 0,
      "replies": []
    },
    {
      "id": "levtr85",
      "score": 1,
      "body": "They are, or are becoming, a pretty big player in solar electrification both at the residential level but also at the utility-scale level. I’ve never bothered to see what proportion of TSLA is credited to this area, but I’d otherwise be interested in bottom-fishing for TSLA due to this (if Musk weren’t such a bellend).",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/levtr85/",
      "created": 1721920956,
      "depth": 0,
      "replies": []
    },
    {
      "id": "levzbat",
      "score": 1,
      "body": "Probably, expecting some crossover with spaceX.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/levzbat/",
      "created": 1721922710,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lewgtxj",
      "score": 1,
      "body": "Elon spent years on twitter hyping the company",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lewgtxj/",
      "created": 1721928217,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lewhis2",
      "score": 1,
      "body": "Musk is a CEO who actually has goals beyond maximizing profits, which is rare.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lewhis2/",
      "created": 1721928430,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leww0m0",
      "score": 1,
      "body": "It’s propped up by all the reporting agencies and fund managers. They make a killing off the high volume. It’s in their best interest to not kill off their cash cow",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leww0m0/",
      "created": 1721933011,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lex01uk",
      "score": 1,
      "body": "1. Expectation that Tesla actually delivers on its promises and continues growing long term. In theory, a company at 60 P/E can still be a good investment if they maintain double digit earnings growth every year for over a decade or achieve triple digit earnings growth for a couple years. I don't expect this but that's the bull thesis.\n\n2. Using a very low discount rate/expected rate of return for establishing their valuation. If your expected rate of return is 5%, then a 1.66% earnings yield(60 P/E) + 5% earnings growth could justify the price.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lex01uk/",
      "created": 1721934303,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lex7pbs",
      "score": 1,
      "body": "Nothing really, the promise of autonomous driving and now autonomous androids is what drives the price so high.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lex7pbs/",
      "created": 1721936706,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lex8b7z",
      "score": 1,
      "body": "nothing. copium and promises. and expectations. and people still thinking EM is a \"genius\"",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lex8b7z/",
      "created": 1721936894,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lexebri",
      "score": 1,
      "body": "I think it's because Tesla is still, basically, a start up. And I say that because I have to wonder: is there any company in any industry currently building for the future as much as Tesla? If there is, please let me know. I don't think so. Best of all, I think Tesla is trying to build a future that we all want: cleaner and smarter. Peeps decried AMZN's and GOOG's outrageous PEs in their early days.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lexebri/",
      "created": 1721938775,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lexg8wh",
      "score": 1,
      "body": "Nothing except wishful-thinking mass hysteria.\n\nTulips!",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lexg8wh/",
      "created": 1721939377,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lexu0mp",
      "score": 1,
      "body": "It’s a simple meme stock that doesn’t trade on any fundamentals. Big money loves to short it and then go to war against each other to pump it up.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lexu0mp/",
      "created": 1721943922,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ley6lrq",
      "score": 1,
      "body": "Nothing",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/ley6lrq/",
      "created": 1721948444,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leykmw1",
      "score": 1,
      "body": "I have to disagree. Their competition hasn't really benefited greatly from EV sales. Many would prefer not making them. Their service industry is lost revenue when combustion engines are not sold. Tesla makes almost everything in the cars where competitors have thousands of suppliers needed to supply their plants and retooling is extremely slow. But I do wish Tesla was not so volatile. The constant price fluctuations is never ending while Musk is screwing around with Twitter/X.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leykmw1/",
      "created": 1721953788,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leymo44",
      "score": 1,
      "body": "Tesla has projects that can be a big hit, like Robot AI Taxi Energy\n\n\nAnd because Tesla/Elon has a track record of achieving projects they say they’ll do at least seem to be competent , or appears to be to certain investors.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leymo44/",
      "created": 1721954585,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lez44r8",
      "score": 1,
      "body": "The E in P/E is Elon. He is the X factor.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lez44r8/",
      "created": 1721961695,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf3exzf",
      "score": 1,
      "body": "Being valued as a tech company for its AI, which is kind of amazing. However...\n\nFSD is late. They weren't really forthcoming about this in the earnings call. Or if they were, the bad microphones made it impossible to hear. They have to roll it out, and it will have to roll for a while before they get significant revenue, unless they roll it out in a risky way that is way too fast, which they might try.\n\nOptimus is exciting. It will be a little while before that is a significant amount of revenue.\n\nThe energy storage business is growing fast and high margin compared to the cars. It will be a few more years before this is going to be enough to sustain the company.\n\nShort term, they might be in trouble. 2% revenue growth overall, which means the auto part shrank.\n\nElon just gave very public, full throated support for DT. Assuming that most people who buy EVs also vote blue, and those who vote red don't buy EVs (because EVs are woke?), sales in the US could crater this quarter, and it could affect the perception of the FSD rollout as well, as that is supposed to happen right before the election. \n\nIf you are high on Tesla's prospects two or three years out, keep some powder dry. I am pretty sure if they have a bad quarter or two, it will drive the price way down in the short term. And give you time to evaluate the company to see if they are actually going to be able to execute these things profitably.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lf3exzf/",
      "created": 1722027794,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf9458f",
      "score": 1,
      "body": "Because price is just a number on stocks. Valuation and earnings and such don't really matter. Especially big tech. Apple sales went down for years then they got better yoy recently and the stock screamed higher",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lf9458f/",
      "created": 1722118933,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lo7r2jy",
      "score": 1,
      "body": "Tesla is a very different company today than it was 10 years ago and the tech climate as well as the cultural and political place EVs have is very different today. When Tesla was the only EV player in the market with a good looking reliable and reasonably practical BEV, they were not killing the retail market with 1% of sales. \n\n1) Today, there are many alternatives which are much more desirable to a majority of potential EV buyers. \n\n2) Elon is still a god to many, but highly unpopular to a growing percentage of the population for many diverse reasons, which seems to be negatively impacting sales to certain demographics. \n\n3) The Tesla in the neighbor's driveway incites a more mundane response, and more negative in certain cases. \n\n4) Culturally, the EV is yesterday's news and does not fulfill the newest big thing position for upper middle class buyers. \n\n5) Innovation of Tesla cars has stagnated and provides much less reason to replace or trade up to a new Tesla. \n\n6) The EV market is becoming saturated with supply greater than demand.\n\n7) Where most all other major car manufacturers can back off EV and increase ICE production to balance demand, Tesla does not have this option. \n\n8) Although Tesla is labeled by some as a technology company and not a car company, I think they are confused that many of Elon's other projects and interests financially are entirely separate and independent from Tesla. \n\n9) The variables of a Republican administration and China potentially can massively impact\nTesla financially.\n\nIn conclusion, I recently drove the new Tesla Model 3 dual motor Performance and was quite impressed with the fit, finish, handling, road feel, and comfort in the new highly supportive seats m, especially compared to the 5 year old model 3 which I previously drove and which was traded in for this new model 3 - BUT - I highly prefer my new Audi S4 in every aspect and will not buy Tesla stock at a PE ratio around 60.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lo7r2jy/",
      "created": 1726930132,
      "depth": 0,
      "replies": []
    },
    {
      "id": "letowxf",
      "score": 1,
      "body": "If PE for a company is too high it’s typically because the company is expected to grow. In the case of Tesla, that would be future revenue in new vehicle models, robots, energy, and hopefully robotaxi.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letowxf/",
      "created": 1721882516,
      "depth": 0,
      "replies": [
        {
          "id": "letrynp",
          "score": -2,
          "body": "They are like a decade behind other automated car companies so it is not likely to be an industry leader unless their automated driving tech they pushed back the show case for is amazing and ready.....and better than other companies models they haven't released.\n\nI would look to Google as the industry leader in automated driving. Their subsidiary \"waymo\" has the most automated miles on the road ad google has the best infrastructure. Even if Tesla ends up being the industry standard, Google will still end up making a ton of money because whatever company/companies are dominant will be using Google maps.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letrynp/",
          "created": 1721884126,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leupc3u",
      "score": 1,
      "body": "It’s a meme stock. Fueled by hype over the cult of Elmo.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leupc3u/",
      "created": 1721905268,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leu13y2",
      "score": 1,
      "body": "Nothing. The more Tesla fails to deliver, the more aggressive and absurd future projections become. Tesla is just overextending itself by trying to lead in robotics, AI chips, EVs, batteries, and AI. It's not going to happen. In addition, Musk's behavior is becoming more bizarre day by day, thereby hurting the company's sales.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leu13y2/",
      "created": 1721889530,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leu37j7",
      "score": 1,
      "body": "Someone else said it. It's priced as a high growth tech company. Which is understandable. I recently sold like 95% of my shares during the recent surge because of some of the things you mentioned. But I still follow the company carefully. Some things of note:\n\n- their energy division is growing, I don't recall the details but it's something that stood out in the recent earnings\n\n- cybertruck outsold the f1 lightning in q2\n\n- they have a big announcement for robotaxi vehicle before the end of the year. I speculate that they'll start that program in China first.\n\n- The model Y and 3 are still very popular cars. The model Y is my personal favorite.\n\n- People are mentioning the robot thing but that's too speculative. It's not a considering for evaluating the current value of the company.\n\n- They are selling more cars compared to last quarter (if I recall) but making less money on them. And as you mentioned overall in decline.\n\nI would buy in again but can wait until it really drops.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leu37j7/",
      "created": 1721890875,
      "depth": 0,
      "replies": [
        {
          "id": "leu8t0o",
          "score": 1,
          "body": "> cybertruck outsold the f1 lightning in q2\n\nI may be wrong but this seems to be 0.9% of Tesla's revenue. Regardless of the exact number, I don't think the segment that the Cybertruck is in carries even a small fraction of the current stock price.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leu8t0o/",
          "created": 1721894587,
          "depth": 1,
          "replies": [
            {
              "id": "lew0csw",
              "score": 1,
              "body": "Agree that’s it’s a small part of their revenue now, but they will be ramping up production",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lew0csw/",
              "created": 1721923034,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lewg3ch",
          "score": 1,
          "body": "> People are mentioning the robot thing\n\nTo be fair, not just people but Elon really harps on this.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lewg3ch/",
          "created": 1721927989,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leue1bi",
      "score": 1,
      "body": "Tesla is a company with a plan that extends (far) beyond the timeline set by other companies. Buying Tesla shares is  a bet on that plan.\n\nOther companies are just chasing quarterly results - and by necessity are sacrificing long term goals to achieve short term micro-successes. Tesla investors think that this is not a good approach. If you think this is a good approach (i.e. if you're in the stock market to make a 'quick buck') then Tesla is not for you.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leue1bi/",
      "created": 1721898156,
      "depth": 0,
      "replies": [
        {
          "id": "leuxxac",
          "score": 2,
          "body": ">Other companies are just chasing quarterly results - and by necessity are sacrificing long term goals to achieve short term micro-successes.\n\nI mean they do the same things to boost quarterly earnings... End of quarter rushes/incentives, strategically realizing regulatory credits or FSD revenue, etc.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuxxac/",
          "created": 1721909455,
          "depth": 1,
          "replies": [
            {
              "id": "levd1yj",
              "score": 0,
              "body": "True...but Tesla is not *just* chasing quarterly results - and investors know this. Investing in Tesla is investing in the long game (and like any investment there is no guarantee that that will succeed. That's just open to the individual's assessment of the situation)",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/levd1yj/",
              "created": 1721915445,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "leuolft",
      "score": 1,
      "body": "Elon is a force of nature",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuolft/",
      "created": 1721904859,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leuvz2u",
      "score": 1,
      "body": "Your problem stems fundamentally from your short-sightedness, but i don't blame you for it because that's the way 99% of people here and in general view the market. Tesla has a mission that exceeds the number of EVS it sells per quarter, its mission is to create the premises and the fundamentals behind a more sustainable world energetically speaking. Some people deeply understand that a quarter or a few quarters or even a few years of stale or negative growth are nothing in the grand scheme of things, and other don't seem to understand it because they either do not care about tesla's true mission enough or don't know. If you wanna invest somewhere else because it costs you more to block liquidity in tesla for years to come because you think it is not gonna move or it's gonna go even lower, be my guest. A future without EVS is impossible, and we must and this is a physical reality produce as much EVS as possible for a number of years before we can replace the current ICE car market.  We also need  the physical infrastructure to be able to feed energy to these EVS and to produce them such as they're affordable to the majority of people ideally. Tesla is building all this ecosystem around it as much as they are building EVS and they're trying to come with designs and solutions to all these problems at once, and that takes time. By time i  don't mean weeks or quarters or years, but DECADES. Tesla is definitely not just a car maker unless you're blind or don't want to understand what they're doing because you hate Elon or whatnot, and it deserves a premium for all the innovation it is bringing and will bring  to the human kind and that's why it trades at a high PE. If you think that in 20 years Tesla will be better than now, i don't understand how you can not invest at this price.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuvz2u/",
      "created": 1721908565,
      "depth": 0,
      "replies": []
    },
    {
      "id": "levfiei",
      "score": 1,
      "body": "I was a former TSLA shareholder when they actually had  growth, I fully exited months ago. Maybe that was the right decision, maybe that is wrong long term, I don't know, but I know that logically nothing justifies its current P/E ratio with declining earnings and declining auto-revenue, and its not even a small decline, it's a 43% drop in EPS. They are priced like a growth stock with neither value, nor growth, and they have consecutively missed estimates on last 4 earnings by double digits.\n\nTesla does about \\~86B in revenue and shareholders approved CEO pay-package of $56B. Which large S&P 500 company gives over half their revenue in CEO pay? One has to ask themselves, considering all this, after operating costs, factoring in this pay package, how much would really be left over for realizing Tesla's growth plans?\n\nAlso, Tesla unlike its early foray into EVs/autonomous cars is far behind in the Robotaxi space where Google (Waymo) and other players, such as Amazon (Zoox) are already making strong progress. Waymo is already operating in some cities with strong reviews:  \n[https://apps.apple.com/ca/app/waymo-one/id1343524838](https://apps.apple.com/ca/app/waymo-one/id1343524838)",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/levfiei/",
      "created": 1721916303,
      "depth": 0,
      "replies": []
    },
    {
      "id": "letysip",
      "score": 0,
      "body": "The real answer: optionality. \n\nTesla has the moat, money, and talent to pursue some of the largest market opportunities of any publicly traded company. \n\nThe car business: zero debt, vertically integrated and positioned well in a growing market. You could argue this business is worth 150 billion of MC\n\nSuper charger network: gas station of the future if you believe in sustainable energy, targeting 15% ebitda margin, conceivably another 30 billion dollar business by 2030\n\nEnergy: a clear leader in solar tech and battery storage. If you believe clean energy is the future, Tesla will disproportionately benefit. 100-200 billion in MC\n\nSoftware: FSD in its current state should continue to grow high margin revenue for Tesla as they sell more vehicles. Same playbook as Apple services. 50 billion in MC\n\nEverything above is current state, roughly 450B in MC. But investing is about the future and this is where things can get really interesting for Tesla.\n\nRobotaxi: a 1 trillion dollar business for Tesla if they pull it off. Theoretically, Tesla could “turn on” 5 million robotaxis in a single day once approved for level 5 FSD\n\nDojo: supercomputer with unmatched dataset from billions of miles of driving. Companies will line up to gain access for simulations. Conservatively, 500 billion dollar business\n\nOptimus: Teslas spacial awareness capabilities loaded onto a humanoid robot. Produced at scale, labor is no longer a limiting factor of productivity. The most significant innovation in human history. 7-8 trillion dollar business.\n\nInvesting in Tesla today predicates a belief that they will succeed in one or multiple big bets, the nearest and most significant being robotaxi, level 5 FSD. It is easy to see how Tesla could grow to 2-3T in MC if they succeed. \n\nSay what you will about Elon, it is undeniable he knows how to defy the odds in business and create multiple hundred billion dollar companies and run them simultaneously. I would not bet against him.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letysip/",
      "created": 1721888087,
      "depth": 0,
      "replies": [
        {
          "id": "lewc16z",
          "score": 0,
          "body": "> Tesla could “turn on” 5 million robotaxis in a single day once approved for level 5 FSD\n\nThis is assuming individual local governments doesn't have separate rules for autonomous driving.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lewc16z/",
          "created": 1721926710,
          "depth": 1,
          "replies": [
            {
              "id": "lewec9o",
              "score": 1,
              "body": "Which is exactly why I said “theoretically”, that word you conveniently removed.\n\nThat said, if there is empirical evidence that FSD is substantially safer than an average human driver and is thoroughly vetted by trusted authorities, local governments not allowing FSD would be irresponsible at best and blatantly endangering their constituents at worst",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lewec9o/",
              "created": 1721927436,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "letpy9t",
      "score": -2,
      "body": "It's largely copium. Note that it dropped 12% today.\n\nI'm a Tesla hater and bearish. Especially because Musk endorsing Trump will 100% effect sales since it is at odds with the companies target market and will not likely sway Trump voters to buy Teslas.\n\nWith that said, Tesla is definitely far ahead of the rest of the industry in one important way and that they are far more unscupulous about spying on their customers and sending the data, including possibly video footage from on board cameras . Teslas are constantly sending relaying data so their earnings potential is very high because of that.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letpy9t/",
      "created": 1721883055,
      "depth": 0,
      "replies": [
        {
          "id": "letsnd7",
          "score": 2,
          "body": "I’m amazed whenever someone who sells a product, and therefore depends on maximizing goodwill with the largest possible number of people, pledges themselves publicly to a political ideology. It immediately harms their relationship with half the population. Musk somehow forgot that he was in the electric vehicle market and started bankrolling the idiot that promises to ban electric vehicles.\n\nThe Pillow Guy joined Qanon/maga and lost everything. Why? Musk bought twitter just to harass people whose politics annoy him, and the site is now a laughable shadow bot realm of its former relevance, and lost its advertisers. Why?\n\nI guess even billionaires can be utterly stupid. \n\nIt’s like the bar owners who put out a sign, “No liberals/conservatives allowed!” Why? You’re canceling half your customers!\n\nThe most political any smart person in business would be is, “yay humans!” and leave it at that",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letsnd7/",
          "created": 1721884497,
          "depth": 1,
          "replies": [
            {
              "id": "letx3ox",
              "score": 3,
              "body": "I don't buy products from CEOs based on personal beliefs. I buy a product that best suits my needs and that has qualities better than the next. I'm not going to buy a Ford if a Tesla is the better choice. People get too caught up in political drama.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letx3ox/",
              "created": 1721887062,
              "depth": 2,
              "replies": [
                {
                  "id": "letzr5w",
                  "score": 3,
                  "body": "People don't understand most investors outside of Reddit don't give 2 fucks about what Musk says on X. Investors care only about the company, how it's doing, and how they think it will do in the future.",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letzr5w/",
                  "created": 1721888683,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "letunbc",
              "score": -1,
              "body": "Dude clearly drank his own coolaid and joined his own cult of personality.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letunbc/",
              "created": 1721885627,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lett3ir",
      "score": 0,
      "body": "It's a cult of personality. That's why the stockholders voted overwhelmingly to give Musk his big payout - TSLA without Musk would tank.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lett3ir/",
      "created": 1721884745,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leudfok",
      "score": 0,
      "body": "Saying Tesla is just a car company right now would be like saying Amazon is just a online bookstore in the past. \n\nYes people did say that about Amazon, I had a 401k rep mid 00's look at me in 2009 like I was crazy when I asked about investing in google.  He said they don't make anything not a good company.  \n\nYou wont get a fair view on Tesla, there is a cult like hate against Elon from the violent left and mainstream sources.  Then you have the group that believes he can walk on water, turn water into wine. \n\nP/E 60 is not high, but because the brigading against Elon, the vile hate wont stop anytime soon I'm careful with the stock.  I did buy on the 200 day moving average low around $155 but exited at $205.   Ill do it again but will probably keep half the shares long term next time.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leudfok/",
      "created": 1721897740,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leuahcp",
      "score": 0,
      "body": "Nothing justifies the hype really. \nThe market is a weighing machine and a voting machine. \n\nSometimes the value is based on the weight of earnings, sometimes based on the votes.\n\nThey are ahead of the curve on electric vehicles which people like, but the future earnings growth does not justify the valuation.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuahcp/",
      "created": 1721895713,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leumacx",
      "score": 0,
      "body": "They paid out around double their literal revenue to Elon so I'm pretty sure they are done for in five years.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leumacx/",
      "created": 1721903527,
      "depth": 0,
      "replies": [
        {
          "id": "lev4x7d",
          "score": 1,
          "body": "No they did not. They did not pay Elon anything. His earnings package is in stock, not actual cash.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/lev4x7d/",
          "created": 1721912403,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "letrrpa",
      "score": -3,
      "body": "P/E is probably closer to 100 now. Nothing justifies it. It's all scam, smoke and mirrors stimulated by the free money by the FED and endless bailouts for riches by the government.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letrrpa/",
      "created": 1721884022,
      "depth": 0,
      "replies": [
        {
          "id": "leuatv0",
          "score": 1,
          "body": "Don't forget short covering.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuatv0/",
          "created": 1721895948,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "letv834",
      "score": -1,
      "body": "The P/B in here is quite high. Price to believe ratio.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letv834/",
      "created": 1721885962,
      "depth": 0,
      "replies": []
    },
    {
      "id": "letznfb",
      "score": -1,
      "body": "Nothing justifies the high PE. It will get back to other manufacturers eventually.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/letznfb/",
      "created": 1721888618,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leun9y0",
      "score": -1,
      "body": "Im curious why people have such strong opinions about stocks they aren’t invested in. I wouldn’t care about any P/E ratio of a stock i didn’t have money in.\n\nWe’ve been hearing this same argument since 2020, if you’re a value investor just say that.",
      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leun9y0/",
      "created": 1721904108,
      "depth": 0,
      "replies": [
        {
          "id": "leup735",
          "score": 1,
          "body": "I'm not sure if you are directing that to me or to the other comments, but at least for me I'm curious what justifies the stock beyond \"Elon is a genius/liar\". I don't have enough info to form a strong opinion and that is why I came to post here.",
          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leup735/",
          "created": 1721905192,
          "depth": 1,
          "replies": [
            {
              "id": "leupr9s",
              "score": 1,
              "body": "It’s a growth stock. Tesla is no different from NVIDIA, Chipotle, Eli Lily, etc…all have huge P/E ratios because people are expecting big growth. This is not something unique to Tesla.",
              "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leupr9s/",
              "created": 1721905492,
              "depth": 2,
              "replies": [
                {
                  "id": "leuqcj5",
                  "score": 1,
                  "body": "All those three have awesome fundamentals and are market leaders, clearly justifying their high P/E ratio. Please read my OP and compare.",
                  "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leuqcj5/",
                  "created": 1721905805,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "leurmri",
                      "score": 2,
                      "body": "I disagree. I don’t understand why Chipotle is priced like a tech company. But that’s why we have the individual choice to invest in what we want. I don’t feel the need to convince strangers on the internet that it’s overpriced I just won’t buy it.\n\nI read your OP and many others like yours since 2020. It gets really boring reading the same stuff here all the time.",
                      "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leurmri/",
                      "created": 1721906470,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "leurvq0",
                          "score": 1,
                          "body": "Well now you have caught my curiosity to dig deeper into Chipotle stock! I'm giving you an upvote for that!",
                          "permalink": "/r/stocks/comments/1eblyij/what_justifies_teslas_high_pe_ratio_amid_all_of/leurvq0/",
                          "created": 1721906593,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}