{
  "title": "Is the luxury trade reaching its end? ",
  "score": 82,
  "selftext": "So the latest earnings for LVMH and Kering came out this week and both had declining profit figures and flat to negative topline growth with 2024 H2 forecasts not looking any more rosy.\n\nChina had been for the past decade the make or break market for luxury with most luxury brands seeing regular 20% + growth in revenue in the region. But it seems this luxury bonanza reached its peak in 2022 and slowly started to decline as government imposed lockdowns in China eased. Market recovery was tempered by a property crisis, slowing economic growth, inflation,  rising youth unemployment and low consumer confidence. \n\nThis led to an oversupply as luxury retailers had hiked prices massively due to inflation and also because they could get away with it as demand seemed insatiable. However this caused issues in that these brands are now being left with too much inventory and have started offering increasingly discounted products. It’s reached a point that luxury goods are being discounted by as high as 50% in China as their middle class reins spending on big ticket items.\n\nThis is a huge issue as discounts largely influence future purchase decisions negatively especially in luxury. As people start to doubt the actual value of the expensive products they’re purchasing. This is very problematic during high inflation times as it becomes harder to justify purchasing a product that’s falling in value massively and people have less disposable income for literal luxury.   \n\nAdditionally, one of the issues is that luxury especially the likes of LV, Gucci and others have become a supermarket of supposedly luxury goods. Very different from a decade or so ago when a lot of these products were hand made or designed by artisanal designers working in high end ateliers having a specific know how and each product was made with high precision and lots of attention.  Nowadays many of luxury products have entire lines being mass produced and using fake leather for a lot of their bags. \n\nSaying all this, maybe its just a dip and there is a recovery. But where is demand going to come from? Europe and North America are pretty saturated markets, China is having large economic problems. Maybe India with its rising middle class and desire for show off become the next growth pillar for luxury? \n\n",
  "link_flair_text": null,
  "id": "1ebrgad",
  "num_comments": 62,
  "created_utc": 1721903077,
  "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/",
  "comments": [
    {
      "id": "leunvlf",
      "score": 49,
      "body": "HECK NO\n\nbut the fat profit margins are,,,",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leunvlf/",
      "created": 1721904451,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leurw9n",
      "score": 26,
      "body": "LVMH will be fine, the stock might go sideways for some time before the market conditions improve for luxury goods, but this might be an opportunity to get on board. \nIt’s well managed and their products sell incredibly well. \nThe problem is that the unusually high inflation has certainly affected their sales. Not only wealthy people buy their products but also many middle class customers, those customers are probably gonna spend less on luxury goods now, because more income  is going into gas, rent and groceries.",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leurw9n/",
      "created": 1721906600,
      "depth": 0,
      "replies": [
        {
          "id": "lewactv",
          "score": 13,
          "body": "I remeber watching a video explaining over half of people who buy designer brands are at or below average income",
          "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lewactv/",
          "created": 1721926188,
          "depth": 1,
          "replies": [
            {
              "id": "lewaotl",
              "score": 3,
              "body": "For many it's a real goal in life to own an original LV bag, there's a reason it's one of the most faked brands out there.",
              "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lewaotl/",
              "created": 1721926291,
              "depth": 2,
              "replies": [
                {
                  "id": "lewd1jo",
                  "score": 0,
                  "body": "Agreed. And that's why I won't personally buy one",
                  "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lewd1jo/",
                  "created": 1721927023,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "leuvwjn",
          "score": -6,
          "body": "Yep exactly the first thing that gets cut during inflation and rising costs is luxury spending since it's literally a luxury and not a necessary good. Plus these brands all raised their prices a lot in the last 2-3 years.\n\nI just don't see how they can continue to grow the way they did without something changing as the average consumer just doesn't have as big of a disposal income especially for non necessities post Covid.",
          "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leuvwjn/",
          "created": 1721908534,
          "depth": 1,
          "replies": [
            {
              "id": "leuzsat",
              "score": 4,
              "body": "They will keep slowly raising prices as always, the rest is probably down to the general consumer climate improving.",
              "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leuzsat/",
              "created": 1721910274,
              "depth": 2,
              "replies": []
            },
            {
              "id": "levmzp6",
              "score": 6,
              "body": "luxury spending in the middle class disappears during hard times, but not in the upper class. that literally never disappears. LVMH doesn't sell things to the 'average consumer' in general. they could all starve and it wouldn't effect LVMH at all. Thats why they've stopped focusing on lower end stuff and focused on the highest end expansions.   \nsource - worked 22 years in the luxury goods market and for LVMH directly",
              "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/levmzp6/",
              "created": 1721918802,
              "depth": 2,
              "replies": []
            },
            {
              "id": "levotza",
              "score": 1,
              "body": "Hm, don’t you think wealth is more distributed than ever before? More people have access to money for various reasons. I think that would be a bull case for luxury brands if they run their business right.",
              "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/levotza/",
              "created": 1721919393,
              "depth": 2,
              "replies": []
            },
            {
              "id": "leuzeb6",
              "score": 1,
              "body": "They don't cater to the average consumer. Rich people are still rich",
              "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leuzeb6/",
              "created": 1721910104,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "leunov0",
      "score": 29,
      "body": "Great questions but I do agree with the sentiment that luxury never dies…",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leunov0/",
      "created": 1721904345,
      "depth": 0,
      "replies": [
        {
          "id": "leunwxv",
          "score": 4,
          "body": "True people are always looking for the next designer piece to show off. But can you see the 20%+ yearly growth a lot of these companies have seen the last decade continuing for next 2-3 years?",
          "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leunwxv/",
          "created": 1721904472,
          "depth": 1,
          "replies": [
            {
              "id": "leuo1u0",
              "score": 5,
              "body": "Probably not except maybe Hermes.",
              "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leuo1u0/",
              "created": 1721904549,
              "depth": 2,
              "replies": [
                {
                  "id": "leuo67v",
                  "score": 6,
                  "body": "Argument to be made that Hermes is one of the few true luxury companies out there nowadays.",
                  "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leuo67v/",
                  "created": 1721904621,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "leut1ls",
                      "score": 4,
                      "body": "We buying Hermes then ?",
                      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leut1ls/",
                      "created": 1721907176,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "levo37k",
                          "score": 3,
                          "body": "Let me know captain 🫡",
                          "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/levo37k/",
                          "created": 1721919153,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lex9qlt",
                              "score": 4,
                              "body": "Been watching it for a bit. I think it needs to come down a little for a safety margin",
                              "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lex9qlt/",
                              "created": 1721937339,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lf127yk",
                              "score": 1,
                              "body": "Earnings looked fantastic. Nevermind, I’m going to dip my toe in today !",
                              "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lf127yk/",
                              "created": 1721999789,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lev0dl0",
          "score": 1,
          "body": "until it does",
          "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lev0dl0/",
          "created": 1721910530,
          "depth": 1,
          "replies": [
            {
              "id": "lev0qcw",
              "score": 4,
              "body": "Luxury has been “dying” for 100s of years",
              "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lev0qcw/",
              "created": 1721910682,
              "depth": 2,
              "replies": [
                {
                  "id": "levo7dn",
                  "score": 3,
                  "body": "Hermes stock chart.",
                  "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/levo7dn/",
                  "created": 1721919190,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lev6zm4",
                  "score": 3,
                  "body": "Imo brand erosion is happening at an exponential rate.  What does that mean?  When I was a kid it was rare to see a Ferrari.  I always wanted one.  Now I see 1000s per day on insta/youtube it’s no longer cool.\n\n\nSeeing something rare= value.  Now social media normalized everything so only the last fools are buying this",
                  "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lev6zm4/",
                  "created": 1721913209,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "levobte",
                      "score": 11,
                      "body": "It’s still rare in person. Just cuz you saw it on IG doesn’t mean it isn’t rare. That’s an issue with social media",
                      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/levobte/",
                      "created": 1721919229,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "levpv91",
                          "score": 1,
                          "body": "right, but it doesn't have the wow factor like it use to.  The next generation coming up doesn't really care about it anymore.  The mystique is gone, will luxury items exist?  YES.  But maybe it looks different 5-10 years out than today.  Its an interesting case study to watch unfold :)",
                          "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/levpv91/",
                          "created": 1721919717,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "levq359",
                              "score": 3,
                              "body": "Nah man, youngins love that shit. They want it because they can show up to a car meet and touch it. It’s more accessible as you mentioned but unfortunately we still don’t have money 🤣☠️",
                              "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/levq359/",
                              "created": 1721919787,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "leup876",
      "score": 7,
      "body": "I like LVMH myself. Not as familiar with Kering but if you look at their respective 5 and 10 year charts they are performing wildly differently. LVMH also has a wider portfolio of brands.",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leup876/",
      "created": 1721905208,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lew493j",
      "score": 5,
      "body": "As far as being a luxury brand, the ship has sailed for large parts of Kering and LVMH. It’s a brand easily attainable by the plebs and middle class; it’s associated with loud new money.\n\nBeen to a Gucci store recently? People behave like animals, especially in the US and in outlet stores. There is no sense of customer treatment as brands like Hermés have been able to refine, and no sunk cost ladder of aspiration. If you have the money you can walk into any LV or Gucci store and buy it outright, as opposed to Hermés wherw you can’t just buy a Kelly or Birkin at will.\n\nThe bags are also of poorer quality today, still fine bags, especially a neverfull or keep-all, but in no way luxurious.\n\nJust like Chanel, they’ve become a brand that will be on par with H&M in the future, but better quality and much more expensive. Arnault’s background is in real estate, when he took over the brand, he chose to focus on volume over margins, and by the brand is too diluted to ever reach high luxury-status.\n\nThey’ll still make money, but they have no strategy to salvage the brand. They tried imitating Hermés by just raising prices, but since the quality has become so much worse, anyone who is actually knowledgeable in fashion and not just new money trying to look the part isn’t buying the bait, hence the loss of status.",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lew493j/",
      "created": 1721924271,
      "depth": 0,
      "replies": []
    },
    {
      "id": "levajgt",
      "score": 9,
      "body": "Yep, luxury trade is at an end.  LVMH is much better than Kering, but I wouldn't touch either.\n\nThe massive growth was due to Covid and China.  Luxury watches are similarly in free fall.  China was the region that was driving most of the growth in luxury goods.\n\nRight now, the Chinese economy is doing badly, and I am actually seeing a culture shift too.  Before, all Chinese wanted to buy the premium Western luxury, but now many are shifting to buying Chinese brands and no longer chasing Western luxury as much.  I think even if the Chinese economy rebounds, it isn't coming back.  Don't get me wrong, there will always be a big luxury market in China, but not the same extent as before.\n\nI can't really see India being the next country.  Their growth is pretty unevenly distributed, and I think culturally, when they have more money, they probably want to spend more on gold and jewelry than designer goods?",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/levajgt/",
      "created": 1721914541,
      "depth": 0,
      "replies": [
        {
          "id": "lqtsrq3",
          "score": 3,
          "body": "One of my favorite things about lvmh group is you can shop around and not even know your buying one of their brands from rimowa in japan (incredibly popular over there much more than tumi) to tiffany for jewelry .\n\nBut I worry about future growth and China economy propping up its valuation.  At best it goes sideways and we get dividends from owning their shares. The stimulus boost from china I think will be short lived. There is bad data on exports and manufacturing from china that cant be fixed from a stifling government that doesn't know how to bring back foreign capital and momentum without going against its ultra nationlistic mantra",
          "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lqtsrq3/",
          "created": 1728330330,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leus5wo",
      "score": 7,
      "body": "Don’t put the two (LVMH and Kering) in one bucket, also inflation is something that is affecting people in the western world but not in China. Japan is seeing double-digit growth as Chinese probably use the lower yen to shop there.\n\nFor LVMH their retail business (Sephora) and their fragrance & beauty segment did grow. Fashion was flat but what fell was their spirits business and jewelry.\n\nKering on the other hand is completely reliant on Gucci and after that on Balenciaga/Saint Laurent.\n\nWhat LVMH said is that their aspirational customers are the ones cutting back.",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leus5wo/",
      "created": 1721906737,
      "depth": 0,
      "replies": [
        {
          "id": "leuviu0",
          "score": -2,
          "body": "True Kering is a different beast with more than half their revenues coming from a single brand. But LV and Kering are considered the 2 luxury powerhouses and basically own the bulk of brands.\n\nPlus they reported their figures day after each other hence the inclusion. But yeah if one had to pick a stock for the long term out of the two it's def going to be LVMH.",
          "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leuviu0/",
          "created": 1721908357,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lev0e58",
      "score": 3,
      "body": "They will be down in the short term because China as mentioned and here in US I think people will hold off on large luxury purchases until after election. Profit margins will go down as well.",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lev0e58/",
      "created": 1721910537,
      "depth": 0,
      "replies": [
        {
          "id": "lfazdol",
          "score": 1,
          "body": "That’s a pretty solid thesis.  \n\nThen maybe one more (or 3) “Luxury Trade Sucker Rallies” after that….",
          "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lfazdol/",
          "created": 1722150412,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "levonrv",
      "score": 3,
      "body": "Luxury fashion has the highest markup in industry history. And half of revenue for those big companies comes from Asia. The Asian consumer is their lifeline, and now you see China promoting their own companies in liquor and fashion as well.",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/levonrv/",
      "created": 1721919334,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lez98ul",
      "score": 3,
      "body": "Ok so LVMH is actually more defensive to inflation then a lot of other brands. Inflationary pressure doesn’t affect upper class income nearly as much as lower class and clothing makes up a much smaller % of their total spending. Because of this the rich don’t downgrade to Coach from Gucci during a recession. The upper middle class does downgrade to Coach during a recession so it should be expected to see some loss in revenue. The reason why LVMH is more defensive is because you don’t have to worry about LVMH ever falling out of fashion. In 10 years from now LULU lemon may not exist but I guarantee Dior , Prada and Gucci will. This is an excellent time to start buying LVMH in my opinion because of all clothing stocks like Nike, Lulu ect LVMH is the one that most certainly will bounce back eventually. Nike I believe is a good buy also but you may be waiting for years. LULU could be gone in 2 years from now.",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lez98ul/",
      "created": 1721963922,
      "depth": 0,
      "replies": []
    },
    {
      "id": "levv7w3",
      "score": 8,
      "body": "IMO, the problem with most luxury brands are two fold.\n\n1) they stopped being luxury brands. A lot of sales of “luxury” brands like Louis Vuitton and Gucci are to working class and middle class people, who buy them on credit or with excess income they saved for that purchase. We are in a cost of living crises so credit and expendable income isn’t as available as it was, which cuts down on sales.\n\n2) actually wealthy people don’t want to buy brands like LV and Gucci because they’re over proliferated, which causes them to look tacky and cheap. Brands like Gucci and LV especially hurt their brand by chasing middle and working class consumers, seeing every 20 and 30 something woman with a Gucci or LV bag just makes them look like a overpriced mall brand going through a trend, the Stanley cup of purses.",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/levv7w3/",
      "created": 1721921419,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leunnlt",
      "score": 5,
      "body": "They're always going to be around. They also tend to have plenty of cash on their hands and pay good dividends.",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leunnlt/",
      "created": 1721904326,
      "depth": 0,
      "replies": [
        {
          "id": "leusd1t",
          "score": 4,
          "body": "Plenty of cash?  They’re a $380B enterprise with $7B cash.  IMO they keep the absolute minimum quantity of cash on hand.",
          "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leusd1t/",
          "created": 1721906837,
          "depth": 1,
          "replies": []
        },
        {
          "id": "leuoac5",
          "score": 5,
          "body": ">They're always going to be around.\n\nDoesn't matter when half your investment has dissolved into thin air. I really, really hate how often people say this.",
          "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leuoac5/",
          "created": 1721904686,
          "depth": 1,
          "replies": [
            {
              "id": "leuq4pi",
              "score": 2,
              "body": "Well, it sounds like you have made poor choices in the past. \nLuxury stocks offer good diversification in the context of a broad portfolio.\nThe issue with most of the discussion around stocks is that people look for short term gains with individual picks, rather than building a portfolio for a long enough investment horizon.",
              "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leuq4pi/",
              "created": 1721905691,
              "depth": 2,
              "replies": [
                {
                  "id": "leuqcf4",
                  "score": 3,
                  "body": "> it sounds like you have made poor choices in the past\n\nI... never said I bought luxury stocks...?",
                  "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leuqcf4/",
                  "created": 1721905804,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "leutbeo",
                      "score": 2,
                      "body": "Another poor choice",
                      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leutbeo/",
                      "created": 1721907308,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "leuufye",
                          "score": 5,
                          "body": "Good choice for me seeing how most of them performed lol",
                          "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leuufye/",
                          "created": 1721907848,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "leuvwvy",
                              "score": 0,
                              "body": "That I agree",
                              "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leuvwvy/",
                              "created": 1721908538,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "leuo36o",
          "score": 1,
          "body": "Kering does have a PHAT dividend but the stock is down nearly 50% in a year. whats the point when you lose so much on the underlying though..",
          "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leuo36o/",
          "created": 1721904571,
          "depth": 1,
          "replies": [
            {
              "id": "leuq6pj",
              "score": 0,
              "body": "Just restructure your position and think if it's time to cut your losses short.",
              "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leuq6pj/",
              "created": 1721905721,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "levcerj",
      "score": 2,
      "body": "Yeah, in China there are economic issues, so the wealthy don't want to flaunt their wealth when people are going through hard times. China was a big growth market for the luxury companies. \n\nWhether there will be a recovery and how soon it will recover remains to be seen. There are many other industries to invest in",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/levcerj/",
      "created": 1721915215,
      "depth": 0,
      "replies": []
    },
    {
      "id": "levn6p1",
      "score": 2,
      "body": "Short-term down cycle now\nStrong secular growth\nQuestion is how deep and long the down cycle will be",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/levn6p1/",
      "created": 1721918865,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfaz524",
      "score": 2,
      "body": "Could be a strange market all around.  Newer luxury brands might be ok.  Maybe not the ‘80’s Inc. names…. \n\nOrthodox high in DJIA might have occurred in 2022.  Stocks could be in a volatile range for the next 2-3 years.  Then a mega-crash/plunge out of nowhere.  \n\nI wouldn’t even have gold/silver as “long term holds” (5-10 years) in this environment.",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lfaz524/",
      "created": 1722150254,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leumvox",
      "score": 5,
      "body": "Lux DEEZ NUTZ",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leumvox/",
      "created": 1721903879,
      "depth": 0,
      "replies": [
        {
          "id": "leuuozc",
          "score": 0,
          "body": "This is also my opinion",
          "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leuuozc/",
          "created": 1721907967,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lew27jc",
      "score": 1,
      "body": "I have no faith on fashion brands because they are simply not sustainable, and there's a chance that they are going to reduce their products quality to get more profit",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lew27jc/",
      "created": 1721923620,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lewxj2q",
      "score": 1,
      "body": "Aston Martin went up in London yesterday. The rich getting richer but it must remain exclusive enough. Not wanna be rich like Gucci",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lewxj2q/",
      "created": 1721933487,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ley41lh",
      "score": 1,
      "body": "Chinas customers are striking xD hottest trend right now for people in the 20-30s is revenge saving xD",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/ley41lh/",
      "created": 1721947500,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezx9vy",
      "score": 1,
      "body": "Not all luxury brands are the same, but for the domain newbie I always look at their earnings.\n\nLVMH seems to have more consistent and positive outlook.\n\nAlso, I hope their brandnames remain exclusive and focused, diluting brandnames are the 1st sign of poor management. If I can not control the luxury market, I can at least choose the management team (by buying/selling the appropriate stocks).",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lezx9vy/",
      "created": 1721976831,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp1vv1w",
      "score": 1,
      "body": "Look again today ![gif](emote|free_emotes_pack|grin)",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lp1vv1w/",
      "created": 1727371890,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsij5op",
      "score": 1,
      "body": "It’s cyclical, so it will come back eventually. No one knows when but they can give predictions.",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lsij5op/",
      "created": 1729253239,
      "depth": 0,
      "replies": []
    },
    {
      "id": "levn29v",
      "score": 1,
      "body": "I worked for this company, and i know any slowdown is all due to the investment in china and emerging markets. As far as products being produced, the company has pivoted away from more affordable wares being pitched to the upper middle class and has renewed its focus on the ultra-high end wares. That market segment survives recessions because the literal billionaires buying it never run out of money. The people buying the 10k-50k wares run out of money and stop buying. \n\n  \n\"Additionally, one of the issues is that luxury especially the likes of LV, Gucci and others have become a supermarket of supposedly luxury goods. Very different from a decade or so ago when a lot of these products were hand made or designed by artisanal designers working in high end ateliers having a specific know how and each product was made with high precision and lots of attention.  Nowadays many of luxury products have entire lines being mass produced and using fake leather for a lot of their bags.\"\n\nI don't know where you got these ideas, but they're totally wrong, at least for LVMH umbrella brands. Everything is still made by very skilled artisans. They have never ignored modern manufacturing techniques, ever, so the fact you think everything was being 'hand made' only 10 years ago just shines a light on how little you know about manufacturing high end goods. None of this has been actually 'handmade' for generations. There have been basically no changes at all to thee way they manufacture things except more use of 3d printing and laser welding over the past decade. ffs, even the GIFT BOX is custom made by multiple artists for the stuff coming out of tiffany and co's holloware department. Sometimes they don't even know how to make it and it takes half a dozen failed attempts to get something up to par. there is absolutely ZERO fake leather used in LV products.",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/levn29v/",
      "created": 1721918825,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leurq1s",
      "score": 1,
      "body": "They’re going to burn all the excess & likely still make a profit",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/leurq1s/",
      "created": 1721906515,
      "depth": 0,
      "replies": []
    },
    {
      "id": "levpror",
      "score": 1,
      "body": "Designer Brands are not genuine Businesses. \nA Stock has to guarantee Demand and Sales. They guarantee it by having a product people need and use or desire. \nDesigner Brands, on the other hand, create artificial Hype, by pretentious wannabe Genius CEOs, dumb polarizing Campaigns, randomly increasing prices and burnings tons of Products to decrease the Supply. \n\nLuxury will stay, but it will adapt i feel.",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/levpror/",
      "created": 1721919686,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lewojb4",
      "score": 0,
      "body": "OP listened to Morning Brew Daily today, apparently",
      "permalink": "/r/stocks/comments/1ebrgad/is_the_luxury_trade_reaching_its_end/lewojb4/",
      "created": 1721930639,
      "depth": 0,
      "replies": []
    }
  ]
}