{
  "title": "Prime Video reaches a landmark 11-year streaming deal with the NBA and the WNBA",
  "score": 57,
  "selftext": "Amazon Prime Video and the NBA today announced an 11-year media rights agreement, beginning with the 2025-26 NBA season. In a landmark deal, Prime Video will present exclusive global coverage for 66 regular-season NBA games, including an opening-week doubleheader, a new Black Friday NBA game, and all games from the Knockout Rounds of the Emirates NBA Cup, including the in-season tournament’s Semifinals and Finals.\n\nPrime Video also acquires rights to exclusive coverage of every game of the postseason SoFi NBA Play-In Tournament, first- and second-round playoff games, and Conference Finals in six of the 11 years of the deal. Prime Video will distribute its package of games in the U.S. and internationally, with an expanded package of games in select territories, including Mexico, Brazil, France, Italy, Spain, Germany, the United Kingdom, and Ireland. This expanded package includes a minimum of 20 additional primetime, regular-season games each year, a Conference Finals series each year, and the NBA Finals in six of the 11 years.\n\nAs part of the agreement, Prime Video Channels will also be the strategic partner and third-party global channels store destination for NBA League Pass, the NBA’s subscription service for streaming live and on-demand games, in the U.S. and internationally.\n\n[...]\n\nPrime Video’s regular-season NBA coverage will tip off at the start of the 2025-26 season with an opening-week doubleheader, and will include Friday night games, select Saturday afternoon games, and Thursday night doubleheaders, which will begin in January 2026 after the conclusion of Prime Video’s Thursday Night Football schedule. Prime Video will present live NBA pregame, postgame, and halftime shows as part of its coverage, with additional details around talent and production to be announced at a later date. Prime Video will also stream half of all NBA Summer League games, as well as a package of WNBA and NBA G League regular-season and postseason games.\n\nThe international live-game package rights extend worldwide, with the exception of Greater China, Poland, Finland, Sweden, Norway, Denmark, and the Netherlands, with rights in Canada beginning in the 2026-27 NBA season.\n\nPrime Video and the Women’s National Basketball Association (WNBA) also announced a new 11-year rights agreement, commencing in 2026, in which Prime Video will exclusively stream 30 WNBA regular-season games each season worldwide, including the Championship Game of the WNBA Commissioner’s Cup presented by Coinbase. The agreement also gives Prime Video exclusive WNBA postseason games for the first time, including one first-round series each year, plus seven Semifinal series, and three WNBA Finals over the course of the 11-year deal. Prime Video Channels will also be the global channels store destination for WNBA League Pass, the WNBA’s subscription service for streaming live and on-demand games, in the U.S. and internationally.\n\nPrime Video will stream the package of WNBA games worldwide (excluding Greater China, Poland, Denmark, Sweden, Finland, Norway, and the Netherlands).\n\nSource: https://www.aboutamazon.com/news/entertainment/prime-video-nba-wnba-streaming-deal",
  "link_flair_text": "Company News",
  "id": "1ec6mkm",
  "num_comments": 12,
  "created_utc": 1721943085,
  "permalink": "/r/stocks/comments/1ec6mkm/prime_video_reaches_a_landmark_11year_streaming/",
  "comments": [
    {
      "id": "leymd58",
      "score": 5,
      "body": "Cries in Canada\n\n\nFk TSN",
      "permalink": "/r/stocks/comments/1ec6mkm/prime_video_reaches_a_landmark_11year_streaming/leymd58/",
      "created": 1721954466,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezd8hq",
      "score": 6,
      "body": "Is this going to increase my subscription fee next year?",
      "permalink": "/r/stocks/comments/1ec6mkm/prime_video_reaches_a_landmark_11year_streaming/lezd8hq/",
      "created": 1721965765,
      "depth": 0,
      "replies": [
        {
          "id": "lezrt78",
          "score": 6,
          "body": "This is the beginning of truly segmented TV. This is where the next iteration of TV service is going. But yes, I’d expect soon that Prime Video will break away from the Prime delivery membership and become its own package.",
          "permalink": "/r/stocks/comments/1ec6mkm/prime_video_reaches_a_landmark_11year_streaming/lezrt78/",
          "created": 1721973478,
          "depth": 1,
          "replies": [
            {
              "id": "lf10os7",
              "score": 7,
              "body": "I doubt they’ll break them up fully. They would lose so many customers for Prime Video. They will just increase the price of the whole package and people will keep paying it",
              "permalink": "/r/stocks/comments/1ec6mkm/prime_video_reaches_a_landmark_11year_streaming/lf10os7/",
              "created": 1721999192,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lf0opmy",
              "score": 5,
              "body": "You could always buy prime video subscription separate from the one that comes with delivery. It’s already a separate subscription if wanted.",
              "permalink": "/r/stocks/comments/1ec6mkm/prime_video_reaches_a_landmark_11year_streaming/lf0opmy/",
              "created": 1721993969,
              "depth": 2,
              "replies": [
                {
                  "id": "lf0ot4z",
                  "score": 2,
                  "body": "I wasn’t aware TBH. Good info.",
                  "permalink": "/r/stocks/comments/1ec6mkm/prime_video_reaches_a_landmark_11year_streaming/lf0ot4z/",
                  "created": 1721994016,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "leyzxfy",
      "score": 2,
      "body": "One can only hope the NHL signs a similar deal. I think YouTube would be a natural fit with the sport.",
      "permalink": "/r/stocks/comments/1ec6mkm/prime_video_reaches_a_landmark_11year_streaming/leyzxfy/",
      "created": 1721959949,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezcidt",
      "score": 2,
      "body": "Warner Brothers has a little something to say about that.",
      "permalink": "/r/stocks/comments/1ec6mkm/prime_video_reaches_a_landmark_11year_streaming/lezcidt/",
      "created": 1721965420,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lexyaqe",
      "score": 0,
      "body": "Anyone but Disney.",
      "permalink": "/r/stocks/comments/1ec6mkm/prime_video_reaches_a_landmark_11year_streaming/lexyaqe/",
      "created": 1721945412,
      "depth": 0,
      "replies": [
        {
          "id": "ley9iea",
          "score": 11,
          "body": "Hate to break it to ya — Disney, NBC, and Amazon all signed deals with the NBA.",
          "permalink": "/r/stocks/comments/1ec6mkm/prime_video_reaches_a_landmark_11year_streaming/ley9iea/",
          "created": 1721949528,
          "depth": 1,
          "replies": [
            {
              "id": "leydmwk",
              "score": 1,
              "body": "Trust me, I know. Any game that Disney doesn’t get rights for is a win in my book. They’ve blacked me out so many times this year and I’m over it.",
              "permalink": "/r/stocks/comments/1ec6mkm/prime_video_reaches_a_landmark_11year_streaming/leydmwk/",
              "created": 1721951087,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lezrsl3",
      "score": 0,
      "body": "Not so sure about this. WBD going to sue (and probably win) rights… a contract is a contract.",
      "permalink": "/r/stocks/comments/1ec6mkm/prime_video_reaches_a_landmark_11year_streaming/lezrsl3/",
      "created": 1721973468,
      "depth": 0,
      "replies": []
    }
  ]
}