{
  "title": "I spend $4m a year facebook ads and I'm shorting $META earnings",
  "score": 2470,
  "selftext": "This is a play based purely on anecdotal experience in the ecommerce space. Here's the anecdotal take:\n\nI started my ecom business 7 years ago and have built it on the back of the meta ads platform. Year over year we were able to grow and increase our spend. Last year we did around 9m, with 4m spend on Meta. This year, we're down about 30% on revenue and the efficiency of our META spend is down 10%. I'm in groups with hundreds of other founders, and this is the same situation for about 80% of the members in these groups. Just head on over to r/facebookads and look at all the depressing posts lol. Ask anyone you know who works in ecom how their company is doing this year.\n\nThe internal reality at Meta is that the ads platform is totally fucked up right now, more so than after the iOS update that sent the stock to $100, and barely anyone is talking about it. Google the stock and all you'll find is that 100% of analysts agree that it's a strong BUY, talking about AI and literally not mentioning the ad business (which effectively drives 100% of META revenue). In November 2022, when facebook was at $100, all the same analysts said META was dead and to stay away.\n\nAlso, I'm not a TA guy, but just look at that fuckin chart. Straight up for like 20 months. Looks toppy as hell.\n\nIn the 7 years of owning my business, all of my biggest pay days have come from anecdotal meta earnings call plays. This is nearly an identical situation to when the iOS update broke the ads platform while they were simultaneously blowing money on the metaverse, except nobody knows exactly what broke the ads platform (including facebook) and the multi billion dollar pit is their AI investment currently driving 0 revenue. I'm confident at the very least META EPS will be an underwhelming beat like google or a miss. They'll do damage control by saying \"AI\" 250+ times on the earnings call but that didn't work for Google so I don't see it working for them either.\n\nI've got 15k worth of options, positions below. This is some purely anecdotal gambling, do with it what you will. Not financial advice \n\nPositions [https://i.imgur.com/f1acBVy.jpeg](https://i.imgur.com/f1acBVy.jpeg)\n\nEDIT: Wow this blew up. Some clarifications:\n\n1) I'M GAMBLING YALL. Anecdotal evidence does not paint a full picture, obviosuly. But each of the massive multi year moves up and down by Meta over the last few years were felt first by advertisers. General advertising performance has worked as a leading indicator multiple times before, and the ads platform has had loads of issues this year.\n\n2) I think META is a great long term investment. I very much plan to continue spending my money on it, it's the dominant platform in the ad space by a long shot. But I also think its in a really good spot to take a fat shit in the short term. That's the play guys, I dont think Meta is going to die, I think its going to dip.\n\n3) My business did 9m last year, but as I stated, I spent half of that shit on fucking facebook ads. Considering we have to also, ya know, purchase the products, pay for shipping, staff, software subscriptions, hosting, etc. Net income generally lands between 7-10% of total revenue, and much of that get's reinvested back into the business. I make good money, but I'm not just rolling in cash. It's money I can afford to lose, but lol at everyone calling 15k on weeklies for an earnings play peanuts. Playing earnings is risky no matter your conviction levels.\n\nThere's so many factors that can play into an earnings call. Anyone with aggressive certainty going into an earnings call is an idiot, you can be right and get reamed by a stock buy back. But I personally feel strongly enough about the information to make a bet, and I'm sharing that insight with you guys cuz I haven't seen many people talking about it. If I'm right, this could easily be a 5-10x play. If I'm wrong, I lose. That's gambling you pussies.\n\nEdit: I am, in fact, cooked.",
  "link_flair_text": "YOLO",
  "id": "1eca49y",
  "num_comments": 900,
  "created_utc": 1721952302,
  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/",
  "comments": [
    {
      "id": "leygu34",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 137 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leygu34/",
      "created": 1721952308,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leytyyg",
      "score": 2229,
      "body": "OP might be on top of something\n\n\nMy personal experience with FB, I get so many ads and a bunch of suggested posts, sometimes more than actual posts, it's unusable at this point",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leytyyg/",
      "created": 1721957537,
      "depth": 0,
      "replies": [
        {
          "id": "lez34qj",
          "score": 479,
          "body": "This is true it’s terrible nowadays",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez34qj/",
          "created": 1721961273,
          "depth": 1,
          "replies": [
            {
              "id": "leze8xf",
              "score": 344,
              "body": "Not to mention 90% of the non-ads are just influencers that I don’t follow popping up on my timeline promoting something",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leze8xf/",
              "created": 1721966246,
              "depth": 2,
              "replies": [
                {
                  "id": "lf138jw",
                  "score": 61,
                  "body": "I had to get back on Facebook for my job (marketing funny enough) and it makes me want to gouge my eyes out every time I open the app. WHY IS EVERY OTHER POST A SUGGESTED USER!?!",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf138jw/",
                  "created": 1722000176,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lf1kdtw",
                      "score": 6,
                      "body": "Someone I know made a post 2 weeks ago about this very problem. I'm not huge into social media. They posted click report post as AI. Boom suggested crap goes away. After doing that for about a week, I came to find 20 out of 21 posts in my feed were commercial content on average. All of 4 people on my friends list still post and only 3 groups I'm following are still active. I have no idea how FB still has a market cap. Their audience is gone.",
                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf1kdtw/",
                      "created": 1722006133,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lf17719",
                  "score": 58,
                  "body": "https://preview.redd.it/djj8p5beaved1.png?width=618&format=png&auto=webp&s=1a682fe963a4479701f57e16f7e7dabd7191f03d\n\nI got this \"ad\" the other day. I screenshotted it and sent it to a friend because I thought it was that stupid. I couldn't tell you who this is or how it works, but yeah man attractive young woman selling a nasal cleaning device.   \n  \nI can't wait until paid influencers stops being a thing someday (it probably won't, unfortunately)",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf17719/",
                  "created": 1722001641,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lf1ddhl",
                      "score": 22,
                      "body": "Navage is legit tho haha.  Cleans you right out!",
                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf1ddhl/",
                      "created": 1722003796,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lezffvh",
              "score": 212,
              "body": "WHAT THE FUCK DID THEY DO?\n\nI rarely go on fb but damn did they ever fuck up the feed. There’s a whole bunch of shitty video game ads where the player purposefully loses. They’re obviously banking 100% on ragebait rn\n\nIt’s so intolerable.",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezffvh/",
              "created": 1721966825,
              "depth": 2,
              "replies": [
                {
                  "id": "lezmdon",
                  "score": 47,
                  "body": "[deleted]",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezmdon/",
                  "created": 1721970391,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lezmtp2",
                      "score": 107,
                      "body": "Google is pretty bad too. I swear the internet is getting very shitty, very quickly. I do a bit of web development, each and every turn, the hosting platform tries to monetize me.\n\nDo you need Pro service? Next page: do you need Ultra Pro+ service?\n\nHow do they even keep track of their own bullshit?",
                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezmtp2/",
                      "created": 1721970635,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lf0lpae",
                          "score": 27,
                          "body": "Looking for a substantive news article is also difficult - I follow some specialty topics and it went from finding an article a week from the trade publication or a small news site to hundreds of articles a day… of nothing but word salad.",
                          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0lpae/",
                          "created": 1721992437,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lf13a93",
                              "score": 37,
                              "body": "dead internet theory",
                              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf13a93/",
                              "created": 1722000194,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lf1ybkp",
                          "score": 7,
                          "body": "Yeah. The internet is getting really bad. Let's all get off it. What would we do? Go outside?",
                          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf1ybkp/",
                          "created": 1722010645,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lf14rtq",
                      "score": 15,
                      "body": "Google got SEOed to absolute death. victim of its own success. I feel like if Google had a couple of legit competitors and it wasn't just \"google's world\" for all web-based companies, its SEO algos wouldn't have been targeted so hard and it wouldn't have been gamed and ruined so aggressively. but it didn't have competition so here we are.",
                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf14rtq/",
                      "created": 1722000755,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lf12ow7",
                      "score": 22,
                      "body": "They have fucked their YT recommendations up so bad, they only show content from the last month, which is fucking terrible. Think of all the quality content already out there that no one will ever discover. I’ve been using search with the qualifier “before:2022” at the end at it helps a ton, but it’s still so sad to see",
                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf12ow7/",
                      "created": 1721999970,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lf1hmyt",
                  "score": 7,
                  "body": "all of those video game ads you mention are bait and switches too. The game that it links to is different from the ad. It's pretty much always a pay to win empire builder like a bad clash of clans. I heard from someone that you need '$300 a month to play, and much more to be competitive.' So its likely their conversion rate is very low but the people who do end up buying in pay a car payment or more for some idiotic reason. It is the most profitable business model on the net right now which is why their ads are all over the place. I find it so bizarre.",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf1hmyt/",
                  "created": 1722005235,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lf0lymq",
              "score": 13,
              "body": "I only use it to sell trash for pennies on marketplace",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0lymq/",
              "created": 1721992571,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lezqqgf",
          "score": 52,
          "body": "Something happened recently. I’m seeing a lot of suggested post, but don’t see posts from my friends",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezqqgf/",
          "created": 1721972851,
          "depth": 1,
          "replies": [
            {
              "id": "lf1gjwx",
              "score": 27,
              "body": "If your friends are like me, they just quit bothering to post anything on that bot-infested granny platform. And I say that as a grandfather.",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf1gjwx/",
              "created": 1722004875,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lezjfyq",
          "score": 271,
          "body": "OP is not onto something, he (and everyone else) is experiencing declines in return on ad spend because it’s election season and ad space is being bid up like crazy. Likely his CPC and CPM went up too. This happens in November as well when big companies eat up ad spend for the holiday sales.\n\nYou saying you get a bunch of ads…. Those ads were bought. This is bullish as hell hahaha",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezjfyq/",
          "created": 1721968841,
          "depth": 1,
          "replies": [
            {
              "id": "lezpfxr",
              "score": 159,
              "body": "At first OP had me convinced lol now you have me convinced",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezpfxr/",
              "created": 1721972103,
              "depth": 2,
              "replies": [
                {
                  "id": "lf0wme4",
                  "score": 19,
                  "body": "They literally told you they gave meta 4 million this year. Who cares if they get a return as long as Facebook does!",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0wme4/",
                  "created": 1721997550,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lezvb1i",
                  "score": 76,
                  "body": "Meta go down cause angry cloud in sky make angry boom boom noise  please subscribe for more caveman predictions. \n\n\n 1st caveman prediction free 2nd caveman prediction cost 2 coconut",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezvb1i/",
                  "created": 1721975600,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lezycsy",
                      "score": 23,
                      "body": "Jim that you?",
                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezycsy/",
                      "created": 1721977516,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lezxmnt",
                      "score": 8,
                      "body": "Best I can do is 1 coconut, 1 banana peel.",
                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezxmnt/",
                      "created": 1721977053,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lezxto0",
                          "score": 8,
                          "body": "Banana peel you insult, me see you, me beat with stick.",
                          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezxto0/",
                          "created": 1721977176,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lezxzis",
                              "score": 5,
                              "body": "Me ready, not afraid, have friends with sharp rock.",
                              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezxzis/",
                              "created": 1721977278,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lezyfab",
                                  "score": 10,
                                  "body": "Me wait, You eat bad food, stomach hurt, no more eat, get weak small. Me come then.",
                                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezyfab/",
                                  "created": 1721977560,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lezynpi",
                                      "score": 9,
                                      "body": "Me come right now 💦 ugg",
                                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezynpi/",
                                      "created": 1721977711,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lf0obw9",
                  "score": 11,
                  "body": "Lol I'm with you. That's the worst part about these posts. I'm so easily convinced one way or the other that I can't tell up from down on my own any more.",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0obw9/",
                  "created": 1721993782,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lf10ng1",
              "score": 24,
              "body": "Been an advertiser on FB for 12 years. Q3-Q4 CPMs are crazy high (especially during election year due to the millions being poured into campaign b.s. from both parties). However, I will also state that OP has a point. The ROI for Ecom brands as a whole this year is significantly down. Their attribution tracking is usually 30-50% over-reported or under-reported. Rarely do I see any accurate reporting unless they are lead form ads but the quality of leads are truly garbage so most businesses find it hard to convert as 50% have invalid phone numbers and email addresses, 30% won’t remember opting in for anything, and 10% just ignore you. Making ads optimization based on their ads reporting columns ROI-suicide. \n\nTheir platform keeps pushing for using Advantage+ campaign structure and it usually mixes top of funnel cold traffic with retargeting audiences all in the same ad set. It’s very hard to get and maintain 2.5x ROAS on the platform nowadays and for most business’ profit margins advertising on their platform just doesn’t make sense when you factor in cost of attribution tracking software, COGs, increasing fees from Shopify/Klaviyo which is most ecom’s tech stack. \n\nThey have taken away more and more control from advertisers pushing using their machine learning but their machine learning doesn’t get better results. Their platform is sliding so hard and so fast down a black hole that I pivoted my businesses to focus more on funnel building and email marketing rather than paid advertising. \n\nJust my 2cents and professional experience as an advertiser having worked in hundreds of ad accounts over the last 12 years, but I agree with OP’s thesis.",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf10ng1/",
              "created": 1721999177,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lezu8qt",
              "score": 29,
              "body": "He said his efficiency was over the year not just the election season. Most businesses were affected by the iOS changes and haven’t recovered.",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezu8qt/",
              "created": 1721974938,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lf08tbu",
              "score": 7,
              "body": "This is why you need both sides of the story.  OP had changed my mind, now you’ve changed my mind.  I wish I could think for myself, but I always end up losing.",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf08tbu/",
              "created": 1721984496,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lf10e2k",
              "score": 13,
              "body": "Dude seriously fuck you with your logic. Reading the OP I felt like I was on the edge of some newfound insider Intel and was excited to actually start buying some more puts.... but you just flipped that all upside down with your dumb dumb dummy logic.\n\nNo fair ![img](emote|t5_2th52|27421)![img](emote|t5_2th52|27421)![img](emote|t5_2th52|27421)",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf10e2k/",
              "created": 1721999073,
              "depth": 2,
              "replies": [
                {
                  "id": "lf1d8dj",
                  "score": 9,
                  "body": ">Reading the OP I felt like I was on the edge of some newfound insider Intel\n\nIronically this emotional level of engagement is exactly what facebook desires the most from you.",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf1d8dj/",
                  "created": 1722003747,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lezzrmi",
              "score": 18,
              "body": "also Temu and other shit like that drive CPC crazy high everywhere. and yup. bullish for Meta",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezzrmi/",
              "created": 1721978433,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lezvbnk",
              "score": 4,
              "body": "I myself rely heavily on ads for my business. It's the same situation in Europe too unfortunately...",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezvbnk/",
              "created": 1721975611,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lf00u3p",
          "score": 15,
          "body": "But it's highly biased. I too look at FB and think \"who the fuck uses this crap anymore?\" But then I see Meta stats and earnings.  \n\nIt's easy to be biased on these things, but the reality is that billions of people still use this shit and generate insane amounts of revenue.",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf00u3p/",
          "created": 1721979138,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf0nmnr",
          "score": 10,
          "body": "I counted the other day. 44 posts of pages and people I don’t know before I got a real post off a Facebook friend, then another 40 ads and follows.\n\nI went and added 30 friends as favorites and now it seems better, but it was insanely bad.",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0nmnr/",
          "created": 1721993432,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lezvsvc",
          "score": 16,
          "body": "My feeds are literally filled with “please donate to this kid (picture of kid with random illness which disfigures the kid)” kind of post",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezvsvc/",
          "created": 1721975912,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf072tr",
          "score": 6,
          "body": "Same.  I was just thinking the other day FB has gone down the same road as MTV.",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf072tr/",
          "created": 1721983329,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf0urf9",
          "score": 3,
          "body": "It really is, it's just a whole shitty feed of ads and ragebait and whatever else the algorithm spits at you. Totally pointless.",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0urf9/",
          "created": 1721996749,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf19z42",
          "score": 4,
          "body": "I used to scroll it occasionally to keep up with family / friends. I don't even bother now. There's just no reason to open the app.",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf19z42/",
          "created": 1722002619,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leyt0px",
      "score": 1425,
      "body": "Big picture is that $4M/year still goes into Facebook’s pockets and you have nowhere else to go but spend more",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leyt0px/",
      "created": 1721957151,
      "depth": 0,
      "replies": [
        {
          "id": "lez56hp",
          "score": 37,
          "body": "I also bought $33k of META last week so don’t listen to me lol.",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez56hp/",
          "created": 1721962141,
          "depth": 1,
          "replies": [
            {
              "id": "lezhcg0",
              "score": 9,
              "body": "So, what happened with your $33k investment in META?",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezhcg0/",
              "created": 1721967766,
              "depth": 2,
              "replies": [
                {
                  "id": "lezhl7h",
                  "score": 14,
                  "body": "I’m holding so not much yet, but I think long term zuck will figure it out",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezhl7h/",
                  "created": 1721967887,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lezi19m",
                      "score": 13,
                      "body": "> but I think long term zuck will figure it out\n\nHave you seen Zuck lately? He's more concerned about looking like an MMA bro.",
                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezi19m/",
                      "created": 1721968116,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "leztabp",
                          "score": 6,
                          "body": "More like a frat boy",
                          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leztabp/",
                          "created": 1721974363,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lez531s",
          "score": 365,
          "body": "But he’s probably spending less now.  I spend $1M a year and we’ve slowed our campaigns a ton on FB.  We’re moving spend to YouTube Ads.",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez531s/",
          "created": 1721962100,
          "depth": 1,
          "replies": [
            {
              "id": "lezgkk2",
              "score": 95,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezgkk2/",
              "created": 1721967379,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lezp5ps",
              "score": 101,
              "body": "I installed a YouTube ad blocker just because of guys like you",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezp5ps/",
              "created": 1721971942,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lez5zvf",
              "score": 127,
              "body": "You’re moving your Meta DR spend to YouTube?  That’s a wild choice.",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez5zvf/",
              "created": 1721962488,
              "depth": 2,
              "replies": [
                {
                  "id": "lez6f4x",
                  "score": 32,
                  "body": "I mean, only if we can scale. Right now we’re breaking even, but it’s getting better. We’re spending the time we used to focus on Facebook ads to try to crack the code for YouTube..",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez6f4x/",
                  "created": 1721962671,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lez6ipn",
                      "score": 71,
                      "body": "There is no DR code for YouTube. It’s not a platform for lower funnel. Best of luck.",
                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez6ipn/",
                      "created": 1721962714,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lez6ogs",
                          "score": 35,
                          "body": "Super wide traffic. Need super wide offer.  I’ve got a couple friends that do well there.",
                          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez6ogs/",
                          "created": 1721962783,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lez76ns",
                              "score": 35,
                              "body": "Surprising. I spend somewhere between $30-40M on YouTube alone and have not driven that much in downstream outcomes for my clients",
                              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez76ns/",
                              "created": 1721963005,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lezeh5d",
                                  "score": 269,
                                  "body": "What on earth are you people? I thought this sub was full of degenerates not owners of businesses that spend 7-8 figures on Facebook ads!",
                                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezeh5d/",
                                  "created": 1721966355,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lezs777",
                                      "score": 74,
                                      "body": "They *work* at big companies doesn't mean they themselves are big (they could be who knows), I myself work *at* a multi billion corporation and could word a paragraph like they did",
                                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezs777/",
                                      "created": 1721973708,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lf15n1t",
                                          "score": 8,
                                          "body": "Doesn't even have to be a big agency, I work at a small agency and we spend 12M+ per year on Meta. I also agree with OP sentiments but still bullish.",
                                          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf15n1t/",
                                          "created": 1722001078,
                                          "depth": 9,
                                          "replies": []
                                        },
                                        {
                                          "id": "lf0ao0w",
                                          "score": 34,
                                          "body": "Or they're just straight up lying",
                                          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0ao0w/",
                                          "created": 1721985744,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "lezj5lk",
                                      "score": 127,
                                      "body": "Lots of business owners are also degenerates. Have you never worked for someone before?",
                                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezj5lk/",
                                      "created": 1721968692,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lezmyus",
                                          "score": 71,
                                          "body": "Bro, most people here have never worked period.",
                                          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezmyus/",
                                          "created": 1721970713,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "lf0blm5",
                                      "score": 22,
                                      "body": "I spent $2 trillion trying to occupy and invest in a central Asian country that will be unnamed. My ROI has been so bad I’m thinking I should just cut my losses and go into the Eastern European markets. Positions below.",
                                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0blm5/",
                                      "created": 1721986366,
                                      "depth": 8,
                                      "replies": []
                                    },
                                    {
                                      "id": "lezekzx",
                                      "score": 37,
                                      "body": "Beep boop beeep bop",
                                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezekzx/",
                                      "created": 1721966406,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lezlrr9",
                                          "score": 24,
                                          "body": "I knew it…another AI reach around thread.",
                                          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezlrr9/",
                                          "created": 1721970062,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "lf01ajg",
                                      "score": 17,
                                      "body": "Cmon brah, I yolo 0dte QQQ and then put that money into my flower business. Generated 100M last year through internet sales. Mostly dudes that want to send flowers to some OF model on other continent. If you’re not scaling what are you doing brah",
                                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf01ajg/",
                                      "created": 1721979441,
                                      "depth": 8,
                                      "replies": []
                                    },
                                    {
                                      "id": "lezvukf",
                                      "score": 26,
                                      "body": "dasdasd asdasd",
                                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezvukf/",
                                      "created": 1721975942,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "lezn34j",
                                  "score": 37,
                                  "body": "[deleted]",
                                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezn34j/",
                                  "created": 1721970780,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lezndxg",
                                      "score": 11,
                                      "body": "You must be the “He Gets Us” guy",
                                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezndxg/",
                                      "created": 1721970944,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "lezksxw",
                                  "score": 13,
                                  "body": "Damn bro… I can barely make my payment for YouTube premium every month lol.",
                                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezksxw/",
                                  "created": 1721969547,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lezf0uk",
                      "score": 10,
                      "body": "YouTube is an awareness tactic 99% of the time. Facebook can be awareness if you’re strictly trying to prospect, but most people are going to have Advantage+ included and that’s closer to Search than YouTube. The key is to figure out what purchases are incremental. Were they going to purchase anyway, regardless of whether they saw an ad? There are plenty of companies that can help you determine that and the savings from media efficiencies will easily cover the cost.",
                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezf0uk/",
                      "created": 1721966621,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lezbkey",
              "score": 19,
              "body": "calling bs.\n\ni work in ads.",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezbkey/",
              "created": 1721964983,
              "depth": 2,
              "replies": [
                {
                  "id": "lezsmp2",
                  "score": 19,
                  "body": "but I spend 20 million on ads every year",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezsmp2/",
                  "created": 1721973966,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lf18p9d",
                      "score": 10,
                      "body": "Me? I spend 100m in ads everyday. ",
                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf18p9d/",
                      "created": 1722002172,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lf1cys0",
                          "score": 4,
                          "body": "i spend a bajillion on ads per second and my dad could beat up ur dad",
                          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf1cys0/",
                          "created": 1722003655,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lezenuk",
          "score": 35,
          "body": "YOY we've spent 25% less than last year. I fully agree, there's nowhere else to go, no other platform provides any scale that comes close to facebook. So what's happening is most brands I know are just down on the year and spending less money because they can't get the results they used to. \n\nThis is by no means a post that META is dead or dying, I think long term META is still a great buy. I think we could see it take an absolute shit over the next 30 days though.",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezenuk/",
          "created": 1721966444,
          "depth": 1,
          "replies": [
            {
              "id": "lf0vmk9",
              "score": 25,
              "body": "No worries trump n harris about to drop a billion each on facebook ads.",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0vmk9/",
              "created": 1721997125,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lez7vak",
          "score": 17,
          "body": "Yeah I was looking for where OP says he reallocated funds, and it never came up. Bullish.",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez7vak/",
          "created": 1721963307,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lezgmvj",
          "score": 17,
          "body": "Haha my company was spending 1m a month on fb ads in 2013. My thoughts were similar when fb wasn't as great compared to google n others. I told everyone fb is gonna fail. Nothing happened, and in fact fb grew to be as big as Google ads over the years.\nThey have more funds than anyone on earth to throw at any tech issues and get the best minds to bring more ad revenues",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezgmvj/",
          "created": 1721967411,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lez8st7",
          "score": 15,
          "body": "IMHO there is somewhere to go yes, nowadays there are more options than a couple of years ago.  \n   \nConversion rates from META products have dropped while CRs from Chinese social media apps are growing and they are allowing more people to advertise there.  \n  \nHowever OP is not completely accurate when stating 100% of META revenue comes from Ads.   \ne.g.: there is huge growing demand for their now META hosted WhatsApp Cloud API, which charges per convo. \n\n2cents",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez8st7/",
          "created": 1721963724,
          "depth": 1,
          "replies": [
            {
              "id": "lezbc4d",
              "score": 5,
              "body": "Yea, but it's not the only option in the market. Companies are making their own and its not even that complicated to get one spun up and trained using some of the models available including the one from meta\n\n\n\nI listened to the regard from Meta being interviewed today, and A. they are not charging medium to small enterprises to use that watsapp chat function B. They are desperately trying to break ground into the US with watsapp which is not very popular. They have spent a lot of money advertising it everywhere and it's not gaining traction here.",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezbc4d/",
              "created": 1721964876,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lez4b08",
      "score": 316,
      "body": "285 put ☠️ if this print I will come clean your store 😂",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez4b08/",
      "created": 1721961769,
      "depth": 0,
      "replies": [
        {
          "id": "lezi1z8",
          "score": 119,
          "body": "That's my 100x lotto lol, fully don't expect it to hit but I like to gamble.  \\~45% drop and it'll basically 100x. I just want to have something in play if things get ugly. The last time meta had weakening ad performance (iOS14.5) combined with overspending on new tech (metaverse) the stock slipped like 40% over a month.",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezi1z8/",
          "created": 1721968126,
          "depth": 1,
          "replies": [
            {
              "id": "lf0isvo",
              "score": 219,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0isvo/",
              "created": 1721990860,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lf1ttva",
              "score": 9,
              "body": "45% drop LOL. I love bears.",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf1ttva/",
              "created": 1722009187,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lez8umg",
          "score": 43,
          "body": "Not sure how you can clean a digital storefront — maybe you can start with cleaning his toilets at his mansion?",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez8umg/",
          "created": 1721963746,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lezhwby",
      "score": 161,
      "body": "Miss DD like this with some type of basis behind it reminds me of old WSB ![img](emote|t5_2th52|4260)",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezhwby/",
      "created": 1721968044,
      "depth": 0,
      "replies": [
        {
          "id": "lf0l2ke",
          "score": 38,
          "body": "110% with you. Just shitmemes nowadays. No actually DD or 'semi'-DD",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0l2ke/",
          "created": 1721992102,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lezi3xf",
      "score": 69,
      "body": "Not nearly as much, but I spend around 200k per year on Facebook ads for my business and our revenue is also down around 30%… tried everything and it just seems like ad effectiveness has fallen off steeply",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezi3xf/",
      "created": 1721968154,
      "depth": 0,
      "replies": [
        {
          "id": "lf0jy6u",
          "score": 24,
          "body": "Apple made everybody's ads worse (except their own of course), but the real question is whose ads got worse the least?",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0jy6u/",
          "created": 1721991494,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf101ux",
          "score": 6,
          "body": "What makes you think it’s ad effectiveness vs inflation causing people to cut back on spending?",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf101ux/",
          "created": 1721998937,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leywbhx",
      "score": 89,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leywbhx/",
      "created": 1721958492,
      "depth": 0,
      "replies": [
        {
          "id": "lezi9r4",
          "score": 65,
          "body": "You mean to tell me that people struggling to pay the rent might be getting tired of buying useless shit?",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezi9r4/",
          "created": 1721968235,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lezblgl",
      "score": 75,
      "body": "Today meta research released their paper on finetuning free personalized image generation: https://ai.meta.com/research/publications/imagine-yourself-tuning-free-personalized-image-generation/\n\nYou may think AI has nothing to do with ads, but just wait until they show you a personalized ad of yourself behind a garbage dumpster at your local Wendy's....",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezblgl/",
      "created": 1721964996,
      "depth": 0,
      "replies": [
        {
          "id": "lezv8r0",
          "score": 13,
          "body": "Why imagine with AI when we can take selfies",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezv8r0/",
          "created": 1721975559,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lezgg6z",
      "score": 76,
      "body": "Dude it’s not just Facebook ads. I work in retail, overseeing marketing for like like 10 global & diverse market segments million dollar companies and their retail network in US & Canada…. Sales are astronomically down across the board. Retailers are going bankrupt and closing physical (& digital) stores. They can’t make ends meet, no one is buying shit right now. Your ads won’t solve this though I agree that meta is bologna.",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezgg6z/",
      "created": 1721967319,
      "depth": 0,
      "replies": [
        {
          "id": "lezjc7l",
          "score": 27,
          "body": "Hundred percent. It's not just facebook. The market doesn't reflect reality right now and its going to show itself in different ways. Facebook is just the one massive company that I have some insight into.",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezjc7l/",
          "created": 1721968787,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf0606p",
          "score": 9,
          "body": "Yeah this is what higher interest rates do, it’s like pulling the parking break on the economy. I think we are still a few quarters out from it truly reflecting though",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0606p/",
          "created": 1721982602,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leytaw8",
      "score": 95,
      "body": "Checks out, small businesses are dropping out of Meta ads left and right, but will it be reflected in this earnings call, or the next?",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leytaw8/",
      "created": 1721957265,
      "depth": 0,
      "replies": [
        {
          "id": "lez9ak7",
          "score": 56,
          "body": "Ain’t they just dropping out because the cost has going way up because of Chinese companies like Temu pushing up the prices?",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez9ak7/",
          "created": 1721963944,
          "depth": 1,
          "replies": [
            {
              "id": "lezfx5y",
              "score": 74,
              "body": "This is the main argument against my thesis. I don't know how the increase in Chinese spend relates proportionally to the decrease in US based business spend. That being said, what's happening is not necessarily an increase in cost as it is a decrease in efficiency. CPMs are generally the same, CPC is generally the same, but the amount of traffic that converts on your website is down significantly. If Temu was pushing the prices up, you'd see it in increased CPMs, not decreased traffic efficiency. There's two things converging rn, meta has been dealing with less and less data/signals to use for targeting while also pushing tons of updates to the algo creating a general drop in efficiency of targeting, and the consumer wallet is also weakening.",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezfx5y/",
              "created": 1721967060,
              "depth": 2,
              "replies": [
                {
                  "id": "lezww66",
                  "score": 19,
                  "body": "This should have been in your opening post. This is the first question that came to my mind - have the CPMs changed.",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezww66/",
                  "created": 1721976592,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lezkcqv",
                  "score": 13,
                  "body": "UPS said that SHEIN and Temu shipping 300,000 packages per day to USA. So I'm sure they are spending huge.",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezkcqv/",
                  "created": 1721969311,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lezmifq",
                  "score": 16,
                  "body": "Or maybe you’ve saturated the audience you’ve targeted?  Not enough info about your campaigns to know. Best of luck",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezmifq/",
                  "created": 1721970465,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lezb1il",
          "score": 5,
          "body": "Meta never cared much for true SB advertising anyways, you can’t even get an account exec unless you spend into the 7 figures",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezb1il/",
          "created": 1721964739,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leyjy6s",
      "score": 203,
      "body": "Can’t cuck the zuck man. Especially not these days",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leyjy6s/",
      "created": 1721953520,
      "depth": 0,
      "replies": [
        {
          "id": "lez8xq5",
          "score": 48,
          "body": "Zuck will over spend on capital allocation to AI and have nothing to show for it.  This AI revolution is coming but it aint going to justify the.crazy spend.",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez8xq5/",
          "created": 1721963784,
          "depth": 1,
          "replies": [
            {
              "id": "lezbpwf",
              "score": 22,
              "body": "You haven't seen AI personalized ads yet, my friend. https://ai.meta.com/research/publications/imagine-yourself-tuning-free-personalized-image-generation/",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezbpwf/",
              "created": 1721965052,
              "depth": 2,
              "replies": [
                {
                  "id": "lezgdlm",
                  "score": 24,
                  "body": "Just imagine your mom telling you that you need to buy new clothes…",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezgdlm/",
                  "created": 1721967283,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "leztval",
                      "score": 27,
                      "body": "Just imagine seeing lingerie ads for your mom...",
                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leztval/",
                      "created": 1721974714,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lf04cyi",
                      "score": 9,
                      "body": "I want all of my ads to show Zuckerberg holding the product, with a complete lack of enthusiasm",
                      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf04cyi/",
                      "created": 1721981489,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lezf3hx",
          "score": 30,
          "body": "I think delivered my thesis incorrectly. I believe META is an absolute beast of a company, and will be worth multi trillions. That being said, Zuck has cucked the stock before and I'm telling you it's about to happen again. AI spending like crazy while their main profit producing product has been shitting the bed all year and no one outside of our industry is talking about it.",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezf3hx/",
          "created": 1721966658,
          "depth": 1,
          "replies": [
            {
              "id": "lf01qu1",
              "score": 6,
              "body": "did you see the election cycle argument? do you thinks that's what you're noticing?",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf01qu1/",
              "created": 1721979743,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lf0ay5a",
              "score": 12,
              "body": "Meta ad revenue grew 27% YOY. you are talking out of your ass",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0ay5a/",
              "created": 1721985930,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lf01k55",
          "score": 5,
          "body": "We can’t forget there’s an election in November. The Dems + GOP are about to pour billions into Meta",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf01k55/",
          "created": 1721979620,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leypa08",
      "score": 131,
      "body": "Facebook is building multiple million square foot buildings in Dekalb il .. I thought the goal was 3…. They’ve moved onto more. They literally have their own substations (power grid) main city water lines directed to them… this will be in the billions costs wise…… just saying",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leypa08/",
      "created": 1721955633,
      "depth": 0,
      "replies": [
        {
          "id": "leyscm0",
          "score": 25,
          "body": "I’m thinking of applying there.",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leyscm0/",
          "created": 1721956880,
          "depth": 1,
          "replies": [
            {
              "id": "leyue2g",
              "score": 21,
              "body": "To the construction aspect? Might keep ya busy for a little bit but I’ve heard once they’re complete ( which they continue to expand) it’ll be maybe 50 employees. If you can be a part of the long term crew or security, you’re probably good to go in terms of a career",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leyue2g/",
              "created": 1721957709,
              "depth": 2,
              "replies": [
                {
                  "id": "lez4xlt",
                  "score": 11,
                  "body": "It's union labor",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez4xlt/",
                  "created": 1721962036,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lezhfs2",
      "score": 16,
      "body": "Zuck and Jensen Huang from Nvidia will be appearing together this Monday to discuss the future of AI - 2 days prior to earnings. Google had good earnings but talk about overspending Capex  on AI caused it tank.  Zuck / Huang presentation will be streamed live here [https://www.youtube.com/watch?v=H0WxJ7caZQU](https://www.youtube.com/watch?v=H0WxJ7caZQU)",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezhfs2/",
      "created": 1721967811,
      "depth": 0,
      "replies": [
        {
          "id": "lezvp6g",
          "score": 4,
          "body": "![img](emote|t5_2th52|27189)",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezvp6g/",
          "created": 1721975847,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lezr12z",
      "score": 16,
      "body": "Interesting info. But there needs to be a catalyst for people to be routed and panic sell.\n\nWe're in correction mode now on the NASDAQ. \n\nFacebook who also owns instagram and WhatsApp are pretty much integral to people's lives. It's hard to see this changing. \n\nYou put a ton of money into Facebook advertising, and I guess many other businesses too. If you don't put into Facebook, where else would you advertise your business?\n\nThere are only a few places for people to \"gather.\" Facebook, Instagram, Tik Tok. People don't gather on Amazon or Snapchat to watch people park badly or to get their cute cat or dog daily  fix. People don't gather on Google. Or on any platform as far as I know. OK I left out Reddit, but it isn't quite the same.\n\nI think many other online businesses don't have much choice but to keep pumping money into online ads. Yes more Temu, more Shein, more Ebay adds.\n\nWhen I doom scroll instagram, I see so many video shorts about how you can join up to make lambo money by investing property, subletting remotely airB&B, use A.I to make faceless videos with a few clicks, there must be a lot of people that still have faith in instagram because why wouldn't they go straight to Tik Tok?\n\nInstagram is quite clever because they always put the most controversial comment to the content at the top so you are more likely to engage. For example, say it is a video about Veganism, the Carnivore comment rises to the top.\n\nThe only way these social media platforms will die is if something better came along. Or we start rejecting them because it is turning our society to shit.\n\n...\n\nFacebook has a neckline of $400. Is this support? This is my only technical analysis.\n\nRemindme! In 6 months",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezr12z/",
      "created": 1721973021,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leztznf",
      "score": 16,
      "body": "I wouldn't expect serious analysis or useful feedback here, they're all under 20 and work at Wendy's.\n\n\n\nFWIW i started and ran an ecom business for nearly 15 years from 2005 (ie pre FB). It was a very different world but social and google ads never worked for us. It's a money churning treadmill that just makes mega cap tech richer and you beholden to them. I don't imagine that has changed.\n\n\n\nGoogle ads particularly were ridiculous. Their algo meant the ads didn't even break even til you were spending 25k a week and above that a good roi was like 5%. That was basically 80% of our turnover at that point. It was for us a black hole that we stayed out of (we had our own content business anyway and back then you had a lot more alternatives for advertising, particularly in our niche: sponsoring athletes, comps etc). It was also obviously bullshit as the roi was effectively decided by Google's algo which was entirely in their control. They simply played you against your competitors and arbed away everyone's profit.\n\n\n\nWe had a compeitor who relied entirely on google ads and was turning over 50x what we were but making less (usually negative) profit. Tiny changes in Google's algos had massive effects on their business and a really big change was nearly an extinction level event (they did eventually go bust though for other reasons). We decided to stay small and highly profitable: it was less work and more money.\n\n\n\nI can't imagine running that kind of business now. Our edge was that we had a lot of IT experience in house and managed and built the infrastructure and software ourselves (the only ecom package available when we started was OScommerce and it was dog shit and AWS etc didn't exist). This kept costs minimal and control and margins high. This isn't possible anymore. I don't know what they charge but Shopify alone is miles better than what we had and it's practically impossible to avoid running in the cloud (despite it being much cheaper not to do so) simply because it's impossible to find devs and sysadmins who can and want to do that and they anyway only want to work for megacap tech and expect C-suite level salaries straight out of college. Where's the profit?\n\n\n\nI digress, but to my eyes their competitive bidding models were always going to bump up against a ceiling because there is only so much profit to leech and it's highly dependent on economic conditions. Meta have never been through a real recession, they're going to get a massive shock when it does happen: ad agencies are usually the first to go.\n\n\n(Another digression/prophecy: most companies have lost any handle on IT costs and the salaries they're paying aren't sustainable. When a real recession comes there's going to be a huge pull back and megacap tech is going to suffer badly as are their employees).",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leztznf/",
      "created": 1721974787,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leywmkx",
      "score": 47,
      "body": "Marketplace used to be so good, I was making almost 10k/month back in 2020-22 only to blow it away on 0dtes",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leywmkx/",
      "created": 1721958616,
      "depth": 0,
      "replies": [
        {
          "id": "lezjvxv",
          "score": 11,
          "body": "Doing what?",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezjvxv/",
          "created": 1721969071,
          "depth": 1,
          "replies": [
            {
              "id": "lezy9hp",
              "score": 11,
              "body": "I would assume dropshipping",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezy9hp/",
              "created": 1721977457,
              "depth": 2,
              "replies": [
                {
                  "id": "lf0tmrw",
                  "score": 24,
                  "body": "The very thing that made it stop being good",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0tmrw/",
                  "created": 1721996251,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "leyve33",
      "score": 53,
      "body": "You know what, this is actually the kind of posts that ends up making money. I’m jumping ships.",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leyve33/",
      "created": 1721958118,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfvbphn",
      "score": 12,
      "body": "Told you to inverse this bozo",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfvbphn/",
      "created": 1722457540,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lez7w1a",
      "score": 11,
      "body": "Only use FB for Marketplace. Only for that. But inflation has hit the Marketplace too.",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez7w1a/",
      "created": 1721963316,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfvf7im",
      "score": 9,
      "body": "You just got Zucked",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfvf7im/",
      "created": 1722458649,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfxuck8",
      "score": 10,
      "body": "Where is that dude that betted against him with 30k calls?",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfxuck8/",
      "created": 1722495266,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leyylc8",
      "score": 43,
      "body": "To all the folks saying “oh you spend 9 million on ads but your 18k position is weak”….. \n\nnone of you have ever done marketing. You can spend an ungodly amount of money on testing especially at that scale. It takes many many many many L’s before you find some winners. Then when you do find a winner and you scale it up big your ROI can quickly tank. \n\nAlso there’s a huge difference between money in the business and personal cash to play with. 15 or 18k ain’t peanuts.",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leyylc8/",
      "created": 1721959409,
      "depth": 0,
      "replies": [
        {
          "id": "leziaa1",
          "score": 23,
          "body": "Lmao thank you. Zuck takes home 10-20x more than me annually. And even what I \"take home\" aka net income that I have to pay taxes on, half stays in the business to reinvest in growing our inventory, the other half pays taxes. I have a mil in retained earnings, but people don't understand how hard it is to get that cash out, especially when meta is shitting the bed.",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leziaa1/",
          "created": 1721968243,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lezjhen",
          "score": 8,
          "body": "Its not peanut but its not a lot of money either. It is one thing to spend 9 million on ads, but another to be founder of a company that could expense 9 millions in ads spending. That firm will clear 50m+ a year easy",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezjhen/",
          "created": 1721968861,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "leywyqq",
      "score": 32,
      "body": "The fact that most in here are doubting you makes me much more interested in this play. Might take a stab at it with a small position",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leywyqq/",
      "created": 1721958752,
      "depth": 0,
      "replies": [
        {
          "id": "lezi6tj",
          "score": 15,
          "body": "Seriously, usually its the posts that make no sense, but if the wsb comment section is the one yammering OP may have something",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezi6tj/",
          "created": 1721968194,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lez1liw",
      "score": 19,
      "body": "Are you going to stop doing Meta Ads? Is there any platform with a similar diverse audience and ROAS (I guess TikTok works if you have a young target audience).\n\nMy anecdotal evidence from working at a large company is that: Google Ads and/or Meta Ads are still a most and put first in any (online) campaign.\n\nI would assume any of the campaign managers for the political parties that were in elections this year around the globe think the same.",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez1liw/",
      "created": 1721960636,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leztikr",
      "score": 20,
      "body": "Just wait until Zuck announces ads on WhatsApp during the earnings call and the stock goes through the roof",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leztikr/",
      "created": 1721974503,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfvcmwz",
      "score": 9,
      "body": "Oops?",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfvcmwz/",
      "created": 1722457835,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfvhh6q",
      "score": 8,
      "body": "Wow I'm glad I just stared at the options and decided \"nah\" lmao",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfvhh6q/",
      "created": 1722459368,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfvb6yh",
      "score": 7,
      "body": "Bro is cooked",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfvb6yh/",
      "created": 1722457378,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfvw922",
      "score": 7,
      "body": "GUH",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfvw922/",
      "created": 1722464352,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezepj2",
      "score": 30,
      "body": "Who the fuck is still actually using Facebook though?",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezepj2/",
      "created": 1721966468,
      "depth": 0,
      "replies": [
        {
          "id": "lezkvmr",
          "score": 34,
          "body": "It's not only Facebook. It's instagram ads too",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezkvmr/",
          "created": 1721969586,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lezm0es",
          "score": 26,
          "body": "My grandma.. she dead tho",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezm0es/",
          "created": 1721970190,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lezo8wh",
          "score": 6,
          "body": "![img](emote|t5_2th52|27189)",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezo8wh/",
          "created": 1721971424,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf016t1",
      "score": 5,
      "body": "I’m getting sick and tired of YouTube ads , like 3-4 ads in a 6 min video . I remember it was only one 5 sec ad in the beginning of every video",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf016t1/",
      "created": 1721979372,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0u9z0",
      "score": 5,
      "body": "You give Meta $4m a year in revenue. Go long. Got it 👍",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0u9z0/",
      "created": 1721996536,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfvb3r3",
      "score": 5,
      "body": "welp, got rocked lol",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfvb3r3/",
      "created": 1722457350,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfvqvce",
      "score": 7,
      "body": "Bye bye",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfvqvce/",
      "created": 1722462465,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfvtog0",
      "score": 6,
      "body": "See you at wendys",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfvtog0/",
      "created": 1722463439,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfz1jkc",
      "score": 4,
      "body": "How did this turn out 😂",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfz1jkc/",
      "created": 1722519134,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leyimto",
      "score": 23,
      "body": "Well, I admire the conviction. Just curious, if they beat and go to $500, is this money you can afford to lose? I.e. are you truly convinced this will net you solid gains or playing with fire for fun? Don't take this the wrong way but this dollar amount seems... nominal for someone claiming to own a business that spends $9m annually on marketing alone.\n\nI positively despise Meta and hope you're right. Trash, spyware company that only exists because they were first.\n\n!remindme 2 weeks",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leyimto/",
      "created": 1721953008,
      "depth": 0,
      "replies": [
        {
          "id": "lezhf82",
          "score": 15,
          "body": "This is money I can afford to lose. It's a total gamble, that's why I emphasized that its an anecdotal take, I don't actually know anything outside of my experience and my network. That being said, the tone around my networks filled with people also spending millions a year on facebook is completely different than that of facebook stock analysts. The customers of the core product are suffering and spending less than last year.\n\nAlso, I spend 10x more on ads annually than I take home. Zuck is the real winner in my business lol. Last year profit ended up around 400k. But its an inventory based business that I started with 10k and slowly have scaled up. Pretty much all profit goes back into the business/scaling inventory. But just because I don't take the money out doesnt mean I don't have to pay taxes. So on that 400k, I can maybe afford to take out 200k, then end up with a 180k tax bill lmao.",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezhf82/",
          "created": 1721967803,
          "depth": 1,
          "replies": [
            {
              "id": "lf0zx2g",
              "score": 7,
              "body": "You need a better accountant. Seriously.",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0zx2g/",
              "created": 1721998884,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "leyxl0t",
          "score": 18,
          "body": "different connect political vegetable truck late chase muddle wasteful cows",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leyxl0t/",
          "created": 1721959001,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lezp40m",
      "score": 26,
      "body": "You show me a screenshot right now with $4m in META ad spend I quit my job right now and I work for you",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezp40m/",
      "created": 1721971915,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0nhea",
      "score": 5,
      "body": "Weird, our Facebook ads are performing better than ever before.",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0nhea/",
      "created": 1721993357,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0pi6e",
      "score": 5,
      "body": "Not one person mentioned that despite the feds definition of a recession, we are in a recession and average business and consumer has less money to spend on luxury items, thus advertising has less effect because you’re essentially advertising to a smaller audience. Advertising can’t work if there’s no one to buy the product. Puts it is",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0pi6e/",
      "created": 1721994352,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lft73fx",
      "score": 6,
      "body": "Checking in. How you doin with this play?",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lft73fx/",
      "created": 1722432906,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfv9yp6",
      "score": 6,
      "body": "you good?",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfv9yp6/",
      "created": 1722456988,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leznygj",
      "score": 14,
      "body": "Don’t forget meta is Instagram. Not a single mention.\n\nInstagram ads honestly impress me with how algorithmic they are.\n\n50% of the time it’s stuff I’m actually interested in.",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leznygj/",
      "created": 1721971263,
      "depth": 0,
      "replies": [
        {
          "id": "lezvmux",
          "score": 21,
          "body": "When I talk about running meta ads that includes instagram. In campaigns created through Meta’s ads manager platform your ads will be shown on both instagram and Facebook unless you manually turn one off.",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezvmux/",
          "created": 1721975807,
          "depth": 1,
          "replies": [
            {
              "id": "lezwdha",
              "score": 4,
              "body": "Gotcha. \n\nEither way betting against the Zuck is a bold move sir.",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezwdha/",
              "created": 1721976268,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lez3wt3",
      "score": 3,
      "body": "This is the kinda shit what needs to be in here. We have all seen how these algos play with creators, and here’s some hard data. Hope you make back that wasted money on Meta ads.",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez3wt3/",
      "created": 1721961601,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezqbdl",
      "score": 3,
      "body": "CRWD, google, NVDA and now META, sounds bout right, anyone can spare $1000?",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezqbdl/",
      "created": 1721972607,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf028fn",
      "score": 4,
      "body": "Ah I love a good yolo on earnings . Update us if you’re still alive after it.",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf028fn/",
      "created": 1721980065,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfx7b13",
      "score": 5,
      "body": "Well fuck … better luck next time",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfx7b13/",
      "created": 1722482611,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfy1ewb",
      "score": 4,
      "body": "This aged well",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfy1ewb/",
      "created": 1722500014,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leyuerz",
      "score": 8,
      "body": "Hedge with some calls at least",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leyuerz/",
      "created": 1721957718,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leyhwdu",
      "score": 102,
      "body": "Imagine claiming to spend 4m on ads and trying to make money with a 18k account. Sure buddy. ",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leyhwdu/",
      "created": 1721952724,
      "depth": 0,
      "replies": [
        {
          "id": "leyih13",
          "score": 188,
          "body": "OP has a day job and trades for a fun. I don’t see why everyone on this board has to go full regarded.",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leyih13/",
          "created": 1721952946,
          "depth": 1,
          "replies": [
            {
              "id": "leyk42l",
              "score": 146,
              "body": "This is why OP has a business that spends 4m on advertising and oppositearugula makes posts asking what’s going in with peloton lol",
              "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leyk42l/",
              "created": 1721953583,
              "depth": 2,
              "replies": [
                {
                  "id": "leykzt1",
                  "score": 39,
                  "body": "Gotem.gif",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leykzt1/",
                  "created": 1721953928,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "leyuuux",
                  "score": 14,
                  "body": "![img](emote|t5_2th52|4271)",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leyuuux/",
                  "created": 1721957903,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lezacqh",
                  "score": 7,
                  "body": "Roasted",
                  "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezacqh/",
                  "created": 1721964424,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "leysi7a",
          "score": 9,
          "body": "Business and personal are different things",
          "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/leysi7a/",
          "created": 1721956944,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lez7ras",
      "score": 3,
      "body": "As a former FB user that was one most days of the week and now is on maybe once a month, OP’s observation makes sense.",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lez7ras/",
      "created": 1721963259,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezgu07",
      "score": 3,
      "body": "Calls it is",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezgu07/",
      "created": 1721967509,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezhbvk",
      "score": 3,
      "body": "Thank you. I will inverse this",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezhbvk/",
      "created": 1721967757,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezo7tn",
      "score": 3,
      "body": "You son of a bitch... I'm in!",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezo7tn/",
      "created": 1721971407,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezqsi5",
      "score": 3,
      "body": "This is actually an interesting thesis.",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lezqsi5/",
      "created": 1721972883,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf05noh",
      "score": 3,
      "body": "The AppTracking Transparency (ATT) issue created with iOS 14.5 has been largely solved through various user modelling techniques. If you go back to their Q1’23 earnings call they address the ATT issue specifically and call out their solve as the reason for their jump in ad revs. \n\nAnecdotally, (or perhaps not) I’m in the adtech biz and can tell you first-hand their CPAs are light years ahead of any of their competitors (YouTube, Twitch, Amazon, TTD, The Open Web). \n\nI would be surprised if they show any weakness in ad rev or guidance on their upcoming earnings call.  \n\nIn other words, time to load up on puts.",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf05noh/",
      "created": 1721982364,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0ibes",
      "score": 3,
      "body": "Facebook is trash now. I never see anything from \" friends\". It's all AI generated crap from pages I never followed.",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf0ibes/",
      "created": 1721990581,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf1ici5",
      "score": 3,
      "body": "How can a 285 put make you money?",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf1ici5/",
      "created": 1722005467,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf1t7uh",
      "score": 3,
      "body": "Nobody buys my products... it must be Meta's fault and has nothing to do with the fact that people are more conscious about their purchasing habits in this bidenomi... economic environment. \n\nAlso it went up for 20 months after it went down to 90 bucks a share. Think about it. One of the leading AI companies that is a literal cash printing machine went to 90 and like 10 P/E. Absolutely one of the craziest things I've ever seen in the stock market.",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf1t7uh/",
      "created": 1722008991,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf28ipl",
      "score": 3,
      "body": "This didn’t age very well",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf28ipl/",
      "created": 1722013928,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf35khx",
      "score": 3,
      "body": "> Straight up for like 20 months. Looks toppy as hell. \n\n Regard in full effect here.  It’s DOWN from 6 months ago… while s&p500 has gone up 10%",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf35khx/",
      "created": 1722024686,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf6kyvy",
      "score": 3,
      "body": "If Meta drop i’m loading the truck. People are crazy,this is a long term compounder with a Moat far harder to replicate than people think. Even if someone try,Meta will either copy it or buy the company..Same with Google.",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lf6kyvy/",
      "created": 1722085073,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfpvrdg",
      "score": 3,
      "body": "“That’s gambling you pussies.”",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfpvrdg/",
      "created": 1722376253,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfs2f8d",
      "score": 3,
      "body": "!RemindMe 37 hours",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfs2f8d/",
      "created": 1722410633,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfuike9",
      "score": 3,
      "body": "This is pure gambling and shouldn't be taken as wise advice.",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfuike9/",
      "created": 1722448364,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfx5mqf",
      "score": 3,
      "body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfx5mqf/",
      "created": 1722481864,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfxj7eo",
      "score": 3,
      "body": "hope you can still afford to buy those Facebook ads after losing your ass on those puts…",
      "permalink": "/r/wallstreetbets/comments/1eca49y/i_spend_4m_a_year_facebook_ads_and_im_shorting/lfxj7eo/",
      "created": 1722488506,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "The author is shorting Meta Platforms (META) based on concerns about the performance of its ads platform impacting earnings.",
    "companies": [
      "Meta Platforms",
      "Google"
    ],
    "tickers": [
      "META",
      "GOOGL"
    ],
    "main_ticker": [
      "META"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "The user discusses inefficiencies in the Facebook ads platform and is shorting META stock due to expected poor earnings performance.",
    "stock_recommendations": "The user is recommending to sell (short) META stock.",
    "is_recommending_stock_buying_or_selling": true,
    "buy_or_sell": "sell",
    "sentiment_summary": "There is negative sentiment as the user is betting against META stock, citing issues with the ads platform despite its AI investments.",
    "sentiment": "negative"
  }
}