{
  "title": "Am I the only one down 20% on stocks that I just purchased? ",
  "score": 235,
  "selftext": "Last week I thought that the typical dip is just going to be another dip but turns out to be an absolute nightmare. Talking about timing, I could easily be the worst timer of all time. Is my luck just bad? Btw its semicon stocks...",
  "link_flair_text": "Advice",
  "id": "1ecf1os",
  "num_comments": 371,
  "created_utc": 1721967343,
  "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/",
  "comments": [
    {
      "id": "lezi9zz",
      "score": 428,
      "body": "No, but most people won't tell you when they fuck up, but they'll brag when they get a win, even if they don't sell it the capture the gain.\n\nI do wonder though, what the heck did you buy to get in last week on weakness and be down 20%?  AMD?",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezi9zz/",
      "created": 1721968239,
      "depth": 0,
      "replies": [
        {
          "id": "lezkl8c",
          "score": 108,
          "body": "Yup :’(",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezkl8c/",
          "created": 1721969435,
          "depth": 1,
          "replies": [
            {
              "id": "lf01s60",
              "score": 67,
              "body": "AMD isn’t going anywhere.  Lisa is a beast CEO",
              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf01s60/",
              "created": 1721979767,
              "depth": 2,
              "replies": [
                {
                  "id": "lf0bgxi",
                  "score": 31,
                  "body": "I'm also hyperbullish on AMD. Might need another year or two but I'll take any chance to buy more",
                  "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0bgxi/",
                  "created": 1721986278,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lf0fk8c",
                  "score": 12,
                  "body": "that is true but doesn't make the stock a buy at 190$\nI own a lot of AMD but was evaluating selling a couple weeks ago,I didn't and now I'm sad (average price of my shares is 88)",
                  "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0fk8c/",
                  "created": 1721988915,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lf0fncm",
                      "score": 10,
                      "body": "Look at the bigger picture.  Let em cook for a few years.  There’s a lot more on the horizon with technology than what we are shown.",
                      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0fncm/",
                      "created": 1721988969,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lf0gxcn",
                          "score": 9,
                          "body": ">Let em cook for a few years\n\nI agree but still I wouldn't buy at 190 because in a few years there is a big chance I will be at net 0,I bought at 80 and it was a good call,I spent some days 2 weeks ago evaluating selling,I didn't and it was a mistake.  at today price is becoming interesting again and maybe I will buy some",
                          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0gxcn/",
                          "created": 1721989748,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lf1ujiq",
              "score": 9,
              "body": "I bought AMD when it originally peaked at 144/share at its ATH Nov 2021. It dropped into the 50s. Take the drops as an opportunity to lower your cost per share. AMD will be around.",
              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf1ujiq/",
              "created": 1722009414,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lezune4",
              "score": 25,
              "body": "Twinning!!! It’s been a rough week.",
              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezune4/",
              "created": 1721975186,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lezlvbz",
              "score": 9,
              "body": "Decide if you’re a swing trader or long term investor, or have a plan for both. This will help a lot",
              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezlvbz/",
              "created": 1721970115,
              "depth": 2,
              "replies": [
                {
                  "id": "lezvc4u",
                  "score": 7,
                  "body": " I just started trading and I believe I'm a swing trader and not a long term investor or a day trader.\n\nQuestion- is the only difference between a day trader and a swing trader the amount of time the stock is held before selling? day traders sell a stock the same day that it was purchased and swing traders hold it for at least 1 night? Is this correct ? Or are there other differences between a swing and day trader?",
                  "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezvc4u/",
                  "created": 1721975620,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lezx2dq",
                      "score": 4,
                      "body": "I’m relatively new myself. I googled the same questions basically. I like the buzz of swing trading myself, while also holding on for long term. Swing trading is middle ground that is less gambling, trim what you need/want etc. It’s basically selling when it’s up , then buying back in when it’s low. Could be days or weeks etc. day trading, such as forex and futures is some next level degenerate gambling that only a very small percentage of the world succeeds at. George Soros is the king of day trading, futures. He shorted Great Britain’s pound and made a billion dollars 😅.",
                      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezx2dq/",
                      "created": 1721976699,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lezy699",
                          "score": 4,
                          "body": "Ok thanks for the detailed explanation. My initial plan was to buy and hold stock for the long term but I don’t have the patience or stomach to do this . I tried and it’s demoralizing when your stock is up about 7-12 percent and you think about selling but you resist the temptation because you’re telling yourself that you’re in it for the long haul, then the stock dips back to your cost basis within a week . That happens to me with EVERY stock but 1 . \n\nI decided that I’d rather sell and capture the green while the opportunity presents itself. Buy and hold strategy not for me and the next level Degen stuff isn’t for me but sometimes I feel like I’m a day trader since I’m watching the tickers all day looking for an opportunity to sell if my stock stretches green",
                          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezy699/",
                          "created": 1721977399,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lf0cf61",
                          "score": 3,
                          "body": "Soros did not day trade mate. He made a calculated move to pressure a pegged currency so much that the the peg had to break, and made a billion. He also wasn’t the only one, lots of investors piled into the trade. He was just very vocal about it.",
                          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0cf61/",
                          "created": 1721986909,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lezxdb8",
                      "score": 3,
                      "body": "I think newbies like myself have the tendency to check our stocks every day and obsess over them. My portfolio looks like the wild Wild West some days with all my shorts, transfers, losses, gains, losses losses etc. it’s fun though. It will slow down and you’ll start to get used to having a longer term plan. And rewarding yourself along the way. It’s sorta like a diet!",
                      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezxdb8/",
                      "created": 1721976890,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lezyj98",
                          "score": 2,
                          "body": "I can’t help but watch my portfolio all day . I only purchase and sell individual stocks, my entire portfolio consists of about 5-7 in my portfolio . Not sure if this is healthy for me , I feel like it’s kind of getting addicting",
                          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezyj98/",
                          "created": 1721977632,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lf03gsx",
                              "score": 2,
                              "body": "it’s very addicting. it’s a lot healthier and intellectual than being on tik tok though. like the rest of the world. \nit’s like a new car, it’s fun and you wanna smell it and drive it so much, but at the end of the day, it’s a car. \nbest advice from one novice to another, is don’t let it consume you. don’t get into financial trouble or debt doing it. if you have money, spend it. that’s what moneys for. someone people wanna buy a house, someone might want to buy a small country island, others just might want to pay their netflix bill. find you",
                              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf03gsx/",
                              "created": 1721980894,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lf03w15",
                              "score": 2,
                              "body": "you can swing trade ETF’s too, it’s sort of fun being able to see all the companies that they hold. I would have a little goal though if youre starting off. especially if you’re young. savings rates are so good right now 5.50% that’s a nice little interest check at the end of each month too. HYSA. or if you’re ok with not needing the money anytime soon, the market is gunna be just fine. it always is. just don’t panic when you lose on red days. it’s normal. you don’t lose money unless you actually sell for a loss. you don’t make money unless you sell for a win. issue from a sale, we haven’t made or lost any money. it’s all just numbers and charts 😝",
                              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf03w15/",
                              "created": 1721981174,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lf0a2v2",
              "score": 3,
              "body": "i got it worse. i got AMDL..",
              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0a2v2/",
              "created": 1721985349,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lezzwn6",
              "score": 11,
              "body": "Keep throwing into AMD.  This isn't bad luck, it's a fire sale!",
              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezzwn6/",
              "created": 1721978526,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lf0yfov",
              "score": 4,
              "body": "AMD is known for their huge swings; Cost average down and hold for a while or cut your losses and take the tax write-off on your other gains.",
              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0yfov/",
              "created": 1721998293,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lezvvea",
          "score": 15,
          "body": "AMD Broadcom and TSM\n\nlmaoooo",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezvvea/",
          "created": 1721975956,
          "depth": 1,
          "replies": [
            {
              "id": "lezxbg5",
              "score": 3,
              "body": "Broadcom and TSM should recover quite quickly.\nAfter the split my average on Broadcom is $67 but it's one of my forever holds.",
              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezxbg5/",
              "created": 1721976858,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lf0aoeu",
          "score": 15,
          "body": "Yeah this 💯\n\nI lurk in a lot of stock forums and for months I have seen nothing but gain posts with hillariously overleveraged accounts (sometimes just straight up full port NVDA)\n\nNow after this small downturn there are just no posts, no loss porn anywhere except on WSB.\n\nUppity market - Gain posts\n\nDowny market - Silence",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0aoeu/",
          "created": 1721985751,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf0p2nx",
          "score": 10,
          "body": "Part of this phenomenon is that when people do admit to their losses/mistakes people love to jump on them and say things like \"how could you be so stupid? It was obviously overvalued. Well, hopefully you learned your lesson.\" Nothing like compounding your losses with being called stupid by people, right?\n\nWhereas when they make gain posts, they are often met with pats on the back. \n\nSo I think a lot of the silence is more just not wanting to get shit on by people.",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0p2nx/",
          "created": 1721994144,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lezvra8",
          "score": 9,
          "body": "Most if not all gamblers only boast about their winnings and hide their losses.",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezvra8/",
          "created": 1721975883,
          "depth": 1,
          "replies": [
            {
              "id": "lezy4r0",
              "score": 9,
              "body": "that's why I love r/wallstreetbets",
              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezy4r0/",
              "created": 1721977372,
              "depth": 2,
              "replies": [
                {
                  "id": "lf05tjl",
                  "score": 11,
                  "body": "I just don’t understand why everyone on there obsesses over options. Like honestly no one who isn’t an experienced trader should be messing around with complex options. Just buy shares.",
                  "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf05tjl/",
                  "created": 1721982475,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lf107pq",
                      "score": 8,
                      "body": "And shouldn't be wagering on Finnish hockey and Japanese basketball, either.\n\nBut alas.",
                      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf107pq/",
                      "created": 1721999002,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lf0w364",
          "score": 4,
          "body": "I was down 50% at one point 2 years ago and I didn’t say a word 😂",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0w364/",
          "created": 1721997324,
          "depth": 1,
          "replies": [
            {
              "id": "lf0zmsa",
              "score": 6,
              "body": "I've been trading now for 20 years.  The amount of times I've picked the wrong time to come into a stock... DCA is all I do now.",
              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0zmsa/",
              "created": 1721998770,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lezhogi",
      "score": 61,
      "body": "Certain sectors of the market have taken a hit as of late, but the good stocks on each sector usually break free of a downward trend after the nervous traders sell off. \n\nA change in the election and Last week's crowdstrike outage rattled a few cages and the dip kept dipping.  \n\nGive it time.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezhogi/",
      "created": 1721967933,
      "depth": 0,
      "replies": [
        {
          "id": "lezsqxu",
          "score": 11,
          "body": "kinda happened in April as well. earnings were good but the market just assumed things ran up too fast, and then 2 weeks later market was like \"oh I forgot earnings were good, let's go back to rallying\".",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezsqxu/",
          "created": 1721974038,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lezk1zd",
      "score": 44,
      "body": "If you zoom out, you may not even notice the dip.  \n  \nDon't buy a lot at the new high. Always leave some powder.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezk1zd/",
      "created": 1721969157,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezhfcu",
      "score": 56,
      "body": "Better than my LULU shares",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezhfcu/",
      "created": 1721967805,
      "depth": 0,
      "replies": [
        {
          "id": "lezt2f9",
          "score": 24,
          "body": "LULU is trading on the pre pandemic level",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezt2f9/",
          "created": 1721974229,
          "depth": 1,
          "replies": [
            {
              "id": "lf06d7k",
              "score": 8,
              "body": "Exactly. Way oversold unless we don’t know something",
              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf06d7k/",
              "created": 1721982851,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lezjkbn",
          "score": 17,
          "body": "lol same bought at 290 thinking I was getting a deal of a life time. Now getting wrecked",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezjkbn/",
          "created": 1721968903,
          "depth": 1,
          "replies": [
            {
              "id": "lf0vg4x",
              "score": 5,
              "body": "Can I ask what LULU was doing that you thought you were getting the deal of a lifetime?",
              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0vg4x/",
              "created": 1721997047,
              "depth": 2,
              "replies": [
                {
                  "id": "lf19ceb",
                  "score": 8,
                  "body": "2B in cash sitting on the balance sheet. \nVirtually no debt.\nReported a 10-11% increase in revenue in a time where other athletics companies are reporting negative earnings.\nStrong brand loyalty proven by their high ROIC.\nHave around 1.7B in buybacks active as of right now so if they can buy back cheap shares it’ll be a win-win over the long term. \nRan a DCF on them and I was getting around a 12% return over the next 10 years if they can just increase earnings at this same rate. \nMight be missing something but that was my bull case but obviously I was missing something.",
                  "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf19ceb/",
                  "created": 1722002399,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lf3wlc6",
                      "score": 5,
                      "body": "Thanks. You may not be missing anything. The market can be dumb at times and make no sense. I wasn’t aware of those numbers for LULU. I’d probably think they’d not be dropping too had I done any research.",
                      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf3wlc6/",
                      "created": 1722034214,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lf4211e",
                          "score": 2,
                          "body": "Honestly long term I think it’s a winner. It just has really bearish sentiment right now but it won’t last forever. Even on the 5y chart it’s rsi is VERY oversold so hope for a reversal",
                          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf4211e/",
                          "created": 1722036317,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lf0lxer",
          "score": 9,
          "body": "Lulu is so 2020. Been replaced by multiple brands that cost half as much. Good luck.",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0lxer/",
          "created": 1721992554,
          "depth": 1,
          "replies": [
            {
              "id": "lf0zlqa",
              "score": 4,
              "body": "If AnF can come back the way they did, so can Lulu. I'm not being either of those at the moment tho.",
              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0zlqa/",
              "created": 1721998759,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lezrtr3",
          "score": 3,
          "body": "You and me both brother\n\nI still find myself spending good $ there though",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezrtr3/",
          "created": 1721973488,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf0s4kk",
          "score": 2,
          "body": "You aren’t the only one hurting on lulu. I’m hurting bad",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0s4kk/",
          "created": 1721995577,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lezlfu6",
      "score": 70,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezlfu6/",
      "created": 1721969884,
      "depth": 0,
      "replies": [
        {
          "id": "leztk1y",
          "score": 22,
          "body": "It’s a good buy in the long run, but 468 was too high for its current value. You’ll be fine if you keep DCAing. Microsoft is my biggest winner.",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/leztk1y/",
          "created": 1721974528,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lezpwrf",
          "score": 6,
          "body": "21 n counting",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezpwrf/",
          "created": 1721972371,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lezv2p7",
          "score": 6,
          "body": "Same brother, got one order right below ath and then bought with a limitorder into the falling knife xD\nClassic for me tho. If it drops 10%more i gonna buy more, because fck it xD",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezv2p7/",
          "created": 1721975451,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lezsljo",
          "score": 10,
          "body": "That's not even bad... Microsoft is one of the best stocks for longterm",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezsljo/",
          "created": 1721973947,
          "depth": 1,
          "replies": []
        },
        {
          "id": "leztdxu",
          "score": 10,
          "body": "DCA isn’t doing it for two weeks or a month… it is years",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/leztdxu/",
          "created": 1721974424,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lezwhk2",
          "score": 2,
          "body": "same with apple...until it anounced 100 bilion buybacks :))",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezwhk2/",
          "created": 1721976338,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lezrx87",
      "score": 16,
      "body": "Semis will recover … just keep your head down and wait out the storm … Seems like every new stock I buy goes down at first before it starts going up - so pretty common I think. I bought SMCi about this time last year and it immediately went down 30%, bought some more on the dip … then waited a few months and in Jan-Feb it went up abt 300% … now its dipped abt 40% since March … waiting on the ride back up. If you are holding long, its part of the deal.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezrx87/",
      "created": 1721973545,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leztswj",
      "score": 13,
      "body": "We all are 😂",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/leztswj/",
      "created": 1721974673,
      "depth": 0,
      "replies": [
        {
          "id": "lezvivt",
          "score": 5,
          "body": "Yeah! High five! Or low five, I guess.",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezvivt/",
          "created": 1721975737,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lezisrk",
      "score": 24,
      "body": "I’m down a fair bit today after buying Nvidia and HE 🥲",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezisrk/",
      "created": 1721968507,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezr53k",
      "score": 22,
      "body": "During the pandemic I bought at the absolute peak and got wrecked for several years. Held everything and roared back this year. Just don’t touch it",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezr53k/",
      "created": 1721973088,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezqevv",
      "score": 8,
      "body": "I'm a new investor and lost because of my intended tech overlap. However all my investments are for long-term and I am safe/comfortable with losses like this.\n\nI feel the last month has been a wild ride for new investors in 2024 lol.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezqevv/",
      "created": 1721972664,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezij8l",
      "score": 8,
      "body": "Te buy high sell low. If you do this you are liquidity for those who want to buy cheaper. It is not about timing. Wait, add some shares in dca and forget.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezij8l/",
      "created": 1721968372,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezilc9",
      "score": 7,
      "body": "Same here. Didn’t even invest last week, but on fucking Tuesday. ",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezilc9/",
      "created": 1721968402,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezms82",
      "score": 30,
      "body": "AMD is a solid stock long term, don’t worry",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezms82/",
      "created": 1721970613,
      "depth": 0,
      "replies": [
        {
          "id": "lezpp6e",
          "score": 10,
          "body": "How so?",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezpp6e/",
          "created": 1721972249,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lezt5k8",
          "score": 7,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezt5k8/",
          "created": 1721974283,
          "depth": 1,
          "replies": [
            {
              "id": "leztorm",
              "score": 3,
              "body": "It took me three years of holding to profit from AMD, this stock has always been a bit wack in terms of volatility. I sold a bit at ATH and took the profit. Started to DVA again.",
              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/leztorm/",
              "created": 1721974606,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lezuc56",
              "score": 3,
              "body": "You're going to be in for a long emotional ride holding AMD. Brace your emotions. AMD v's it in the red 4 out of 5 days a week",
              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezuc56/",
              "created": 1721974995,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lezu2nl",
          "score": 7,
          "body": "what's so solid about it? It's already grown 1000 percent.\n\n  \nIt's the biggest manipulated money burning stock in the s and p, it literally plays with your emotions.",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezu2nl/",
          "created": 1721974837,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf42wcl",
          "score": 2,
          "body": "Just load up on SMH. It's been amazing so far.",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf42wcl/",
          "created": 1722036657,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lezptk8",
      "score": 6,
      "body": " No brother..25% here",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezptk8/",
      "created": 1721972319,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf06rab",
      "score": 6,
      "body": "Just wait, wake me up when September ends",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf06rab/",
      "created": 1721983113,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezo257",
      "score": 5,
      "body": "I go a bit heavy on tech portfolio. currently down 10% of my total invesment but I'm bullish on tech in the future so this ain't nothing to me and also if there's risk, there's profit 😉",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezo257/",
      "created": 1721971320,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0kujg",
      "score": 6,
      "body": "Purchased 12000 shares of rocket lab over the past 4 months and am up over 30% as of today.\n\nHave been buying AMD since 2018 and am up multiple 100% still.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0kujg/",
      "created": 1721991982,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf131hk",
      "score": 5,
      "body": "This dip is insane to be honest. It's over a 250 point on the S&P 500. Historically, it always returns and goes higher, but we were all likely feeling more optimistic the middle of the month.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf131hk/",
      "created": 1722000102,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf1gsuf",
      "score": 6,
      "body": "You don't lose anything as long as you don't sell.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf1gsuf/",
      "created": 1722004957,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf34o30",
      "score": 4,
      "body": "You’re learning that no one can reliably and consistently beat the market. Good luck!",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf34o30/",
      "created": 1722024387,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezo3cc",
      "score": 8,
      "body": "If you bought solid companies, you will be fine. Now time to buy and get your cost basis lower.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezo3cc/",
      "created": 1721971338,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezv3m8",
      "score": 7,
      "body": "I'm down like 15K in 2 weeks on SPX index funds lol.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezv3m8/",
      "created": 1721975467,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezuxbz",
      "score": 5,
      "body": "Ha! I'm only down 15%. Oh, this is hilarious. I'm so glad that I bought stocks, but I'm in a lot of pain. This is fine, I guess.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezuxbz/",
      "created": 1721975358,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezvee9",
      "score": 3,
      "body": "Just regularly DCA and sit on your hands. \n\nPanic selling is almost always the wrong move, especially during a time when the entire market is getting fisted.\n\nIt might be extremely depressing now, however, when everything quickly rebounds, you will laugh this off. \n\n(Take advantage of everything being cheaper now).",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezvee9/",
      "created": 1721975659,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezz3qx",
      "score": 6,
      "body": "I‘m still up 23% on VOO and 43% on QQQM. There is no risk of loss if you just leave your investments alone and do absolutely nothing. Don’t panic. Keep buying. In a few years you’ll be up and ahead and can stomach -10% … -20% easily. The key is to continuously stay invested for a long time.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezz3qx/",
      "created": 1721977998,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0352t",
      "score": 4,
      "body": "Sod’s Law. We had similar volatility in October ‘23 and April this year, and there’s no major macro event (like Covid) driving an extreme selloff, so my money is on a fairly swift bottom and then further upward movement. Just remember though that you can make up a 20% loss with a 25% gain, but a 50% loss requires a 100% gain. DCA where you are confident and sell if something has changed in the narrative. There’s also opportunity cost of clinging onto stocks out of stubbornness when you could reallocate the capital. No reason to panic after a week though. If AMD goes belly up then the world likely has bigger problems.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0352t/",
      "created": 1721980676,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf06azg",
      "score": 4,
      "body": "I’m down 9.78% currently because everything dropped",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf06azg/",
      "created": 1721982809,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf07ifc",
      "score": 4,
      "body": "I’d start by looking into value investing and picking companies, not stocks, that you can actually understand the underlying business. You know, the Warren Buffet, Ben Graham approach. And set your time horizons much longer when buying stocks so that 20% loss is more of a blip on the radar or a buying opportunity, if anything.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf07ifc/",
      "created": 1721983621,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf09oxx",
      "score": 5,
      "body": "lol you should see my options",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf09oxx/",
      "created": 1721985088,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0j1q1",
      "score": 4,
      "body": "I'm also down on AMD after buying $50k worth.  Here is hoping for a recovery.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0j1q1/",
      "created": 1721990998,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0zane",
      "score": 3,
      "body": "I bought Apple at like $205. It immediately went to $180 and stayed there. Sold after a few months and it went to $225.\n\nI bought TJX with the money so still a pretty good outcome. But yeah. I expect this happens to everyone at some point.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0zane/",
      "created": 1721998637,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf189u5",
      "score": 3,
      "body": "Sorry, I put money into TSM, NVO, LLY, NVDA, and whenever I do, the market goes down.  My fault",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf189u5/",
      "created": 1722002022,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf1rv0d",
      "score": 5,
      "body": "It’s been rough especially with NVDA and AVGO",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf1rv0d/",
      "created": 1722008555,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezi7ww",
      "score": 14,
      "body": "Buy high sell low",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezi7ww/",
      "created": 1721968209,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezndau",
      "score": 10,
      "body": "Well, I just lump sum my rollover money from an employer 401K and it lost a good 10% chunk.  About 30k just wiped out in 2-3 days",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezndau/",
      "created": 1721970935,
      "depth": 0,
      "replies": [
        {
          "id": "lezyabu",
          "score": 17,
          "body": "It’s not lost until you sell",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezyabu/",
          "created": 1721977473,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lezl48g",
      "score": 5,
      "body": "Don't worry about it - DCA if you have extra cash & relax.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezl48g/",
      "created": 1721969713,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezjike",
      "score": 10,
      "body": "Chill. If you have money, keep buying VTI. It’ll go back up again. If it never goes up then money won’t matter anyway.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezjike/",
      "created": 1721968878,
      "depth": 0,
      "replies": [
        {
          "id": "lf11o4j",
          "score": 4,
          "body": "This is how I always think about it. If the stocks go to $0 we are all fked including the corps so $ will be the least of our worries by then",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf11o4j/",
          "created": 1721999578,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lezpc5q",
      "score": 3,
      "body": "Bought LW and then it tanked 30% over 2 days now 🤣",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezpc5q/",
      "created": 1721972043,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezvsb8",
      "score": 3,
      "body": "Keep them for a while and it will be back.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezvsb8/",
      "created": 1721975902,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezvw1v",
      "score": 3,
      "body": "I mean have you checked the RSI before buying. A lot of stocks are oversold right now.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezvw1v/",
      "created": 1721975968,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf06v06",
      "score": 3,
      "body": "Worrying about week to week changes is not healthy. Accept the risk or try a different strategy based on a lower risk tolerance.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf06v06/",
      "created": 1721983183,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0xf4a",
      "score": 3,
      "body": "I believe at least half of us riding with you.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0xf4a/",
      "created": 1721997880,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf17hyb",
      "score": 3,
      "body": "This is normal for me when I buy after a dip or when I buy because it looks cheap.\n\nI’ve learned I need to have a good thesis about a stock, an idea of what I think it’s worth, and some idea about why it has a bright future and is undervalued.\n\nOtherwise, it’s super hard to hold through the dips.\n\nBy the way, bad luck exists!",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf17hyb/",
      "created": 1722001749,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf1a3qs",
      "score": 3,
      "body": "Yeah, just bad timing. I did that a few years ago when my individual-stock portfolio was new. I dabbled over the summer, then around October 1 I dropped in a bunch more money only to see a correction *immediately* hit. But then it recovered and kept chugging upward. Now it doesn’t matter. \n\nI’ve had some individual holdings that went -20% for a while, but they’ve pretty much all come back from that, at least partially. The only thing I currently hold that’s below that threshold is Celsius energy drinks. That’s the trouble with growth companies, the second investors worry growth won’t be *as strong* as previously predicted, the stock can absolutely plummet. I’ve seen -30% overnight because the double-digit growth projection wasn’t double-digity enough.  ",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf1a3qs/",
      "created": 1722002664,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf1hq7w",
      "score": 3,
      "body": "It’ll go up again. Just be patient.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf1hq7w/",
      "created": 1722005265,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf28aql",
      "score": 3,
      "body": "There’s a few pieces of advice one can give. \n\n“Hold forever and it’ll eventually be okay” (Long term mindset)\n\n“Don’t catch a falling knife” (Bear mindset)\n\n“The best time to start is yesterday, second best is today.” (Bull mindset)\n\nA 20% dip stinks in timing, not going to say it’s a good thing, but it really won’t matter if they go back up 100% over the next 5-10 years.\n\nLet’s look at even the last 3 years for me.\n\nI bought some Amazon April ‘21 at $167 current cost basis. Peaked at $185 a couple months later. Then end of 2022 it dropped to $85. “Oh no! I’m down 50% all time!” \n\nToday it is $180 again. Even though that’s pretty puny gains for 3 years, it was like $200 last week, and I could have sold then. I could sell now. Frankly, I don’t care, because I believe Amazon will exist 10 years from now and have more profits then than they do now. (Long term mindset)\n\nI bought peloton when I was less familiar with investing, then it quadrupled, then I held and well.. it was a bad bet and I only sold once I admitted to myself it was worthless. In hindsight, I should have sold what was clearly an overvalued company without anything special (bear mindset)\n\nMy NVIDIA gains since 2020 have been about 900% which has covered that loss many times over. Big rocket ship etc. (Bull mindset)\n\nI am huge on long term holding, but while perfect timing is impossible, it does matter, so that’s why people do little adds each week instead of all at once. I’d say hold, and keep adding to a diversified pool each week (VOO, HYSA, etc.)\n\n(Not a financial advisor)",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf28aql/",
      "created": 1722013857,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf2dn5o",
      "score": 3,
      "body": "I bought heavy on wednesday\n\n\nCaused myself to be down +5% yesterday",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf2dn5o/",
      "created": 1722015576,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf2oexc",
      "score": 3,
      "body": "I bought in at like 135-140 on NVDA, so don't feel too bad. Shit was going up for months and then what feels like as soon as I bought it tanked.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf2oexc/",
      "created": 1722019036,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf46kd7",
      "score": 3,
      "body": "Fear not my friend, many of us got caught in this dip. I just started investing end of May and i happened to buy the biggest chunk of semis on the HIGHEST peak. It's 50% of my port you can imagine my pain. Lesson learned, I only buy SP500 for the remainder of the year and maybe even after. I aint selling semis though, I believe they will recover, probably even this year, but idc if only next year.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf46kd7/",
      "created": 1722038106,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezis4m",
      "score": 8,
      "body": "if your portfolio is down 20% TFY then it means you have way too much risk in your portfolio. For this year Im up (ignoring dumping ASX:DRO stock at the start of July with a 61% gain) about 6.8% even though 4 out of my 11 stocks are in the red. This is because the more risk a stock has, the smaller my holdings. You really need to learn how the Satellite method works and to also understand how much risk you are carrying. For me less than 10% of my stocks would be high risk, the rest are moderate or low.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezis4m/",
      "created": 1721968499,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leznkb4",
      "score": 7,
      "body": "Jeez, down 20% must be rough. \n\nEven with the absolute shellacking we've been taking the past few days, I'm still up like 15% YTD.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/leznkb4/",
      "created": 1721971043,
      "depth": 0,
      "replies": [
        {
          "id": "lezu6jm",
          "score": 7,
          "body": "A perk investing in BTC and ETH has is getting completely numb to stock volatility because 20% ups and downs is a regular monthly occurrence",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezu6jm/",
          "created": 1721974901,
          "depth": 1,
          "replies": [
            {
              "id": "lezxyi5",
              "score": 3,
              "body": "Whereas the alts leave me desensitized AND destitute",
              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezxyi5/",
              "created": 1721977261,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lezy4i0",
              "score": 3,
              "body": "I’ve been holding BTC and ETH for a few years now and +/- 20% is **not** a monthly occurrence. Yes, it happens and even some more … but far less often.",
              "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezy4i0/",
              "created": 1721977368,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lezhrat",
      "score": 5,
      "body": "Yes.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezhrat/",
      "created": 1721967973,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezrcvi",
      "score": 4,
      "body": "Im down 6% from tsm and down 5.84% from SPUS long term investing so loses like this doesn't bother me started roughly a month ago",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezrcvi/",
      "created": 1721973212,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezlobg",
      "score": 2,
      "body": "I got hit hard with QQQM and XLK. Ride it out. DCA when u can.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezlobg/",
      "created": 1721970010,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezo6xm",
      "score": 2,
      "body": "These,were the,first stocks you ever bought?\n\nto me that would,only make this highly significant",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezo6xm/",
      "created": 1721971393,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezsewu",
      "score": 2,
      "body": "Did you buy a stock in the NASDAQ when the NASDAQ was at 17,000 pts, or did the stock have a 7 in the major round number of the price?\n\nIt's interesting to if that is the case because I have noticed it's that kind of FOMO area price that people buy at.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezsewu/",
      "created": 1721973835,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezumbw",
      "score": 2,
      "body": "i and many others have beaten you handsomely  so many time .  Unfortunately this is one  contest nobody want to win. except maybe u.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezumbw/",
      "created": 1721975168,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezw2nn",
      "score": 2,
      "body": "Not down quite that much but my ass hurts nonetheless. As long as you have decent stocks or ETF's, absolutely do not panic sell because you will regret it later on, take my word for it.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezw2nn/",
      "created": 1721976080,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezxkhi",
      "score": 2,
      "body": "dollarcost average and you will be fine",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezxkhi/",
      "created": 1721977015,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezyx2p",
      "score": 2,
      "body": "First time?! Those are rookie numbers!",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezyx2p/",
      "created": 1721977878,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezzy0s",
      "score": 2,
      "body": "I bought some qcom around $200 lol",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezzy0s/",
      "created": 1721978551,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf01vxk",
      "score": 2,
      "body": "Down bigly on lululemon and celsius I'm good at catching falling knives",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf01vxk/",
      "created": 1721979836,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf05req",
      "score": 2,
      "body": "I’m losing on TSM that I just bought.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf05req/",
      "created": 1721982435,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf05tyq",
      "score": 2,
      "body": "If you are down and scared then you are not confident in your research and stock choices. \n\nI m down and I m pretty happy to load up. This is a sale the time to buy is now and if it dips more. It's time to buy more.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf05tyq/",
      "created": 1721982483,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0apty",
      "score": 2,
      "body": "I purchased a fuck ton of tech ETFs (large majority of my portfolio) in November 2021, was down 25%+, barely DCA'd down bc i lost hope but I'm up 20ish% now. \n\nTime in the market always helps.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0apty/",
      "created": 1721985777,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0ednu",
      "score": 2,
      "body": "Stop looking.\nHave patience man.\nEveryone needs an instant fix.\nGet busy with something else.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0ednu/",
      "created": 1721988172,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0g4kv",
      "score": 2,
      "body": "seems like you have a big tech portfolio",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0g4kv/",
      "created": 1721989267,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0hjgf",
      "score": 2,
      "body": "No. No you’re not. Though I purchased more options than stocks outright earlier this month.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0hjgf/",
      "created": 1721990120,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0hr8p",
      "score": 2,
      "body": "The good news is if you like the prices you bought at, you’re really going to love the prices this week.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0hr8p/",
      "created": 1721990249,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0k5sq",
      "score": 2,
      "body": "I like AMD, and have plenty of shares for the long haul 😎",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0k5sq/",
      "created": 1721991610,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0ky1r",
      "score": 2,
      "body": "Time in the market is way better than timing the market. Buy good stocks and hold for the long term. Use downturns to dollar cost average.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0ky1r/",
      "created": 1721992034,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0kytc",
      "score": 2,
      "body": "It happens. What you have to understand is semis are dangerous. Even with AI craze, they can still fall 50% in a recession, which happens every 4 years or so. GOOG said as much their infrastructure spending was high, that is chips! If their revenue slows they will immediately stop future plans to buy chips.\n\nNot to scare you. Just don't assume they can't go down and diversify. Have a price where you will buy more or sell. But make the plan ahead of time.\n\nI knew someone who bought bank of america at 5. You can sat they were lucky, but this guy literally watched it fall 90%, had the patience not to get in early and get smoked, and wasn't afraid in the end. Nearly impossible to do.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0kytc/",
      "created": 1721992045,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0lwlx",
      "score": 2,
      "body": "Well, I own palantir and Nvidia (and both were bought at highs). I feel I made a mistake with these, but the bigger mistake would be to never invest. Keep going!",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0lwlx/",
      "created": 1721992543,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0mhgd",
      "score": 2,
      "body": "I got a 10% rule. Everytime I buy stocks I loss 10%. I could hold it 3 days or 3 years. It will not go up until I sell.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0mhgd/",
      "created": 1721992846,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0mr7k",
      "score": 2,
      "body": "For the past week, Tech stocks are taking a hell of a beating and I couldn't even bear to look at it just to make myself better. Don't be too discouraged with the reds, continue to DCA every month and fuck it,  let the time horizon do their thing.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0mr7k/",
      "created": 1721992986,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0pl6z",
      "score": 2,
      "body": "Bought amd at 171. I am dying.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0pl6z/",
      "created": 1721994392,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0pspc",
      "score": 2,
      "body": "I buy in each month so the stocks that I bought last week are averaging down. This way you never get overwhelmed that you bought at the wrong time. Just my method.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0pspc/",
      "created": 1721994492,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0qbg4",
      "score": 2,
      "body": "Don’t worry, in a year or two you’ll be back to profitability. Five years tops.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0qbg4/",
      "created": 1721994739,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0qfam",
      "score": 2,
      "body": "Uh maybe? I'm not so sure tbh. I just buy weekly so my avg is pretty low compared to rn but it has been rising. I wouldn't worry about it too much as long as you have a legit long term plan.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0qfam/",
      "created": 1721994789,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0s9fu",
      "score": 2,
      "body": "Well if you’re complaining.. you could just sell out if you don’t like the company anymore. However if you believe in them don’t sell. conduct your own research, but Id say it’s definitely hitting a buy rating. I sold out of Semis before they got hit hard and i’ve only begun adding to my positions again.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0s9fu/",
      "created": 1721995639,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0x4gq",
      "score": 2,
      "body": "Same here, bought CSPX last week and now I'm down 3%.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0x4gq/",
      "created": 1721997759,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf0xhy4",
      "score": 2,
      "body": "But yes there is a little bad luck, cause lots of stocks rebounded.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf0xhy4/",
      "created": 1721997913,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf11kf4",
      "score": 2,
      "body": "Bought TSMC at 170. Not too bad because I have full trust in the stock but IF I had just waited a day I...",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf11kf4/",
      "created": 1721999538,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf11w43",
      "score": 2,
      "body": "Thats common. Too hard to time the market. Just hold (maybe cry). But dont sell",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf11w43/",
      "created": 1721999664,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf19ant",
      "score": 2,
      "body": "I did the exact same thing. Bought SMH at 273. The next day it dropped 20 per share. Since then it's been a consistent drop. Down 40 per share now 🤦🏼‍♀️",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf19ant/",
      "created": 1722002382,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf1g9rp",
      "score": 2,
      "body": "No, I bought $100K in stocks before the dip so I am also down over 10%",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf1g9rp/",
      "created": 1722004780,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf1j4v0",
      "score": 2,
      "body": "have index and is not down much :P",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf1j4v0/",
      "created": 1722005722,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf1lqat",
      "score": 2,
      "body": "Nah but I’m only down 2% with what I bought. Gotcha on AMD just lower I figured it’d hit around 150 and bought then a little more when it was around 140",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf1lqat/",
      "created": 1722006578,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf1pqem",
      "score": 2,
      "body": "Time in the market beats 'timing' the market. Buy solid companies that can return long term gains and don't chase or time dips and you will be fine.\n\nExample - whether you bought shares of KO 5 years ago 5 weeks ago or 5 days ago you will be fine in the long term esp with investing long term.\n\nIf you are chasing short term gains or trading options it could spell trouble for stability of a portfolio..huge possible gains but also huge possible losses.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf1pqem/",
      "created": 1722007869,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf1zppx",
      "score": 2,
      "body": "I've been bag holding SNOW at 160 in my Roth",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf1zppx/",
      "created": 1722011102,
      "depth": 0,
      "replies": [
        {
          "id": "lf4tbuw",
          "score": 2,
          "body": "Same here but higher, maybe (not looking it up). I finally sold at a loss and felt better immediately. I hate selling at a loss, but sometimes its better to just move on.",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf4tbuw/",
          "created": 1722047619,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf2egg0",
      "score": 2,
      "body": "so ? just wait a few weeks. if that doesnt work: wait some more. I am sure you bought stable, well established companies with a proven track record of success and very healthy basic fundamentals... didnt you ?",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf2egg0/",
      "created": 1722015841,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf2ivxx",
      "score": 2,
      "body": "I dipped a bit into GOOGL and AMAZON just to see it fall since then.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf2ivxx/",
      "created": 1722017264,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf2jweu",
      "score": 2,
      "body": "Buy AIRI . Earnings soon and poised for a run. 3.2 million shares. 2.7 million float. Worth $200 million .",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf2jweu/",
      "created": 1722017591,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf305gt",
      "score": 2,
      "body": "Yes it’s sucks right now…I bought Crowdstrike 2 days before the outage... I bought Nvidia as well.  Thank God they were both just credit spreads.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf305gt/",
      "created": 1722022893,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf36an7",
      "score": 2,
      "body": "Just you. Sorry bro",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf36an7/",
      "created": 1722024921,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf38td3",
      "score": 2,
      "body": "I remember reading that the average stock moves by 50% over the course of a year. Individual stocks have a lot of volatility.\n\nIn your case, you bought a bunch of stocks that are all heavily correlated to each other(semiconductors), so its not surprising that they are all down a similar amount.\n\nA good portfolio will generally have 30 or more stocks in multiple industries that are not directly correlated(other than general correlation to the market)",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf38td3/",
      "created": 1722025761,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf3bmjf",
      "score": 2,
      "body": "My Fubo is down 97% lol",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf3bmjf/",
      "created": 1722026689,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf3vo8h",
      "score": 2,
      "body": "When I bought Astrazeneca the VP resigned shortly after and tanked the stock. It has recovered though. Otherwise I've been quite lucky but most of my stock is volatile so it could tank any day and I have only my self to blame. Astrazeneca was my \"safe\" bet.\n\nI've made bank on AMD and will continue to hold it to some degree. I just bought more actually.\n\nI was trying to convince my mother to buy back in 2016 but she refused.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf3vo8h/",
      "created": 1722033862,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf3wvtt",
      "score": 2,
      "body": "The secret is to just hold forever, it'll go back up unless the company goes bankrupt",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf3wvtt/",
      "created": 1722034325,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf42kj2",
      "score": 2,
      "body": "If you just brought into tech related stocks then you are in a pretty big boat. I always had a similar experience when I first started trading. I know it is scary but this is where doing proper research really helps put your nerves at ease. I am no pro but only buy into companies I truly believe in & intend on staying in the trade ideally long term. We have all heard the phase \"don't put all your eggs in one basket\". Well this couldn't be more true in regards to investing. If tech stocks get hit due to bad earnings, restrictions etc you can rest assured your alternative categories will help mitigate this to a degree. In addition to being diversified having stocks that pay dividends can give you some additional leg room and ideally help you feel more secure and comfortable while waiting out the dip/s.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf42kj2/",
      "created": 1722036529,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf43ycd",
      "score": 2,
      "body": "TQQQ hasn't had the best week",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf43ycd/",
      "created": 1722037072,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf4d4ka",
      "score": 2,
      "body": "Yep ... Down 3k and counting 😭",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf4d4ka/",
      "created": 1722040760,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf4dygs",
      "score": 2,
      "body": "You bought chip stocks the same week people realized trump had a chance.\n\nHe is the bane of semiconductors.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf4dygs/",
      "created": 1722041100,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf4e8fa",
      "score": 2,
      "body": "12% loss in less than a week with my newest purchase LLY🤪",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf4e8fa/",
      "created": 1722041214,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf4sahf",
      "score": 2,
      "body": "Yea so i just got in to investing mpre than a month ago and just conveniently it was the high time for all Stocks and the next day everything just dropped and kept dropping....",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf4sahf/",
      "created": 1722047160,
      "depth": 0,
      "replies": [
        {
          "id": "lf4x8id",
          "score": 2,
          "body": "hi-5! ![gif](emote|free_emotes_pack|cry)",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf4x8id/",
          "created": 1722049388,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf6kic3",
      "score": 2,
      "body": "I did the same with MU (Micron). Wondering if I should sell and just take my losses, or wait it out",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf6kic3/",
      "created": 1722084866,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf6x804",
      "score": 2,
      "body": "Yeah you essentially just bought at probably the top for the year",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf6x804/",
      "created": 1722090094,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf7bpt1",
      "score": 2,
      "body": "So do you buy AMD after this drop when earnings is on Tuesday? Maybe it's insiders selling to drop the price and buy low knowing they have amazing earnings? Still fairly new to active trading",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf7bpt1/",
      "created": 1722095270,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf7lme5",
      "score": 2,
      "body": "All the stocks I’ve sold and re- bought are doing nothing right now. You should forget trying to time the market. It’s impossible. Take a look at Tradesmith, it will help you to pick the right stocks. Good luck",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf7lme5/",
      "created": 1722098813,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf7mdzx",
      "score": 2,
      "body": "Everybody plays the fool sometimes",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lf7mdzx/",
      "created": 1722099088,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfibvuf",
      "score": 2,
      "body": "My Ford stock has lost 30%, but I'm still ahead on it. Just hold on, it won't stay this way. Everything rebounds eventually... well, almost everything",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lfibvuf/",
      "created": 1722270439,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfjpw5j",
      "score": 2,
      "body": "They'll be back. There is an old adage which states don't ever try to time the market. Semi cons are going to go anywhere but up. Wait a month or two and watch them come careening back as the fed announces interest rate cuts. If you have a short investment horizon, you may be hosed. You won't lose a cent until you sell so hold.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lfjpw5j/",
      "created": 1722286328,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg2xgd2",
      "score": 2,
      "body": "I’m down but still up over the long term.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lg2xgd2/",
      "created": 1722566592,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezhegu",
      "score": 3,
      "body": "Yes",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezhegu/",
      "created": 1721967793,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezhuzs",
      "score": 3,
      "body": "If you're investing long term, you're fine.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezhuzs/",
      "created": 1721968025,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezn90x",
      "score": 3,
      "body": "GOEV - 97%. Got scammed ✌️4 years of dca ing.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezn90x/",
      "created": 1721970869,
      "depth": 0,
      "replies": [
        {
          "id": "lezsleq",
          "score": 2,
          "body": "How did you get scammed?",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezsleq/",
          "created": 1721973945,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lezyrox",
          "score": 2,
          "body": "Cut the losses cuz",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezyrox/",
          "created": 1721977782,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lezlcw9",
      "score": 2,
      "body": "I am pretty sure that most people here isn't down 20% in a week, BUT it is not necessarily the end of the world if you are. The important thing to know is if you have done proper due diligence on the companies you bought, or have you bought because of fear of missing out.  \n\nFor example, do you know their PE? Their debt to equity? Their total reachable market, and how fast it grows? Are they cash-flow positive? What are their gross and net profit margins, and has it been growing or shrinking? If you know the answer to most of these questions and you like it, then you haven't made a mistake.  \n\nOn the other hand, if you bought a company because you have read in an article or on some social network that it will go higher and you have checked the historical graph of the shareprice and it already went up 100% this year, you might be in trouble.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezlcw9/",
      "created": 1721969840,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezswh0",
      "score": 2,
      "body": "This is real btw... i think stocks are individual ownership based not globally value based. Every time I have ever bought, the \"stock\" goes down. When in real life, the company is highly economically successful every second of every day",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezswh0/",
      "created": 1721974131,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezwg9j",
      "score": 2,
      "body": "My girlfriend bought NVDA at $134! 🤪\n\nShe knows I have a lot of shares in it but I bought at $66 (pre-split $660). I told her I think it’ll hit $150 this year if the next ER’s smash it so she bought in. \n\nNeedless to say she’s not a happy bunny with me now…😄",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezwg9j/",
      "created": 1721976315,
      "depth": 0,
      "replies": []
    },
    {
      "id": "leziduk",
      "score": 2,
      "body": "Someone I know got influenced by everyone saying to “Lump Sum” into VOO like a week ago . I believe he literally bought it on the highest peak like $519 a share of VOO. Right after he bought it the next day till now it just crashed all the way down to like $594 a share lol. Ouch!!!!",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/leziduk/",
      "created": 1721968294,
      "depth": 0,
      "replies": [
        {
          "id": "lezjfkl",
          "score": 11,
          "body": "It’s peak for now. It’ll go up. Why do people keep talking about the “peak”. Is it not expected to go up ever again? If it doesn’t go up ever, then the economy crashes. Does money even matter at that point?",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezjfkl/",
          "created": 1721968835,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lezjwlk",
          "score": 3,
          "body": "594>519",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezjwlk/",
          "created": 1721969080,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lezs769",
          "score": 2,
          "body": "You mean 494$ (not 594), right?",
          "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezs769/",
          "created": 1721973708,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lezhwuh",
      "score": 1,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezhwuh/",
      "created": 1721968052,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezrvmt",
      "score": 1,
      "body": "I took out a new mortgage (I almost had my apartment paid off) to expose it to the stock market. I managed to get the cash in hand last Friday and started buying. I had a target portfolio of some stocks (tech stocks) and mostly index ETFs and some bond ETFs so I bought it. Not super nice when markets are dropping but it’s for the long term so I don’t think it will matter that much.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezrvmt/",
      "created": 1721973519,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezwfdt",
      "score": 1,
      "body": "Nope I'm actually up 5% on stocks I've been down 20% during the year",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezwfdt/",
      "created": 1721976301,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezxp2u",
      "score": 1,
      "body": "REITS are actually keeping my portfolio green.",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezxp2u/",
      "created": 1721977096,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezydl4",
      "score": 1,
      "body": "Yes",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezydl4/",
      "created": 1721977530,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lezz2xv",
      "score": 1,
      "body": "Recently I just dollar cost average small amounts every day into fractional shares. If I have an idea of how big of a position I'm shooting for, I'll still divide up that amount to DCA over a period of weeks to months. I've been slowly buying the dip for PATH and other beaten down software companies this way. ",
      "permalink": "/r/stocks/comments/1ecf1os/am_i_the_only_one_down_20_on_stocks_that_i_just/lezz2xv/",
      "created": 1721977983,
      "depth": 0,
      "replies": []
    }
  ]
}