{
  "title": "Are there any really good deals in the market?",
  "score": 75,
  "selftext": "While lot of stocks are/near all time high, there are quite a few mega cap floating near 52 weeks low. Are there any quality stocks that you feel warrant a look. I have been primarily buying CVS, PFE, small nibbling at Google and Visa. Got out of BAC and UNH this week. ",
  "link_flair_text": null,
  "id": "1ecrig0",
  "num_comments": 305,
  "created_utc": 1722009110,
  "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/",
  "comments": [
    {
      "id": "lf1yjzp",
      "score": 221,
      "body": "I still don’t understand how google can drop below 25 PE when SPY is above 25. One of the strongest moats in the world across many segments, growing consistently, printing money. I can’t find one reason to not pile up on google at these levels. a",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf1yjzp/",
      "created": 1722010722,
      "depth": 0,
      "replies": [
        {
          "id": "lf2j9ah",
          "score": 83,
          "body": "I think there are a couple of reasons. First reason is the rotation out of the Mag7 due to falling interest rates, profit taking, and maybe some valuation concerns for the group as a whole. So google gets lumped in.\n\nSecond reason is that there are questions surrounding their moat in search. I think it’s overblown, but this is the first time in a very long time that anyone is even legitimately trying to take market share from Google. If they take just 5-10% of market share, that will materially impact Google’s earnings. In my DCF calculation, I drop Google’s search growth down a lot, and I still get a strong range of investment outcomes for the business as a whole. So I’m not concerned.\n\nThe third reason is their earnings I guess. Capex spend was higher than people want, and YouTube Ads growth decelerated. They addressed that the reason for this is because more users are paying for premium. Both of these “bad” things are positives to me. I like that they’re getting more revenue from premium, and I like that they’re spending on capex. The most material risk to their business is them being behind in AI, so the capex serves as both defensive (protecting their moat) and offensive (better monetization of their existing properties, and potentially new revenue streams). \n\nGOOGL is my largest position, and I’m buying more here.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2j9ah/",
          "created": 1722017384,
          "depth": 1,
          "replies": [
            {
              "id": "lf2n4un",
              "score": 27,
              "body": "I agree with your take, but disagree that there is any danger anyone taking market from search. We saw this scare with the death of google (chatGPT) and bing, but google kept their 90% market share. In addition there are a lot of people without internet or consistent internet. So growth potential for search is also there should they lose market share. Also a lot of people literally use google as a gateway to get to their webpages instead of typing the web address in the address field. It is THE internet. \n\nI’m guessing what scared investors was the capex for AI. Same way people got scared when META invested into the metaverse. But i wouldn’t want it any other way either. They have to invest early to not lose out on potential profit generating business in the future. They are also in a position to give users anything chatGPT is giving them with “new search” because of this. I think they have to invest to keep market share as well as innovate. I also believe the amount of data google has will come into play in the future. \n\nIt stings a bit now with the heavy capex, but they have a history of allocating cash much better than me (youtube, android, google maps, etc) so i believe my money is safe there for now.",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2n4un/",
              "created": 1722018624,
              "depth": 2,
              "replies": [
                {
                  "id": "lf2nx2x",
                  "score": 18,
                  "body": "I’m at 183.75 avg with google @75 shares feeling like poop 💩 hoping to average down to 174 soon doubling down..",
                  "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2nx2x/",
                  "created": 1722018876,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lf2rfgy",
                      "score": 7,
                      "body": "I have been averaging up ever since the covid crash. Pre split i think it was around 1000. I have tried to add every dip but it’s impossible to time. I wouldn’t worry too much about it. I think i added more just before it split thinking it was going to moon and it went down 15% more or something.",
                      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2rfgy/",
                      "created": 1722020001,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lf41rox",
              "score": 7,
              "body": "Grabbed some today at $166",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf41rox/",
              "created": 1722036218,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lf38ckj",
          "score": 14,
          "body": "Chances are in 10-15 years you'll make a good investment on Google at this level (even if some people might say it's overvalued). I can't say the same for other stocks. \n\nIt's always a great idea to buy blue chips like google.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf38ckj/",
          "created": 1722025604,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf4l6z3",
          "score": 5,
          "body": "Google’s cash cow are the search and YouTube, YouTube ads are slowing down and the new GenAI search is breathing on their neck … buy Amazon very diversified",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4l6z3/",
          "created": 1722044153,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf29bpk",
          "score": 7,
          "body": "I say, why ask why and just buy. If Google Falls further I'll double down.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf29bpk/",
          "created": 1722014184,
          "depth": 1,
          "replies": [
            {
              "id": "lf2ddeu",
              "score": 6,
              "body": "For sure. Google has been my biggest position for a long while. I also started buying a bit more yesterday",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2ddeu/",
              "created": 1722015487,
              "depth": 2,
              "replies": [
                {
                  "id": "lf2hum1",
                  "score": 11,
                  "body": "Same here man. When it's $300 a share people will still look back and be super jealous that someone else got it at $165. I picked up 28 shares today because I don't have a ton of investment capital for this month. However, if it falls more I will certainly end up buying more. It's just such a great long-term hold it's hard not to add on these pullbacks.",
                  "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2hum1/",
                  "created": 1722016928,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfatfj6",
          "score": 2,
          "body": "Fear of their bad CEO certainly hurts them. I bought a 100 more shares Friday despite him, but I’m not buying more until they hire someone competent that can speak clearly. ",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lfatfj6/",
          "created": 1722146620,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf3tqno",
          "score": 1,
          "body": "Perhaps Nancy Drew or The Hardy Boys should take a crack at this",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3tqno/",
          "created": 1722033112,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf7zwnn",
          "score": 1,
          "body": "Who and why is selling google roght now? What do they now that we dont?",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf7zwnn/",
          "created": 1722103853,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfj0buz",
          "score": 1,
          "body": "2 reasons I can think of. 1) Even though I favored Google to begin with, when I've used AI over the last 6 months, I've gotten better results at Microsoft Edge. 2) There's still a lawsuit outstanding with a judge who can break up Google. Plus, half the candidates running for President and VP currently have stated a hatred of Google in the past which means more DOJ interference.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lfj0buz/",
          "created": 1722278196,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf2gspx",
      "score": 22,
      "body": "Airbus, really have no clue how it can be this low",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2gspx/",
      "created": 1722016589,
      "depth": 0,
      "replies": [
        {
          "id": "lf3yii0",
          "score": 8,
          "body": "I agree.  I dont get.  The Boeing board should be incarcerated (especially the ceo).  .",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3yii0/",
          "created": 1722034951,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf5f2qb",
          "score": 3,
          "body": "I think there was also some concern that now that the Boeing issues are dying out, there will be new Boeing orders. Didn’t Airbus even fire some people because of that. With the way Boeing has been conducting operations I don’t think there’s a recovery neither will there fiascos stop or be forgotten anytime soon.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf5f2qb/",
          "created": 1722058695,
          "depth": 1,
          "replies": [
            {
              "id": "lf5stz7",
              "score": 5,
              "body": "Yes, if Boeing resolves its issues that would create more competition but the backlog for Airbus is 10 years of planes. Apart from that their Military activities, helicopters and space related business is all doing well. They are Dealing with a supplychain issue because of covid but still produce around 75 planes a month more than double the amount of Boeing. And still this stock hasn’t grown in years. The Company has a Good track record and almost 10 years worth of orders.\n\nEdit: I do prob miss something otherwise the stock would have performed better so thats why I came here. Hopefully solve my lack of vision.",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf5stz7/",
              "created": 1722067749,
              "depth": 2,
              "replies": [
                {
                  "id": "lf5x90q",
                  "score": 3,
                  "body": "I’m hoping you are right as I bought Airbus stock recently haha. I also heard the argument that the US government won’t let go of Boeing so we’ll see. But Airbus’s price is currently below 2019 levels, so I think it’s a good entry point.",
                  "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf5x90q/",
                  "created": 1722070894,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lf44dlg",
          "score": 2,
          "body": "For the uninitiated, why are you bullish on them?",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf44dlg/",
          "created": 1722037237,
          "depth": 1,
          "replies": [
            {
              "id": "lf4isc9",
              "score": 6,
              "body": "Commercial planes are pretty much a duopoly. Boeing (BA) and Airbus(EADSY). Bombardier and Embraer are other competitors but make smaller planes and don’t exactly compete with BA and EADSY. Since BA can’t get their head out of their rear end - EADSY is the only real stable commercial airplane manufacturer right now. So they have pricing power with both customers and suppliers.",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4isc9/",
              "created": 1722043128,
              "depth": 2,
              "replies": [
                {
                  "id": "lf4zu82",
                  "score": 2,
                  "body": "But they can’t get enough engines plus China has a320 competitors . In 10 years it will be three players and flight restrictions due to global warming . Would not be in airbus",
                  "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4zu82/",
                  "created": 1722050604,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lf5xjp5",
                      "score": 2,
                      "body": "Call me stupid, but I’ll be optimistic and think they will discover a new technology that is cleaner so the global warming argument won’t be strong.",
                      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf5xjp5/",
                      "created": 1722071107,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lf2nl2e",
      "score": 17,
      "body": "You should be starting to build positions the benefit from a declining interest rate environment. Yes, all stocks do, but homebuilders, construction, regional banks especially do.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2nl2e/",
      "created": 1722018771,
      "depth": 0,
      "replies": [
        {
          "id": "lf3o07i",
          "score": 3,
          "body": "Declining interest rate environment?",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3o07i/",
          "created": 1722030968,
          "depth": 1,
          "replies": [
            {
              "id": "lf3rexl",
              "score": 5,
              "body": "Fed will be cutting at some point between their September and December meetings with cuts happening intermittently through 2025.",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3rexl/",
              "created": 1722032231,
              "depth": 2,
              "replies": [
                {
                  "id": "lf3u1rz",
                  "score": 8,
                  "body": "With a 2.5% GDP and inflation above trend, nah fam but thanks for falling for that the 20th time this rate hike cycle.",
                  "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3u1rz/",
                  "created": 1722033232,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lf3wuct",
                      "score": 2,
                      "body": "Unemployment will be 5% or more by end of year. Expect at least 1 cut.",
                      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3wuct/",
                      "created": 1722034309,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lf3tx7x",
          "score": 2,
          "body": "Give me a position to start with?",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3tx7x/",
          "created": 1722033183,
          "depth": 1,
          "replies": [
            {
              "id": "lf3xmdj",
              "score": 2,
              "body": "TLT/TMF, BRZU are interesting.\n\nDPST and DRN might be too high at the moment.\n\nBLDR is still a solid pick.",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3xmdj/",
              "created": 1722034603,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lf5f5xt",
          "score": 2,
          "body": "Seriously asking, why would banks benefit? I thought it’s better when interest rates are higher as they make more from mortgages.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf5f5xt/",
          "created": 1722058748,
          "depth": 1,
          "replies": [
            {
              "id": "lf6wa56",
              "score": 2,
              "body": "Regional banks are hurt by higher interest rates because they have to pay more for deposits, pay higher costs for loans, and incur higher losses from fixed-income securities which is probably the main reason regionals have been depressed.",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf6wa56/",
              "created": 1722089743,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lf75aeq",
          "score": 1,
          "body": "BCC GRBK",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf75aeq/",
          "created": 1722093011,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfibarq",
          "score": 1,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lfibarq/",
          "created": 1722270249,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfkahjy",
          "score": 1,
          "body": "It's a bit late to the party to be \"starting\" in those sectors, as many of them have already peaked.  Homebuilders are at all time highs...so is construction.  Regional banks have had a really good run as of late, though could probably stand to boost a bit more",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lfkahjy/",
          "created": 1722293436,
          "depth": 1,
          "replies": [
            {
              "id": "lfkf73g",
              "score": 2,
              "body": "Homebuilders, yes. But i think regional banks are just spiking and will see a retracement soon which will be the start of a longer uptrend. \n\nBLDR is looking very good btw.",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lfkf73g/",
              "created": 1722295163,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lf24cz0",
      "score": 58,
      "body": "META, GOOG, AMAZON,",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf24cz0/",
      "created": 1722012600,
      "depth": 0,
      "replies": [
        {
          "id": "lf4gzpn",
          "score": 10,
          "body": "Alphabet has sub 20 fwd earnings today. Yes. that's absolutely a bargain.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4gzpn/",
          "created": 1722042372,
          "depth": 1,
          "replies": [
            {
              "id": "lf5uhzi",
              "score": 7,
              "body": "For sure, people think they need to find some rare gem that's unknown to the public but the truth of the matter  is that the winners have and will be winning for a long time, I personally buy on pullbacks like this",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf5uhzi/",
              "created": 1722068922,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lf29f2l",
          "score": 21,
          "body": "Picked up some Amazon and Google today.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf29f2l/",
          "created": 1722014215,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf2az1b",
          "score": 9,
          "body": "META as well.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2az1b/",
          "created": 1722014712,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf2f2kl",
          "score": 3,
          "body": "Bot Meta shares and Amzn leaps yesterday as well",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2f2kl/",
          "created": 1722016040,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf23a6l",
      "score": 45,
      "body": "GOOGL",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf23a6l/",
      "created": 1722012255,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf25pf9",
      "score": 45,
      "body": "Google, Amazon",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf25pf9/",
      "created": 1722013027,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf2ziix",
      "score": 14,
      "body": "Dexcom sell off is overdone in my opinion\n\n$dxcm",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2ziix/",
      "created": 1722022682,
      "depth": 0,
      "replies": [
        {
          "id": "lf4gu6i",
          "score": 4,
          "body": "It may well be overdone. But I am a longtime DexCom user, and I won’t be renewing my prescription. I’ve been on a semaglutide and my blood sugar is in the normal range 95% of the time. No point in checking it daily. I think DexCom is going to be losing a lot of customers.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4gu6i/",
          "created": 1722042306,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf42wc7",
          "score": 1,
          "body": "Does their product still have a moat?",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf42wc7/",
          "created": 1722036657,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf49fnh",
          "score": 1,
          "body": "It is not done yet *",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf49fnh/",
          "created": 1722039257,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf3yi9z",
      "score": 12,
      "body": "I’m pretty loaded on AMZN",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3yi9z/",
      "created": 1722034948,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf2yk2m",
      "score": 10,
      "body": "Anyone looking at LLY? Shares went down drastically on news of Viking and Roche weight loss drugs. Is it a potential buy or wait for earnings?",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2yk2m/",
      "created": 1722022367,
      "depth": 0,
      "replies": [
        {
          "id": "lf46kvb",
          "score": 6,
          "body": "Yeah, I bought the dip which was, however, followed by another dip.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf46kvb/",
          "created": 1722038111,
          "depth": 1,
          "replies": [
            {
              "id": "lf49j3l",
              "score": 4,
              "body": "Thats the start of the dips my friend",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf49j3l/",
              "created": 1722039295,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lf3hz9c",
          "score": 3,
          "body": "I sold my LLY last week. Was up 60% and concerned that the PE is just getting too high, with lots of competition coming to the table. \nI instead bought XLV (14% LLY) but allowing 62 other stocks to diversify the position a bit.\nI want to wait for ER",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3hz9c/",
          "created": 1722028836,
          "depth": 1,
          "replies": [
            {
              "id": "lf3lbv3",
              "score": 3,
              "body": "Nice exit. Well timed.",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3lbv3/",
              "created": 1722030010,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfj0x3g",
          "score": 1,
          "body": "Last I checked, Viking is going to run out of money if no one buys them out, and Roche looks great but will be another 5 years to market in the US.....",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lfj0x3g/",
          "created": 1722278381,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf2ittq",
      "score": 10,
      "body": "I think AMAT is a great long-term play. P/E is below 24, and currently trading below the 50 day and 100 day moving average. \n\nI bought some more shares during yesterday's dip.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2ittq/",
      "created": 1722017245,
      "depth": 0,
      "replies": [
        {
          "id": "lf4931b",
          "score": 1,
          "body": "Great entry, that's a two bagger within the next few years for sure",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4931b/",
          "created": 1722039115,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf5n5ib",
          "score": 1,
          "body": "AMAT was selling off because the US government might prevent it from selling certain machines to China. Great company and stock overall. I think you’ll be fine .",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf5n5ib/",
          "created": 1722063827,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf4i7eb",
      "score": 9,
      "body": "Amazon",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4i7eb/",
      "created": 1722042882,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf2kzg7",
      "score": 8,
      "body": "Picked up $V and $CMG this week",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2kzg7/",
      "created": 1722017939,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf39kb1",
      "score": 8,
      "body": "NKE is looking solid right now imo",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf39kb1/",
      "created": 1722026012,
      "depth": 0,
      "replies": [
        {
          "id": "lf6cq5g",
          "score": 3,
          "body": "I opened a position in Nike yesterday. Great buying opportunity imo.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf6cq5g/",
          "created": 1722081068,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf4oajr",
      "score": 7,
      "body": "Try nvidia, apple and google",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4oajr/",
      "created": 1722045461,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf3mnii",
      "score": 5,
      "body": "Remember when goog was at $90-ish a year ago?",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3mnii/",
      "created": 1722030484,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf2od34",
      "score": 24,
      "body": "I like RDDT. I think they have so much potential to capitalize on the time we spend on this platform and it’s the type of data that is more valuable to feed into Ai. If they are able to capture even a tiny fraction of what other social media platforms are capable of in terms of ad revenue, then Reddit is seriously undervalued.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2od34/",
      "created": 1722019019,
      "depth": 0,
      "replies": [
        {
          "id": "lf3ra79",
          "score": 16,
          "body": "Yeah I also have a large position in Reddit because I really like the product. A lot of people have the opinion that there’s only (or mostly) shitposting on here but I’ve found Reddit very valuable. It definitely has better content value than Twitter and Facebook IMO. It has been my favorite “social network” long before it went public.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3ra79/",
          "created": 1722032181,
          "depth": 1,
          "replies": [
            {
              "id": "lf4n9v8",
              "score": 2,
              "body": "Literally, when I type a question into Google I get a Reddit link with the same or similar question probably 80% of the time. That’s all I need to know that it has value.",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4n9v8/",
              "created": 1722045030,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lf3hqck",
          "score": 4,
          "body": "Same only hit on them is their ad platform is meh and hard to scale for advertisers, have spent about six figures on it.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3hqck/",
          "created": 1722028750,
          "depth": 1,
          "replies": [
            {
              "id": "lf3mf8d",
              "score": 3,
              "body": "Exactly. It’s so bad that it has set the bar so low for earnings. I can already notice that the ads have gotten better since going public. I suspect it’ll be reflected over the next few quarters as they continue to beat on expectations.",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3mf8d/",
              "created": 1722030400,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lf83wor",
          "score": 2,
          "body": "Reddit is becoming my biggest play right now. I think at the moment its market cap should be just as big as Pinterest which is at 30 billion. That market cap would reflect a stock price of $177 per share for Reddit. Once Reddit optimizes its advertising algorithm it’s going to shoot right past my market cap target",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf83wor/",
          "created": 1722105310,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf3dsly",
          "score": 3,
          "body": "RDDT has search engines, ai companies, advertisers, and others fighting for a spot. Hope they are able to capitalize well and the economy continues to grow. Also seems like they are continuing to hire and grow their presence globally..",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3dsly/",
          "created": 1722027400,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf3h45v",
      "score": 18,
      "body": "ASTS. Get in on the ground floor because it will be hard for anyone to catch them once they get to the top. This is probably going to end up becoming a natural monopoly.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3h45v/",
      "created": 1722028536,
      "depth": 0,
      "replies": [
        {
          "id": "lf3zo7q",
          "score": 5,
          "body": "I concur. I like my 11.62 a average.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3zo7q/",
          "created": 1722035402,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf5g0hf",
          "score": 4,
          "body": "Yup. Risky, but the potential payout is big and I think the thesis is high conviction. Suspect it is also a good swing trade if you’re into that kind of thing.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf5g0hf/",
          "created": 1722059259,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf1w6cd",
      "score": 11,
      "body": "Agree that a lot of things are priced the way they are for a reason. Too many people last year on here tried to be contrarian and avoided what was doing well - instead buying PYPL, CVS, etc.) \"How could CVS go any lower?\" and then they go down another 20% after a horrible quarter. PFE is a company that has had underwhelming shareholder returns now for two decades. It has bounced lately but it's still down over the last year, last five years and is flat for the last twenty years. People talked last year about LLY/NVO being \"too expensive\" and how PFE was a cheaper alternative - picking the cheap and not great over the not cheap but great can often lead to disappointment imo. \n\nIt is an example of the Buffett saying of “It's far better to buy a wonderful company at a fair price than a fair company at a wonderful price.” Pfizer is arguably not a wonderful company - anything that is flat for 20 years has some issues. Felt the same way when everyone was trying to incessantly call the bottom in PARA (barely any return for nearly 35 years) and WBD (-65% since the spin from T barely over two years ago.)\n\nToday: \"How Pfizer’s grand gene therapy ambitions crumbled\"\n\n\"A decade ago, Pfizer began investing heavily in gene therapy, bringing in experimental treatments for a range of genetic diseases, pumping $800 million into “state-of-the-art” manufacturing facilities and announcing its intention to become an “industry leader” that would deliver “one-time, transformative therapies” for rare diseases. Today, it’s not clear how much the company has to show for it.\" (https://www.statnews.com/2024/07/26/pfizer-gene-therapy-hemopilia-rare-disease/)\n\nVisa is great although I think it's limited by antitrust concerns at this point (MA less so.)\n\nDo I think anything is an example of a good deal that's actually a good company? Not much. MPC is still an example of something that I think is reasonable, well-managed, has a strong moat and is returning a lot of cash to shareholders.\n\nI think the Ulta pessimism is excessive. It's not going to provide some sort of home run returns, but I think buying it here over the next year or three will work out well unless there's some sort of 2008 sequel (which I don't see.)\n\nI think FRMO is something where the crypto exposure is underappreciated but it could easily continue to be underappreciated for a long time to come.  Weird little OTC-traded Berkshire-esque entity run by the managers of Horizon Kinetics.\n\nKNSL I thought was a good deal in the $370's and now has taken off after earnings. \n\nREMYY is a good deal here imo although be careful as some brokerages charge a lot extra to trade ADRs (symbol ends in Y.) Liquor is having a terrible time lately but there's a point where anyone looking for value can step in especially to something more premium. \n\nReally look for things that are a good deal and a good company - there's a lot of things that are either at 52 week lows or near them. IMO, a very small % of that is actually worthwhile.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf1w6cd/",
      "created": 1722009948,
      "depth": 0,
      "replies": [
        {
          "id": "lq4t279",
          "score": 2,
          "body": "Love FRMO",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lq4t279/",
          "created": 1727961962,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf287yc",
      "score": 8,
      "body": "PFE, O, REITs, and SOXL (short term only!!!)",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf287yc/",
      "created": 1722013833,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf2pb58",
      "score": 4,
      "body": "Meta, Google, Amazon, Nvidia, Netflix, Visa, united healthcare, LULU, Nike",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2pb58/",
      "created": 1722019324,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf2upw5",
      "score": 3,
      "body": "Maybe Google",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2upw5/",
      "created": 1722021089,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf2v0cm",
      "score": 5,
      "body": "I’m up about 30% on UNH but view it as a long term hold. What was your rationale on exiting?\n\nMy long term plays that aren’t Mag 7 are NICE, LULU, UNH, BA, NKE, SBUX, CMG",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2v0cm/",
      "created": 1722021187,
      "depth": 0,
      "replies": [
        {
          "id": "lf2yeec",
          "score": 1,
          "body": "I have a lot of $BA that I purchased a couple years ago. Do you see it back to $250 anytime soon? I guess it all boils down to fulfilling their backlog of orders, Calhoun finally being done, and no more bad press. Thoughts?",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2yeec/",
          "created": 1722022314,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf43h72",
      "score": 4,
      "body": "Quick everyone. Shill your bags",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf43h72/",
      "created": 1722036887,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf4lzty",
      "score": 5,
      "body": "TSMC",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4lzty/",
      "created": 1722044490,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf24lfq",
      "score": 8,
      "body": "I bought Intel and solar ETF. Maybe they’re priced where they are for a reason? I’ll give it some more time and see if I want to sell them.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf24lfq/",
      "created": 1722012675,
      "depth": 0,
      "replies": [
        {
          "id": "lf4vjz4",
          "score": 4,
          "body": "I did buy some TAN for the same reason.  \nSolar ETF TAN is so low right now and even if it comes down a bit more, the only way for solar energy is up in a 5-10-15 years horizon.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4vjz4/",
          "created": 1722048614,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf5nny2",
          "score": 3,
          "body": "Both your picks have to be long term plays because they can drop a lot. Or have a stop loss . The returns can be massive on the upside .",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf5nny2/",
          "created": 1722064170,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfj15dt",
          "score": 1,
          "body": "When it looked like Trump was a lock to win, that looked like really bad news for the solar ETF for the next year.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lfj15dt/",
          "created": 1722278453,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf2cllf",
      "score": 6,
      "body": "Google for sure.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2cllf/",
      "created": 1722015235,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf267qj",
      "score": 12,
      "body": "Just bought some $F today, haven’t been in since we saw $19.50.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf267qj/",
      "created": 1722013188,
      "depth": 0,
      "replies": [
        {
          "id": "lf3xeux",
          "score": 11,
          "body": "Stellantis and Tesla both just announced absolutely abysmal earnings. Automobile stocks are a terrible place to put your money right now, IMO. On top of that, Ford stock has gone absolutely nowhere in the last 20 years. I like their cars but they are a terrible investment, especially right now.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3xeux/",
          "created": 1722034524,
          "depth": 1,
          "replies": [
            {
              "id": "lf4ad04",
              "score": 3,
              "body": "I feel like there will be a day I can sell my $F for a profit, and collect a dividend in the meantime. I typically load up in the $9-$11 range. Ford tanked this week, the news is out. I don’t expect the next few quarters to be much better anyways.",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4ad04/",
              "created": 1722039634,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lf38ic0",
          "score": 1,
          "body": "I don't have many shares, but what I do is averaged really good. In your view, what's the \"bottom range\" that really shouldn't be broken (save for black swan events)?",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf38ic0/",
          "created": 1722025658,
          "depth": 1,
          "replies": [
            {
              "id": "lf3mfxq",
              "score": 3,
              "body": "I’ve been in and out of ford for over a decade. $9.5>$11 seems to be a pretty decent number to buy at, granted I’ve seen it below $5 a few times. They have a lot of obstacles to overcome and debt, so I’m never all in on them. I did forget buying a little less than a year ago around 10.5, sold at about $12.5 not to long after.",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3mfxq/",
              "created": 1722030407,
              "depth": 2,
              "replies": [
                {
                  "id": "lf6wpuf",
                  "score": 2,
                  "body": "Thanks for the feedback. I'm averaged around 11 and change currently, so I'll look to buy some dips rather than sell or averaging higher under the assumption everything's solid going forward.  I'm not trying to swing trade $F, and I do think it could a good investment in the long run, but of course auto manufacturing is risky business.",
                  "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf6wpuf/",
                  "created": 1722089908,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lf21mlx",
      "score": 3,
      "body": "UNG is getting down there",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf21mlx/",
      "created": 1722011722,
      "depth": 0,
      "replies": [
        {
          "id": "lf265hy",
          "score": 3,
          "body": "I don’t understand any gas atm… do people think it will never return to a normal price? I know we are moving from fossil fuels, but millions of people still rely on it. I’m also loading up on UNG, even if we have a warm winter im good at these prices.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf265hy/",
          "created": 1722013168,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf4exz5",
          "score": 1,
          "body": "I don't understand why this is so low? Can someone explain it to me like I am 5?",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4exz5/",
          "created": 1722041507,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf35tad",
      "score": 3,
      "body": "EV charging 😇",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf35tad/",
      "created": 1722024765,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf3dst2",
      "score": 3,
      "body": "There's a few.  I think NU, CRM, V and WDAY are looking a little attractive here.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3dst2/",
      "created": 1722027403,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf2w088",
      "score": 5,
      "body": "Nike is a bargain, with Olympics starting",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2w088/",
      "created": 1722021521,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf30fpj",
      "score": 5,
      "body": "Air Canada. Presently trades at 2x cash-flows. It can be debt free by end of next year if they don’t spend on capex.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf30fpj/",
      "created": 1722022987,
      "depth": 0,
      "replies": [
        {
          "id": "lf3f46d",
          "score": 1,
          "body": "$30 billion total liabilities - $9 billion cash = ~$20 billion net debt, plus $5 billion market cap = $25 billion enterprise value, which is about 10x earnings.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3f46d/",
          "created": 1722027852,
          "depth": 1,
          "replies": [
            {
              "id": "lf476hd",
              "score": 4,
              "body": "Dig a little deeper and you’ll get it. \nThere is about 5b$ in net debt. The lionshare of the debt is leases and client deposits. It’s not bank debt. While a lease is technically “debt”, it’s not always a great idea to think of it as such. \nThe company is generating nearly 4 billion in cash flows excluding capex and one time expenses.",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf476hd/",
              "created": 1722038353,
              "depth": 2,
              "replies": [
                {
                  "id": "lf4bjji",
                  "score": 5,
                  "body": "But have you ever flown Air Canada?! 😂",
                  "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4bjji/",
                  "created": 1722040113,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lf69vim",
                      "score": 2,
                      "body": "Yep, worst airline. As soon as I started having to pay for flights up there, I switched.",
                      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf69vim/",
                      "created": 1722079465,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lf3cov5",
      "score": 7,
      "body": "yes $rklb",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3cov5/",
      "created": 1722027037,
      "depth": 0,
      "replies": [
        {
          "id": "lf3pvdm",
          "score": 6,
          "body": "I think I will make this my primary growth stock as I missed out on a lot of stuff over the last 4 or so years and I am determined not to make the same mistake again.\n\nAlso, i find space fascinating so that's a bonus.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3pvdm/",
          "created": 1722031655,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf2aarm",
      "score": 8,
      "body": "CRWD (yes I know...), NKE, SBUX, DXCM, META, AVGO, ARM, SOXQ....mainly tech.  I feel everyone is overreacting.  Like Buffet says \"“**fearful when others are greedy, and greedy when others are fearful.”**",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2aarm/",
      "created": 1722014498,
      "depth": 0,
      "replies": [
        {
          "id": "lf2i71j",
          "score": 11,
          "body": "CRWD - its still one of the most overvalued company. In last 8 years, last year was the only year they made profit. Stock based compensation is 20% of revenue (revenue, not even profit). Have to check others more carefully but CRWD is thanks but no thanks.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2i71j/",
          "created": 1722017040,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf49od5",
          "score": 3,
          "body": "Greedy when other are fearful not when others are right. CRWD is overvalued and is going to get into serious trouble in the future",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf49od5/",
          "created": 1722039355,
          "depth": 1,
          "replies": [
            {
              "id": "lf4dp3q",
              "score": 3,
              "body": "Well, when has the stock market ever make sense though.  TSLA is overvalued, ARM is way overvalued.",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4dp3q/",
              "created": 1722040992,
              "depth": 2,
              "replies": [
                {
                  "id": "lf5g7i5",
                  "score": 2,
                  "body": "If Tesla cars suddenly caused billions in losses for their customers, I think people would choose other cars. Yes easier to swap cars, but how in the hell is any NEW customer going to convince their team to buy crowdstrike in the next year? They need to grow for their price to make sense, and if anything their revenue should drop in the next two quarters",
                  "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf5g7i5/",
                  "created": 1722059378,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lf5o4yv",
          "score": 2,
          "body": "Be careful with Dexcom. It’s being reported that the weight loss drugs are causing people to not need Dexcom’s monitoring systems anymore. As people get on these weight loss drugs , it could result in Dex losing more customers.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf5o4yv/",
          "created": 1722064488,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf3e5rb",
          "score": 1,
          "body": "Of these, I might agree with NKE, but will give it another quarter as a watch before I go in.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3e5rb/",
          "created": 1722027527,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf36l1v",
      "score": 4,
      "body": "Sentinelone. It’s half the P/S and almost a third of the EV/NTM as crowdstike even after the dip in crwd. Both have similar growth numbers and margins.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf36l1v/",
      "created": 1722025016,
      "depth": 0,
      "replies": [
        {
          "id": "lf3c7wp",
          "score": 3,
          "body": "I like fortinet over S.   S just does endpoints  fortinet does everything with their own hardware and OS.  The challenge with S is they aren’t really a player with enterprise customers.   Crowdstrike deals are massive.   SentinelOne deals are medium and sometimes large.   Palo Alto, checkpoint, and a few others fighting for those enterprise deals.   I can see where your heads at on this though for sure",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3c7wp/",
          "created": 1722026883,
          "depth": 1,
          "replies": [
            {
              "id": "lf3eawd",
              "score": 2,
              "body": "Thanks, I think S can win a lot more larger deals after crwd pisses off alot of their customers. And S can get an expanded multiple as Wallstreet puts more focus on them. With it only being a 7B company, it can double much easier  than crwd FTNT PANW etc \nI trust that they can adapt and win larger customers overtime, it’s a longterm play for me. What are your thoughts on ZS? It’s a high growth one that has been beaten down.",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3eawd/",
              "created": 1722027575,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lf23s9m",
      "score": 5,
      "body": "Intel lol nope\n\nI went long lulu and Nike recently also BMW and Google... VISA is also one i am considering.\nI have a soft spot for companies that make a lot of Money.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf23s9m/",
      "created": 1722012415,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf2kkf5",
      "score": 5,
      "body": "Right now, Google, and in my slightly biased opinion, Krispy Kreme.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2kkf5/",
      "created": 1722017806,
      "depth": 0,
      "replies": [
        {
          "id": "lf3npu1",
          "score": 1,
          "body": "Why Krispy Kreme?",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3npu1/",
          "created": 1722030865,
          "depth": 1,
          "replies": [
            {
              "id": "lf3of0l",
              "score": 2,
              "body": "Great growth opportunity. Doubling points of access by the end of 2026 through McDonald's. Consistent revenue growth. Leveraging existing assets to boost revenue and earnings at low cost.",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3of0l/",
              "created": 1722031118,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lf1wf8e",
      "score": 7,
      "body": "LULU could be a good pickup while apparel is out of style.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf1wf8e/",
      "created": 1722010029,
      "depth": 0,
      "replies": [
        {
          "id": "lf2be5s",
          "score": 9,
          "body": "I have such mixed feelings, because Lululemon has a such a loyal customer base (including myself), but that very customer base is quite unhappy with quality and fit changes that they've been making. I'm not sure that how much longer that loyalty will hold.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2be5s/",
          "created": 1722014845,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf3bi7x",
          "score": 4,
          "body": "The quality issue is a serious one.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3bi7x/",
          "created": 1722026650,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf2z8vb",
          "score": 4,
          "body": "Millennial value trap.\n\nIn order for the stock price to go up, you have to convince Wall Street that their growth is going to continue..  I’m not so sure as their core Customer base is moving onto other brands.\n\nYou knew it was over when you saw out of shape people wearing Lululemon .  For the company that got famous for solving “ the camel toe problem” , that’s the kiss of death.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2z8vb/",
          "created": 1722022594,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf22nr6",
      "score": 7,
      "body": "Buy on the way up not on the way down.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf22nr6/",
      "created": 1722012056,
      "depth": 0,
      "replies": [
        {
          "id": "lf23zi7",
          "score": 23,
          "body": "Easier said than done. If you think a company is at a good price may as well buy. Who knows it could be the bottom",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf23zi7/",
          "created": 1722012480,
          "depth": 1,
          "replies": [
            {
              "id": "lf2d4b2",
              "score": 6,
              "body": "I'm eyeballing Disney because I think it'll go up eventually but the question is, is this the bottom or can it go lower?",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2d4b2/",
              "created": 1722015405,
              "depth": 2,
              "replies": [
                {
                  "id": "lf3hj4f",
                  "score": 2,
                  "body": "It can go way lower. They're trading at 15x 2019 earnings, and when you take into account the debt, it's more like 25x. And 2019 was a fluke because it had multiple massive movies from major franchises; Toy Story 4, Endgame, Captain Marvel, Frozen 2, The Rise of Skywalker, The Lion King, Aladdin, etc. They're currently priced as if they will be able to achieve 2019's earnings every year, and even exceed them. Whereas in reality, they're a bloated, inefficient, dying company which spends hundreds of millions of dollars per year on movies which few people enjoy, shoves their intellectual property into their parks whilst ruining the immersion and atmosphere (see Poseidon Entertainment's videos for more information about the decline of Disney's parks and the increasing competition from Universal (CMCSA)), although they have the best streaming service.",
                  "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3hj4f/",
                  "created": 1722028680,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lf4hmsg",
                      "score": 2,
                      "body": "Good input. Agree with parks dying. Maybe not actually dying but I think universal is a much better product than Disney world",
                      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4hmsg/",
                      "created": 1722042644,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lf2g87a",
          "score": 10,
          "body": "It depends on how irrational you believe the downtrend is.  When META hit $90 and was hitting single digit PE off of nothing but pure irrationality and no real horrible news, it wasn't a bad idea to buy on the way down.  All that needs to happen is for sentiment to change.\n\n\nHowever, if the falling stock price is caused by something tangible, such as poor earnings, consistent decreasing  revenue, etc., then buying on the way down is a much larger risk as this requires the company to shift gears, which many don't. \n\n\nIt all depends on how irrational you think the downtrend is ,compared to the underlying business.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2g87a/",
          "created": 1722016409,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf2iwfu",
      "score": 2,
      "body": "Dnut",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2iwfu/",
      "created": 1722017269,
      "depth": 0,
      "replies": [
        {
          "id": "lf2s3js",
          "score": 8,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2s3js/",
          "created": 1722020220,
          "depth": 1,
          "replies": [
            {
              "id": "lf2sh0g",
              "score": 6,
              "body": "They are well known for their creme",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2sh0g/",
              "created": 1722020343,
              "depth": 2,
              "replies": [
                {
                  "id": "lf3e8xm",
                  "score": 4,
                  "body": "and their holes",
                  "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3e8xm/",
                  "created": 1722027556,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lf2ptmh",
      "score": 2,
      "body": "I've been wanting to build positions in Trane (TT) and Ingersoll Rand (IR) as I think they are great companies well positioned for the future that get less attention because they aren't in a \"sexy\" sector. \n\nThat said, their share price has exploded in the past year so maybe they aren't deals atm. Worth keeping an eye on and buying dips.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2ptmh/",
      "created": 1722019486,
      "depth": 0,
      "replies": [
        {
          "id": "lf3bbbc",
          "score": 4,
          "body": "I like trane but went with carrier global instead.  Global warming play.   I figure a Florida company will cook the shit out of the books 😂.   Up 35% over 18months.   I see no reason for a slow down.    Can’t see why trane can’t do something similar",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3bbbc/",
          "created": 1722026588,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf2qc4x",
      "score": 2,
      "body": "Which mega-caps are near 52 week lows?",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2qc4x/",
      "created": 1722019652,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf321xz",
      "score": 2,
      "body": "ASX ase technology, Googl, ET is in value territory big dividend good sector for a trump win. TSM i think is fairly valued.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf321xz/",
      "created": 1722023523,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf371ed",
      "score": 2,
      "body": "Papá John’s, maybe Google",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf371ed/",
      "created": 1722025167,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf3aana",
      "score": 2,
      "body": "MSCI Inc.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3aana/",
      "created": 1722026255,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf3vdf9",
      "score": 2,
      "body": "TLT, UPS, small caps have an argument, they were a better deal a few months ago. Nike is a maybe, kind of a similar maybe to Intel, both of them require business momentum to improve. Starbucks, McDonald's, cyclical slowdown, not a ton of money but good money in these. UPS is really the interesting company though. Big dividend massive once a decade correction. TLT is another one, if the economy slows more than expected and the Fed has to cut more than expected this is one of the best hedges you can have on your portfolio because it's going to radically outperform while you're losing money on your equities. If we have a soft landing and things go well you should make some money on TLT but if things go south you're going to make really good money on TLT right at the time all the other stocks are on sale making a very convenient sell point\n\nI'm also going to point out there's an argument for this correction in tech and quality companies like KLAC. The problem though, you ever notice all the posts on here and Facebook and other stock forums I'll talk about tech? You guys are already all in this stuff. The average person on social media is already extremely heavy in tech. So how much heavier do you really want to get? Not my portfolio, not my choice, just something to think about",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3vdf9/",
      "created": 1722033746,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf42wf9",
      "score": 2,
      "body": "I think Dell is a good deal right now, it has dropped a good chunk from its high but is still a strong company and will only keep benefiting from the AI bubble",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf42wf9/",
      "created": 1722036658,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf4ukdx",
      "score": 2,
      "body": "BBW",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4ukdx/",
      "created": 1722048172,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf5bdxs",
      "score": 2,
      "body": "$LULU",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf5bdxs/",
      "created": 1722056548,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfbtgd8",
      "score": 2,
      "body": "Carlsberg - both the beer and stock",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lfbtgd8/",
      "created": 1722169913,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf28esh",
      "score": 5,
      "body": "GRND. But I am holding more cash until US election is over.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf28esh/",
      "created": 1722013893,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf276ww",
      "score": 3,
      "body": "LVMH and Diageo. easily",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf276ww/",
      "created": 1722013501,
      "depth": 0,
      "replies": [
        {
          "id": "lf503jm",
          "score": 2,
          "body": "Someone sells alcohol",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf503jm/",
          "created": 1722050727,
          "depth": 1,
          "replies": [
            {
              "id": "lf5smgl",
              "score": 2,
              "body": "haha i work in tech sales but do like a good monopoly",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf5smgl/",
              "created": 1722067602,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lf2r9dy",
      "score": 2,
      "body": "According to buffet there’s nothing left. No needles in the haystack. None. The price you see is the price you get.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2r9dy/",
      "created": 1722019948,
      "depth": 0,
      "replies": [
        {
          "id": "lf391ne",
          "score": 8,
          "body": "He also admits he don’t invest in companies he don’t understand. So that leaves a lot of needles.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf391ne/",
          "created": 1722025837,
          "depth": 1,
          "replies": [
            {
              "id": "lf3zmtx",
              "score": 6,
              "body": "Also bro is working with a lot more cash than anyone here. We’re still able to make plays that Berkshire wouldn’t even consider.",
              "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3zmtx/",
              "created": 1722035387,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lf3isr8",
          "score": 4,
          "body": "He said there are no companies which are large enough for him to invest in which are undervalued, but if he didn't have so much money under management, he could easily outperform.",
          "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3isr8/",
          "created": 1722029120,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf31lma",
      "score": 2,
      "body": "Yes intc. It’s >20% of my portfolio now and my avg cost is $31",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf31lma/",
      "created": 1722023373,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf22r7w",
      "score": 2,
      "body": "Market is literally teeming with deals.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf22r7w/",
      "created": 1722012087,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf2n057",
      "score": 1,
      "body": "SHOP SQ CSIQ",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf2n057/",
      "created": 1722018583,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf37bek",
      "score": 1,
      "body": "Altria (MO)'s an obvious choice. Strong earnings growth and quite a low multiple. It's not as good of a deal as it was when I first bought it, but it's still undervalued.  \nPlus500 (PLSQF) is also a good choice. Low multiple and they have lots of growth potential - they're a software company so can scale rapidly with minimal CapEx; their only real obstacle is their reputation and the competition, which is why earnings have been in decline, but I think they can turn things around.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf37bek/",
      "created": 1722025260,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf38vau",
      "score": 1,
      "body": "Some sectors might be a bit undervalued such as REITs, Consumer stocks (SBUX, Nike, Lulu), banks (mid size banks), dividend stocks and some medical related stocks (Pfizer).",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf38vau/",
      "created": 1722025778,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf3d2jj",
      "score": 1,
      "body": "Take two interactive will grow once the GTA VI marketing and hype starts. It might go down still, but it is relatively low to its top.\n\nRaspberry Pi is (if not yet) a semiconductor company going for only £4 a share. It is expected for it to rise, having clean financials, positive future product prospects and are part of the home automation market.\n\nI agree with Ford as well, them going more hybrid car focused should increase their revenue and profits, while also joining F1 in two years. Fingers crossed for a Le Mans Hupercar as well.\n\nAMD is diving right now but I’d reckon they will bounce back.\n\nA wildcard option: Crowdstrike. I suspect people overestimate how terrible the consequences will be but it might be possible the stock is overrated in the first place. It would be great to use monthly fractional shares for this one as the absolute loss will be less if it doesn’t pan out, and when you buy the full stock when the price settles down, it won’t affect the average too much.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3d2jj/",
      "created": 1722027161,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf3gjcx",
      "score": 1,
      "body": "AMD looked good - bought some shares",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3gjcx/",
      "created": 1722028339,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf3iagx",
      "score": 1,
      "body": "FMC, WBD, and WBA are all pretty cheap. ",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3iagx/",
      "created": 1722028944,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf3r5sf",
      "score": 1,
      "body": "You can think about ALLT, it’s strong but rn",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3r5sf/",
      "created": 1722032133,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf3tquw",
      "score": 1,
      "body": "Luckily I bought at $130 so just waiting for the V up to buy some more shares.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3tquw/",
      "created": 1722033114,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf3vgv8",
      "score": 1,
      "body": "I am buying more NKE, SBUX, and EL. I also think NEE is preparing for another run upwards.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3vgv8/",
      "created": 1722033784,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf3yz9x",
      "score": 1,
      "body": "The only thing with Amazon is it has a low rating ? I have had it for years but my fidelity search gives it a low rating .",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3yz9x/",
      "created": 1722035133,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf3zbsp",
      "score": 1,
      "body": "LULU, WBD, GOOG, DIS and DNUT if you feeling really spicy",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf3zbsp/",
      "created": 1722035268,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf42gao",
      "score": 1,
      "body": "Bought FSLR. Earnings on Tuesday.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf42gao/",
      "created": 1722036482,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf49ral",
      "score": 1,
      "body": "Why did you sell UNH? I thought it was just getting started. Broke out of a 3 year range",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf49ral/",
      "created": 1722039388,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf4h5ax",
      "score": 1,
      "body": "Sofi. Beaten down fintech bank with huge future growth predicting 10x in EPS in 2026 on the conservative side. About to report third profitable quarter in a row and rate cuts make me v bullish",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4h5ax/",
      "created": 1722042437,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf4qv8s",
      "score": 1,
      "body": "If buying on the way back up MMM, BDN, NWL, BMY & WBA - all pay dividends",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4qv8s/",
      "created": 1722046547,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf4t7em",
      "score": 1,
      "body": "UBER",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4t7em/",
      "created": 1722047565,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf4ven0",
      "score": 1,
      "body": "Meta.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf4ven0/",
      "created": 1722048547,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf5eeof",
      "score": 1,
      "body": "Im liking google and nike",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf5eeof/",
      "created": 1722058297,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf5he4e",
      "score": 1,
      "body": "By sheer fundamentals PayPal is heavily undervalued. It will eventually return to the mean. Did some digging but it’s true value is over $100 which would be a really nice return at current levels",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf5he4e/",
      "created": 1722060115,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf65kvv",
      "score": 1,
      "body": "There are screaming deals in the market.  Google for example.\n\nThey are just incredibly well positioned for the next decade.\n\nI just love they are going to invest $48 billion into AI hardware.   They already have more capacity than anyone else and this will just grow it so much more.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf65kvv/",
      "created": 1722076805,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf66hpn",
      "score": 1,
      "body": "QCOM. They will replace AMD and Intel on laptop processors and PER is low.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf66hpn/",
      "created": 1722077396,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf6agy9",
      "score": 1,
      "body": "SPY every single day is a good deal",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf6agy9/",
      "created": 1722079811,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf6uj1p",
      "score": 1,
      "body": "Google NEW 52 WEEK LOWS, (I click on the Wall Street Journal link and scroll down to lows, then go back up, switch over to NASDAQ and scroll down again).  That's one way I shop for stocks.  Then PM me - I wrote a book on this.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf6uj1p/",
      "created": 1722089079,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf7gw0m",
      "score": 1,
      "body": "I find undiscovered stocks that is low in price from own brokerage sites. Stocks under 20 dollars. About 70+% success rate. The more unusual the better.  Earnings come when revenue increases. Need to be patient.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf7gw0m/",
      "created": 1722097105,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf7vav2",
      "score": 1,
      "body": "I think FSLR continues to be an absolute steal. \n\n1. Trading at 17x forward earnings and 0.5 PEG\n2. Is booked out to capacity for multiple years \n3. Continues to bring more capacity online\n4. Is virtually a monopoly in the US market\n5. Has protectionist policies to keep China at bay, which i believe are not likely to change regardless of administration",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf7vav2/",
      "created": 1722102225,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf9a775",
      "score": 1,
      "body": "GOOGLE",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lf9a775/",
      "created": 1722121384,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfacopq",
      "score": 1,
      "body": "i like amzn msft and googl.  cautiously long tsm and nvidia. short the daylights outta aapl. recently got out of my china shorts ",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lfacopq/",
      "created": 1722137824,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfcb3x1",
      "score": 1,
      "body": "Meta",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lfcb3x1/",
      "created": 1722177409,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfj1rs8",
      "score": 1,
      "body": "I think it would have been interesting if you'd added the caveat \"aside from the Magnificent 7 stocks\" as that would have eliminated the majority of the recommendations given.",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lfj1rs8/",
      "created": 1722278651,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfkbzvi",
      "score": 1,
      "body": "I love PFE, especially with that dividend.  I already own alot.  Would likely buy more if it dips further. \n\nSome of my other favorite plays (all at long-term multi-year holding windows):\n\n- CMG: This one just always produces.  It just had a monster earnings report and sold off for some reason\n\n- EWW: Mexico ETF sold off on the new corrupt president.  Glad to get in on the cheap.  Favorable demographics (age distribution) + nearshoring are someday going to make Mexico the next economic powerhouse.  The anti-capitalist leadership will likely hold back much of what \"could have been\", but there's too many favorable conditions in play for that to hold it back permanently.\n\n- VNM: My \"lesser\" international play.  I don't have as much faith in Vietnam as Mexico, but the demographic curve is definitely there as well.  And their labor is dirt cheap\n\n- VALE: Too much value here, especially if their dividend is maintained.  Tends to be cyclic...I'll get in on the bottom\n\n- IWM: had a bit of a run, but still cheap.  Smallcaps are still cheap\n\n- LGIH: somehow didn't participate in the homebuilder run-up...good value here in a sector that is guaranteed to produce with rates falling in the near term\n\n- TAN (or any other green index): Green stocks are stupid cheap.  Similar to above, they're going to be a good investment in a declining rate environment, AND the Inflation Reduction Act just dumped a ton of govt cash their way",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lfkbzvi/",
      "created": 1722293985,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg2x025",
      "score": 1,
      "body": "UWM, rocket, housing stocks",
      "permalink": "/r/stocks/comments/1ecrig0/are_there_any_really_good_deals_in_the_market/lg2x025/",
      "created": 1722566405,
      "depth": 0,
      "replies": []
    }
  ]
}