{
  "title": "Investing 300k in Dividend Stocks",
  "score": 37,
  "selftext": "I'm approaching semi-retirement and would like to get some assurance of a regular income while I focus on developing more part-time income. But I need to make sure I'm getting a steady and safe stream of baseline income from my investments to take care of fixed expenses.\n\nWhat do you think of the strategy of selecting say, 10 of the top dividend stocks that are safe (good companies) and have a good track record on keeping or raising their dividends. For example, Verizon, Enterprise Products Partners, KMI, and others that pay upward of 6% or higher on dividends. I wouldn't distribute the 300k evenly across the 10 (or so) dividend stocks, but I would diversify to a great extent to protect myself from a company going under. That way, I'm getting high dividend returns even if the market takes a downturn (and hoping companies don't lower their dividends if that happens).\n\nI know it's not a 100% safe strategy, but what do you think? Bonds at 4-5% is a bit too low if I can make 6-7% or higher on dividend stocks and get some protection against a potential market downturn.\n\nI'd appreciate anyone's thoughts, thanks!\n\n**UPDATE:** Thank you for all of your thoughts! I think what I may end up doing is an ETF like VOO or VTI, and as it makes money, secure my profits so that when the market takes a downturn I've built up some profit to keep the steady stream of income coming in. So, every time VOO makes me say 5k, I pull that out and put it in a money market account. \"Skim off the top\" to keep from market downturns forcing me to potentially dig into the principal. Anyone like that idea? Stock market returns are just too high to not put the 300k there. So long as I build up a security blanket against downturns, putting the 300k in the S&P seems the best choice and taking profits regularly. And if ever I don't need the money and my side job is enough, I'll just leave the 300k in there. VOO has some risk, but is safe long term, just have to weather the valleys as they come.  \n\nD.",
  "link_flair_text": null,
  "id": "1ed4vmd",
  "num_comments": 70,
  "created_utc": 1722044597,
  "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/",
  "comments": [
    {
      "id": "lf4um5x",
      "score": 43,
      "body": "Be very careful buying any stock that is paying 6% or more in dividends. Many of them are dividend traps. Or they are companies that are in some dire times. VZW is a good example of that. You don't want to be caught in a position where you're holding onto a falling or stagnant stock for the divy, then the cut the divy as they usually do. Look at what happened with INTC.\n\nThis highlights one of the problems with buying individual companies. You have to keep your eyes on your portfolio and make sure that your not holding WMT then it becomes the next Kmart or Shopko.\n\nI would suggest going with ETFs that have a lower divy, but a proven history of being able to increase share price, AUM (assets under management), and dividends. One of the more popular ones is SCHD. \n\nBut it also depends on your time-line for retirement. I have been tempted to buy a little bit of JEPQ because of the divy. But they don't have a long history to see the track record for growth. And I figure that is more fore if you are entering or in retirement and need the money now.\n\nBut if I'm being honest, I may not be the best person to ask about what the best ETFs are. I love to pay attention to my portfolio and do research on a daily basis. Hell, I created this reddit account just for stock research. I'm a big geek like that.\n\nI would suggest spending some time on r/dividends and do a lot of research to every suggestion. Be mindful of the divy traps that some of the noob investors tout.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf4um5x/",
      "created": 1722048193,
      "depth": 0,
      "replies": [
        {
          "id": "lf4yo9a",
          "score": 6,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf4yo9a/",
          "created": 1722050057,
          "depth": 1,
          "replies": [
            {
              "id": "lf8o6jr",
              "score": 1,
              "body": "T is better long term",
              "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf8o6jr/",
              "created": 1722112813,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lf7n8t8",
          "score": 3,
          "body": "While I agree that chasing dividends is a fools errand, individual stocks can be a good way of building an income stream.  There are plenty of stocks with solid fundamentals and a long term record of dividend increases; one just needs to be willing to buy them at about  2 - 4% dividend yields, and then wait for them to increase distributions over time.  A well diversified portfolio can give you a consistently increasing income stream with limited downside in market pullbacks.",
          "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf7n8t8/",
          "created": 1722099392,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfce57x",
          "score": 2,
          "body": "How can I learn more about ETF?",
          "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfce57x/",
          "created": 1722178505,
          "depth": 1,
          "replies": [
            {
              "id": "lfdpuix",
              "score": 1,
              "body": "Read their prospectus and look at their history. That should tell you all you need to know.",
              "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfdpuix/",
              "created": 1722195008,
              "depth": 2,
              "replies": [
                {
                  "id": "lfeaget",
                  "score": 1,
                  "body": "I would prefer buy stocks pretty safe, like AAA, Apple and so on, that are pretty stable.\nI wouldn’t like to try to invest in things risky",
                  "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfeaget/",
                  "created": 1722202335,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfmbyef",
          "score": 1,
          "body": "And then look at $O",
          "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfmbyef/",
          "created": 1722328220,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf7ipcd",
          "score": 1,
          "body": "JEPQ is not really a dividend ETF.",
          "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf7ipcd/",
          "created": 1722097764,
          "depth": 1,
          "replies": [
            {
              "id": "lf7tyiz",
              "score": -1,
              "body": "Yeah I know. That's another reason I didn't buy.",
              "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf7tyiz/",
              "created": 1722101755,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lf5y8dz",
      "score": 12,
      "body": "Common mistake people make is to focus too much on the dividend yield . That makes them invest in AT&T and Verizon which have been horrible investments. I would recommend SCHD . At least that would let you sleep peacefully at night.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf5y8dz/",
      "created": 1722071597,
      "depth": 0,
      "replies": [
        {
          "id": "lfauces",
          "score": 5,
          "body": "+1 for SCHD",
          "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfauces/",
          "created": 1722147191,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfb2gum",
          "score": 0,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfb2gum/",
          "created": 1722152465,
          "depth": 1,
          "replies": [
            {
              "id": "lfe9i1q",
              "score": 1,
              "body": "Dividends are not well covered by operating cash flow as is the case with such high dividend payers.",
              "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfe9i1q/",
              "created": 1722201979,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lf7dk1x",
      "score": 11,
      "body": "I made this post a couple of years ago and I think it pertains to your question.\nThe importance of dividend increases\n\nLet’s say you invest $10,000 in a stock that pays a 6% yield but does not grow the dividend.\n\nIf the stock appreciates at a pace  with the historical average of the S&P 500, and if you reinvest the dividend for 10 years, you’ll have $32,303 after 10 years, $52,878 after 15 years and $83,372 after 20 years.\n\nFurthermore, after 10 years, you’ll collect $904. After 15 years, $1,026. And you’ll receive $1,120 after 20 years.\n\nNow, what happens if we start off with a lower 4% dividend yield, but that dividend grows 8% per year?\n\nAfter 10 years, the nest egg will be slightly lower at $31,241. You’ll have more at 15 and 20 years than you did with the flat 6% yielder. Your totals will be $55,432 and $98,615, respectively.\n\nPerhaps more importantly for the investor who starts collecting the income at 10 years, the dividend raiser generates $1,158 - substantially more than the $904 in the earlier example.\n\nAfter 15 years, the income rises to $2,081. If you let the money compound for 20 years and then begin receiving the dividend checks, you’ll take home $3,750 - more than three times the amount with the higher starting, but static, yield.\n\nHow about if you need the income today and don’t have time to reinvest the dividend and let it compound?\n\nA $10,000 investment in a stock that yields 6% and doesn’t grow its dividend will generate $600 in income every year.\n\nThe 4% yield that grows by 8% every year starts off paying you $400 per year.\n\nBy year seven, you’ll be making $634 - more than the 6%-yielding stock.\n\nAt year 10, you’ll collect $799 - 33% more than the $600 paid by the 6%-yielding stock.\n\nAfter 15 years, you’ll be collecting just about double the amount of the other stock with $1,174, and five years after that, your income will be $1,726 - nearly three times the amount of the 6% stock.\n\nThis is a perfect illustration of why I strongly recommend dividend raisers for long-term investors. This is also how we get yields to double digits in ten years.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf7dk1x/",
      "created": 1722095914,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf5rnn2",
      "score": 4,
      "body": "If you want safety because you actually depend on the dividends you should buy actual safe companies such as Coca Cola, P&G, stuff like that. Verizon is decently safe, but there's a reason the dividend is as high as it is. If your well-being depends on that dividend, I wouldn't rely on companies like that.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf5rnn2/",
      "created": 1722066921,
      "depth": 0,
      "replies": [
        {
          "id": "lfdzy1h",
          "score": 2,
          "body": "Thanks for this. Yes, well-being will depend on the dividend for at least a little while. My only problem with this approach is that I need a steady stream greater than the 2.89% or so that Coca cola or similar provides. I can't risk the market being flat for 2 years or so and only getting 2.89%. I need at least 5-6% or so on dividends or else I'll just go with CDs. I'd just go with VOO ETF and be fine with that but if the market was stagnant or a crash I'd maybe have to dip into the principal, which would be brutal. If my side kick pans out, I'll be fine, but I'm preparing for the worst (and will hope for the best), so for at least 1-2 years I'll need the steady virtually guaranteed income stream from that 300k. In the end maybe I'll just go with VOO and skim off the top when it profits as to build up a safety net, so if the market crashes, I'm only temporarily losing the principal but not the profits. So, if I have the 300k invested and over a week it makes 5k, I pull out the 5k and put it in a money market account, and keep doing that so if the market crashes I don't have to dig into the 300k at all. Goal is to never have to touch the 300k and just use it as a steady stream, almost like an annuity.",
          "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfdzy1h/",
          "created": 1722198538,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf58uha",
      "score": 13,
      "body": "SPYI is an ETF that pays 11.74% it's similar to SPY but instead of focusing on growth it pays out dividends.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf58uha/",
      "created": 1722055144,
      "depth": 0,
      "replies": [
        {
          "id": "lf7mi99",
          "score": 6,
          "body": "It does not pay out dividends like operating companies do; it generates option premiums and distributes them.  These premiums depend on the volatility of the underlying stocks, and they mean that the upside in the stocks is capped, while the fund is fully exposed to the downside in a bear market.  \n\nThis means that you could lose quite a bit of both principal and income in a bear market.  It should not be considered a reliable long term income stream.",
          "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf7mi99/",
          "created": 1722099130,
          "depth": 1,
          "replies": [
            {
              "id": "lfayx1u",
              "score": 1,
              "body": "There is another fund that does something similar, BDJ. Difference is that it's a CEF of dividend stocks that generates additional returns by selling covered calls.  So it limits the upside if the market has a big rally, but if you are holding dividend stocks you will underperform in that scenarior regardless.\n\nThere are actually a lot of CEF funds that generate high % returns but I haven't looked into any of them other than BDJ (which I do not own). Just checked and BDJ currently has a 8.1% yield right now.",
              "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfayx1u/",
              "created": 1722150110,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lf8m616",
              "score": -6,
              "body": "A lot safer than a REIT or individual stock, besides bear markets don't usually last long.",
              "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf8m616/",
              "created": 1722112077,
              "depth": 2,
              "replies": [
                {
                  "id": "lf92ipk",
                  "score": 2,
                  "body": "Not true at all.\n\nIt far riskier than a diversified portfolio of income producing stocks.\n\nBear markets can and do last decades.  The 20th century saw two twenty year periods where the inflation adjusted S&P 500 was down by more than 50%.\n\nEven if a bear market is relatively short, the nature of covered call funds means that an investor would be fully exposed to the drawdown, and only participate in a limited portion of the recovery.  \n\nAgain, covered call funds are not good long term income vehicles.",
                  "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf92ipk/",
                  "created": 1722118277,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfa1epn",
                      "score": -1,
                      "body": "You're talking about a recession/depression that's a lot worse than a bear market. \n\nHe asked about trying to get 10% dividends, name one stock or reit that pays that, and is less risky than an ETF with 500 separate holding in 10 different sectors. \n\nInstead of shooting my idea down why don't you tell us yours 🤷‍♂️ What would you do?",
                      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfa1epn/",
                      "created": 1722132721,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfc6pv3",
                          "score": 1,
                          "body": ">You're talking about a recession/depression that's a lot worse than a bear market\n\nNo.  The 1965-85 bear market had good economic growth through the first 8 years of it; there wasn't a recession until 1974.\n\nEconomic downturns are often, but not always, associated with extended bear markets.  Investors need to be prepared for them,\n\n>He asked about trying to get 10% dividends\n\nNo, he asked for 6-7% dividends.  A basket of blue chip equities can easily give 3-4% in income; give it 10 years for the income stream grow, and you should be at about 6-7% yield to cost.   This is the way to build a sustainable income stream.\n\n>Instead of shooting my idea down why don't you tell us yours \n\nI did.  I specifically stated the a diversified portfolio of income producing stocks would be a safer income vehicle.",
                          "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfc6pv3/",
                          "created": 1722175759,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lfcam1j",
                              "score": 0,
                              "body": "You didn't give an example of a good diverse portfolio tho! \n\nAnyone could have said what you said and it still wouldn't have answered the OPs question. Also it's not like I suggested he make SPYI 100% of his portfolio, I was simply figured it would bring up his dividend percentage if he added it. \n\nWith the Fed Rate being what it is currently might as well keep it all in an HYSA or Brokerage account they're paying 5% and are FDIC/SIPC Insured. Won't last forever but you're not gonna get above that without risk.",
                              "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfcam1j/",
                              "created": 1722177231,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lfccsmp",
                                  "score": 1,
                                  "body": "I wasn't intending to answer OP's question; I was pointing out that covered call funds are not good income vehicles.  You haven't addressed any of my points, so I am done here.",
                                  "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfccsmp/",
                                  "created": 1722178019,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lfdu7st",
                                      "score": 0,
                                      "body": "Then why respond at all? This is reddit and you provided what Google could have given him/her thank GOD ur done here cuz ur about as useful as Wikipedia",
                                      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfdu7st/",
                                      "created": 1722196537,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lf59rxx",
      "score": 7,
      "body": "Dividend aristocrat. I repeat, look it up and it’s a pretty good group of companies",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf59rxx/",
      "created": 1722055648,
      "depth": 0,
      "replies": [
        {
          "id": "lf6t2n1",
          "score": 3,
          "body": "should look at SCHD also",
          "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf6t2n1/",
          "created": 1722088521,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf616dt",
      "score": 3,
      "body": "UNH CTAS VISA LMT WMT",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf616dt/",
      "created": 1722073723,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf6ad8p",
      "score": 3,
      "body": "I’ve been looking at CLOZ with intrigue. It’s an ETF that  seems to preserve capital and provide an 8% dividend.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf6ad8p/",
      "created": 1722079752,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf7gh3l",
      "score": 3,
      "body": "SCHD",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf7gh3l/",
      "created": 1722096954,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf54hro",
      "score": 4,
      "body": "IBM, HD, SCHD, JPM, CVX, PEP, KO, C, among others good chips. Don’t let you caught with high yield traps.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf54hro/",
      "created": 1722052859,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf68agy",
      "score": 2,
      "body": "There are some solid >5% dividend stocks on the FTSE100. Phoenix is close to 10%. Aviva, legal and general, hsbc come to mind too. (Less so Lloyds at the moment but it's a high payer). \n\nObviously you need your own DD but they're worth looking into.\n\nI offset these individual buys with a vanguard ETF dividend tracker that pays approx 2% quarterly.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf68agy/",
      "created": 1722078525,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf69e5f",
      "score": 2,
      "body": "I’ve always like mining companies, BHP & RIO.  VALE is a bit riskier.  Also TTE and SHEL.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf69e5f/",
      "created": 1722079182,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf7bzvo",
      "score": 2,
      "body": "Preferred stock yields about 5.3-5.8%",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf7bzvo/",
      "created": 1722095368,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf7z8fd",
      "score": 2,
      "body": "Canadian top banks have never lowered their divis. rbc being the safest right now. Im taking a gamble on TD personally. But you can buy the entire group (big 5/6 banks)",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf7z8fd/",
      "created": 1722103610,
      "depth": 0,
      "replies": [
        {
          "id": "lfci5p4",
          "score": 1,
          "body": "Very nice idea. Thanks!",
          "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfci5p4/",
          "created": 1722179946,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf50r7k",
      "score": 5,
      "body": "I would consider other alternatives including bonds, money market, or HYSA. Because these are all paying out 5% or more and are far less volatile and risky. This will change as interest rates rise and  their yields fall but right now they are good choices.\n\nThere are not really many quality companies paying out more than 5% in dividends, and stocks are far more volatile and less safe. Is it worth 1-2% more on your money to sacrifice the almost absolute safety of a HYSA for instance?\n\nYour choices might change depending on if this is money in a retirement account, which you didn't specify. Assuming it is, HYSA account is not an option, but money market would still be a great choice or possibly a high-yield bond fund.\n\nThat said, Verizon is worth considering. The P/E is much lower than many other large companies. A lot of analysts say it is a (moderate) buy.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf50r7k/",
      "created": 1722051040,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf4nlw1",
      "score": 2,
      "body": "r/dividends",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf4nlw1/",
      "created": 1722045170,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf5b0du",
      "score": 3,
      "body": "I tried out your idea on a small scale for two years and it went abysmally. I probably timed it bad but I came to the conclusion chasing super high dividends is too good to be true. The dividend funds/ETFs seem like a better idea if you want an income stock.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf5b0du/",
      "created": 1722056333,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf5nue5",
      "score": 2,
      "body": "SPYI",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf5nue5/",
      "created": 1722064290,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf5cdk4",
      "score": 1,
      "body": "I like the ETF  \"sdog\".     It is a group of the SP500 stocks that pay the highest dividend in a half dozen categories.  It gets rebalanced every year I think.    I has been paying a steady 3% (currently 4%) but has never suffered the price swings of regular stocks that sometimes cut their dividends  or otherwise tank unexpectedly.  \n\nThat's not all I have,  but that's my dividend foundation.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf5cdk4/",
      "created": 1722057116,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf6jsme",
      "score": 1,
      "body": "I mean with a non dividend stock you can just sell the gains. With dividends they are taxed as ordinary income. With selling a stock you can use your cost basis to control your tax liability, make sure you use long term capital gains and that you max out your 0-15% every year. \nNot to mention the tax implication of selling a chunk to start the dividend strategy. \nI personally despise when stocks pay dividends.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf6jsme/",
      "created": 1722084548,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf6ophv",
      "score": 1,
      "body": "Always check cash flow versus dividends and also the payout ratio. GuruFocus does this well. You can find several good companies this way and weed out the traps.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf6ophv/",
      "created": 1722086709,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf75a77",
      "score": 1,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf75a77/",
      "created": 1722093009,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf79hmw",
      "score": 1,
      "body": "I have a high paying dividend stock but it has decreased its dividend for about every year these past 10 years atleast.\n\nI think they should absolutely be able to continue paying a dividend and even increase it in the future.\n\nBut I am not certain and might be missing something and they have actually decreased the dividends for such a long time so why wouldn't they be able to continue doing it?\n\nBut this is  stock I would have bought even if they didn't pay out a dividend but now they are.\n\nI just mean that its never certain for just a stock and you can never really know the future dividend.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf79hmw/",
      "created": 1722094489,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf80ox4",
      "score": 1,
      "body": "I know this will be disliked by the people on this sub, but I would suggest you wait or at least DCA. I think we're approaching a blow off top before a big bear market just like dot com or housing crisis. Rate cuts will mark the top imo. Do your own research.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf80ox4/",
      "created": 1722104138,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf85qoo",
      "score": 1,
      "body": "Maybe look at JAAA and JBBB. Pretty stable 6+% closed end funds. I’ve been reinvesting all my cd interest into them and reinvesting monthly divs. Not much growth though.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf85qoo/",
      "created": 1722105983,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfa7ij7",
      "score": 1,
      "body": "PG.  Greatest Div  stock ever.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfa7ij7/",
      "created": 1722135400,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfciy3i",
      "score": 1,
      "body": "Fair warning: EPP and many other oil and gas companies are structured as master limited partnerships (MLP’s) and not corporations. They pay great distributions and have tax advantages but actually doing the taxes for them is a complete nightmare.\n\nYour eyes are going to pop out of your head once you get that first K1 and realize you owe taxes in 30 different states. It can still be worth it just make sure to get them professionally done.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfciy3i/",
      "created": 1722180221,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfm4cz9",
      "score": 1,
      "body": "I feel bad for the knowledge you don’t have bc with the money you can make a lot more even before buying any stocks you could seat on your 300k without even buying anything",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfm4cz9/",
      "created": 1722323046,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfnkq6b",
      "score": 1,
      "body": "Seems like you got lots of good advice. Historically, people would have recommend more dividend payers like Chevron, too, but oil and gas has an uncertain future 10-20 years out now. I was surprised people did not recommend more utilities though like Duke and NEE and BEP which pay dividends and are solid, needed industries.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfnkq6b/",
      "created": 1722350025,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg7yftd",
      "score": 1,
      "body": "Park it in SCHD and take a nap.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lg7yftd/",
      "created": 1722641211,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf5kwy8",
      "score": 1,
      "body": "If you Wana play in dividend stocks just invest in VYM",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf5kwy8/",
      "created": 1722062357,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf60cwj",
      "score": 1,
      "body": "UGI, AQN, KVUE, T are all good companies paying 6%+ yield right now. Depending on your time horizon, they’re pretty good investment IMO. Check them out.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf60cwj/",
      "created": 1722073133,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf4up4i",
      "score": 0,
      "body": "Can you live with what happens if the stocks go down?  Look at a chart of Verizon for example.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf4up4i/",
      "created": 1722048231,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf5796a",
      "score": 0,
      "body": "20 yr tbill ?",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf5796a/",
      "created": 1722054292,
      "depth": 0,
      "replies": [
        {
          "id": "lfe15ci",
          "score": 1,
          "body": "4.53% I think that's a good idea. Safe, and consistent income.",
          "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfe15ci/",
          "created": 1722198955,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf64pd7",
      "score": 0,
      "body": "post at r/dividends",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf64pd7/",
      "created": 1722076209,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf4qs2w",
      "score": -1,
      "body": "Dividends is definitely one of the \"safer\" routes.\n\nI've got a friend that started moving into YieldMax etfs. He's been trying to convince me they're better than dividend stocks.\n\nAs far as I can tell (at a quick glance) they work by buying shares and then selling covered calls on those shares. Not sure if they take the premiums they make and roll them back to investors like dividends or they just use them to bolster positions.\n\nI haven't jumped in yet but I'm using a similar \"steady+ growth\" strategy as you so I thought I'd chime in with this.",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf4qs2w/",
      "created": 1722046511,
      "depth": 0,
      "replies": [
        {
          "id": "lf4ryg1",
          "score": 2,
          "body": "Thanks for this, I'm checking the YieldMax to see if I can understand how they work. Other than the dividend stocks I see the only other possibility of a 10-20 year CD or treasury bond. I can get 5% on a CD but it's hard to settle for that when there are dividend stocks paying higher. I just can't afford the market to have a 1-2 year downturn or anything and not produce income, which is why the dividends or CD or bonds seem the way to go. The higher risk bonds seem too risky as well.",
          "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf4ryg1/",
          "created": 1722047016,
          "depth": 1,
          "replies": [
            {
              "id": "lf59e3a",
              "score": 1,
              "body": "If you get a long term CD, check when they can call it. With rates expected to drop in the relatively near future, the if they can call it early, they will. I have some one year CDs that have or will get called at 6 months. Also, look into closed-end funds.",
              "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf59e3a/",
              "created": 1722055441,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfgamzn",
              "score": 1,
              "body": "If you want safe, consistent dividends, avoid yield max ETFs. They’re pretty high risk. \n\nIf you want a pretty safe ETF that has good dividend growth, go with SCHD. FDVV is another popular one, but it’s a little higher in risk. Its dividend is also lower than SCHD’s. VYM is okay, but its div yield is lower than SCHD’s. It’s also more expensive. \n\nJEPQ and JEPI are 2 really popular ones. They have the yields you are looking for, and they appear to be less risky than yieldmax ETFs. They’re higher risk than SCHD. But there is very little long-term data on them, with even less data for JEPQ. \n\nSeveral people mentioned T and VZ. If you only want 5-6ish% div yield and don’t care about share price appreciation and div growth, these could be fits for you. Their debt is incredibly high, but they do appear to be slowly paying it off. That will likely take a very long time because of how high it is. And it assumes that they won’t add more. Decreasing div yield is one way to try to decrease debt, so that’s always a concern with these companies. \n\nVZ has a higher yield and has a longer history of increasing its div yield, but it looks like it’s almost topped out. T was a dividend aristocrat, but it recently decreased its div yield. They both recently released their earnings, and T did better than VZ. However, there doesn’t look like there is much room for share price or company growth for either company.",
              "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfgamzn/",
              "created": 1722235426,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lf4sqi3",
          "score": 1,
          "body": "Corporate A/A bonds at 5.8% for 20 year, I don't know how risky that is though. Would take care of the problem though having that steady return. Maybe the dividend stocks would be less risky? If so, then dividends are the better way with a higher rate of return overall. I'm leaning toward taking on some risk with dividend stocks and going that route.",
          "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf4sqi3/",
          "created": 1722047358,
          "depth": 1,
          "replies": [
            {
              "id": "lf4wh8s",
              "score": 4,
              "body": "At a quick glance (Google search) I'm not seeing a lot of top dividend stocks that offer much more than 5% and the ones that get into that 6-7% and up range come with a lot of added risk for that 1-2% increase.\n\nIf we still had raising inflation like we've had for the last few years i-bonds would still be a great place to park cash. They were 9.5%+ in 2022. I should have taken loans to max out those.\n\nMy overall thoughts in this situation are: How actively do you want to manage your money? Assuming you have a safe 5% route, how much is that extra 1-2% really worth?\n\nI mean, I guess if you wanted to be more active and you've got a decent pile of cash to work with you could double-dip and do the Yieldmax thing yourself with your dividend stocks. Sell \"comfortably\" OTM calls on your shares. If they're not exercised you get the options fee/premium and you get to keep the dividend. That little extra you get from selling the covered calls could boost you those extra % you're looking for.",
              "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf4wh8s/",
              "created": 1722049037,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lf5wkgt",
      "score": -1,
      "body": "When market goes down, stocks of the so-called dividend aristocrats go down so the dividend payments are getting hammered as well. Only hedging or pulling out will protect you from crashes, not bonds, not dividend queens. The reason why companies pay high dividends is to attract capital, not because it's nice or mature or shows success. And the same reason why small cap value is being promoted because solid investments are self promoting.\n\n\nSo if you don't want tresuries that pay over 5 percent right now, buy voo or vt and don't think that you can outsmart the market so easily",
      "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lf5wkgt/",
      "created": 1722070399,
      "depth": 0,
      "replies": [
        {
          "id": "lfg9dd1",
          "score": 2,
          "body": "“Dividend queens?” Show us where the dividends hurt you LMAO.",
          "permalink": "/r/stocks/comments/1ed4vmd/investing_300k_in_dividend_stocks/lfg9dd1/",
          "created": 1722234595,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}