{
  "title": "Motley Fool 10x Discovery Service 2020-2021 analysis as of July 2024",
  "score": 264,
  "selftext": "Today I found an old investment folder with recommendations of the Motley Fool 10x Discovery Service from when I was subscribed to their “All Access” pass that cost about $7000 (mid-2020 to mid-2021).  Despite the hype about outperforming the market, the Fool’s recommendations performed poorly for me and I discontinued the service. \n\nTo see what I had “missed out” on if I had held for the several-year timeline they recommend, I referenced the price of each stock at a midpoint in my subscription (arbitrarily selected at Jan 4 or 5, 2021) and today (July 26, 2024). Here are the results.\n\n|Stock|Jan 4 or 5, 2021|Jul 26, 2024|Return|\n|:-|:-|:-|:-|\n||\n|||||\n|Atlassian (NASDAQ: TEAM)|$ 233.38|$177.32|-24.02%|\n|Danimer Scientific (NYSE: DNMR)|$ 22.41|$0.52|-97.68%|\n|DermTech Inc. (NASDAQ: DMTK)|$ 31.97|bankrupt|-100.00%|\n|Invitae (NYSE: NVTA)|$ 45.54|bankrupt|-100.00%|\n|Kahoot (OB: KAHOT)|$ 11.50|$3.60|-68.70%|\n|Kinsale Capital Group (NASDAQ: KNSL)|$ 199.59|$443|122.10%|\n|Live Oak Bancshares (NASDAQ: LOB)|$ 45.53|$45.66|0.29%|\n|Piedmont Lithium (PLL)|$ 32.25|$10.67|-66.91%|\n|Social Capital Hedosophia Holdings Corp. IV (NYSE: IPOD)|$11 or $12?|$10 (closed in 2022)|small loss|\n|Schrödinger, Inc. (NASDAQ: SDGR)|$ 82.66|$22.42|-72.88%|\n|Adyen N.V. (OTC: ADYE.Y)|$ 20.95|$11.76|-43.87%|\n|Boston Omaha Corporation (NASDAQ: BOMN)|$ 27.29|$14.74|-45.99%|\n|COMPASS Pathways Plc (NASDAQ: CMPS)|$ 43.60|$8.03|-81.58%|\n|CuriosityStream Inc. (NASDAQ: CURI)|$ 16.45|$1.12|-93.19%|\n|Fiverr International (NYSE: FVRR)|$ 214.43|$22.72|-89.40%|\n|Opendoor Technologies Inc. (NASDAQ: OPEN)|$ 25.60|$2.52|-90.16%|\n|Shopify (NYSE: SHOP)|$ 111.87|$59.94|-46.42%|\n|Social Capital Hedosophia Holdings Corp. V (SoFi) (NYSE: IPOE)|$ 12.15|$10 (closed in 2022)|-17.70%|\n|Walker & Dunlop (NYSE: WD)|$ 88.86|$108.35|21.93%|\n|Zscaler (NASDAQ: ZS)|$ 193.48|$181.36|-6.26%|\n|Appian (NASDAQ: APPN)|$ 149.80|$37.75|-74.80%|\n|Bitcoin (CRYPTO: BTC)|$ 33,987.74|$67,959.47|99.95%|\n|CRISPR Therapeutics (NASDAQ: CRSP)|$ 160.62|$50.92|-68.30%|\n|CrowdStrike Holdings, Inc. (NASDAQ: CRWD)|$ 211.82|$256.16|20.93%|\n|Etsy (NASDAQ: ETSY)|$ 174.98|$62.27|-64.41%|\n|Fulgent Genetics (NASDAQ: FLGT)|$ 63.65|$23.66|-62.83%|\n|Lemonade, Inc. (NYSE: LMND)|$ 122.00|$23.42|-80.80%|\n|Pinterest (NYSE: PINS)|$ 68.42|$37.55|-45.12%|\n|Skillz, Inc.(NYSE: SKLZ)|$ 364.00|$6.44|-98.23%|\n|Zoom Video Communications (NASDAQ: ZM)|$ 360.83|$60.09|-83.35%|\n\nI was not able to find an exact price for Hedosophia IV (IPOD) in Jan 2021 as it shuttered in 2022, but it was also for a loss compared to the recommended price.\n\nMotley Fool 10x Discovery: -50.25% average return for the other 29 recommendations over this period.\n\nS&P 500: 45.65% return (3,748.14 to 5,459.1)\n\nNASDAQ: 36.69% return (12,698.45 to 17,357.88)\n\nMotley Fool 10x Discovery vs. S&P 500: -92.45%\n\nMotley Fool 10x Discovery vs NASDAQ: -83.50%\n\nOut of the 30 Motley Fool 10x Discovery recommendations, only 5 did not lose money. 10 recommendations lost 80% or more, with 3 falling to zero. Despite the claim of the “10x Discovery Service” to identify putative future “ten-baggers,” none of the stocks approached this return. At 18-22% inflation since January 2021, three of the five non-loss positions lost ground or were stagnant in inflation-adjusted returns (Live Oak Bankshare 0.29% return, CrowdStrike 20.93%, and Walker Dunlop at 21.93%). Only two had positive inflation-adjusted returns: Bitcoin (99.95%) and Kinsale Capital Group (122.1%).\n\nThe Fool’s 30 recommendations were overwhelmingly cash flow negative stocks with poor fundamentals. Nonetheless, their various services doubled down, for instance recommending Fiverr (FVRR) three times at over $200 within a four-month period. It sells for $22.72 today. While these recommendations did not discover any 10x returns, they did discover 1/10th returns. Lemonade (LMND) was another repeat recommendation across multiple Motley Fool services. It has fallen over 80% and continues to lose over $200 million annually with no clear path to profitability.\n\nThe Motley Fool’s comparisons of their claimed returns to the S&P 500 are misleading, as their recommendations here are overwhelmingly high-risk tech companies with poor fundamentals. Even the NASDAQ is not a good comparison as the latter is weighted towards larger, more stable and financially successful firms. Such comparisons also do not consider the that the \"risk premium\" of the Fool's highly speculative recommendations demands significantly higher returns to justify the risk. The proper peer group is (mostly speculative, mostly tech) cash-flow negative small-cap growth stocks.\n\nThe results do not support the Motley Fool's claims of outperformance for their 10x Discovery service. Different dates can be referenced for stock prices during my subscription period (mid 2020-mid-2021) with substantially similar results.\n\nMany of these recommendations are recycled among their various services. It is also my belief from these data and personal experience as an investor who bought virtually every recommendation across multiple premium services of the Motley Fool that their other services also widely underperformed the market during this period.\n\nDisclosures: I have small open positions on Zoom (ZM) and Bitcoin initiated earlier this year, but none related to my prior Motley Fool membership. I have no plans to initiate a position in any of the securities listed above in the next month.",
  "link_flair_text": null,
  "id": "1ed5rhh",
  "num_comments": 79,
  "created_utc": 1722047408,
  "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/",
  "comments": [
    {
      "id": "lf4tdsx",
      "score": 168,
      "body": "Fool is in the name, they want you to pay and also fund their exits.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf4tdsx/",
      "created": 1722047643,
      "depth": 0,
      "replies": [
        {
          "id": "lf4wlph",
          "score": 25,
          "body": "But I see so many ads and Motley Fool product placement articles telling me about the Next Nvidia. Why would they spend so much if they didn't have a crack money-printing investment team behind them?",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf4wlph/",
          "created": 1722049094,
          "depth": 1,
          "replies": [
            {
              "id": "lf6ffgg",
              "score": 9,
              "body": "You dont need millions of dollars to spend on ads. You only need couple of “fools”, each paying 7000 USD for their 10x Discovery, to fund a week or month of ads. And who knows, maybe the ads are already paid for by the stocks they promote.",
              "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf6ffgg/",
              "created": 1722082479,
              "depth": 2,
              "replies": [
                {
                  "id": "lf6squu",
                  "score": 8,
                  "body": "Whoosh?",
                  "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf6squu/",
                  "created": 1722088390,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lf9zgee",
          "score": 10,
          "body": "Motley Fool is easily the most overrated financial news and reportage site that currently exists. Imo, if Cathie Wood had a financial news website, it'd probably resemble the Motley Fool lol. \n\nI wish Google and other major search engines would de-boost their crappy-ass articles and ridiculous predictions. They add pointless noise to the tickers I research.",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf9zgee/",
          "created": 1722131887,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf6tfft",
          "score": 15,
          "body": "SEC should look into this thing. It's clearly misleading and hurts people (financially and mentally). This type of services generates FOMO for retail investors and they lose crap to of money.",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf6tfft/",
          "created": 1722088660,
          "depth": 1,
          "replies": [
            {
              "id": "lf6uy3n",
              "score": 5,
              "body": "A newsletter isn’t responsible for a retail investor’s shitty decision making. Stocks have risk and it’s up to the person whose putting their money on the line to do their homework",
              "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf6uy3n/",
              "created": 1722089237,
              "depth": 2,
              "replies": [
                {
                  "id": "lf9o56o",
                  "score": 7,
                  "body": "There are certain representations they made that were false or misleading as well as concern of ethical breaches. Not all of it can hide behind legalese and hand-waving.",
                  "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf9o56o/",
                  "created": 1722127011,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lfm1645",
                  "score": 1,
                  "body": "Motley Fool is no ordinary newspaper. They built and pimped a reputation as wise populist contrarians on a mission to level up the little guy to thrive in a market full of pro sharks.\n\nVery early on it really was like that but they evolved into something else.",
                  "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lfm1645/",
                  "created": 1722320983,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lf641n9",
          "score": 2,
          "body": "Everyone that doesnt \"just\" invest in the market is a fool, I dont understand the obsession in USA about stock picking. These fools cant even pick their own nose. - Then you got Cramer and Cathie woods. But there most be a market.",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf641n9/",
          "created": 1722075747,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf4wruv",
      "score": 75,
      "body": "Motley Frauds. Imagine if you could accuracy predict the market. You wouldn't sell your services to anyone. You would just go out there and make bank. \n\nWhat Motley Fool has always done is fake it till you make it. They are financial influencers, nothing more.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf4wruv/",
      "created": 1722049173,
      "depth": 0,
      "replies": [
        {
          "id": "lf5afcv",
          "score": 29,
          "body": "\"Look at this prediction we made in 1997. It has hissed 68000%. For more picks like this, subscribe to our legendary team\"\n\n\"What about your other picks that were hit trash\"\n\n\"Don't look at those. Just look at this.\"\n\nMotley fool exists to wreck new and ignorant investors.",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf5afcv/",
          "created": 1722056006,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf5vlp0",
          "score": 2,
          "body": "If I can be guaranteed to find just one 10x prediction, I would raise money from all my friends and family for that event and never work a day in my life.\n\n\nThe reason the company exists for many years means that all those years and they found 0 such unicorns.",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf5vlp0/",
          "created": 1722069710,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf533wi",
      "score": 25,
      "body": "I used their service around that time and was very active in the forums with analysts and other members. What I learned is that they’re just as susceptible to hype as the rest of us. Fast growth in a trendy market, and suddenly they ignore all sorts of red flags. \n\nA lot of the research and analysis is good, but you have to make the picks. Their picks are not good.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf533wi/",
      "created": 1722052173,
      "depth": 0,
      "replies": [
        {
          "id": "lf6pa0z",
          "score": 7,
          "body": "Those forums were the precursor to WSBs. ",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf6pa0z/",
          "created": 1722086951,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfhzepx",
          "score": 1,
          "body": "I’ve had some good picks from them that I thankfully jumped on (LRCX, VRTX). But those picks were in a sea of garbage picks. Even a stopped clock tells the right time twice a day applies here.",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lfhzepx/",
          "created": 1722266366,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf661ki",
      "score": 11,
      "body": "Honestly, $7000 for advice on puts that will 10x sounds like a steal.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf661ki/",
      "created": 1722077106,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf56tt7",
      "score": 18,
      "body": "Yep, just passing glance I noticed Motley Fools recommend some of the worse stocks out there.\n\nMaybe inverse Fools and short all the stocks they recommend to make money.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf56tt7/",
      "created": 1722054063,
      "depth": 0,
      "replies": [
        {
          "id": "lf58qs4",
          "score": 9,
          "body": "Is there an inverse Monty Fool ETF yet? ",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf58qs4/",
          "created": 1722055089,
          "depth": 1,
          "replies": [
            {
              "id": "lf5izl4",
              "score": 3,
              "body": "I’m in. I’d like it weighted with Cramer inputs and then for good measure apply better timing to Ark flips.",
              "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf5izl4/",
              "created": 1722061116,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lf5je0r",
      "score": 21,
      "body": "What was their recommended time horizon? Compare the performance to the Russell2k. These are mostly small caps which were all sold off in 2022 and have not recovered since then but if this week has taught us anything then that can quickly change.\n\nI don’t follow their stock recommendations but their podcast is actually pretty good. It is more about covering stock market news and giving insights into businesses.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf5je0r/",
      "created": 1722061370,
      "depth": 0,
      "replies": [
        {
          "id": "lf5kr9i",
          "score": 10,
          "body": "From my understanding, it is 5 years at the minimum.",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf5kr9i/",
          "created": 1722062253,
          "depth": 1,
          "replies": [
            {
              "id": "lfej2td",
              "score": 3,
              "body": "Someone spouting a 5 year plan and a history of underperformance?\n\n\n\nWhy does that sound so familiar...",
              "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lfej2td/",
              "created": 1722205650,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lf4upwx",
      "score": 12,
      "body": "I’ve used stock adviser and rule breakers for the past 4 years. I’ve had good experience with stock adviser. Most of those picks are doing well for me. There are some duds though. Rule breakers had a lot more duds. I keep contributing to the winners and sell off the losers. Not every pick is good and you have to be selective.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf4upwx/",
      "created": 1722048241,
      "depth": 0,
      "replies": [
        {
          "id": "lf4vjqh",
          "score": 16,
          "body": "Unfortunately, 93% of their 10x Discovery picks here were bad. it seems like their pricier services have worse results than the entry-level one, which as you note is also hit and miss.",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf4vjqh/",
          "created": 1722048611,
          "depth": 1,
          "replies": [
            {
              "id": "lf9ifzz",
              "score": 2,
              "body": "A 93% hit rate is kind of amazing. What if we bought 2 year put leaps based on their lists?",
              "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf9ifzz/",
              "created": 1722124740,
              "depth": 2,
              "replies": [
                {
                  "id": "lf9nrhh",
                  "score": 3,
                  "body": "It takes real talent to select so many losers. Much worse than random chance.",
                  "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf9nrhh/",
                  "created": 1722126851,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfuxmfl",
          "score": 2,
          "body": "You must be kidding. \n\nI lost a fortune following MF.\n\nCrowdStrike was the only stock that did well. \n\nETSY\n\nFIVR\n\nRING\n\nOut of 13 stocks, only 3 were up. The only thing that cushioned my 75-92% losses was CRWD\n\nYeah, thank God for my real estate holdings or I’d be looking for a job again\n\nFuck MF.",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lfuxmfl/",
          "created": 1722453059,
          "depth": 1,
          "replies": [
            {
              "id": "lfwe9q6",
              "score": 1,
              "body": "The foundational stocks performed well for me because lot of magnificent 7 in them. Outside of those Mercado libre, crowdstrike, trade desk, data dog, arista networks, axon, service now have been quite good. I did buy those duds as well but I hold for a while and sell them if they don’t perform well and the thesis remains mediocre.i keep contributing to winners when the price goes down short term. The process is as important as what you buy.",
              "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lfwe9q6/",
              "created": 1722470956,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lf54e0p",
          "score": 1,
          "body": "I've actually really like msn money's analyst rating. Keeps it simple and gives me a starting point",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf54e0p/",
          "created": 1722052807,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf66mv1",
      "score": 5,
      "body": "I sold NVTA at $30, after buying in at $14 on its way to $60, before now being delisted.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf66mv1/",
      "created": 1722077489,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf6jajm",
      "score": 5,
      "body": "That's actually really impressive with how terrible it is.\n\nI wonder if it was actually picks meant to give better returns, or if they were just trying to push certain stocks at people to fund certain high risk companies.  Would love to get an insider's view on this.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf6jajm/",
      "created": 1722084322,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf5a2kd",
      "score": 5,
      "body": "I fell out of love with the Fool when they continued recommending zero-earnings tech stocks as interest rates were rising and my MF portfolio bottomed out. They just don’t get it.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf5a2kd/",
      "created": 1722055810,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf5r5kv",
      "score": 4,
      "body": "I don't subscribe to any of their stuff, but I threw a little money at their ETF (TMFC) mostly to watch it.  Since I bought it in 2021, it's 12.8% annualized vs 9.97% for the S&P.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf5r5kv/",
      "created": 1722066565,
      "depth": 0,
      "replies": [
        {
          "id": "lf6t035",
          "score": 5,
          "body": "The thing about TMFC is that (1) it draws heavily or largely from the rating in the Fool’s community forums, rather than their analysts, current recommendations, (2) It excludes the smaller volume speculative stocks, and (3) it adds diversified vehicles like REITs That I have never seen recommended on their service.\n\nThanks for demonstrating my point. Skip their advisor recommendations and paid services. The investing community is more competent than their paid “experts.”\n\nhttps://fooletfs.com/our-funds/tmfc",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf6t035/",
          "created": 1722088494,
          "depth": 1,
          "replies": [
            {
              "id": "lfaihgr",
              "score": 1,
              "body": "Based on its holdings it's basically a growth ETF like VUG which has very close performance (charts look almost identical). It's like 50% MAG7 stocks.",
              "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lfaihgr/",
              "created": 1722140627,
              "depth": 2,
              "replies": [
                {
                  "id": "lfb0uw9",
                  "score": 1,
                  "body": "Yes. Normal stocks of healthy companies that bear little or no resemblance to their subscription service stock picks.",
                  "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lfb0uw9/",
                  "created": 1722151390,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lf6wdg1",
      "score": 6,
      "body": "My grandfather uses the Fool so I use his account to watch the live show (actually very good imo), some other videos they have and read some articles.\n\n\n\nBut out of curiosity with this post I just went on the stock advisor Rec tracker and went back 5 years and 10 years. \n\n\nOver 5 years they had about 123 recs. 69 picks are in the red, 92 picks are below the market return and 31 are beating the market. \n\n\n\nOver 10 years they had about 213 recs: 86 are in the red, 142 are below the market and 71 are beating the market. Note here they had 3 recs with over 1000% return above the market (one had 4200%). \n\n\n\nThey have their returns right there on the front page of the services so it’s not like they’re misleading anyone who cares enough to look. They definitely have some bad picks, but some of their bad picks are so obvious like on 3/16/23 they re rec’d RBLX, I don’t care how hyped the company is it isn’t worth $26B+. They’ve been recing Roblox for years even when it was in the $50B+ range. It’s just not possible the company is worth 5-10X unity or 2X take two, both of which have multiple good games compared to one mediocre game. \n\n\nBut then they have recs like TTD which is a great company with great financials and history. You can follow their recs back to 2017 and see it’s been a 10 bagger and each re rec has beat the market. Over the long term it is a great winner. The way to use Motley Fool is weed out the obvious shit companies and buy the good ones. They went downhill once they started pushing 2 recs a month, there just around that many GREAT companies. So they shot themselves in the foot and have to rec meh companies to get the 2 recs a month. \n\n\n\nAlso 90% of their “articles” are literally written by AI called “Jester AI”, those are straight dogshit. Some of their analysts are also meh. But finding a few analysts you like and reading their articles or watching their YouTube videos is very much worth the $100/yr for SA. There is no free ticket in the stock market, but the Fool can be used to cut the work down in half. Still need to put in work to actually do well.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf6wdg1/",
      "created": 1722089778,
      "depth": 0,
      "replies": [
        {
          "id": "lf7bonj",
          "score": 4,
          "body": "It's a numbers game strategy.\n\nAlso the 80/20 Pareto principle in effect.",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf7bonj/",
          "created": 1722095259,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lf9r1hi",
          "score": 4,
          "body": "Thank you. As you noted over 5 years with their mainline stock advisor service (less “risky” than 10x Discovery), stocks that lost capital outnumbered winners by *more than 2 to 1.* There’s a name for this. It’s called speculation and is not a prudent and reasonable “investment grade” wealth management strategy. As I noted, comparing to market index returns is misleading because it fails to account for the risk premium required to justify the far riskier strategy.\n\n“Just weeded out the bad ones.” Easy to say in retrospect with 20/20 hindsight, but much harder to  do prospectively.  Else why can’t the Fool’s genius experts make the right call upfront? Cutting the risky-appearing stocks is as likely to eliminate a potential winner as a loser.\n\nTheir recommendations seem like apes pushing buttons in the small cap speculative growth stock sector. Another thing that really turned me off to their service is lack of candor. it’s all hype-hype-hype about their recommended stocks with wild exaggerations and misrepresentations of their prospects, and a lack of frank disclosure about the company-specific risks and bear story. This alone is sufficient to make it unsuitable from my perspective.\n\nThe way they report alleged returns appears to me. I received multiple advertising messages from them touting the returns of one stock that did well and claiming this was representative of their service when the whole portfolio was massively down. The cognitive dissonance was too much for me and they lost all credibility in my eyes.\n\nTheir professed return rates for the different services often go back to remote periods with picks like Amazon or Netflix boosting their cumulative average and don’t accurately track returns of recommendations made in specific period. There are all kinds of ways to manipulate statistics to conceal negative results. \n\nThe whole reason why this post has been of community interest is that the full returns of (not cherry-picked) recommendations in specific recent periods is nowhere disclosed by the Motley Fool. A few big winners from years ago can hide many subsequent losers.",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf9r1hi/",
          "created": 1722128232,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf669tc",
      "score": 3,
      "body": "Their obliviousness to market conditions and cycles is astonishing for a firm that professes investment expertise. They doubled down on stinkers that were obviously doing poorly despite negative company specific and macro information and ignored meritorious concerns raised on their forums. As well as violating every core principle of basic Investing. It was insulting to one’s intelligence to see them hyping their few cherry-picked winners in constant ads to upsell their services while ignoring all of their stinkers, and spinning services that incurred net losses as being run by geniuses.\n\nTo be very clear, the Motley Fool and Tom and Dave Gardner make their money as promoters of their subscription services. Not from being financial prophets who outperform the market. If they were to disclose honestly, they wouldn’t have a business. Hence the hype, misrepresentation and lack of candor.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf669tc/",
      "created": 1722077256,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf8syll",
      "score": 3,
      "body": "Okay, but first let me tell you about the company that is going to be worth 30 Nvidia’s.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf8syll/",
      "created": 1722114590,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf7w1kl",
      "score": 2,
      "body": "I listen to their podcasts just for general market news everyday but have never invested in anything I’ve heard on their outside of blue chips. \n\nDoes anyone else have a pod that comes out daily that gives specific corporate news with some “real” analysis.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf7w1kl/",
      "created": 1722102482,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfcerci",
      "score": 2,
      "body": "I bet they 10x’d their money with the paid recommendations and your annual fee though.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lfcerci/",
      "created": 1722178726,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfm0yxh",
      "score": 2,
      "body": "This is solid gold… I had a free subscription for a year and couldn’t figure out what the value was. It seemed like it was a gimmick to get me to pay more to upgrade to some “even better class of information”. Oh, and “buy AMZM”",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lfm0yxh/",
      "created": 1722320853,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf5qvmv",
      "score": 4,
      "body": "Their stock picking really took a hit when David Gardner left. But to be fair, this is a list selected basically at the market top. The nature of a 10x list is that it is high risk, high reward. I suspect if you go back over the previous 10 years they have pretty good performance. I don't know if this 10x thing is just a one time list but that is generally in line with their general rule breaker type strategy. Pick 10 stocks, swing for the fences, and even if 7-8 of them fail you can still outpace the market with 2 of them doing really well. Many of their choices have done well more than 10x. And they don't generally sell even if the stock goes up a lot, so they actually get those gains. They basically let the losers go to zero. \n\nIn this list I know Fool has been in on Shopify for a long time before 2020. \n\nIn general though without David Gardner I think they've lost focus. And they've picked so many stocks that they have the problem most big funds have. Users won't pay unless they keep getting new ideas which means working down the list of good ideas to the less good ones. It used to be a couple stocks a month. Which is already probably too much.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf5qvmv/",
      "created": 1722066372,
      "depth": 0,
      "replies": [
        {
          "id": "lf6760i",
          "score": 5,
          "body": "That’s not true. It’s was not a market top, either within my 2020-21 subscription period or a longer time horizon. That’s why I presented S&P and Nasdaq comparisons. The Fool portfolio tanked with many of their stocks losing 80%+, where is the market indices have gone up and up.\n\nHigh risk, yes. High reward, no. I would get it if they had a a few stocks that didn’t take off in a basket of multiple big winners. But their portfolio recommendations were mostly moonshots that never had serious prospects of becoming viable businesses, as noted by multiple competent analysts at the time.",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf6760i/",
          "created": 1722077825,
          "depth": 1,
          "replies": [
            {
              "id": "lf76gb2",
              "score": 2,
              "body": "It was the top (or at least close to it) for SaaS companies and for speculative investments, that's why there are multiple SPACs on there as well, and multiple COVID beneficiaries. I don't know how the list is set up but something like DMTK isn't even in the same class as TEAM. Perhaps it's not a coincidence that your subscription happened to fall in that period. \n\nI'm just saying that one particular list is not really indicative of the Motley Fool in general, or stock picking in general. That's just one list amongst many services. \n\nBut also they're a shell of their former selves.",
              "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf76gb2/",
              "created": 1722093428,
              "depth": 2,
              "replies": [
                {
                  "id": "lf77cbu",
                  "score": 6,
                  "body": "You can look at the charts for the individual stocks, and they’re not generally at tops or bottoms on the price date. The utter failure of the Fool to understand longer-term company prospects as well as the macro environment, and the refusal to recommend selling stocks of declining companies that were obviously failing, are serious flaws not easily dismissed with handwaving.",
                  "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf77cbu/",
                  "created": 1722093744,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lf7bk8q",
          "score": 1,
          "body": "\"Pick 10 stocks, swing for the fences, and even if 7-8 of them fail you can still outpace the market with 2 of them doing really well. \"\n\nIt's a numbers game strategy.\n\nAlso the 80/20 Pareto principle in effect.",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf7bk8q/",
          "created": 1722095215,
          "depth": 1,
          "replies": [
            {
              "id": "lf7kfqh",
              "score": 3,
              "body": "Absolutely. For a long time, Fool was great at this. I generally ignore the fact that they never sell, and focus on the fact that they will reiterate the companies that are doing well. Private company investing is even more extreme. Unfortunately every decade or two you get a brand new group of investors getting in because of FOMO and getting burned.\n\nI was interested in the market in the 90's but I was young so I had no money. I didn't start investing until the early 2000s, reading as much as I can. It was a small enough amount that trading fees were a significant thing. But I bought a few stocks, and some did extraordinarily well. The problem is that right after the dot com crash, value investing and downside protection became pervasive. I thought I had to diversify. So whenever my stocks did well, I would sell them and buy other stocks. Usually those other stocks did not do as well. Buying Apple in 2002 allowed me to buy equal positions (relative to the original position size) in 10 other companies. But I would have been better off holding Apple. And it's not like I needed the money, or that I was risk averse. It was just the thing to do.\n\nWhen I learned to hold my winners, and even add to my winners (by winners I mean both the stock performance and company performance), my investing results really took off. I don't hold them to the point of being 90% invested in one stock but I start with a small 2-3% position and see what happens. Sometimes those end up crashing and burning eventually, but the original investment generally does well. And when the thesis no longer holds, I'll sell or start to trim until it's clear that things aren't turning around, or I find something I like better.\n\nI do not just buy because a service told me to. I certainly hope that this 10x service did not say \"buy equal positions in all of these and just HODL\". It's a starting point. DMTK basically had no revenue or earnings. TEAM was already a large company. NVTA had revenues but were spending almost twice as much as they brought in, even at fairly large scale. It was unclear whether they would ever turn the corner (obviously not). SHOP had been growing like crazy for 5 years since its IPO but still had a large TAM. FLGT and ZM were very clearly COVID beneficiaries. ZM in particular over that period drastically changed from a business perspective. It was clear that they had saturated their market and would rely on growing in other ways. It really depends whether you are talking about early 2020 or late 2020. Those Chamath SPACs basically went public saying whatever they wanted and it was always a bad idea. It's not surprising that SOFI is the only one surviving and it still can't shake that stink.\n\nIt used to be that a couple lead investors at Motley Fool were really monitoring their choices. Now it seems like they're just relying on a bunch of \"analysts\" for ideas. Even in retrospect, of the 20 or so companies on that list that I've at least sort of dug into, I can't say that I would argue with an assessment that \"these could 10x\". But blindly buying them and just hoping that 20% of them succeed is a bad move. At a minimum, it would have been easy to find some that were more likely than others to at least survive. It would be more interesting to see what a market cap weighted basket of these stocks did.",
              "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf7kfqh/",
              "created": 1722098387,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lf5tv1f",
      "score": 2,
      "body": "Did Motley Fool only give recommendations in 2021. And then stop in 2022, 2023,and 2024?\n\nI never get why these types of topics only do 2021. I want to see how the 2022, 2023, and 2024 stock picks did too.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf5tv1f/",
      "created": 1722068469,
      "depth": 0,
      "replies": [
        {
          "id": "lf67yuu",
          "score": 7,
          "body": "As explained, these are from my subscription period in 2020-2021. I saw the writing on the wall  and unsubscribed due to their services’ catastrophic underperformance and loss of capital. It was abundantly clear that their process is defective. I could no longer justify throwing good money after bad. \n\nBut you’re welcome to go for it. You can pour as much money as you want into it until you feel able to reach conclusions. Then come and present your findings here.",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf67yuu/",
          "created": 1722078328,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lf73flk",
      "score": 1,
      "body": "I used their services for a 1 year split 2 ways with a friend it was like 120$ yearly or something. \n\nI used recommendations that felt made sense for me. They helped me discover zoom early pandemic. One of the stock that gave me the most return cause I sold when it was still high.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf73flk/",
      "created": 1722092347,
      "depth": 0,
      "replies": [
        {
          "id": "lf7521g",
          "score": 2,
          "body": "Their recommendation is to hold for a minimum of five years. Their recommendation of Zoom is down over 83% in the chart above.\nEverybody’s a genius if you can buy at the bottom and sell at the top, and when the market is going to the sky. But what virtually all the comments here attest is that the few people that made money with the Fool’s recommendations did so by selectivity and deviating from their recommended process. That’s not much of an endorsement.",
          "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf7521g/",
          "created": 1722092928,
          "depth": 1,
          "replies": [
            {
              "id": "lf75m42",
              "score": 2,
              "body": "I’m not saying it was a good service. I took it as a service that gave me idea about stocks and than I make a judgement call. \n\nOf course the services in general is not worth the money. Especially if you follow 1 to 1 what they are telling you to do.",
              "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf75m42/",
              "created": 1722093128,
              "depth": 2,
              "replies": [
                {
                  "id": "lf76kzo",
                  "score": 1,
                  "body": "Absolutely. Of course, virtually all advisor services were recommending Zoom during the pandemic, and so this was hardly a stroke of insight.\n\nMuch more expertise is needed to understand the economic cycle and when it’s time to sell. I’m that count, they totally failed. And I think that’s a huge problem with their service. There were never sell recommendations or warnings that it’s time to get out of all of the cash flow negative zombie companies they’d been promoting. When competent analysts were recommending to get out, they were doubling down.",
                  "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf76kzo/",
                  "created": 1722093475,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lf8gyny",
      "score": 1,
      "body": "All active funds are trash.  If they had real insight to pick stocks everyone would figure it out pretty quickly, like Berkshire, and they'd grow large enough that they'd have too much drag on the market to not ruin their own performance due to a lack of liquidity.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf8gyny/",
      "created": 1722110160,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lffbk52",
      "score": 1,
      "body": "My experience using stock advisor over the past 5 years has been positive and lucrative",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lffbk52/",
      "created": 1722217294,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfh6773",
      "score": 1,
      "body": "Like George Costanza , do the opposite of what the Fools recommend.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lfh6773/",
      "created": 1722255361,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lflwk1j",
      "score": 1,
      "body": "No no no. You got it wrong. You pay for the discovery service, then buy 30% OTM Put LEAPS with an expiry 1 or 2 years out",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lflwk1j/",
      "created": 1722318151,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lsky8u6",
      "score": 1,
      "body": "I actually made money on CURI. I bought below 1.5. You can make money on stocks listed here, just not at the wrong price.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lsky8u6/",
      "created": 1729282415,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf56vbi",
      "score": 1,
      "body": "Yep, just from a passing glance, I noticed Motley Fools recommend some of the worse stocks out there.\n\nMaybe inverse Fools and short all the stocks they recommend to make money.",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf56vbi/",
      "created": 1722054086,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lf6oo1v",
      "score": 1,
      "body": "Don't",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lf6oo1v/",
      "created": 1722086692,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lu7xbbs",
      "score": 1,
      "body": "Exactly! I bought LMND and all stocks on their recommendations SUCKED!!! Waste of money and terrible advice they are just ripping people off and have 0 idea about stocks ",
      "permalink": "/r/stocks/comments/1ed5rhh/motley_fool_10x_discovery_service_20202021/lu7xbbs/",
      "created": 1730141056,
      "depth": 0,
      "replies": []
    }
  ]
}