{
  "title": "Stocks that outperform when treasuries fall",
  "score": 46,
  "selftext": "Historically, stocks and government treasury prices were negatively correlated.  Since 2020, however, they have been quite highly positively correlated.  SPY and TLT correlation 2002-2019 was -0.31.  SPY and TLT correlation 2021-present is +0.61.  \n\nSo stock and government bond prices have been moving together since the end of 2020.  I've been looking for stocks that have negative or near zero correlation to government treasuries from 2021 onward.  So, if treasury prices start to fall again, my whole portfolio won't tend to drop along with them.  \n\nAnd they are quite hard to find.  Three I've found so far are CB, MO and WTM.\n\nChubb Limited (CB) is a worldwide insurance provider that is based in Switzerland.  They have huge reserves that they invest to gain additional income.  When interest rates are higher, they make more investment income. In the most recent quarter, investment income was $1.5 billion vs $0.9 billion in the same quarter 2 years ago.  CB and TLT correlation is 0.03 since end of 2020.\n\nAltria (MO).  Tobacco company with very high revenue and low debt.  MO and TLT correlation is -0.10 since end of 2020.\n\nWhite Mountains Insurance (WTM).  Another insurance provider with large reserves that are invested for income.  Investment income was $194 million in most recent year vs. $82.5 million in 2021.  WTM and TLT correlation is 0.0 since end of 2020.\n\nI'd appreciate any feedback on the 3 stocks that I listed.  Any other stocks that do well when government bond prices fall?  Thanks.\n\n",
  "link_flair_text": null,
  "id": "1eeblmt",
  "num_comments": 21,
  "created_utc": 1722184665,
  "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/",
  "comments": [
    {
      "id": "lfd45lv",
      "score": 23,
      "body": "Interesting question and DD.  But I think TLT works differently than you’re suggesting - it correlates with SPY because it’s designed to move with bond prices not yields.  So as rates drop, bond prices rise and TLT rises.  So, theoretically, as rates begin to come down, TLT might be the easiest pick (and is leveraged against the 20-year so should advance faster than something like MO).   *I should add that your headline of “when treasuries fall” is broad - like a lot of recent headlines, “treasuries falling” could refer to prices or to yields.",
      "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/lfd45lv/",
      "created": 1722187527,
      "depth": 0,
      "replies": [
        {
          "id": "lfd4cae",
          "score": 6,
          "body": "PS. Your info on CB is interesting and may be why Berkshire Hathaway has carved out such a big stake over the past year",
          "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/lfd4cae/",
          "created": 1722187589,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfduwi3",
          "score": 3,
          "body": "When 20 year bond yield came to 4.8%, I bought good amount. In fact, I missed buying when it was 5.25% - rare chance to get. \n\nBenefit, I get constant coupon rate at 4.5%, but can trade it profitably when bond yield dips in future, say 3.25% later.\n\nI am waiting for another chance to buy bulk 20 year bond at high yields (if it comes).",
          "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/lfduwi3/",
          "created": 1722196779,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfd7r8e",
          "score": 2,
          "body": "I should have made the title more clear. In the title, I meant Treasury prices falling, so government yields increasing.\n\n  I was trying to say that most stocks now tend to drop when Treasury yields increase.  And in the past, that wasn't true at all.",
          "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/lfd7r8e/",
          "created": 1722188743,
          "depth": 1,
          "replies": [
            {
              "id": "lfdd9tx",
              "score": 3,
              "body": "It kinda hasn't worked like how it did from February 2021-February 2023 to be honest for over a year.\n\nIt's been low key until we saw the Nasdaq get blasted on July 11th, but the QQQ and TLT pair relationship that worked when inflation was a concern broke after the regional bank mess in early 2023. The only timeperiod in which it's worked like how it did when inflation was worrisome was August-October of 2023 when the US10Y rocketed higher from just below 4 to 5 very quickly, otherwise US bigs haven't really given two flips about treasury movements to be honest for over a year, it's how all of the major averages have made it past their previous record highs from late 2021-early 2022.\n\nIt's been small caps that have.\n\nIn all honesty, I'm not sure I'd be concerned about treasury rate movement for the time being. They've topped for the year, and have probably seen their cycle top.",
              "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/lfdd9tx/",
              "created": 1722190609,
              "depth": 2,
              "replies": [
                {
                  "id": "lfeyp7p",
                  "score": 1,
                  "body": "I’m buying TLT & even TMF pretty aggressively on dips based on this assumption. ",
                  "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/lfeyp7p/",
                  "created": 1722211898,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lfdec9l",
              "score": 3,
              "body": "I mean as fixed income yields increase money is removed from equities markets into fixed income.\n\nThat's actually quite typical as higher central bank rates are designed to curb investment activity ( amongst others ), and lower rates drives money out of fixed income and into equities and other investing activities.",
              "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/lfdec9l/",
              "created": 1722190977,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfe4fk2",
      "score": 5,
      "body": "Stocks that is heavily sensitive to rates. Like VZ and O",
      "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/lfe4fk2/",
      "created": 1722200108,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lff9n09",
      "score": 2,
      "body": "IWM",
      "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/lff9n09/",
      "created": 1722216465,
      "depth": 0,
      "replies": [
        {
          "id": "lff9zd9",
          "score": 1,
          "body": "I meant stocks that perform well when Treasury prices fall, so when rates rise.  Sorry the title was not clear.",
          "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/lff9zd9/",
          "created": 1722216613,
          "depth": 1,
          "replies": [
            {
              "id": "lffmmzi",
              "score": 0,
              "body": "Yes my reply is IWM",
              "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/lffmmzi/",
              "created": 1722222129,
              "depth": 2,
              "replies": [
                {
                  "id": "lffngjq",
                  "score": 1,
                  "body": "Ok. I was thinking small caps were more dependent on low rates than large and megas. But after looking at the data maybe that's not true.",
                  "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/lffngjq/",
                  "created": 1722222511,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lfh6tdh",
      "score": 2,
      "body": "I think you are looking at coincidence not correlation.\n\nAll stocks are longer duration versions of bonds. If interest rates are the only factor all stocks will drop along with bond prices. But we live in a screwed up world so it doesn't always work like that - coincidence. \n\nWith other factors included then maybe there are some sectors. Higher interest rates would mean the economy is stronger. Then you would look at economically sensitive sectors like banks and industrials. But some of the banks had mismatched lending - borrowing duration so they had some problems. Insurance companies are considered interest rate sensitive (inverse, higher investing income, payouts don't change) but that is also debatable because in the end how much money do the shareholders get from that?. This time interest rates didn't go up because of a strong economy, they went up because of high inflation. Trillions of liquidity was poured into the system.\n\nThere are many factors and it's hard to isolate a single one. And the expectations of the future are always changing.",
      "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/lfh6tdh/",
      "created": 1722255644,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lffp457",
      "score": 1,
      "body": "Sofi",
      "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/lffp457/",
      "created": 1722223291,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfgoyh7",
      "score": 1,
      "body": "Affirm is my bet for obvious reasons\n\nNon revenue generating pharma (Denali etc) is good as well",
      "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/lfgoyh7/",
      "created": 1722245336,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfffb02",
      "score": 1,
      "body": "RKLB 🚀",
      "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/lfffb02/",
      "created": 1722218896,
      "depth": 0,
      "replies": [
        {
          "id": "lffhpae",
          "score": 1,
          "body": "I didn't think of aerospace/defense stocks. Yes some of them have had significant negative correlation to TLT in recent years.  I wouldn't buy them personally for ethical reasons. But that's good to know. Thanks.",
          "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/lffhpae/",
          "created": 1722219929,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfdd914",
      "score": 0,
      "body": "I would assume you mean treasury rates fall, because rates falling means market value of treasuries goes up eh.\n\nOnce the yield inversion ends, mREITs will make money.  Those who borrow short term and lend long term.    IVR, for example.",
      "permalink": "/r/stocks/comments/1eeblmt/stocks_that_outperform_when_treasuries_fall/lfdd914/",
      "created": 1722190602,
      "depth": 0,
      "replies": []
    }
  ]
}