{
  "title": "McDonald's earnings, revenue miss estimates as consumer pullback worsens ",
  "score": 5396,
  "selftext": "McDonald’s on Monday reported quarterly earnings and revenue that missed analysts’ expectations as same-store sales declined across every division.\n\nHere’s what the company reported compared with what Wall Street was expecting, based on a survey of analysts by LSEG:\n\nEarnings per share: $2.97 adjusted vs. $3.07 expected\n\nRevenue: $6.49 billion vs. $6.61 billion expected\n\nThe fast-food giant reported second-quarter net income of $2.02 billion, or $2.80 per share, down from $2.31 billion, or $3.15 per share, a year earlier. Excluding charges related to the future sale of its South Korean business and other items, McDonald’s earned $2.97 per share.\n\nIts quarterly revenue of $6.49 billion was flat compared with the year-ago period.\n\nMcDonald’s same-store sales shrank 1%, missing StreetAccount estimates for growth of 0.4%. It’s the first time companywide same-store sales have fallen since the fourth quarter of 2020.\n\nIn the U.S., McDonald’s same-store sales decreased 0.7% for the quarter. A year ago, the chain reported U.S. same-store sales growth of 10.3%, thanks to its popular Grimace Birthday Meal.\n\nBut in the 12 months since, more consumers have cut back their restaurant spending, particularly at fast-food chains, which they no longer see as a good deal. McDonald’s said foot traffic to its U.S. restaurants fell during the quarter.\n\nExecutives previously warned that the competition for customers had become more fierce as the consumer environment weakened.McDonald’s is leaning into discounts to bring back diners. The chain launched a $5 meal deal in late June, five days before the end of the quarter.\n\nA week ago, the company told its U.S. system that it plans to extend the value meal past the planned four-week runtime and said that it’s bringing back customers.\n\nMcDonald’s is trying to lure in diners outside of the U.S., too. Its international operated markets division, which includes large segments like France and Germany, saw its same-store sales slide 1.1% in the quarter.\n\nThe company’s international developmental licensed markets unit, which includes China and Japan, reported same-store sales declines of 1.3%. McDonald’s is still dealing with the fallout from boycotts of the brand in the Middle East, and sales in China continue to struggle.\n\nSource: https://www.cnbc.com/2024/07/29/mcdonalds-mcd-q2-2024-earnings.html",
  "link_flair_text": null,
  "id": "1eewy23",
  "num_comments": 1312,
  "created_utc": 1722251925,
  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/",
  "comments": [
    {
      "id": "lfh3qkm",
      "score": 886,
      "body": "1 hashbrown is $2.49 in my area. That’s absurd.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh3qkm/",
      "created": 1722254186,
      "depth": 0,
      "replies": [
        {
          "id": "lfhf70i",
          "score": 231,
          "body": "Felt a little light-headed while I was out the other morning, and stopped in for a BEC McMuffin with a hashbrowns and an orange juice. 9.58. I threw a box of granola bars and a case of water in the backseat for the future. Fuck that.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhf70i/",
          "created": 1722259203,
          "depth": 1,
          "replies": [
            {
              "id": "lfjcuka",
              "score": 13,
              "body": "I flash back to my college days but four sandwiches and a fries for $5.35 during my college days…my god how do the kids survive..",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfjcuka/",
              "created": 1722282224,
              "depth": 2,
              "replies": [
                {
                  "id": "lflh9tz",
                  "score": 5,
                  "body": "I flash back to middle school with $.29 cent hamburgers on Wednesdays and $.39 cheeseburgers on Sundays. I’m 37.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lflh9tz/",
                  "created": 1722310149,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lfi4q91",
              "score": 37,
              "body": "Good on you for thinking ahead. \n\nNow do the same for coffee and you'll be saving so much each month.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfi4q91/",
              "created": 1722268101,
              "depth": 2,
              "replies": [
                {
                  "id": "lfir20m",
                  "score": 46,
                  "body": "Instructions unclear, threw a cup of coffee in the backseat and now the seats are stained and the car reeks of stale coffee.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfir20m/",
                  "created": 1722275290,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfirn4m",
                      "score": 6,
                      "body": "Mine smells like mustard.",
                      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfirn4m/",
                      "created": 1722275473,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lfkhzk4",
                      "score": 5,
                      "body": "dude one time my dad got a little caesars pizza for me on his way home from work. unfortunately he spilled his coffee all over it. i did still end up eating it 4/10",
                      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfkhzk4/",
                      "created": 1722296201,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lfitsdh",
              "score": 28,
              "body": "I had the same reaction with the same order. I didn’t pay for it though. “Did you say $12?” “Yes”. Just laughed, said nvm that’s too much for a shitty breakfast and drove away.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfitsdh/",
              "created": 1722276147,
              "depth": 2,
              "replies": [
                {
                  "id": "lfj4e3x",
                  "score": 15,
                  "body": "Oh I feel you, and if I hadn't felt my blood sugar being low I would have drove off too, but the truth is there really isn't anywhere you can stop for much less than that. Even a Wawa, Royal Farms, Buds, etc gets you for 7 or 8 by the time you get a sandwich and a drink. Gotta just plan ahead better. I am not someone short on cash, but the more money I make, the less I want to give any of it away to these fucks.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfj4e3x/",
                  "created": 1722279484,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfnmlsx",
                      "score": 4,
                      "body": "Think outside the box, you can get a full meal at a supermarket that sells plates of hot food, like Publix, aldi, depends on where you are. But they are super cheap. $6-7 bucks for a meal",
                      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfnmlsx/",
                      "created": 1722350645,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lfh8qd2",
          "score": 89,
          "body": "I don’t go to McDonalds anymore but if I did there is no way I’ll be paying $2.50 for 1 hashbrown.  You can buy 10 at the store for $4-5.  8 minutes in the air fryer and they are great!",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh8qd2/",
          "created": 1722256513,
          "depth": 1,
          "replies": [
            {
              "id": "lfhnn4z",
              "score": 49,
              "body": "My local Aldi has a package of hashbrown patties, like 20-25 of em, $4.99.\n\nI've not been to McDick's in literal years, not missing much.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhnn4z/",
              "created": 1722262377,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfig0ic",
              "score": 3,
              "body": "That's really *never* been the argument to take to convince someone not to do *fast* food.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfig0ic/",
              "created": 1722271778,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfhbez1",
          "score": 18,
          "body": "Same here it's 2.69 here in Brooklyn,NY. It's ridiculous. I loved the hashbrown with BEC. On biscuit, but now it's stupid expensive",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhbez1/",
          "created": 1722257665,
          "depth": 1,
          "replies": [
            {
              "id": "lfi19mu",
              "score": 17,
              "body": "My jaw dropped when I ordered 3 hash browns and it was almost $10. Didn't these used to be 50 cents to a dollar?\n\nMy car insurance went up $1000 this year. I'm starting to feel  being priced out of NYC.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfi19mu/",
              "created": 1722266975,
              "depth": 2,
              "replies": [
                {
                  "id": "lfijm7c",
                  "score": 9,
                  "body": "Yeah it was 2 for a dollar like 15 years ago. Obviously prices increase, but potatoes are cheap as fuck. 2.50 for a single hash brown is insanity. I haven't been back to McDonald's after losing my mind in DC that a hash brown was nearly 3 bucks. I didn't even pay for it and I was upset.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfijm7c/",
                  "created": 1722272930,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lfh0yho",
      "score": 3469,
      "body": " Good. They need to pull back their prices it’s literally a joke what it costs now",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh0yho/",
      "created": 1722252779,
      "depth": 0,
      "replies": [
        {
          "id": "lfh4zxj",
          "score": 537,
          "body": "Around here, every other plaza has opened up a smash burgers spot selling all sorts of basic and creative toppings for the same or mostly lower price as McDonalds.\n\n  Why should I go to McDonalds when I can get a better, juicier burger than MacDonalds? ",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh4zxj/",
          "created": 1722254793,
          "depth": 1,
          "replies": [
            {
              "id": "lfhybzn",
              "score": 258,
              "body": "Can we also talk about how small and thin their patties are? It's like eating a scrap of shed skin from a burger snake. There's NO meat anymore, you're just eating bread and mayonnaise.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhybzn/",
              "created": 1722266012,
              "depth": 2,
              "replies": [
                {
                  "id": "lfib8xz",
                  "score": 169,
                  "body": "Or how when you order a large fry you end up getting a medium fry cosplaying as a large.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfib8xz/",
                  "created": 1722270232,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfivxgk",
                      "score": 105,
                      "body": "Last time i went, i ordered medium fries, and i was given the paper container that used to be for small fries. I had to double check my order to make sure i was given the right one. Their portions has gotten a lot smaller and their prices has skyrocketed. They are not worth it anymore not even for a quick meal.",
                      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfivxgk/",
                      "created": 1722276825,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfiwusn",
                          "score": 72,
                          "body": "Nope. You pay the $4 for a large fry and end up with $1.50 worth of fries. \n\nMy fiancée and I went a few weeks ago to just get two large fries, and you could’ve combined them both and still not get a large fry with what we got. Then when you go in and ask them to fix it, they look at you like you’re the problem. \n\nYou can cliff dive off the point where McDonald’s quality dropped.",
                          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfiwusn/",
                          "created": 1722277115,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lfj1qtj",
                              "score": 18,
                              "body": "I do hope their revenue miss makes them reflect on it and makes them focus on either quality or lowering prices.",
                              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfj1qtj/",
                              "created": 1722278642,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lfj3j2j",
                              "score": 3,
                              "body": "The managers force the workers to fluff the fries so yo get less and everyone's so over worked that when you ask for more it slows down the whole process. Not trying to say your wrong but the workers would have no issue filling the boxes. They litteraly have meetings amoung managers and talk about how much fries are being wasted by packing the boxes",
                              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfj3j2j/",
                              "created": 1722279210,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lfj7a0l",
                          "score": 20,
                          "body": "The portions are definitely smaller. Medium order of fries is 310 calories. I remember when they used to be over 400 calories.",
                          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfj7a0l/",
                          "created": 1722280413,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lfigx6f",
                  "score": 27,
                  "body": "I haven't eaten a McDonald's burger in at least 15 years. I remember their patties always being maybe 1/4\" thin. And then of course the whole burger itself, once assembled, would be smashed flat for some reason too. \n\nOn the flip side, their breakfast sandwiches still slap. I'll only ever get brekkie there.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfigx6f/",
                  "created": 1722272068,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfjhjcj",
                      "score": 8,
                      "body": "The steak egg and cheese bagel is my favorite item on the menu",
                      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfjhjcj/",
                      "created": 1722283704,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lfijury",
                  "score": 16,
                  "body": "Anymore? Bro it's literally been this way the whole time lmao. It just made some sense when the burgers were cheap, but now they are not.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfijury/",
                  "created": 1722273006,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lfjhtgs",
                  "score": 8,
                  "body": "If that \"scrap of shed skin from a burger snake\" is yours, please consider writing as a hobby or career!",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfjhtgs/",
                  "created": 1722283791,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lfihnrl",
              "score": 18,
              "body": "What?!  You don't like paying $2.69 for a cheeseburger that looks like someone sat on it for a few hours?",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfihnrl/",
              "created": 1722272303,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfkp31s",
              "score": 10,
              "body": "I’m in California and for the last 20 years In-N-Out has crushed them on prices, quality and quantity so I’ve never willing bought their food unless in a hurry and forced by the nugget fiends in the back seat.\n\nMy wife likes their McCafe drinks and started getting them as the drive thru was often faster than Starbucks and they were cheaper. Now it’s somehow slower than Starbucks and the same price. No idea how McDonalds has totally bungled their operations the way they have.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfkp31s/",
              "created": 1722298871,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfj11wz",
              "score": 11,
              "body": "I can get a Big Mac meal that doesn’t even fill me up. More calories than I need but no fiber so I feel hungry.\n\nOr for the same price I can get a giant box of veggies, rice, a spring roll, and tons of chicken and beef. It’s so much I can’t finish it and I can eat. \n\nHard choice lol",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfj11wz/",
              "created": 1722278423,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfjtdbb",
              "score": 8,
              "body": "Literally same, a friend of my brothers opened one and it’s incredible. It’s like $7 for a single, which I don’t personally think is outrageous, but it’s fucking incredible, fresh, and I’m supporting a local as opposed to some multi billionaire dollar shit stain. \n\nGo local.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfjtdbb/",
              "created": 1722287454,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfh3vsy",
          "score": 661,
          "body": "Ive stopped going almost a year now. They get the odd coffee purchase from me. Ridiculous prices I’ll buy a steak instead of one of there meals. They cater to a lazy client base.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh3vsy/",
          "created": 1722254258,
          "depth": 1,
          "replies": [
            {
              "id": "lfh7hw9",
              "score": 331,
              "body": "When their QPC meal hit $10.59 here.. I poked around and noticed I could go to Buffalo Wild Wings and get their $10 lunch deal and get a real burger / fries / drink.  Of course they've been packed for a year now and went to $11, but still- I won't go to McD's on principle now.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh7hw9/",
              "created": 1722255953,
              "depth": 2,
              "replies": [
                {
                  "id": "lfhl58e",
                  "score": 119,
                  "body": "Even Chili's has a 10.99 meal that probably dwarfs anything offered by McDs.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhl58e/",
                  "created": 1722261476,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfjn6ii",
                      "score": 21,
                      "body": "Best restaurant secret right now imo. $10.99 for a nice chilis burger, side, and drink. Somehow they can do it but McD’s claims they have to charge more than that for worse food because their costs went up. Fast food is supposed to be cheaper than a sit-down restaurant, and McDs is supposed to be the cheapest. Figure it out.",
                      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfjn6ii/",
                      "created": 1722285473,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfljf4y",
                          "score": 4,
                          "body": "Not trying to defend McDonald's at all, but its because they have to pay their workers $15 an hour now in most states, meanwhile the restaurants are only paying $2.13 an hour while the customer pays their employee salaries via tips.",
                          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfljf4y/",
                          "created": 1722311150,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lfhfnnr",
                  "score": 56,
                  "body": "I tried their $10 lunch meal a month ago with my father. We were blown away by how good it was and the generous portions. Their burgers are surprisingly good too. I had never had anything but the wings.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhfnnr/",
                  "created": 1722259384,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfhjkyp",
                      "score": 46,
                      "body": "Sounds like a joke but Chili's has amazing burgers too and awesome lunch deals as well.",
                      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhjkyp/",
                      "created": 1722260901,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfhu1kx",
                          "score": 28,
                          "body": "People sleep on chilis.",
                          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhu1kx/",
                          "created": 1722264587,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lfi8yk5",
                  "score": 7,
                  "body": "You also get a human to order with instead of doing it yourself. If everything is self serve, it should be cheaper, not more expensive.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfi8yk5/",
                  "created": 1722269488,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lfhe5l7",
              "score": 40,
              "body": "^ Jacked their prices so high. And trying to force an app on their customers.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhe5l7/",
              "created": 1722258792,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfh3icz",
          "score": 39,
          "body": "We only go if we can use coupons for free stuff. Even then it's RARE",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh3icz/",
          "created": 1722254075,
          "depth": 1,
          "replies": [
            {
              "id": "lfh4h8b",
              "score": 75,
              "body": "Everyone hates the Apps for fast food, but it’s literally the only way for it to be remotely affordable anymore.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh4h8b/",
              "created": 1722254545,
              "depth": 2,
              "replies": [
                {
                  "id": "lfh4sn3",
                  "score": 35,
                  "body": "I hate them because they prevent you from using more than 1. When they are paper the kid making $8 behind the counter doesn't give a fuck how many you use.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh4sn3/",
                  "created": 1722254696,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfh7pn7",
                      "score": 8,
                      "body": "You basically HAVE to use the 20% off mobile order deal. \n\nThen it stockpiles points and you can one day go into a mcdonalds and use them all.",
                      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh7pn7/",
                      "created": 1722256050,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lfhlwbg",
                  "score": 29,
                  "body": "They have artificially inflated the price to sell it back to you through an invasive and dangerous app,  to make you think youre getting a deal. This is highly unethical imo. No doubt they are also selling your data when you agree to buy through the app as well.\n\n\nNo different than those fire sale stores who claim the 20$ item is worth $200, and the sale that brings it down to 19.95, is the best deal youve ever seen.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhlwbg/",
                  "created": 1722261747,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lfiatwg",
                  "score": 9,
                  "body": "Yeah their gameplan to force people to use their apps for better prices, so they can turn around and sell the data, has failed miserably. People would rather not go to a restaurant than download an app that needs access to all the data on their phone to get an only slightly insane price. If you're trying to get me to install something on my phone to physically buy something, I'm never going to be your customer.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfiatwg/",
                  "created": 1722270094,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfhe27g",
          "score": 53,
          "body": "\"JuSt GeT tHe ApP.\" No thanks. I'll just not eat at an overpriced app requiring fast food joint.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhe27g/",
          "created": 1722258755,
          "depth": 1,
          "replies": [
            {
              "id": "lfhtsw3",
              "score": 18,
              "body": "Any time a company requires me to download an app I automatically dislike them",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhtsw3/",
              "created": 1722264506,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfhl3ge",
          "score": 35,
          "body": "When McDonald’s costs more than in n out something is wrong with McDonald’s strategy. Way worse food, quality, and experience for the same price or more? That’s a hard no ",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhl3ge/",
          "created": 1722261459,
          "depth": 1,
          "replies": [
            {
              "id": "lfi98fj",
              "score": 9,
              "body": "And you don’t need an app!",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfi98fj/",
              "created": 1722269578,
              "depth": 2,
              "replies": [
                {
                  "id": "lfidk0e",
                  "score": 10,
                  "body": "And you get actual service and a clean restaurant. Workers are also paid well. Weird how that works",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfidk0e/",
                  "created": 1722270986,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfhcz30",
          "score": 71,
          "body": "It brings me immense joy to see places like McDonalds and Chipotle starting to feel the hurt (CMG fell 20% this past month alone) because they refuse to stop being greedy fucks.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhcz30/",
          "created": 1722258311,
          "depth": 1,
          "replies": [
            {
              "id": "lfhtoia",
              "score": 23,
              "body": "Chipotle costs the same as McDonalds and is leagues above.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhtoia/",
              "created": 1722264464,
              "depth": 2,
              "replies": [
                {
                  "id": "lfi4rfx",
                  "score": 7,
                  "body": "Yeah. I still buy Chipotle. Say all you want about their portion control these days (which still varies greatly based on location), I can get a meal that costs only a little bit more but is double the quality. Heck its the same cost if I use any of my points to get a discount.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfi4rfx/",
                  "created": 1722268112,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfh5qr6",
          "score": 25,
          "body": "Ya. Prices doubled for their cardboard patty Mcbugers. This was predictable",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh5qr6/",
          "created": 1722255149,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfh4dyi",
          "score": 95,
          "body": "I feel like this title needs more.  “…as consumer pullback worsens due to companies greed.”",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh4dyi/",
          "created": 1722254501,
          "depth": 1,
          "replies": [
            {
              "id": "lfh5vac",
              "score": 44,
              "body": "That’s the correct outlook. How did they perform against the broader restaurant market? Because I’ve got three kids and it’s at least $75 to eat at McDonald’s. I might as well go to a sit-down restaurant, and so we do.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh5vac/",
              "created": 1722255207,
              "depth": 2,
              "replies": [
                {
                  "id": "lfh6g0w",
                  "score": 24,
                  "body": "For sure.  I just hate how the title makes it feel like it’s not their fault they missed their earnings.  No, no it’s the consumer that killed our earnings!  Those rotten millennials, curses! ",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh6g0w/",
                  "created": 1722255475,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfh6pit",
                      "score": 6,
                      "body": "Absolutely",
                      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh6pit/",
                      "created": 1722255597,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lfhhb9i",
          "score": 10,
          "body": "They're all like that. My wife and I went to Hardee's two days ago and ordered two breakfast biscuits and that's it. The total was almost $15 so we left instead.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhhb9i/",
          "created": 1722260038,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfh6al5",
          "score": 18,
          "body": "All I would ever get was their 6.99 for 20 nuggets and 2 fries deal. They got rid of it and I’m never gonna eat there unless there’s similar deals like that. Other than using the points I gained and I feel their food has just gotten worse and worse.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh6al5/",
          "created": 1722255405,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfhihn8",
          "score": 14,
          "body": "This has to be the main reason. I literally laughed and walked out when I saw the prices, and that was like 5 years ago, can't even imagine today.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhihn8/",
          "created": 1722260488,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfhghe5",
          "score": 15,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhghe5/",
          "created": 1722259710,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfhfvj0",
          "score": 8,
          "body": "Yup. I only go rarely now for happy meals or the 20 piece for $5 deal via the app. Everything is ludicrously priced. ",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhfvj0/",
          "created": 1722259471,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfhlelv",
          "score": 7,
          "body": "It’s so shitty for what it is too. Much better alternatives",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhlelv/",
          "created": 1722261569,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfhwwyw",
          "score": 5,
          "body": "I used to go for the 2 doubles for $3.50 deal. Great deal, amazing. They replaced it with a 30% off a single McDouble.\n\nFuck that.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhwwyw/",
          "created": 1722265539,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfh4quj",
          "score": 18,
          "body": "I’m never ever going to Mc Donald’s unless I want a milkshake which is about the only thing that’s worth buying there. Garbage food for garbage bodies 🤮",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh4quj/",
          "created": 1722254672,
          "depth": 1,
          "replies": [
            {
              "id": "lfh6uav",
              "score": 17,
              "body": "> want a milkshake\n\nOnly if the ice cream machine is not down!\n\nLol i did love McFlurry growing up, but over the years it has been painful trying to find any branch that has a working ice cream machine.\n\nEventually i stopped trying anymore.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh6uav/",
              "created": 1722255656,
              "depth": 2,
              "replies": [
                {
                  "id": "lfh8206",
                  "score": 14,
                  "body": "Their ice cream machines are all controlled by 1 single supplier and they are designed to break so that their technicians have to be called to the franchises to fix them often.\n\nThat and they have to be cleaned and maintained very specifically, which the workers don't give a fuck about doing.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh8206/",
                  "created": 1722256207,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lfh8wvi",
                  "score": 3,
                  "body": "I’ll give them that their fries and ice cream is not bad as well.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh8wvi/",
                  "created": 1722256594,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfhvjb8",
          "score": 5,
          "body": "Especially when they forget to remove the piece of paper separating the meat patties as I had the pleasure of experiencing recently.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhvjb8/",
          "created": 1722265079,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfhxgg0",
          "score": 4,
          "body": "That and the app sucks now. Barely any deals. It was better when we received monthly coupon by the mail... I keep getting the shittiest deals on the app that I don't bother going anymore.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhxgg0/",
          "created": 1722265718,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfjywe6",
          "score": 4,
          "body": "Their sales fell globally not so much in the US. This is more about their activity in Israel and a growing general hatred of US corporations. Starbucks is seeing the same of course. Prepare for many more US companies to see declining revenue across much of the rest of the world.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfjywe6/",
          "created": 1722289308,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfh5lp9",
          "score": 11,
          "body": "Whichever marketing maven introduced the Travis Scott meal was a goddamn genius. They paired trash food with illustrious celebrities thereby elevating the perceived value.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh5lp9/",
          "created": 1722255081,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfh1og9",
      "score": 965,
      "body": "Prices are too high. And the customer is tired of being required to have \"the app\" to get good prices here. I used to find a line at my mcdonalds at rush hour.. no more.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh1og9/",
      "created": 1722253155,
      "depth": 0,
      "replies": [
        {
          "id": "lfh71zz",
          "score": 366,
          "body": "Completely agree. I’m not going to go to McDonald’s to pay $15 for a Big Mac combo when I could go to a local shawarma spot and get a fresh salad, chicken, potatoes, rice for the same price.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh71zz/",
          "created": 1722255752,
          "depth": 1,
          "replies": [
            {
              "id": "lfhmap4",
              "score": 108,
              "body": "There’s a halal place by our office that has a lamb and chicken mix over rice for ten bucks.  \n\nMcDonald’s has completely lost the plot",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhmap4/",
              "created": 1722261893,
              "depth": 2,
              "replies": [
                {
                  "id": "lfj3mlr",
                  "score": 19,
                  "body": "A super nice sit down restaurant in my town has amazing burgers for $15 and it comes with good Cajun fries. Literally no reason to go to McDonald's",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfj3mlr/",
                  "created": 1722279241,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lfjitid",
                  "score": 12,
                  "body": "“Sorry about the $10 salads, we forgot our niche was being inexpensive crap.”",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfjitid/",
                  "created": 1722284100,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lfhlgnn",
              "score": 63,
              "body": "Shwarma restaurants have got to be absolutely annihilating the fast food industry.  They're everywhere now, and are relatively good value, and usually tasty.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhlgnn/",
              "created": 1722261590,
              "depth": 2,
              "replies": [
                {
                  "id": "lfhsvoh",
                  "score": 41,
                  "body": "this. you also have to realize that when you buy a shitdonalds hamburger, 90% of the sale of tha tburger goes to the shareholders (who just want more and more and MORE) , executive/middle management bonuses, advertising costs, and revonated fancy \"luxury\" storefronts. \n\nyou buy from a schwarma shop and almost all of that revenue just goes to support local overhead (employee pay, store leasing, equipment etc) and the owner. \n\nthere is no need to satisfy shareholders and upgraded stores and executive bonuses. \n\nhence, they can sell for less, whereas mcdonalds jhas to sell for more.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhsvoh/",
                  "created": 1722264194,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfilb2p",
                      "score": 8,
                      "body": "\"90%\" 🙄\n\nThought I was on r/politics instead of a stock sub for a second. Interest expense alone is 6% of their revenue.",
                      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfilb2p/",
                      "created": 1722273468,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lfix2zc",
                      "score": 3,
                      "body": "> 90% of the sale of tha tburger goes to the shareholders\n\nNet profit margin is circa 30% for mcdonalds so that's obviously not true",
                      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfix2zc/",
                      "created": 1722277186,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lfj9ckk",
              "score": 3,
              "body": "I have a gyro place closer to me than McDonald's - their regular gyros are $8 and I can get two gyro combo meals for $18.\n\nlike lol what",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfj9ckk/",
              "created": 1722281087,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfhci44",
          "score": 115,
          "body": "Yeah “the app” makes me want to commit a felony. People’s phones are saturated with apps. Enough of your “points” too. It’s predatory when a fast food chain wants to take up real estate on your phone and in your head.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhci44/",
          "created": 1722258113,
          "depth": 1,
          "replies": [
            {
              "id": "lfhei2r",
              "score": 39,
              "body": "Then the person in front of you pulls out their phone and tries to fire up the app and.... wait it froze... well wait while i reset my phone..",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhei2r/",
              "created": 1722258932,
              "depth": 2,
              "replies": [
                {
                  "id": "lfhox6s",
                  "score": 16,
                  "body": "My phone is brand fucking new and the app still runs like apps on my 9 year old iPhone 7 did. It’s insane how shitty it is.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhox6s/",
                  "created": 1722262830,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfinpin",
                      "score": 7,
                      "body": "I like how the McDonald’s app has like a million pop up’s I have to dismiss before I can take actions.",
                      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfinpin/",
                      "created": 1722274231,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfinwr4",
                          "score": 3,
                          "body": "And how they don’t react to being dismissed. Jfc I’ll hit the X 5 times and it’ll move halfway down the screen then jump back up.",
                          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfinwr4/",
                          "created": 1722274295,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lfhq45u",
              "score": 26,
              "body": "My wife had the app.  One day we were driving, and we hear the McD's jingle coming from her pocket.  The app literally was advertising to her while in her pocket.\n\n**Immediate** uninstall.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhq45u/",
              "created": 1722263248,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfhztde",
              "score": 5,
              "body": "The app also leaked people info.  \n\nhttps://www.cybersecurity-insiders.com/cyber-attack-on-mcdonalds-app-leaks-info-of-2-2-million-users/  \n\nAlso the app tracks what you buy and give you discount according to it. The CEO says it's to give discount on what you buy the most. The reality is you are a test ground to see how far they can go.   \n\nhttps://www.1news.co.nz/2023/08/10/marketing-expert-weighs-in-on-mcdonalds-app-deals-controversy/    \n\n>\"So they’re using your data in order to make a price that they think is going to attract you,\" Giroux said.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhztde/",
              "created": 1722266500,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfhtqap",
          "score": 18,
          "body": "The fact that their revenues only fell 0.7% YoY implies the consumer is not tired of the prices yet tbh. It’s not growth, and clearly shows that some people are pulling back, but it’s not a decrease in sales that anyone would notice without having the data in front of them. It basically means McDonalds is just as busy as it was last year.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhtqap/",
          "created": 1722264482,
          "depth": 1,
          "replies": [
            {
              "id": "lfib0zq",
              "score": 8,
              "body": "From Micky D's point of view it is not a 0.7% decrease, as they would normally have been expecting a year-on-year increase.  Last year (same quarter), the increase was over 10%, so there is at least a 10% drop in (Edit: 'Expected')  earnings.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfib0zq/",
              "created": 1722270160,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfh8toa",
          "score": 43,
          "body": "I don't know how they thought making a promotional $5 meal would change things and bring people back. A In-n-Out meal is half the price and taste better.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh8toa/",
          "created": 1722256555,
          "depth": 1,
          "replies": [
            {
              "id": "lfhf7b4",
              "score": 38,
              "body": "The 5 dollar meal is also only “limited time”. \n\nThey plan on removing it once they get more traffic into the stores. \n\nI’m glad it’s failing.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhf7b4/",
              "created": 1722259206,
              "depth": 2,
              "replies": [
                {
                  "id": "lfhi13r",
                  "score": 9,
                  "body": "And you need the app to get the 5 dollar meal. F\\*\\* you.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhi13r/",
                  "created": 1722260315,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lfhzrma",
              "score": 6,
              "body": "A meal from in-and-out for $2.50? Yeah, okay.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhzrma/",
              "created": 1722266484,
              "depth": 2,
              "replies": [
                {
                  "id": "lfig4fu",
                  "score": 4,
                  "body": "They didn’t mention that they’re time traveling from 2008 at the moment.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfig4fu/",
                  "created": 1722271814,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfj3x84",
          "score": 8,
          "body": "Our closest McD's went from double-lines wrapped around the building at all hours of the day to  a 3 car line at lunch rush within the last 2 years.\n\nFucking surreal.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfj3x84/",
          "created": 1722279335,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfh06cf",
      "score": 450,
      "body": "prices are way too high everywhere these days. i’d expect most consumer facing earnings to be low this quarter",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh06cf/",
      "created": 1722252360,
      "depth": 0,
      "replies": [
        {
          "id": "lfh2uhs",
          "score": 155,
          "body": "I particularly refuse to go to McDonalds and a lot of people do now as well. Not trying to pay $20-30 for a heart attack. Glad they raised the prices lmao",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh2uhs/",
          "created": 1722253748,
          "depth": 1,
          "replies": [
            {
              "id": "lfheq4a",
              "score": 40,
              "body": "And the whole app shit. No thanks. Next they'll offer McDonalds Credit Cards. You save 5%!!!",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfheq4a/",
              "created": 1722259022,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfhmsam",
          "score": 12,
          "body": "Meanwhile, sit in restaurants like BWW have multiple deals almost every weekday. M-F lunch specials. M and W are all you can eat fries and boneless. Tuesday is BOGO 50% bone in wings. Thursday is BOGO boneless. And they have happy hour from 4 pm to 6 pm. And I think they have specials for late night customers?\n\nThe point is MCD is about the same price as a sit in restaurant that has way higher expenses. People aren't going to MCD because it's by far the fast food that has increased prices more than any of its competitors over the last 5-10 years.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhmsam/",
          "created": 1722262071,
          "depth": 1,
          "replies": [
            {
              "id": "lfiwser",
              "score": 3,
              "body": "BWW has their late night happy hour. $4 fucking drinks. Unreal how good that is in SoCal where I live.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfiwser/",
              "created": 1722277095,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfh0r81",
      "score": 271,
      "body": "A burger chain called Doublz is offering junior sized burgers for $1 near me. Tough business.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh0r81/",
      "created": 1722252672,
      "depth": 0,
      "replies": [
        {
          "id": "lfh5j99",
          "score": 28,
          "body": "Are they any good?\n\nWe used to go there as kids, my dad loved the cheap food and the burgers were actually pretty good. I haven’t been there in probably 10 years. Thinking about taking the kids there for the nostalgia.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh5j99/",
          "created": 1722255049,
          "depth": 1,
          "replies": [
            {
              "id": "lfh5zd9",
              "score": 18,
              "body": "Never been, just seen the promotion driving by.\n\nChecking their on line menu it looks like their menu prices are actually similar to 5 guys, so this just seems like some kind of loss leader promotion.\n\nObviously, something is seriously wrong with the industry economics if on the one hand you are charging crazy high prices for regular menu items, and crazy low prices for promotions. People are getting fed up.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh5zd9/",
              "created": 1722255261,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfhcrd0",
          "score": 17,
          "body": "I can't imagine that they're making any money off of that, $1 doesn't buy much of anything today.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhcrd0/",
          "created": 1722258221,
          "depth": 1,
          "replies": [
            {
              "id": "lfhd3k4",
              "score": 17,
              "body": "Agree, it's a loss leader, and their regular prices are higher than McDonalds, it is similar to 5 guys. It just illustrates that people are fed up with the high prices and now they're offering ridiculous deals.  Doesn't seem like healthy fundamentals.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhd3k4/",
              "created": 1722258362,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfh186l",
      "score": 254,
      "body": "Cuz their shit is too damn expensive",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh186l/",
      "created": 1722252921,
      "depth": 0,
      "replies": [
        {
          "id": "lfi5ywu",
          "score": 97,
          "body": "Everyone keeps telling me \"just use the app, you gotta use the app!\" \n\nI dont want fast food homework.  I just want food fast. That is the entire point of these places.  No extra steps, sign ins, codes, none.  I just want to hit a drive thru, order, pay, leave with food.  \n\nAll the additional steps to save a few dollars, I might as well go to a sit down.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfi5ywu/",
          "created": 1722268503,
          "depth": 1,
          "replies": [
            {
              "id": "lfim162",
              "score": 26,
              "body": ">fast food homework. \n\nCompletely agree. Dinner \"homework\" is when you have time to sit down and plan a restaurant outing, look at menus and decide what you'd like. Fast food is supposed to be (more or less, imo) impulsive and for the \"on the go\" type of day. If I have to use apps or go online to compare which greasy restaurant will give me the better price for a child sized hamburger, I'll just cook at home.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfim162/",
              "created": 1722273699,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfiq117",
              "score": 9,
              "body": "I used to be one of those guys. They had 20 nuggs and 2 large fries for $7. Great fucking deal. \n\n\nThen the $5 meal deal came and they took away every single good deal. No biggie, the $5 meal deal is legit a great deal, one of the best deals ever.....then they took it away in my area after a month and don't even offer it anymore. Their best deal is now $1 off a 20 piece nugget lol\n\n\n\nFuck McDonalds, their deals were great for the last year but now they're completely gone in CA.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfiq117/",
              "created": 1722274966,
              "depth": 2,
              "replies": [
                {
                  "id": "lflgslo",
                  "score": 3,
                  "body": "$1 off a 20 piece nugget, I bet people are camping out overnight waiting to get in on that kind of a stellar bargain.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lflgslo/",
                  "created": 1722309935,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lfh15xw",
      "score": 200,
      "body": "Let this stock tank a bit, McDonald’s is trying to be something it’s not",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh15xw/",
      "created": 1722252887,
      "depth": 0,
      "replies": [
        {
          "id": "lfi90yq",
          "score": 32,
          "body": "Used to own McD's stock. Saw what was happening a couple years ago and got out at a great profit as this was over a ten year stock for me. \n\nI don't care if I don't make more over the years. It was as much a moral decision. \n\nFuck McD's. Have not gone in almost 2 years. And I can afford this junk. I'd rather support the small local restaurants. And get far better food and service as a result. And comparatively spend less.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfi90yq/",
          "created": 1722269510,
          "depth": 1,
          "replies": [
            {
              "id": "lfjkvhc",
              "score": 3,
              "body": "What stock did you get instead?",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfjkvhc/",
              "created": 1722284739,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfimx53",
          "score": 8,
          "body": "It really is. Worked there and left in dec 23. They brought in new procedures for meat which limited how much meat you could cook at once which put wait times up to 20-30 minutes during rushes for certain items and when you're paying over £8 for a shitty burger meal that's ridiculous and defeats the point",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfimx53/",
          "created": 1722273982,
          "depth": 1,
          "replies": [
            {
              "id": "lfixno7",
              "score": 5,
              "body": "I was in a hurry once (was catching a train in 15 minutes) and figured I'd grab a quick bite at McD's across the street to go.\n\nTook 15 minutes for the food - missed the train. I was irate. This was 7 years ago - barely go to McD's at all anymore.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfixno7/",
              "created": 1722277366,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfhhw49",
          "score": 26,
          "body": "Looks like it is priced in",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhhw49/",
          "created": 1722260262,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfhozp8",
          "score": 20,
          "body": "Stock is up",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhozp8/",
          "created": 1722262855,
          "depth": 1,
          "replies": [
            {
              "id": "lfio7xn",
              "score": 16,
              "body": "It's actually down 11% YTD while S&P is up 20%",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfio7xn/",
              "created": 1722274392,
              "depth": 2,
              "replies": [
                {
                  "id": "lfiqg0v",
                  "score": 12,
                  "body": "Up on this earnings call.",
                  "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfiqg0v/",
                  "created": 1722275096,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lfh43x7",
      "score": 204,
      "body": "I have 3 kids. \n\nWe got 2 chicken nugget happy meals \n\n2 big mac combos and 1 10 nugget pack \n\n$72 CAD. Fuck off",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh43x7/",
      "created": 1722254367,
      "depth": 0,
      "replies": [
        {
          "id": "lfhlqt5",
          "score": 44,
          "body": "Insane",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhlqt5/",
          "created": 1722261691,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfi2hgx",
          "score": 30,
          "body": "Haha, McDonalds literally robbed you 😂",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfi2hgx/",
          "created": 1722267374,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfiiqwu",
          "score": 9,
          "body": "Was this at an airport or something?",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfiiqwu/",
          "created": 1722272654,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfh1q03",
      "score": 165,
      "body": "Good. With their prices, McDonalds probably forgot that they're fast food chain and not a fucking 3 star Michelin restaurant.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh1q03/",
      "created": 1722253177,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfh3e3i",
      "score": 72,
      "body": "And it's only going to get worse.  The reason to go to McDonals used to be that it cost half as much as a non chain restaraunt. Now I can go to my local pizzeria or deli.  Get something tasty,  that will have leftovers I actually want to eat next day. For the same amount of money.  Or less even.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh3e3i/",
      "created": 1722254016,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfh2cmi",
      "score": 145,
      "body": "Imagine paying a ton of money for terrible, unhealthy food when you have the choice not to.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh2cmi/",
      "created": 1722253497,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfh2eaw",
      "score": 42,
      "body": "McDonald prices are absolutely insane. If I buy every single thing using the app and only getting the discounted stuff, it’s still like $5-10. \n\nIf I’m free ordering, it’s like $15 which is the price point of much nicer food imo",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh2eaw/",
      "created": 1722253521,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfh9eu1",
      "score": 42,
      "body": "It’s almost like raising prices far above normal inflation scares away customers.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh9eu1/",
      "created": 1722256812,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfh0pgc",
      "score": 94,
      "body": "Love to see it. Do not go to McDonald’s",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh0pgc/",
      "created": 1722252647,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfh1bud",
      "score": 97,
      "body": "Prior to 2021 I could reliably predict the price of my McDonald’s order down to the penny. It was $6.61. That same order now costs over $10 and is never the same price.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh1bud/",
      "created": 1722252974,
      "depth": 0,
      "replies": [
        {
          "id": "lfh1ucp",
          "score": 61,
          "body": "Right? I think the constant price hikes are the issue. Dollar menu for almost my entire life then covid hits and suddenly the shit I put into my body because it was $2.18 is now around $7?? Nah, I’ll make beans sausage and rice at home, it tastes better anyway.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh1ucp/",
          "created": 1722253239,
          "depth": 1,
          "replies": [
            {
              "id": "lfhc0p5",
              "score": 12,
              "body": "Here in Europe you're better off eating at a real restaurant for the same price.\n\nOr if 'fast' in fast food is important to you, you could just choose to eat a full blown meal for like 5€ at local asian fast food restaurants or burger houses.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhc0p5/",
              "created": 1722257915,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfh1npg",
      "score": 66,
      "body": "They need to drop their prices by 30% or more.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh1npg/",
      "created": 1722253145,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfh0zcd",
      "score": 127,
      "body": "A mcdonalds combo is $12-$14 these days\n\nThe local sandwich shop does a great burger thats cooked in front of you with the topings you want for $8.99. The quality difference between this local burger and mcdonalds or burger king or wendys is night and day.\n\nThose slim ass frozen pattys should not cost more than $6-$7",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh0zcd/",
      "created": 1722252791,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfh5tmy",
      "score": 32,
      "body": "Went to McDonald’s recently while traveling with my wife and 2 medium combo BREAKFAST meals were $24 after tax lol. I said “is it really $24?” To the cashier and they said it’s cheaper on the app. Well I don’t have the fucking app nor do I want it. What is it with forcing people on the app? That’s like going to Walmart and everything is $2 more expensive because you didn’t order on their website. Fuck the app, what about in person? \n\n I remember in my early 20’s spending $3-$5 to eat at McDonald’s when I was broke. Idk what happened but it isn’t sustainable. A lot of these fast food restaurants are going to get reality checks sooner than later.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh5tmy/",
      "created": 1722255186,
      "depth": 0,
      "replies": [
        {
          "id": "lfhy215",
          "score": 14,
          "body": "> What is it with forcing people on the app?\n\nCollecting data about you that they can sell. That's why every fucking business that was built on a web site now nags the ever-loving shit out of you to use their stupid app (lookin' at *you*, Reddit)-- because they can gather much more info on you with an app they fully control than they can if you just access their site with a web browser.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhy215/",
          "created": 1722265919,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfi0xoh",
          "score": 5,
          "body": "We have become so obsessed with mobile and being so introverted. I am not saying eating at McDonalds should be fine dining. But I have a lot of fun memories eating in person as a kid and playing at McDonalds and Burget King. Now it feels heavy they don't want you in there. Go through the drive thru or pick up and get out. I spend enough time in my house or office. If I am getting food out, I want to be somewhere else.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfi0xoh/",
          "created": 1722266866,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfhhp5t",
      "score": 17,
      "body": "I’m honestly surprised that same store sales are down only 1%. And .7% in the US. With all the price increases I don’t get how so many people can feel like they’re getting a value for their money",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhhp5t/",
      "created": 1722260187,
      "depth": 0,
      "replies": [
        {
          "id": "lfik31e",
          "score": 9,
          "body": "Most people that go to McD's are not financial wizards or stock pickers who can read financial statements. It takes months/years for people to realize that \"hey, I'm spending $15 at McD's and also at my local burger place that's way better...\". But once that trend sets in, it will gain speed and people love to tell other people about sht like this... so it will snowball.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfik31e/",
          "created": 1722273078,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfj7gmd",
          "score": 8,
          "body": "Higher prices but lower volume. If prices are up 20% they’d need to lose significant business volume for sales to fall.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfj7gmd/",
          "created": 1722280473,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfh3x5m",
      "score": 55,
      "body": "But guys! They haven’t finished rolling out all their automated ordering kiosks yet! Once *everyone* gets to experience the joy of tapping on a touchscreen for ten minutes and never having to look another human in the eyes while ordering their $17 cheeseburger, back up the truck!",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh3x5m/",
      "created": 1722254276,
      "depth": 0,
      "replies": [
        {
          "id": "lfh6awc",
          "score": 27,
          "body": "Lowered their overheads and increased their prices👍",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh6awc/",
          "created": 1722255409,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfhfbxh",
          "score": 10,
          "body": "Those touch screens are always extraordinarily filthy and grime everywhere that you can see.  Just imagine all the germs you can't see.  It's like touching a fucking toilet seat.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhfbxh/",
          "created": 1722259258,
          "depth": 1,
          "replies": [
            {
              "id": "lfhit0a",
              "score": 3,
              "body": "Yep I just order on the app. They look fucking heinous.",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhit0a/",
              "created": 1722260607,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfhd83m",
          "score": 13,
          "body": "I remember when that technology started coming out in the early 2000s. The biggest flaw is this- it takes a customer more time to understand the interface and make preferences than an employee.  an employee who mashes the buttons all day on the ordering system can knock it out in mere seconds, while a guest who may not visit often is unfamiliar with how to add extra ketchup and no onions.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhd83m/",
          "created": 1722258415,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfh17u9",
      "score": 63,
      "body": "After price gouging us, they are shocked we still going to McDonalds?",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh17u9/",
      "created": 1722252916,
      "depth": 0,
      "replies": [
        {
          "id": "lfi589m",
          "score": 9,
          "body": "They're bringing back the $5 menu. These companies know how to gauge us just enough to keep us coming back for more. They will do a promo period to normalize the increased prices (look at this great deal!). \n\nNow it's a $5 \"value\" meal when previously that would've been considered expensive.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfi589m/",
          "created": 1722268264,
          "depth": 1,
          "replies": [
            {
              "id": "lfilqxy",
              "score": 10,
              "body": "Ah, yes the $5 meal. The same price as a combo back in the good old days. But wait, this meal is a much smaller portion. This wasn't a deal at all!",
              "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfilqxy/",
              "created": 1722273608,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfh2wak",
      "score": 24,
      "body": "It's pretty fuck expensive for the gross cheap ass unhealthy food they make. I get it.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh2wak/",
      "created": 1722253773,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhgh4i",
      "score": 10,
      "body": "They’ve been blacklisted in our family for a year now. Not only due to the price. The service has deteriorated with the installation of those pads you order on and the lack of a cashier, and the food quality has also been garbage for a while.\n\nThe only restaurant we frequent now is Culver’s. A kids meal is roughly $7.50 and it’s enough food for an adult to consume. While they’ve raised their prices some during the pandemic, the service is still great and the food quality is always top tier.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhgh4i/",
      "created": 1722259707,
      "depth": 0,
      "replies": [
        {
          "id": "lfj1ocf",
          "score": 5,
          "body": "Surprised it took so long to see this. One of the last times I went in to a McDonald’s, I was amazed at the unstaffed counter and the insistence on using the damn kiosks.  No self service drink machines. No free refills. Food took longer than normal. Was poor quality.  And was more expensive than the last time I was in a store. I only go maybe once or twice a year, but basically vowed to never go back after that.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfj1ocf/",
          "created": 1722278620,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfkojsq",
          "score": 3,
          "body": "Culver’s is elite",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfkojsq/",
          "created": 1722298668,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfh1zhw",
      "score": 30,
      "body": "Chick fil a meals are about the same price, if not cheaper, than a McDonald’s combo in my area… McDonalds would have to be $2-3 cheaper for me to consider it over Chick Fil A.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh1zhw/",
      "created": 1722253312,
      "depth": 0,
      "replies": [
        {
          "id": "lfh3gfp",
          "score": 9,
          "body": "Yeah I need a combo meal to be less than $10 out the door. Otherwise I could get CFA, a much healthier and filling burrito, or even an actual half pound burger from a local restaurant for what they're currently charging.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh3gfp/",
          "created": 1722254048,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfinfol",
          "score": 3,
          "body": "I went to Chilk fil a and spent $10 for a 12 piece grilled chicken.  Not the meal, just the chicken.  I'm done with them, too.  \n\nFast food is no longer an option for me.  Screw those guys.",
          "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfinfol/",
          "created": 1722274145,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfh8qbd",
      "score": 8,
      "body": "My mental image of them is one of poor value. Too expensive for what you get and they are not a good choice. They are going to have a tough time unless they really make meaningful changes, and I don’t consider making everything super small and charging $5 for tiny portions meaningful. I’m",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh8qbd/",
      "created": 1722256512,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhljv6",
      "score": 6,
      "body": "The food is dogshit. It was okay when the burger was 2 bucks but now that it’s over 10 dollars for almost value meals you are in a different league. I could get a smash burger for nearly the same now. \n\nThe exec that thought they could walk away from the core value prop of cheap quick food should be publicly humiliated. Tarred and feathered!",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhljv6/",
      "created": 1722261622,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhgh2y",
      "score": 5,
      "body": "Miss me with that McCaffee bullshit and fuck your apps, invest in making food better. The fucking paddies are so thin at this point that a Big Mac feels like a fucking salad.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhgh2y/",
      "created": 1722259707,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhgu81",
      "score": 6,
      "body": "Yay BDS!",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhgu81/",
      "created": 1722259851,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhnvb5",
      "score": 5,
      "body": "Their meal started competing with a real steak. Which is absurd",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhnvb5/",
      "created": 1722262457,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhqg53",
      "score": 6,
      "body": "Mc D’s doesn’t even serve food. It’s all garbage. I would like to see them fold, along with every other fat shop that exists solely to make everyone sick and obese.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhqg53/",
      "created": 1722263364,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfin50v",
      "score": 5,
      "body": "Fast food is no longer a deal because it's rarely fast, and hardly what I consider food. There are times that I've had better burgers come from the freezer isle at the grocery store that you just microwave. With kids, happy meals are considered the norm, but there we're looking at a total lack of nutrition, and they don't really do toys anymore. Why am I going to stop at McDonalds for 4 people, when the grocery store is just a minute away and I can get way more food than the equivalent dollar would get me for fast food?",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfin50v/",
      "created": 1722274051,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhg4i1",
      "score": 12,
      "body": "boycott",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhg4i1/",
      "created": 1722259570,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfh3k9l",
      "score": 8,
      "body": "Can't believe people would stop buying when the cheap shit food is now expensive shit food. What a shock!",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh3k9l/",
      "created": 1722254101,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfh67rc",
      "score": 8,
      "body": "With their new prices coming very close to better quality restaurants that's no wonder. People are either upgrading or just not splurging on McDonalds instead of just cooking at home the way they used to.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh67rc/",
      "created": 1722255368,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhbly5",
      "score": 4,
      "body": "Their food has been overpriced crap forever but these days it's border line hilarious. I don't know who is dumb enough to go there.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhbly5/",
      "created": 1722257745,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhwf3b",
      "score": 4,
      "body": "Why is the stock up almost 4% if they missed?",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhwf3b/",
      "created": 1722265373,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfixjqn",
      "score": 5,
      "body": "And why is their stock up 5%?",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfixjqn/",
      "created": 1722277331,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfh07nk",
      "score": 15,
      "body": "Monsanto, Disney, Halliburton and MacDonalds are the four horsemen.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh07nk/",
      "created": 1722252380,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfh3psk",
      "score": 6,
      "body": "Like other redditors stated when you increase the price and cut the portions while giving out an even worse quality item people are going to stop going . I used to go practically daily to McDonald’s for their chicken McGriddle meal and I would use the 20% coupon so I’d spend 5 bucks a day plus for lunch since they were the cheapest I would spend normally another 5-7 bucks . Due to work and other commitments I can’t always cook and have left overs so I made due but the last 3 times from different restaurant the McGriddle was absolutely disgusting and their cheeseburgers weren’t seasoned same as their fries ",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh3psk/",
      "created": 1722254176,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhhpty",
      "score": 8,
      "body": "Well I love this negative Reddit sentiment. I think it’s time for me to quietly build up my position in MCD.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhhpty/",
      "created": 1722260195,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfh37ri",
      "score": 11,
      "body": "Greedflation",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh37ri/",
      "created": 1722253929,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfha9e0",
      "score": 3,
      "body": "If you charge as much as shake shack or BurgerFi - I will go there instead.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfha9e0/",
      "created": 1722257178,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhb236",
      "score": 3,
      "body": "It’s as if businesses are having to learn about supply and demand all over again.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhb236/",
      "created": 1722257517,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhbl34",
      "score": 3,
      "body": "It was expected, prices are too high.\n\nThose analysts living in their rich bubble couldn't predict it for some reason lol",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhbl34/",
      "created": 1722257735,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhbobz",
      "score": 3,
      "body": "I'd rather eat at a more proper restaurant for the price of mcDs lol",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhbobz/",
      "created": 1722257773,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhc1h1",
      "score": 3,
      "body": "From this thread you'd think they were on their last legs, a $6.5b quarter is still pretty good no?",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhc1h1/",
      "created": 1722257924,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhc3y3",
      "score": 3,
      "body": "Make them feel it where it hurts, the pocketbook, just like they did for their consumers. I guess “[McDonalds ability to raise prices without hurting sales](https://www.cnn.com/2024/02/06/business/mcdonalds-prices/index.html)” is not true. It may take years for consumers to return and that is a great thing. Just because you need to hit the market estimates to make bonuses is not a reason to put economic pressure on your customers.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhc3y3/",
      "created": 1722257952,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhh4g8",
      "score": 3,
      "body": "I stopped eating there mostly due to inconsistency no matter the location.\n\n90% of the time a coke tastes like swamp water.  The fries are undercooked.  I don't know if it's just as I get older I can't stomach it, but the burger/chicken quality is so bad.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhh4g8/",
      "created": 1722259962,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhhbu2",
      "score": 3,
      "body": "Only way to curb this is to not go and eat at home. Fast food prices are literally ridiculous now. Let them sweat it out for a while.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhhbu2/",
      "created": 1722260044,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhi6ep",
      "score": 3,
      "body": "Inflated pricing comes back like a boomerang. Thoughts and prayers",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhi6ep/",
      "created": 1722260371,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhnmup",
      "score": 3,
      "body": "All these companies have purposefully squeezed consumers as hard as they can to find the absolute highest margin/profit sweet spot under the guise of “inflation”.\n\nThe hell with y’all.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhnmup/",
      "created": 1722262374,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhp506",
      "score": 3,
      "body": "Good. Fat food’s getting as expensive as normal dine-ins. It’s ridiculous.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhp506/",
      "created": 1722262907,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhq7wp",
      "score": 3,
      "body": "Good",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhq7wp/",
      "created": 1722263284,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhu889",
      "score": 3,
      "body": "McDonald’s is for rich people. Not for people like us. Not like us",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhu889/",
      "created": 1722264648,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhwio1",
      "score": 3,
      "body": "The boycott is working. That’s what happens when you do promotional campaigns with the IOF",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfhwio1/",
      "created": 1722265406,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfifhvl",
      "score": 3,
      "body": "They priced out their customer base, what did they expect? ",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfifhvl/",
      "created": 1722271612,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfimww3",
      "score": 3,
      "body": "GOOD! Stop overpaying for shit products. The only way to protest is with your wallet!",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfimww3/",
      "created": 1722273980,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfiytd7",
      "score": 3,
      "body": "McDonald’s needs to remember that they sell cheap food at cheap prices. Nobody wants expensive, cheap food.",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfiytd7/",
      "created": 1722277725,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfh750v",
      "score": 6,
      "body": "I haven’t eating at McDonald the moment they took the dollar menu away. Their meals aren’t worth more than $5 to me",
      "permalink": "/r/stocks/comments/1eewy23/mcdonalds_earnings_revenue_miss_estimates_as/lfh750v/",
      "created": 1722255790,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "McDonald's reported quarterly earnings and revenue that missed analysts' expectations due to declining same-store sales globally.",
    "companies": [
      "McDonald’s"
    ],
    "tickers": [
      "MCD"
    ],
    "main_ticker": [
      "MCD"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "McDonald's reported quarterly earnings and revenue that missed analysts' expectations due to a decline in same-store sales across all divisions.",
    "stock_recommendations": "No specific recommendation to buy or sell McDonald's stock is mentioned.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": null,
    "sentiment_summary": "The sentiment is neutral as the post merely reports on McDonald's financial performance without any explicit investment advice.",
    "sentiment": "neutral"
  }
}