{
  "title": "What’s with the market seriously?",
  "score": 104,
  "selftext": "[removed]",
  "link_flair_text": "Advice Request",
  "id": "1ef0xk0",
  "num_comments": 123,
  "created_utc": 1722263296,
  "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/",
  "comments": [
    {
      "id": "lfikejm",
      "score": 1,
      "body": "Sorry -- we removed your post or comment because it's low effort.  Please put effort into what you post to r/stocks.  Any of the following are considered low effort and will result in your post or comment being removed:\n\n* Posts or comments that rely on memes to get your point across\n\n* Posts or comments which are basic one/two sentence questions\n\n* Posts or comments that are similar to ones made several times recently\n\n* Posts or comments where no actual research was done before asking the question or starting the discussion\n\nIf you need more information on a stock, try looking it up on finviz.com or a business news website.  After that, come back and back up your statements with a source or provide a more in-depth question.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfikejm/",
      "created": 1722273180,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhsuq8",
      "score": 186,
      "body": ">I’ve realized after covid\n\nDid you by any chance only start being actively involved with the markets after covid? Because it has always been this way. Sure, it's a bit exacerbated now with AI companies, but outside of that it's all the same.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhsuq8/",
      "created": 1722264185,
      "depth": 0,
      "replies": [
        {
          "id": "lfi0ave",
          "score": 37,
          "body": "Definitely feels like he is recently tracking… I remember the Trump midnight tweet storms. Oil and missile strikes, war puts,bank runs during the early ‘00s\n\nAnyone remember when Mnunchin would jump on CNBC at 8:15 from the front lawn of the White House and tank the markets with crap about invading the chinese (2018) was wild. Then the next day claim they reached a deal and the market would gain 2%.",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi0ave/",
          "created": 1722266660,
          "depth": 1,
          "replies": [
            {
              "id": "lfinka1",
              "score": 1,
              "body": "And you know they were buying and selling those rips and dips. You know the Trump kids were making plays after talking to Dad but before he tweeted.",
              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfinka1/",
              "created": 1722274186,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfi1yo3",
          "score": 9,
          "body": "Haha was going to say the same. I used to do a lot of options trading in 2016-2018 and this is nothing new",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi1yo3/",
          "created": 1722267202,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfia8wm",
          "score": 9,
          "body": ">Did you by any chance only start being actively involved with the markets after covid? Because it has always been this way. Sure, it's a bit exacerbated now with AI companies, but outside of that it's all the same.\n\nAgreed. OP opened up a robinhood account with stimulus money and now thinks they've cracked the market.",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfia8wm/",
          "created": 1722269906,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfi2b6o",
          "score": 3,
          "body": "Yes.  Same as it ever was. Especially if only looking at small windows of time - weekly or monthly, the market will look nonsensical",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi2b6o/",
          "created": 1722267316,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfif289",
          "score": 1,
          "body": "Some people don't realize too that the US market is by far the most volatile on earnings. Canadian companies I follow never move more than 10% mostly because they're steady slow growers.",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfif289/",
          "created": 1722271472,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfik18o",
          "score": 1,
          "body": "I don’t agree, it’s always been like this to some extent, but it is far worse now. Buffett has commented on how casino like the market is today relative to his younger years. Those of us who’ve been in the market for 20 years or more see it too. Fundamentals are far less important and momentum and hype are far more important than it used to be.\n\nYou gotta go back 15 years at a minimum though. If your timeframe in the market is ten years or less, yeah, it probably seems like the market has always been like this. It hasn’t though, it’s a phenomenon that began in the ZIRP era.",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfik18o/",
          "created": 1722273062,
          "depth": 1,
          "replies": [
            {
              "id": "lfj16e2",
              "score": 0,
              "body": "Wrong, fundamentals are as important now as they where before, its just that those fundamentals have changed a bit.\n\nThe problem is with new investors not understanding that short term investing is very risky, always has been. Long term investing is how you actually make money without having to depend on luck. People want to get rich quickly, they are desperate for money.",
              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfj16e2/",
              "created": 1722278462,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfhwstv",
          "score": -6,
          "body": "It's different now with the GameStop saga still ongoing. Anyone who thinks it a) never happened, b) happened but didn't matter, or c) happened and is over - is in for a bad time.",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhwstv/",
          "created": 1722265501,
          "depth": 1,
          "replies": [
            {
              "id": "lfhzc4q",
              "score": 14,
              "body": "meme stocks are a niche subset. Its not like theres a ton of them. Bed bath, gamestop, amc, am I missing many more?",
              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhzc4q/",
              "created": 1722266343,
              "depth": 2,
              "replies": [
                {
                  "id": "lfi021y",
                  "score": 9,
                  "body": "Tesla and DJT",
                  "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi021y/",
                  "created": 1722266579,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfi53z3",
                      "score": 2,
                      "body": "I'm not defending Tesla as a good stock or a good company. I wouldn't classify that as a meme stock tho. A price propped up by insane and unrealistic hype? Yes. But not a meme stock.",
                      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi53z3/",
                      "created": 1722268225,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfigetz",
                          "score": 2,
                          "body": "You can make an argument it was the first meme stock because it is very options manipulated. ",
                          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfigetz/",
                          "created": 1722271905,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lfi0gya",
                      "score": -12,
                      "body": "Tesla is not a meme stock. It’s under 70PE. Go take a look at LLY or AMD.",
                      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi0gya/",
                      "created": 1722266714,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfi2df7",
                          "score": 12,
                          "body": "Tesla is definitely a meme stock.",
                          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi2df7/",
                          "created": 1722267337,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lfi4hox",
                              "score": 3,
                              "body": "Just curious how you define a meme stock and how Tesla fits into that model. And also how it compares with other meme and non meme stocks. From your point of view",
                              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi4hox/",
                              "created": 1722268025,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lfi1s5q",
                          "score": 3,
                          "body": "AMD has high PE due to Xilinx acquisition. You have to check their non GAAP PE",
                          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi1s5q/",
                          "created": 1722267143,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lfi2ygc",
                              "score": 2,
                              "body": "Very interesting about AMD. Did some quick research I see consensus around 75PE non gaap TTM. Could you share any insight? It was bothering me for quite a while why AMD was so high and people we still buying in.\n\nStill, for a non Nvidia chip company, 75PE is pretty high and to the point above, it’s higher than Tesla",
                              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi2ygc/",
                              "created": 1722267528,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lfi9rcq",
                                  "score": 2,
                                  "body": "I am no accountant. But the general gist is that AMD can expense a little bit of the acquisition quarterly instead of all at once. This is a clear tax advantage and beneficial for free cash flow. AMD is an expensive stock I agree — but its whole sector is expensive because it is high growth. As of today it has a 40 forward PE which is not necessarily outrageous.\n\nTesla is trading at a massive multiple compared to any other car company. As of last earnings, over 85% of its revenue was from car sales. The counter argument is that Tesla is more than a car company. \n\nTLDR these companies are so different. Comparing their financials makes no sense.",
                                  "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi9rcq/",
                                  "created": 1722269750,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lfoixk7",
                                      "score": 1,
                                      "body": "I also think the same about comparing Tesla to other car companies. What other car company has anywhere close to 15% revenue from non vehicle sales? Any of them developing AI chips and data centers in house? Robotics, energy, etc\n\nIt’s fine ultimately to think it’s a car company, but those who don’t will benefit from the appreciation of the other segments of the business",
                                      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfoixk7/",
                                      "created": 1722360856,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lfiasyy",
              "score": 9,
              "body": ">It's different now with the GameStop saga still ongoing.\n\nNothing is ongoing. It's a dying brick and mortar retailer who has a long runway due to getting a large cash dump from dilution.\n\n>Anyone who thinks it a) never happened,\n\nA short squeeze happened. A bog standard short squeeze.\n\n>b) happened but didn't matter, \n\nIt didn't matter. There's nothing magical about this stock. \n\n>or c) happened and is over - is in for a bad time.\n\nI'm sure the childrens books your dear leader communicates with you in code will reveal the day of armageddon soon.",
              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfiasyy/",
              "created": 1722270086,
              "depth": 2,
              "replies": [
                {
                  "id": "lfihhm5",
                  "score": 2,
                  "body": "Yep, it's over.\n\n\nIf there was still something there, realistically, it 110% should've popped up in 2022 while the Nasdaq was getting smoked as that year had a lot of deleveraging going on up to the last couple days.\n\n\nThe thesis is dead. Doesn't mean you can't still have squeezes though.",
                  "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfihhm5/",
                  "created": 1722272250,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lfi5ll6",
              "score": 5,
              "body": "It's been 3 years lol. It's just the same as any meme stock at this point.",
              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi5ll6/",
              "created": 1722268383,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfhruht",
      "score": 103,
      "body": "Market psychology is weird and in the short term anything can happen. But in the long run fundamental analysis and earnings will basically always prevail. Stick to it and try to ignore what the short term movements are.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhruht/",
      "created": 1722263846,
      "depth": 0,
      "replies": [
        {
          "id": "lfhz8zz",
          "score": 17,
          "body": "So do we all agree MCD's price today is just... unexplainable? -3.40% earnings surprise and the stock goes up by nearly the same amount. Is it because the EPS is kind of reversing its down trend? Yet you look at a stock like ON (semiconductors) and despite the consistent EPS downtrend, the fact that it had a 4.24% earnings surprise (as it generally has been having every quarter) means it's up 13%. So does the EPS trend even matter? Very confusing.",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhz8zz/",
          "created": 1722266314,
          "depth": 1,
          "replies": [
            {
              "id": "lfi4ag9",
              "score": 7,
              "body": "Mcd PE ratio is the lowest it’s been since 2019 and it is still down 11% YTD and 4.5% in the last month. Plus, it pays a decent dividend. They’re already leading in the market with the reintroduction of the $5 meal and seem to be expanding the lower cost offerings. With the current costs in grocery stores, a $5 meal may actually be cheaper than preparing yourself something halfway decent. Two burger patties pre formed but uncooked were $7 the other day at Publix. Plus buns, a side, etc. Cheaper for 2 or fewer people to eat at Mcd.",
              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi4ag9/",
              "created": 1722267960,
              "depth": 2,
              "replies": [
                {
                  "id": "lfi83xl",
                  "score": 3,
                  "body": "So you're saying the PE ratio is trending upwards? Interesting. I wonder if a lot of it is the $5 meal news, but that's really going to hurt their profit right? It's a \"cannibalization\" move to hurt the other fast food companies, but good enough justification for short term upswing I guess.",
                  "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi83xl/",
                  "created": 1722269207,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfi8zeh",
                      "score": 2,
                      "body": "It’s not trending up, it’s been trending down since late 2022 / early 2023. It hit a high of 30 then and has moved down to near 20. 20 and over has been the trend since 2016. I think the downward trend has bottomed and now it’s going up. \n\nhttps://www.macrotrends.net/stocks/charts/MCD/mcdonalds/pe-ratio",
                      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi8zeh/",
                      "created": 1722269496,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfihn8f",
                          "score": 2,
                          "body": "Ugh, typo on my part, I meant trending downwards which is a buy signal if you suspect the long term stock uptrend will continue. Thanks for the insight.",
                          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfihn8f/",
                          "created": 1722272299,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lfihrse",
                              "score": 1,
                              "body": "Yessir!",
                              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfihrse/",
                              "created": 1722272339,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lfj2vym",
                  "score": 2,
                  "body": "Analysing growing prospects is also a part of fundamental analysis I'd say, if you think their PE is low relative to their future growth then it's a no-brainer. Though in the case of McDonalds I would still be cautious, though in Lynchean terms: I almost can't pass a Mcdonalds without buying a cheeseburger because it's heart-cloggingly delicious and dirt cheap here in Sweden.",
                  "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfj2vym/",
                  "created": 1722279007,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lfi49vx",
              "score": 7,
              "body": "Mcd is a stock that does well in recessions.  There is evidence of a slowdown in some consumer industries… perhaps that explains the move",
              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi49vx/",
              "created": 1722267955,
              "depth": 2,
              "replies": [
                {
                  "id": "lfi75f0",
                  "score": 5,
                  "body": "When you say it does well, do you mean it goes up during recessions or it just doesn't go down as much? If it's the latter, then why would you buy at all if you expect a recession especially after failing estimates? I guess if it beats cash inflation, but MCD is still above 2022 price (end of covid recession) so there' still a lot of falling it can do before recession numbers.",
                  "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi75f0/",
                  "created": 1722268891,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfikm1r",
                      "score": 1,
                      "body": "Well big money usually has a mandate to be long stocks so they don’t have a choice but to own",
                      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfikm1r/",
                      "created": 1722273246,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lfil2qn",
                      "score": 1,
                      "body": "Mcd was up 10% in 2008 ; of the 500 names in spx maybe 20 were up that year 🥹",
                      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfil2qn/",
                      "created": 1722273394,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfjf3pt",
                          "score": 1,
                          "body": "Ok, how'd it do during the covid recession?",
                          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfjf3pt/",
                          "created": 1722282935,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lfmw6u6",
                              "score": 1,
                              "body": "The Covid recession is unlikely to happen again whereas a “normal” recession might?",
                              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfmw6u6/",
                              "created": 1722340524,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lfief1i",
              "score": 2,
              "body": "It's always been like that.  TSM released good earnings and the stock price cratered. Crowdstrike outage happened and the stock went up instead on the same day. Apple announced AI and the stock went down instead. Tesla said delays to robotaxi and stock went up instead\n\nAlso these kind of inverse directions seem to only happen for one day. I predict McD stock will go down eventually, likely by tomorrow or end of the week. These wallstreet people just wanna mislead retail investors trying to  day trade options on the ER",
              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfief1i/",
              "created": 1722271266,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfi1c5s",
              "score": 0,
              "body": "MCDs isn't just eps, though. A while back the CFO made a statement that he views McDs as a real estate company, and the easiest way for their tenants to make rent is by selling burgers. McDs has real estate that factors into their price the same way Apple has cash on hand. Less liquid, sure, but assets all the same",
              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi1c5s/",
              "created": 1722266998,
              "depth": 2,
              "replies": [
                {
                  "id": "lfi6ura",
                  "score": 5,
                  "body": "CFO can say whatever he wants, doesn't make it any less absurd. Real estate is a factor, sure, but a driving factor? Probably not.",
                  "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi6ura/",
                  "created": 1722268794,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lfia910",
                  "score": 1,
                  "body": "Remember when Sears was  a real estate company?",
                  "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfia910/",
                  "created": 1722269907,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfisp6o",
                      "score": 1,
                      "body": "Sears leased end units at shopping malls",
                      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfisp6o/",
                      "created": 1722275806,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfkx13h",
                          "score": 1,
                          "body": "Sears Holding also owned Kmart. Eddie Lampert the Sears Holdinh CEO was the mastermind that was going to be the next Warren Buffett according to Jim Cramer. It didn't end that way. The real estate was so very very valuable according to Cramer.",
                          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfkx13h/",
                          "created": 1722301923,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lfhuhd3",
          "score": 15,
          "body": "This is the right answer. But most people will not be patient enough to wait for the long term.",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhuhd3/",
          "created": 1722264731,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfi0noq",
          "score": 0,
          "body": "I’ll correct your basically always prevail to always prevail. Market will always eventually reflect reality once it becomes obvious that it is reality. Sustained hope (or cynicism) forever is impossible",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi0noq/",
          "created": 1722266775,
          "depth": 1,
          "replies": [
            {
              "id": "lfj3d54",
              "score": 1,
              "body": "Agreed! Though in this case my 'basically' just means that anyone can make mistakes in their fundamental analysis :)",
              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfj3d54/",
              "created": 1722279158,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfhrl3t",
      "score": 61,
      "body": "Have you tried tarot cards?",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhrl3t/",
      "created": 1722263756,
      "depth": 0,
      "replies": [
        {
          "id": "lfhsw0c",
          "score": 9,
          "body": "Only If it will print my options",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhsw0c/",
          "created": 1722264197,
          "depth": 1,
          "replies": [
            {
              "id": "lfhwrix",
              "score": 2,
              "body": "Can’t hurt and just as good as any other option. You could also try flipping a coin if that doesn’t work.",
              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhwrix/",
              "created": 1722265488,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfhs2ba",
      "score": 18,
      "body": "McDonald’s earnings? Tesla pump? Yup definitely the two most absurd things today lol.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhs2ba/",
      "created": 1722263920,
      "depth": 0,
      "replies": [
        {
          "id": "lfhtbh3",
          "score": -16,
          "body": "Yea..Should’ve jumped in the bandwagon and x5 my earnings to date. But no, i just had to baghold alphabet and stock has been more sensitive than my wife’s pms..",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhtbh3/",
          "created": 1722264342,
          "depth": 1,
          "replies": [
            {
              "id": "lfiarsz",
              "score": 5,
              "body": "If you’re a bag holder on alphabet, you bought the high within the last three weeks… just relax and reconsider your goal.\n\nSounds like your goal currently is to get rekt on options.",
              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfiarsz/",
              "created": 1722270076,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfia491",
              "score": 1,
              "body": "Eh, what?",
              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfia491/",
              "created": 1722269864,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfhvx89",
      "score": 15,
      "body": "I think Mercury is in Gatorade or something",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhvx89/",
      "created": 1722265207,
      "depth": 0,
      "replies": [
        {
          "id": "lfi0m4a",
          "score": 1,
          "body": "Stealing this ^",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi0m4a/",
          "created": 1722266761,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfhue7x",
      "score": 32,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhue7x/",
      "created": 1722264702,
      "depth": 0,
      "replies": [
        {
          "id": "lfi1hay",
          "score": 10,
          "body": "It's equally as absurd to think that \"the market\" is this magical decentralized god system that finds the correct value of things. Does GME, AMC, and, let's be honest, TSLA mean nothing to you? Don't get me wrong, technical analysis is barely better than astrology logic, but there's 100 other equally goofy beliefs that drive individual stock prices. The market is speculative and things can go up simply based on memes or coordinated efforts or unsubstantiated but shared beliefs. There's a reason 95% of professional traders don't beat the market.\n\nElon musk tweets \"doge\" and this meme cryptocurrency with zero utility and meaning in the real world makes hundreds of millions of headway.",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi1hay/",
          "created": 1722267044,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfhvp60",
          "score": 4,
          "body": "lol best answer",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhvp60/",
          "created": 1722265133,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfhrxvq",
      "score": 18,
      "body": "It's because your focus is extremely short term. The market only prices efficiently in the long term. Also at least some of your analysis will be wrong. ",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhrxvq/",
      "created": 1722263878,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhxgp2",
      "score": 5,
      "body": "To answer your question, the market is a whore. It'll do anything for money.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhxgp2/",
      "created": 1722265720,
      "depth": 0,
      "replies": [
        {
          "id": "lfhy5em",
          "score": 2,
          "body": "But it wouldnt take mine!",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhy5em/",
          "created": 1722265951,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfi2oer",
      "score": 6,
      "body": "Buy the rumor, sell the news.  \nEarnings figures aren’t the most important news on these reports for the big money. They want to know what forward guidance looks like. If they expect earnings to drop in the coming quarters and there is already a high PE, the market will go up or down to reflect this new long term reality. Forward PE is more important than Trailing or Current PE when pricing a stock. \nWe’ve seen a massive bull rally since the end of 2022. That was caused by the AI craze and increased corporate profits due to inflation and their ability to pass on those costs to the consumer while increasing profit margins. That has peaked and now profit margins and earnings will likely erode and a good chunk of the stocks that saw these gains will correct.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi2oer/",
      "created": 1722267437,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfht05w",
      "score": 13,
      "body": "Technical analysis has always been stupid bullshit. At least in the form retail traders do it, like finding “support” or “channels”. I had an internship at a trading desk and then briefly took a job with the algo trading team and those guys used to laugh their ass off at “TA”. There’s a reason that nobody who believes in TA can ever come up with an actual *technical* definition of support that can be mathematically written: if they tried, it could be backtested and shown to be useless predictively",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfht05w/",
      "created": 1722264236,
      "depth": 0,
      "replies": [
        {
          "id": "lfi1s6i",
          "score": 2,
          "body": "I live in Seattle so most of my friends that do stocks believe hard in that BS. You missed the word resistance. They just can’t talk about price movement with adding a rant about Trump and the word resistance. ",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi1s6i/",
          "created": 1722267143,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfi2ybn",
          "score": 1,
          "body": "Exactly, all algo trading desks train there models with mostly instantaneous multivariate data and none with solely autoregressive (which is the sole basis for al TA indicators)",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi2ybn/",
          "created": 1722267527,
          "depth": 1,
          "replies": [
            {
              "id": "lfig4cv",
              "score": 1,
              "body": "some algorithms are just based on price data. my point was actually that retail TA is almost never even based on price data to begin with, it's reading tea leaves, it's \"that's a channel because it looks like it\" not \"that's a channel because here is a mathematical definition for it\"",
              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfig4cv/",
              "created": 1722271813,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfif3lp",
          "score": 1,
          "body": "So what does your trading team use then to predict stocks?? Just throw money randomly at whichever direction? Or just play with insider info access?",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfif3lp/",
          "created": 1722271484,
          "depth": 1,
          "replies": [
            {
              "id": "lfifvwe",
              "score": 1,
              "body": "Well, I don't know what they do now, since this was a few years ago, and I also would imagine most of their algorithmic trading would fall under IP confidentiality clauses in my contract, so I can't really tell you what they did lmao. What I can say is that algorithmic / technical trading, that is actually real, is... **TECHNICAL**. As in, someone can actually mathematically define and write down \"here is the signal\".\n\nThe reason that people who try to sell TA to retail traders don't do that, and instead call it an \"art form\" and \"you have to look at all the indicators\", is that, if they actually ever wrote down a mathematical technical indicator, you could backtest it and show that it doesn't have predictive value. Like, if they said \"a channel is when a stock remains within 1 standard deviation of it's 5 day moving average, calculated based on the previous year's intraday price movement data, for at least 5 trading days in a row\" -- then you could go plug that into thinkorswim to backtest and be like hey dude this doesn't predict jack shit.",
              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfifvwe/",
              "created": 1722271737,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfht2wn",
      "score": 7,
      "body": "The market makes little to no sense over the short term. Think about how many players are in the game and their strategies all vary. The push/pull on a daily (or shorter) timeframe can dramatically change based on who even knows what factors. \n\nThe only real *guarantee* (I still caution saying that) is that more and more money enters the market over the long term, which brings the overall market up. \n\nThis is why the general consensus is to just buy an index, because the vast majority of active traders will not beat the average return.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfht2wn/",
      "created": 1722264262,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhxxt8",
      "score": 6,
      "body": "The market relentlessly chases momentum and hype these days. There’s not a lot else going on. Follow the trend until the trend breaks.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhxxt8/",
      "created": 1722265880,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi1orx",
      "score": 5,
      "body": "The big mistake was use fundamental on investment. It doesn’t work when there was outside impact like (war, covid , inflation, trade war, investor sentiment greed/fears) \n\nExactly sometime stocks was price in way before the news. That was why some stocks drop like crazy after earning or the news.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi1orx/",
      "created": 1722267112,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi2lcq",
      "score": 3,
      "body": "Buy quality stocks (when they are on sale) and forget about it.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi2lcq/",
      "created": 1722267409,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi44rr",
      "score": 4,
      "body": "Selling on good news: buy the rumor, sell the news.  Buying on bad news: potential discount?  The summertime is a bad time to look at the portfolio.  Usually goes down.  Good time to buy if anything.  The old saying used to be “sell in the spring and leave for the summer, buy it back in the fall.”",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi44rr/",
      "created": 1722267910,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi5ojy",
      "score": 3,
      "body": "The market = everyone guessing what everyone else guessing where the market is going",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi5ojy/",
      "created": 1722268410,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhtvi1",
      "score": 14,
      "body": "Might be cuz there’s lot more gambling on market with retail investors",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhtvi1/",
      "created": 1722264530,
      "depth": 0,
      "replies": [
        {
          "id": "lfi2pdz",
          "score": 5,
          "body": "Is that new though? Retail investing like we see today is at least 20 years old",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi2pdz/",
          "created": 1722267445,
          "depth": 1,
          "replies": [
            {
              "id": "lfl6wpu",
              "score": 1,
              "body": "Robinhood definitely popularise options gambling a lot more",
              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfl6wpu/",
              "created": 1722305796,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfi6gzf",
          "score": 3,
          "body": "Thought retail was a small player. Guess not",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi6gzf/",
          "created": 1722268669,
          "depth": 1,
          "replies": [
            {
              "id": "lfl6z13",
              "score": 1,
              "body": "Many of them are trading on leverage",
              "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfl6z13/",
              "created": 1722305822,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfhthu8",
      "score": 3,
      "body": "The CMG thing is a real head scratcher. Earnings beat on every metric? Believe it or not, bleed out",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhthu8/",
      "created": 1722264401,
      "depth": 0,
      "replies": [
        {
          "id": "lfhu3cw",
          "score": 8,
          "body": "How much growth can you continue to squeeze out of burritos. Also folks need to start to realize that stock splits are short term stock drops, until it settles back in.",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhu3cw/",
          "created": 1722264603,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfi4lnb",
          "score": 6,
          "body": "PE is insanely high for what is essentially just another fast-food chain. It was valued like a growth tech company. The real head scratcher is Tesla pumping after missing on every metric while Google dumped despite beating on nearly every metric.",
          "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi4lnb/",
          "created": 1722268061,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfi5xef",
      "score": 3,
      "body": "The market doesn't correlate with fundamental valuations and GDP in the short term. In any given year, the r2 value (a correlation measure) between S&P500 and GDP growth is only 0.25, so basically no correlation. \n\n  \nHowever, if you look at the data between the two over 20 years or longer, the r2 then approaches 0.95, so basically completely correlates almost.\n\n  \nThere is always a reversion to the means and fundamentals over an investing lifetime. However, day to day, there is little correlation at all to valuations and how the economy is actually performing.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi5xef/",
      "created": 1722268489,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhuhfw",
      "score": 5,
      "body": "MCD underdelivered and stock is up today kek",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhuhfw/",
      "created": 1722264732,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhyh59",
      "score": 4,
      "body": "Reddit mentality:\n\nTSLA does down: hahaha see I told you guys it's going down. this is fine you should have listened to me.\n\nTSLA goes up: OMG this is impossible why roarrrrrrrrrrr",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhyh59/",
      "created": 1722266059,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhvso9",
      "score": 2,
      "body": "Everything you said explains the process well. Of course the price is gonna go up if people expected worse earnings than what we got",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhvso9/",
      "created": 1722265165,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhx5st",
      "score": 2,
      "body": "Crayon lines aren't working anymore huh?",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhx5st/",
      "created": 1722265620,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhz9ev",
      "score": 2,
      "body": "This is just the way it goes.   You want to look at things over a little longer time horizon.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhz9ev/",
      "created": 1722266317,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi399u",
      "score": 2,
      "body": "up goes down and down goes up is what ive learned",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi399u/",
      "created": 1722267626,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi6g8o",
      "score": 2,
      "body": "it’s simple: whatever i buy goes down and whatever is on my watch list that i didn’t buy goes up a fuck ton",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi6g8o/",
      "created": 1722268662,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi8iah",
      "score": 2,
      "body": "I think you are then misunderstanding how it works. What do you consider bad earnings or good earnings? Do you include the guidance as well? Because if a company has good earnings, but bad guidance, the stock will often go down. If they have good earnings but the stock has gone up a lot right before earnings, means that the expectation is that they are priced to have amazing earnings, so good earnings is actually really bad.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi8iah/",
      "created": 1722269339,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi515o",
      "score": 4,
      "body": "Morgan Stanley replacing ford w tesla is absolute insanity if only for the god awful customer service Tesla provides its customers.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi515o/",
      "created": 1722268199,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhtkoj",
      "score": 2,
      "body": "Its just you and new investors.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfhtkoj/",
      "created": 1722264428,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi4zse",
      "score": 2,
      "body": "Its earnings season and there is a lot of FUD spread before earnings to get people to sell and drive prices down on the known good stocks, then those who spread FUD can swoop in and buy cheap. When people who sold have that cash from selling, the markets are weird.\n\n3-4 weeks from now, the markets will have jumped from earnings, or will be jumping, and everything will look normal again … Then those trying to spread FUD will be saying its an unsustainable bubble - and the cycle will repeat starting 6-7 weeks out from next earnings in Nov.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi4zse/",
      "created": 1722268186,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi7a0y",
      "score": 1,
      "body": "Frothy....",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi7a0y/",
      "created": 1722268934,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi7v8c",
      "score": 1,
      "body": "The options market is moving the stock market, the tail wags  the dog.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi7v8c/",
      "created": 1722269127,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi84zr",
      "score": 1,
      "body": "If everyone has the same logic during analysis, then everyone would be rich. A beauty of the market is the unpredictability of it",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi84zr/",
      "created": 1722269217,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi8qh1",
      "score": 1,
      "body": "You forget. It's all priced in.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi8qh1/",
      "created": 1722269415,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi8t0s",
      "score": 1,
      "body": "The one sure fire fact I can say about the market… there will always be a post like this from someone that has lost or is about to lose a bunch of money.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi8t0s/",
      "created": 1722269438,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi92co",
      "score": 1,
      "body": "> Good earnings? stock goes down cos market expect it to do better. Bad earnings? Stock goes up cos It has already been priced in.\n\nif it was that easy then everyone would be rich wouldn't they?",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi92co/",
      "created": 1722269522,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfidkkk",
      "score": 1,
      "body": "You should go learn about Mr. Market",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfidkkk/",
      "created": 1722270991,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfie73x",
      "score": 1,
      "body": "I think fundamentals stopped mattering after 08, when the printer ran 24/7. Money has to go somehwere.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfie73x/",
      "created": 1722271195,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfieluu",
      "score": 1,
      "body": "IDK but don't jinx it, back in my day we had to wait months/years for stock to pan out or go up.  Now they do that in a few weeks.  More money for us!",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfieluu/",
      "created": 1722271327,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfif9uo",
      "score": 1,
      "body": "Yep exactly look at McDonald’s, missed earnings and the stocks up big, makes no sense.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfif9uo/",
      "created": 1722271540,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfigkzj",
      "score": 1,
      "body": "So… business as usual",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfigkzj/",
      "created": 1722271960,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfigv92",
      "score": 1,
      "body": "Things will get more normal the lower the Fed's QT progresses.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfigv92/",
      "created": 1722272051,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfihbdl",
      "score": 1,
      "body": "Line goes up, but some times it goes down.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfihbdl/",
      "created": 1722272195,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfihvk2",
      "score": 1,
      "body": "lol such a short term outlook",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfihvk2/",
      "created": 1722272372,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfijwk6",
      "score": 1,
      "body": "While the secular bull market is intact, this really hasn't been a steady market since 2015 in all honesty, and really I would say that the games in the Nasdaq really began in late 2019 and just got interrupted by COVID.\n\n\nThere's been landmines all over the place.\n\n\nGranted, I may be stretching it to say that 2009 post financial crisis bottom-2014 was all calmer than this period as you did have the Greek debt crisis and the S&P did flirt with a bear market in 2011.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfijwk6/",
      "created": 1722273022,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfiknyh",
      "score": 1,
      "body": "Chinas economy is tanking and the government is all in on breaking the power of private industry and bringing back under government control so not a huge surprise that the Chinese “stocks*” are doing poorly. *not really a share but an ADR which the Chinese government can declare worthless at any time.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfiknyh/",
      "created": 1722273263,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfioisg",
      "score": 1,
      "body": "It’s always been like this, nothing to do with Covid. It has to be like this, it is a market rule and a stochastic law.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfioisg/",
      "created": 1722274489,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfipjh4",
      "score": 1,
      "body": "For now. Be careful.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfipjh4/",
      "created": 1722274813,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfj0er2",
      "score": 1,
      "body": "Fundamentals and analysis gone down the Drain?\n\nPlease you need to study before being able to say such a thing.\n\nThese stuff has been predicted already. Analist have known that this volatility  was coming soon, they just did not knew exactly when.\n\nEven to normal investors, this was already expected. The only problem here are the new investors that don't seem to understand anything about the market and then put a lot of money into stocks to then come out crying when big dips happen.",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfj0er2/",
      "created": 1722278221,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi1eno",
      "score": 1,
      "body": "This is actually an extremely logical market. It’s pretty hyper logical. Company profits go up? Stock price follows up over the mid-long term. Novel idea, I know. \n\nAnyone who says this market isn’t moving with fundamentals doesn’t know how to invest or you’re still stubbornly trying to pick up cigarette butts when no one else has done this successfully for 50 years now.\n\nIn response to your final paragraphs: most Chinese stocks you buy, you own literally nothing. It’s no wonder the stocks are in the sewers. They should be lower actually but the price movement is following some logic. Tesla has gotten destroyed. Numbers look worse, stock goes down. NVDA numbers look fucking insane. Stock price goes up. Wow, such a big surprise that it follows logic. Wow stock prices move with profits?\n\n**So if you’re getting destroyed, don’t blame the market. Blame yourself for underperforming during a bull run.**",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi1eno/",
      "created": 1722267020,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi3skt",
      "score": 1,
      "body": "We have passed the top and are heading into the big drop",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi3skt/",
      "created": 1722267799,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi6dli",
      "score": 0,
      "body": "The fact that google dropped is all I need to know that fundamentals don’t work",
      "permalink": "/r/stocks/comments/1ef0xk0/whats_with_the_market_seriously/lfi6dli/",
      "created": 1722268638,
      "depth": 0,
      "replies": []
    }
  ]
}