{
  "title": "Apple to roll out artificial intelligence features in October ",
  "score": 115,
  "selftext": "Apple’s new artificial intelligence features will roll out in October, missing the initial launch of iPhone and iPad software updates, according to a Bloomberg report released on Monday.\n\nThe company split the Apple Intelligence features from the initial iOS launch due to concerns over their stability and need to run tests on a wider scale, the report said. \n\nApple previously said its AI features would be released in a beta version this fall, and they’re expected to help drive sales of Apple’s new iPhones. The features will only work on iPhone 15 Pro models and newer. Some of the promised Apple Intelligence features, such as ChatGPT integration and Siri improvements, are expected to be released later in the year.\n\nApple plans to give developers early access to Apple Intelligence as soon as this week in the iOS 18.1 beta, Bloomberg said.\n\nThe company first announced Apple Intelligence on June 10. The AI features, which will also be available on all Macs and iPads that run the M1 chip or newer, can proofread writing or re-write in a friendly or professional tone, create custom emojis, and summarize and transcribe phone calls. \n\nApple did not immediately respond to a request for comment.\n\nSource: https://www.cnbc.com/2024/07/29/apple-intelligence-ai-to-release-in-october-report-.html",
  "link_flair_text": null,
  "id": "1ef04y7",
  "num_comments": 91,
  "created_utc": 1722261318,
  "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/",
  "comments": [
    {
      "id": "lfjcl7p",
      "score": 30,
      "body": "Using smarphones for the past 12 years I can tell the only difference made with AI is that phone camera take worse pictures because of downsampling and dlss\\fsr like festures forced  in every picture and video. (Pixel 7 pro)",
      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfjcl7p/",
      "created": 1722282144,
      "depth": 0,
      "replies": [
        {
          "id": "lfl94w2",
          "score": 6,
          "body": "I'm no photographer but the main reason I bought a pixel is because of the camera. No regrets.",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfl94w2/",
          "created": 1722306689,
          "depth": 1,
          "replies": [
            {
              "id": "lflaatc",
              "score": 11,
              "body": "After using the nexus 5\\ nexus 6P every photo taken on any other phone is absolute garbage for me.\n\nAnd I am a photographer.",
              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lflaatc/",
              "created": 1722307161,
              "depth": 2,
              "replies": [
                {
                  "id": "lflsbv5",
                  "score": 2,
                  "body": "I miss my nexus 6p",
                  "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lflsbv5/",
                  "created": 1722315701,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lflv094",
                      "score": 2,
                      "body": "Its still in my drower laying for years with a dead battery.",
                      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lflv094/",
                      "created": 1722317234,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfmhbdy",
                          "score": 2,
                          "body": "Mine got stuck in a boot loop that I wasn’t able to fix. But it took excellent pictures and had a great weight to it, loved the fingerprint sensor being in the back. I wonder if Huawei phones are even allowed on U.S. networks anymore.",
                          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfmhbdy/",
                          "created": 1722331919,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lfmn4sg",
                              "score": 3,
                              "body": "Google was like \"this is too good for mere mortals\"\n\nHuawei still sells in israel but their phones are the most expensive of all brands and I have my worries about buying ccp products.",
                              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfmn4sg/",
                              "created": 1722335717,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lfjose8",
      "score": 10,
      "body": "Call me when autocorrect isn't awful. \n\n  \nThe idea of AI on a smartphone, for doing smartphone tasks, seems like it could be useful? Though I struggle to think up a specific use case for myself. But  making Siri actually useful seems like a good idea - though I'm not sure if that's even in the cards.",
      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfjose8/",
      "created": 1722285978,
      "depth": 0,
      "replies": [
        {
          "id": "lfm0t02",
          "score": 0,
          "body": "Who tf uses auto correct",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfm0t02/",
          "created": 1722320746,
          "depth": 1,
          "replies": [
            {
              "id": "lfu6psp",
              "score": 3,
              "body": "People with fat fingers",
              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfu6psp/",
              "created": 1722444662,
              "depth": 2,
              "replies": [
                {
                  "id": "lg2o7de",
                  "score": 1,
                  "body": "Really just people with fingers in general",
                  "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lg2o7de/",
                  "created": 1722562851,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lfhnpc9",
      "score": 41,
      "body": "Zzzz",
      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfhnpc9/",
      "created": 1722262399,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfi48bv",
      "score": 36,
      "body": "Can someone show me an example of how me a regular person benefits from AI?",
      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfi48bv/",
      "created": 1722267941,
      "depth": 0,
      "replies": [
        {
          "id": "lfieoin",
          "score": 24,
          "body": "I wanted to copy table/text from a research paper. It was weirdly formatted and the usual copy/paste couldn't work. I was lazy to type it out and so tried to use ChatGPT/Gemini. Both sucked ass and gaslight me with random crap. Then I used OCR (from a random website) and got expected results in seconds. Sadly it all took about 15-30mins and typing what I wanted would have been quicker. So what I thought was a straightforward \"see image, write out text\" was not possible.\n\nNot saying AI useless, I'm sure you can make it useful - similar to how googling can be powerful with correct keywords etc. But AI still needs careful prompting and is not straightforward as it is made out to be (or atleast not as straightforward as I thought).\n\nOCR is AI too but trained for specific instance of converting text images into actual text that you can copy and from what I experienced - it is not baked into ChatGPT or Gemini (atleast not when I used it or it couldn't handle the weird formatting idk). And OCR is already in iOS 15 apparently. That could be useful.",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfieoin/",
          "created": 1722271350,
          "depth": 1,
          "replies": [
            {
              "id": "lfiv8xk",
              "score": 4,
              "body": "I am really hoping for speech recognition that uses AI to be context sensitive. While current means tend to handle grammar well and correct it can trip up over homophones or worse take names and try to put them into simple words, an example is when I take a photo of a flower and try to send it I have to manually enter the flower or plant name because speech recognition without context could result it assuming you are saying something else.   \n  \nI had such a joyous time of sending pictures back to the nursery for the euonymus that needed to be replaced and random times with Crepe Myrtles. The sentence was something like,  I planted these euonymus buy they are losing their leaves. Even bird watching can be a chore when sending off photos to friends and not wanting to type it all out.  \n  \nso that is my hope.  plus if it improves identification that would be great as I am greatly impressed by what the software on my phone can recognize from plants, insects, and animals.",
              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfiv8xk/",
              "created": 1722276609,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfixh8u",
          "score": 9,
          "body": "Search engines are taken over by SEO farmers. It would be nice if I could ask for a recipe without having to wade through several paragraphs of garbage.\n\nAlso random tasks like searching for a file on my PC without knowing the name, just using a vague description based on my memory.",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfixh8u/",
          "created": 1722277310,
          "depth": 1,
          "replies": [
            {
              "id": "lfm84uk",
              "score": 6,
              "body": "that's enough to justify an 8 trillion industry",
              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfm84uk/",
              "created": 1722325576,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfmgm4m",
              "score": 1,
              "body": "AI is owned and operated by faceless corporations. Why does anyone expect it to be used for anything other than revenue raising and controlling the narrative on whatever topic they deem important?",
              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfmgm4m/",
              "created": 1722331433,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfjmosv",
          "score": 11,
          "body": "AI summaries on Google have been saving me a shitload of time scrawling through half a dozen website riddled with ads.",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfjmosv/",
          "created": 1722285317,
          "depth": 1,
          "replies": [
            {
              "id": "lfjmzs4",
              "score": 9,
              "body": "Yeah but how long until they put ads on the AI summarise?",
              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfjmzs4/",
              "created": 1722285413,
              "depth": 2,
              "replies": [
                {
                  "id": "lfjnulh",
                  "score": 9,
                  "body": "Fuck knows. But for now, it's pretty good. \n\nI started using ChatGPT for most of my search queries before now too.\n\nIt's very good at \"compare this and this\" kind of questions that you couldn't possibly answer with a single Google search.\n\nFor example, I might want to compare what's more unhealthy for me - a Carbonara or a Tikka Masala. No one has probably asked that question before, so I'd have to figure it all out by judging them individually myself. With AI, I can get it to do all that work for me and get an answer immediately.",
                  "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfjnulh/",
                  "created": 1722285684,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfmofj5",
                      "score": 3,
                      "body": "How do you know it’s a source of truth?",
                      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfmofj5/",
                      "created": 1722336499,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfmoonj",
                          "score": 2,
                          "body": "Well that's the risk you take. If you ask it to show its working though and use reliable sources then it'll *usually* be correct. I have definitely caught it out a few times though.",
                          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfmoonj/",
                          "created": 1722336648,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lfmotrz",
                              "score": 0,
                              "body": "I used copilot when planning a Switzerland trip, I asked if Zermatt was part of the oberland pass and it said it was.  It wasn’t",
                              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfmotrz/",
                              "created": 1722336728,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lfmp4d8",
                                  "score": 2,
                                  "body": "Right... like I said, I've caught it out myself before.\n\nI wouldnt rely on it for anything that's important.",
                                  "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfmp4d8/",
                                  "created": 1722336895,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lfmpcyq",
                                      "score": 2,
                                      "body": "That’s the madness of all this AI stuff.  The alleged billions being spent to do what?   This is a case of maybe just a more refined search, but this seems like it will just all end up as a big money drain for companies",
                                      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfmpcyq/",
                                      "created": 1722337031,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lfmpsw3",
                                          "score": 2,
                                          "body": "> The alleged billions being spent to do what?\n\nTo do things a hell of a lot quicker and a hell of a lot easier.\n\ni mean, there have been countless times when I've thought about sending an email and had ChatGPT rewrite it for me, or had it summarise a bunch of text for me because someone's written an email like they were writing War and Peace.",
                                          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfmpsw3/",
                                          "created": 1722337277,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lfl2euv",
                  "score": 2,
                  "body": "LOL we’re working on that now actually. Couple months probably? Sorry in advance. Sponsored responses are coming too but that’ll take a bit longer",
                  "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfl2euv/",
                  "created": 1722304024,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lflzmdw",
                  "score": -1,
                  "body": "This could be solved by showing demand for a paid product. E.g. I already use something like Kagi, where I pay for subscription, so they don't have to depend on ads to provide me the service.",
                  "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lflzmdw/",
                  "created": 1722320003,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lfr9egc",
              "score": 1,
              "body": "Ad block my guy",
              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfr9egc/",
              "created": 1722394911,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfibe76",
          "score": 10,
          "body": "There are many uses… for example have you ever gotten writers block trying to write an important email? Or formatting a report",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfibe76/",
          "created": 1722270280,
          "depth": 1,
          "replies": [
            {
              "id": "lfid3nr",
              "score": 9,
              "body": "When AI “helps” me, it’s because it fucked up so bad I remember how I wanted it done in the first place.",
              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfid3nr/",
              "created": 1722270836,
              "depth": 2,
              "replies": [
                {
                  "id": "lfksbcc",
                  "score": 4,
                  "body": "Sometimes the blank page is our biggest roadblock, and editing is easier than writing. So yeah, letting AI take the first shot is a legitimate way to get the ball rolling.",
                  "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfksbcc/",
                  "created": 1722300100,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lfifmbh",
              "score": 6,
              "body": "no…?",
              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfifmbh/",
              "created": 1722271652,
              "depth": 2,
              "replies": [
                {
                  "id": "lfivoih",
                  "score": 2,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfivoih/",
                  "created": 1722276747,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfjj5cn",
                      "score": 0,
                      "body": "My wife is just like you and I am just like the person above. I know exactly what I want to say and how I want to say it. My wife, on the other hand, is not grammatically gifted, and needs help. These tools can definitely help people who are struggling, I think. I use them as a crutch for maths, where I’m sure others would wonder why on Earth I need it.",
                      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfjj5cn/",
                      "created": 1722284201,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lfige6r",
              "score": 2,
              "body": "No I've always been able to put into words what I'm thinking I don't like yo lie so what ever I think I write",
              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfige6r/",
              "created": 1722271899,
              "depth": 2,
              "replies": [
                {
                  "id": "lfjkauh",
                  "score": 3,
                  "body": "After reading this… maybe you should consider using ai",
                  "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfjkauh/",
                  "created": 1722284561,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfjlspn",
                      "score": 4,
                      "body": "Why cos I made a typo? To er is human",
                      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfjlspn/",
                      "created": 1722285031,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lfkimlt",
          "score": 3,
          "body": "I use openAI's voice synthesis api to create audiobooks from ebooks, for cases when there's not an audiobook available already.",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfkimlt/",
          "created": 1722296440,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfkfz36",
          "score": 2,
          "body": "You ask it questions about a picture you took in the woods to identify a plant or insect, you ask it what a word in a song means, you ask it to generate an image of what something might look like, you ask it to compare cough medicine.  You ask it to recommend a book on a topic, or the history of a monument you're looking at.\n\nYou've Google for that, but do you want to read a long blog entry with a hidden byline, ads and utter crap.",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfkfz36/",
          "created": 1722295450,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfi9c9z",
          "score": 2,
          "body": "How do you define regular?",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfi9c9z/",
          "created": 1722269614,
          "depth": 1,
          "replies": [
            {
              "id": "lfi9pok",
              "score": 9,
              "body": "Poo twice a day",
              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfi9pok/",
              "created": 1722269735,
              "depth": 2,
              "replies": [
                {
                  "id": "lfiduh9",
                  "score": 2,
                  "body": "it will make them poo more",
                  "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfiduh9/",
                  "created": 1722271081,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfinrwp",
          "score": 1,
          "body": "I’m reaching, but software like shortcuts should be easier to use. It’s like a sandbox of automation for your iPhone.",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfinrwp/",
          "created": 1722274252,
          "depth": 1,
          "replies": [
            {
              "id": "lfiql1o",
              "score": 3,
              "body": "But everything I do on my phone is fast enough already like to make it any quicker I would save maybe 5 seconds",
              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfiql1o/",
              "created": 1722275140,
              "depth": 2,
              "replies": [
                {
                  "id": "lj3hsgy",
                  "score": 1,
                  "body": "All depends on what you use your phone for. Play with chatbots a little more and you will see its benifits.",
                  "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lj3hsgy/",
                  "created": 1724184535,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfiuohs",
          "score": 1,
          "body": "I have a lot of documents around a similar topic (eg a loan) and I want to get the highlights of those documents. \n\nThis does assume the output is accurate.",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfiuohs/",
          "created": 1722276428,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfj408y",
          "score": 1,
          "body": "FSD",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfj408y/",
          "created": 1722279362,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfieq8z",
          "score": 1,
          "body": "AI reduces the amount of information you need to interact with at any given moment.",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfieq8z/",
          "created": 1722271366,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfio1gb",
          "score": 1,
          "body": "I use it for creating small python scripts, as a Google replacement whenever I need help in Excel/Power BI, in general to help me understand complex topics that I don't really understand and to restructure/sentences and find synonyms. \n\nIt's not perfect obviously, but I can upload an excel sheet and basically get a personal tutor that guides me a bit on how to transform data without sifting through ten terribad blog posts that only care about SEO. As another example I once used it to successfully scrape data with python from a website, when I knew nothing about that niche beforehand.",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfio1gb/",
          "created": 1722274336,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lflq8i4",
          "score": 1,
          "body": "I wanted to learn a new programming language. It accelerates learning and productivity. Within a year, I went from never having even heard of the language to developing the full stack for an app rolled out to a nationwide company.\n\nWithout AI that would have taken 4 or 5 years to get to that level.\n\nI have a few conspiracy nut friends who always send me the latest \"gotcha\" right-wing misinfo. Prior to llms, it took me hours to trudge through the bullshit and prove it wrong. Now I just dump it into copilot and tell it to refute it, and then I copy and paste the response, it takes like 1 min and provides sources, lol.\n\nAlso, if I ever want to know something random, I just ask the Meta AI or copilot and get a detailed description with multiple viewpoints and links to explore further.\n\nI also use it to randomly create pictures for the memes my wife and I have. Usually it's pretty funny af.\n\n\nThose are a few examples I can think of off the top of my head. I've been using llms since day 1, before most people had ever heard of gpt. Now that's it's becoming multi-modal it'll be even more useful. It'll also become more integrated to our devices and apps making it more powerful.",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lflq8i4/",
          "created": 1722314570,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfm06rj",
          "score": 0,
          "body": "You may be suffering from the perspective of someone who has made their life work without the latest technology thus far, therefore you see no value in the latest technology. \n\nMany intelligent people throughout the 90s and early 2000s asked again and again for justifications of why they should care about the internet or if any \"regular person\" will benefit from it.",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfm06rj/",
          "created": 1722320353,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfir2sp",
          "score": -1,
          "body": "Make Siri competent?",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfir2sp/",
          "created": 1722275296,
          "depth": 1,
          "replies": [
            {
              "id": "lfirgjp",
              "score": 2,
              "body": "I don't use siri",
              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfirgjp/",
              "created": 1722275416,
              "depth": 2,
              "replies": [
                {
                  "id": "lfirkhd",
                  "score": 0,
                  "body": "Regular people do though",
                  "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfirkhd/",
                  "created": 1722275450,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfic54g",
          "score": -2,
          "body": "The answer is in how good the AI is. For shit AI, then yeah not much benefits, but for really good AI it's revolutionary. \n\nAnything that's not a physical task could be automated eventually.",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfic54g/",
          "created": 1722270524,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfhrdr2",
      "score": 14,
      "body": "Company: We're adding AI features to our platform!\n\nMe: Oh cool like what?\n\nCompany: AI!! FEATURES!!!\n\nThe buzzwords are so tiresome. AR, VR, AI, blah blah blah, software gets better over time is all it ever means. If a random development like AI is a flop, so what? Remember when all the big tech companies were trying to shill 3D glasses that looked dumber than a LaForge Star Trek visor with every device that had a screen? Doesn't matter, they got past it and kept growing. Your phone will be more convienient tomorrow than it is today. This was true 30 years before AI, and it'll be true 30 years after AI. So buy tech whenever the hell you feel like it. \n\nAll these headlines are just: \"TLDR we're still Apple and each device still costs $1,000+. Damn right we're successful, you want in or what?\"",
      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfhrdr2/",
      "created": 1722263684,
      "depth": 0,
      "replies": [
        {
          "id": "lfhwg45",
          "score": 14,
          "body": "Uhhh how about the part where they integrated small LLMs into the OS, so you can ask your phone to do something like “find me all my emails in the last week with shipping tracking numbers and put those in a note” and it can do it?",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfhwg45/",
          "created": 1722265382,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfhtae8",
          "score": 25,
          "body": "Your comment doesn’t make sense, they literally revealed the biggest features coming in their WorldWide Developers Conference last June. Smart calculator notes, natural language communication with device, ChatGPT integration in Siri search, recommended routes for hiking and more.",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfhtae8/",
          "created": 1722264333,
          "depth": 1,
          "replies": [
            {
              "id": "lfhtzzz",
              "score": 4,
              "body": "None of these features are device selling but the market is betting they are.",
              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfhtzzz/",
              "created": 1722264571,
              "depth": 2,
              "replies": [
                {
                  "id": "lficbl2",
                  "score": 4,
                  "body": "You say that and then 200 million iPhones sell. You’re underestimating the power of kids in school bragging about the new AI features they have on the iPhone 16 and they’re the only ones that have it.",
                  "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lficbl2/",
                  "created": 1722270582,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfid3rm",
                      "score": 5,
                      "body": "Kids in schools isn’t going to drive a significant upgrade cycle and I don’t see AI features driving the upgrade significantly beyond existing upgrade reasons.",
                      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfid3rm/",
                      "created": 1722270837,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfidh2v",
                          "score": 2,
                          "body": "Well I guess we’ll find out come earnings after the holidays.",
                          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfidh2v/",
                          "created": 1722270959,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lfit9hd",
          "score": 1,
          "body": "since i switched the google ai assistant to gemini-powered you can ask anything and get pretty good answers, also you can just make a photo and ask things about it. Its actually useful. (Android is a bit ahead this time)",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfit9hd/",
          "created": 1722275983,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfhspmx",
          "score": 1,
          "body": "that calculator is friggin awesome tho",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfhspmx/",
          "created": 1722264138,
          "depth": 1,
          "replies": [
            {
              "id": "lfhuh82",
              "score": -1,
              "body": "That’s been around for like 5-10 yrs. Just not on apple devices lol",
              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfhuh82/",
              "created": 1722264730,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfinzk4",
          "score": 0,
          "body": "You are straight up yapping",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfinzk4/",
          "created": 1722274319,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfi53g1",
      "score": 2,
      "body": "Apple delaying new features to a later iOS release is not new. Happens literally every cycle.",
      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfi53g1/",
      "created": 1722268220,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfmrv2m",
      "score": 2,
      "body": "Interesting that Apple is using Google instead of Nvidia.\n\nhttps://www.reuters.com/technology/apple-says-it-uses-no-nvidia-gpus-train-its-ai-models-2024-07-29/?utm_source=reddit.com&utm_source=reddit.com",
      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfmrv2m/",
      "created": 1722338379,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfitz0q",
      "score": 5,
      "body": "I don't want artificial intelligence on my phone. A.I. will be the end of privacy. It was already happening but it's totally over now. Technology companies will lobby Congress for intrusive rights into all of our data. They'll say it's \"too important of an opportunity to pass up.\" Europe will have to pass regulations that the U.S. would never dream of implementing.",
      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfitz0q/",
      "created": 1722276205,
      "depth": 0,
      "replies": [
        {
          "id": "lfj0f88",
          "score": 1,
          "body": "I feel the opposite. I constantly forget where I place things or where I parked and would love if Google  or Apple was keeping track of where everything is for me.",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfj0f88/",
          "created": 1722278225,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfjjhlc",
          "score": 1,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfjjhlc/",
          "created": 1722284308,
          "depth": 1,
          "replies": [
            {
              "id": "lfjl1jk",
              "score": 0,
              "body": "Will have to remember to disable A.I after every software update.",
              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfjl1jk/",
              "created": 1722284793,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfmjkv5",
      "score": 1,
      "body": "I'm up 80% with apple on a 250k investment, not a big fan of their products but Apple stock prints money over time.",
      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfmjkv5/",
      "created": 1722333440,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfhzkpd",
      "score": -1,
      "body": "I wish Apple would get serious about AI.   To me that means start to do tons of research and get your papers accepted at NeurIPS.\n\nBut I do not think Apple is built for this type of thing.   \n\nPlus I am not convinced they really need to. I think they can instead just sell access to their customers.\n\nLike how they do search.\n\nThe problem is going to be that some of this AI stuff will really need to be able to access the phone at a lower level and that is hard for Apple to hand over to someone else.\n\nTake a feature I just love.  Circle to search.   It is not something you really could do with an app.  It has to be at a lower level.\n\nBut when things are really going to get interesting is when we can have a worthwhile agent.  Eventually we will all interact with an Agent to handle our crap on our behalf.  It will also be worth a ton of money.\n\nGoogle is built to take this space and would expect that to happen.   Definitely on Android and then I would expect Google to pay Apple to have it on iOS.",
      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfhzkpd/",
      "created": 1722266420,
      "depth": 0,
      "replies": [
        {
          "id": "lfi8lty",
          "score": 1,
          "body": "What about https://machinelearning.apple.com/updates/apple-at-neurips-2023 and https://machinelearning.apple.com/updates/apple-at-neurips-2022? That’s both sponsoring it and a lot of papers they have had accepted. \n\nApple already do tons of research and publish several AI and ML papers a year. They just don’t really make a big deal about it, and so people don’t mentally associate them with it. \n\nApple doesn’t really have a research problem. They have a fear of marketing anything that isn’t a shipping feature, unlike their competitors. All their coolest work requires you to actively be involved in the respective community to see what they do.",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfi8lty/",
          "created": 1722269372,
          "depth": 1,
          "replies": [
            {
              "id": "lfi9br6",
              "score": -2,
              "body": "They are pretty poor in terms of research.    Take mobile.  There is only Google and Apple as the two have 99% share so you would expect the two companies to be similar in terms of AI Research.\n\nBut if we look at AI Research we see Google way out ahead of Apple.\n\nOVer the last 10 NeurIPS we have Google with the most papers accepted every year.   Most years they are #1 and #2 as they use to split up Google Brain from DeepMind.\n\nApple should at least be competitive with Google but they are not even close.",
              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfi9br6/",
              "created": 1722269609,
              "depth": 2,
              "replies": [
                {
                  "id": "lfiy5jg",
                  "score": 1,
                  "body": "Now you’re just moving the goalposts. \n\nYes Google does more published research. The companies have different focuses and culture . That doesn’t mean Apple doesn’t publish good research as well, and it doesn’t mean they aren’t doing unpublished research.",
                  "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfiy5jg/",
                  "created": 1722277520,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfiyoej",
                      "score": -1,
                      "body": "Have not moved any goalpost.   Like to see Apple get a lot more serious about AI and try to catch up to Google at least a little.\n\nInstead they are planning on relying on others like OpenAI.   \n\nThere is no reason Apple should not be able to do some of this themselves.",
                      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfiyoej/",
                      "created": 1722277682,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfiz8v6",
                          "score": 2,
                          "body": "Literally your first comment is\n\n> I wish Apple would get serious about AI.   To me that means start to do tons of research and get your papers accepted at NeurIPS.\n\nThen you move it to this after I show you you’re incorrect. \n\n> Apple should at least be competitive with Google but they are not even close.\n\nThat is moving the goalposts.",
                          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfiz8v6/",
                          "created": 1722277858,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lfj9wic",
                              "score": -1,
                              "body": "Yes.  Wish Apple would get serious about AI.  They have NOT.  You can see how bad it is when you compared to Google.\n\nNo goalpost.   Apple should be ashamed how bad they are at AI.",
                              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfj9wic/",
                              "created": 1722281269,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lfhz6qb",
      "score": -1,
      "body": "Big nothing burger. Ios18 should release in Sept but the new phones won’t roll out until Oct most likely so the AI dot release will align with the new devices.",
      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfhz6qb/",
      "created": 1722266292,
      "depth": 0,
      "replies": [
        {
          "id": "lfi1r19",
          "score": 5,
          "body": "What? The iPhones release in September.",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfi1r19/",
          "created": 1722267133,
          "depth": 1,
          "replies": [
            {
              "id": "lfi48ff",
              "score": -2,
              "body": "Usually but not always. I might be wrong but just a feeling.",
              "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfi48ff/",
              "created": 1722267942,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfifbzu",
      "score": -1,
      "body": "My biggest complaint about the AI Bubble is that the world doesn’t need hundreds if not thousands of AI Assistants for covering each specific platform. From a Consumer perspective, do I have to train each different assistant my preferences for that specific task or can I have a single Artificial Intelligence Assistant that is cross-compatible, collects information, gives relevant suggestions, and can assist with multiple processes? If I want my AI to assist with a financial plan, budgeting, etc I need it to be able to work with different databases to create an accurate model. \n\nI don’t want an assistant dedicated to books, music, just my checking account, just my brokerage account, etc. I want an assistant that can develop outputs with the WHOLE picture not a small component of it.",
      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfifbzu/",
      "created": 1722271560,
      "depth": 0,
      "replies": [
        {
          "id": "lfio7xx",
          "score": 3,
          "body": "From a consumer standpoint, no.",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfio7xx/",
          "created": 1722274393,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfhx2pg",
      "score": -9,
      "body": "lol this company is always 3 years behind",
      "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfhx2pg/",
      "created": 1722265591,
      "depth": 0,
      "replies": [
        {
          "id": "lfhytcv",
          "score": 13,
          "body": "But somehow usually instantly becomes the best at whatever they do as soon as they decide to do it. ",
          "permalink": "/r/stocks/comments/1ef04y7/apple_to_roll_out_artificial_intelligence/lfhytcv/",
          "created": 1722266170,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}