{
  "title": "Sofi's Third Profitable Quarter with EPS of 0.01 beating the estimated EPS of 0.00. Raised 2024 Guidance.",
  "score": 84,
  "selftext": "***EPS of $0.01*** **(Average Estimated $0.00)**\n\n***2024 Earning guidance Second Upward Revision of $0.09 to $0.10 (Previous quarter had 2024 Earning guided for $0.08 to $0.09)***\n\n***Triple beat with better-than-expected positive earnings, elevated revenue YOY, and raised guidance.***\n\n***Strong Q3 EPS Guidance of $0.04***\n\n***SoFi's Q2 Earnings and Member Growth benefit nicely from member migration magnitized by SoFi's APY which is up to 460X higher than the big banks.***\n\n**If you find a stock that Customers love, and as long as the company continues to execute then Wallstreet eventually will catch up to the Customers' mindset and the stock will rise from the ashes. I think SoFi stock is very close to that pivoting point.**\n\n* **SoFi Technologies Reports Net Revenue of $599 Million and Net Income of $17 Million for Q2 2024, Marking Third Consecutive Quarter of GAAP Profitability**\n* Record Adjusted Net Revenue **Driven by 46% Combined Growth in Financial Services and Tech Platform Segments** vs 5% Lending Growth Given Conservative Stance\n* **41% Growth in Members** and Strong Product Innovation Remain Key Drivers of Current and Future Growth\n* Management Raises FY24 Guidance\n* Anthony Noto, CEO of SoFi Technologies, Inc. commented: “**We had an exceptional second quarter**. Our relentless focus on product innovation and member growth across our portfolio of businesses not only drove strong results today, but we expect that they'll fuel financial growth for years to come. Our one-stop shop strategy continues to deliver **strong, diversified growth and profitability, despite macroeconomic volatility**.\"\n* “Our **Financial Services and Tech Platform segments now make up a record 45% of SoFi's adjusted net revenue, up from 38% a year ago and 32% two years ago**,\" Noto continued. \"In the second quarter, these businesses grew revenue by a combined 46% year-over-year, given **our clear structural advantages and leading value proposition in Financial Services, along with the** ***Tech Platform's continued progress on its journey of becoming the AWS of financial services***. Despite the rate environment and our conservative stance in Lending, we drove sustained strong results in the quarter and are ready to move quickly once things improve.\"\n\n# Member and Product Growth:\n\n***Continued growth of over 30% in both total members and products in the second quarter of 2024, along with improving operating efficiency, reflects the benefits of our broad product suite and unique Financial Services Productivity Loop (FSPL) strategy.***\n\n**New member additions were over 643,000 in the quarter, and total members reached nearly 8.8 million by quarterend, up over 2.5 million, or 41%, from the prior year period.**\n\n**Product additions were over 946,000 in the second quarter of 2024**, and total products were nearly 12.8 million, up 36% from 9.4 million at the same prior year period, or 43% when excluding digital assets accounts related to our transfer of crypto services in 2023.\n\n# Guidance and Outlook:\n\n***For the third quarter of 2024, management expects to deliver adjusted net revenue of $625 to $645 million, adjusted EBITDA of $160 to $165 million, net income of $40 to $45 million and $0.04 of EPS.***\n\n**For the full year 2024, management now expects to deliver adjusted net revenue of $2.425 to $2.465 billion, which is $35 million higher than the prior guidance range of $2.39 to $2.43 billion. This implies 17 to 19% annual growth versus 15 to 17% previously.** This guidance now assumes lending revenue will be at least 95% of 2023 levels, versus prior guidance of segment revenue of 92 to 95% of 2023 levels. **We expect the Financial Services segment revenue to grow more than 80% year-over-year, versus prior guidance of more than 75% growth, and for Tech Platform revenue to grow mid-to-high teens percentage year-over-year, versus prior guidance of 20% growth**.\n\nManagement now expects to deliver adjusted EBITDA of $605 to $615 million, above prior guidance of $590 to $600 million. This represents a 25% adjusted EBITDA margin. **We now expect full-year GAAP net income of $175 to $185 million, above prior guidance of $165 to $175 million, and GAAP EPS of $0.09 to $0.10, above prior guidance of $0.08 to $0.09.**\n\nManagement continues to expect growth in tangible book value of approximately $800 million to $1 billion and continues to expect to end the year with a total capital ratio north of 16%. **We continue to expect to add at least 2.3 million new members in 2024, which represents 30% growth.**\n\nManagement will further address full-year guidance on the quarterly earnings conference call.\n\n# Some Highlights of recent SoFi developments:\n\n* **Forbes named SoFi the Top 5 Best Bank in U.S. on April 16th, 2024.**\n* **SoFi ranked #74 largest U.S. Bank by Assets as of 3/31/2024. It was #449 in March 2022.**\n* **On February 26th, SoFi's CFO said it delivered a proof of concept to a top 5 U.S. bank that used SoFi's Fintech technologies.**\n* **SoFi Stadium will host the 2026 FIFA World Cup, Super Bowl LXI in 2027, and the opening and closing ceremonies (as well as soccer and swimming events) of the 2028 Summer Olympics.**\n\n**SoFi's Fintech mainly consists of two core technologies powered by Galileo and Technisys which form the \"AWS of Fintech\".**\n\n***1. Galileo Financial Technologies*** ***provides and processes debit and ACH transactions*** on the platform with a number of APIs that allow a developer to build just an app on top of it.\n\n***2. Technisys*** *is* a ***Core banking platform for banks*** that runs Bank Operating System for different products.\n\n[https://s27.q4cdn.com/749715820/files/doc\\_financials/2024/q2/Q2-2024-Earnings-Release.pdf](https://s27.q4cdn.com/749715820/files/doc_financials/2024/q2/Q2-2024-Earnings-Release.pdf)",
  "link_flair_text": "Company News",
  "id": "1efrd39",
  "num_comments": 40,
  "created_utc": 1722340291,
  "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/",
  "comments": [
    {
      "id": "lfnzsj4",
      "score": 51,
      "body": "SOFI could find a cure to cancer, create AGI and mine asteroids and still trade between 6 and 8 dollars with 20% short interest.",
      "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfnzsj4/",
      "created": 1722354882,
      "depth": 0,
      "replies": [
        {
          "id": "lfogg91",
          "score": 22,
          "body": "Maybe if they didn’t have 13% dilution yoy they could grow",
          "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfogg91/",
          "created": 1722360097,
          "depth": 1,
          "replies": [
            {
              "id": "lfoiggo",
              "score": 14,
              "body": "SBC has been trending down. SOFI has grown at a much higher rate than the dilution. SOFI beats and raises their sandbagged guidance. Lower rates will significantly boost SOFI's growth in 2025 and 2026, where EPS guidance (sandbagged) is around 0.55-0.8. Just looking at the fundamentals it looks solid, and the share price will eventually follow.",
              "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfoiggo/",
              "created": 1722360710,
              "depth": 2,
              "replies": [
                {
                  "id": "lfolzmk",
                  "score": 3,
                  "body": "I don’t know enough about SOFI to have a bull or bear case. Just a few notes.\n\nYou can’t call their future guidance sandbagged. Maybe it is, but there is no way to tell and no benefit. It makes you sound like an emotional investor to say that.\n\nSOFI is a bank and should trade at lower valuations due to the extra risk banks bring.\n\nSOFI also has double digit dilution. That’s a massive risk. Even if it is slowing. That rate puts SOFI at massive risk if growth slows at all. That also causes a valuation cut.\n\nThere are obviously positives which you mentioned. But there are legitimate reasons this stock isn’t growing right now, and I’m sure I could find more if I dug through their 10-Q.",
                  "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfolzmk/",
                  "created": 1722361783,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfoo4rd",
                      "score": 6,
                      "body": "I say that their guidance is sandbagged because they have a history of giving conservative guidance and raising it. SOFI is mostly a bank, but trades with a premium and will likely continue to trade with a premium due to their exceptional revenue growth for a bank and their technology platform. I don't see growth slowing in fact the opposite I see growth increasing as SOFI will benefit greatly from lower interest rates.\n\nEven assuming that they don't beat their long term guidance and hit the lowest end of 0.55 eps it still trades at around 13 forward pe, which is not bad considering SOFI revenue growth compared to legacy banks like BOA which trades at 14 current pe.",
                      "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfoo4rd/",
                      "created": 1722362430,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lfyv0cl",
                      "score": 1,
                      "body": "What is dilution? And how does SoFi have double digit dilution?",
                      "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfyv0cl/",
                      "created": 1722516573,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfz6109",
                          "score": 2,
                          "body": "Companies issue in new stock is dilution. So if a company has 100 shares and creates 1 more share to sell they have diluted everyone else’s ownership percentage.\n\nThis dilution can be done through share based compensation or just creating new stock to raise money. \n\nMost companies have a small amount of dilution and it’s ok. Some companies are anti dilutive where they buy back more shares then they create and reduce share count increasing each investors ownership percentage. \n\nSOFI is very dilutive. They create a lot of new shares every year. You can see this in their earnings report. Their diluted shares have increased from 936,569,420 in 2023 to 1,065,171,357 at this point in 2024. That’s roughly a 129,000,000 increase or well over 10%. Which wipes away much of their growth.",
                          "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfz6109/",
                          "created": 1722520761,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lfnsbjh",
      "score": 33,
      "body": "Share count increased by over 10% YoY... They might be one of the worst diluting public companies ",
      "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfnsbjh/",
      "created": 1722352514,
      "depth": 0,
      "replies": [
        {
          "id": "lfpmmao",
          "score": -1,
          "body": "Not even close. Look at the [chart](https://companiesmarketcap.com/sofi/shares-outstanding/#:~:text=According%20to%20SoFi's%20latest%20financial,of%20shares%20outstanding%20is%20982%2C617%2C492). it has flatlined for now.",
          "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfpmmao/",
          "created": 1722373226,
          "depth": 1,
          "replies": [
            {
              "id": "lfpo6o2",
              "score": 1,
              "body": "[removed]",
              "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfpo6o2/",
              "created": 1722373741,
              "depth": 2,
              "replies": [
                {
                  "id": "lfpod13",
                  "score": 2,
                  "body": "Trolling, insults, or harassment, especially in posts requesting advice, is not tolerated.  Please try to keep discussions on /r/stocks civil by providing straightforward responses without including any insults or harassment.\n\nContinual abuse of /r/stocks rule #5 regarding trolling, insulting and harassment will result in your account being banned.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules",
                  "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfpod13/",
                  "created": 1722373800,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lfpfzr9",
      "score": 12,
      "body": "Brain dead comments on this thread. Bullish sign for sure",
      "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfpfzr9/",
      "created": 1722371154,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfnkhzt",
      "score": 27,
      "body": "It’s just a bank not a tech company",
      "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfnkhzt/",
      "created": 1722349950,
      "depth": 0,
      "replies": [
        {
          "id": "lfnw4gf",
          "score": 8,
          "body": "Just making a point, but JPM calls themselves a tech company. They also invest a ridiculous amount in tech. I point this out because pretty much all of the banking industry is embracing tech and that is becoming a substantial part of the business model. Also banks with brick and mortars like Sofi can run much tighter margins, eventually",
          "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfnw4gf/",
          "created": 1722353727,
          "depth": 1,
          "replies": [
            {
              "id": "lfpay7h",
              "score": 3,
              "body": "I guess the lack of brick and mortar saves them enough cash to slap their name on a stadium",
              "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfpay7h/",
              "created": 1722369579,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfnlxz4",
          "score": 0,
          "body": "Exactly! But a lot of people don't want to understand it. ",
          "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfnlxz4/",
          "created": 1722350429,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfn2otu",
      "score": 7,
      "body": "And the stock will go down today ;)",
      "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfn2otu/",
      "created": 1722343433,
      "depth": 0,
      "replies": [
        {
          "id": "lfnml1n",
          "score": 5,
          "body": "Down almost 6% from 30 minutes ago",
          "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfnml1n/",
          "created": 1722350638,
          "depth": 1,
          "replies": [
            {
              "id": "lfnsin2",
              "score": 3,
              "body": "Employees all dumping their absurd amounts of sbc",
              "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfnsin2/",
              "created": 1722352577,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfn18gb",
      "score": 17,
      "body": "How do you bring in $599,000,000 and spend $582,000,000 of it?\n\nThe executives have such a good thing going.\n\nAdjusted EBITDA is pointless for a bank. The growth is anemic for shareholders, the executives are going to be billionaires by the time they retire in SBC\n\n2.4 billion in fiscal revenue and 40 million in profit. A profit margin of 1.6%!\n\nThe core business could make more money simply by investors buying t-bills. Fire every executive and simply buy t-bills, the company makes $108 million a year!",
      "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfn18gb/",
      "created": 1722342807,
      "depth": 0,
      "replies": [
        {
          "id": "lfn54du",
          "score": 51,
          "body": "Have you ever heard of growth lol? \nDo you think Amazon, Google where 40% profitable day one? Come on bro, be serious.\n\nSoFi issued a 2026 EPS guidance of $0.55-$0.80, so the 2026 price-to-earnings (PE) multiple is only 8.65x, at the top end of its guidance\n\nNot too bad ugh?",
          "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfn54du/",
          "created": 1722344425,
          "depth": 1,
          "replies": [
            {
              "id": "lfnrnyu",
              "score": 8,
              "body": "Got to stop you there on Google.\n\nGoogle was profitable at IPO and every year since IPO and had much much higher growth rates than SOFI.\n\nHistory:\n\nGoogle IPOed in August 2004.\n\nGoogle's profit in first annual report (2005) was 1.46B.\n\nGoogle's profit in 2006 was 3.07B, Revenue 10.6B and rev growth was 73%.\n\nSOFI's growth rate is 20%, which is far below Google in the early years, and below Google's growth rate in the later years too. Google even grew through the GFC.\n\nGoogle went from the 1.46B profit to looking to soon be 100B profit in 20 years.\n\nGoogle = High growth rate and highly profitable since day one. \n\nSame for META. They had a very high growth rate (50%~ over many years) and profitable since day one. \n\nI give you Amazon, but it's not all because of small company to big company scaling. It's also because Amazon's e-commerce business doesn't have reliable profits. In 2022, Amazon's retail business lost money. In 2023 their NA business turned a large profit. \n\nTo support the claim that it's not because of growth, see that Amazon NA retail grew 13% from 21 to 22 while profits go from 7B to -3B, then growth rate grew 12% from 22 to 23 while profits went from -3B to 15B.\n\nAmazon does not have that much control over their retail profits as people seem to believe.",
              "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfnrnyu/",
              "created": 1722352303,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfwu6nk",
              "score": 2,
              "body": "Really comparing this to GOOGL huh",
              "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfwu6nk/",
              "created": 1722477133,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfn8eaq",
              "score": -13,
              "body": "It’s a god damn bank. It makes less money than I do on treasury bills.",
              "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfn8eaq/",
              "created": 1722345696,
              "depth": 2,
              "replies": [
                {
                  "id": "lfn8utd",
                  "score": 19,
                  "body": "It's almost like their focus at the moment isnt to squeeze every buck out of the business but to grow.",
                  "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfn8utd/",
                  "created": 1722345872,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfn9e67",
                      "score": -3,
                      "body": "https://investors.sofi.com/news/news-details/2024/SoFi-Technologies-Inc.-Prices-750-Million-Convertible-Senior-Notes-Offering-Due-2029/default.aspx\n\nBut they love to dilute their shareholders to fund the business",
                      "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfn9e67/",
                      "created": 1722346073,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfngmpy",
                          "score": 9,
                          "body": "And that has nothing to do with what we are arguing here so ..     \nBank of America's expenses quadrupled over the last 4 years to now 160 billion per year. Tell them that they are doing it wrong.",
                          "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfngmpy/",
                          "created": 1722348655,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lfp7esa",
                              "score": 2,
                              "body": "What a surprise that a sofi bag holder can't even read an income statement lmao but then ahain misreading 65b for 160b kinda explains how you justify a 1% profit margin for a bank",
                              "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfp7esa/",
                              "created": 1722368467,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lfnj2iw",
                              "score": -1,
                              "body": "Okay, I’ll just ignore it.",
                              "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfnj2iw/",
                              "created": 1722349476,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lfn5518",
          "score": 16,
          "body": ">spend $582,000,000 of it?\n\nFor those interested, their expense breakdown from their Q2 income statement:\n\n- Technology and product development 132,167,000\n\n- Sales and marketing 184,762,000 \n\n- Cost of operations 109,703,000\n\n- General and administrative 145,006,000\n\n- Provision for credit losses 11,640,000",
          "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfn5518/",
          "created": 1722344432,
          "depth": 1,
          "replies": [
            {
              "id": "lfn734v",
              "score": -5,
              "body": "$329 million is simply running their business for a bank. That’s insane.\n\n“You give us money, we hold it and pay you back 4%”\n\n$132,000,000 later over three months. Ever hear of technology and product development?",
              "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfn734v/",
              "created": 1722345197,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfnlam5",
          "score": 9,
          "body": "I’m guessing you’re new to the stock market, but sacrificing profit early on in order to fuel growth is just inherently how young businesses operate. No company is instantly profitable, and it takes several years once they reach profitability to mature their margins. This has been true of every company since the dawn of capitalism.",
          "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfnlam5/",
          "created": 1722350214,
          "depth": 1,
          "replies": [
            {
              "id": "lfno292",
              "score": -8,
              "body": "I have an MBA and taken high level finance courses. It’s a bank bud.\n\nI know how to discount cash flows and calculate WACC if you gave me some time but I don’t use it my current job.",
              "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfno292/",
              "created": 1722351121,
              "depth": 2,
              "replies": [
                {
                  "id": "lfnptr5",
                  "score": 10,
                  "body": "That’s a tough look to hold an MBA, boast about your high level finance education, and still not understand how margin expansion works for new companies.",
                  "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfnptr5/",
                  "created": 1722351690,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfntepr",
                      "score": -3,
                      "body": "Sofi is 13 years old bud. It’s been a bank for 13 years and is hardly squeaking a profit. It needs your money to keep operations going in an industry that has been the same since time and memorial.\n\nAny industry that has a profit margin below a treasury bill is a zombie company.",
                      "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfntepr/",
                      "created": 1722352861,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfnybjl",
                          "score": 12,
                          "body": "> It’s been a bank for 13 years\n\nNot really any point discussing further when it’s clear you don’t know what you’re talking about. They received their bank charter in 2022. \n\nWhy comment about a stock you’ve clearly done zero research in and are very obviously just scanning google searches to find comebacks?",
                          "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfnybjl/",
                          "created": 1722354423,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lfnv9qj",
      "score": 2,
      "body": "andddd it’s red again![gif](emote|free_emotes_pack|hug)",
      "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfnv9qj/",
      "created": 1722353454,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfouwx3",
      "score": 0,
      "body": "this company is a joke. MASSIVE DILUTION\n\nslow growth\n\npitiful EPS. Growth company that doesnt grow.\n\n7$ is too much to be honest.\n\n5$ is more reasonable.",
      "permalink": "/r/stocks/comments/1efrd39/sofis_third_profitable_quarter_with_eps_of_001/lfouwx3/",
      "created": 1722364533,
      "depth": 0,
      "replies": []
    }
  ]
}