{
  "title": "Meta agrees to $1.4 billion settlement in Texas biometric data lawsuit",
  "score": 100,
  "selftext": "Meta has agreed to pay $1.4 billion to settle a lawsuit by the state of Texas over the Facebook owner’s use of biometric data by users, Texas Attorney General Ken Paxton said Tuesday.\n\n“We are pleased to resolve this matter, and look forward to exploring future opportunities to deepen our business investments in Texas, including potentially developing data centers,” a spokeperson for Meta told CNBC in a statement.\n\nSource: https://www.cnbc.com/2024/07/30/meta-agrees-to-1point4-billion-settlement-in-texas-biometric-data-lawsuit.html",
  "link_flair_text": null,
  "id": "1efugpc",
  "num_comments": 5,
  "created_utc": 1722348936,
  "permalink": "/r/stocks/comments/1efugpc/meta_agrees_to_14_billion_settlement_in_texas/",
  "comments": [
    {
      "id": "lfnon20",
      "score": 11,
      "body": "I assume they're referring to facial recognition biometrics?\n\nUnfortunately the AI is already pretty good at beating that. From what I've read third party researchers have been able to beat Microsoft and Amazon's facial recognition as much as 78% of the time using AI generated deepfake images of a person.\n\nFingerprint readers are still safe from AI fakes, due to how they tend to need \"proof of life\" from the finger. But there's plenty of other reasons why fingerprints aren't a very good security mechanism (like the fact that fingerprints aren't actually unique, and once compromised you can't change your biometric data).",
      "permalink": "/r/stocks/comments/1efugpc/meta_agrees_to_14_billion_settlement_in_texas/lfnon20/",
      "created": 1722351307,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lft392j",
      "score": 3,
      "body": "Just 1.4 billion in free enterprise Texas? Wow. These lawsuit settlements are bound to pile up at some point in the future for META. When even schools boards in Toronto are launching lawsuits against META, it's hard not to hit pause. I love the company, but at the same time I worry there may be a day of reckoning for investors when it comes to META, again because of constantly evolving legal privacy issues. Or, keeping in mind this is a company with a global reach, have societies evolved to the point where this shouldn't be an investor concern?",
      "permalink": "/r/stocks/comments/1efugpc/meta_agrees_to_14_billion_settlement_in_texas/lft392j/",
      "created": 1722431433,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfqhbmv",
      "score": 2,
      "body": "I am suprised the stock took it so well.  What about the other 49 states?  Seems like a huge liability.",
      "permalink": "/r/stocks/comments/1efugpc/meta_agrees_to_14_billion_settlement_in_texas/lfqhbmv/",
      "created": 1722383967,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfxsrr2",
      "score": 2,
      "body": "These suits will be overcomed by piling them together and using class action to reduce the Meta outlay. Watch… it’s gonna happen…",
      "permalink": "/r/stocks/comments/1efugpc/meta_agrees_to_14_billion_settlement_in_texas/lfxsrr2/",
      "created": 1722494259,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfnv23x",
      "score": 0,
      "body": "Buy the put !",
      "permalink": "/r/stocks/comments/1efugpc/meta_agrees_to_14_billion_settlement_in_texas/lfnv23x/",
      "created": 1722353387,
      "depth": 0,
      "replies": []
    }
  ]
}