{
  "title": "Boeing reports wider-than-expected loss, weaker revenue ",
  "score": 266,
  "selftext": "Boeing reported a bigger loss and weaker revenue than analysts expected for the second quarter and lower revenue as both its commercial airplane and defense programs continued to struggle.\n\nHere’s how Boeing performed in the second quarter compared with estimates compiled by LSEG:\n\nLoss per share: $2.90 per share adjusted versus $1.97 per share adjusted.\n\nRevenue: $16.87 billion versus $17.23 billion\n\n“Despite a challenging quarter, we are making substantial progress strengthening our quality management system and positioning our company for the future,” CEO Dave Calhoun said in an earnings release on Wednesday.\n\nBoeing is trying to regain its footing after a door plug blowout from a nearly-new 737 Max at the start of the year reignited additional scrutiny from regulators and further slowed deliveries of new, more fuel-efficient jets to airlines.\n\nIn addition to the impact from the door plug accident in January, Boeing, as well as rival Airbus, are dealing with thousands of new workers and a supply chain that can’t keep up with production demands after a demand plunge during the pandemic roiled their businesses.\n\nLower deliveries and production have pushed back some of Boeing’s financial targets. CFO Brian West warned in May that the company would likely burn another roughly $4 billion in the second quarter, similar to the first, largely due to lower production and delivery rates than expected. Boeing was producing its best-selling Max planes a pace in the mid-20s per month in the last few months, far from its target of 38 a month.\n\nStephanie Pope, CEO of Boeing’s commercial airplane unit, told reporters ahead of the Farnborough Airshow outside London earlier this month that the company is trying to make lasting changes to training and quality control, admitting that the company has disappointed customers.\n\n“We’ve impacted their business and we haven’t met the commitments and lived up to being the partner that they expect and they need us to be,” she said. “This plan is not a three-month plan,” said Pope. “I call it transformational because some of these actions will take years.”\n\nBoeing’s other business units have also faced cost overruns and delays, like its defense unit which is building the two Boeing 747 aircraft that will serve as Air Force One, which are behind schedule.\n\nSource: https://www.cnbc.com/2024/07/31/boeing-ba-earnings-q2-2024.html",
  "link_flair_text": null,
  "id": "1egkxwm",
  "num_comments": 73,
  "created_utc": 1722425870,
  "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/",
  "comments": [
    {
      "id": "lfsrwu2",
      "score": 178,
      "body": "How does this stock keep going up with all the bad news, I am not complaining as an owner of the stock but I just don’t get it.\n\nEDIT: Todays correction makes sense",
      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfsrwu2/",
      "created": 1722426564,
      "depth": 0,
      "replies": [
        {
          "id": "lfswksk",
          "score": 60,
          "body": "It's simple. If it's not a tech company, it goes up on earnings, otherwise it goes down.",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfswksk/",
          "created": 1722428679,
          "depth": 1,
          "replies": [
            {
              "id": "lfthdha",
              "score": 20,
              "body": "Unless the earnings report is truly shocking, it’s usually the future outlook that impacts movement more. After all, stock price isn’t based on past earnings, but what we anticipate the company doing going forward.",
              "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfthdha/",
              "created": 1722436509,
              "depth": 2,
              "replies": [
                {
                  "id": "lfu8zuv",
                  "score": 4,
                  "body": "Future outlook, as we've learned, as been wrong pretty often for the last few months.",
                  "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfu8zuv/",
                  "created": 1722445372,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lfuj78x",
                  "score": 6,
                  "body": "if 50% less planes fall out of the sky Boeing is going to make a killing.",
                  "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfuj78x/",
                  "created": 1722448556,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfuwto0",
                      "score": 3,
                      "body": "being the most improved aerospace company in history has to be great for a stocks value.",
                      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfuwto0/",
                      "created": 1722452803,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lfwquva",
                      "score": 2,
                      "body": "But 50% less of a killing than last year!",
                      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfwquva/",
                      "created": 1722475809,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lfwzix5",
              "score": 2,
              "body": "Even the tech stocks have been going up on earnings lately",
              "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfwzix5/",
              "created": 1722479274,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfsu2r4",
          "score": 14,
          "body": "Likely the recent failures and stock crash already sorta knew this was coming. The market is moving based on expectations of the future, not current data. So likely they probably figure with new leadership, Boeing is not a company that will die, improvements on quality control and more, investors probably figure it’s at the bottom and a good jump in moment",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfsu2r4/",
          "created": 1722427561,
          "depth": 1,
          "replies": [
            {
              "id": "lfsyf78",
              "score": 4,
              "body": "I might miss the vision but looking at the numbers of both Boeing and Airbus they are underwelming. There is enormous demand and only two producers. Why can they not raise their margins?",
              "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfsyf78/",
              "created": 1722429475,
              "depth": 2,
              "replies": [
                {
                  "id": "lftizbl",
                  "score": 8,
                  "body": ">There is enormous demand and only two producers. Why can they not raise their margins?\n\nCouple reasons. The airline industry is heavily reliant on financing and debt. So, producers don't have the same pricing power like they would in other industries where demand is high. Secondly, aircraft manufacturing is highly complex and strictly regulated and monitored by governing bodies and agencies (in theory...), so the cost of revenue for Boeing and Airbus are very high. The concept of \"economies of scale\" doesn't really apply to aircraft manufacturing. Not to mention the R&D cost that goes into designing the next generation of aircraft.",
                  "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lftizbl/",
                  "created": 1722437049,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lftlx5p",
                      "score": 1,
                      "body": "How do you view the Boeing Airbus rivalry? Where is their potential for maximising profits and how do you view their space and military branches?",
                      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lftlx5p/",
                      "created": 1722438021,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfuxfpl",
                          "score": 1,
                          "body": "Airbus will be a clear winner from buyers and flyers perception of dangerous Boeing aircraft. The long position is a good bet.\n\nBoeing is murdering people to keep their secrets buried. The cracks run deeper then we can fathom.",
                          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfuxfpl/",
                          "created": 1722452998,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lft0dvj",
                  "score": 3,
                  "body": "I think that’s a good point. But in this case while I can’t say for sure, I think it’s solely based on expectations of the future rather than hard data",
                  "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lft0dvj/",
                  "created": 1722430283,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lft2lef",
                      "score": 1,
                      "body": "Its quite funny after their Q1 results they dipped eventhough they beat expectations and now they are performing bad on all fronts and premarket is positive",
                      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lft2lef/",
                      "created": 1722431170,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lft9v4d",
                          "score": 6,
                          "body": "Something someone taught me helped. Sorry if you already know this but it really has helped me go from losing to actually consistently winning. But if you’re short term trading (if you’re long term ignore this) you should be trading usually based on expectations of the future, not current information (unless announcements/news happen that truly aren’t expected as an exception). If you’re buying cause something met earnings expectations that means nothing to most of the market. They expected that by analyst insight months ago and priced it in. Heck, even if they’re below expectations slightly. But if in the earnings calls or news something comes out that sounds optimistic after the stock has been doing poorly, even without hard data, that makes people flock to stocks because they see earning opportunities. \n\nI think of 2 recent examples. McDonald’s missed. Seemingly bad and they rarely miss. But in their call they talked about how popular the value meals are and they’re expanding these value offerings that are increasing customer traffic and revenue for next quarter. That’s why the stock flew despite it doing bad. Expectations of the future\n\nGoogle is the other. They did just fine but the stock collapsed. Makes no sense. But in the earnings call they basically implied they’re spending tons on AI, not showing revenue for it, but aren’t really sure of how they will make it more profitable. That’s very scary for future growth. \n\nIt went from never making sense to me to it makes sense now, even if it takes more effort to understand",
                          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lft9v4d/",
                          "created": 1722433920,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lftbkyl",
                              "score": 4,
                              "body": "Thank you for your advice, I will keep that in mind. Am usually more of a longterm Investor but sometimes I just cannot ignore the markets because of all the chances that come. Good luck with your trading!",
                              "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lftbkyl/",
                              "created": 1722434525,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lftt9na",
                                  "score": 2,
                                  "body": "You as well!",
                                  "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lftt9na/",
                                  "created": 1722440398,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lfu39bl",
                              "score": 3,
                              "body": "Thank you for sharing! I was also so confuse ... But seeing that way makes a lot of sense.",
                              "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfu39bl/",
                              "created": 1722443568,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lfu6vlp",
                                  "score": 2,
                                  "body": "I was so confused by this also. It now made me forward thinking and my option buying/selling and stock picks have been consistently profitable compared to so up and down. \n\nIt takes more critical thinking/knowledge of businesses and some luck but it helps make better decisions for sure",
                                  "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfu6vlp/",
                                  "created": 1722444711,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lft17ql",
          "score": 11,
          "body": "You can kill a hundreds of people, but as long as you do things like cut staff, wall street will reward you.  It’s quite possibly one of the more morally bankrupt industries",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lft17ql/",
          "created": 1722430616,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lft16gy",
          "score": 5,
          "body": "'cause they make weapons, and the whole world is upping defence spending like crazy.",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lft16gy/",
          "created": 1722430603,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfu4qkk",
          "score": 2,
          "body": "All these companies missing earnings = bullish af for rate cuts. Pricing in some re-investment these companies will be doing in the next few years when they are able to borrow money / service their debts more reasonably.",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfu4qkk/",
          "created": 1722444040,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfvmwls",
          "score": 2,
          "body": "They hired a new ceo today",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfvmwls/",
          "created": 1722461137,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfulkph",
          "score": 1,
          "body": "People are bullish on the new CEO, that's all. If they didn't bundle the new CEO news today, the stock would have dropped.",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfulkph/",
          "created": 1722449296,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfuppvt",
          "score": 1,
          "body": "They announced a new CEO. People are thinking that any change in upper management is better than the current one. Thus the rise in stock price.",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfuppvt/",
          "created": 1722450575,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfus2vc",
          "score": 1,
          "body": "They have government contracts and guaranteed earnings.",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfus2vc/",
          "created": 1722451316,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfw2844",
          "score": 1,
          "body": "Why are you still owning it then? ",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfw2844/",
          "created": 1722466510,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfxhjxr",
          "score": 1,
          "body": "They are the official aircraft manufacturer of the most powerful entity in the world. How can they go down",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfxhjxr/",
          "created": 1722487611,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lft6cwe",
          "score": 0,
          "body": "Perhaps the “news” is hyperbole and freak-out porn rather than actual “news” that affects operations in a material way.",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lft6cwe/",
          "created": 1722432626,
          "depth": 1,
          "replies": [
            {
              "id": "lfwjdz2",
              "score": 2,
              "body": "Planes crashing and losing pieces while they fly is material. ",
              "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfwjdz2/",
              "created": 1722472890,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lftebke",
          "score": 0,
          "body": "If you think about how many planes the world needs in a few years, where all 8 Billion people are flying at least once a year, the stocks is undervalued.",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lftebke/",
          "created": 1722435474,
          "depth": 1,
          "replies": [
            {
              "id": "lfuacq5",
              "score": 2,
              "body": "Why would all 8 billion be flying?",
              "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfuacq5/",
              "created": 1722445800,
              "depth": 2,
              "replies": [
                {
                  "id": "lfzxrac",
                  "score": 1,
                  "body": "It's called global improved standard of living . I'll bet accordingly. You do you",
                  "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfzxrac/",
                  "created": 1722529791,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lg05282",
                      "score": 1,
                      "body": "Improved standard of living does mean more people flying. But it wouldn’t mean everyone.",
                      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lg05282/",
                      "created": 1722532071,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lg0b9vx",
                          "score": 2,
                          "body": "https://www.airlines.org/new-survey-nearly-90-percent-of-americans-have-flown-commercially.\n\nAre you going to harp on the pedantic definition of \"everyone\" or will you see an opportunity of BA which has a duopoly in Aircraft manufacturing?",
                          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lg0b9vx/",
                          "created": 1722534008,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lg0g85k",
                              "score": 1,
                              "body": "Did you even read your article? You stated everyone will be flying once a year. The article stated only 44% flew in 2022 while 90% have flown once in their lifetime. \n\nRising standard of living across the world should mean a similar occurrence in other countries. Not everyone flying at least once a year. \n\nI’m not arguing there isn’t an opportunity. I’m wondering how you came to the conclusion that everyone will fly every year.",
                              "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lg0g85k/",
                              "created": 1722535539,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lg4213e",
                                  "score": 1,
                                  "body": "Hyperbole helps conviction to buy / hold quality stocks for long term. It also helps to avoid short term noises like what Boeing is facing when you can see the big picture for the next 10-20 years.\n\nIf all 8 Billion people have US standard of living, the world GDP will be 800 Trillion (nominal) in say 30 years. Then list the companies that has a potential to stay that long. Boeing is certainly one of them. So hoard Boeing when it is at it's most hated stage.\n\nNow don't get hungup on 8 Billion people flying every year. Currently the stock is priced assuming only 200 Million are flying every year.  So, even if it's just 1 Billion you'll come out ahead. 8 Billion will help you not to sell Boeing when 1 Billion is hit",
                                  "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lg4213e/",
                                  "created": 1722589063,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lfwj8f2",
              "score": 1,
              "body": "Have you ever actually been outside? ",
              "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfwj8f2/",
              "created": 1722472832,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfsqygt",
      "score": 37,
      "body": "And yet it is up 2.5% pre-market? I just don’t get it",
      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfsqygt/",
      "created": 1722426111,
      "depth": 0,
      "replies": [
        {
          "id": "lfsrya6",
          "score": 26,
          "body": "Expectations, expectations, expectations.\n\nAnd no, I am not talking about analysts, I am talking about investors.",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfsrya6/",
          "created": 1722426583,
          "depth": 1,
          "replies": [
            {
              "id": "lftepui",
              "score": 3,
              "body": "Bingo! When people say \"Wall Street\", they could mean any one of global investors, traders and analysts. And analysts are only a handful and they usually don't trade.",
              "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lftepui/",
              "created": 1722435609,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lftfd36",
          "score": 4,
          "body": "New CEO",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lftfd36/",
          "created": 1722435828,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lftiona",
      "score": 34,
      "body": "CEO received $32MM in salary in 2023, up 45% from 2022 lol. If only I got that for doing a Horrible job",
      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lftiona/",
      "created": 1722436949,
      "depth": 0,
      "replies": [
        {
          "id": "lftlts5",
          "score": 11,
          "body": "Can you imagine if ordinary workers were compensated the same way CEOs are?\n\n\"Underperforming? You poor thing, we'd better *raise your salary* so that you're incentivized to do a better job.\"",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lftlts5/",
          "created": 1722437990,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfsqpjc",
      "score": 25,
      "body": "Boeing has also picked a new CEO in former Collins Aerospace CEO Kelly Ortberg to replace Dave Calhoun.\n\nSource: https://www.cnbc.com/2024/07/31/boeing-taps-former-collins-aerospace-ceo-kelly-ortberg-to-replace-dave-calhoun.html",
      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfsqpjc/",
      "created": 1722425991,
      "depth": 0,
      "replies": [
        {
          "id": "lfsyp9n",
          "score": 25,
          "body": "No idea if he's a solid pick, apparently he's highly regarded in aerospace and an actual engineer, not a bean counter",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfsyp9n/",
          "created": 1722429591,
          "depth": 1,
          "replies": [
            {
              "id": "lft3h22",
              "score": 18,
              "body": "Not as regarded as me though",
              "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lft3h22/",
              "created": 1722431522,
              "depth": 2,
              "replies": [
                {
                  "id": "lfudk1h",
                  "score": 2,
                  "body": "no doubt haha",
                  "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfudk1h/",
                  "created": 1722446801,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lft6ya1",
              "score": 8,
              "body": "Never go full regarded.",
              "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lft6ya1/",
              "created": 1722432850,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lftlijj",
              "score": 3,
              "body": "Think it's more important for Boeing and people travelling on their planes that the new CEO just isn't from GE",
              "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lftlijj/",
              "created": 1722437888,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfxe8cu",
              "score": 3,
              "body": "It's bad when I don't know if you mean highly regarded or \"highly regarded\"",
              "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfxe8cu/",
              "created": 1722485896,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lft2mb0",
      "score": 9,
      "body": "Is it safe to report that Boeing had a loss?",
      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lft2mb0/",
      "created": 1722431180,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfstyn0",
      "score": 22,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfstyn0/",
      "created": 1722427509,
      "depth": 0,
      "replies": [
        {
          "id": "lfvxo2p",
          "score": 3,
          "body": "Just appointed a new ceo who’s an actual engineer so maybe they’re finally going to do the bare minimum?",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfvxo2p/",
          "created": 1722464859,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lftj0ug",
      "score": 5,
      "body": "BA's stock stays elevated a lot easier than their planes do.",
      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lftj0ug/",
      "created": 1722437063,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lftcbfu",
      "score": 9,
      "body": "As a person who works in Quality control, I would not touch this stock. People skipping required steps in an assembly process is a culture problem, likely related to staff under pressure to work fast. Process audits might catch some of the issues, but it won't necessarily change the behavior of the individuals actually responsible for the errors. \n\nYou virtually have to clean house and start with fresh staff to actually get the virus out of the system.",
      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lftcbfu/",
      "created": 1722434786,
      "depth": 0,
      "replies": [
        {
          "id": "lftfha0",
          "score": 2,
          "body": "New CEO so maybe that will happen?",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lftfha0/",
          "created": 1722435868,
          "depth": 1,
          "replies": [
            {
              "id": "lftjd1m",
              "score": 4,
              "body": "Maybe. Or maybe it won't happen and they will go through another CEO. Some companies are not quick on the trigger for terminations, but the guys who are not torquing bolts on aircrafts, or not reporting damaged components, need to be shown the door imediately.",
              "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lftjd1m/",
              "created": 1722437178,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lftf8op",
          "score": 0,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lftf8op/",
          "created": 1722435787,
          "depth": 1,
          "replies": [
            {
              "id": "lfthgct",
              "score": 5,
              "body": "I'm just saying, they aren't going to turn this around in a couple of quarters. This is going to take years and a lot of turnover.",
              "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfthgct/",
              "created": 1722436536,
              "depth": 2,
              "replies": [
                {
                  "id": "lfue182",
                  "score": 1,
                  "body": "Do you do quality control for Boeing? No it's definitely a multi-year turn around. It seemed like they were well on their way but when it hit 267. We know what happened in January.",
                  "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfue182/",
                  "created": 1722446950,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfueevw",
                      "score": 4,
                      "body": "No. But I work quality control that is meant to adhere to the AS9100 standard, and I know that it's not just the quality departments responsibility. \n\nThe QA group sets the rules, but the rest of the employees have to follow them. When it's a lot of employees, over several locations, changing that culture is a bitch.\n\nIt's likely that the rules have always been in place but the rest of the company has disregarded it.",
                      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfueevw/",
                      "created": 1722447069,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lg0wj2k",
      "score": 1,
      "body": "Boeing is looking like the 2020s General Motors. I'm sure they will get a big government bail out when they go bust ",
      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lg0wj2k/",
      "created": 1722540661,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg2elak",
      "score": 1,
      "body": "I sold my entire position before earnings, and will buy back in tomorrow. They call me master of swings.",
      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lg2elak/",
      "created": 1722559087,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lft2dqn",
      "score": 0,
      "body": "All those dei hires are paying off!",
      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lft2dqn/",
      "created": 1722431084,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfu7fp8",
      "score": 0,
      "body": "I’m sure the US Taxpayer will give them another $20b to burn next year. As is promised.",
      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfu7fp8/",
      "created": 1722444885,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfsueg8",
      "score": -9,
      "body": "And yet the union is talking strike again because they want more money.",
      "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfsueg8/",
      "created": 1722427709,
      "depth": 0,
      "replies": [
        {
          "id": "lft2cb1",
          "score": 5,
          "body": "Good. I hope they strike for 6 damn months and cost Boeing another 3 buck per share loss. Fuck Boeing.",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lft2cb1/",
          "created": 1722431068,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lft5sbn",
          "score": 2,
          "body": "What do you mean again? Boeing and IAM 751 haven’t had negotiations since 2008. The contract was meager, workers deserve more. The point of the union is to exercise their rights and part of that is the ability to strike",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lft5sbn/",
          "created": 1722432410,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfyq4w2",
          "score": 0,
          "body": "People fighting for better life conditions, yuck!",
          "permalink": "/r/stocks/comments/1egkxwm/boeing_reports_widerthanexpected_loss_weaker/lfyq4w2/",
          "created": 1722514459,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}