{
  "title": "ASML shares pop 7% after US reportedly will exempt allies from China chip restrictions ",
  "score": 179,
  "selftext": "Shares of ASML jumped as much as 10% on Wednesday after a Reuters report suggested that the company could be exempted from expanded export restrictions on chipmaking gear to China.\n\nReuters reported on Wednesday that the U.S. is considering expanding the so-called foreign direct product rule, but that allies that export key chipmaking equipment — including Japan, the Netherlands and South Korea — will be excluded.\n\nExports to China from countries including Israel, Taiwan, Singapore and Malaysia will be impacted by the U.S. rule, according to Reuters. Taiwan is the home of TSMC, the world’s biggest chip manufacturing plant.\n\nThis comes in contrast to a Bloomberg report earlier this month, which suggested that companies from these countries would be included in an expansion of the rules.\n\nThe foreign direct product legislation frames that any company that produces semiconductor-related products using even a small part of American technology may not be able to export those goods to China. This U.S. rule can impact foreign companies, since they often rely on American technology.\n\nNetherlands-headquartered ASML — a critical semiconductor firm, because it makes a machine that is required to manufacture the world’s most advanced chips — was trading around 7% higher at 3.59 a.m. ET, in the wake of the Reuters report.\n\nShares of Tokyo Electron, a semiconductor equipment maker in Japan, also closed more than 7% higher on Thursday after the report.\n\nBoth these companies’ shares fell after Bloomberg’s initial report earlier in the month.\n\nShares of South Korean memory chip firms Samsung and SK Hynix were also higher in South Korea, following the Reuters report. Samsung’s boost also came after the company posted second-quarter earnings on Wednesday, beating market expectations.\n\nSource: https://www.cnbc.com/2024/07/31/us-reportedly-will-exempt-allies-from-china-chip-controls-asml-shares-rise.html",
  "link_flair_text": null,
  "id": "1egkoro",
  "num_comments": 33,
  "created_utc": 1722425012,
  "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/",
  "comments": [
    {
      "id": "lfsoqzm",
      "score": 1,
      "body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lfsoqzm/",
      "created": 1722425013,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lft0v3f",
      "score": 50,
      "body": "That's literally a miracle,.. I actually bought one share yesterday",
      "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lft0v3f/",
      "created": 1722430476,
      "depth": 0,
      "replies": [
        {
          "id": "lftfl4s",
          "score": 10,
          "body": "Haha, I bought like 3 last week. I feel so rich now.",
          "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lftfl4s/",
          "created": 1722435904,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lftebgn",
          "score": 1,
          "body": "Was loading up last few days as I wanted to open position for a while. Hoping for a stock split as I want to buy more shares at more regular basis (I don’t buy fractional because of preferred broker).",
          "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lftebgn/",
          "created": 1722435473,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfsxfei",
      "score": 72,
      "body": "Then what’s the point for restrictions ",
      "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lfsxfei/",
      "created": 1722429051,
      "depth": 0,
      "replies": [
        {
          "id": "lft2il9",
          "score": 35,
          "body": "Trade war with China, not EU?",
          "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lft2il9/",
          "created": 1722431138,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lft2qcm",
          "score": 16,
          "body": "Limit supply without messing with economies of allies that will cause an uproar. The chosen countries (s-Korea, Japan, and the Netherlands) would probably give a middle-finger to the US for getting involved in their policies. The other countries are more dependent on the US so will more likely listen.",
          "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lft2qcm/",
          "created": 1722431226,
          "depth": 1,
          "replies": [
            {
              "id": "lfvopts",
              "score": 9,
              "body": "ASML is dependent on an American supplier of components of their machines, so that’s where the US has leverage. You should read the chip war book if you’re interested in learning how critical ASML is in the global economy",
              "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lfvopts/",
              "created": 1722461740,
              "depth": 2,
              "replies": [
                {
                  "id": "lfy8mws",
                  "score": 2,
                  "body": "Which one is it? I see one from 2022, but that is maybe a bit lacking in the latest developments...",
                  "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lfy8mws/",
                  "created": 1722504984,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfticg0",
          "score": 1,
          "body": "Get the headline and say they did something about it",
          "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lfticg0/",
          "created": 1722436835,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lful0pd",
          "score": 1,
          "body": "Elections",
          "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lful0pd/",
          "created": 1722449122,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfy088q",
          "score": 1,
          "body": "If the United States wishes to apply the \"doctrine of limited sovereignty\" economically to its allies, it can do so.",
          "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lfy088q/",
          "created": 1722499206,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfu99h2",
          "score": 1,
          "body": "I really hope they're starting to realize that China is gonna get the tech anyways. Cooperation/less restriction is such a better option for all.",
          "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lfu99h2/",
          "created": 1722445456,
          "depth": 1,
          "replies": [
            {
              "id": "lfvdav4",
              "score": 4,
              "body": "Agreed. But China doesn’t want to cooperate/integrate. They want to get the tech and then create the same tech on their own. They want to be totally independent in advanced chip technology design and production. And then sell their tech to the rest of the world. It’s part of their “made in China” plan.",
              "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lfvdav4/",
              "created": 1722458048,
              "depth": 2,
              "replies": [
                {
                  "id": "lfvdf8u",
                  "score": 1,
                  "body": "Yeah, that's v true.",
                  "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lfvdf8u/",
                  "created": 1722458088,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lftqepf",
      "score": 13,
      "body": "That doesn’t make sense. Mainly blocking ASML from selling to China was a key way in preventing China’s technology development.",
      "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lftqepf/",
      "created": 1722439483,
      "depth": 0,
      "replies": [
        {
          "id": "lfttvbi",
          "score": 21,
          "body": "Looks like US didn’t didn’t have good arguments for these countries to stop making money from China and not getting anything in return from US.",
          "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lfttvbi/",
          "created": 1722440590,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lftzv0f",
          "score": 13,
          "body": "Its this time about DUV machines, not the latest tech. ASML is selling those to China. \n\nChina restrictions are on the EUV machines, they dont have any of those. Those sales where bannend a while ago.",
          "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lftzv0f/",
          "created": 1722442487,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lftspdx",
          "score": 17,
          "body": "It does make sense. China mass produced 7nm chips without ever having an ASML EUV lithography machine. \n\nIf you prevent them from buying from the source they’ll make an alternative. \n\nASML could either continue selling and make money now and in the future, or stop selling, force a competitor into existence, and never sell again.\n\nOnly idiots that believe the Chinese can’t innovate on their own thought it would block them from developing technology.",
          "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lftspdx/",
          "created": 1722440220,
          "depth": 1,
          "replies": [
            {
              "id": "lftull6",
              "score": 7,
              "body": "It would not stop them it would slow them down. No one ever thought China would not make progress. Heck, we all know they are still getting all the goods from the black or gray markets, including AI chips.",
              "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lftull6/",
              "created": 1722440821,
              "depth": 2,
              "replies": [
                {
                  "id": "lfxt4df",
                  "score": 2,
                  "body": "I wonder what we aim to achieve by slowing China down? What are we racing to?",
                  "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lfxt4df/",
                  "created": 1722494485,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfxw7ab",
                      "score": 2,
                      "body": "We are aiming to put China into a second cultural revolution so that they wouldn’t have the money or capability to invade Taiwan and start a war.",
                      "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lfxw7ab/",
                      "created": 1722496476,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfzgj77",
                          "score": 1,
                          "body": "Though that brings into question if advance chips (<7nm) are even absolutely necessary for military capabilities,",
                          "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lfzgj77/",
                          "created": 1722524294,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lg4jwfe",
                  "score": 1,
                  "body": "An important note here is that these restrictions were not about the most recent tech, but about DUV machines which a competitor could more easily recreate. So it’s more about not creating the perfect conditions for a competitor to bloom than keeping the latest tech out of their hands. The newest tech was already trade restricted and will remain so.",
                  "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lg4jwfe/",
                  "created": 1722599456,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lftlbvh",
      "score": 10,
      "body": "Fucking idiot that news of restrictions did so much damage to my port",
      "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lftlbvh/",
      "created": 1722437828,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lftxhiw",
      "score": 10,
      "body": "I guess the US is admitting the trade war with China is not as impactful as they thought it would be.\n\nChina created their only method of making 7nm chips and reports of 5nm are almost ready for commercial applications.\n\nObviously ASML was going to lose out big time.\n\nSouth Korea and Japan were losing market share to China domestic companies as well.\n\nTaiwan TSMC already has 2 fabs in China.  Because it's a foreign company, it didn't qualify for the CHIP Act subsidies.  So the US chip fabs are delayed not only due to money but cultural friction between Taiwanese and American workers.\n\nSo if ASML can sell to China.  China has 2 TSMC chip fabs with Taiwanese engineers working visa free in China.  What's the whole point of this small yard high fence strategy.",
      "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lftxhiw/",
      "created": 1722441732,
      "depth": 0,
      "replies": [
        {
          "id": "lftzdgr",
          "score": 14,
          "body": "TSMC does qualify for the CHIP Act subsidies, and TSMC follows US laws on sales to China. TSMC actually has a waiver from the US government to supply their China-based TSMC fabs.\n\nhttps://www.reuters.com/technology/taiwan-minister-says-tsmc-has-received-china-chip-waiver-extension-us-2023-10-13/",
          "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lftzdgr/",
          "created": 1722442333,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfu5nat",
          "score": 14,
          "body": "TSMC has been given billions from the US government to expand their operations there. Their Arizona fab is set to start production in the first half of 2025.",
          "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lfu5nat/",
          "created": 1722444327,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfu2gox",
      "score": 2,
      "body": "I feel like this is a short term bullish thing but at the end, China will always have homegrown technology that will phase out foreign competitors. It has been the case on every single industry. So I think all these companies should less reliance on Chinese market strategically before it creates a huge dent in balance sheet like Starbucks and Apple.",
      "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lfu2gox/",
      "created": 1722443312,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lft4g4p",
      "score": 1,
      "body": "not sure if i'm reading this right but does this mean they're imposing sanctions on TSM? Not sure why TSM is up... and also why they would do that",
      "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lft4g4p/",
      "created": 1722431900,
      "depth": 0,
      "replies": [
        {
          "id": "lfthev2",
          "score": 5,
          "body": "From the wording, it sounds like it's veiled to further push TSMC manufacturing to the United States or another NATO country. The wording says \"exports from Taiwan\" not exports from TSMC. While Japan isn't a part of NATO, the Netherlands is and South Korea is a partner with NATO.\n\nTSMC is recently building multiple manufacturing facilities in Arizona due to the CHIPS act. When that was announced I was thinking that TSMC plans to shield itself from China via moving their manufacturing slowly to a country that has a more stout defense capability.",
          "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lfthev2/",
          "created": 1722436522,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lft9t0r",
          "score": 1,
          "body": "up because of amd",
          "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lft9t0r/",
          "created": 1722433899,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfti90f",
          "score": 1,
          "body": "TSMC isn't a Chinese company, it isn't sanctioned.",
          "permalink": "/r/stocks/comments/1egkoro/asml_shares_pop_7_after_us_reportedly_will_exempt/lfti90f/",
          "created": 1722436803,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}