{
  "title": "MasterCard beats quarterly profit estimates on sturdy spending",
  "score": 78,
  "selftext": "Mastercard's second-quarter profit beat expectations as customers kept up spending heavily using its cards, sending shares of the payments giant nearly 3% higher before the open on Wednesday.\n\nA tight labor market has ensured job security for customers, allowing them to make purchases without restraint even as the U.S. Federal Reserve keeps monetary policy tight.\n\nHowever, several of Mastercard's peers have flagged slowing growth, particularly from low-income customers, as wage inflation moderates and elevated interest rates weigh on customer sentiment.\n\nMastercard's switched volume, which measures the value of transactions processed on its network, were 10% higher than last year.\n\nCross-border volume, a gauge of travel demand that tracks spending on cards outside the country of their issue, climbed 17% in the same quarter.\n\nCommentary from payments companies is being watched closely for signs that the Fed's rate-hiking campaign is bearing fruit.\n\nMastercard's profit rose 17%, to $3.3 billion, or $3.50 per share for the three months ended June 30. Excluding one-time costs, it earned $3.59 per share, versus the estimate of $3.51, according to LSEG data.\n\nIts revenue rose 13% from a year ago on a currency-neutral basis, to $7 billion.\n\nThe company's shares have risen nearly 5% so far this year, outperforming its chief rival Visa's 1% gain.\n\nPeers American Express, Capital One and Discover Financial have jumped 35%, 16% and 29%, respectively. Capital One agreed to buy Discover in a $35.3-billion deal earlier this year.\n\nSource: https://ca.finance.yahoo.com/news/mastercards-quarterly-profit-jumps-buoyant-120923627.html",
  "link_flair_text": null,
  "id": "1egn4p4",
  "num_comments": 7,
  "created_utc": 1722432338,
  "permalink": "/r/stocks/comments/1egn4p4/mastercard_beats_quarterly_profit_estimates_on/",
  "comments": [
    {
      "id": "lft9r7h",
      "score": 33,
      "body": "Mastercard is an amazing company. I am sad that I didn't add more when it fell a few days ago.",
      "permalink": "/r/stocks/comments/1egn4p4/mastercard_beats_quarterly_profit_estimates_on/lft9r7h/",
      "created": 1722433880,
      "depth": 0,
      "replies": [
        {
          "id": "lftnlk6",
          "score": 9,
          "body": "Can’t go wrong with MA, V, or AXP",
          "permalink": "/r/stocks/comments/1egn4p4/mastercard_beats_quarterly_profit_estimates_on/lftnlk6/",
          "created": 1722438578,
          "depth": 1,
          "replies": [
            {
              "id": "lfuvdsp",
              "score": 5,
              "body": "I would exclude AXP here, the business model is a bit different",
              "permalink": "/r/stocks/comments/1egn4p4/mastercard_beats_quarterly_profit_estimates_on/lfuvdsp/",
              "created": 1722452344,
              "depth": 2,
              "replies": [
                {
                  "id": "lfveeu8",
                  "score": 4,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1egn4p4/mastercard_beats_quarterly_profit_estimates_on/lfveeu8/",
                  "created": 1722458400,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfvnary",
                      "score": 5,
                      "body": "AXP lends money and is exposed to credit defaults. They have much less cards which lessens economy of scale and collection of valuable data. My personal experience with them has also been very bad",
                      "permalink": "/r/stocks/comments/1egn4p4/mastercard_beats_quarterly_profit_estimates_on/lfvnary/",
                      "created": 1722461267,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lfz17ag",
      "score": 0,
      "body": "Need to buy some, I own V but not this for some strange reason",
      "permalink": "/r/stocks/comments/1egn4p4/mastercard_beats_quarterly_profit_estimates_on/lfz17ag/",
      "created": 1722519005,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfwub9b",
      "score": -2,
      "body": "Sell now or at the latest before any negative news coming later this year about large retailers being able to charge credit/debit card convenience fees up to 5%. If it happens then credit card use could drop up to 50% especially with restaurant/bar, retail, gas station customers where prices are already too high because of high inflation. This is a problem neither Visa or Mastercard are discussing, but it could decrease their earnings.",
      "permalink": "/r/stocks/comments/1egn4p4/mastercard_beats_quarterly_profit_estimates_on/lfwub9b/",
      "created": 1722477182,
      "depth": 0,
      "replies": []
    }
  ]
}