{
  "title": "Nasdaq, S&P 500 post best day since Feb after Powell signals possible rate cut in Sept",
  "score": 234,
  "selftext": "The three major U.S. averages on Wednesday ended solidly higher, after Federal Reserve chair Jerome Powell said an interest rate cut \"could be on the table as soon as September\" if data on inflation and the labor market continued to improve.\nPowell's remarks, along with a powerful rebound in chip stocks, helped the Nasdaq Composite (COMP:IND) and the benchmark S&P 500 (SP500) post their best intraday gain each since February 22.\n\n\nThe Nasdaq Composite climbed 2.64% to settle at 17,599.40 points, while the S&P 500 closed out the final day of the month with an advance of 1.58% to 5,522.30 points. The blue-chip Dow (DJI) added 0.24% to conclude at 40,843.06 points.\n\n\nU.S. Treasury yields moved lower after Powell's comments, as traders snapped up bonds. The longer-end 10-year yield (US10Y) fell to its lowest level since March, dropping 7 basis points to 4.032%.\n\nEarlier, the Federal Open Market Committee (FOMC) held the federal funds rate steady at 5.25%-5.50%, a largely given outcome.\n\n\nThe attention was on Powell's post-decision press conference, amid hopes that the central bank chief would talk about interest rate cuts in September. And Powell did not disappoint.\n\n\nHe signaled that policymakers could be considering an interest rate cut as soon as September if they continued to see inflation moving quickly or in line with their expectations, growth remaining reasonably strong and the labor market staying consistent with its current conditions.\n\n\nAccording to the CME FedWatch tool, the odds of a 50 basis point rate cut in September climbed after Powell's comments, underscoring the market's confidence that the monetary policy easing cycle was imminent. There is now a 90.5% chance of a 25 bp cut, a 9.5% chance of a 50 bp cut, and a 0.0% chance of a 0 bp cut.\n\nNvidia (NVDA) surged 17%, after Morgan Stanley re-added the chip giant to its top picks list following the stock's recent selloff. In addition, Microsoft and Meta reiterated and increased their capital expenditure investments, signaling further revenue upside for Nvidia. Advanced Micro Devices (AMD) climbed 4%, after the world's second-largest maker of personal computer processors issued current quarter revenue guidance that was above consensus estimates.\n\nMicrosoft (MSFT) slipped 1%, after the tech behemoth's cloud business missed on revenue and its quarterly capital expenditure swelled to $19B.\n\n\nTurning to Wednesday's economic calendar, ADP's jobs report before the opening bell showed private sector employment growing by 122K in July, significantly lower than the consensus figure of 154K. Shortly after, a key gauge of Q2 U.S. labor costs rose lesser than anticipated while also slowing down from the previous quarter.",
  "link_flair_text": "Broad market news",
  "id": "1eh18cy",
  "num_comments": 70,
  "created_utc": 1722466979,
  "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/",
  "comments": [
    {
      "id": "lfwyyfw",
      "score": 67,
      "body": "Strangest recession I've ever seen\n\n\n/s",
      "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwyyfw/",
      "created": 1722479041,
      "depth": 0,
      "replies": [
        {
          "id": "lfx8ajr",
          "score": -27,
          "body": "there is no recession\n\ngovernments are printing money at almost 2020 peak level because of economic worries / election all around the world\n\nI'm surprised governments are able to manipulate and suppress oil price for so long when economy is booming n printing shit load of money atm\n\nimo there is oil shortage but they r able to manipulate with paper supply (basically they short the shit out of it when price goes up and covers their short when price crash. so price is going side way with crazy price swing)",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfx8ajr/",
          "created": 1722483059,
          "depth": 1,
          "replies": [
            {
              "id": "lfx9enl",
              "score": 22,
              "body": "I find your belief system fascinating",
              "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfx9enl/",
              "created": 1722483573,
              "depth": 2,
              "replies": [
                {
                  "id": "lfxcsz8",
                  "score": -17,
                  "body": "it's not belief lol\n\nu can check financial condition index like nfci\n\nfinancial condition has been loosened to almost 2020 peak\n\nif the economy is really bad as stupid ppl say, then stock market wouldn't be rocketing like crazy every day\n\neconomy is doing ok, governments r spending shit ton of money, fed want to cut rate despite everything ok\n\nevery 1 want to print money like crazy cause 'election'\n\ngotta pump the stock, housing price up cause they want to win popularity contest\n\ncant have recession when every governments/fed is printing shit ton of money and injecting steroid to economy like crazies",
                  "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfxcsz8/",
                  "created": 1722485185,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lfxe30p",
              "score": 4,
              "body": "So the US controls OPEC and is printing money like it's out of style and keep oil price down while skyrocketing it's own debt interest payment?",
              "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfxe30p/",
              "created": 1722485822,
              "depth": 2,
              "replies": [
                {
                  "id": "lfxqo92",
                  "score": -5,
                  "body": "And destroying the buying power of everyone.\n\nBut its okay, cause a handful of people are making a killing off of everyone else suffering. \n\nLong as you keep those blinders on, you will remain guilt free!",
                  "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfxqo92/",
                  "created": 1722492934,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lg08j53",
              "score": 4,
              "body": "Or... Just maybe, the economy is a bit uneven right now and there are winners and losers in large part due to the supply chain disruptions and changes that occurred during the pandemic?\n\nThings that are finally starting to get ironed out?",
              "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lg08j53/",
              "created": 1722533152,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfzpyd6",
      "score": 28,
      "body": "This aged well",
      "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfzpyd6/",
      "created": 1722527314,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfwhf05",
      "score": 147,
      "body": "Title is misleading. Market was up bigly following yesterday’s earnings reports underscoring the AI growth story remains in tact.",
      "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwhf05/",
      "created": 1722472138,
      "depth": 0,
      "replies": [
        {
          "id": "lfwtscu",
          "score": 16,
          "body": "Was wondering why IWM underperformed compared to the market today. ",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwtscu/",
          "created": 1722476976,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfwq5hb",
          "score": 11,
          "body": "AI growth story for sure is still intact with Microsoft and meta continuing to spend ridiculous amounts but how much of this run up is buying into AI and how much is shorts closing out their positions? \n\nI’m not convinced we’re going back to ATHs but we shall see, at some key levels now on NQ so tomorrow should be pretty telling.",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwq5hb/",
          "created": 1722475527,
          "depth": 1,
          "replies": [
            {
              "id": "lfx1f8q",
              "score": 16,
              "body": "Microsoft and Meta are spending their profits on buying AI chips, but neither of them (nor anyone else) has actually demonstrated any way to earn profits with AI.    \n\nThey basically said “we made money elsewhere and used it to buy chips, hope this pays off at some point.”",
              "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfx1f8q/",
              "created": 1722480054,
              "depth": 2,
              "replies": [
                {
                  "id": "lfx7ys7",
                  "score": 12,
                  "body": "Microsoft can literally just lease their hardware on Azure to other businesses so their model makes a lot of sense. The main question is if they're investing too aggressively. If demand for AI chip rentals dies down they're going to be left helding the bag on lots of depreciating hardware.",
                  "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfx7ys7/",
                  "created": 1722482913,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfyw1on",
                      "score": 3,
                      "body": "They can yes, but at the end of the day Microsoft still needs other people to be able to make money off of AI, otherwise they won't pay Microsoft to use endless amounts of AI chips for their stuff.",
                      "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfyw1on/",
                      "created": 1722516995,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfzwlex",
                          "score": 1,
                          "body": "Bah, just bundle that shit in the next Azure subscription renewal. Now includes AI features, new price is X.\n\nNo business dependent on Azure services is going to dump it over that, especially if said business learns to use the AI features as a productivity booster where applicable.\n\nBut either way, if you're MSFT, make 'em pay.",
                          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfzwlex/",
                          "created": 1722529426,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lfypq0f",
                  "score": 3,
                  "body": "Not many places should expect to profit quickly with AI with the way it is now. However, it’s only going to get better as it gets used and trained more to make products viable\n\nIf MS and Meta simply waited to get in on AI when the real boom is ushered in, then they’d be years late to the party. They have to put in the money and work now to reap the rewards later.\n\nMS and other hyperscalers though have a great business model in that they use their data centers to run their own workloads and their customers workloads. It’s literally what their cloud business is\n\nThe next big issue that hasn’t received enough attention is that none of the cloud providers actually have enough capacity to fully meet customer demand for workloads, and that is speaking generally, not just on AI. Adding in AI, it makes it even worse. They’re all acquiring more land and data center real estate to expand their capabilities to host workloads",
                  "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfypq0f/",
                  "created": 1722514275,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lfx4agm",
                  "score": 8,
                  "body": "Meta’s business has been based on AI targeted ads for years.",
                  "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfx4agm/",
                  "created": 1722481270,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfx8jv8",
                      "score": 18,
                      "body": "Yeah but that has nothing to do with the LLM frenzy that is the primary focus of the current AI hype wave",
                      "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfx8jv8/",
                      "created": 1722483177,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfxvkm9",
                          "score": 0,
                          "body": "It’s AI I thouht",
                          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfxvkm9/",
                          "created": 1722496060,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lfyu11s",
                              "score": 3,
                              "body": "There’s more than 1 kind of AI. Recommended Systems is what makes Meta and Google money and it has been around for ages.",
                              "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfyu11s/",
                              "created": 1722516161,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lg2xx5h",
                                  "score": 1,
                                  "body": "I thought AI just meant artificial intelligence that can talk to you",
                                  "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lg2xx5h/",
                                  "created": 1722566786,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lfxk3yn",
                  "score": 0,
                  "body": "Are you living under a rock? Azure sells compute and AI inference with GPT models. \n\nCopilot integrates with pretty much every offering of Microsoft, it has a massive potential for productivity boost. Copilot pro is paid version of it. \n\nThey will start using LLMs in other AI based workflows, as an employee productivity tool etc.\n\nCompanies haven’t figured out how to make money from AI is a silly take. \n\nBesides, AI chips are CapEx, so their cost will be amortized throughout the lifetime of the chip. ",
                  "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfxk3yn/",
                  "created": 1722489017,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfwqd9y",
          "score": 2,
          "body": "There’s also the rumor today that they’re finalizing restrictions on equipment and chips to China which would go into effect next month.",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwqd9y/",
          "created": 1722475613,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfy97xn",
          "score": 0,
          "body": "Bigly is my favorite neologism",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfy97xn/",
          "created": 1722505372,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfwujy5",
      "score": 47,
      "body": "I don’t understand, Powell never said there is a possible rate cut in september. What he actually said was that they will be assessing the data and focusing on employment data rather than inflation data to make their future decision.",
      "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwujy5/",
      "created": 1722477277,
      "depth": 0,
      "replies": [
        {
          "id": "lfx0hhn",
          "score": 16,
          "body": "He said it could be on the table as soon as September",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfx0hhn/",
          "created": 1722479666,
          "depth": 1,
          "replies": [
            {
              "id": "lfyr2sw",
              "score": -1,
              "body": "No, what he actually said was there was no rate cut in september on the table and there is no specific timeline they are following. He stated this several times to reporters who kept asking him when the next cut would happen.",
              "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfyr2sw/",
              "created": 1722514877,
              "depth": 2,
              "replies": [
                {
                  "id": "lnuac2r",
                  "score": 0,
                  "body": ".50 rate cut today. Which he did signal at the Jackson Hole meeting.",
                  "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lnuac2r/",
                  "created": 1726714708,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lnvj5x8",
                      "score": 0,
                      "body": "no he said it was going to be data dependent, and that’s exactly what it was",
                      "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lnvj5x8/",
                      "created": 1726741771,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lnvkpwv",
                          "score": 0,
                          "body": "And you said no .50 cut in September?",
                          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lnvkpwv/",
                          "created": 1726742681,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lnvojf7",
                              "score": 0,
                              "body": "I said he didn’t say there would be a september rate cut in the meeting and he didn’t. he said the next decision would be data dependent which it was.",
                              "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lnvojf7/",
                              "created": 1726744718,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lfwykqp",
          "score": 7,
          "body": "They're never going to cut. Maybe 2027.",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwykqp/",
          "created": 1722478885,
          "depth": 1,
          "replies": [
            {
              "id": "lfxbehc",
              "score": 7,
              "body": "Ridiculous",
              "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfxbehc/",
              "created": 1722484506,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfwyp52",
              "score": 7,
              "body": "I am not saying they will cut or not, but the tone of today’s meeting was definitely hawkish in my opinion… maybe I am missing something?",
              "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwyp52/",
              "created": 1722478934,
              "depth": 2,
              "replies": [
                {
                  "id": "lfyhgmz",
                  "score": 2,
                  "body": "The statement was maybe lean hawkish, but in reality, the presser really wasn’t at least from my takeaways without me listening.\n\nHe was given every opportunity to shut down what’s being priced in Fed funds futures (maybe it got priced out slightly, but it’s still probably over 90%), and he really didn’t. If there weren’t some serious thoughts (and in all honesty, if September wasn’t going to be a live meeting for a rate decision), then he could’ve just shut it down like he did in January.",
                  "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfyhgmz/",
                  "created": 1722510178,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lfwfzim",
      "score": 42,
      "body": "At this rate we will at SPY 650 by years end, and then back down to 420ish🤞🤞 before rebounding to ath by the end of 2025. Spy 800 by 2027",
      "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwfzim/",
      "created": 1722471599,
      "depth": 0,
      "replies": [
        {
          "id": "lfwrpi4",
          "score": 25,
          "body": "Tom Lee, is that you?",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwrpi4/",
          "created": 1722476147,
          "depth": 1,
          "replies": [
            {
              "id": "lfxaiv9",
              "score": 3,
              "body": "Was i deceived by tom lee? I listened to him and yolo in IWM. What happened ytd, did he take profits?",
              "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfxaiv9/",
              "created": 1722484092,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfxk7l9",
          "score": 1,
          "body": "SPY WILL BE $2025 by 2025",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfxk7l9/",
          "created": 1722489075,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfxg309",
      "score": 7,
      "body": "I don't get it, if FOMC cuts, they suspect the economy is slowing down and must get ahead of it. Shouldn't reducing rates signal an immediate downturn in markets?",
      "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfxg309/",
      "created": 1722486841,
      "depth": 0,
      "replies": [
        {
          "id": "lfxj52m",
          "score": 5,
          "body": "When rates get cut, money comes out of bonds and HYSA and into equities.",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfxj52m/",
          "created": 1722488470,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lg7o0tb",
          "score": 1,
          "body": "Historically the first cut has been a good time to sell.",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lg7o0tb/",
          "created": 1722637302,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfxduig",
      "score": 4,
      "body": "So if inflation stays at 3% will they raise rates?",
      "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfxduig/",
      "created": 1722485705,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfwtsrb",
      "score": 3,
      "body": "Looks like short get squeezed and they close their position like no tomorrow.",
      "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwtsrb/",
      "created": 1722476981,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfwc9v1",
      "score": 9,
      "body": "Mark my words. There will be no rate cut in September.",
      "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwc9v1/",
      "created": 1722470208,
      "depth": 0,
      "replies": [
        {
          "id": "lfwdeo1",
          "score": 14,
          "body": "!RemindMe 2 months",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwdeo1/",
          "created": 1722470630,
          "depth": 1,
          "replies": [
            {
              "id": "lfwdjaf",
              "score": 4,
              "body": "I will be messaging you in 2 months on [**2024-10-01 00:03:50 UTC**](http://www.wolframalpha.com/input/?i=2024-10-01%2000:03:50%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwdeo1/?context=3)\n\n[**12 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1eh18cy%2Fnasdaq_sp_500_post_best_day_since_feb_after%2Flfwdeo1%2F%5D%0A%0ARemindMe%21%202024-10-01%2000%3A03%3A50%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201eh18cy)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
              "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwdjaf/",
              "created": 1722470679,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfwcwbg",
          "score": 15,
          "body": "Why?",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwcwbg/",
          "created": 1722470440,
          "depth": 1,
          "replies": [
            {
              "id": "lfwhaxf",
              "score": 78,
              "body": "Because he said mark his words",
              "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwhaxf/",
              "created": 1722472095,
              "depth": 2,
              "replies": [
                {
                  "id": "lfxk964",
                  "score": 4,
                  "body": "Oh hi Mark",
                  "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfxk964/",
                  "created": 1722489100,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lfwi0d4",
              "score": 17,
              "body": "Economy too strong, it’s a bull on roids",
              "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwi0d4/",
              "created": 1722472364,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfwmybo",
              "score": 4,
              "body": "Rate cuts will probably happen post election.",
              "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwmybo/",
              "created": 1722474269,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfwk11h",
          "score": 7,
          "body": "Gonna be a bad take unless geopolitics turns oil into an absolute rocket. \n\nPowell basically said that September is going to be a live meeting for beginning the easing cycle unless the data turns around from the way it's been going.",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwk11h/",
          "created": 1722473133,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfxwqer",
          "score": 2,
          "body": "Unemployment going up to 4.2 next reading, a cut in September will follow",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfxwqer/",
          "created": 1722496832,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnua5ge",
          "score": 2,
          "body": ".50 rate cut, today. Your welcome 👀",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lnua5ge/",
          "created": 1726714628,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfwjed3",
          "score": 1,
          "body": "!remindme 2 months",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwjed3/",
          "created": 1722472894,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpqj7j5",
          "score": 1,
          "body": "Welll well well.",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lpqj7j5/",
          "created": 1727741994,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpqn6bd",
          "score": 1,
          "body": "Marked words. Wrong",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lpqn6bd/",
          "created": 1727743465,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpqovd6",
          "score": 1,
          "body": "Oh hi. .50 cut",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lpqovd6/",
          "created": 1727744089,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpqqwb3",
          "score": 1,
          "body": "Hell yeah dude",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lpqqwb3/",
          "created": 1727744834,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpqxs3s",
          "score": 1,
          "body": "Wrong!",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lpqxs3s/",
          "created": 1727747405,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpqy58l",
          "score": 1,
          "body": "Welp, sometimes you're right, and sometimes you're SpongEWorTHiebOb.",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lpqy58l/",
          "created": 1727747542,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfwln1c",
          "score": -7,
          "body": "Nah. The market is completely bullying Powell into it. He’s weak.",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwln1c/",
          "created": 1722473757,
          "depth": 1,
          "replies": [
            {
              "id": "lfwype8",
              "score": 2,
              "body": "If he had sense he would \"shut the fucking door.\"",
              "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwype8/",
              "created": 1722478937,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfwu8be",
          "score": 0,
          "body": "Remindme! 1 month and 18 days",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwu8be/",
          "created": 1722477151,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lpr6psa",
          "score": 0,
          "body": "As always inverse guys",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lpr6psa/",
          "created": 1727750747,
          "depth": 1,
          "replies": [
            {
              "id": "lptzb3d",
              "score": 1,
              "body": "Does that mean I inverse your inverse? How do I do that for the Fed funds rate? I short a money market fund?",
              "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lptzb3d/",
              "created": 1727799579,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfwlx0p",
          "score": -6,
          "body": "On the contrary, Powell will definitely cut in Sep before elections to make it seem like he’s not politically influenced unlike if he were to cut in Nov",
          "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwlx0p/",
          "created": 1722473864,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfwg8cz",
      "score": 1,
      "body": "How's forecast looking? I was surprised how much it went up today",
      "permalink": "/r/stocks/comments/1eh18cy/nasdaq_sp_500_post_best_day_since_feb_after/lfwg8cz/",
      "created": 1722471693,
      "depth": 0,
      "replies": []
    }
  ]
}