{
  "title": "CNBC: Meta’s advertising growth is proof that hefty AI spending is already paying off",
  "score": 270,
  "selftext": "This is a pretty long article, but I think it is an important read since it answers the key question \"Is anyone making significant money from AI right now?\" Clearly the answer is yes for Meta. \n\nFor easier reading I tried to bold the parts the discuss AI specifically.\n\nSource: [CNBC](https://www.cnbc.com/2024/07/31/meta-advertising-growth-proof-that-hefty-ai-spending-is-paying-off.html)\n\nFor investors who are skeptical of Meta’s massive spending on artificial intelligence and whether it will pay off anytime soon, CEO Mark Zuckerberg is urging them to look to the present.\n\nAfter the company’s better-than-expected second-quarter earnings report on Wednesday, Zuckerberg and finance chief Susan Li rattled off all the ways that AI has helped the company grow faster than the competition in the digital advertising market, Meta’s core business.\n\n“The ways that it’s **improving recommendations and helping people find better content**, as well as making the advertising experiences more effective, I think **there’s a lot of upside there**,” Zuckerberg said on the earnings call. “Those are already **products that are at scale**. The AI work that we’re doing is going to improve that.”\n\nMeta reported revenue growth of **22% from a year earlier to $39.07 billion**, with 98% of its sales coming from advertising, primarily on Facebook and Instagram. Its growth rate was double that of Google’s ad business, which saw sales increase 11% to $64.6 billion, Alphabet\n said in its earnings report last week.\n\nMeanwhile, Pinterest and Spotify, which are both significantly smaller than Meta, reported revenue growth of 21% and 20%, respectively, in their latest reports.\n\nAs in previous quarters, Li said Meta’s advertising business benefited from online commerce, gaming and the media and entertainment sectors, and that ad growth continued to be strongest in the Asia-Pacific region. She said the company’s “improved ad performance” helped lift overall ad prices despite slowing growth in that region.\n\nZuckerberg pointed to **AI as the foundation behind Meta’s refreshed online advertising platform**, which was battered after Apple introduced an iOS privacy update in 2021 that made it harder for social media companies to target users across the Internet.\n\n“They rebuilt their ad tech stack using AI and they changed their user interface and **generated a lot more user engagement because of AI**,” said Mark Mahaney, internet analyst at Evercore ISI, in an interview on CNBC’s “Closing Bell: Overtime” on Wednesday. “It’s **showing up in the revenue and the profits now**,” said Mahaney, who recommends buying Meta shares.\n\nMeta shares popped 7% in extended trading after Wednesday’s earnings report, which included an uplifting forecast for the current quarter.\n\nLike the other mega-cap tech companies, Meta is **spending billions of dollars** on Nvidia’s graphics processing units (GPUs), which are needed to train AI models and run hefty workloads. Some industry experts have questioned the outlays because so much of the investment is tied to expectations that generative AI — popularized by OpenAI’s ChatGPT — will lead to big revenue gains in the future.\n\n‘Already seen a return’ Meta is showing that, while the bet is on major growth down the road, the company is **reaping rewards today**.\n\n“You’ve already seen a return with Meta over the last two years,” Mahaney said.\n\nAngelo Zino, an analyst at CFRA Research, agreed with Mahaney, telling CNBC that Meta has “really navigated some of the concerns and the storms” from a couple years ago and is “**clearly integrating AI across their ecosystem extremely nicely**.”\n\nZino noted that Meta’s growth rates are “**nicely outpacing those of its peers**.”\n\n**Meta isn’t finished spending big money on AI** and the far-flung metaverse, which continues to lose billions of dollars each quarter. Li said that Meta expects “**significant CapEx growth in 2025 as we invest to support our AI research** and our product development efforts.”\n\nFor 2024, Meta said it now expects capital expenditures in the range of **$37 billion to $40 billion, lifting the low end of that range, which had been $35 billion**.\n\nLi says investors should think of Meta’s AI strategy as a two-pronged approach, with “core AI” helping Meta improve its advertising platform and recommendation system, thus leading to more user engagement and ad performance that “have translated into revenue gains.”\n\nGenerative AI is a longer-term bet. Li said that the company doesn’t “expect our Gen AI products to be a meaningful driver of revenue in ’24, but we do expect that they’re going to **open up new revenue opportunities over time** that will enable us to generate a solid return off of our investment.”",
  "link_flair_text": null,
  "id": "1eh89pb",
  "num_comments": 100,
  "created_utc": 1722487975,
  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/",
  "comments": [
    {
      "id": "lfxl7kz",
      "score": 153,
      "body": "The usual suspects are already making money.  While everyone else is pretending that they use AI",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxl7kz/",
      "created": 1722489650,
      "depth": 0,
      "replies": [
        {
          "id": "lfyavpq",
          "score": 23,
          "body": "While I don't think Zuck is outright lying, because AI long driven more effective digital ads, the eye-opener for me this quarter was seeing Google, then Microsoft, then Meta reported very substantial increases in capital expenditures. As a disclaimer, I own NVDA and TSM (substantial positions and recently added more on the pullback), and will ride out any swings between now and late August when NVDA reports, which better be a really great report or it will tank, but it probably will be great or everyone will be scrambling to find out where the spend went. \n\nRight now, investors are obviously getting skeptical about AI cap ex, which will eventually result in lower mag 7 cap ex, which will be really bad for semis, but that's a second derivative effect and the arms race definitely isn't ending right now. I'll seriously shave my top-tier semi positions when these cap ex numbers start dropping in a meaningful way or when LLM training/inference ASICs start eating NVDA's lunch. As far as I know, AVGO (just added to a meaningful buy-and-hold position) and TSM are the way for a non-accredited investor to play the eventual ASICs wave, but NVDA could also come out with their own ASICs.  \n\nBut right now, the megacap CEOs are really excited about AI and they have the money to spend on it. They still have good cash flow and can still spend big if they want to. I think LLMs and other applications of transformers will continue to get better, they'll be faster, smaller models will be better, and context windows will be larger before the LLMs start spitting out hallucinations and functionally break. With the right training techniques, which are still evolving, the transformer that LLMs is based on can remarkably improve on really overdetermined data, which breaks what I used to know about signals analysis and training old-school neural networks.\n\nI think we are going through a routine low-volume summer pullback with hedge funds piling into the previously lagging R2K, which makes momentum plays swing like crazy. But, hedge funds will be back, and they'll long the same positions they shorted months earlier, and then they'll short them again. It's fine for investors to hold the feet of megacaps to the fire, but that just brings their PE multiples closer to normal (for a tech stock). \n\nOther position disclaimers:\n* Google (small LT buy-and-hold position, they are behind and will probably lose search market share but I won't bet against their data and proprietary tensor core iterations)\n\n*Microsoft (small long-held position)\n\n*Meta (no position due to longstanding antipathy plus I think they are behind with AI and the metaverse and they have more limited room to grow because 3.5 billion users is a lot, even if many of those are bots. I think they will outperform but won't be in the driver's seat. I still don't see how Zuck is going to monetize their open-source LLM models while Microsoft at least has a plan that may kick in when co-pilot improves and co-pilot subscriber numbers improve. I may be in the minority, but I think this will happen eventually, can't say when. I'm personally scared of AI Windows, but I think Microsoft will try to copy whatever Apple does, with more ads and less privacy, and make money.",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfyavpq/",
          "created": 1722506458,
          "depth": 1,
          "replies": [
            {
              "id": "lfyh8v8",
              "score": 55,
              "body": "Damn you wrote a lot just to say CEOs are still spending on AI infrastructure and if they pull out anything AI is going to be screwed.",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfyh8v8/",
              "created": 1722510057,
              "depth": 2,
              "replies": [
                {
                  "id": "lg0nl2s",
                  "score": 5,
                  "body": "Yeah, that's a good summary. But I would say **when** megacaps pull out AI is going to be screwed. I'm arguing that I don't see evidence that they are pulling out now, but I'll watch their earnings reports like a hawk every single quarter.",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg0nl2s/",
                  "created": 1722537813,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lg1t95l",
                      "score": 1,
                      "body": "Yup.  So far so good on infrastructure spending",
                      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg1t95l/",
                      "created": 1722551197,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lg2i6px",
                      "score": 1,
                      "body": "Eventually, it’s the consumers who pull the trigger, AI spending is welcome as long as the core business is doing well. Reminds me of meta verse became a problem only when the core ad revenue was slowing.",
                      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg2i6px/",
                      "created": 1722560453,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lg1t3ya",
                  "score": 2,
                  "body": "Whoever pulls out will embolden those who do not.  They can’t afford to pull out.  Something my girlfriend would love to hear.",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg1t3ya/",
                  "created": 1722551144,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lfyyorw",
              "score": 7,
              "body": "> and will ride out any swings between now and late August when NVDA reports, which better be a really great report or it will tank\n\nDon't expect the same growth numbers in Aug.  The huge YoY growth reported each quarter for the last 12 months was **amplified** significantly by a year-long trough in revenue mid 2022 through mid 2023\n\nSee the trough for 4 straight quarters here:  https://www.statista.com/statistics/1424787/nvidia-market-revenue-by-quarter/)\n\nIf revenue had been steady, the YoY growth would not have been so stratospheric, and there would be less fervor around the stock.  Expect a *positive* but more muted response to the Aug numbers.\n\nNVDA is def. coming off the hype cycle, and is now in the place where the financial rubber meets the road.  The stock will do well if the numbers are good, with less AI-induced forward P/E shenanigans.\n\nTL;DR:  NVDA's been reporting against shit previous-year numbers for 12 months.  That ride is over.",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfyyorw/",
              "created": 1722518041,
              "depth": 2,
              "replies": [
                {
                  "id": "lg0mmgo",
                  "score": 3,
                  "body": "You're right that YoY growth is a really bad metric to value a high PE stock, as is comparing this quarter this year, vs the same quarter last year. For me to buy a stock with a high PE, it better have higher revenues and higher earnings every quarter and those numbers better have a strong correlation to each other and to EPS (those boxes are checked). I like to look at quarterly revenue and [EBDITA](https://www.macrotrends.net/stocks/charts/NVDA/nvidia/ebitda). I have plugged in the numbers, and I would argue that these numbers are both statistically linear. The revenue numbers do a fit a parabolic fit better than a linear fit, hinting at slowing revenue growth. But, the parabolic fit will always be better than the linear fit, whether or not it has meaning, and quarterly earnings reports make for very sparse data. I'm expecting roughly linear but moderating revenue and EPS growth and will unload if there is a big surprise to the downside. With linear EPS growth for the next year out, earnings for the next year would be 2-3 times higher, making the forward PE, which ignores analyst estimates, very reasonable. Growth will probably moderate because of supply chain constraints and moderation in demand. But, Nvidia doesn't need a PE close between 20 and 30 a year out at these prices because high-growth market leaders always command a PE premium. \n\nBut, it's very plausible that revenue growth is slowing because TSM's production capacity is a bottleneck and it takes a long time to build new fabs, which TSM is doing. However, Nvidia has historically kept its margins very high when there is strong demand. I think the pertinent historical examples are the last bitcoin bubble pre-ASICs and Cisco around its nose-bleed peak with a PE over 200. During the crypt0 bubble Nvidia absolutely crushed it while reddit gamers had daily tantrums about Nvidia charging unfair prices for their GPUs. That lasted until ASICs made it unprofitable to mine with an all-purpose GPU, crypt0 started crashing and Nvidia crashed. I'm watching Mag 7 cap ex because Cisco collapsed roughly the month after its biggest customers (like Worldcom, AT&T, AOL, Qwest, and Sprint) started dramatically cutting their cap ex. The now bankrupt Worldcom was an outright criminal fraud that was buying Cisco routers to pretend that they were making money to pump their share prices. So I'm worried about demand, I'm worried about ASICs, respectively thinking about Cisco and the last crypt0 bubble. The main reason I bought more AVGO because its price is down and because OpenAI is building a new secret chip with Broadcom, which is almost certainly a new ASIC chip that will rely on Broadcom and TSM. Also, broadcom should benefit from its auto and manufacturing chips and cell phone sales will probably pick up if rates go down and it's a given that they will go down.\n\nBut, major risks are that the economy is definitely slowing by almost any metric and the Fed is always late with their rate moves, with their backward-looking data analysis, and what's bad for the economy is bad for everyone. Also, from now to October is historically a very bad time for semis and Wall Street knows it. Also, we know that if investors revolt on spend, CEOs like Zuck will dramatically cut back on cap ex, like he did after the Metaverse crash. I think if one megacap CEO cuts back on GPU spend, they all will, as I feel they are defensively spending to not get left behind, so the script can flip and growth can turn into misses in a hurry. Finally, I feel that most semi and software stocks are overvalued and catching AI tailwinds for no reason and this will hurt the few stocks with good performance, because hedge algos will work to keep correlated pairs of stocks correlated. The conflict between Iran and Israel could blow up in the near future. Also, the performance of bigger and bigger transformers could hit a wall, but I don't think there's evidence of that yet. I don't think humans are special and that there are intrinsic limits about what humans can do and future AI can't. However, better GPUs will someday be locked down even in the U.S., as a national security issue. \n\nBut, I have a long-term horizon, and the megacaps that are pumping money into NVDA haven't cut back on cap ex yet. Nadela says there is still increasing cloud demand and the probability that he is telling truth is greater than the probability that he is lying. I can afford to be wrong about the future and I'll still pay a lot of taxes when I exit.",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg0mmgo/",
                  "created": 1722537513,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lg1tzyt",
                  "score": 1,
                  "body": "Imagine a slump in a 5 year growth cycle is still growth",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg1tzyt/",
                  "created": 1722551464,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lfzaqfl",
                  "score": 1,
                  "body": "Investors aren't bots, they don't just purely looking at Y/Y growth to figure out valuation",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfzaqfl/",
                  "created": 1722522389,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfzbb4n",
                      "score": 0,
                      "body": "You'd be surprised how many people buy on numbers with no knowledge of the market or the industry segment where they put their money.  YoY is a KPI that gets a *lot* of airtime, and it absolutely drives sentiment, whether deserved or not.",
                      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfzbb4n/",
                      "created": 1722522582,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lfzefit",
                          "score": 1,
                          "body": "Retail investors don’t create momentum, they are just along for the ride",
                          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfzefit/",
                          "created": 1722523615,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lfzs0gn",
                  "score": 1,
                  "body": "[Here's a link not behind a paywall.](https://www.statista.com/statistics/1424787/nvidia-market-revenue-by-quarter/)\n\nLet me get this straight; after linear revenue increases from Q1 FY 2021 ($3.08B) to Q1 FY 2023 ($8.29B), followed by two quarter of revenue decline to $5.93B in Q3 FY 2023 before returning to linear revenue increase uninterrupted until the present (Q1 FY 2025 - $26.04B) and achieving unprecedented net margin of 57% NVDA is supposed to pull back because it's in a \"cycle\"? \n\nIf revenue hadn't lagged 2022-2023 the stock wouldn't have declined, so growth would have been more steady and thus less profound this past year certainly (obviously), but the valuation wouldn't be less stratospheric at these revenue and margin numbers.\n\nYou are really grasping at straws. There's no pattern here to draw any conclusions and nothing you've said indicates anything about what Aug numbers will look like. The ebbs and flows of how it got from ~8$B to ~$26B explain the movement of the stock during that time period, but say little of the future; as opposed to revenue at companies like TSM, META, and AMD. At best you can hope to be as oracular as a broken clock.",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfzs0gn/",
                  "created": 1722527969,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lg1u95v",
                      "score": 2,
                      "body": "NVDA is aware of their position and is already pivoting to health sector and robotics.  Jensen is obsessed with growth.  I think we will be all good.  I cannot find any bad info on their direction besides speculation.",
                      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg1u95v/",
                      "created": 1722551557,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lg1sycd",
              "score": 1,
              "body": "Shooting from the hip, where do you see NVDA peaking, with the intent on pulling out to reap those gains and where do you see it bottoming once again?  Seems like the new cycle to mind.",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg1sycd/",
              "created": 1722551089,
              "depth": 2,
              "replies": [
                {
                  "id": "lg1yv63",
                  "score": 4,
                  "body": "A whole lot of scenarios could tank NVDA for a long time. There is a good chance that China will flirt with blockading Taiwan after a manufactured controversy regarding some politicians statement in the 2-5 years from now. I think Xi Xinping wants an invasion of Taiwan to be his legacy, but I hope his peers will talk him out of tanking China's economy even more. If Blackwell has persistent water-cooling leak issues, that could be a problem for many years. Blackwell yields could be much lower than expected, since joining chips is a new technology. A president could ban GPUs that are more powerful than a threshold out of fear of AI. Policy could be changed to tax cloud providers unless they use green energy, which I would support. Companies could hit the energy bottleneck, so I bought Dominion energy (since the largest server farm concetration is in Northern Virginia) and NEE to get a little bit of a dividend barbel. The Supreme Court could rule that LLMs are liable for copyright infringement and that all the AI companies owe tons of money to everyone else. At some point, the first globally damaging AI virus will hit and new laws will be passed.\n\nI think calling peaks and bottoms is a losing game and trying to predict a peak years out is even more of a losing game. But, if I had to guess, I think the peak will come when we see dot-com/last crypt0 bubble levels of hype in a lower interest rate environment. You'll see a ton of startup IPOs/SPACs with no earnings or plans for earnings that investors will lose a lot of money on. You will see ads pumping and shilling two-bit money-losing AI companies on TV while insiders sell the dominant portions of their stakes.  NVDA's PE might go substantially north of 100, then LLM ASICs could be produced at scale. Then, my friends and relatives that ignored my advice to buy years ago will ask if now is a good time to make a big investment, and I'll know it's over and it's time to research boring stocks with stable dividends. A massive crash will happen, which will go way too far on the downside. Just randomly guessing, this is not a prediction, July 30th 2026 could be a peak, plus or minus a year. But, AI is here to stay until the next EMP and it will continue to improve. Modern transformers were created in June of 2017, GPT3 came out in November of 2022, commensurate with the start of NVDA's rally, things are still getting better. Cloud is still growing at all of the major providers. The AI spend is on GPUs and it can take 5-10 to get a return out of a GPU or cluster, so it isn't reasonable to expect returns on cloud compute to equal the expense right now. It'll be fun until it gets scary!",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg1yv63/",
                  "created": 1722553231,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lg21nlw",
                      "score": 1,
                      "body": "That’s a lot of new info I haven’t come across.  A lot to digest.  Thank you.",
                      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg21nlw/",
                      "created": 1722554258,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lg2y81r",
                      "score": 1,
                      "body": "> I think Xi Xinping wants an invasion of Taiwan to be his legacy\n\nThis is frankly my biggest worry. If AI is truly such a game changer, then how long can China accept being second class in the AI race? How far behind will China fall if they are denied critical chips/gpus from Nvidia, AMD, TSM?",
                      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg2y81r/",
                      "created": 1722566914,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lg0arne",
          "score": 2,
          "body": "Need ai bit to dislike all ads in fb. Since none available I do it myself every week to see some of my friends posts. Fb is going the local news paper route",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg0arne/",
          "created": 1722533851,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfxmp1y",
      "score": 159,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxmp1y/",
      "created": 1722490521,
      "depth": 0,
      "replies": [
        {
          "id": "lfxy83r",
          "score": 46,
          "body": "This is exactly what most AI boosters do. They hype up every machine learning algorithm or anything to do with complex statistics and lump it in with \"AI\". Since most of the public has no knowledge of statistics or math (and most VC investors aren't much better), the hype sells.",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxy83r/",
          "created": 1722497842,
          "depth": 1,
          "replies": [
            {
              "id": "lfztw01",
              "score": 2,
              "body": "This is what everyone in marketing has done for the entirety of their careers.\n\nWere you unaware that Coca-Cola existed before you saw the Coca-Cola commercial? Did you buy Coca-Cola specifically because of the commercial, or because you've just always preferred Coca-Cola over Pepsi?\n\nMarketing guys know how to lie to justify their paychecks by lumping completely unrelated numbers together and it seems like the AI guys are doing the same, lol.",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfztw01/",
              "created": 1722528566,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfy3hb4",
              "score": -5,
              "body": "> This is exactly what most AI boosters do. They hype up every machine learning algorithm or anything to do with complex statistics and lump it in with \"AI\".\n\nIs machine learning algorithm not AI?\n\n>ML is an application of AI that allows machines to extract knowledge from data and learn from it autonomously. (Source: [Google Cloud](https://cloud.google.com/learn/artificial-intelligence-vs-machine-learning))",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfy3hb4/",
              "created": 1722501429,
              "depth": 2,
              "replies": [
                {
                  "id": "lfyo875",
                  "score": 14,
                  "body": "Machine learning has been around for a long while, long before LLM. This isn't new.",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfyo875/",
                  "created": 1722513587,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lfyqclo",
                  "score": 19,
                  "body": "Well technically **adjusts glasses** none of it is AI. His point is that companies are taking what theyve had for over decade and trying to trot it out like it’s something new because investors are crazy over the latest buzzword, AI.",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfyqclo/",
                  "created": 1722514554,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lfzeo8l",
                      "score": -3,
                      "body": "It is AI, you are objectively wrong.",
                      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfzeo8l/",
                      "created": 1722523693,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lg09jwf",
                          "score": 5,
                          "body": "Oh so you're in the know? Can you share details on how it is AI,. instead of good old machine learning? Is the LLM suggesting content to people? Is the LLM selecting the ads to show in the feed? Is the LLM aggregating data about users and helping marketers create the ads? I'm curious",
                          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg09jwf/",
                          "created": 1722533469,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lg7p3fq",
                              "score": 1,
                              "body": "Why are you suddenly talking about LLMs? You got confused?",
                              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg7p3fq/",
                              "created": 1722637697,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lgay6z0",
                                  "score": 1,
                                  "body": "Because that's the AI that Meta (and all others) are selling as AI. But, ok, let's say its not an LLM. What then? What other \"AI\" system are they using that it's not the same they have been using all these years, like Netflix and other content platforms have been using since before the current hype?",
                                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lgay6z0/",
                                  "created": 1722695448,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lgbqtns",
                                      "score": 1,
                                      "body": "The models they are using are several orders of magnitude bigger and more sophisticated, as computer hardware has improved a lot over the years and they have invested a ton into their servers. But fundamentally it is not much different as it has been back a few years ago, and I never claimed it was. It was AI a decade ago too, only you said it wasn't.",
                                      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lgbqtns/",
                                      "created": 1722705302,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lghzb4j",
                                          "score": 1,
                                          "body": "It wasn't. It was \"big data\" then it was \"machine learning\" now it's AI. Different names for what's mostly the same thing",
                                          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lghzb4j/",
                                          "created": 1722800709,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lfyo2mq",
                  "score": 2,
                  "body": "all ML is AI but not all AI is ML",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfyo2mq/",
                  "created": 1722513515,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lfyppk3",
                  "score": 1,
                  "body": "AI AI AI AI AI",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfyppk3/",
                  "created": 1722514269,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfxwz3u",
          "score": 26,
          "body": "Bingo, I’m glad there was someone who caught this. Tricky bit of “journalism” that preys on the uninformed.",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxwz3u/",
          "created": 1722496992,
          "depth": 1,
          "replies": [
            {
              "id": "lfy5n7b",
              "score": 19,
              "body": "The sad truth is that everyone's caught up in this hype. For the layman, AI equates to anything smart, anything LLM/chatbot. My recommendations/search results are off, uff the AI is acting sassy today. \n\nAI/ML have been around for ages. Almost no one is making any money at all on genAI. It's nifty, but it hasn't found a revenue generating use case yet. I think zucks just spinning up years of infra and science investments in ads as an AI success story to generate hype one massive Gen AI/LLM bets.",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfy5n7b/",
              "created": 1722502916,
              "depth": 2,
              "replies": [
                {
                  "id": "lfyz0bz",
                  "score": 4,
                  "body": "I've been saying the same thing for a while now. Mag7 spending billions on infrastructure for AI, but where's the revenue recapture going to come from? \n\nIt's the ultimate hype machine.",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfyz0bz/",
                  "created": 1722518166,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lg1vcj4",
                      "score": 1,
                      "body": "Read meta earnings report",
                      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg1vcj4/",
                      "created": 1722551953,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lg1wphg",
                          "score": 1,
                          "body": "You really believe that AI massively increased the efficacy of their ads? \n\nI call BS.",
                          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg1wphg/",
                          "created": 1722552448,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lg1wwn2",
                              "score": 1,
                              "body": "That’s what they said.  Is this a conspiracy to you?",
                              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg1wwn2/",
                              "created": 1722552519,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lg1xwkz",
                                  "score": 1,
                                  "body": "Not a conspiracy, I just don’t attribute effective ads to billions in AI spending.",
                                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg1xwkz/",
                                  "created": 1722552881,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lg21vdl",
                                      "score": 2,
                                      "body": "There’s no doubt it’s not bringing in immediate revenue.  What’s your take on this infrastructure bringing in future revenue, as these companies project?",
                                      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg21vdl/",
                                      "created": 1722554338,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lg28orq",
                                          "score": 1,
                                          "body": "I’ve got close connections with higher ups at Microsoft and Google and they don’t believe the AI will materially alter their trajectory since they cannot figure out how to meaningfully monetize it.",
                                          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg28orq/",
                                          "created": 1722556880,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lg1v68p",
                  "score": 0,
                  "body": "Even so, I would rather pay $20 a month to ChatGPT then free google searches",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg1v68p/",
                  "created": 1722551889,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfy34iw",
          "score": 6,
          "body": "> LLM is not doing shit for anyone\n\nLLM can be used to [detect shifts in user intent](https://www.wpp.com/wpp-iq/2023/11/leveraging-large-language-models-in-advertising) based on inputs users put into the system:\n\n>At Mindshare WW, we have been collaborating with GroupM and Google to introduce what we call ‘Dynamic Intent Insertion’: leveraging Google’s cutting-edge LLM, Bard, to create a system of intent-based language models. With the advanced natural language understanding capabilities of Bard, this system would offer a new layer of contextualisation based on past user behaviour and demographic information. Imagine a CTA that adapts in real time to subtle shifts in consumer intent. Such a feature would make the CTAs not just more effective but exceptionally resonant with what the consumer is truly seeking.",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfy34iw/",
          "created": 1722501185,
          "depth": 1,
          "replies": [
            {
              "id": "lfz9yed",
              "score": 8,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfz9yed/",
              "created": 1722522126,
              "depth": 2,
              "replies": [
                {
                  "id": "lfzai5x",
                  "score": 2,
                  "body": "So.... you think FB is using the same old models to beat the iOS problem?",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfzai5x/",
                  "created": 1722522313,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lfyucpy",
              "score": 8,
              "body": "sentiment analysis via machine learning has been around since long before these models.\n\nread a book.",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfyucpy/",
              "created": 1722516299,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfz8gvg",
              "score": 1,
              "body": "Bard? 🤔",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfz8gvg/",
              "created": 1722521617,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lg0adgn",
          "score": 1,
          "body": "Zuck is purposefully spinning it this way. \n\nDon’t look at all the money we’re spending over in X because of how well Y is doing. \n\nIt would be nice if financial journalism would call this out though.",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg0adgn/",
          "created": 1722533726,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfxlly7",
      "score": 50,
      "body": "I’m skeptical AI has resulted in leaps and gains for their recommendation system in curating ads - \n\nIt’s a lot of backend infra work, and while they may have improvements, skeptical it’ll justify the massive cost associated with AI. They probably learned from googles earning call that they need to a positive spin on the ROI of this massive ai spend.",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxlly7/",
      "created": 1722489882,
      "depth": 0,
      "replies": [
        {
          "id": "lfxrx6m",
          "score": 6,
          "body": "One thing to keep in mind is that Meta is not only trying to make more money right now -- but also it is trying to [choke out competitors like Twitter and Tiktok](https://www.engadget.com/facebook-is-using-ai-to-supercharge-the-algorithm-that-recommends-you-videos-033027002.html).",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxrx6m/",
          "created": 1722493716,
          "depth": 1,
          "replies": [
            {
              "id": "lfxsc4d",
              "score": 3,
              "body": "IG Reels is indeed catching up with TikTok. Except video advertisements are hard to monetize and have been deprioritized at FB as a result. \n\nVideo recommendations are also fundamentally different from text and image recommendations which is the traditional fb feed. \n\nTwitter is just text and very celebrity oriented. They won’t need a comparably robust rec system. \n\nMy point is that competition catch up is more of an engagement play (that does correlate with revenue due to stay time), but not a high impact lever and questionable to offset the large ai cost.",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxsc4d/",
              "created": 1722493983,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfya99x",
              "score": -2,
              "body": "They shouldn’t be allowed to just copy every single new type of social media like that and then make it their mission to kill the company that came up with it in the first place",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfya99x/",
              "created": 1722506055,
              "depth": 2,
              "replies": [
                {
                  "id": "lfzffnk",
                  "score": 2,
                  "body": "Business 101 my friend",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfzffnk/",
                  "created": 1722523939,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lfzj2fk",
                  "score": 2,
                  "body": "means you don’t read, it’s basically how businesses working.",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfzj2fk/",
                  "created": 1722525125,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lfyty97",
      "score": 6,
      "body": "Facebook is complete garbage these days. I can’t even see my friends post anymore because I get to watch some crafting panda video 🤦🏽‍♂️",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfyty97/",
      "created": 1722516128,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfxxrgk",
      "score": 23,
      "body": "Remember when everyone thought Zuck was Zucked out on the metaverse (including me) guy double quarterly profits when I just want to see the company implode. He may turn me into a bull at the peak.",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxxrgk/",
      "created": 1722497525,
      "depth": 0,
      "replies": [
        {
          "id": "lfytysd",
          "score": 11,
          "body": "bought $META worth about $10k at around 140 a peice, couldn’t be happier. Zuck is perhaps one of the smartest person alive in this world and perhaps the only one who is a gifted techie and also a shrewd businessman. \n\nI’ll hold and add anything he is involved with till my death.",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfytysd/",
          "created": 1722516134,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfy1qk1",
          "score": -4,
          "body": "Welp, I don't know what to make of Zuck. I think his AI plays are solid, but his vision of the metaverse is just so lame. Perhaps it's possible for him to be a genius at some things and a dumbass at others. Which is kind of how he was portrayed in the movie.",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfy1qk1/",
          "created": 1722500234,
          "depth": 1,
          "replies": [
            {
              "id": "lfy6evb",
              "score": 17,
              "body": "You’re using a movie to make judgements on a CEO instead of looking at the income statement and realizing that Meta is a money printing machine?   Lol",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfy6evb/",
              "created": 1722503455,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfy3dqn",
              "score": 9,
              "body": "In Zuck we trust.",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfy3dqn/",
              "created": 1722501361,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfxoq90",
      "score": 21,
      "body": "Except that social media is swarming with bots… so any AI that learns from social media/the internet just ends up learning from bots.  It’s a propaganda machines under the guise of intelligence.",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxoq90/",
      "created": 1722491734,
      "depth": 0,
      "replies": [
        {
          "id": "lfxp46j",
          "score": 26,
          "body": "Most Facebook advertisers optimize towards conversions -- i.e. final sales. If the advertisers aren't making sales, they won't be spending on Facebook. The fact that their ad revenue grew by so much is evidence that Facebook has at least partially recovered from the iOS disaster.",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxp46j/",
          "created": 1722491968,
          "depth": 1,
          "replies": [
            {
              "id": "lfz0s0m",
              "score": 3,
              "body": "Have you used facebook recently? In the feed 50% of the posts are \"sponsored\", 25% are from various pages with ai generated crap context (\"check the link of the first comment to see which celebrity stuck an eggplant in their anus\") and the rest are from actual people/groups i'm following. It's basically unusable at this stage. I don't think they are growing per se, just racking up the leftover space. Eventually they will run out of it. Instagram is still okay though.",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfz0s0m/",
              "created": 1722518845,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lfxu6hn",
              "score": -6,
              "body": "Conspiracy brain: bots making sales, moving numbers on dollars around?",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxu6hn/",
              "created": 1722495158,
              "depth": 2,
              "replies": [
                {
                  "id": "lfy1nqd",
                  "score": 5,
                  "body": "How would that work exactly? A bot would use a credit card to buy a makeup kit on an instagram ad?",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfy1nqd/",
                  "created": 1722500181,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfy34ed",
          "score": 2,
          "body": "Remember when the person created a fake account on social media, claiming to be a company that is going to give away diabetes medicine; dropping the stock price?\n\nImagine what a bot could do...",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfy34ed/",
          "created": 1722501182,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfyo4oq",
      "score": 8,
      "body": "Machine Learning is now AI, I guess.",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfyo4oq/",
      "created": 1722513542,
      "depth": 0,
      "replies": [
        {
          "id": "lfzozhz",
          "score": 4,
          "body": "I mean yeah, ML has always been a subset of AI.",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfzozhz/",
          "created": 1722527009,
          "depth": 1,
          "replies": [
            {
              "id": "lg1lgf5",
              "score": 2,
              "body": "No. It hasn't. Look at the original definition of AI from Stanford University in the 1960s. First time it ever was defined.",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg1lgf5/",
              "created": 1722548482,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfxr00q",
      "score": 16,
      "body": "No joke AI has helped me improve the speed of code which in turn means less time using large computing resources which means less capex. It’s real.",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxr00q/",
      "created": 1722493138,
      "depth": 0,
      "replies": [
        {
          "id": "lfzpqfa",
          "score": 0,
          "body": "can you elaborate? I am a swe.",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfzpqfa/",
          "created": 1722527245,
          "depth": 1,
          "replies": [
            {
              "id": "lg2khgf",
              "score": 1,
              "body": "Its a tool that help you code faster if you know yow to use it.",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg2khgf/",
              "created": 1722561360,
              "depth": 2,
              "replies": [
                {
                  "id": "lg431g1",
                  "score": 0,
                  "body": "And how is using copilot (which is a load of crap and is just an auto complete for repeatetive code) helping save time on large computation resources?",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg431g1/",
                  "created": 1722589743,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lfy1vb5",
      "score": 6,
      "body": "when the humans are jobless and have no money tech companies will start selling products to AIs.",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfy1vb5/",
      "created": 1722500325,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzaomw",
      "score": 5,
      "body": "This is an unprovable and obvious statement. The alternative is to say they spend billions on AI and got nothing from it.",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfzaomw/",
      "created": 1722522372,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfz90g9",
      "score": 2,
      "body": "Meta, Google, TikTok and such were already profiting from this type of AI much earlier than when companies started slapping gen AI into everything",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfz90g9/",
      "created": 1722521805,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg0fvo3",
      "score": 2,
      "body": "Meta verse was a complete flop. AI is looking good though. Can they please rename the company to AI Facebook?",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg0fvo3/",
      "created": 1722535432,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg0o4he",
      "score": 2,
      "body": "AI told Meta to increase ads by 20%",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg0o4he/",
      "created": 1722537980,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg2rbx2",
      "score": 2,
      "body": "The whole purpose of ai seems to be social media related. ChatGPT is somewhat for that but the rest all seems to be some sort of competition against royalty free sites to create content.\n\nThe ad platform had always had the same ai type recommendations just that now it’s called ai.",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lg2rbx2/",
      "created": 1722564099,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfxsf35",
      "score": 5,
      "body": "Ad Revenue needs to be combined with the ACTUAL number of people being influenced by ads.\n\nI want to see the actual value returned on the ad revenue being spent, cause if it wasn't a write off for the company, I doubt they would spend even a fraction of this money on ads.\n\nBut just forcing ads in front of someone and calling it engagement, is legit crap. Id LOVE to meet the person that clicks on an ad on a webpage that wasn't an accident, or like, 75...",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxsf35/",
      "created": 1722494034,
      "depth": 0,
      "replies": [
        {
          "id": "lfxwkqi",
          "score": 6,
          "body": "From META's perspective, it doesn't matter. The only thing that matters is that advertisers pay them to use their platform, and said advertisers see an increased ROI.  Seems like that is true.\n\n\nWe aren't Facebook's customers. Advertisers are.  It doesn't matter if the numbers are caused by not or people, if the advertisers see value in shelling out money for ad space, then Facebook will continue to take in epic profits.",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxwkqi/",
          "created": 1722496726,
          "depth": 1,
          "replies": [
            {
              "id": "lfxzgb0",
              "score": -6,
              "body": "But those customers are only customers, cause they are getting tax write offs for all ads. \n\nSo these are just, echo chamber profits, that don't really reach the end user in any capacity that matters, but we fund it indirectly. \n\nRemove that tax incentive, and these companies don't have any real revenue stream. \n\nI'd rather see tech companies make money off...hear me out...tech. Silicon Valley is no longer tech innovative. Its just ad companies pretending that they have some tech plans for the future. And its pretty clear they don't.",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxzgb0/",
              "created": 1722498679,
              "depth": 2,
              "replies": [
                {
                  "id": "lfy5yd2",
                  "score": 7,
                  "body": "I’m sorry but you are talking out of your ass.  Companies advertise with Facebook because it works and helps them generate revenue.  Not only does it work but it has become a cornerstone of so many businesses and how they attract customers and drive demand for their products.  Facebook advertising has literally built successful businesses, put new businesses on the map and significantly increase their revenues with their ad platform.",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfy5yd2/",
                  "created": 1722503136,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lfycfk7",
                  "score": 1,
                  "body": "And that \"tax write off\" is now at meta as revenue and earnings, which are then taxed",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfycfk7/",
                  "created": 1722507440,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lfynp6c",
                  "score": 1,
                  "body": "Meta spends billions of dollars trying to innovate in the AR/VR space.",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfynp6c/",
                  "created": 1722513339,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfxw272",
          "score": 13,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxw272/",
          "created": 1722496384,
          "depth": 1,
          "replies": [
            {
              "id": "lfxz2fp",
              "score": 2,
              "body": "I just want to know what the actual click through rate. When I was in my masters program at UW (years and years ago), it was 1% of 1% of all ads displayed led to sales.",
              "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxz2fp/",
              "created": 1722498418,
              "depth": 2,
              "replies": [
                {
                  "id": "lfy45oq",
                  "score": 1,
                  "body": "If you're just talking about random display ads, then that makes sense. But did you study targeted ads where the social platform is using incredible amounts of signals to detect demographics, browsing history, intent, mood, etc?\n\nFor a period FB ads were so easy to make money with. It was literally so good at finding people to buy your products. Then Apple and Google crippled FB by taking away major tracking capabilities. The big battle now is whether FB can use AI to overcome that roadblock. It seems like based on the recent profits they are making decent progress.",
                  "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfy45oq/",
                  "created": 1722501897,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfxsusp",
          "score": 2,
          "body": "Yeah brand building is a big deal and it seems like they aren't as good at it as old TV and radio.",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxsusp/",
          "created": 1722494313,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfyy6vb",
      "score": 1,
      "body": "We have ai and there are tons of possible real world scenarios it will excel at. \n\nSo what’s its main money generating application?\n\nWell, serving you more ads while fortifying your echo chamber.",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfyy6vb/",
      "created": 1722517848,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzbabz",
      "score": 1,
      "body": "I think AI is exciting , but I wonder how many know what it is ?\n\nA \"simple example\" is, watch the Samsung Phone commercial with it locating an item by making a circle .",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfzbabz/",
      "created": 1722522574,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzbenz",
      "score": 1,
      "body": "Those damn donkeys took millions from trump in 2015 to micro target Americans with lies.  THAT was explored in the movie The Great Hack on Netflix.  What Cambridge Analytica did is disturbing.  Fakebook is ALWAYS gonna make money from politicians micro targeting Americans and perverting the weak amongst U.S.  THAT is the power of information.  Now if we ever decide to start regulating that, I'll be the first person to start shorting fakebook.  As it stands, in election years, get used to spikes in revenue quarter by quarter through Q4.",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfzbenz/",
      "created": 1722522615,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfxn7gi",
      "score": -4,
      "body": "Cooking the books",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxn7gi/",
      "created": 1722490825,
      "depth": 0,
      "replies": [
        {
          "id": "lfyoh4a",
          "score": -1,
          "body": "🍲 📚",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfyoh4a/",
          "created": 1722513702,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfxz6xz",
      "score": 0,
      "body": "Sounds good. Don't miss a TSLA play because Elon isn't gonna let anyone out-cook his books.....",
      "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfxz6xz/",
      "created": 1722498502,
      "depth": 0,
      "replies": [
        {
          "id": "lfy383f",
          "score": 2,
          "body": "LOL, damn I needed that :)",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfy383f/",
          "created": 1722501253,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfy3xl3",
          "score": 2,
          "body": "Should read the statements from Volkswagen CEO during today’s earnings call, that’s exactly how a good CEO should be with conviction, responsibility and rational.",
          "permalink": "/r/stocks/comments/1eh89pb/cnbc_metas_advertising_growth_is_proof_that_hefty/lfy3xl3/",
          "created": 1722501744,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}