{
  "title": "Shell beats second-quarter profit expectations, launches share buyback program ",
  "score": 34,
  "selftext": "British oil giant Shell on Thursday posted stronger-than-expected second-quarter profit despite lower refining margins and weaker liquified natural gas trading.\n\nThe oil and gas major reported adjusted earnings of $6.3 billion for the three-month period through to the end of June, beating analyst expectations of $5.9 billion, according to estimates compiled by LSEG.\n\nShell’s second-quarter profits were down 19% when compared to the first three months of the year. The company reported adjusted earnings of $7.7 billion in the first quarter of 2024.\n\nShell said it would launch a $3.5 billion share buyback program over the next three months, a similar rate as in the previous quarter. The company’s dividend remains unchanged at 34 cents per share.\n\n“We’re in a good place and we have good momentum as we see it but a lot more to do,” Shell CEO Wael Sawan told CNBC’s “Squawk Box Europe” on Thursday.\n\nAsked how far Shell was on its journey to create a more disciplined and more value-focused company, Sawan replied, “We’re halfway through. We had talked about a 10-quarter sprint. We are literally at the beginning of the fifth quarter at the moment and we’re making a great progress.”\n\nSawan cited “significant improvements” in areas such as cost, capital discipline and operational performance.\n\nShell’s CEO said the company had completed $1.7 billion of structural cost reductions since 2022, noting the firm’s target of reducing costs by between $2 billion and $3 billion by the end of next year.\n\nLondon-listed shares of the company rose 1.4% on Thursday morning. Shell’s stock price has climbed more than 11% so far this year, outperforming European peers.\n\nBritish rival BP on Tuesday increased its dividend and extended its share repurchasing program on the back of stronger-than-expected earnings. U.S. oil giants Exxon Mobil and Chevron are both scheduled to report second-quarter results on Friday.\n\n‘The perennial question’\n\nShell recently warned that it expected to take an impairment charge of up to $2 billion after the sale of its Singapore refinery and the suspension of on-site construction at its Rotterdam plant in the Netherlands.\n\nShell confirmed in early May that it had agreed to sell its refinery and petrochemical assets in Singapore to a joint venture of Indonesian petrochemical firm PT Chandra Asri and Swiss-based trading house Glencore.\n\nThe transaction, which is expected to be completed by the end of the year, was regarded as part of Sawan’s plans to lower Shell’s carbon footprint and focus on its most profitable businesses.\n\nJohn Moore, senior investment manager at RBC Brewin Dolphin, described Shell’s second-quarter results as “robust” and said they “underline why the market is generally optimistic about the company’s prospects.”\n\n“Shell has been more forthright in its commitment to oil and gas for the foreseeable future, and that should underpin the company’s returns over the medium term,” Moore said.\n\n“There is, nevertheless, the perennial question about its journey to net zero, which many shareholders will be keen to hear more about in future updates.”\n\nSome of Shell’s shareholders have expressed concern about the firm’s energy transition strategy after it watered down its 2030 carbon reduction target and scrapped a 2035 objective, citing “uncertainty in the pace of change in the energy transition.”\n\nAsked on Thursday whether Shell was still committed to its 2050 pledge to become a net-zero company, Sawan replied, “We are absolutely committed to the 2050 target, but we also recognize that the trajectory from here to there is not a linear one.”\n\nHe added that there will be “significant twists and turns” and the company was “exercising strategic patience” to focus on opportunities that can create value both today and in the long term.\n\nSource: https://www.cnbc.com/2024/08/01/shell-earnings-q2-2024.html",
  "link_flair_text": null,
  "id": "1ehdeza",
  "num_comments": 10,
  "created_utc": 1722508555,
  "permalink": "/r/stocks/comments/1ehdeza/shell_beats_secondquarter_profit_expectations/",
  "comments": [
    {
      "id": "lfylcqd",
      "score": 10,
      "body": "My condolences to the guy who told me he was short Shell.",
      "permalink": "/r/stocks/comments/1ehdeza/shell_beats_secondquarter_profit_expectations/lfylcqd/",
      "created": 1722512206,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg0t4tn",
      "score": 5,
      "body": "I’m pretty happy with my buy-in of 26.00€ two years ago. Great dividend / value play so far.",
      "permalink": "/r/stocks/comments/1ehdeza/shell_beats_secondquarter_profit_expectations/lg0t4tn/",
      "created": 1722539577,
      "depth": 0,
      "replies": [
        {
          "id": "lg5sxad",
          "score": 3,
          "body": "Got mine for 14 in the pandemic when everyone thought oil and gas was over LOL",
          "permalink": "/r/stocks/comments/1ehdeza/shell_beats_secondquarter_profit_expectations/lg5sxad/",
          "created": 1722615431,
          "depth": 1,
          "replies": [
            {
              "id": "lg5yxoc",
              "score": 2,
              "body": "Nice. I had some nice earnings during the Pandemic but sold when we bought a house.",
              "permalink": "/r/stocks/comments/1ehdeza/shell_beats_secondquarter_profit_expectations/lg5yxoc/",
              "created": 1722617324,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfz9ais",
      "score": 2,
      "body": "Net Zero, that's gonna be a lot of carbon credits.",
      "permalink": "/r/stocks/comments/1ehdeza/shell_beats_secondquarter_profit_expectations/lfz9ais/",
      "created": 1722521901,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzzjix",
      "score": 1,
      "body": "But the stock was down in the last hours, can someone explain to me why?",
      "permalink": "/r/stocks/comments/1ehdeza/shell_beats_secondquarter_profit_expectations/lfzzjix/",
      "created": 1722530356,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg05ztw",
      "score": 1,
      "body": "“Things are so good we are going to buy back $3.5B of our stock over three months.”",
      "permalink": "/r/stocks/comments/1ehdeza/shell_beats_secondquarter_profit_expectations/lg05ztw/",
      "created": 1722532365,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg0gvod",
      "score": 1,
      "body": "$80 soon",
      "permalink": "/r/stocks/comments/1ehdeza/shell_beats_secondquarter_profit_expectations/lg0gvod/",
      "created": 1722535740,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg2fnqr",
      "score": 1,
      "body": "Would still rather have a reasonable tank fill up but good for them.",
      "permalink": "/r/stocks/comments/1ehdeza/shell_beats_secondquarter_profit_expectations/lg2fnqr/",
      "created": 1722559489,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg0k8l4",
      "score": -2,
      "body": "Yeah, but Biden is causing global inflation",
      "permalink": "/r/stocks/comments/1ehdeza/shell_beats_secondquarter_profit_expectations/lg0k8l4/",
      "created": 1722536774,
      "depth": 0,
      "replies": []
    }
  ]
}