{
  "title": "These are the stocks on my watchlist (8/1)",
  "score": 34,
  "selftext": "Hi! I am an ex-prop shop equity trader. This is a daily watchlist for trading: I might trade all/none of the stocks listed, and even stocks not listed! I only hold MAG7/market indices long-term. If you use Old Reddit, click “Show Images” at the top to expand the charts. Any positions stated aren’t recommendations, I’m following subreddit rules to disclose positions.\n\nSome stocks I post may be <$500M market cap. These are potentially good candidates to day trade; I have no opinion on them as investments. PLEASE ask specific questions. Questions like “Thoughts on \\_\\_\\_\\_\\_?” or “Is \\_\\_\\_ a good investment?” will be ignored or I’ll troll you unless you add detail and your own opinion. I will block you if you are a troll.\n\nNews: [US Initial Jobless Claims Rise to One-Year High as Hiring Slows](https://www.bloomberg.com/news/articles/2024-08-01/us-initial-jobless-claims-rise-to-highest-level-in-nearly-a-year)\n\n* [**META**](https://finviz.com/quote.ashx?t=META&p=d) - Beat Q2 expectations, warns of “significant” spending expansion in 2025. Said it will not provide any guidance until 2025. Can expect infrastructure costs to be significant driver of expense growth. EPS of $5.16 vs $4.74B.\n* [**TDOC**](https://finviz.com/quote.ashx?t=TDOC&p=d) - Reports Q2 loss, and misses revenue estimates. -.$28 vs -.$36 EPS, also going for mental health strategic pivot.\n* [**ASTS**](https://finviz.com/quote.ashx?t=ASTS&p=d) - Broke the $20 level I was watching yesterday, 5 satellites announced to be launched for September.\n* [**ARM**](https://finviz.com/quote.ashx?t=ARM&p=d) - $939M vs $905.4M expected, EPS of .$40 vs .$34 expected. Also stated it will stop disclosing number of chips reported as shipped. Left guidance unchanged (reason for the drop)\n* [**NVDA**](https://finviz.com/quote.ashx?t=NVDA&p=d) - Watching $120/$121 level after the epic 20 point run it had in the past 2 days, leaning bearish at the moment but will likely take no position until the open.\n\nEarnings: **AMZN**, **AAPL**, **DKNG**, **COIN**, **INTC**, **MARA**, **SQ**",
  "link_flair_text": null,
  "id": "1ehgi7k",
  "num_comments": 17,
  "created_utc": 1722518418,
  "permalink": "/r/stocks/comments/1ehgi7k/these_are_the_stocks_on_my_watchlist_81/",
  "comments": [
    {
      "id": "lfz9ptu",
      "score": 11,
      "body": "I have about 300 shares of NVDA - I actually bought more when it down. I did the same for NVDL of which I have 400.    \nI have been seeing a few people posting on WSB about ASTS. Many of them bought this stock a few months ago at only $2.34. Astounding that it has jumped so high so quick. Now that I see it here on your list, I am considering it.   \nThanks for the list by the way.",
      "permalink": "/r/stocks/comments/1ehgi7k/these_are_the_stocks_on_my_watchlist_81/lfz9ptu/",
      "created": 1722522046,
      "depth": 0,
      "replies": [
        {
          "id": "lfza2vb",
          "score": 7,
          "body": "That's a sick trade, congratulations! I'm sure you know this but [levered ETFs are subject to slippage, so be careful with NVDL.](https://www.investopedia.com/articles/investing/121515/why-3x-etfs-are-riskier-you-think.asp)\n\nASTS is a pretty speculative stock- I like it for trading, but as a long-term investment (I'm talking about on a timeframe of multiple years) I'm not quite confident yet. After they launch their satellites I'll write up a deep dive.\n\nAnd thank you for being a reader! :)",
          "permalink": "/r/stocks/comments/1ehgi7k/these_are_the_stocks_on_my_watchlist_81/lfza2vb/",
          "created": 1722522169,
          "depth": 1,
          "replies": [
            {
              "id": "lfzblj8",
              "score": 4,
              "body": "I have more shares of NVDL because I sell covered calls on the stock. And I make a huge premium compared to others.   \nOn ASTS, I am hesitant since I see so many on WBS with positions on the stock where they bought it at $2 to $3 a share. The minute these guys begin dumping that stock... well I am not trying to get burned again.   \nI lost about 20K a few years back for falling for Meme stocks there..",
              "permalink": "/r/stocks/comments/1ehgi7k/these_are_the_stocks_on_my_watchlist_81/lfzblj8/",
              "created": 1722522679,
              "depth": 2,
              "replies": [
                {
                  "id": "lfzce7c",
                  "score": 4,
                  "body": "Fair enough, if you're cognizant of the risks then hey, best of luck!\n\nYeah the valuation for ASTS currently is nuts, it's all future potential to go on from this point.",
                  "permalink": "/r/stocks/comments/1ehgi7k/these_are_the_stocks_on_my_watchlist_81/lfzce7c/",
                  "created": 1722522946,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lg38j33",
                  "score": 2,
                  "body": ">I lost about 20K a few years back for falling for Meme stocks there..\n\nThe irony of WSB, Retail dumping on Retail, and yet they give the losers the impression that it was the hedgies fault and those sales were shorts 😂🤣",
                  "permalink": "/r/stocks/comments/1ehgi7k/these_are_the_stocks_on_my_watchlist_81/lg38j33/",
                  "created": 1722571512,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lg533ma",
                      "score": 2,
                      "body": "Yes. I was new to investing and just got in it. The MEME hype was new so I fell for the trend.   \nBig mistake. However, mistakes are what make you stronger, smarter.. in some cases.. In others, some people never learn.",
                      "permalink": "/r/stocks/comments/1ehgi7k/these_are_the_stocks_on_my_watchlist_81/lg533ma/",
                      "created": 1722607029,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lfzsm8k",
      "score": 6,
      "body": "I own META, NVDA, GOOG, still holding.",
      "permalink": "/r/stocks/comments/1ehgi7k/these_are_the_stocks_on_my_watchlist_81/lfzsm8k/",
      "created": 1722528161,
      "depth": 0,
      "replies": [
        {
          "id": "lfzt2a9",
          "score": 2,
          "body": "You must be very happy with your portfolio lol, congrats.",
          "permalink": "/r/stocks/comments/1ehgi7k/these_are_the_stocks_on_my_watchlist_81/lfzt2a9/",
          "created": 1722528302,
          "depth": 1,
          "replies": [
            {
              "id": "lg01jpi",
              "score": 2,
              "body": "It's doing well, but as expected I have a few losers: ZM, FVRR, and some others I probably should sell.  But overall more winners.",
              "permalink": "/r/stocks/comments/1ehgi7k/these_are_the_stocks_on_my_watchlist_81/lg01jpi/",
              "created": 1722530977,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfzr56f",
      "score": 4,
      "body": "I've been too clever by half over the years trying to jump in and out of some of the MAG7 (or similar) stocks.  \n\nOwned AAPL in 2011, AMZN 2014, $225k of AMAT 2011 at ~11/share (do the math its worth now).  Still holding some of 2011 AAPL shares, but these should have just been pure holds.\n\nNot making that mistake this time.  Double digit cost basis buys from late 2022 in both META & AMZN and I'm just gonna hold for good now.   \n\nNew buys of new stocks will have to be with new money.",
      "permalink": "/r/stocks/comments/1ehgi7k/these_are_the_stocks_on_my_watchlist_81/lfzr56f/",
      "created": 1722527694,
      "depth": 0,
      "replies": [
        {
          "id": "lfzsndl",
          "score": 6,
          "body": "That's a good philosophy. I think that most people can't beat the market with timing alone.\n\nI remember begging my dad as a kid to buy some AAPL stock because they were coming out with really cool things called \"iPods\" lol, kid investor me would have blown me out of the water.",
          "permalink": "/r/stocks/comments/1ehgi7k/these_are_the_stocks_on_my_watchlist_81/lfzsndl/",
          "created": 1722528171,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lg0anru",
      "score": 2,
      "body": "I really should add more META eventually, thank you for your watchlists!",
      "permalink": "/r/stocks/comments/1ehgi7k/these_are_the_stocks_on_my_watchlist_81/lg0anru/",
      "created": 1722533817,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg4rlui",
      "score": 1,
      "body": "I bought Google msft and Amazon… aaaaand Everything dropped haha",
      "permalink": "/r/stocks/comments/1ehgi7k/these_are_the_stocks_on_my_watchlist_81/lg4rlui/",
      "created": 1722602773,
      "depth": 0,
      "replies": []
    }
  ]
}