{
  "title": "Wayfair shares sink as CEO likens home goods slowdown to 2008 financial crisis ",
  "score": 285,
  "selftext": "Online home goods company Wayfair saw sales decline in its fiscal second quarter as its CEO likened the current slowdown in the home goods category to the 2008 financial crisis.\n\n“Our credit card data suggests that the category correction now mirrors the magnitude of the peak to trough decline the home furnishing space experienced during the great financial crisis,” Wayfair CEO Niraj Shah said in a news release. “Customers remain cautious in their spending on the home.”\n\nThe e-tailer fell short of Wall Street’s expectations on both the top and bottom lines. Shares fell 10% in premarket trading Thursday.\n\nHere’s how Wayfair did in its second fiscal quarter compared with what Wall Street was anticipating, based on a survey of analysts by LSEG:\n\nEarnings per share: 47 cents adjusted vs. 49 cents expected\n\nRevenue: $3.12 billion vs. $3.18 billion expected\n\nThe company reported a loss of $42 million, or 34 cents per share, in the three-month period that ended June 30. That’s slightly better than the loss of $46 million, or 41 cents per share, that it posted during the same quarter a year earlier. \n\nSales dropped to $3.12 billion, down about 2% from $3.17 billion a year earlier. The slowdown in sales came even as average order values rose in the quarter from $313 to $307 and after the company opened its first large format store.\n\nFor more than a year, home goods companies like Wayfair have seen sluggish demand for things like new couches and dining sets as the overall housing market turned stagnant against high interest rates. Consumers are buying fewer new homes, which means they have fewer reasons to buy new furniture. Plus, with stubborn inflation, they’ve been more choosy on where they’re spending their discretionary income, and with options like restaurants, new clothes and trips, home goods have not been a priority. \n\nWayfair has needed to entice customers with discounts to bring them in and doesn’t expect to see a resurgence in the category until interest rates are cut and the housing market bounces back. \n\n“We see declines that are similar to the declines that we saw in that 2008 to 2010 period and I think what that speaks to is that the category has been going through just a massive correction, a correction that we’ve previously only seen during a GDP recession,” Wayfair finance chief Kate Gulliver told CNBC in an interview. \n\n“Obviously we’re not technically in a GDP recession as a country right now, and so this is somewhat a unique thing to this category… we’ve seen that kind of recession-like correction in the category over the last few years.” \n\nReprieve could soon be on the way after Federal Reserve Chair Jerome Powell said interest rate cuts could come as soon as September as long as economic data continues on its current path.\n\nWayfair, which has implemented a string of mass layoffs to get its cost structure in line with the current size of its business, has struggled to reach profitability, but the quarter was the best for free cash flow generation and adjusted EBITDA in three years, Shah said. \n\nThe company saw adjusted EBITDA of $163 million during the quarter, still below the $168 million that Wall Street had expected, according to StreetAccount. \n\n“We are running the business with the goal of demonstrating substantial growth in profitability this year, even as the top line remains challenging. And that will be our mindset every year going forward as well,” said Shah.\n\nSource: https://www.cnbc.com/2024/08/01/wayfair-w-earnings-q2-2024.html",
  "link_flair_text": null,
  "id": "1ehgy2n",
  "num_comments": 90,
  "created_utc": 1722519620,
  "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/",
  "comments": [
    {
      "id": "lfz5myk",
      "score": 209,
      "body": "They used to be good, now it's just 3rd party resellers listing overpriced item that's available on other websites",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfz5myk/",
      "created": 1722520624,
      "depth": 0,
      "replies": [
        {
          "id": "lfz9zvx",
          "score": 77,
          "body": "Also it’s hilarious hearing CEOs saying these kinds of things. They’re so out of touch. \n\nGPD is growing as is wage growth. So we’re no where close to 2008. \n\nBut you know what consumers are really pissed off about? Ridiculous prices for everything due to greedflation. People are searching for value and are holding off on bigger purchases because their dollar doesn’t go as far.",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfz9zvx/",
          "created": 1722522140,
          "depth": 1,
          "replies": [
            {
              "id": "lfzy774",
              "score": 17,
              "body": "Weren’t GDP and wages also growing at about the same rate in 2007 as they are now? Not saying we’re heading towards 2008 version 2, but saying GDP and wages are up therefore there is no downturn coming is a little off.",
              "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzy774/",
              "created": 1722529930,
              "depth": 2,
              "replies": [
                {
                  "id": "lg0ldjp",
                  "score": 0,
                  "body": "> Weren’t GDP and wages also growing at about the same rate in 2007 as they are now?\n\n2007: Leading up to the Great Recession, the U.S. economy saw moderate growth. In 2007, GDP growth was about 1.9% according to the Bureau of Economic Analysis (BEA).\n\nRecent Years (2023): GDP growth has varied in recent years due to the impact of the COVID-19 pandemic and subsequent recovery. For example, in 2021, GDP grew by about 5.7%, driven by recovery from the pandemic, but this growth rate has moderated since then, with GDP growth in 2023 estimated to be around 2% to 2.5%.\n\n2007: Wage growth was relatively stagnant before the recession. According to the Bureau of Labor Statistics (BLS), real wage growth was minimal, with nominal wages increasing modestly but often outpaced by inflation.\n\nGDP Growth: The growth rate of GDP in 2007 was lower compared to some recent years, especially during the post-pandemic recovery. However, recent growth rates are beginning to resemble the moderate growth seen in 2007 as the economy stabilizes.\n\nWage Growth: Real wage growth has been more pronounced recently due to labor market pressures, but inflation has also been higher, which complicates direct comparisons. In 2007, wage growth was weaker, with stagnant real wages being a concern leading up to the recession.\n\nRecent Years (2023): Wage growth has been more dynamic in recent years, partly due to labor shortages and inflation pressures. In 2022, nominal wages increased by about 5% on average, though real wage growth (adjusted for inflation) has been mixed. Some quarters saw real wage declines due to high inflation, while other periods showed modest real gains.\n\nDeregulation of the financial industry led to those GOP caused recessions, then we need to either re-instate the regulations they repealed or make new ones, they hurt us more than help us every time they hold the presidency.",
                  "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg0ldjp/",
                  "created": 1722537126,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lg0mw5l",
                      "score": 0,
                      "body": "Appreciate all the info, but our current numbers and situation are not vastly different to back then. The business cycle doesn’t care which party is in charge, sure they can maybe affect the trigger of a meltdown but we will have expansions and contractions regardless of left or right wing being in power. We’re probably heading into a recession.\n\nNothing wrong with recessions, they’re normal.",
                      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg0mw5l/",
                      "created": 1722537598,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lg0ru0f",
                          "score": 4,
                          "body": ">but our current numbers and situation are not vastly different to back then.\n\n  \nOh? Go on...",
                          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg0ru0f/",
                          "created": 1722539158,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lg0upv0",
                              "score": 0,
                              "body": "Real GDP growth in 2007 averaged out to what, 2%? But quarter by quarter it wasn’t so different to now. Source: https://www.multpl.com/us-real-gdp-growth-rate\n\nSeptember 2007 was 2.37 and March 2024 was 2.92. I don’t see the massive difference. We were above 5% annualised real GDP growth before the 2000s recession. \n\nReal wage growth is 1.5% or so over the past 4 years, hardly anything impressive but at least it barely exceeds inflation (at least the official CPI) https://www.statista.com/chart/amp/32428/inflation-and-wage-growth-in-the-united-states/\n\nI’m all for optimism but I just don’t buy the argument that our numbers mean we are basically guaranteed to not be heading for a downturn. That’s not a robust argument. Recessions don’t just appear out of nowhere. We typically start with a robust looking, heated economy and very low unemployment, and then hey! Unemployment rises, bankruptcies spike and consumption falls over. This is the business cycle. \n\nIf we trigger the sahm rule in the next couple of employment reports, and or the yield curve steepens further, I’m sorry, historically speaking it would be pretty much unprecedented to not have a recession. The extra 50 bps of GDP won’t do anything. \n\nOne thing that’s also very different to 2008 is the government is leveraged up to its eyeballs worse than it was post world war 2.",
                              "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg0upv0/",
                              "created": 1722540083,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lg1zldc",
                                  "score": 2,
                                  "body": "You said the 'situations are not vastly different'....I'm failing to see how 2 generic data points make these situations even remotely similar.",
                                  "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg1zldc/",
                                  "created": 1722553497,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lg3ec5a",
                                      "score": 1,
                                      "body": "If you read the comment I first responded to, it’s basically saying we aren’t close to a recession because GDP and wages are up",
                                      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg3ec5a/",
                                      "created": 1722574431,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lgboyg7",
                          "score": 1,
                          "body": "> The business cycle doesn’t care which party is in charge, sure they can maybe affect the trigger of a meltdown but we will have expansions and contractions regardless of left or right wing being in power. \n\n10 out of 11 recessions between 1953 - 2020 started with a Republican in the White House.\n\nhttps://www.cnn.com/2020/09/23/investing/stock-market-election-trump-biden/index.html\n\nS&P gains also tend to be higher under democrats than republicans, with an average of 11.2% vs 6.9%, taken since 1945.\n\nSay what you want but there’s a strong correlation to markets doing noticeably better under democrats than republicans.",
                          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lgboyg7/",
                          "created": 1722704667,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lg04waw",
                  "score": 1,
                  "body": "If you have the data point, please share it as I’d love to see it too. \n\nI mean 2008’s meltdown was due to MBS’s so slightly different",
                  "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg04waw/",
                  "created": 1722532020,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lg3j0zy",
              "score": 3,
              "body": "CEO is something else.. A year ago while he was on vacation he sent an email to all employees asking them to work longer hours",
              "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg3j0zy/",
              "created": 1722577038,
              "depth": 2,
              "replies": [
                {
                  "id": "lg4tuz1",
                  "score": 1,
                  "body": "Ah this guy eh",
                  "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg4tuz1/",
                  "created": 1722603655,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lg2vlzc",
              "score": 2,
              "body": "His point is specific to the home/furnishing market which is likely as suppressed as that time because people arent buying as many homes.",
              "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg2vlzc/",
              "created": 1722565833,
              "depth": 2,
              "replies": [
                {
                  "id": "lg34z0z",
                  "score": 0,
                  "body": "Fair. \n\nI wonder what he’ll say when rates drop and people start buying homes again and they leave this brand behind lol",
                  "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg34z0z/",
                  "created": 1722569863,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lg1ty1j",
              "score": 1,
              "body": "The only reason GDP and wages have grown is because of inflation caused by monetary debasement. There hasn’t been any real growth in years.",
              "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg1ty1j/",
              "created": 1722551445,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lg15uzh",
              "score": -1,
              "body": "You need to look deeper and find the core reason for the inflation.  It's not \"greed\", but excessive government spending and excessive gov regulation and excessive gov sponsored immigration all driving prices higher and higher.",
              "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg15uzh/",
              "created": 1722543519,
              "depth": 2,
              "replies": [
                {
                  "id": "lg1f6sn",
                  "score": 0,
                  "body": "I mean there’s definitely both but the general consensus was that inflation was being driven by higher interest rates but when you actually looked at the interest rate increases, companies were increasing prices beyond those justified rates. That’s where greedflation was coming from. \n\nWhen you say excessive government sponsored immigration, can you give some examples? Are you referring to increased demand for fewer products or? Typically new immigrants make less and work in less desirable roles that don’t cause inflation when it comes to earnings",
                  "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg1f6sn/",
                  "created": 1722546389,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lfzdn7t",
          "score": 33,
          "body": "I noticed this when furnishing my apartment post divorce. Wayfair and Amazon both had similar items but with Amazon the shipping was always fast & free, plus I know it would be easier to return anything that didn't work out.",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzdn7t/",
          "created": 1722523360,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lg3f8lg",
          "score": 3,
          "body": "Tip when shopping Wayfair - Google reverse image search and find exact matches from other places. \n\nWayfair doesn't do price match and their returns aren't free, unless the product is damaged.",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg3f8lg/",
          "created": 1722574909,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfzyi84",
          "score": 2,
          "body": "Was gonna say. I sell luxury beds and my company is doing much better this year compared to last. My commission checks have been nice. Last year I was considering leaving",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzyi84/",
          "created": 1722530026,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfzfipu",
      "score": 163,
      "body": "We used to buy from Wayfair, prices were decent, product reviews were accurate, they had a good selection and online was the best option during covid. \n\nIn Dec 2023, CEO Niraj Shah sent a memo to his employees that stated that while the company had regained profitability, they all needed to work long hours, “blend work and life” and give more to the company. In Jan 2024, he proceeded to layoff 13% of them.  \n\nWayfair is no longer a company we will do business with.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzfipu/",
      "created": 1722523968,
      "depth": 0,
      "replies": [
        {
          "id": "lfzh5wh",
          "score": 20,
          "body": "What are some good furniture companies that you think treat employees fairly?",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzh5wh/",
          "created": 1722524501,
          "depth": 1,
          "replies": [
            {
              "id": "lg00o4j",
              "score": 17,
              "body": "I think Ikea is pretty good.",
              "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg00o4j/",
              "created": 1722530707,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lg0goug",
          "score": 9,
          "body": "The products are also now crap, and their returns policy went from being competitive, to repulsive. We ordered a rug for a spare room. When it arrived, it didn’t match the description on the site, it had a weird hard knotted texture not shown in the photos or described and was uncomfortable to walk over. \n\nTried to return it and they offered a 20% to keep it. Not interested so asked for a refund, but to ship it back to them was going to be over $100….. for a $200 rug.\n\nSent it back to them and never bought from them ever again. They lost a customer that used to spend over $5k a year with them that day. I imagine there’s a lot of people like me who stopped buying when they changed their return policy.",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg0goug/",
          "created": 1722535681,
          "depth": 1,
          "replies": [
            {
              "id": "lg16h3k",
              "score": 3,
              "body": "Had the exact same problem. Bought a dining table set that was impossible to put together (badly designed, misaligned screw holes). Had to pay $100 to send it back and get a refund. They have lost me as a customer.",
              "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg16h3k/",
              "created": 1722543704,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lg059xh",
          "score": 6,
          "body": "I sell on Wayfair and I had really bad experiences with them for payment. I opted into quicker payment by paying additional 2% to get the funds deposited into my account within 4 weeks instead of 12. The funds never came, there is no number to call for support and there is only email correspondence with their in house platform. The responses were always they were looking into it. It took me 12 months to get my first payment. But since then the payments are taking me 8 weeks to collect. So I don’t do that much business with them anymore.",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg059xh/",
          "created": 1722532138,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lg3epnp",
          "score": 2,
          "body": "I used to use them before but did an extended break and then needed something very recently... It's so horrible right now that probably 50% of the images are extremely manipulated or just flat-out AI generated (but in a bad way where the proportions don't make any sense, etc. yet the price is like 300-500$). You're basically buying a cat in a sack.",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg3epnp/",
          "created": 1722574627,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lg0lt1a",
          "score": -5,
          "body": "I ordered a patio set from them, and then it came out they were providing the trump admin with furniture to help their immigrant concetration camps. \n\nI complained about the furniture not being correct until they just refunded me and I got to keep it.",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg0lt1a/",
          "created": 1722537260,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfzapdi",
      "score": 94,
      "body": "[ Removed by Reddit ]",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzapdi/",
      "created": 1722522379,
      "depth": 0,
      "replies": [
        {
          "id": "lfzlvcq",
          "score": 16,
          "body": ">wish.com\n\nHaven't seen that name in quite a while. It was advertising everywhere at one point.\n\nWorth less than 150m as a company now.",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzlvcq/",
          "created": 1722526020,
          "depth": 1,
          "replies": [
            {
              "id": "lfznnn2",
              "score": 13,
              "body": "Got killed by temu I think.",
              "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfznnn2/",
              "created": 1722526589,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lfzxe8l",
          "score": 5,
          "body": "Bob's discount furniture IS wayfair furniture. A different name and different label is all it is. That's the problem. Unless you go local builders, every furniture store is absolute shit.",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzxe8l/",
          "created": 1722529678,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfzggxn",
          "score": 5,
          "body": "I’ve gotten on great pieces of Wayfair but they are also pricey",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzggxn/",
          "created": 1722524274,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lg11jyc",
          "score": 2,
          "body": "I purchased a tv stand from them and unfortunately it was the worst shopping experience of my life. \n\nIt was a solid wood, assemble at home kit. First arrived, wrong finish stain, sent back. Second arrived damaged from carrier, not their fault. Shipped it back. The third one arrives great but the quality control was terrible, stain on wood doors was terrible and it would’ve needed refinished. I ask if they can just send the door as it’s the only piece we’re the finish it messed up. Nope gotta send an 4th and sacrifice ann entire tv set to replace the door. 4th arrives and the wood door had a manufacturing flaw where one door was cut about an inch shorter that the other. It was a mess, and having to return the set each time wasn’t easy as it was a two person job to move the box. But all the time and effort involved to contact, ship and return everything probably cost them three times what they sold the tv stand for. So yeah, it may be a little more than just the market.",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg11jyc/",
          "created": 1722542216,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfzpd72",
          "score": 2,
          "body": "If only we knew someone that *loved* couches....",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzpd72/",
          "created": 1722527129,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lg8mer5",
          "score": 1,
          "body": "Why was my comment [ Removed by Reddit ]…?",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg8mer5/",
          "created": 1722650733,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfz458w",
      "score": 60,
      "body": "Its funny because the credit card data at the credit card companies say the opposite… could this just be because Wayfair is a terribly run company with overpriced goods?",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfz458w/",
      "created": 1722520094,
      "depth": 0,
      "replies": [
        {
          "id": "lfzk6cd",
          "score": 11,
          "body": "No... it's everyone else that's wrong!",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzk6cd/",
          "created": 1722525480,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfzl0ec",
          "score": 2,
          "body": "Where are you sourcing this data? Capital one recently just announced their major loss in revenue due to loans not being able to be paid back",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzl0ec/",
          "created": 1722525745,
          "depth": 1,
          "replies": [
            {
              "id": "lfzt7sv",
              "score": 2,
              "body": "Mastercard reported yesterday of solid consumer spending.",
              "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzt7sv/",
              "created": 1722528352,
              "depth": 2,
              "replies": [
                {
                  "id": "lfzvr1x",
                  "score": 2,
                  "body": "From who though. Are rich folks just spending more because the stock market is up, or are normal people having to use credit cards for groceries now",
                  "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzvr1x/",
                  "created": 1722529160,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lg08qq1",
                  "score": 1,
                  "body": "Mastercard isn't lending, they are a payment network like Visa. Credit Card companies like Mastercard charge fees for transactions to vendors. So its quite possible for their revenue to move differently than the lenders.",
                  "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg08qq1/",
                  "created": 1722533217,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lg0eat5",
                      "score": 2,
                      "body": "They still know how much is being spent and on what",
                      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg0eat5/",
                      "created": 1722534946,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lfz5xyk",
      "score": 23,
      "body": "If we can't buy a house, then we won't be buying any furniture.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfz5xyk/",
      "created": 1722520731,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzhvh8",
      "score": 20,
      "body": "Absolute garbage tier furniture is why. And we had so much stuff arrive broken in the box we said we'd never do business with them again, they made replacements a hassle and then the replacements arrived broken",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzhvh8/",
      "created": 1722524735,
      "depth": 0,
      "replies": [
        {
          "id": "lg00zrw",
          "score": 2,
          "body": "How does IKEA make better furniture? I don't know, but somehow ikea manages to make stuff fit and close reliably well. Whereas Wayfair is just... meh. Stuff arrives missing, furniture sags with time, drawers don't close the same way any more, questionable design choices, the list goes on.",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg00zrw/",
          "created": 1722530807,
          "depth": 1,
          "replies": [
            {
              "id": "lg03edk",
              "score": 4,
              "body": "This is so true too. Ikea is the goat of cheap furniture that lasts, I have a ton of it in my office and all of it has been amazing value",
              "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg03edk/",
              "created": 1722531546,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lg05jis",
              "score": 3,
              "body": "I have opposite experience. IKEA furniture are way overpriced for their quality. Your issues above are exactly what I got with my very limited purchases from IKEA. And they charge a ton for delivery, so you are putting more efforts in picking up large furniture while also paying more.\n\nWayfair remains a better choice to me.",
              "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg05jis/",
              "created": 1722532223,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lfza69g",
      "score": 41,
      "body": "Or Amazon is just dominating it all",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfza69g/",
      "created": 1722522201,
      "depth": 0,
      "replies": [
        {
          "id": "lfzqb2x",
          "score": 8,
          "body": "During the pandemic people purchased a lot of home goods as people were working from home. I don't think Amazon does any better in this segment.",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzqb2x/",
          "created": 1722527427,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfzkr39",
          "score": 10,
          "body": "Nope, must be a global financial collapse that we’ve only seen 1-2 times ever before, not a sub-par business model failing which we see daily. /s",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzkr39/",
          "created": 1722525663,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lfzrmgf",
          "score": 2,
          "body": "And/or people spent a ton on goods for the home during the pandemic and are now redirecting spending to travel and other categories",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzrmgf/",
          "created": 1722527846,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfzd0t7",
      "score": 26,
      "body": "Screw the CEO of Wayfair. He's scum. Didn't he do a mass layoff recently? Hoping they go bankrupt soon.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzd0t7/",
      "created": 1722523155,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzk5p2",
      "score": 9,
      "body": "I was searching for a console table on wayfair. I sorted from high to low and saw the exact same console table being sold by 15 different “companies” with a $200 price difference. Never again.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzk5p2/",
      "created": 1722525474,
      "depth": 0,
      "replies": [
        {
          "id": "lg07seu",
          "score": 2,
          "body": "From my experience, they are of very similar designs, not exact model. You may find them manufactured by different vendors, with different sizes. \n\nEven on IKEA, you also have the same thing: almost exact design but actually different products. Prices are different too. I would say that you also have the same issue when browsing on Amazon. It pays to be diligent before buying.",
          "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg07seu/",
          "created": 1722532923,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lfzi757",
      "score": 7,
      "body": "Maybe because wayfair sells crap?",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzi757/",
      "created": 1722524843,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzf1oi",
      "score": 6,
      "body": "His quote isn’t as bad as the headline makes it seem. I do not like the company at all but he’s rightly describing a dramatic category correction from the artificial COVID WFH peak.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzf1oi/",
      "created": 1722523812,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzjrl5",
      "score": 4,
      "body": "I don’t really get what advantage this company has over a company like Amazon, why would I invest in Wayfair? What’s their competitive advantage?",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzjrl5/",
      "created": 1722525349,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzk2dw",
      "score": 7,
      "body": "https://tradingeconomics.com/united-states/existing-home-sales\n\nHome sales are down, people tend to buy furniture when they move. And as many people here have noted, Wayfair's product is crap.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzk2dw/",
      "created": 1722525445,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfznpbk",
      "score": 5,
      "body": "Their business model is destined to fail when they sell the same funitures as Amazon for higher price, longer shipping and insanely expensive return fee.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfznpbk/",
      "created": 1722526604,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzrkui",
      "score": 5,
      "body": "I ordered a computer desk from wayfair. The top portion was completely stained like they spilled oil all over it. Never again 🤷‍♂️",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzrkui/",
      "created": 1722527833,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg0jt3g",
      "score": 3,
      "body": "Quality of their stuff is straight trash. Also priced FAR too high for the garbage quality of their products.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg0jt3g/",
      "created": 1722536641,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzgkdt",
      "score": 2,
      "body": "Overpriced chinese furnitures.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzgkdt/",
      "created": 1722524305,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfznqh2",
      "score": 2,
      "body": "I bought from wayfair once for two pieces of very decent looking bathroom furniture that turned out to be cheap floppy rubbish. After building the 1st cabinet, I didn't even bother opening the second.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfznqh2/",
      "created": 1722526615,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzrg4w",
      "score": 2,
      "body": "No, they sell cheap shit from random name generated chinese companies like amazon does. I don't buy from them anymore everything is always damaged in shipping that takes weeks to arrive. The people that run that company are delusional.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzrg4w/",
      "created": 1722527793,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzu1vn",
      "score": 2,
      "body": "My wife ordered from Wayfair during the pandemic, when she wouldn't go to a store. I'd like to hear an industry analyst discuss how Wayfair's competitors are doing before I draw conclusions about consumer spending.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzu1vn/",
      "created": 1722528618,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg0nv2z",
      "score": 2,
      "body": "To expensive low quality junk that often does not fit together.  We bought a child size table set with 2 chairs.  The table bolts barley fit the pieces together, it’s off balanced, and the screws come loose monthly.  Both chairs were unable to be assembled due to incorrect placement of drilled holes.  We spent $400 cdn on a pile of fire wood.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg0nv2z/",
      "created": 1722537899,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg2adlx",
      "score": 2,
      "body": "I’m not completely disregarding what he is saying about the economy but in the case of Wayfair in specific the company is just not performing well and going from bad to worse in terms of inventory quality, damaged shipments and customer service. He’s incentivized to blame it on the broader economy",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg2adlx/",
      "created": 1722557509,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg3ewhd",
      "score": 2,
      "body": "It's as shitified as Etsy right now, but furniture version",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg3ewhd/",
      "created": 1722574729,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg0y03b",
      "score": 2,
      "body": "The same CEO that said his employees need to not have lives, not work remote and live at the office and blamed them for the company's previous poor performance.   \nNow he's blaming the 2008 crisis, which happened 16 years ago.  \nMy guess is next quarter he'll blame COVID (or maybe the 1987 market crash, who knows).",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg0y03b/",
      "created": 1722541135,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzsvo6",
      "score": 1,
      "body": "Having to pay shipping back for product that does not meet standards is a failing business model. Amazon far outpaces customer service compared to Wayfair and that's saying something.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzsvo6/",
      "created": 1722528244,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzywdc",
      "score": 1,
      "body": "Time to sink or swim. No more free money.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzywdc/",
      "created": 1722530152,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg001fp",
      "score": 1,
      "body": "Whole market is down",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg001fp/",
      "created": 1722530511,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg0hocl",
      "score": 1,
      "body": "I dont understand why people even buy from wayfair. they have cheap shit at heavy prices.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg0hocl/",
      "created": 1722535987,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg22nb4",
      "score": 1,
      "body": "Well I just bought sheets from them so that ought to tide them over until next quarter.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg22nb4/",
      "created": 1722554625,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg4fgxe",
      "score": 1,
      "body": "I don't like wayfair,   \nthey didn't do price match when they gave discount on the item I just bought",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg4fgxe/",
      "created": 1722597291,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgfman8",
      "score": 1,
      "body": "CEO just making excuses for poor operational leadership.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lgfman8/",
      "created": 1722767585,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzn0yp",
      "score": 1,
      "body": "You're not supposed to say it out loud...\n\n\nAlso improve the products on there ffs",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzn0yp/",
      "created": 1722526390,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzovnx",
      "score": 1,
      "body": "No. This is not 2008, what a ridiculous thing to say. I'm sure it's hard to sell furniture when you can't offer 0% interest rates.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzovnx/",
      "created": 1722526976,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg23kth",
      "score": 1,
      "body": "This guy is a clown - WSM is up over 100% the past year. Wayfair just sucks.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg23kth/",
      "created": 1722554973,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzkzgl",
      "score": 0,
      "body": "The company buys credit card data for the home furnishings vertical which indicates that there is a slowdown for all in the sector. Market share data also shows them gaining on competitors. They are also offshoring massively with a new office in India. Unfortunately their German operations seem to be unprofitable and market share is difficult to grab there due to a lack of physical stores; that’s because German consumers tend to expect to buy furniture they have seen.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzkzgl/",
      "created": 1722525736,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lfzeq3h",
      "score": 0,
      "body": "Am I the only one that misread it as Waystar?",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lfzeq3h/",
      "created": 1722523710,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg10ci0",
      "score": 0,
      "body": "When people barely have enough food to pay rent and buy groceries each month, it's no sh*t that they don't have enough money to buy overpriced rugs. \n\nI run a rug resale business and I would never in a million years buy anything from Wayfair. Amazon does everything far better.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg10ci0/",
      "created": 1722541850,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg2k1iq",
      "score": 0,
      "body": "The ceo knows the old trick to blame the economy and not their strategies failing. Same with McDonald. Competition is just much better and people are buying less from certain brands.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg2k1iq/",
      "created": 1722561187,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg5lc95",
      "score": 0,
      "body": "Lost a chunk of my ass when I shorted them early on in the pandemic. They had bounced from $20 to $80 so I shorted and covered at $200. Still eats at me. For that I'd like to see them go to zero. If I'd had diamond hands to hold the short position for another year or so I would've been ok.\n\nI wasn't wrong. I was just early.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg5lc95/",
      "created": 1722613018,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg80ecc",
      "score": 0,
      "body": "Good. Never liked that company.",
      "permalink": "/r/stocks/comments/1ehgy2n/wayfair_shares_sink_as_ceo_likens_home_goods/lg80ecc/",
      "created": 1722641962,
      "depth": 0,
      "replies": []
    }
  ]
}