{
  "title": "Investing in Corsair Gaming, Inc. (CRSR) slowly becoming a disaster, what does the future for this company hold? ",
  "score": 53,
  "selftext": "So a year ago Corsair was a strong buy, going for around 18 dollars a stock, a solid board on the company gave trust and promised a bright future. The decline of sales after COVID-19 ended has been catastrophic for the company and it seems that PC gaming is slowly declining as well or why otherwise this huge dip on stock.\n\nTo give you a summary of last nights earnings:\n\n**Second Quarter 2024 Select Financial Metrics**\n\n* Net revenue was $261.3 million compared to $325.4 million in the second quarter of 2023, a decrease of 19.7%. Gaming Components and Systems segment net revenue was $167.1 million compared to $246.7 million in the second quarter of 2023, while Gamer and Creator Peripherals segment net revenue was $94.2 million compared to $78.8 million in the second quarter of 2023.\n* Net loss attributable to common shareholders was $29.6 million, or a net loss of $0.28 per diluted share, compared to net income of $1.1 million, or a net income of $0.01 per diluted share, in the second quarter of 2023.\n* Adjusted net loss was $6.8 million, or an adjusted net loss of $0.07 per diluted share, compared to adjusted net income of $9.8 million, or an adjusted net income of $0.09 per diluted share, in the second quarter of 2023.\n* Adjusted EBITDA was a loss of $1.2 million, compared to adjusted EBITDA of $17.8 million in the second quarter of 2023.\n* Cash and restricted cash was $94.6 million as of June 30, 2024.\n\n# Corsair Gaming, Inc. Corsair Gaming, Inc. (CRSR)\n\n  \nStock price currently: 7.89\n\n7.89-0.32(-3.90%)At close: August 1 at 4:00 PM EDT  \n  \nDropping further:  \n7.62-0.27(-3.42%)After hours: 7:49 PM EDT(CRSR)\n\nWhat are your thoughts for this stock? I personally lost quite some money on this but still holding my shares.",
  "link_flair_text": null,
  "id": "1ei3yt8",
  "num_comments": 30,
  "created_utc": 1722583631,
  "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/",
  "comments": [
    {
      "id": "lg3x9rf",
      "score": 101,
      "body": "You reminded me there was a time, 3 yrs ago, when this sub promoted this stock and downvoted the naysayers.\n\nThey IPOed at the right time, when the world was stay at home, and is just one of the many stocks that was lifted during an extraordinary point in history.\n\nThe same thing is happening with DELL today, they benefitted from stay at home, and benefit from AI buildout today, but they haven't done anything special.\n\nIt's better to invest in companies that grow revenues by their own merit, and not by extraordinary external events.",
      "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg3x9rf/",
      "created": 1722585921,
      "depth": 0,
      "replies": [
        {
          "id": "lg3zr4e",
          "score": 10,
          "body": "Ah that was peak stay at home investing. I mean I like some Corsair products but the valuation was nuts. Still good money to be made but as a long term hold it made little sense. Though I imagine people say the same on other tech that’s going through the roof.",
          "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg3zr4e/",
          "created": 1722587564,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lg45gds",
      "score": 42,
      "body": "As a long time pc gamer, this was a hard pass for me when it ipo’ed. The bulk of the business is components which is very competitive and low margin. They’ve made progress in peripherals but their market is niche mostly gamers and streamers. Compare that to Logitech which does peripherals for that market AND office, work from home, travel.\n\nStruck me as a decent company in a bad space. I just don’t see where they can find more customers or sales to start growing again.",
      "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg45gds/",
      "created": 1722591345,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg3vtnx",
      "score": 19,
      "body": "Sell, tax loss harvest, invest in VOO or VT ",
      "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg3vtnx/",
      "created": 1722584961,
      "depth": 0,
      "replies": [
        {
          "id": "lg5p9sj",
          "score": 5,
          "body": "The r/stocks mantra",
          "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg5p9sj/",
          "created": 1722614260,
          "depth": 1,
          "replies": [
            {
              "id": "lg5z26g",
              "score": 1,
              "body": "Oh, for stocks I'd say buy Google, Palantir, SoFi ",
              "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg5z26g/",
              "created": 1722617364,
              "depth": 2,
              "replies": [
                {
                  "id": "lg62ndq",
                  "score": 10,
                  "body": "Inverse this guy",
                  "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg62ndq/",
                  "created": 1722618485,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lg4cag3",
      "score": 13,
      "body": "I’m sorry but a company with slim to no margins and declining revenue in a competitive market will continue to lose. There is no real path for this stock to recover: pc gaming isn’t showing signs of picking up soon, competition like Logitech, razer and gigabyte will continue to put pressure on their margins. \n\n\n\nAlso as a pc gamer I have no loyalty to third party manufacturer, I will go for the best reviewed and cheapest options most of the time. I liked my Corsair components but other companies are just as good or better. As far as their own products, they aren’t as good imo. If I’m paying $100 for a keyboard or $50 for a mouse I won’t be getting another Corsair, they were okay but should be 1/3 the price compared to competitors",
      "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg4cag3/",
      "created": 1722595569,
      "depth": 0,
      "replies": [
        {
          "id": "lg65i9f",
          "score": 5,
          "body": "Yeah as a PC gamer myself, I don’t think I’d ever invest an a peripherals company as it’s 100% a fad kind of market. Wooting is the KB company of the now but I’m sure they’ll fade off in popularity soon. Way too many cooks in that kitchen with razor (pun not intended) thin margins",
          "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg65i9f/",
          "created": 1722619383,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lg4ekw3",
      "score": 6,
      "body": "Corsair are fine but their peripherals and components are no better than anyone else's. They've only just done link fans which Lian li have been doing for years. Logitech tend to beat them on peripherals. They don't innovate. As an avid pc builder and fan of this sector, I'd never invest in them and think they're going to beat the SP500. Pc building is cyclical, along with COVID and WFH the 30 series and equivalent AMD gpus increased pc building fervour, but its likely going to be a few years before another wave like that, if at all given the catalysts at the time.\n\nCorsair are in every pc space near enough but don't excel in any of them. For me, I'd either treat as a long term hold and DCA, or wait for an increase in market sentiment to bring them a bit higher and cut losses and treat as a lesson. Basically the whole market is down at the moment in tech so wouldn't sell at the moment.",
      "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg4ekw3/",
      "created": 1722596829,
      "depth": 0,
      "replies": [
        {
          "id": "lg4k8rv",
          "score": 2,
          "body": "I have a Corsair AIO cooler but there are too many competitors in the other spaces such as power supplies, cases and peripherals. They make some good stuff but companies like Lian Li, Thermaltake and others are biting at their heels.",
          "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg4k8rv/",
          "created": 1722599615,
          "depth": 1,
          "replies": [
            {
              "id": "lg4l839",
              "score": 1,
              "body": "I have a Corsair AIO but arctic liquid freeze line (I think that's the name?) has them on performance, and I have QL fans but the LEDs keep busting so wouldn't buy them again. They don't lead in any space, it's just personal preference on if you use them or a competitor. Perfectly serviceable in most areas but not a company I'd expect growth from. Personally think they'll stagnate in price now without a catalyst from them to become leading in a desired area prompting sales increase.",
              "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg4l839/",
              "created": 1722600061,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lg49kbl",
      "score": 6,
      "body": "I'm sorry that you are down on it.\n\nThat said, like others have noted you had a situation a few years ago where everyone was at home and that pulled forward what growth this had.  Beyond that though, it makes gaming accessories - there's no moat. I don't know where this gets to being cheap/overhated but in any case it's just not a good business imo.",
      "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg49kbl/",
      "created": 1722593953,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg5p4h4",
      "score": 3,
      "body": "Cut your losses",
      "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg5p4h4/",
      "created": 1722614212,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg486j6",
      "score": 2,
      "body": "Endor.ag came as a steal.\n\nhttps://www.reddit.com/r/RossRiskAcademia/s/aH7DxThXgH\n\nIm long Corsair. Fanatec owns 1/3rd of the market.",
      "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg486j6/",
      "created": 1722593092,
      "depth": 0,
      "replies": [
        {
          "id": "lg4hhzh",
          "score": 1,
          "body": "Aren’t people having a meltdown over at r/simracing? \n\nWhat happens to Fanatec support?",
          "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg4hhzh/",
          "created": 1722598312,
          "depth": 1,
          "replies": [
            {
              "id": "lg4mbgo",
              "score": 1,
              "body": "Only better. Fanatec simulators are found at every FIA F1/WRC event. They also have their special simulator vans build for it.",
              "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg4mbgo/",
              "created": 1722600551,
              "depth": 2,
              "replies": [
                {
                  "id": "lg4mfze",
                  "score": 1,
                  "body": "It had debt due to shortages of chips; and was too microo.. hence Corsair picked up from nickel and and a dime",
                  "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg4mfze/",
                  "created": 1722600607,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lg4mwu7",
              "score": 1,
              "body": "https://www.reddit.com/r/ValueInvesting/s/YokYZhUTws\n\nThose machines quite literally stand there in a billion dollar industry",
              "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg4mwu7/",
              "created": 1722600815,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lg4st3d",
      "score": 2,
      "body": "I was in on CRSR for years after their IPO. It’s not worth it, they’re never going anywhere. Many, many better stocks out there.",
      "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg4st3d/",
      "created": 1722603247,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg6gn7p",
      "score": 2,
      "body": "YouTube Influencer stock.",
      "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg6gn7p/",
      "created": 1722622897,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg4xy6u",
      "score": 1,
      "body": "can't believe I sold that shit at $36. not touching it again.",
      "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg4xy6u/",
      "created": 1722605194,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg5fcg8",
      "score": 1,
      "body": "It's not a good company. It's a mostly commoditzed product and streamers are mostly going to be forced to get real jobs if shit hits the fan. Really bad in a recession since everyone will just use what gear they have.\n\n  \nIf anything its a short here.",
      "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg5fcg8/",
      "created": 1722611096,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg98yhh",
      "score": 1,
      "body": "Ok, I have to ask you. Have you played or used their equipment? I invested in Corsair in the past and I sold, but I sold because their equipment is average.\n\nIt’s not the best, but it’s not terrible. I have used their keyboards, I have a Corsair case for my pc, and I have dabbled a bit with their mice. I even used their ram for my previous pc. I even have a Corsair mouse pad that is their best product to date that I have purchased besides the ram.\n\nNearly all their products serve their purpose but the aren’t known for their quality and gamers will gravitate towards more expensive or higher quality products after they become more experienced in understanding the market.\n\nCorsair products are for first time pc gamers that are trying to stay within budget but still put out a product that “feels” like a device for a gamer. \n\nAnd as you examine the peripheral market you will find…Razer, Logitech, Zowie, Glorious O and others put out a superior product.\n\nI use to not be a razer guy but their products are much higher quality - but a higher price point. Though I think Logitech and Razer are beginning to recognize that budget products have a market.\n\nPoint is that Corsair sort of like eating a Big Mac when one could go to Five Guys or In and Out or a Gourmet Burger place. It does the job in satisfying your appetite, but leaves a lot to be desired.\n\nCorsair has not figured out their market, they are just trying to capture “all” the gamers as a whole and this is why they did well financially with the gamer boom and are now struggling a bit.\n\nYou should have sold two years ago because this company still has no clear plan forward.",
      "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg98yhh/",
      "created": 1722661330,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg9ubhw",
      "score": 1,
      "body": "I wouldn't invest into any company that sells \"gaming\" equipment. People are starting to wake up and figure out, that this \"gaming\" equipment is overpriced trash. My keychron k8 pro is better than every keyboard they have for half the price.",
      "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lg9ubhw/",
      "created": 1722674707,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgbbozb",
      "score": 1,
      "body": "i dunno why this sub was so high on them, pc market is huge and crsr is just a small fry",
      "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lgbbozb/",
      "created": 1722700121,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lmm1p7f",
      "score": 1,
      "body": "Can we talk about why the heck Fanatec believes they can save Corsair?\n\n They are exclusively racing. -No hate to racing but why does Fanatec limit themselves to just one kind of technology. Their knowledge seems extensive, I would like to seem Fanatec branch out into other sectors so the knowledge isn't wasted. FPS devices could get better, I remember when the wii made these guns that you fit the remote into, Squads the pc game could be targeted for this because it's the most realistic roleplay military sim game. Anyways they could make their own line of weapons that had sensors for something on your tv. IDK, it would be cool to get into talks. Also 2026 when gta drops. I could see people buying fanatec racing car simulators and weapons to freaking hold, Anyways, Corsair seems really discounted rn but personally I wouldn't feel safe about it. It sucks because I really like corsair and even bought some of their equipment including but not limited to, my pc case.",
      "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lmm1p7f/",
      "created": 1726066163,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lp32zev",
      "score": 1,
      "body": "i should cut loss also, just fomo at that time",
      "permalink": "/r/stocks/comments/1ei3yt8/investing_in_corsair_gaming_inc_crsr_slowly/lp32zev/",
      "created": 1727385480,
      "depth": 0,
      "replies": []
    }
  ]
}