{
  "title": "Japan's Nikkei 255 plunges by nearly 6% in biggest drop since start of pandemic",
  "score": 115,
  "selftext": "[From CNN:](https://edition.cnn.com/2024/08/02/business/japan-nikkei-225-rates-investors-intl-hnk/index.html)\n\nJapanese stocks plunged Friday as global markets were rattled by worries about the US economy and as traders braced for further interest rate hikes from the Bank of Japan.\n\nThe Nikkei 225 ended 5.8% lower, the index’s biggest daily drop since March 2020. It extended a global stock rout that began following the release of weak US economic data. The Japanese benchmark had already lost 2.5% Thursday and has now closed at its lowest level since January.\n\nEuropean markets also opened lower Friday. The benchmark Stoxx Europe 600 index was down 1.4%. Germany’s DAX and France’s CAC 40 were down 1.2% and 0.6% respectively. London’s bank-heavy FTSE 100 was 0.4% lower. US futures were indicating another weak open for Wall Street, with S&P 500 future down 0.9%.\n\nOn Wednesday, the Bank of Japan (BOJ) raised interest rates by 15 basis points to 0.25% in its second hike this year and announced plans to taper its bond buying. Traders expect more rate hikes to come later this year as the central bank tries to contain inflation.\n\n“The BOJ made a hawkish shift after its surprising 15 (basis point) rate hike,” said Ken Cheung, director of foreign exchange strategy at Mizuho Securities. “Importantly, the BOJ flagged the inflation upside risks … and left the door open for further rate hikes. ”\n\nThe hike has narrowed the difference in interest rates between the United States and Japan, which pushed the Japanese yen higher against the greenback. The dollar has fallen by more than 4% against the Japanese currency since the middle of last month.\n\nOn Friday, it weakened further against the yen, down 0.3% to 148.9.\n\nA pedestrian walks past the Bank of Japan building in Tokyo.\nRelated article\nJapan brings era of negative interest rates to an end with first hike in 17 years\n“The risk of rising yen volatility threatens the decade-long bull market of Japanese equities,” Frank Benzimra, head of Asia equity strategy at Societe Generale, said in a research note on Thursday. He added that a rapid appreciation of the currency would hit profits at the country’s exporters.\n\nThe yen has broadly weakened over the past four years. It was down 40% against the US dollar and down 30% against the euro during that period.\n\nCombined with strong corporate earnings and effective corporate governance reforms, the weak yen propelled the Nikkei 225 to all-time highs this year.\n\nBut as the yen strengthened over the past three weeks, Japanese equities have corrected. The Nikkei is down 12% since July 12.\n\n“From a Japanese equity perspective, the earnings boost from a weak yen is set to diminish,” Citi analysts said on Thursday. But they remained positive about Japanese stocks in the long run, as inflation is gaining traction and a positive “wage-price spiral” is strengthening in the economy.\n\nThe hope is that rising wages and prices can help the country shake off years of economic weakness.\n\nElsewhere in Asia, markets tumbled across the board on Friday. South Korea’s Kospi declined 3.7%. Australia’s S&P/ASX 200 dropped 2.1%. Hong Kong’s Hang Seng Index also lost 2.1%, and China’s Shanghai Composite was down 0.9%.",
  "link_flair_text": "Broad market news",
  "id": "1ei9gni",
  "num_comments": 7,
  "created_utc": 1722603647,
  "permalink": "/r/stocks/comments/1ei9gni/japans_nikkei_255_plunges_by_nearly_6_in_biggest/",
  "comments": [
    {
      "id": "lg5alux",
      "score": 43,
      "body": "Is there a general correction across all markets right now? Everything seems to be getting beat up this week.",
      "permalink": "/r/stocks/comments/1ei9gni/japans_nikkei_255_plunges_by_nearly_6_in_biggest/lg5alux/",
      "created": 1722609554,
      "depth": 0,
      "replies": [
        {
          "id": "lg5azey",
          "score": 20,
          "body": "It's the whole market, no need to panic.",
          "permalink": "/r/stocks/comments/1ei9gni/japans_nikkei_255_plunges_by_nearly_6_in_biggest/lg5azey/",
          "created": 1722609675,
          "depth": 1,
          "replies": [
            {
              "id": "lg5bi47",
              "score": 2,
              "body": "I'm not, I just went on a shopping spree. I'm curious why everything is correcting, did I miss some major news?",
              "permalink": "/r/stocks/comments/1ei9gni/japans_nikkei_255_plunges_by_nearly_6_in_biggest/lg5bi47/",
              "created": 1722609843,
              "depth": 2,
              "replies": [
                {
                  "id": "lg5bz2v",
                  "score": 17,
                  "body": "U.S economy might enter a recession, FED didn't lower rates this week, the market wants lower rates, and probably not only .25 but .50 in september. Just need to cool down, the market is sending a message to FED.",
                  "permalink": "/r/stocks/comments/1ei9gni/japans_nikkei_255_plunges_by_nearly_6_in_biggest/lg5bz2v/",
                  "created": 1722609996,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgbc0qs",
                      "score": 1,
                      "body": "Also the Japanese Yen is skyrocketing due to an expected FED rate cut and a BOJ rate increase that went through days ago. The yen carry trade is now hurting traders so some of the selling pressure is traders trying to get capital to cover their positions.",
                      "permalink": "/r/stocks/comments/1ei9gni/japans_nikkei_255_plunges_by_nearly_6_in_biggest/lgbc0qs/",
                      "created": 1722700232,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lg9cz8x",
      "score": 3,
      "body": "The rally in JPY! Everyone and their aunt was long Nikkei / short JPY",
      "permalink": "/r/stocks/comments/1ei9gni/japans_nikkei_255_plunges_by_nearly_6_in_biggest/lg9cz8x/",
      "created": 1722663626,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lg51qoq",
      "score": 4,
      "body": "They got a great run this year. Let they run for a while and it will rise again",
      "permalink": "/r/stocks/comments/1ei9gni/japans_nikkei_255_plunges_by_nearly_6_in_biggest/lg51qoq/",
      "created": 1722606557,
      "depth": 0,
      "replies": []
    }
  ]
}