{
  "title": "$INTC - A dumb person's retrospective",
  "score": 61,
  "selftext": "I'm lazy and you regards don't like to read so I'll leave it to bullet points and you can piece them together.\n\n1. Intel was seen as a bargain in 2023 compared to NVDA and AMD after their 400% run up.\n\n2. US gov have vested interest in Intel. No they are not propping Intel up, but it's effectively giving Intel a big loan to buy a second house. That loan can pay off if the housing market goes up, or they are double fucked because they leveraged to buy a second house.\n\n3. If you bought Intel because china will invade Taiwan, you are really regarded. If China invades Taiwan, everything is going to sell. That's a disruption of global trade on WW2 levels. Your best case scenario still loses you money.\n\n4. Intel bullish scenario is 18A, High-Na EUV paying dividends, early experience granting them a year technological lead over TSMC. It doesn't have to work, but the upside is a 10x from these levels. TSMC pass up High NA EUV is repeating the same decision Intel did in 2012 when Intel controlled the market and did not view EUV as economically feasible. Again, doesn't mean TSMC is incorrect in their assessment, but history does repeat itself.\n\n5. Intel bearish scenario is just repeat of 2016 and delay after delay. In which case they head to legacy company status like Ford. Anyone else remember all the Ford bulls in 2016? They're not on this sub anymore because they all went broke.\n\n6. I'm no crayon guy. But everyone can see that $30 was a magic line, and drastically going below it to $21 is a market signal that the company is now viewed fundamentally differently. Yes it can go lower, especially the general market trends change we see this week. \n\n7. AMD spent from 2008 to 2016 an absolute garbage penny stock. You WSBers nowadays don't even know how ridiculed you were for even considering AMD. 2015 to 2017 were peak AMD years on this sub when regards jumped the gun, bought calls because MUH mindfactory data and muh 1% min benchmarks losing them everything over and over again. You kids don't even know struggle. Struggle is putting your 1k paycheck on AMD calls every week thinking this week you will hit. Just to watch Toshiya Hari from Goldman Sachs dropping a $12 PT downgrade on you when the stock turns even a little bullish. The investment only somewhat paid off in 2018 when AMD traded to 30, but then half the regards lost everything (myself included) when it crashed to 18 in 2 months following Powell's rate hike.\n\n8. Look how quickly sentiment changed for AMD from 2018. This very well could be history repeating itself, as the semiconductor companies have demonstrated over and over again. Intel 18A is a repeat situation of AMD ZEN. The upside cannot be understated.\n\n8. I'm still bullish. Proper execution can bring the company to a $200+ stock. I bought and sold Intel throughout the year. 8000 shares from 35 to 50, sold at 43, bought at 35, sold at 30 before earnings. I was up 130k, lost 100k of it. Bought 2500 shares at 21.30. I think it can go lower in the short term, wouldn't be surprised for it to momentarily touch below 20.",
  "link_flair_text": "Discussion",
  "id": "1ej04ru",
  "num_comments": 74,
  "created_utc": 1722680988,
  "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/",
  "comments": [
    {
      "id": "lga3jts",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 7 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 836 | **Previous Best DD** | \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lga3jts/",
      "created": 1722680992,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lga5twz",
      "score": 70,
      "body": "$200 lmao. \n\nWhat century are we pricing that in for? ",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lga5twz/",
      "created": 1722682444,
      "depth": 0,
      "replies": [
        {
          "id": "lgaibu7",
          "score": 49,
          "body": "After a 200 to 1 reverse split",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgaibu7/",
          "created": 1722689009,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgabkwx",
          "score": 6,
          "body": "2100",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgabkwx/",
          "created": 1722685696,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgac7be",
          "score": 3,
          "body": "Their delusion of universe ![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgac7be/",
          "created": 1722686020,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lga8ra9",
      "score": 19,
      "body": "Yes but would you put 400k of GRANDMAS money on it ?!!    That would be regarded...     he gonna get wrecked",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lga8ra9/",
      "created": 1722684154,
      "depth": 0,
      "replies": [
        {
          "id": "lgacm8b",
          "score": 17,
          "body": "It was 700, now like 400",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgacm8b/",
          "created": 1722686231,
          "depth": 1,
          "replies": [
            {
              "id": "lgaghe8",
              "score": 4,
              "body": "I thought it was $800k and was before the previous earnings at around $45/share. ",
              "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgaghe8/",
              "created": 1722688135,
              "depth": 2,
              "replies": [
                {
                  "id": "lgahvxy",
                  "score": 10,
                  "body": "He put $100k in a HYSA, his only good move.",
                  "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgahvxy/",
                  "created": 1722688804,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lga95oy",
      "score": 28,
      "body": "1. Intel had execution problems since 2020, there’s a reason why the ex CEO of VMware is there now \n\n2. Do they? What if they want Intel to become a TSMC like company and ditch the CPU business? We are talking about politics here and politics is the antonym of logic \n\n3. True\n\n4. Or TSMC knows something that Intel doesn’t. If you’re so vested in the underlying technology just buy ASML\n\n5. People are bearish because the way to recovery for Intel is long and hard. They already wasted 6 years. \n\n6. The last line is always $0, bigger companies have reached it before. Telling yourself otherwise is lying to yourself.\n\n7. Yes and AMD completely reinvented themselves with Lisa Su at the helm. Sure they are far away from AI but maybe that’s a better strategy. AMD today dominates the x86 market and everything they do from consumer relations to media coverage is in their favour. Objectively speaking AMD is a great long position. \n\n8. What history? AMD fought hard to reestablish themselves on the market. Intel is just beginning that journey and they should have started it in 2019 not now. Go see the consumer subs here like r/pcmasterrace - people love AMD and hate Intel. \n\n9. It’s your money, and you can win if Intel actually realises that they are in big trouble. Objectively however you are gambling not investing.",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lga95oy/",
      "created": 1722684381,
      "depth": 0,
      "replies": [
        {
          "id": "lgalkls",
          "score": 10,
          "body": "1. Intel went from dominating 99% of the PC market to only having 80% of the market. It will stay this way because AMD is supply constrained.\n\n2. EVEN If Intel is only the fab business, being #1 or a close #2 would make it a higher valued stock. \n\n3. ...\n\n4. POV: It's 2014, Intel does not commit to EUV. Le smart redditor says obviously Intel clearly knows something TSMC doesn't. \n\n5. POV: It's 2014, le redditor says AMD stock has done nothing for 20 years. It's therefore a bad company.\n\n6. You didn't even respond to my point, I said falling below 30 is a major signal from the market because the market had been historically comfortable with 30. Stock price up to a certain point is totally arbitrary. Everything determined by \"multiples\".\n\n7. Lisa entered AMD in 2014. Look at the stock price from 2014 to 2018. It ate shit for 4 years.\n\n8. You must have built your first PC in the last 3 years. Because Intel just beginning on their journey is pure fanfic lmao. Up until 2020 no serious gamer had a Ryzen PC. /r/pcmasterrace as a source is fkin dumb im sorry. They were AMD biased since ZEN 1, when it was clearly the inferior product.\n\n9. Intel realized it was in trouble since 2020. That's why they brought in Pat Gelsinger.",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgalkls/",
          "created": 1722690449,
          "depth": 1,
          "replies": [
            {
              "id": "lge7oyt",
              "score": 1,
              "body": "This is a very tough situation for Intel. They basically got hit with a perfect storm in their weakest time while everyone is at their strongest and poked a hole in their boat. Given the situation, investing at Intel now is possibly riskier than investing in AMD at ATH and would take some balls to take the risk and also a bit of madness.",
              "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lge7oyt/",
              "created": 1722738181,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgbyf6f",
              "score": 1,
              "body": "Bro",
              "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgbyf6f/",
              "created": 1722707897,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgavie4",
          "score": 4,
          "body": "Intel is still a very profitable company. And they've already made a lot of good investments that just need time now.",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgavie4/",
          "created": 1722694461,
          "depth": 1,
          "replies": [
            {
              "id": "lgfghp9",
              "score": 1,
              "body": "didn’t they just post a quarterly loss of 1.6bn? how’s that very profitable?",
              "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgfghp9/",
              "created": 1722763583,
              "depth": 2,
              "replies": [
                {
                  "id": "lgfxc6z",
                  "score": 0,
                  "body": "They've spent a ton of money on investments\n\nFor example, Intel has the only High NA EUV machine and that alone costs over $300 million. And they just did massive lay offs which will save them a ton of money.",
                  "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgfxc6z/",
                  "created": 1722773950,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljism5n",
                      "score": 1,
                      "body": "if you have to undergo a “massive layoff” while being in the red, i wouldn’t call that company very profitable. \n\nmoreover, investments are capitalised. meaning they don’t reflect as expenses in the P/L.",
                      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/ljism5n/",
                      "created": 1724407285,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljjyh1e",
                          "score": 0,
                          "body": "Cutting $10 billion in costs is pretty significant",
                          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/ljjyh1e/",
                          "created": 1724424579,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "ljjz3n2",
                          "score": 0,
                          "body": "Do you know what quarterly loss even means?",
                          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/ljjz3n2/",
                          "created": 1724424778,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgag8ii",
      "score": 14,
      "body": "I like how you give all the reasons intel sucks and then finish with BULLISH.\n\nYou’re absolutely right about AMD. I remember it as not much more than a penny stock. But it was a penny stock because it was a shit company back then.\n\nI invested in them long ago and to me all they ever were was the chip version of a utility stock. Yeah, you had your yearly upgrades in chips, but all they ever really did was embed them into Windows machines so with semi-annual upgrades, you get steady business. Nothing they were doing was ever innovative, which is why they have been completely and utterly dominated by everyone over the last decade. Basically IBM for chip manufacturers.\n\nThat was reason enough for me to sell and not regret thinking twice about it and they clearly were never worth any premium being paid for the stock.\n\nBut after a near 30% haircut, INTC at least warrants another look. I doubt I’ll end up there without some clear leadership guidance that isn’t more of the same, but Grandma’s inheritance gots to go somewhere.",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgag8ii/",
      "created": 1722688016,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgah1mf",
      "score": 4,
      "body": "People here talk about Intel or other \"risky\" stocks as if you have to put in huge relative positions to make money.\n\nIf you're risk averse you can always keep it sized to 1-2% of your holdings so if it drops you don't get wiped out.",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgah1mf/",
      "created": 1722688409,
      "depth": 0,
      "replies": [
        {
          "id": "lgdelf5",
          "score": 7,
          "body": "1-2%? We aren't in the Benjamin Grahams Security Analysis course. This is Yolo Land sir. We play with 7/8 of our inheritance here.",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgdelf5/",
          "created": 1722726543,
          "depth": 1,
          "replies": [
            {
              "id": "lghwm99",
              "score": 1,
              "body": "Just to add. 1-2% to invest is for multi billion dollar funds not your robinhood account. Having to diversify makes investing harder not easier idk what people on /r/investing are smoking. Much easier to find 3-4 great companies than 100 (literally impossible). There's a reason why certain funds only accept investments up to a certain dollar amount.",
              "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lghwm99/",
              "created": 1722799784,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgcisx3",
      "score": 4,
      "body": "TL;DR:  This company sucks rancid donkey nuts.  Stay away.\n\nNow.  I first got interested in INTC as a stock in 2011.  I looked at its roadmap.  There were ticks and tocks.  They were to have 16-core, 2nm processors by 2021, running on the power-saving, RISC architecture that was the successor to x86.  Following Moore's Law, they expected their chips to power applications such as natural language processing and autonomous humanoid robot operations.  I remember laughing as the furthest-future announced process node was named Coffee Lake.  \"A lake of coffee,\" I thought.  \"Just what I need!\"\n\nMeanwhile they were going to expand into mobile (phone and laptop), GPU, server, memory (optane), optical couplings, and SoC applications.  They were going to build world-class, cutting edge fabs for all these applications.  The capital expenditure roadmap was all laid out.\n\nIn 2013 I bought a 22nm Ivy Bridge CPU, the 3770K.  4 cores, 8 with hyperthreading.  It was \"overclockable\" and based on the predecessor, the 28nm Sandy Bridge, I had high hopes.  These weren't dashed; the thing ran 3.6 GHz out of the box but people had theirs running up to 5.0 GHz.  I got mine stable at 4.5, but it was generating enough heat that I feared premature degradation of the signal paths so I ran it on 4.4 daily for the next 5 years.  Hyperthreading never was very much of a thing; benchmarks that used it upped the heat output substantially.\n\nA couple years ago, I bought its replacement, a 9700K.  \n\nBy then, mobile, phone, memory and SoC were flashes in the pan that had passed their expiration date; Intel achieved their capital expenditure goals (exceeding them substantially in most cases) but no other part of the programs were successful, and were discarded.   Jury's still out on optical, though the abundance of startups (POET, LITE) suggest they failed to write enough patents; with regard to GPU, Arc lol.  Meanwhile they built the fabs, spending billions, but the fabs didn't reward them with chips; most Intel products for which there is actual demand are now fabbed by TSMC.  Tick-tock had given way to process-architecture-optimization (I think someone might have been banging Ellen PAO;) which quickly gave way to \"I'm not sure what the fuck we're doing,\" although I think they picked a different name for that one.  x86 successor?  Vaporware anyone?\n\nThat 9700K?  8 physical x86 cores, running at 4.9 out of the box.  I went to overclock them and noticed that the chip, supposedly a 14nm node, ran hotter at stock than my 3770K ever did under any stable overclock.  The 9700K would not OC stable at 5.0, meaning that it was out of headroom right out of the box. I examined the chip closely and learned that it had the ability to vary voltages on the fly, something overclockers of yore hadn't been able to leverage; but that that was necessary for it to be stable even at its rated 4.9; it really seemed to offer very little benefit in real world use (heat, power consumption, benchmark, real world) over that old 3770K.  Nothing used the 8 virtual cores, I couldn't even find a benchmark let alone a real world application.  Sure, it was 10% quicker.   5 years and $100B of capex later?  For a 10% bump?  The excess energy must have been transferred to Gordon Moore's angular momentum because bro is surely spinning in his grave.  \n\n\"Oh well,\" I thought.  \"They'll have to innovate now, because they've overclocked their legacy architecture as much as they can; next step is molecular breakdown of the signal paths due to excess heat and amperage, shortening chip life.  No one would sell a chip that did that!\"\n\nHmm.  About that:  [Raptor Lake chips show unusual number of crashes/BSODs](https://www.pcmag.com/explainers/intels-raptor-lake-desktop-cpu-bug-what-to-know-what-to-do-now#) resulting in a need for warranty extension.  INTC just announced they'd replace their overamperaged chips yesterday; previously they'd issued a few statements that boiled down to \"If you're going to overclock one of our chips, which in this case means you ran it at the suggested voltage printed on the box, you're SOL,\" but I guess that got thrown out in yesterday's wash.  Note that in the intervening 5 years since 14nm - when we were supposed to be on 'optimization' of a 2nm node - we are still on 10nm. \n\nSo yeah.  Rancid donkey nuts.  If I needed a lesson on how to piss away $100B, I'd ask Jacob Zuma, not these fuckos.",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgcisx3/",
      "created": 1722715005,
      "depth": 0,
      "replies": [
        {
          "id": "lgciszb",
          "score": 1,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgciszb/",
          "created": 1722715005,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgcrs8t",
          "score": 1,
          "body": "I appreciate your contribution but I ain't reading all that lmfao",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgcrs8t/",
          "created": 1722718136,
          "depth": 1,
          "replies": [
            {
              "id": "lgcs0b5",
              "score": 1,
              "body": "That's why I put a TL;DR!  Cheers",
              "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgcs0b5/",
              "created": 1722718215,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgdu2sq",
      "score": 3,
      "body": "Intel is a horrible, evil and anti-consumer company. I covered every way they fucked consumers to Sunday for over a decade as a tech journalist.\n\nBy investing in Intel you're funding evil and getting fucked over by the same evil you're funding. They will continue to destroy wealth because they were and continue to be arrogant assholes.\n\nAMD fights  \nNVDA fights dirty.  \nIntel is the nursing home orderly that waits for your Grandma to die so he can steal the ring off her finger.\n\nThere are levels of ruthlessness in this game, NVDA is ruthless yes. But Intel is diabolical.",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgdu2sq/",
      "created": 1722732560,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgacrof",
      "score": 5,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgacrof/",
      "created": 1722686308,
      "depth": 0,
      "replies": [
        {
          "id": "lgah79s",
          "score": 1,
          "body": "> BUT absence of an upset in the South China Sea region, nobody is going to be beating down their door UNTIL they have the 18A.\n\nWhy? There are plenty of valid use cases for older and legacy nodes.",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgah79s/",
          "created": 1722688484,
          "depth": 1,
          "replies": [
            {
              "id": "lgai3vk",
              "score": 2,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgai3vk/",
              "created": 1722688907,
              "depth": 2,
              "replies": [
                {
                  "id": "lgajk0l",
                  "score": 2,
                  "body": "This is true, that there will be limited margin on previous nodes.\n\nAt the same time there will also be a lot of volume because every ancillary use of chips basically run on these previous nodes. The US MIC and foreign governments/government-owned entities are both interested in Intel's foundry capabilities because there's a level of comfort in not being dependent on China-manufactured chips if shit hits the fan.\n\nSo I think it is safe to calculate that the decision to open up their fabs to outside customers will bring in a lot of cashflow to keep the company afloat even while 18A is not up and running.\n\nIntel took the decision to open up their fabs in 2022 (IIRC), and it takes a couple of years for customers to finalise production runs each fabs have their own quirks in terms of settings, design rules etc.",
                  "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgajk0l/",
                  "created": 1722689565,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lgaiiri",
              "score": 1,
              "body": "Yes, but the margin on them is terrible and they don't bring on the big bucks. Their fab business is already losing billions.",
              "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgaiiri/",
              "created": 1722689096,
              "depth": 2,
              "replies": [
                {
                  "id": "lgajuih",
                  "score": 1,
                  "body": "Yes, the fab business losing billions is partly because of their new under construction operations as well.",
                  "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgajuih/",
                  "created": 1722689695,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgaj1a7",
          "score": 1,
          "body": "AMD have more of a chance of cleaning up in the OEM space when it comes to graphics. They have been really focused on APUs and they are making really good headway. The latest lapton ones offer marginally better performance on GPU and CPU, using much less wattage. They are on par with ARMs with slightly lower battery life but much more capable graphics.",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgaj1a7/",
          "created": 1722689331,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgclb8d",
          "score": 1,
          "body": "If you want to buy a US-based foundry play that benefits from the chips act, why the fuck would you look past GFS?",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgclb8d/",
          "created": 1722715877,
          "depth": 1,
          "replies": [
            {
              "id": "lgcmhiw",
              "score": 1,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgcmhiw/",
              "created": 1722716279,
              "depth": 2,
              "replies": [
                {
                  "id": "lgcs2b0",
                  "score": 1,
                  "body": "Take share",
                  "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgcs2b0/",
                  "created": 1722718235,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgeh7s2",
          "score": 0,
          "body": "Yeah but the current intc price is way too high. Shit needs to come down to a 1/4th of current price  to be worth a shit",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgeh7s2/",
          "created": 1722742433,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgaszat",
      "score": 5,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgaszat/",
      "created": 1722693497,
      "depth": 0,
      "replies": [
        {
          "id": "lglm83c",
          "score": 1,
          "body": "But the fact is most business computers use Intel and x86. 13/14th gen failures on custom gaming PCs will not sway the multi billion dollar enterprise market.",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lglm83c/",
          "created": 1722862246,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgasj51",
      "score": 2,
      "body": "What is the regarded concensus? Does INTC have more to drop this week or shall it be lotto calls?",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgasj51/",
      "created": 1722693321,
      "depth": 0,
      "replies": [
        {
          "id": "lgaxm9s",
          "score": 7,
          "body": "Everyone on the planet thinks INTC is going to plummet. That's bullish.",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgaxm9s/",
          "created": 1722695240,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgbjz8h",
      "score": 2,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgbjz8h/",
      "created": 1722702972,
      "depth": 0,
      "replies": [
        {
          "id": "lgbn74u",
          "score": 2,
          "body": "like?",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgbn74u/",
          "created": 1722704070,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lga6312",
      "score": 4,
      "body": "Sure would have been great to have sources/links to at least a few of these claims.\n\nWhat I do know recently about Intel is this:\n\n* https://www.tomshardware.com/pc-components/cpus/intel-to-layoff-more-than-15-of-workforce-almost-20000-employees-encountered-meteor-lake-yield-issues-suspends-dividend\n\nI think they're in trouble.",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lga6312/",
      "created": 1722682603,
      "depth": 0,
      "replies": [
        {
          "id": "lga7ntq",
          "score": 6,
          "body": "\"On October 16, 2014, AMD announced a new restructuring plan along with its Q3 results. Effective July 1, 2014, AMD reorganized into two business groups: Computing and Graphics, which primarily includes desktop and notebook processors and chipsets, discrete GPUs, and professional graphics; and Enterprise, Embedded, and Semi-Custom, which primarily includes server and embedded processors, dense servers, semi-custom SoC products (including solutions for gaming consoles), engineering services, and royalties. As part of this restructuring, AMD announced that 7% of its global workforce would be laid off by the end of 2014.\"\n\nIn 2012 AMD lay off 12%. They then laid off 7%. This is all just noise. What matters is not the present, but the future.",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lga7ntq/",
          "created": 1722683535,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgap5co",
      "score": 2,
      "body": "Good DD.  \n\nStill, the problem with INTC is it's just too old of a company.   Bullshit digs it's claws into old and poorly run organizations and it's almost impossible to overcome.  Gelsinger is not the CEO for that.  I also find his openness about religion as a big negative.  Engineers aren't known for being a faith based group.  It's like appointing an atheist to turn around a mega church who's pastor just got arrested for being a child molester.   Shit doesn't work.",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgap5co/",
      "created": 1722691964,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgaq4q0",
      "score": 2,
      "body": "You should stick to eating crayons, intel is a complete failure. The only chip maker who failed to make any gains in the last year of hyper chip inflation.",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgaq4q0/",
      "created": 1722692368,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgarre2",
      "score": 2,
      "body": "So what's the spread on [China invades Taiwan] vs [INTC hits $200].",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgarre2/",
      "created": 1722693019,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lga3jm9",
      "score": 1,
      "body": "Oh my gourd! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lga3jm9/",
      "created": 1722680988,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgadl83",
      "score": 1,
      "body": "[removed]",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgadl83/",
      "created": 1722686721,
      "depth": 0,
      "replies": [
        {
          "id": "lgadl90",
          "score": 1,
          "body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgadl90/",
          "created": 1722686721,
          "depth": 1,
          "replies": [
            {
              "id": "lgi8dgl",
              "score": 1,
              "body": "What did he say, bot? Its been deleted.",
              "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgi8dgl/",
              "created": 1722803793,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgatugq",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgatugq/",
      "created": 1722693828,
      "depth": 0,
      "replies": [
        {
          "id": "lgc1nkc",
          "score": 1,
          "body": "The crypto boom and COVID made it challenging to buy CPUS and GPUs. Demand was high and supply was constrained. Follow that with AI and the demand continues. Folks were biased toward AMD for Eth mining (that’s no longer a thing). It was definitely a factor, but not the primary driver.",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgc1nkc/",
          "created": 1722709014,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgauxns",
      "score": 1,
      "body": "re #2:  \nChina does not need to invade Taiwan to effectively control the economy there.",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgauxns/",
      "created": 1722694244,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgaw1tg",
      "score": 1,
      "body": "Just buy some OTM long calls if you think it’s got a chance …real long",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgaw1tg/",
      "created": 1722694664,
      "depth": 0,
      "replies": [
        {
          "id": "lgaxgcw",
          "score": 3,
          "body": "Could be 2 years, could be 5. Who knows. Long dated options have shit liquidity. ",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgaxgcw/",
          "created": 1722695179,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgbkx4v",
      "score": 1,
      "body": "I thought it was my dog shit dell motherboard that was the problem.\n\nTurned out it was the pos intel chip.\n\nBoth garbage products, only able to continue as they used to be so good!",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgbkx4v/",
      "created": 1722703294,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgcl5vz",
      "score": 1,
      "body": "If China does invade Taiwan, Samsung will benefit more than Intel.  Just because Intel has fabs doesn't mean it can produce what fabless companies need.  Just look at who is the second source foundry for Qualcomm, Broadcom, Nvidia and AMD.  Hint it's not Intel.  Lastly, TSMC's fab in Arizona will be online in the next couple years.  \n\nIntel is more like a HP than Nvidia.",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgcl5vz/",
      "created": 1722715826,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgd0ab7",
      "score": 1,
      "body": "Yolo into it and keep us updated",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgd0ab7/",
      "created": 1722721182,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgdurwy",
      "score": 1,
      "body": "There's no point in buying Intel now though. Might as well wait for 2026 when the 18A story actually materializes and see where it stacks up.",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgdurwy/",
      "created": 1722732841,
      "depth": 0,
      "replies": [
        {
          "id": "lgdxkv9",
          "score": 1,
          "body": "True, I just a smaller position",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgdxkv9/",
          "created": 1722733983,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgfcs8c",
      "score": 1,
      "body": "You have great insights \nAppreciate your lengthy book 🏆",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgfcs8c/",
      "created": 1722760997,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lga5bv2",
      "score": 1,
      "body": "Show past and present positions or ban!",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lga5bv2/",
      "created": 1722682132,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgacelh",
      "score": 1,
      "body": "Probably bullish short term consider how bad sentiment is. But I won't risk my asset doing so because sentiment are bad for reason",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgacelh/",
      "created": 1722686124,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgafrcy",
      "score": 1,
      "body": "It’s trading at the same price as it was **27 years ago**… why anyone would keep giving this stock a chance when there’s so many other stocks that are discounted atm and have fundamentally good companies behind them, I have no idea.",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgafrcy/",
      "created": 1722687788,
      "depth": 0,
      "replies": [
        {
          "id": "lgaitxp",
          "score": 6,
          "body": "This isn't a real argument because you could have said this same thing about AMD all the way up to 2018.",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgaitxp/",
          "created": 1722689237,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgae2mf",
      "score": -2,
      "body": "Intel won't go lower in the short term it's bottomed out, these regards telling the Intel guy to sell are reactionary morons.\n\nLong term though Intel only becomes a big player if China invade Taiwan, in which case the government will throw money at GPU manufacturers to catch up, but if that were to happen the whole market would tank before things like that are in motion.\n\nI can't see them turning things around without something like that happening.",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgae2mf/",
      "created": 1722686965,
      "depth": 0,
      "replies": [
        {
          "id": "lgb0g9j",
          "score": 3,
          "body": "This. Having the cost of capital equal to the return of capital is a rare sight on SnP and even rarer on NASDAQ and Intel has that at 19.4$/share. Ofc I’m only talking about the present (the trailing twelve months) because I know shit about chip businesses and the future.\n\nOther examples are Dell, PYPL and Aliexpress.\n\nIn comparison, NVDA has a cost of capital equalling the return of capital at around 34$. Meaning it’s overpriced af as with all IT business. So INTC might be a safe harbor if the market is about to turn bearish.",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgb0g9j/",
          "created": 1722696263,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgf234i",
          "score": 1,
          "body": "I don’t think it’s at the bottom with PE ratio of 89\n\nGreyham’s defensive investing strategy meant he didn’t buy stock unless the PE was under 15.",
          "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgf234i/",
          "created": 1722753866,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgao3i0",
      "score": 0,
      "body": "Stop being regarded ![img](emote|t5_2th52|18630)",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgao3i0/",
      "created": 1722691524,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgacrlb",
      "score": -1,
      "body": "Positions or BAN!",
      "permalink": "/r/wallstreetbets/comments/1ej04ru/intc_a_dumb_persons_retrospective/lgacrlb/",
      "created": 1722686307,
      "depth": 0,
      "replies": []
    }
  ]
}