{
  "title": "How would big tech hold up in a future recession?",
  "score": 76,
  "selftext": "Obviously seeing alot of fear around a potential recession. \n\nIm a novice investor with alot of my holdings in MSFT. How do you guys think bog tech would hold up if we were indeed heading for a recession? \n\nEdit: Specifically asking opinions on how the stock prices would be affected.",
  "link_flair_text": null,
  "id": "1ej68uy",
  "num_comments": 146,
  "created_utc": 1722699491,
  "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/",
  "comments": [
    {
      "id": "lgbb5p8",
      "score": 131,
      "body": "Nobody knows for sure.    I will be really curious to see how the next decade plays out.\n\nI think the big tech companies like Google will make a ton of money as they are so well positioned.\n\nBut eventually the jobs will start going away and then it will be interesting to see how this plays out.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbb5p8/",
      "created": 1722699937,
      "depth": 0,
      "replies": [
        {
          "id": "lgc6qoi",
          "score": 37,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgc6qoi/",
          "created": 1722710768,
          "depth": 1,
          "replies": [
            {
              "id": "lgd7gtd",
              "score": 19,
              "body": "Google has lots of cash on hand, and they can still bring in tons of cash even during a recession. They can purchase lots of smaller companies. Google can outright buy Intel, Boeing or Lockheed Martin with their annual profit at this point. That would be the dubmbest business decision,  but that should tells you the level of cash they are bringing in annually.",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgd7gtd/",
              "created": 1722723862,
              "depth": 2,
              "replies": [
                {
                  "id": "lgeqzy2",
                  "score": 9,
                  "body": "Googles valuation if they were a shrinking company would be PE ratio of less than 10, in other words a 50% stock price drop.\n\nCash on hand doesn’t buy you growth. If people stop advertising and it lasts a long time, Google stock will be in the garbage.",
                  "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgeqzy2/",
                  "created": 1722747352,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgfd5dx",
                      "score": 3,
                      "body": "In any economy there will *always* be demand to advertise their products. Companies big and small will find tools to do this, it just so happens Google has the farthest and most well informed reach.",
                      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgfd5dx/",
                      "created": 1722761246,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lgh3c4k",
                          "score": 2,
                          "body": "Again, falling YoY revenue doesn’t mean anyone completely stops advertising. It just means overall the market is flat or down, that’s enough to yank their stock price.",
                          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgh3c4k/",
                          "created": 1722789908,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lgevg2o",
                      "score": 3,
                      "body": "There will always be advertising.  \n\nA 50% is an expected swing if you buy individual stock. I would say, if you don't think you can handle a 80% loss  then the stock market is probably not a place for you. \n\nIf we run into the point where many businesses can't afford advertisements anymore, then all stocks will be garbage. Many companies will go under at that point, but you can assure that Google is not one of them.",
                      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgevg2o/",
                      "created": 1722749838,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lgc7vmm",
              "score": 4,
              "body": "Just like 2022, sigh.",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgc7vmm/",
              "created": 1722711162,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgf1dgd",
              "score": 1,
              "body": "Have u checked linkedin? A log of googlers are posting my last day post.",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgf1dgd/",
              "created": 1722753406,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgf41p7",
              "score": 1,
              "body": "They will first cut back on advertising on smaller platforms. That’s why you see Snap and Pinterest slowing down this quarter while Meta still grew.",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgf41p7/",
              "created": 1722755129,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgbbure",
      "score": 44,
      "body": "Well do you use your magical black screen daily?",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbbure/",
      "created": 1722700175,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgcl6lj",
      "score": 21,
      "body": "Last recession,  they expanded.  \n\nPrepare for a repeat. And an AI acceleration as a result. \n\nStock prices would rebound.. obviously, slower if it's deeper.  But tech is the foundation of future commerce.  Prove that last sentence wrong and you have reason to sell",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgcl6lj/",
      "created": 1722715832,
      "depth": 0,
      "replies": [
        {
          "id": "lgdp8or",
          "score": 3,
          "body": "I’ve been waiting for sticks to go up in price. My family has been holding a lot since the Stone Age.",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgdp8or/",
          "created": 1722730627,
          "depth": 1,
          "replies": [
            {
              "id": "lgdrhdc",
              "score": 2,
              "body": ">since the Stone Age.\n\nToo long.  Should have sold in the bronze age.. iron at the latest!  (*thanks!)",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgdrhdc/",
              "created": 1722731512,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgbd74x",
      "score": 44,
      "body": "Are you asking about how companies will do or how stock will do?\n\nGoogle, Microsoft etc will be fine. Their operations may get smaller but they have enough cash to go through with it.\n\nTheir stock value is more questionable though. I wouldn't put it all in one basket.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbd74x/",
      "created": 1722700634,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgbdlbw",
      "score": 44,
      "body": "In my opinion: MSFT is probably one of the safer big tech companies since their Office suite and operating system is so ubiquitous in workplaces and gaming, they are less reliant on advertising which is increasingly competitive.  Though revenue would still presumably take a hit in a recession.\n\nThe negatives are their bloated systems which are not that good, unnecessarily intrusive and it's dominant position is to do with poorly informed corporate management.\n\nI was tempted to just DCA MSFT over time. Though it might be significantly overpriced currently (it has the GDP of a large European country).",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbdlbw/",
      "created": 1722700769,
      "depth": 0,
      "replies": [
        {
          "id": "lgkc0dl",
          "score": 3,
          "body": "I've been a big MSFT advocate but sold 4 days ago. I honestly do not have any faith in the company, but I know that despite them being kinda shitty, their stock will always be extremely solid.\n\nI believe the main reason for their success with their operating system is a lack of a real competitor. Like sure Apple computers exist, but these days Apple computers are a joke, and many people realize that iphones are a scam.\n\nMSFT needs a real competitor, the way Netflix was for Blockbuster. Until then, it's full steam ahead (just with some bumpy roads here and there)",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgkc0dl/",
          "created": 1722834995,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgbzpdx",
          "score": 3,
          "body": "OS dominance soon to shrink after Crowdstrike snafu",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbzpdx/",
          "created": 1722708338,
          "depth": 1,
          "replies": [
            {
              "id": "lgc4w1a",
              "score": 4,
              "body": "Valve is bringing Linux to the masses too btw",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgc4w1a/",
              "created": 1722710128,
              "depth": 2,
              "replies": [
                {
                  "id": "lgclkiz",
                  "score": 9,
                  "body": "What's their market share?  Double it, it'll still be under 10%,  I'd bet.  So it's a speculative position",
                  "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgclkiz/",
                  "created": 1722715966,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgcy3bq",
                      "score": 2,
                      "body": "So far? Linux is 4.45% worldwide (look at the +0.4% spike after crowdstrike lol), so doubling it soon won't be accurate. Source https://gs.statcounter.com/os-market-share/desktop/worldwide\n.",
                      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgcy3bq/",
                      "created": 1722720394,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgbectl",
      "score": 23,
      "body": "Tech businesses will be fine. Tech stocks? Anyone's guess",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbectl/",
      "created": 1722701026,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgbez2t",
      "score": 20,
      "body": "See a lot of comments here about MSFT. I am curious about how people think of AMZN. With retail and then cloud it was doing well. But the recent reports show a massive investment in AI which are eating into costs. I know Amazon thinks a lot about the future ; however the continuous AI investment (billions in Alexa first and now the recent report) without a direct impact to the revenue stream are confusing. Moreover, META is keen on pushing an open source AI strategy.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbez2t/",
      "created": 1722701240,
      "depth": 0,
      "replies": [
        {
          "id": "lgbuh7f",
          "score": 20,
          "body": "I have no Amazon but am bullish on them. Primarily because of the progress they've made with Gravitron 4 and potential from the Trainium and Inferentia chips. Potential reduction of costs from adoption of their internal chips vs AMD, Intel, and Nvidia.\n\nAmazon dominating e-commerce in the US isn't going to change. AliExpress is intimidating to new users. People in the US buy through Amazon for AliExpress products. People buy through eBay for higher prices and still have the same shipping times as AliExpress. Never tried Amazon Pharmacy or telehealth but am intrigued for personal use someday\n\nAI: They're working on their own ChatGPT product. That will undoubtedly play a role in the user experience for AWS. Competitor to Microsoft CoPilot. Then Alexa utility. They have some autonomous vehicle/robotics/drone stuff going that I've never looked at that will play into reducing costs for warehouse operations and delivery\n\nConsumer products. Alexa is popular. I don't care for Fire TV, the failure and quick abandonment of the Fire Phone stymied them like Windows Phone for Microsoft\n\nPrime Video is the least lauded major streaming service. But it's probably the most streamlined for streaming service bundling. You can sub to Paramount, Max, Crunchyroll etc through Prime Video and watch all that content in the Prime Video app. As services bundle more, Amazon looks like the most likely option people go through whether for potential discount deals or just to consolidate their subs to one app for their own mental health \n\nThat sub is sticky. Prime Video is almost no ones primary reason for it. Most want shipping. I want the unlimited photo storage (RAW files are big). I tried out games available for free on Amazon Luna, it's solid. Upsale Luna+ subscription potential. Second best performance after GeForce Now. Kindle, Audible, Music. Netflix adding mobile games to the sub catalog is them trying to make the sub more sticky. \n\nFor not having a dominant consumer operating system under their control, their media services are successful how Google wished they managed under Google branding (movies, tv, music got folded under YouTube branding instead of Google). Prime having GrubHub+ actually convinced me to order delivery a couple times\n\nTo me the major knock on Amazon is just the failure of their phone. If they continued with new products/came out the gate with a better version 1, they'd be competing with premium phones and tablets that pushed Amazon digital media products. Now it's just those budget Fire tablets that are all about the children. Same problem for Microsoft except Amazon actually has a popular video streaming service",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbuh7f/",
          "created": 1722706545,
          "depth": 1,
          "replies": [
            {
              "id": "lgc13gm",
              "score": 7,
              "body": "My understanding is Amazon still loses money on e-commerce but they invest so heavily in automation that I have to assume at some point they'll turn into making profits on that part of their business. Their market share is just so big and I know so many people who just buy the majority of their retail products off Amazon. Hard to see them not continuing to grow.",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgc13gm/",
              "created": 1722708821,
              "depth": 2,
              "replies": [
                {
                  "id": "lgc2unz",
                  "score": 15,
                  "body": "They don't lose money on retail but their margins on the business are low. If you look at revenue alone, Walmart is 2x the size of Amazon. There is tons of room to grow mainly through weekly grocery trips",
                  "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgc2unz/",
                  "created": 1722709425,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgc66pf",
                      "score": 3,
                      "body": "Ah, ok. I was listening to something yesterday that said Amazon is losing money on e-commerce but perhaps they were wrong.",
                      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgc66pf/",
                      "created": 1722710577,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lgc7b7q",
          "score": 10,
          "body": "Amazon, google and Microsoft would be fine in a recession. Nvidia, tesla and to a lesser extent apple would have a hard time. Basically any hardware vendor would suffer massive losses. The more expensive the item the harder it's gonna be to sell.\n\nMS, Amazon and google provide basic services and digital infrastructure. Yeah they would loose their investments in AI or see those delayed massively, but it would not be the end of their bottom line like Nvidia.",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgc7b7q/",
          "created": 1722710967,
          "depth": 1,
          "replies": [
            {
              "id": "lgd9pbl",
              "score": -2,
              "body": "All sector are connected",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgd9pbl/",
              "created": 1722724702,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgbhci0",
          "score": 27,
          "body": "I’m all in on Amazon. It’s underpriced",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbhci0/",
          "created": 1722702065,
          "depth": 1,
          "replies": [
            {
              "id": "lgdds9z",
              "score": 6,
              "body": "15 price to operating cash flow and 32 price to free cash flow, is just insane. The stock is being priced as if it’s starting to die even though it had their best AWS quarter in ages",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgdds9z/",
              "created": 1722726235,
              "depth": 2,
              "replies": [
                {
                  "id": "lgde3rm",
                  "score": 5,
                  "body": "Yep I’m quite confident in it. Don’t think there is a better stable but nice growth play out there.",
                  "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgde3rm/",
                  "created": 1722726356,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lnzxv1a",
                  "score": 1,
                  "body": "That difference between Price/OCF and Price/FCF is quite large. Especially compared to Google (20 and 32). \n\nDoesn't it suggest amazon needs more capital investment to keep running compared to Google?",
                  "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lnzxv1a/",
                  "created": 1726802909,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lgcr1fq",
              "score": 1,
              "body": "I have alot of it too",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgcr1fq/",
              "created": 1722717874,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgkcbna",
          "score": 1,
          "body": "If taxes get lowered, Amazon will go to the moon imo. The company just sells everything. So if people have more money, they can spend more money on stuff. Amazon is the first place they go to look for stuff.",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgkcbna/",
          "created": 1722835176,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgby827",
          "score": -4,
          "body": "AI will increase profits and decrease the need for employees.... those factors are why every company (not just tech) are spending hand over fist ... a \"bagel\" will just help them shed more staff lowering labor costs..\n\nlook at X (formerly twitter) fires 75% of staff and never missed a beat..... followed by all the other tech companies laying off as much as they could",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgby827/",
          "created": 1722707829,
          "depth": 1,
          "replies": [
            {
              "id": "lge5lye",
              "score": 5,
              "body": "X’s revenue dropped by over 80%. The service is technically still running, in the way a house heated by a just-quenched fire is technically warm. ",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lge5lye/",
              "created": 1722737303,
              "depth": 2,
              "replies": [
                {
                  "id": "lgfn789",
                  "score": 0,
                  "body": "I deleted my Twitter a long time ago… but signed up again once Elon bought it and brought back free speech.\n\nPre Elon was just all bots in an echo chamber",
                  "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgfn789/",
                  "created": 1722768183,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lggvs6a",
                      "score": 2,
                      "body": "Good for you, bud",
                      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lggvs6a/",
                      "created": 1722787321,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lggmj05",
              "score": 3,
              "body": "bro have you seen the state of x?",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lggmj05/",
              "created": 1722784149,
              "depth": 2,
              "replies": [
                {
                  "id": "lggmvks",
                  "score": 1,
                  "body": "It’s been running butter smooth ever since Elon bought it\n\nA lot more freedom a lot less repression lot less government agencies controlling it \n\nOne of the reasons lost revenue was it stopped playing ball with all the government agencies stopped kissing asses",
                  "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lggmvks/",
                  "created": 1722784270,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lggyjfj",
                      "score": 3,
                      "body": "Yeah whatever",
                      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lggyjfj/",
                      "created": 1722788273,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lgh2ha2",
                          "score": 1,
                          "body": "It’s run perfectly for me ever since the sale",
                          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgh2ha2/",
                          "created": 1722789620,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lgh9nup",
                              "score": 3,
                              "body": "Musk is a weirdo",
                              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgh9nup/",
                              "created": 1722792044,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lgha6gu",
                                  "score": 0,
                                  "body": "I have no idea what that even supposed to mean he’s the most influential CEO of this generation easily of this century",
                                  "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgha6gu/",
                                  "created": 1722792218,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lghitwp",
                                      "score": 2,
                                      "body": "Those things aren’t mutually exclusive",
                                      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lghitwp/",
                                      "created": 1722795093,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lghlg3x",
                                          "score": 1,
                                          "body": "hes doing more to change the world than any other person...... and its not close",
                                          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lghlg3x/",
                                          "created": 1722795974,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgbpr36",
      "score": 16,
      "body": "straight down 30-80% depending on the stock and their earnings and then bounce back to all time highs within 12 months",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbpr36/",
      "created": 1722704936,
      "depth": 0,
      "replies": [
        {
          "id": "lgcvyvb",
          "score": 13,
          "body": "Most likely this. It has happened so many times it’s insane people still panic sell big techs…",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgcvyvb/",
          "created": 1722719624,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lge3e75",
          "score": 3,
          "body": "Exactly. This is why you should always have some cash in short term treasuries so you can scoop up the deals",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lge3e75/",
          "created": 1722736404,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgbe4zw",
      "score": 16,
      "body": "Their stocks can drop 75% in a recession. In fact some of them already have just 2 years ago.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbe4zw/",
      "created": 1722700953,
      "depth": 0,
      "replies": [
        {
          "id": "lgbk4kf",
          "score": 2,
          "body": "If we were to drop 75% again within 2 years that has to be some sort of record.  Amazon down 20% already but that can hit 30% and restack the deck for a recovery",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbk4kf/",
          "created": 1722703022,
          "depth": 1,
          "replies": [
            {
              "id": "lgct0rz",
              "score": 5,
              "body": "What are you talking about? Amazon is not down 20%... It's literally up over 30% for the past year. Where are you getting these numbers?",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgct0rz/",
              "created": 1722718569,
              "depth": 2,
              "replies": [
                {
                  "id": "lgcuhcr",
                  "score": 8,
                  "body": "Maybe from ATH I think they mean",
                  "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgcuhcr/",
                  "created": 1722719087,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgcv1qy",
                      "score": 2,
                      "body": "It's only down 16% from ATH",
                      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgcv1qy/",
                      "created": 1722719290,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lgdjp7o",
                          "score": 3,
                          "body": "Yeah but I think they were just approximating it",
                          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgdjp7o/",
                          "created": 1722728482,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lgifn46",
                              "score": 1,
                              "body": "This, I didn’t have my calculator handy.",
                              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgifn46/",
                              "created": 1722806303,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgbkl17",
      "score": 12,
      "body": "If you're a beginner, you might not have heard of the term \"moat\" yet. A company's moat is their ability to maintain competitive advantages under adverse market conditions. A famous example of this is KO - the company's brand image and the closely guarded formula of Coca Cola mean that it would be extremely difficult to push them out of their market niche.\n\nMSFT has arguably the best moat in the world. EVERYONE uses Windows, it's so prevalent that the downside of not being compatible with it is too hard to ignore. Whatever happens to the market, MSFT will rebound. However, it did crash in 1999 when the dot com bubble burst. It took 15 years to recover, and there's no guarantee it won't happen again. It's highly unlikely, but it would be the worst case scenario.\n\nThe other thing to consider is that tech is a hot sector at the moment due to AI gains, which MSFT is heavily invested in. That means it's the most volatile industry you could invest in. Short term gains will be bigger, but so will losses.\n\nYour approach will also depend on your time frame. If you're a long-term investor, you could invest now and reasonably expect the stock to have beaten inflation by the end of 2025. In my opinion, the potential recession is BS. The economy was too good for too long and it fucked with recession indicators like the Sahm Rule, which caused mass panic.\n\nI'd love to explain more but I'll try not to make this comment take up a whole page. The short version is that if we do end up in a recession, tech will drop like a rock. However, as long as you don't sell it'll also shoot up like a rocket when the recovery happens. The safest approach would be to sell MSFT and wait for the Fed to make a rate cut in September, then see how the economy reacts. If it recovers, you missed out on some gains but avoided any risk. If it panics because it thinks a rate cut was overdue, you can buy on the downswing and expect higher returns.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbkl17/",
      "created": 1722703179,
      "depth": 0,
      "replies": [
        {
          "id": "lgboa5s",
          "score": 4,
          "body": "Thanks for the advice. Im more inclined to hold but the downward trajectory has me second guessing my position.",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgboa5s/",
          "created": 1722704437,
          "depth": 1,
          "replies": [
            {
              "id": "lgd463k",
              "score": 1,
              "body": "This looks like a little bump so far it could get way worse. But you need to decide are you an  longterm investor or a trader. Being halfway in the middle you will get run over is my experience. (And with other choices also run over unless you put in serious work like >1000 hours) otherwise index ETF and chill",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgd463k/",
              "created": 1722722628,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgbnp4f",
          "score": 3,
          "body": "Regarding the last paragraph: why wouldn’t it be better to just hold on to MSFT during the downswing? Just weather it…?",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbnp4f/",
          "created": 1722704237,
          "depth": 1,
          "replies": [
            {
              "id": "lgbtegq",
              "score": 4,
              "body": "That would be opportunity cost. I'm a swing trader so holding on to a falling stock cuts into my profits, since that money isn't being used elsewhere. However, that's a totally valid strategy for someone who's hoping for modest returns over a longer time frame.\n\nI tried to stick to stocks since OP said he's a novice, but you could combine a long position on MSFT with a short call to take advantage of the panic. If the stock falls, you can buy back the contract for a profit at no loss to your position. If the stock rises you'll get assigned and walk away with moderate profit, which is probably what you'd be looking for anyways if you intend to weather the storm.",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbtegq/",
              "created": 1722706177,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgdxyb5",
          "score": 2,
          "body": "MSFT also has much better management than it had after the dot com crash.\n\nIn the years since MSFT was well positioned for but missed out on: \n\nWeb browsing: MS had internet explorer but lost share to Chrome & FF\nSearch: lost to google\nSmartphone: lost to Apple and google even though they had the dominant operating system.\nConsumer email: had Hotmail but lost to googles Gmail\nTablet computing: lost to apples IPad\nCloud computing: Azure is doing well but AWS was able to gain market share early\nAdvertising: had internet explorer and msn.com as the default home page but lost out on web ads to google and double click.\n\nI’m sure there are others but damn. Their current management should be better at moving on future opportunities that present themselves.",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgdxyb5/",
          "created": 1722734138,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgblnxb",
      "score": 20,
      "body": "there's no recession coming, people been saying this for the past 4 years since covid",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgblnxb/",
      "created": 1722703549,
      "depth": 0,
      "replies": [
        {
          "id": "lgbu31h",
          "score": 10,
          "body": "There is always another recession coming.  It’s the normal part of the economic cycle.  It’s just a matter of when.",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbu31h/",
          "created": 1722706410,
          "depth": 1,
          "replies": [
            {
              "id": "lgcmwef",
              "score": 12,
              "body": "we already had a form of recession since covid",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgcmwef/",
              "created": 1722716421,
              "depth": 2,
              "replies": [
                {
                  "id": "lgcrv0h",
                  "score": 3,
                  "body": "2022 was good down year",
                  "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgcrv0h/",
                  "created": 1722718164,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgdpq8p",
          "score": 4,
          "body": "Remove the free money and think what would have been. That’s the real issue for the upcoming cold weather",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgdpq8p/",
          "created": 1722730815,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgd4bx1",
          "score": 0,
          "body": "It actually is coming this time though ",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgd4bx1/",
          "created": 1722722689,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgbevbi",
      "score": 5,
      "body": "In a recessions all companies take a hit. But some more than others. As unemployment goes up that translates into immediate lower earnings for consumer staples and several other sectors which in turn buy less and they also spend less in marketing. This is why people rotate into things like healthcare, which are more resilient to a recession because it’s an essential.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbevbi/",
      "created": 1722701204,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgbf5rv",
      "score": 8,
      "body": "GOOGL and META would likely drop a lot because of their dependence on advertising. AMZN and AAPL probably would drop a lot because of consumer spending. MSFT would be the best off in that scenario IMO but would still drop a lot because valuations for tech would go down as a whole. All of them would be fine long term as they all have so much cash and low interest debt.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbf5rv/",
      "created": 1722701305,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgbjyy4",
      "score": 3,
      "body": "They held up well in 2008. They cratered in 2020. Most likely will crater with the markets. \n\nBig biotech will be the beacon of light or anything healthcare",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbjyy4/",
      "created": 1722702969,
      "depth": 0,
      "replies": [
        {
          "id": "lgef9t0",
          "score": 2,
          "body": "What is your prognosis for Ginkgo Bioworks? They've taken a beating in the past few years and completely pivoted their business model on their last earnings call.",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgef9t0/",
          "created": 1722741518,
          "depth": 1,
          "replies": [
            {
              "id": "lgfy2ev",
              "score": 2,
              "body": "IDK anything about them.  TWST seems to be the play (albeit not the same type of company) but its out of my flywheel.",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgfy2ev/",
              "created": 1722774315,
              "depth": 2,
              "replies": [
                {
                  "id": "lggbkj8",
                  "score": 2,
                  "body": "One of my grad school advisors became an exec at ginko, just saw a post that they were letting people go. Bad omen?",
                  "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lggbkj8/",
                  "created": 1722780147,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgifs50",
                      "score": 2,
                      "body": "Probably means tough to raise money or get new investors.  VC doesn’t seem to be pouring into biotechs",
                      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgifs50/",
                      "created": 1722806353,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgbudwk",
      "score": 3,
      "body": "Funny, advisors always say market is now rotating to small cap stocks. But big cap stocks like Mag7 weather thru storms better.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbudwk/",
      "created": 1722706513,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgcd6ps",
      "score": 3,
      "body": "I think Tech _should_ do fine since all the Big Tech’s been trying to be way more efficient post-COVID with steady job cuts. IMO they are way more lean and streamlined compare with 2019 _way_ before COVID hit. \n\nOne thing to remember: recession is not permanent. It could simply last a single quarter and economy rebound again. I have a feeling it probably won’t hit until Q1 or Q2 of next year if at all.\n\nOne more thought: Apple is probably going to suffer the most since they business model is highly dependent on device sales. That probably will be the first to get cut in the consumer budget. Google is likely to be in the middle and MSFT probably will be least likely to be affected just like others have suggested.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgcd6ps/",
      "created": 1722713032,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgbf9cu",
      "score": 2,
      "body": "Good and bad like more volatile but over all I’d think fine since we live in a tech world",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbf9cu/",
      "created": 1722701340,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgbfk2h",
      "score": 2,
      "body": "People still use tech in a recession, maybe more as social media, ect., is cheaper than going out. Also companies cutting jobs could benefit from replacing with tech. Considering AI is driving wars and new battlefield weapons, ect., I'd think it could be a safe place to park money. Joe schmoe won't be buying chips but I bet the biggest companies on earth will be.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbfk2h/",
      "created": 1722701442,
      "depth": 0,
      "replies": [
        {
          "id": "lgblbge",
          "score": 0,
          "body": "And I know this is somewhat a joke, but AI can replace intern jobs or basic jobs cutting cost down for companies.",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgblbge/",
          "created": 1722703431,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgbvuvk",
      "score": 2,
      "body": "Layoffs baby.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbvuvk/",
      "created": 1722707020,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgc4gaq",
      "score": 2,
      "body": "short term-mid term possibly get hammered. long term theyll be fine",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgc4gaq/",
      "created": 1722709979,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgc9tpr",
      "score": 2,
      "body": "I think money will move out for a little bit but companies will still progress. I don’t think there’s ever a chance of big tech going under water with where the future is heading. If anything I think it’ll get undervalued as people will have less money to invest. Growth will slow a little and then move back to high growth potential and high evaluations as people start spending and investing more.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgc9tpr/",
      "created": 1722711845,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgch40p",
      "score": 2,
      "body": "They'll do what they do everytime people think a recession is gonna happen (even when it doesn't). Drop by about 50%.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgch40p/",
      "created": 1722714412,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgchrdt",
      "score": 2,
      "body": "Not well. Tech is priced for big expectations on future earnings. If those expectations are not hit, it's a disaster",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgchrdt/",
      "created": 1722714638,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgcxbk7",
      "score": 2,
      "body": "Google and meta are secular trends. Digital ads and social media based targetted ads are the future. They might take a blip but it’s going to continue generating amazing FCF. \n\nYou buy at any price until it reaches peak usage, which won’t be in my life time.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgcxbk7/",
      "created": 1722720112,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgflabx",
      "score": 2,
      "body": "Similar to previous recessions. Too many people acting as if mega cap tech can be growth stocks when times are good and act like staples when times are bad.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgflabx/",
      "created": 1722766905,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgcmqur",
      "score": 3,
      "body": "Big tech isn’t going anywhere. It’s literally the ONLY thing holding up the market. The government will dump billions into propping up the big tech bubble. I just read a Yahoo Finance article about how Big Tech is now “too big to fail,” meaning they’ll never let it fail. Tech is going to be just fine and you better believe I’m buying this dip. We’re gonna be record highs all over again by end of September.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgcmqur/",
      "created": 1722716368,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgbk4gb",
      "score": 3,
      "body": "Jeez. Just look at history and factor in multiples. Multiples are still high. Big tech such as QQQ usually falls 50% from peak to trough in a standard recession. Heck QQQ fell 32% in 2022 without a recession because the Fed raised rates. MSFT is more recession resistant, but it will still fall 30% to 40% from its peak in a mild to average recession.\n\nWe probably avoid a recession and this will just be a correction but big tech will have a hard correction given valuation extremes. A 20% fall for QQQ from to peak to trough is very likely. I have a target for MSFT at $370. It traded this low in January, not that long ago. \n\nPE10 is still VERY high:\nhttps://www.multpl.com/shiller-pe\n\nDon’t listen to the bullish fools on this sub. The highs for the year maybe behind us. A Harris win with a divided Congress would be bullish for big tech.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbk4gb/",
      "created": 1722703021,
      "depth": 0,
      "replies": [
        {
          "id": "lgbn6nv",
          "score": 0,
          "body": "So my average share price right now is about 390. Would you recommend holding or selling?",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbn6nv/",
          "created": 1722704066,
          "depth": 1,
          "replies": [
            {
              "id": "lgbq14d",
              "score": 2,
              "body": "I think it depends on your personal financial situation. If you have cash reserves and a steady job for the next 12 months I would hold. If not, I would consider trimming your position until you have enough cash reserves to cover 3 months of expenses in case you lose your job. MSFT is a top holding of mine as well and I think LT it will be higher.",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbq14d/",
              "created": 1722705032,
              "depth": 2,
              "replies": [
                {
                  "id": "lgbsi8n",
                  "score": 1,
                  "body": "Appreciate the advice.",
                  "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbsi8n/",
                  "created": 1722705871,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgc231c",
                      "score": 1,
                      "body": "Best advice I ever got is to remember that we don't have to sell it all at once. Sometimes it makes sense to sell a portion of something to lock in some gains.",
                      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgc231c/",
                      "created": 1722709161,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgdrs7k",
      "score": 2,
      "body": "You cannot expect any company to 'hold up' during a recession. You can only expect them to recover swiftly and strongly after one. Good examples would be MSFT/GOOGL/AAPL/AMZN.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgdrs7k/",
      "created": 1722731632,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgbi62z",
      "score": 1,
      "body": "They will all cut staff, even if they dont need to (the companies whose revenue wont change much because of a recession).\n\nSome will take a huge revenue hit, some not so much. But every single one will do layoffs because its the perfect excuse to cut costs and overwork the remaining staff (or to outsource without the bad PR)",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbi62z/",
      "created": 1722702350,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgbt5at",
      "score": 1,
      "body": "I don't think anyone can predict with absolute confidence and certainly how any tech stock will do over multiple decades, especially during periods of recession. Personally,  I am heavily weighted in tech, but I chose the mutual fund and etf route. Hopefully, over time, the funds will be well managed with poor performers moved out and replaced with whatever the current hot stock/company is. For me, the real dilemma was how high of a percentage did/do I want to allocate to tech? My portfolio is aggressive. Moderately diverse but aggressive. It's a decision that I make, and I will stick with it simply because I believe tech will always be an evolving wheel of change. Tech will probably be volatile on its way up too so I am preparedfor the ride... Speaking of up, I have been waiting since childhood for my flying car, gosh darn it! Lol",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbt5at/",
      "created": 1722706090,
      "depth": 0,
      "replies": [
        {
          "id": "lgbu7yp",
          "score": 1,
          "body": "A little over 50% of my holdings are in VTI. The rest is MSFT. This has be reconsidering going all in with VTI.",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbu7yp/",
          "created": 1722706456,
          "depth": 1,
          "replies": [
            {
              "id": "lgcrxpd",
              "score": 1,
              "body": "Could go VGT (16%MSFT) but also exposes you to more tech funds.",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgcrxpd/",
              "created": 1722718190,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgc20vw",
      "score": 1,
      "body": "I doubt the stocks of the big tech companies would fall more than 20% in a recession. \n\nThis is not 2020 or 2022. \n\nI'm talking Googl, MSFT, Aapl, Meta. \n\nTSLA and NVDA however, the drop could be much more. \n\nDisclaimer: I am off the charts regarded",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgc20vw/",
      "created": 1722709140,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgcfrla",
      "score": 1,
      "body": "What do you guys think of hedging google shares with a 12 month put in case the recession talk hits google hard over ad spend fears/it actually happening?",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgcfrla/",
      "created": 1722713941,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgchw0z",
      "score": 1,
      "body": "My crystal ball says, “outcome looks good” … my crystal ball is sometimes referred to as an “the magic 8 ball,” and has known to be wrong just as much as right",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgchw0z/",
      "created": 1722714684,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgcmd3h",
      "score": 1,
      "body": "Everyone here talking about a recession already over what would normally be considered a normal jobs report and unemployment rate 5 years ago makes me want to buy the dip. \n\n“If you spend 13 minutes a year on economics. You’ve wasted 10 minutes.” -Peter Lynch",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgcmd3h/",
      "created": 1722716236,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgco2g5",
      "score": 1,
      "body": "Obviously don't put your eggs all in one basket, but I can't imagine a scenario where anything happens to Microsoft, Apple, etc. anytime soon without something drastic (as in our lives will never be the same) going on.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgco2g5/",
      "created": 1722716827,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgcpoxj",
      "score": 1,
      "body": "just look at 2021. these are all time highs. 60% down could happen",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgcpoxj/",
      "created": 1722717399,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgcwoiu",
      "score": 1,
      "body": "It would probably do extremely well, as usual.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgcwoiu/",
      "created": 1722719880,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgcy1d9",
      "score": 1,
      "body": "Many tech companies are solid and indispensable, much like consumer staples. However, many are also overvalued, and their stock prices are likely to tumble in a recession. They will endure, and I’m waiting for opportunities to buy at lower prices",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgcy1d9/",
      "created": 1722720374,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgd05kk",
      "score": 1,
      "body": "Big tech will do just fine. It may dip more but it always rebounds to all-time highs. There's no other industry that can create more value for itself with actual products or solutions on a global scale. Big tech also has the brand name and the news cycle coverage that other industries just don't. And there's way more opportunity for big gains in tech. Just keep buying on a schedule and ignore all of the PR because big money is pushing it out to try to get you to sell and lower the price so they can rebuy back in. This is always the case. Just don't risk investing what you can't afford to lose.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgd05kk/",
      "created": 1722721135,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgd9l1d",
      "score": 1,
      "body": "The next step is more regulation for big techs, a really hard regulation.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgd9l1d/",
      "created": 1722724657,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgdh8ui",
      "score": 1,
      "body": "They would be in a recession",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgdh8ui/",
      "created": 1722727558,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgdoo9c",
      "score": 1,
      "body": "Prob drop down 20-40%",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgdoo9c/",
      "created": 1722730406,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgdp8ls",
      "score": 1,
      "body": "It barely held during 2022 rate rising",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgdp8ls/",
      "created": 1722730626,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgdzma7",
      "score": 1,
      "body": "You can value them at 15Trillion dollars based on current market. But who knows next. Maybe 30Trillion or more maybe 3 trillion or less. Tech is not a good anchor of asset after all. ",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgdzma7/",
      "created": 1722734824,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgf18uu",
      "score": 1,
      "body": "They won’t hold up. They go down. Not descending but cliff down. Sorry. My microsoftie stocks are also beaten down.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgf18uu/",
      "created": 1722753325,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgg6dpv",
      "score": 1,
      "body": "They would be the cause of it what do you mean",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgg6dpv/",
      "created": 1722778078,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggto8l",
      "score": 1,
      "body": "By model design they have greater margins and higher profits as well as (in mega cap cases) fortress balance sheets.\n\nI’d say pretty well.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lggto8l/",
      "created": 1722786602,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lghe0za",
      "score": 1,
      "body": "I think big tech has the most to lose right now. They have sky high valuations and earnings baked in until 5 years from now in the realistically priced companies Google, Apple, Amazon etc., and until god knows for companies like Netflix, Spotify, Nvidia.\n\nOn top of this they’re not going to benefit a lot from lower interest rates because most of them have massive cash reserves and don’t really need to borrow money unless they’ve mismanaged their company, looking at you Intel.\n\nI think it’s a good time to hold your big winners and hope they continue to be winners, hold your big losers and hope they become winners and close out your swing trades, small winners, small losers, and everything your thesis might be uncertain on.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lghe0za/",
      "created": 1722793494,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lghibto",
      "score": 1,
      "body": "Couple of thoughts to consider.  First, when recessions are confirmed it’s too late for stocks—they’ve already discounted this, likely 3-6 months beforehand.  Stocks generally lead the economic outlook, outside of extreme shocks.  Second, the things that perform well in a bull market perform poorly in a bear market.   No way around it.  The things you likely want to own on the way up (e.g tech, consumer discretionary) will likely be mauled.  Some categories may fare better (e.g. utilities, consumer staples) but that’s just on a relative basis.  Personally not a fan of going into those, but to each their own.\n\nI’m old enough to remember when US treasuries were a flight to safety in bear markets.  Jury is out as to whether that happens next time, but with rates at an apparent cyclical peak they very well could be.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lghibto/",
      "created": 1722794923,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgijtpu",
      "score": 1,
      "body": "I hedge my tech stocks with costco stocks.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgijtpu/",
      "created": 1722807788,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lglgl92",
      "score": 1,
      "body": "Im going to say no. Specially not chips…. Why…. Big tech will suspend capex as it cut down on opex during the 30% drop from November 2021. All the owners are selling",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lglgl92/",
      "created": 1722859816,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgnkqq3",
      "score": 1,
      "body": "As far as are we heading toward a recession today... that's a hard no in my book.\n\nIn a future recession, there is a decent chance that the \"Big Tech\" names you see today could change... Just look at NVDA which last year was not a big tech name... MSFT, AMZN will likely still be around, but Samnsung could come out with a better phone and knock out AAPL. Open AI could spin off of Microsoft and become another Big Tech name...",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgnkqq3/",
      "created": 1722885640,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgbl8kg",
      "score": 1,
      "body": "The oldest companies will do the best 🔮 (this is my crystal ball) 👀",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbl8kg/",
      "created": 1722703404,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgbea60",
      "score": 1,
      "body": "Tech, just be virtue of their business model, will fare the best against traditional companies.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbea60/",
      "created": 1722701001,
      "depth": 0,
      "replies": [
        {
          "id": "lgbjhby",
          "score": 1,
          "body": "Why though?",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbjhby/",
          "created": 1722702801,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgbmig5",
          "score": 1,
          "body": "That is far from true for the sector as a whole. Certain companies definitely though",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbmig5/",
          "created": 1722703835,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgbm8je",
      "score": 1,
      "body": "Nothing “holds up” in a recession",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbm8je/",
      "created": 1722703741,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgc29hv",
      "score": 1,
      "body": "We might all be about to find out soon.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgc29hv/",
      "created": 1722709224,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgc4re8",
      "score": 1,
      "body": "To paraphrase quote Warren Buffett: “Nobody wins in a recession.”",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgc4re8/",
      "created": 1722710084,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgbjffd",
      "score": 0,
      "body": "If only there was a big tech company that provided a product to make money or provided a means to play/view quality video games or possibly had a role in a promising future tech…hmm, who might meet that niche?",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbjffd/",
      "created": 1722702783,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgblsdl",
      "score": 0,
      "body": "From a stock perspective:Anything with a beta of >1 usually falls more in a recession. Plus these companies have insane multiples, so they could fall a lot before people \"can't pass up the opportunity\"\n\n\nFrom a company perspective: i don't see Microsoft's core business suffering majorly in a recession",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgblsdl/",
      "created": 1722703592,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgbxpdc",
      "score": 0,
      "body": "never mention the R word........ its \"bagel\"",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbxpdc/",
      "created": 1722707651,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgbyoz2",
      "score": 0,
      "body": "Companies will hold back on AI, semis and chips will tank, that will bring other techs down all together.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbyoz2/",
      "created": 1722707990,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgc5gii",
      "score": 0,
      "body": "There’s no such thing as “Big Tech”\n\nThere’s individual companies, with individual financials/outlook/valuations/business models. \n\nWhich company, specifically, are you asking about?",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgc5gii/",
      "created": 1722710326,
      "depth": 0,
      "replies": [
        {
          "id": "lger390",
          "score": 1,
          "body": "https://en.m.wikipedia.org/wiki/Big_Tech",
          "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lger390/",
          "created": 1722747402,
          "depth": 1,
          "replies": [
            {
              "id": "lghi8gt",
              "score": 1,
              "body": "Thank you for proving my point",
              "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lghi8gt/",
              "created": 1722794891,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgbzo94",
      "score": -1,
      "body": "FYI the market will bounce and gaslight itself into believing it's okay for about a week.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbzo94/",
      "created": 1722708327,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgbpqbe",
      "score": -2,
      "body": "We are witnessing the Great Rotation. Many investors are flocking to small businesses, anticipating that the Federal Reserve will cut interest rates in September. Eventually, they are likely to return to Big Tech stocks when interest rates drop lower or when these companies start reporting consecutive good quarterly earnings. That’s my prediction, but I could be wrong because I’m not Mr. Market, lol.",
      "permalink": "/r/stocks/comments/1ej68uy/how_would_big_tech_hold_up_in_a_future_recession/lgbpqbe/",
      "created": 1722704928,
      "depth": 0,
      "replies": []
    }
  ]
}