{
  "title": "Mideast instability going to enter the chat this week $LMT $RTX $MRO $OXY $HES",
  "score": 52,
  "selftext": "TL;DR: Israel went too far assassinating a Hamas political chief in Iran in response to the rocket strike in the Golan Heights recently. Iran is going to have to do something fairly big in response in an attempt to keep Israel in check. Resulting instability, escalation, and Russian interest in causing regional chaos could send oil stocks up as shipping through the Straight of Hormuz could be complicated by Iran if there is broad escalation. Defense stocks could also pump. HES MRO and OXY look like more attractive plays rn given recent price action. And of course, if things escalate quickly, spy/qqq puts should continue to print. NFA\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nLonger version (may edit later to add more sources)\n\nThings are escalating the Mid East. Israel responded to a Hezbollah rocket attack that killed a bunch of kids at a soccer game by assassinating 2 guys. The guy who launched the rockets in Beirut (alone prolly nbd) and Ismail Haniyeh, Hamas political chief (bfd). Haniyeh was killed in Iran's capital. Assassinating foreign leaders openly is a big deal. Doing it in rival nations capitals is a bigger deal. And what it means is that Iran is now in a position where they *have* to respond.\n\nIsrael needed to thread the needle with their response to Hezbollah to hit the off-ramp. Hardliners were not going to allow a response that was too mild with the awful nature of what happened in the Golan Heights. But international actors were desperately trying to prevent a response that went too far so as to avoid broader conflagration.\n\nInternational diplomacy failed and Israel went too far. They assassinated the leader of an organization that didn't do the attack in the capital of a foreign rival.\n\nThe US is moving military assets to the ME now to protect Israel from a likely Iranian response. Although Iran's response to one of their Generals being killed in April didn't do much damage, they are in a realpolitik position of having to punish Israel for this, lest they grant carte blanche authority for Israel to start decapitating leadership of rival political groups throughout the region with impunity. This is an extraordinary action that Iran cannot afford to rubber stamp with inaction.\n\nIran and its allied proxies run the distinct risk of escalating conflict in the region by being *too soft* in their response.\n\nThe final kicker here and the elephant in the room is Russia, Iran's closest and most powerful ally. Russia has an extraordinary set of incentives for Trump to beat Harris in November, the most obvious being complicating US funding for Ukrainian defense (there's a whole lot more there but that's one of the most immediate benefits for Russia).\n\nWith Harris taking over for Biden's doomed effort, the political calculus has shifted for Putin. A broader regional war in the ME is bad for an incumbent presidency by itself. That causing already teetering markets to collapse further is also terrible for Harris. And on top of that, [gas prices ](https://www.researchgate.net/profile/Mark-Wohar/publication/24076097_Do_increases_in_petroleum_product_prices_put_the_incumbent_party_at_risk_in_US_presidential_elections/links/54f467fb0cf24eb8794e6abf/Do-increases-in-petroleum-product-prices-put-the-incumbent-party-at-risk-in-US-presidential-elections.pdf)have a lot of influence on election cycles.\n\nRussia may believe that a middle east war will produce a Trump victory and that otherwise, those odds are growing longer by the day. With markets on the ropes, Russia may believe prompting an large Iranian response now could be a tipping point.\n\nAnd if Iran believes that they cannot afford a weak response, their best means of reprisal would be having their proxies attack Israel so the Houti's in Yemen, Hezbollah in Lebanon, and what's left of Hamas in Gaza.\n\nHow to play it:\n\nHES, OXY, MRO - The Straight of Hormuz is the concern. If Iran wants, they can shut it down or at a minimum make passage very difficult. That means oil companies with less production in the ME have the most to gain. After 10/7 when there was a perceived risk that Iran would complicate the straight, all 3 of these jumped over the week following. Plus the options are pretty cheap. Depending on how this is developing Monday, I'll probably buy some MRO $28c 8/23 (currently about .55). I don't trade a lot of oil stocks so any feedback welcome on these companies. One other upside is that they all appear to be oversold currently.\n\nEDIT: Its true that these three don't move very fast but the premiums reflect that. Needless to say, its certainly not a play you want to make very far OTM if at all, imo. Commentor [La\\_Menace\\_](https://www.reddit.com/user/La_Menace_/) also pointed out the risk that if the gains for these companies are modest, economic chaos may swallow any gains they make because of Hormuz stuff. For me, the premiums are cheap enough that it could be a reasonable lotto play but certainly to each their own on this.\n\nEDIT: [CultureForsaken3762](https://www.reddit.com/user/CultureForsaken3762/) Says XOP is the play, more correlation with oil prices. Ty\n\nLMT, RTX, defense etfs - appears as though these companies have been on a run but they could go further if things escalate. Again, any input on these/defense stocks that could run is welcome, don't typically trade them.\n\nDRS too? Comment below reads:\n\n\"Solid DD but missing DRS when talking about defense stocks in this region shows you could’ve gone deeper. It will fly in the near future\". Certainly worth a look ty!\n\nZIM - someone mentioned this the other day and it did go up at the Golan attack. However, look at its chart after 10/7 before you make the call on that, it actually went down (iirc) a few days after.\n\nIndex Puts - I mean who doesn't have these right now?\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nJust gonna put a couple other notes about things down here but you don't need to read this part unless you hate yourself and your spare time.\n\n1. De-escalation scenario - the window is narrower than post-golan imo. The reason is because doing very little to nothing effectual in response is now by itself a cause for escalation because it invites more assassinations and attack by Israel. Plus with Russia potentially wanting war, there is no voice in the room for Iran that is discouraging attacks. I'm having trouble seeing an Iranian response that delivers a pound of flesh\n2. Nuclear things - I don't see a strong risk of a nuclear response any time in the near future but if tensions escalate and international actors get drawn-in, the more likely nuclear thing that could escalate things is declaration by either Iran or Israel. Iran cause they finished thier first bomb. Israel could abandon long-standing nuclear opacity as a flex.\n3. The Tehran assassination - as details emerge, it could influence the response. If it was just a drone through a window, that's one thing. But if some of these reports that Iranian security helped plant the bomb and it was there for month are true, it means Iran needs to be a lot more worried because they are compromised af.\n4. Already escalating - been checking in on the news as I write this. Israel is stepping up attacks on South Lebanon, they blew up a school today, they killed another vip in the West Bank today, Yemen may have just taken a shot at a ship from the UK.\n5. Biden may have lost his ability to influence Bibi- it seemed to me like the assassination of the commanding officer that launched the Golan missiles was a smart off-ramp attack. I wouldn't be surprised if that killing was negotiated through backchannel (Hez might have even given him up thinking it would avoid an escalation). But it seems like Biden had no idea Israel was planning to pop the Hamas political chief in Tehran. If that's the case, it means Israel is giving in to hardliners internally and shutting-out the 'cooler heads'.  Even worse they may be faking willingness to agree to a truce to buy more time. Article about that:\n\n[https://www.theguardian.com/world/article/2024/aug/03/assassination-again-shows-netanyahus-disregard-for-us-israel-relations](https://www.theguardian.com/world/article/2024/aug/03/assassination-again-shows-netanyahus-disregard-for-us-israel-relations)\n\n6. Hope I'm wrong about things escalating, there's enough dead kids in Gaza already, I'm by no means rooting for Israel to open-up on Lebanon. But I think given recent events, its worth keeping an eye on.\n\nEDIT/UPDATE: This is looking quite bad. The Biden Admin has no control over what Netanyahu is doing now. They can't stop them and its become evident that Bibi has been bullshitting Biden about the cease fire in Gaza. Bibi fired Gallant, a bad sign when things are taking a turn for the crazy aggressive (e.g. assassinating foreign leaders). \n\nReports are coming out that Iran could attack [within the next 48 hours](https://www.axios.com/2024/08/05/iran-hezbollah-attack-israel-monday-blinken). No way to know if that's true. Could also just be Israel hyping the threat to make the case for preemption.\n\nIsraeli sources are reporting that Israel could [preemptively strike Iran](https://www.timesofisrael.com/israel-could-preemptively-strike-iran-if-intelligence-shows-attack-is-imminent-report/) if they felt an attack was imminent. What's interesting and worrisome about those reports is that they seem more like Israel priming the narrative for why preemption was the only option. They're setting a low bar for \"knowing the attack is imminent\" as its pretty widely recognized that Iran plans to attack somehow.\n\nFinally, the reason why escalation might be right around the corner is that most parties involved now want it and benefit from it. Putin because war, economic recession (at least correction), and sky-high gas prices are a good formula for getting Trump elected. Iran because their hardliners are losing their minds because of the assassination. And finally Netanyahu also has an inventive to go to war now because he too would want to influence the US election. He's proactively been making the Biden admin look like shit on this one and he knows that a massive war in the ME is going to devastate Harris' chances in November. He'd rather have trump in office so he knows he can continue with this wild-west style war mongering and the US won't stop him, not even a little. Harris, on the other hand, is faced with a catch-22 if war escalates: Condition or withdraw support for Israel in the conflict and suffer the wrath of AIPAC before the election. Or support the war and lose the youth/progressive vote because Harris is the veep who's signing-off on selling bombs to a country that will kill kids with them.\n\nGonna be a crazy week, hope I'm chicken little cause this could get ugly.",
  "link_flair_text": "Discussion",
  "id": "1eja9ta",
  "num_comments": 60,
  "created_utc": 1722709429,
  "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/",
  "comments": [
    {
      "id": "lgc2ver",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 673 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgc2ver/",
      "created": 1722709433,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgc39el",
      "score": 117,
      "body": "Just put my humus in the gyro, man.",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgc39el/",
      "created": 1722709568,
      "depth": 0,
      "replies": [
        {
          "id": "lgc3sti",
          "score": 16,
          "body": "Lol well played",
          "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgc3sti/",
          "created": 1722709756,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgdvkrf",
          "score": 5,
          "body": "Finally a new fries in the bag",
          "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgdvkrf/",
          "created": 1722733164,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgg8mf4",
          "score": 1,
          "body": "Gyros are from Greece bro",
          "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgg8mf4/",
          "created": 1722778992,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgibehw",
          "score": 1,
          "body": "Shawarma*",
          "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgibehw/",
          "created": 1722804826,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgcro4h",
      "score": 16,
      "body": "HES, OXY, MRO - Just checked, the magnitude of their upside after 10/7 is only 3-5% at most over a week.. not attractive, if the market tanks enough that could offset the idiosyncratic gains.",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgcro4h/",
      "created": 1722718095,
      "depth": 0,
      "replies": [
        {
          "id": "lgdu91d",
          "score": 6,
          "body": "I've gone long UCO calls multiple times and almost every time they expired worthless regardless of what was taking placing in the real world. Oil markets are notoriously manipulated, as much as, well, commodity markets.",
          "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgdu91d/",
          "created": 1722732629,
          "depth": 1,
          "replies": [
            {
              "id": "lgdx7g3",
              "score": 2,
              "body": "Same experience. Don’t touch any commodities now.",
              "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgdx7g3/",
              "created": 1722733829,
              "depth": 2,
              "replies": [
                {
                  "id": "lgols1i",
                  "score": 2,
                  "body": "You wouldn’t start a long on OXY at this level? Shares",
                  "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgols1i/",
                  "created": 1722897755,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgom0vk",
                      "score": 2,
                      "body": "Oh. That’s different. Yes, I hold shares in other energy/oil tickers. But straight up commodities market is a different beast. I’m suppose I’m focused on stocks.",
                      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgom0vk/",
                      "created": 1722897842,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lge2z0b",
          "score": 1,
          "body": "Wrong dates to compare. Compare late march/early April.",
          "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lge2z0b/",
          "created": 1722736227,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgoloer",
          "score": 1,
          "body": "OXY is at a great level now for entering long. The risk is if it drops below $54-53 support then I see some gaps that need to be filled to the downside to ~$42",
          "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgoloer/",
          "created": 1722897719,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgc4pc1",
      "score": 14,
      "body": "Oh wow the shit we have found ourselves in on this planet",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgc4pc1/",
      "created": 1722710065,
      "depth": 0,
      "replies": [
        {
          "id": "lgce55p",
          "score": 12,
          "body": "It's been like this since the first ape picked up a rock.",
          "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgce55p/",
          "created": 1722713371,
          "depth": 1,
          "replies": [
            {
              "id": "lgd9ju0",
              "score": 20,
              "body": "Its been like this since the first ape picked up 700K in intel",
              "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgd9ju0/",
              "created": 1722724645,
              "depth": 2,
              "replies": [
                {
                  "id": "lgdutdt",
                  "score": 3,
                  "body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)",
                  "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgdutdt/",
                  "created": 1722732857,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lgcfk9o",
              "score": 3,
              "body": "![img](emote|t5_2th52|27189)",
              "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgcfk9o/",
              "created": 1722713868,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgdzsuv",
              "score": 1,
              "body": "A monkey tossing a rock didn't have the capacity to end the world but I take your point. MAD sure is a fucking Helluva way to live though man.",
              "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgdzsuv/",
              "created": 1722734899,
              "depth": 2,
              "replies": [
                {
                  "id": "lghu8jq",
                  "score": 1,
                  "body": "70000 years ago the human population was reduced to under 10,000 individuals.  A good war at that time could have taken us out permanently.",
                  "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lghu8jq/",
                  "created": 1722798954,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgc6519",
      "score": 25,
      "body": "Oh no! More wars in the Middle East?\n\nAnyways…",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgc6519/",
      "created": 1722710561,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgcuf7v",
      "score": 24,
      "body": "And wtf is Iran going to do? Throw more third world drones at israel lol ![img](emote|t5_2th52|4271)",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgcuf7v/",
      "created": 1722719066,
      "depth": 0,
      "replies": [
        {
          "id": "lgd8ozn",
          "score": 3,
          "body": "Hypersonic missiles, last time was a warning this time its real",
          "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgd8ozn/",
          "created": 1722724324,
          "depth": 1,
          "replies": [
            {
              "id": "lgdxaua",
              "score": 2,
              "body": "I mean maybe. They would have to be launched by aircraft and in that case wouldn’t be going as fast as they could. They tried launching some to space last time so they could fly straight down but got blown up before they even got into atmosphere. Those things are really meant to be a global weapon not a regional weapon",
              "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgdxaua/",
              "created": 1722733868,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgd9zca",
              "score": 3,
              "body": "doubt it",
              "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgd9zca/",
              "created": 1722724806,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgdb91x",
          "score": 1,
          "body": "Those third world drones came a long way.\nI bet we will see at least some more military inventory destroyed than last time maybe even some dead israeli soldiers",
          "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgdb91x/",
          "created": 1722725277,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgcq5ab",
      "score": 7,
      "body": "Positions?",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgcq5ab/",
      "created": 1722717560,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgdtf2u",
      "score": 7,
      "body": "There's literally some war about to break out or already underway in the middle east every single day... for the last 4 decades. I don't think markets really give AF about what's going on over there at the end of the day.",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgdtf2u/",
      "created": 1722732297,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgc535h",
      "score": 17,
      "body": "US telling citizens to leave Lebanon so war is pretty much gaurenteed to spread there now",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgc535h/",
      "created": 1722710197,
      "depth": 0,
      "replies": [
        {
          "id": "lgceb85",
          "score": 11,
          "body": "Sometimes that's precautionary but it definitely not a good sign",
          "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgceb85/",
          "created": 1722713429,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgd51jv",
          "score": 3,
          "body": "Heard about plans to evacuate Lebanese refugees to Cyprus about a week ago. Wonder why they would need to plan for that?",
          "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgd51jv/",
          "created": 1722722957,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgeo82x",
      "score": 12,
      "body": "Two points that prove you are clueless:\n\n1. You post the guardian as a source.\n\n2. You think Biden is in charge of anything other than what ice cream flavor he gets each night.",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgeo82x/",
      "created": 1722745887,
      "depth": 0,
      "replies": [
        {
          "id": "lgfy1fg",
          "score": 0,
          "body": "For 2. You are mistaken. I am sure he didn't get to choose the flavour either, because they had no child flavoured one on display",
          "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgfy1fg/",
          "created": 1722774301,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgdfblb",
      "score": 14,
      "body": "Israel assassinated a terrorist chief and you think Iran is going to have to “keep Israel in check.”\n\nYou belong here\n\n![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgdfblb/",
      "created": 1722726823,
      "depth": 0,
      "replies": [
        {
          "id": "lggx4pg",
          "score": 1,
          "body": "What?\nThis guy was top cocksucker in Hamas.\nKilled by bomb planted by double agents.\nOn the day of inauguration of Iran's president, right after they had a conversation.\nThis is one of the biggest embarassments that Israel put Iran in.",
          "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lggx4pg/",
          "created": 1722787785,
          "depth": 1,
          "replies": [
            {
              "id": "lgh025b",
              "score": 1,
              "body": "That’s the point, op really thinks Iran can keep them in check ![img](emote|t5_2th52|4271) they won’t do shit ![img](emote|t5_2th52|4271)",
              "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgh025b/",
              "created": 1722788794,
              "depth": 2,
              "replies": [
                {
                  "id": "lghldg6",
                  "score": 1,
                  "body": "no, the point is they have to. They cannot allow such an attack to go unanswered",
                  "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lghldg6/",
                  "created": 1722795948,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lghlna1",
                      "score": 1,
                      "body": "Yeah, this happened a couple months ago and they sent some drones that got intercepted.\n\nBears lubing themselves up for another false short ![img](emote|t5_2th52|18630)",
                      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lghlna1/",
                      "created": 1722796041,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgcejrw",
      "score": 7,
      "body": "Just buy calls on Hummus companies.",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgcejrw/",
      "created": 1722713511,
      "depth": 0,
      "replies": [
        {
          "id": "lgcgvnu",
          "score": 5,
          "body": "Chickpea futures go brrrrrrrrrrrrrr",
          "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgcgvnu/",
          "created": 1722714331,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgc65iw",
      "score": 7,
      "body": "All this was already priced in. Shipping stocks have had a huge rally this year. In fact, if it does not escalate it will keep tanking",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgc65iw/",
      "created": 1722710566,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgdq2i6",
      "score": 3,
      "body": "Wait for $ZIM",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgdq2i6/",
      "created": 1722730950,
      "depth": 0,
      "replies": [
        {
          "id": "lgg3lo7",
          "score": 3,
          "body": "Yes buy Zim!\nWill be great!\n7 august Maersk present numbers... will be massive.",
          "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgg3lo7/",
          "created": 1722776878,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgcw9nf",
      "score": 3,
      "body": "Problem is all Iran is talk and actually does nothing lol so this will result in nothing happening as usual",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgcw9nf/",
      "created": 1722719730,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgdfl0u",
      "score": 2,
      "body": "Dfen, picked up on Friday.",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgdfl0u/",
      "created": 1722726924,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgevdu5",
      "score": 2,
      "body": "Iran doesn’t retaliate til next Monday and Tuesday\n\nhttps://m.jpost.com/middle-east/iran-news/article-813044",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgevdu5/",
      "created": 1722749803,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgdqt9z",
      "score": 4,
      "body": "$XOP historically has one of the higher correlations to oil prices.\n\nThat’s the play",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgdqt9z/",
      "created": 1722731245,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgcl7tu",
      "score": 2,
      "body": "I wonder how long it took to type all this. Calls on oil and intel",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgcl7tu/",
      "created": 1722715844,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgg0gtk",
      "score": 1,
      "body": "lol, nuffin gonna happen. 2 more weeks, OP.",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgg0gtk/",
      "created": 1722775459,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgg8mm5",
      "score": 1,
      "body": "RTX pays good dividends.  Just sayin'....",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgg8mm5/",
      "created": 1722778995,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgggejh",
      "score": 1,
      "body": "Why would the Straight of Hormuz be complicated if Iran controls it and Israel is on the other side of the land?? Sorry but I don’t get this",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgggejh/",
      "created": 1722781963,
      "depth": 0,
      "replies": [
        {
          "id": "lggjcae",
          "score": 1,
          "body": "Iran would shut it down to screw over western countries, its not a specific military tactic for targeting Israel.",
          "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lggjcae/",
          "created": 1722783028,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lghla2j",
      "score": 1,
      "body": "Oil going up.. happy I bought a Tesla last week",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lghla2j/",
      "created": 1722795917,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lghlmkh",
      "score": 1,
      "body": "All in on TEVA",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lghlmkh/",
      "created": 1722796035,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgdckuk",
      "score": -1,
      "body": "We need war in the Middle East. I'm heavily invested in oil stocks. War in the middle would be 2 positives. Increase in oil stocks and let the Arabs and Jews fight.\n\nWin win.",
      "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgdckuk/",
      "created": 1722725777,
      "depth": 0,
      "replies": [
        {
          "id": "lgg5wgw",
          "score": 1,
          "body": "Just shameless racism at display, mods?",
          "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgg5wgw/",
          "created": 1722777873,
          "depth": 1,
          "replies": [
            {
              "id": "lgg6xvg",
              "score": 0,
              "body": "No racism what's so ever. Israel (Jews) and Iran (Arabs) have been beefing for thousands of year. Let them go to war and fight it out.",
              "permalink": "/r/wallstreetbets/comments/1eja9ta/mideast_instability_going_to_enter_the_chat_this/lgg6xvg/",
              "created": 1722778308,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}