{
  "title": "Shouldn’t we assume the fed had access to the jobs data before the fed decision?",
  "score": 107,
  "selftext": "The jobs data came out one day after the fed meeting. So one of two possibilities: \n\n1) The fed saw it and still held rates steady\n\n2) The fed didn’t see it and made a decision without all the most recent information.\n\nWould the fed really not be able to get a preview of the jobs report when it comes out within a day of a fed meeting?\n\nMaybe they don’t. I don’t know, but it would seem strange that they wouldn’t have the ability to get some kind of preview.",
  "link_flair_text": null,
  "id": "1eji6qd",
  "num_comments": 69,
  "created_utc": 1722730929,
  "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/",
  "comments": [
    {
      "id": "lgebqeg",
      "score": 173,
      "body": "All of this is wrong.\n\nThe Fed meeting was on Tuesday/**Wednesday**\n\nThe jobs report came out on **Friday** morning.\n\nThe only person - outside the BLS - who gets access to the data early is the President, who [traditionally receives the numbers the evening before release](https://www.cbsnews.com/news/jobs-report-trump-tweet-today-breaks-protocol/)",
      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgebqeg/",
      "created": 1722739928,
      "depth": 0,
      "replies": [
        {
          "id": "lgee5d8",
          "score": 51,
          "body": "Should be the top comment. Everyone here making up narratives when Powell himself in past has said they don't have data beforehand.",
          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgee5d8/",
          "created": 1722740994,
          "depth": 1,
          "replies": [
            {
              "id": "lgerir6",
              "score": 29,
              "body": "maybe they should have their meeting after the unemployment numbers come in. a couple days before seems odd",
              "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgerir6/",
              "created": 1722747633,
              "depth": 2,
              "replies": [
                {
                  "id": "lggeq1q",
                  "score": 14,
                  "body": "There’s always another set of numbers to wait for.  Their releases are point in time releases for the facts available at that time.",
                  "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lggeq1q/",
                  "created": 1722781341,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lggwlc8",
                  "score": 3,
                  "body": "And honestly, changes in the Fed rate aren't a precise scalpel that adjusts the economy on a daily, weekly or even monthly basis.",
                  "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lggwlc8/",
                  "created": 1722787599,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lgh0cyu",
              "score": 5,
              "body": "Reddit is the people who comment an entire manifesto a half hour after a 2 hour video comes out.",
              "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgh0cyu/",
              "created": 1722788898,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgf49ej",
          "score": 10,
          "body": "seriously, why is the process like that. How about some \"preliminary numbers\" for Fed to do their fxxking job?",
          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgf49ej/",
          "created": 1722755270,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgeyp2p",
          "score": 4,
          "body": "That’s fair, and why I was asking cause I genuinely didn’t know. And typically there’s probably not a real reason to get economic data early since the decisions don’t line up with the fed meetings anyway. \n\nHowever, you’d think that maybe since the weekly claims numbers was one day after and the jobs report was two days after and since they are such important factors in the feds decision that they would at least make an effort to learn what’s in them.\n\nWhy would you keep them in the dark? Maybe not, but it seems ill advised to restrict their access even when it could have a direct impact on a decision made two days prior.",
          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgeyp2p/",
          "created": 1722751742,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgdu7dv",
      "score": 40,
      "body": "Despite the numbers missing and showing a trend, the overall current figures as well as future figures assuming deterioration, aren’t that high historically.\n\nYou would really need to assume that rate of unemployment increases will accelerate, long enough, for rate reductions to help slow it down.  \n\nEven 5% unemployment isn’t going to drive a massive recession or be a tremendous concern.  \n\nEither way, at best .25 was assumed for a first cut.  The fed could always go straight to .5\n\nMy view, stocks were at historical valuations and would have come down either way (market trend started way before Friday).  This is just traders/analysts piling on the fed which they have been trying to do since the end of 2023.  I’m not nervous about economic conditions.  We still haven’t achieved price stability and employment is fine.",
      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgdu7dv/",
      "created": 1722732611,
      "depth": 0,
      "replies": [
        {
          "id": "lge60x2",
          "score": 10,
          "body": "I’m thinking this is just the start to unemployment increasing, you can’t just raise rates the at the fastest pace in history and expect everything to just be fine. The lag effect is real",
          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lge60x2/",
          "created": 1722737476,
          "depth": 1,
          "replies": [
            {
              "id": "lge66rl",
              "score": 6,
              "body": "Sure although 5.5% unemployment would be fine.  We are far from this.  Inflation remains a larger issue",
              "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lge66rl/",
              "created": 1722737543,
              "depth": 2,
              "replies": [
                {
                  "id": "lgfm6k2",
                  "score": -1,
                  "body": "Private sector unemployment and job growth is already terrible",
                  "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgfm6k2/",
                  "created": 1722767508,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lggn6rg",
                      "score": 4,
                      "body": "Unemployment is low from historical levels as well as fed targets.  \n\nConsidering we came out of a period where there were more job openings than participants in the workforce.",
                      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lggn6rg/",
                      "created": 1722784379,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lghs3lx",
                          "score": 0,
                          "body": "Unemployment increasing at this speed is not a good thing",
                          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lghs3lx/",
                          "created": 1722798221,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lgfaxqo",
              "score": 2,
              "body": "Well 2.5% of the 5.25% rate increase was just to stop stimulating the economy and go back to neutral, so they don't really count. And the fed raised rates by 3% in 1995 and no recession.\n\nI think the reason why a lot of recession indicators broke this time is because they just assume x increase after the bottom will trigger recession. However, lots of these post-covid bottoms were way below normal levels, and need to go up a decent amount just to be normal. Unemployment rate, debt and delinquencies, initial jobless claims are some examples.",
              "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgfaxqo/",
              "created": 1722759729,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgdztlh",
          "score": 2,
          "body": "This. Inflation is still a bit high and unemployment is still in the low range, easy decision. The Fed cannot lose a fight against deflation, inflation is the only thing keeping them up at night.",
          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgdztlh/",
          "created": 1722734907,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgdyi9j",
          "score": 1,
          "body": "Well said",
          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgdyi9j/",
          "created": 1722734370,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgepdmw",
          "score": 1,
          "body": "I’m not convinced this is another 2008 like many people seem to think, but the sahm rule has 100% accuracy. I’m not terribly concerned because the fed has proven that they will endlessly bail out markets and QE when ever problems arise. 2008, 2020, and then the more recent banking crisis is proof, they will destroy the dollar to prop everything up. This could be a larger correction with a more moderate recession, giving another buying opportunity like 2022.",
          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgepdmw/",
          "created": 1722746491,
          "depth": 1,
          "replies": [
            {
              "id": "lgex6zf",
              "score": 0,
              "body": "QE won’t help us if there is a recession coming up.  The bigger issue is stagflation.  \n\nWouldn’t be a big issue if we have low inflation for a year but the real risk is 2-3 years of low price growth.  I’d expect markets to decline significantly if we hit a period of stagflation.",
              "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgex6zf/",
              "created": 1722750841,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lge0bur",
          "score": 0,
          "body": "Glad someone else is thinking this too",
          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lge0bur/",
          "created": 1722735119,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgds3gy",
      "score": 45,
      "body": "Powell want to telegraph his moves. He probably saw a report of the revisions and certainly telegraphed a cut in September. He does not want to jar markets and that’s what would have happened on Thursday if he cut out of nowhere.",
      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgds3gy/",
      "created": 1722731757,
      "depth": 0,
      "replies": [
        {
          "id": "lgeic5w",
          "score": -2,
          "body": "Except the markets got jarred. Bigly.\n\nBecause he’s acting like everything is hunky dory and we don’t need a rate cut until next meeting. Turns out unemployment is accelerating and now they risk being “too little too late” with any cuts.",
          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgeic5w/",
          "created": 1722742969,
          "depth": 1,
          "replies": [
            {
              "id": "lgeq6li",
              "score": 18,
              "body": "The markets got jarred because the ISM report typically tells only investors what they already know. People were overly optimistic and so the manufacturing contraction caused a shock.\n\nThat being said, unemployment is 4.3%. The market is considered to be functionally at full capacity when it's under 5%. For reference, the average unemployment rate over the past century has been about 5.7%, and it peaked at almost 15% in 2020.\n\nA rate cut would have assuaged market concerns but the numbers really don't call for it. As I mentioned, the selloff is because we got an unexpected result from a predictable report and panicked.",
              "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgeq6li/",
              "created": 1722746915,
              "depth": 2,
              "replies": [
                {
                  "id": "lgfaj5e",
                  "score": 2,
                  "body": "I'm not sure why the market freaked out over manufacturing ism. First, everyone knows our manufacturing has been weak for 2 years, basically manufacturing recession in 2022. It's the service sector that powers the us economy.\n\nSecond, the ism employment component gets revised too. And it wasn't the first time ism employment went down below 45 in the last year or two. One time it hit that last year it was revised back up. And the other times we had it, market didn't even faze or drop at most 0.5-1%",
                  "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgfaj5e/",
                  "created": 1722759459,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lgg2etp",
                  "score": 1,
                  "body": "UI is accelerating. The market is forward looking and fears continued acceleration without rate cuts will have UI past the danger point of 5% very soon. Then when that happens you are too late by 6 months for rate cuts. \n\nCuts need to have come July. September may be okay but it’s possible that’s too late. If they cut September and Ui is about 4.5% there’s trouble brewing. I’m",
                  "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgg2etp/",
                  "created": 1722776350,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lggko4v",
                      "score": 0,
                      "body": "I suspect they will do a cut in 2 weeks at this rate.",
                      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lggko4v/",
                      "created": 1722783500,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lggvtzs",
                          "score": 1,
                          "body": "An emergency cut would tank the market for sure",
                          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lggvtzs/",
                          "created": 1722787338,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lgikbmk",
                          "score": 1,
                          "body": "Some people say silly comments because they are ill informed. But this one takes the cake as the silliest I’ve read today, and you’re even informed",
                          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgikbmk/",
                          "created": 1722807966,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgfituq",
      "score": 8,
      "body": "Just six to 12 months ago the prevailing narrative was that the Fed are idiots for not raising rates higher to combat rampant inflation and talks of cuts are idiotic. Now the Fed are idiots for not cutting sooner to avoid a recession because of course inflation was always going to come down and employment is more important. \n\nPeople here are reacting to stock market moves not the economy and the Fed are actually doing a pretty good job. After seeing the crazy ideas people had in 2022 (‘JPow just has to pull a Volcker’ etc.) I wouldn’t take the macroeconomic opinions of this sub seriously.",
      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgfituq/",
      "created": 1722765227,
      "depth": 0,
      "replies": [
        {
          "id": "lggunco",
          "score": 2,
          "body": "The general rule of all discourse: unhappy people are louder than happy people.  No matter what the fed does (or any other entity, think when a game developer makes an unexpected change), the people who are the most vocal are the people who are unhappy or disagree.  The happy people are off doing happy people shit, not posting on reddit.",
          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lggunco/",
          "created": 1722786933,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lge1k88",
      "score": 4,
      "body": "If we're going to play hindsight, the mistake that was made by the Fed here was to take what was seen in Q1 with the overall data seriously.\n\nThere were some whispers that there were thoughts about rate hikes when we saw the June SEP by the most hawkish Fed members, and it was at that point where we had just seen proof that the new year effects had a decent impact on the data (as in, making inflation/the economy look warmer than it really was) for the second year in a row.\n\nThey really should've disregarded the Q1 data and gone in June I'm thinking. It would've caused a bit of an uproar, but for me, there isn't a world where 25 bps cuts are reigniting inflation.",
      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lge1k88/",
      "created": 1722735637,
      "depth": 0,
      "replies": [
        {
          "id": "lge5hcw",
          "score": 1,
          "body": "True .25 won’t make a huge impact and even that impact is delayed +6 months BUT the numbers aren’t bad.  Also current benchmark rates are actually low to about baseline when looking at the last 50 years.\n\nSuper low rates became a drug and it’s unfortunate to see so many people think rates right now are “high”. \n\nEither way inflation is still a problem when it comes to backwards data and employment remains more than adequate.",
          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lge5hcw/",
          "created": 1722737250,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgeqnxq",
          "score": 0,
          "body": "If we’re playing hindsight, we didn’t need anywhere near the QE they did. They absolutely flooded the market with money and made all other historical intervention look like nothing. This mess could have been completely avoided with more reasonable policy following covid.",
          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgeqnxq/",
          "created": 1722747173,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgdyi5n",
      "score": 3,
      "body": "The labor report wasn’t a significant surprise or factor in the stock market correction. The numbers are well in line with the trend. The market correction is mostly due to lack of liquidity with Japan’s reversal to restrictive fiscal policy. The Fed will attempt to compensate for that well before the next meeting in September.\n\nNot to say they shouldn’t have already begun cuts; I think they should have, and that we’re essentially already in a mild recession. But there was nothing in last week’s reports that might have changed their decision",
      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgdyi5n/",
      "created": 1722734369,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgdr51g",
      "score": 3,
      "body": "Good point",
      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgdr51g/",
      "created": 1722731375,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgf6b5t",
      "score": 1,
      "body": "The FED at this point in the game probably has real time access and A.I forecast models by now.\n\nTheir role is to manage expectations.",
      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgf6b5t/",
      "created": 1722756626,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgkblnb",
      "score": 1,
      "body": "It is NOT the job of the Fed to keep stocks up! The Fed sponsors Bogleheads but one day will come a reckoning where actually timing the market will be more important than time IN the market. Especially when Bogleheads retire and are still 90% invested in tech stocks.",
      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgkblnb/",
      "created": 1722834759,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgdxe13",
      "score": 0,
      "body": "Why is the lower yield on the 10 year supposedly now a bad thing? \n\nI thought everyone wanted rates, especially mortgage rates influence by the 10 year, to come down and stimulate housing sales.",
      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgdxe13/",
      "created": 1722733905,
      "depth": 0,
      "replies": [
        {
          "id": "lge0c29",
          "score": 0,
          "body": "It's the speed of the move. Yesterday (and frankly what we've seen from July 24th) is too fast, just like how that fast move from 3.8 to 5 on the US10Y last year was too fast to the upside with treasury rates.\n\nAlso, the US large cap averages at least haven't exactly traded off treasury rate movement for over a year. It just hasn't been as obvious as clear day until that June CPI day that we kind of have mostly flipped back to bond rallies not necessarily being good for stocks (but really, it's been when it's been stable where stocks have been fine).",
          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lge0c29/",
          "created": 1722735121,
          "depth": 1,
          "replies": [
            {
              "id": "lge0q3p",
              "score": 1,
              "body": "But if the Fed had cut .25 on Thursday  wouldn't the 10yr have dropped by .25 anyway?  Isn't that what folks wanted?",
              "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lge0q3p/",
              "created": 1722735284,
              "depth": 2,
              "replies": [
                {
                  "id": "lge25pj",
                  "score": 2,
                  "body": "That actually may not necessarily be the case, in fact, them going may have softened the speed of the move down by treasury rates.\n\nFed cutting=support for the economy=treasury rates don't go down as hard.\n\nI know that's not usually how it goes, but at least at the moment, there's still some residual inflation fears and feel that the US economy is strong, so treasury rates may not do the thing that you'd think would happen.",
                  "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lge25pj/",
                  "created": 1722735887,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lge2g59",
                      "score": 2,
                      "body": "It's so damn confusing.   lol",
                      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lge2g59/",
                      "created": 1722736010,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgdvuzs",
      "score": -3,
      "body": "Of course they did. That's why everyone else who knew it before us said they fucked up. Half point in September or we need a new fed.",
      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgdvuzs/",
      "created": 1722733278,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgi4tgy",
      "score": 0,
      "body": "easy way to fix the system\n\nmake Ron Paul the Fed Chair",
      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgi4tgy/",
      "created": 1722802589,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgdwb4d",
      "score": -6,
      "body": "I'm sure the Fed knew.  Which is further proof that Powell and the Fed are not the sharpest knives in the drawer.  They were late on inflation and now they're late on the slowdown/recession.  Cutting from here on out won't be enough - takes too long for the economic benefits to flow through the system",
      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgdwb4d/",
      "created": 1722733460,
      "depth": 0,
      "replies": [
        {
          "id": "lgdyain",
          "score": 4,
          "body": "I disagree. They may not always get it right, but they are in the best position to make these decisions. Powells smart (certainly not stupid) and making completely reasonable policies based on the data. He willingly explains his rational and it’s all logical. People may disagree on the assumptions, but he’s trying to forecast something that is extremely dynamic, and just like with stocks, something that nobody on the planet can predict. \n\nThere’s a reason he saw the data (if he did) and the rest of the fed chairs saw the data and didn’t react the way the market did.\n\nThe only thing I worry about is that they are trying to hold off on cutting rates longer than they should because Republicans will try to claim they’re being  political if the data isn’t overwhelming in favor of a cut. I don’t believe the fed is political, but I believe they often let criticism from law makers influence their decisions on the margins.",
          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgdyain/",
          "created": 1722734280,
          "depth": 1,
          "replies": [
            {
              "id": "lgdzdqt",
              "score": 0,
              "body": "I agree with a lot of that, but that doesn't make him or the others immune from criticism.  The undisputed fact, as admitted by Powell himself, is that they made a huge mistake in failing to recognize the rise in inflation, despite its widespread nature.  Now he's making the same mistake on the other side.  Yes it's a tough job, but the Fed routinely makes the same mistakes despite supposedly being experts on financial history.  The Fed routinely takes too long to cut, and too long to raise, which is why soft landings almost never happen.  Inflation is well under control but they are still obsessed with it despite having a dual mandate.  They always overfocus on the last battle and thereby lose the next one.",
              "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgdzdqt/",
              "created": 1722734727,
              "depth": 2,
              "replies": [
                {
                  "id": "lge0nu3",
                  "score": 1,
                  "body": "I agree. They’re always too early to hike and too late to cut because by the time it shows up in the data it’s too late.\n\nIn hindsight, he should have recognized that the uptick in COVID cases and additional variants weren’t going to affect consumer behavior like it did at the onset of the pandemic. People were tired of the virus and not scared of it in the way they were before. He should have known that the easing of Covid restrictions would also cause a tsunami of demand and there’s no way that production could catch up, especially given that our manufacturing hubs in Asia and elsewhere around the world took a more cautious approach to the virus. \n\nAs far as the most recent report. The Fed is also aware that the Fed is always late to cut. Knowing that, why wouldn’t they also feel the need to cut?\n\nIt’s the most obvious response. Makes me wonder if they are seeing some mitigating factor that belies the numbers in the report.",
                  "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lge0nu3/",
                  "created": 1722735258,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lge2w7o",
                      "score": 1,
                      "body": "I can't speak for Powell but my guess is that, while they're aware at an intellectual level that the Fed is consistently too late to cut, they were not the ones in charge in the past, and they assume they are reading the current data better than their predecessors read the past data.  It's like a blackjack player who knows the house usually wins but is convinced that they are smarter than the other players.",
                      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lge2w7o/",
                      "created": 1722736195,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lgdywwx",
          "score": 1,
          "body": "Or this is an overreaction and the Feds actually want and anticipate unemployment to creep up a bit more and the stock market to correct in order to get inflation down to closer to 2%, which is what they’ve said their goal is since the very beginning.",
          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgdywwx/",
          "created": 1722734537,
          "depth": 1,
          "replies": [
            {
              "id": "lge1i13",
              "score": 3,
              "body": "It’s true that that’s been the goal but to be fair they have acknowledged that getting there may not be achievable without cutting rates. I have a hunch we are in for some pop up news in the next couple days that would turn things around. Profit margins are tight across the board, but dividend stocks tend to pump on the brink of recessions. If we keep going up then many of these companies could be provided with opportunities to buy back some of their own stock at a lower price.",
              "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lge1i13/",
              "created": 1722735612,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgdzwnn",
              "score": 1,
              "body": "The Fed doesn't really care that much about the stock market, nor should they (other than wealth effects etc).  They have a dual mandate, not just inflation.  The problem is they once again have waited too long and for too much data - if you insist on getting 100 data points to make you feel extra confident about the pace of inflation, you've now waited too long to cut and have failed your other mandate.  And this keeps happening in every economic cycle and yet the Fed never seems to learn.",
              "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgdzwnn/",
              "created": 1722734943,
              "depth": 2,
              "replies": [
                {
                  "id": "lge12vj",
                  "score": 2,
                  "body": "I slightly worry that maybe they’re trying to drag out cuts until the data is overwhelming, or at least unassailable, because they will be accused of being political if there’s any question whatsoever with the election coming up. \n\nStill if they felt we really needed a cut. I still think they would do it despite the potential political criticism.",
                  "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lge12vj/",
                  "created": 1722735433,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lge3c2b",
                      "score": 0,
                      "body": "Agree that they probably worry a little about politics but here I think (not positive) that both parties are calling for a cut.  And anyway they will (or should) care more about how history judges them, and since they already messed up once, you'd think they'd be worried about a second mistake.  \n\nCome to think of it, I think they're overly paranoid about the double dip in the early 80s, where inflation came back",
                      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lge3c2b/",
                      "created": 1722736379,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lge3yel",
                          "score": 1,
                          "body": "Yeah, I think they skew more to risking a recession than a resurgence in inflation for sure.",
                          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lge3yel/",
                          "created": 1722736635,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgdwf0y",
      "score": -9,
      "body": "\nTheir job is to control inflation...\nThey don't care about jobs....\nLook at the employment rate during the 70s when inflation was out of control and the economy was stagnant...\nThat created stagflation...\n\nJobs do not direct rates.... economy and inflationary pressures do...",
      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgdwf0y/",
      "created": 1722733506,
      "depth": 0,
      "replies": [
        {
          "id": "lgdxk43",
          "score": 6,
          "body": "That’s actually completely wrong. It’s like fed 101. They have a dual mandate to maintain price stability and full employment. You shouldn’t comment about things you know nothing about because that’s some really basic stuff.",
          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgdxk43/",
          "created": 1722733974,
          "depth": 1,
          "replies": [
            {
              "id": "lgdzbg0",
              "score": 1,
              "body": "They are completely fine with unemployment ticking up a bit. Do they want 6%+? No, but getting up to 5 seems like it would be the lesser of the two evils if they had to choose inflation.",
              "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgdzbg0/",
              "created": 1722734701,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lge03gy",
              "score": -5,
              "body": "Inflation is price stability..... you goof..\nNo different when they try to fight deflation...\nGet a dictionary. \n\nJobs don't play a role in that decision making.....job losses will not mean they will cut rates if inflation is out of control.. \n\nI jist told you... look at the 70s for proof...\nUnemployment was high... inflation was out of control...\nOur economy was suffering from stagflation....\n\nBefore talking smack and calling someone stupid..\nYou should first understand what someone is saying...",
              "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lge03gy/",
              "created": 1722735022,
              "depth": 2,
              "replies": [
                {
                  "id": "lge4ufp",
                  "score": 3,
                  "body": "The feds dual mandate means managing to both.  I’m hoping your initial comment was just semantics and what you were trying to say is that they aren’t worried about employment and are only focusing on inflation (for now).",
                  "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lge4ufp/",
                  "created": 1722736989,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgf5sxl",
                      "score": 0,
                      "body": "Exactly my point..\n\n but also pointing to the fact Powell is a Volcker fan... He will drive unemployment up to curb inflation if he has to..\nSo keep your eye on those pressures before following everyone's idea of a cut... those inflation roads have to be clear... I am not sure they are...\nWe are looking like a 70s rerun.... which I hope doesn't happen..\n\nHere is one article on it, so everyone knows my thinking..\nGuess my point is, just keep your eyes open and ignore the news..(for now)\n\nhttps://www.forbes.com/sites/jonathanponciano/2022/11/02/fed-chair-jerome-powell-haunted-by-the-ghost-of-paul-volcker-could-tank-the-economy/",
                      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgf5sxl/",
                      "created": 1722756286,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lge27mh",
                  "score": 2,
                  "body": "I’m not talking about the price stability side obviously. You said that they don’t care about jobs, that’s the full employment side… you goof.\n\nAre you ok?",
                  "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lge27mh/",
                  "created": 1722735910,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgf5r64",
                      "score": 2,
                      "body": "I am referring to the management of rates right now.\nThey are more concerned about price stability.\nThey don't care about jobs when they have something like stagflation at risk. To prove that, I said, \"Look at what happened in the 70s.\"\nInflation was high, and even though the jobless rate was also high and going to get worse,  they raised rates anyway... to double digits... They had to make a choice between the two..\n\nPowell is known to believe in the Volcker rule, and is following it slowly. I believe the only reason he is moving slowly is due to the political environment. Think me stupid or not, I don't care... I am no stranger to this game with 30 years  of experience and a masters... I might be saying something you are not fully understanding... rather than attacking me, you might ask for clarity...\n\n\n\nhttps://www.forbes.com/sites/jonathanponciano/2022/11/02/fed-chair-jerome-powell-haunted-by-the-ghost-of-paul-volcker-could-tank-the-economy/",
                      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgf5r64/",
                      "created": 1722756254,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgduhqw",
      "score": -4,
      "body": "I believe Powell mistakenly cut the Fed funds rate to 0 during Covid. With all the stimulus and low rates, inflation was inevitable.",
      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgduhqw/",
      "created": 1722732728,
      "depth": 0,
      "replies": [
        {
          "id": "lgdzsk4",
          "score": 2,
          "body": "This is the hard hitting analysis were all in this sub to see.",
          "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgdzsk4/",
          "created": 1722734895,
          "depth": 1,
          "replies": [
            {
              "id": "lgestt8",
              "score": 1,
              "body": "This is completely valid. It’s sad that you people are all talking about fixing problems that are a direct result of these policies and you can’t see that maybe they just over did things after covid. I’m completely convinced none of you have actually looked at the data. The QE during covid was done to the most ridiculously extreme level. Money supply jumped 20% in about 4 months. They aren’t looking at data to fine tune QE. The basically went oh, shit. the economy is shut down and we could have a depression, flood the markets with as much money as possible. They didn’t even do QE until after 2008, it is a big experiment gone wrong.",
              "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgestt8/",
              "created": 1722748348,
              "depth": 2,
              "replies": [
                {
                  "id": "lgflu5i",
                  "score": -1,
                  "body": "Dude. Shut up. I wasn't commenting on the validity of the idea. I was commenting on the fact the guy made the least nuanced comment possible about something that is tangentily related to the topic at hand....\n\nSo maybe pipedown with you're rambling",
                  "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgflu5i/",
                  "created": 1722767279,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lget6do",
              "score": 0,
              "body": "The idea that the fed are a bunch of geniuses with perfect analysis and policies is laughable. Currencies and economies collapse all the time as a direct result from bad central bank policy. The fed is no different they have created just as many problems as they’ve fixed.",
              "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lget6do/",
              "created": 1722748543,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgdy76q",
      "score": -6,
      "body": ".75 cut incoming bro",
      "permalink": "/r/stocks/comments/1eji6qd/shouldnt_we_assume_the_fed_had_access_to_the_jobs/lgdy76q/",
      "created": 1722734241,
      "depth": 0,
      "replies": []
    }
  ]
}