{
  "title": "Interesting development in technology stocks! Is the AI bubble here?",
  "score": 58,
  "selftext": "[removed]",
  "link_flair_text": "Discussion",
  "id": "1ejt49n",
  "num_comments": 123,
  "created_utc": 1722771136,
  "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/",
  "comments": [
    {
      "id": "lgfs28w",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 20 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgfs28w/",
      "created": 1722771138,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgfw1wf",
      "score": 105,
      "body": "People will definitely be using AI tools- but mostly it will be integrated by tech companies in existing tools. Yes, whether AI integration will make extra money is the key question.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgfw1wf/",
      "created": 1722773300,
      "depth": 0,
      "replies": [
        {
          "id": "lgg4cwi",
          "score": 30,
          "body": "It won’t. We are so far off of what the general public thinks AI is capable of",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg4cwi/",
          "created": 1722777209,
          "depth": 1,
          "replies": [
            {
              "id": "lggclsf",
              "score": 61,
              "body": "Anecdote incoming. I work in data. One of the platforms we use for writing our data manipulation code just got an AI upgrade. Well, the first brush at it was about 6 months ago. It used to be shit, a complete waste of time. About 2 weeks ago a new version rolled out that constantly has an autocomplete line ahead of the cursor, guessing what you’re typing. It’s absolutely phenomenal, frequently guessing a few hundred characters correctly. It’s already saving me a few minutes with every query. Even if it doesn’t improve from here it’s providing a 10-20% uplift in time efficiency.  \nI have already heard a (senior) colleague say “how am I supposed to use any other platform after using this?”.  \nI can’t comment on how that’s going to cause knock on effects, or what that must have cost to provide the 10-20% uplift. But it’s completely renewed my excitement. \nWait till these AI upgrades hit advertising with full force. It’s going to be a huge economic multiplier for the big boys.",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggclsf/",
              "created": 1722780542,
              "depth": 2,
              "replies": [
                {
                  "id": "lggjel4",
                  "score": 17,
                  "body": "It’s already changing medicine and dentistry. It can now detect breast cancer significantly earlier than humans. Better cavity detection rate too.",
                  "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggjel4/",
                  "created": 1722783051,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lggqf3z",
                      "score": 4,
                      "body": "And that shit is exciting, but what will be the downfall of so many things is when business chads are deciding that the efficiency tool is a replacement strategy and starts laying off people left and right with zero actual insight. \n\nInstead of making everyone more productive, the entire field takes a hit.",
                      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggqf3z/",
                      "created": 1722785490,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lgh5vqb",
                          "score": 1,
                          "body": "I feel that. It would be so easy to fuck this up and demolish the knowledge base of a company.",
                          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgh5vqb/",
                          "created": 1722790768,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lggi887",
                  "score": 6,
                  "body": "If you love AI advertising potential like I do, META probably is the best bet. Zuckerberg has been prioritizing that vertical for a while now.",
                  "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggi887/",
                  "created": 1722782626,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lggno5j",
                  "score": 2,
                  "body": "Another great example is the original Will smith AI video eating spaghetti vs the recent one they remade this year. A world of difference. ",
                  "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggno5j/",
                  "created": 1722784544,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lggv8jt",
                  "score": 1,
                  "body": "Is this snowflake?",
                  "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggv8jt/",
                  "created": 1722787133,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lggwjgr",
                  "score": 1,
                  "body": "Which platform is it ? Snowflake ? What u use is better than GitHub copilot for auto complete ?",
                  "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggwjgr/",
                  "created": 1722787581,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lggo867",
                  "score": 1,
                  "body": "Great, so now developers will have extra time to fuck off and start breweries while management and bueracracy and compute cycles continue to be the bottlenecks like they always have been and will be.",
                  "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggo867/",
                  "created": 1722784738,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgh6593",
                      "score": 1,
                      "body": "I wish you were wrong.",
                      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgh6593/",
                      "created": 1722790857,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lgghie3",
              "score": 8,
              "body": "NGL - as a programmer, its sooo nice when a client lets us use AI tools (some are worried about data/code leaks) - AI pretty much writes all the tests for me, and writes a bulk of the main boiler plate code. I just edit and perfect what it writes, occasionally writing some parts AI can't manage to get right yet.",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgghie3/",
              "created": 1722782365,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lggf35z",
              "score": 5,
              "body": "This. Im pretty sure if u ask the new wave of retail ai investors what they think they are investing in, 99% will think of Hollywood ai skynet superbrain computers and not LLMs and chatbots which just give out answer based on probability and stochastics.",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggf35z/",
              "created": 1722781476,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lggcjtw",
              "score": 5,
              "body": "Hard disagree. AI/ML are unlocking the full potential of dynamic and surge pricing just to make an example of revenue generation. And predictive maintenance for costs reduction.",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggcjtw/",
              "created": 1722780522,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lggm68x",
              "score": 2,
              "body": "It will. First, it will make existing businesses more efficient at delivering their services (deliver faster or with less people), which means higher margins. Secondly, this is a foundational technology, like the Internet. There will be new industries built on the back of this over the next decade that we can't imagine yet.",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggm68x/",
              "created": 1722784028,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lggwhiq",
              "score": 1,
              "body": "AI chat bots are a plague. Chat bots were a plague, AI is worse.",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggwhiq/",
              "created": 1722787563,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lggiub5",
          "score": 2,
          "body": "Imo it will make extra money, but not as much as investors hopes",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggiub5/",
          "created": 1722782846,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lggpfpy",
          "score": 2,
          "body": "I have been working on AI and implemented it in few apps in my company.     \n\n1) AI will pick up in spaces where 'accountability' is not to be held like Social Media, Advertising, Search results etc (i.e. even if 5-10 wrong posts, ads, reeels were shown to ppl it is not a big deal because 90% accuracy works there).    \n\n2) AI needs more time for spaces where there is high 'accountability' like self driving cars, mission critical probes, or at B2B level, hospitals, etc This is where even a slightest mistake can cost something big.     \n\nI see META, Google,  etc using it a lot. Others need time especially at B2B level accuracy is paramount and thats where I see AI needing more time.",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggpfpy/",
          "created": 1722785153,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lggjvpu",
          "score": 5,
          "body": "you really think a lot of people will use the mildly useful ai tools when they raise the prices? and they will have to rise them a lot to make any money, running those shitty chatbots and image generators is very expensive\n\nto get a return on the stupidly insane ammount of money they put into this they need more than a few tech companies using them",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggjvpu/",
          "created": 1722783221,
          "depth": 1,
          "replies": [
            {
              "id": "lggqmbn",
              "score": 2,
              "body": "A few tech companies? lol every single tech company uses AI and this is not counting every single piece of software used internal now has AI integrated into their platforms.\n\nSure there might be a “bubble” in the sense that not every company will survive the earlier days of the book but it’s here to stay and it will only get more and more of a foothold.\n\nWe are about a few years away from seeing low level jobs be completely displaced. \n\nRight now, you can use AI and to write code that would normally take 5+ engineers to do in a month, in about  a few days with AI. It would take a couple engineers a couple days to fix up the code and get it ready for testing and deployed.",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggqmbn/",
              "created": 1722785558,
              "depth": 2,
              "replies": [
                {
                  "id": "lggsiwe",
                  "score": 2,
                  "body": "The reality is completely different. It has increased burden on skilled programmers as the code it generates is basic and buggy and low skilled programmers can't even make use of it as they are already bad at proramming and can't debug.",
                  "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggsiwe/",
                  "created": 1722786212,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lggsyjr",
                      "score": 0,
                      "body": "It’s not perfect but it’s gotten wayyyyy better. In the last 12 months it went from a complete mess to fixable .\n\nIt’s probably a year or two away from being a normal code review.\n\nThe biggest thing is that the AI needs to train on your own code and learn how your team writes.\n\nWhat you’re talking about is folks using gpt to write code and that too probably a year or two ago.\n\nTools like Claude are already usable and are improving at a crazy rate.\n\nThat’s why low skilled coders will be replaced as I mentioned ruined. New roles will pop up that specifically address the gaps in the AI.",
                      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggsyjr/",
                      "created": 1722786359,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lgguwb6",
                          "score": 1,
                          "body": "I'll give Claude a try but not too hopeful based on what I have seen other tools do.",
                          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgguwb6/",
                          "created": 1722787018,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lggvq0g",
          "score": 1,
          "body": "It will save money for sure, like using robot to flip burgers.",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggvq0g/",
          "created": 1722787300,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgg8tdg",
          "score": 2,
          "body": "AI generated porn is all that it will be useful for. AI anything at work is woeful and annoying.",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg8tdg/",
          "created": 1722779071,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgg4gop",
          "score": -8,
          "body": "Opinions like these make me realize there are still a LOT of people that don't truly understand AI and how much it will change practically every workspace in the next few decades. No offense but im almost speechless 😅",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg4gop/",
          "created": 1722777255,
          "depth": 1,
          "replies": [
            {
              "id": "lgg4vcc",
              "score": 8,
              "body": "Nothing that exists today remotely resembles artificial intelligence exists today nor will anything that might exist in the near future.\n\nFurthermore the large language models that they used to get these somewhat novel results was based on stealing and categorizing a huge amount of data and that it appears that this approach has no way to develop into any sort of general intelligence.\n\nMuch like with cryptocurrency it’s a new buzzword to excite investors and it’s not going to make a difference in how most people work.",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg4vcc/",
              "created": 1722777430,
              "depth": 2,
              "replies": [
                {
                  "id": "lgg62qz",
                  "score": 3,
                  "body": "Brother we are already generating a LOT of money thanks to AI in the media business and LLMs are like 1% of whats currently available for businesses. AGI wont come from an LLM, thats like saying consciousness comes from speech. LLMs are the result of a specific area of machine learning but not the core of all AI. I'll also tell you almost every industry from medicine to the military is developing AI specific to their fields.",
                  "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg62qz/",
                  "created": 1722777948,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lggdk96",
                      "score": 2,
                      "body": "Everyone giving you downvotes.but I fully agree since I work with military and public customers in that space and many many use cases are currently being developed and rolled out.",
                      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggdk96/",
                      "created": 1722780907,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lgghbst",
                      "score": 0,
                      "body": "100%, ppl downvoting you are just LLM delusionals due to chatgpt hype.",
                      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgghbst/",
                      "created": 1722782300,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lgh27y3",
                          "score": 0,
                          "body": "This post has been eye-opening 😆I was under the impression that by now the majority of people had at least basic-level knowledge on AI and where it's going but wow was I mistaken 😅\n\nOn one side this is good news because I thought AI stocks were going up based on people understanding the tech.... but if this Reddit thread represents the masses then this \"AI bubble\" would have a ton of room to rally more once the masses reach a true \"ah-hah!\" moment and genuinely understand it 🤷‍♂️",
                          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgh27y3/",
                          "created": 1722789532,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lggkbkx",
              "score": 1,
              "body": "I bet you bought nft",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggkbkx/",
              "created": 1722783377,
              "depth": 2,
              "replies": [
                {
                  "id": "lghau0u",
                  "score": 2,
                  "body": "He posts on singularity, tells you all you need to know.",
                  "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lghau0u/",
                  "created": 1722792435,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lghadad",
              "score": 1,
              "body": "Bet if we go far back enough in your post history you were saying how NFTs were amazing",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lghadad/",
              "created": 1722792281,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgg4zp4",
              "score": 1,
              "body": "I am also curious how this will pan out. I do not claim I know everything- but I am so skeptical given the hype over it.",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg4zp4/",
              "created": 1722777482,
              "depth": 2,
              "replies": [
                {
                  "id": "lgg6n6y",
                  "score": -1,
                  "body": "That's completely understandable and these are a couple of good books I recommend to really \"get it\": \n- The Singularity is Nearer\n- Life 3.0\n- The 4th Stage\nI know there's a lot of hype and yes a lot of it is BS but if you read into the actual tech behind it, how its growing and in what fields it has already performed incredible results then you will realize how much change we are about to experience, for better and for worse 😅",
                  "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg6n6y/",
                  "created": 1722778185,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgg913y",
          "score": 1,
          "body": "AI will be cost saving tool, meaning more layoffs. It will be a while till iAI is used for revenue generating. Wheres is most wealth? It’s with the boomers and many dont know how to even use smart phones. Younger or next generation will use them in 10 to 20 years from now.",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg913y/",
          "created": 1722779159,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgg8jj7",
      "score": 17,
      "body": "Reads like ChatGpt wrote this post",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg8jj7/",
      "created": 1722778961,
      "depth": 0,
      "replies": [
        {
          "id": "lgge6wf",
          "score": 3,
          "body": "Now we know why ChatGPT output sounds regarded ",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgge6wf/",
          "created": 1722781145,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lggwv8z",
          "score": 1,
          "body": "literally im starting to feel like these are Bots making these posts to drive panic Or something they all hinge on the same idea and they love the warren buffet argument when He had to trim his apple holdings",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggwv8z/",
          "created": 1722787694,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lggm608",
          "score": 0,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggm608/",
          "created": 1722784025,
          "depth": 1,
          "replies": [
            {
              "id": "lggobzz",
              "score": 3,
              "body": "It is. I'm not using it to try fool anyone though.",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggobzz/",
              "created": 1722784775,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgft8fq",
      "score": 52,
      "body": ">Berkshire Hathaway dumps 49% or nearly $76B dollars of Apple stocks, blaming Apple's declining revenues in China, its regulatory woes, and the absence of a compelling growth vector (including AI)\n\nLiterally bullshit. Buffett even was asked in the conference why he was selling and he said neither of those things. \n\nRemember this, fellow regards:  \nThere are several reasons an investor is selling a position, but there is only one reason why he is buying - Peter Lynch.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgft8fq/",
      "created": 1722771794,
      "depth": 0,
      "replies": [
        {
          "id": "lgg4mri",
          "score": 14,
          "body": "And he still holds 75% stock and 25% cash but the way this is worded it sounds like he panic sold over last weeks headlines 💀🤣",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg4mri/",
          "created": 1722777328,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgfv15g",
          "score": 17,
          "body": "Hathaway ditched their position due to tax reasons. It was the first time they had the option of dropping their position with less than 30% tax on the profit. \n\n https://www.forbes.com/sites/petercohan/2024/08/03/why-warren-buffett-dumped-56-of-berkshires-apple-stock/",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgfv15g/",
          "created": 1722772758,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgg3uvm",
          "score": 5,
          "body": "most bullish of indicators ![img](emote|t5_2th52|18630) rebound any time now ![img](emote|t5_2th52|18630) to the moon from here, stonks go up indefinitely",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg3uvm/",
          "created": 1722776990,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgggz2m",
          "score": 1,
          "body": "Why in the world would Warren tell the truth to billions of people and risk the stock cratering if he’s wants to keep the price up to sell more to future bag holders?",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgggz2m/",
          "created": 1722782171,
          "depth": 1,
          "replies": [
            {
              "id": "lggwea2",
              "score": 0,
              "body": "He has integrity that’s literally his whole brand and reputation. Lose money for the firm and he will be understanding, lose a shred of reputation for the firm and he will be ruthless - paraphrasing",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggwea2/",
              "created": 1722787533,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lggag9t",
      "score": 7,
      "body": "People having been saying the same thing for a year now. A couple weeks of red and everyone calls back for the AI bubble but once the market starts looking better again everyone forgets. \n\nI personally don’t see a bubble because everyone is so aware of bubbles compared to back then. I think the bubble is less likely to burst but instead just slump",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggag9t/",
      "created": 1722779716,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgglk4y",
      "score": 6,
      "body": "Dumb take.\n\nYou're asking if the AI bubble burst because of a sell off in... Intel and Apple? Which are not AI companies and didn't participate in the AI run up?",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgglk4y/",
      "created": 1722783811,
      "depth": 0,
      "replies": [
        {
          "id": "lggvqce",
          "score": 1,
          "body": "Indeed, they are major tech stocks, and have little to do so far in the AI space. Intels drop makes sense because its fundamentals have changed significantly. Apples drop does not make sense, because their fundamentals are completely unchanged.",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggvqce/",
          "created": 1722787303,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgfw7jw",
      "score": 17,
      "body": "The problem isn’t if AI is useful, it is in some cases.\n\nThe problem is what is the cost and ROI on achieving that usefulness? No shareholder is going to keep bidding up these stocks if there’s a -10,000% profit margin like we’re seeing now.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgfw7jw/",
      "created": 1722773381,
      "depth": 0,
      "replies": [
        {
          "id": "lggo3hq",
          "score": 2,
          "body": "Yeah these systems are immensely expensive to build, maintain and improve. Oftentimes for minimal immediate authentic benefit.\n\nA lot of investors are going to get burned. Possible “AI” winter could set in during the next decade.  \n\nTools will continue to advance but the main confluence-derived engines of their creation will be diminished.",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggo3hq/",
          "created": 1722784693,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgfuq4k",
      "score": 13,
      "body": "Maybe Buffet is buying nvda and amd",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgfuq4k/",
      "created": 1722772593,
      "depth": 0,
      "replies": [
        {
          "id": "lgfxjf3",
          "score": 8,
          "body": "That would be nice",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgfxjf3/",
          "created": 1722774053,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgggd8y",
          "score": 6,
          "body": "He’s buying Intel to save his grandson.",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgggd8y/",
          "created": 1722781950,
          "depth": 1,
          "replies": [
            {
              "id": "lggi4zn",
              "score": 12,
              "body": "https://preview.redd.it/cucrnhj5tngd1.jpeg?width=1170&format=pjpg&auto=webp&s=5034117e0f2f1273ce2212de405f3437e0f6db9e",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggi4zn/",
              "created": 1722782594,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lggdfgq",
          "score": 2,
          "body": "This  ![img](emote|t5_2th52|27189)![img](emote|t5_2th52|27189)",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggdfgq/",
          "created": 1722780857,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lggon7m",
          "score": 2,
          "body": "According to apes he's buying memestocks and you sound just as deluded, cultish and regarded as them saying shit like this.",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggon7m/",
          "created": 1722784882,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgg4uu2",
          "score": 1,
          "body": "Nancy Pelosi just bought 10,000 shares of Nvidia lol",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg4uu2/",
          "created": 1722777424,
          "depth": 1,
          "replies": [
            {
              "id": "lggnleh",
              "score": 1,
              "body": "10000 shares? I bought 15000 shares of nvda, my point here is that’s not much indicator of super bullish. Look at her investment on panw earlier?",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggnleh/",
              "created": 1722784517,
              "depth": 2,
              "replies": [
                {
                  "id": "lggow58",
                  "score": 1,
                  "body": "Yeah but she bought these recently and thats only what she added on top of what she already had. Last time she bought was at $400 if I recall correctly.",
                  "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggow58/",
                  "created": 1722784967,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgfwjxx",
      "score": 9,
      "body": "According to my expert analysis, all I’m seeing is a bunch of Elmer fuds around here.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgfwjxx/",
      "created": 1722773556,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgg31ea",
      "score": 3,
      "body": "What else are these cash making machines going to invest in? Like with how healthy earnings are it makes complete sense to try to be the bleeding edge of a new technology. \n\nAI will easily push down expenses in numerous ways, the main one being wages which is another issue later down the line but an easy move for corporations.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg31ea/",
      "created": 1722776629,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggigyg",
      "score": 3,
      "body": "Amazing how history repeats itself. Very reminiscent of the dotcom burst. Same things said and, ultimately, the tech will become ubiquitous and change everyday life. Just won't do it for a few years more, so it's correction time.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggigyg/",
      "created": 1722782712,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggdaq3",
      "score": 6,
      "body": "AI will fundamentally change every aspect of the global economy, we are just getting started. This is a bubble in the same way we had the dot com bubble circa 2000. For what it’s worth - Amazon was trading for around $5 at the height of the bubble. Don’t miss the boat.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggdaq3/",
      "created": 1722780806,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgfttiy",
      "score": 6,
      "body": "There are tons of useful uses already, but most AI usage nowadays is research, obviously research consumes more money than it produces, for now anyway... and for the record I'm not saying all AI products will make it to market but it's obvious that won't be profitable for a while, as for any new technology",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgfttiy/",
      "created": 1722772110,
      "depth": 0,
      "replies": [
        {
          "id": "lgg10vq",
          "score": 4,
          "body": "True the most mainstream uses of AI currently, which have the potential to generate revenue are strictly either in the entertainment sector or in the secretarial sector. National Defenese is a possibility as well. However, thats not really marketable until it's released mainstream. \n\nThe potential is there, but until enough profitable ventures are made/thought up. It will be in a situation of more money spent than generated.\n\nBut let's not forget the market also has an issue of short-term thinking:\n\nai developed last year, ok great. \nLet's burn billions on boosting it. \nYou mean the billions burned haven't generated trillions yet after one year.\nTsk tsk bad investment. Write-off.",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg10vq/",
          "created": 1722775718,
          "depth": 1,
          "replies": [
            {
              "id": "lgg4sss",
              "score": 1,
              "body": "The only way it makes the kind of money priced into the market is if a huge swath of consumers pay for this as an add on service.  Currently consumers can use it to soften up angry emails or generate pictures of bears wearing suits.  I don’t know many people who will pay for that pleasure.",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg4sss/",
              "created": 1722777400,
              "depth": 2,
              "replies": [
                {
                  "id": "lgg537s",
                  "score": 5,
                  "body": "Haha... when I first read ur post I read it as \"soften up angry emails with generated pictures of bears wearing suits\"\n\nDear John,\n\nYour fired 🐻\n\nLove,\nEx boss",
                  "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg537s/",
                  "created": 1722777524,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgjbnrd",
                      "score": 1,
                      "body": "I would pay for this!",
                      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgjbnrd/",
                      "created": 1722818508,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgfvv7k",
      "score": 5,
      "body": "Typical hype cycle. After hype fizzles out then real product and services will emerge. Apple may change AI industries future, if they release powerful enough device to run latest AI models in upcoming years then need for huge data centers will decrease dramatically.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgfvv7k/",
      "created": 1722773203,
      "depth": 0,
      "replies": [
        {
          "id": "lggb8rg",
          "score": 3,
          "body": "Yeah the first step of hype is the realization that this could make money and the next step is all of the chumps who claimed their tech would be revolutionary failing to actually make money with it. Then the real players emerge who managed to monetize it and be profitable doing so.",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggb8rg/",
          "created": 1722780023,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lggpgg5",
          "score": 2,
          "body": "[Typical hype cycle](https://www.diamandis.com/blog/5-stages-of-the-hype-cycle)",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggpgg5/",
          "created": 1722785159,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgg3hhu",
      "score": 2,
      "body": "Look AI will be either be used to replace people in call centers or it will never be profitable. So far it has been unable to do that.  I doubt Facebook spending billions to make a slightly better search engine will see a good ROI.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg3hhu/",
      "created": 1722776827,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggcfr5",
      "score": 2,
      "body": "This is clearly written by ai",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggcfr5/",
      "created": 1722780480,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggh5jy",
      "score": 2,
      "body": "In my town, I see a lot of little robots for food deliveries. I think they using ai for driving?",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggh5jy/",
      "created": 1722782236,
      "depth": 0,
      "replies": [
        {
          "id": "lggokgw",
          "score": 0,
          "body": "Most likely they use Indians that remote control those robots.",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggokgw/",
          "created": 1722784856,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lggj8ji",
      "score": 2,
      "body": "The more social and traditional media try to scare me the more I want to do the opposite of what they are pushing ",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggj8ji/",
      "created": 1722782990,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggjqhk",
      "score": 2,
      "body": "The ghey bears just keep pumping out the trash! This post is false and misleading. The only reason for the sell off was for tax purposes, all of the other garage OP is spewing are over dramatic. China sales were down 6% (3% on a constant currency basis) and its been improving compared to the last two quarters. I find it hard to believe this is a bubble. Would you call cloud computing that took off in 2010 a bubble; that’s what people were saying in 2015 and yet no pop because those same people didn’t understand the business model or the technology. Just like the ghey bears don’t understand AI.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggjqhk/",
      "created": 1722783169,
      "depth": 0,
      "replies": [
        {
          "id": "lggz37d",
          "score": 2,
          "body": "I had to explain this about cloud to people in the early 2010s. I worked with the tech and new the business case was solid even then",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggz37d/",
          "created": 1722788460,
          "depth": 1,
          "replies": [
            {
              "id": "lghsq99",
              "score": 2,
              "body": "AI is the same story but on a significantly higher level. It’s a game changer, not a bubble, just like cloud was at the time (and still is).",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lghsq99/",
              "created": 1722798435,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lggkv4u",
      "score": 2,
      "body": "This is 1000% FUD to get everyone to dump this shit before earnings\n\n\nCheap buys for the fuckers with money",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggkv4u/",
      "created": 1722783568,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggaftk",
      "score": 2,
      "body": "So AI is a bubble because Intel doesn’t know what it’s doing? AMD and Nvidia might have a different perspective…",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggaftk/",
      "created": 1722779711,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgggap3",
      "score": 2,
      "body": "It’s not a bubble",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgggap3/",
      "created": 1722781924,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgg2j9f",
      "score": 3,
      "body": "AI is overrated. It is not as good as the first impression and people confused fascination with money-generating potential.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg2j9f/",
      "created": 1722776404,
      "depth": 0,
      "replies": [
        {
          "id": "lgg52k2",
          "score": -1,
          "body": "As someone who has read around 15 books on AI and is already making money from it I can't even begin to tell you how wrong you are lol - I'd recommend doing a deep deep dive at understanding the direction we're going in.",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg52k2/",
          "created": 1722777516,
          "depth": 1,
          "replies": [
            {
              "id": "lgg80sy",
              "score": 1,
              "body": "Best eye opening book you read?",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg80sy/",
              "created": 1722778748,
              "depth": 2,
              "replies": [
                {
                  "id": "lgg8ux3",
                  "score": 2,
                  "body": "I think \"Life 3.0\" was the one that really made me realize the millions of ways AI will change our lives and future and it was a great starting point. \"The Singularity is Nearer\" by Ray Kurzweil came out only a few weeks ago which I also think is great but is probably better if you already have a decent understanding of AI",
                  "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg8ux3/",
                  "created": 1722779089,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lggaomw",
              "score": 1,
              "body": "Well, I can't know for sure but I wouldn't touch AI inflated stocks now.",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggaomw/",
              "created": 1722779806,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lggigwq",
              "score": 1,
              "body": "So how are you making money off of it? What use case?",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggigwq/",
              "created": 1722782712,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgglbpv",
              "score": 1,
              "body": "Why don't you add to that list of accomplishments of yours the fact that you're an active member of r/UFOs and you've made a post one month ago titled ”Will A.I. eventually collapse the stock market?”",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgglbpv/",
              "created": 1722783731,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lggh53m",
              "score": 1,
              "body": "How about instead of giving us the number of books you've read, you list the books so we can make fun of you for reading garbage?",
              "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggh53m/",
              "created": 1722782231,
              "depth": 2,
              "replies": [
                {
                  "id": "lggkv85",
                  "score": 2,
                  "body": "Or even better — tell us what you've learned from these books",
                  "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggkv85/",
                  "created": 1722783569,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lggoiqk",
                  "score": 2,
                  "body": "Sure, the main ones I'd recommend are:\n- Life 3.0 by Max Tegmark (MIT professor in Physics, worked with Stephen Hawking)\n- The Singularity is Near by Ray Kurzweil (you probably know him but one of the most respected names in AI)\n- The Singularity is Nearer by Ray (came out a few weeks ago)\n- The Fourth Age by Byron Reese (Tech millionaire)\n- Superintelligence by Nick Bostrom (from a Philosophical and social point of view)\n\nThese would be the best of the bunch, covering everything from how computers started with Alan Turing in the 50s, to building neural networks, machine learning, the challenge of creating eventual artificial consciousness, all the way to possible future outcomes like criminal courts using an unbiased superintelligent AI or AI growing so fast that we can no longer understand it.",
                  "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggoiqk/",
                  "created": 1722784839,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgg2ob4",
      "score": 1,
      "body": "AI power requirements are outrageous. All these gpus need power",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg2ob4/",
      "created": 1722776469,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggl6nh",
      "score": 1,
      "body": "You write in a very regarded way! Maybe you should get yourself checked? Seems like this post has nothing of value!",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggl6nh/",
      "created": 1722783682,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgglhn5",
      "score": 1,
      "body": "What is ai to you?\n\nIf you think it’s ai like a digital human thinking brain that you see in the movies, that’s not here yet. That’s Artificial General Intelligence. The holy grail of ai but also the dangerous ai if it became “alive” and malevolent. \n\nThere’s nothing “intelligent” about ai right now. It’s just human algorithms with a catchy name attached to it. Great for generating images and videos and analyzing big data and whatnot but intelligent? I think not my good sir. \n\nThese “ai” companies need to show receipts. Everyone is building but they’re also searching for a problem to solve with it. So many are going to bust",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgglhn5/",
      "created": 1722783787,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggnd22",
      "score": 1,
      "body": "What investment in AI? Idk where they are? Are they in the room with you right now Pat?",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggnd22/",
      "created": 1722784438,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggnvet",
      "score": 1,
      "body": "As a programmer AI is already extremely impressive, the entire world economy is fucked if it doesn't live up to the hype because there is pretty much nothing on the same level to replace it.\n\nI still expect NVidia's earnings to keep this bubble going and I don't think the average person understand how disruptive AI is going to be.\n\nWith that said, I'm regarded, so maybe AI is just shit and the future is simply junk food and Netflix.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggnvet/",
      "created": 1722784613,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggoi6f",
      "score": 1,
      "body": "i cant tell if NVDA and AI stocks are giving bubble vibes, i dont even know what is a bubble vibe since i was a kid with no clue back in 2000, someone who was sentient enough back then can tell better than me. so I'm betting on Pelosi here who was in her 50's back then",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggoi6f/",
      "created": 1722784833,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggpbqa",
      "score": 1,
      "body": "“Wall Street asks big tech why they aren’t push button billionaires yet”",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggpbqa/",
      "created": 1722785115,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggpleb",
      "score": 1,
      "body": "Isn't Chat GPT the only company charging for full AI use? Everyone else gives it away for free. I don't see how it would make them money.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggpleb/",
      "created": 1722785206,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggpubj",
      "score": 1,
      "body": "For advertising companies like Meta and Google, they have a great opportunity to make money from AI.\n\nImagine the kind of signals they can get from their AI tools(similar to Ad search) that people use. These signals will then power their advertising engines to know which user to show what ad. This is also potentially a new Surface to show more ads to the people meaning more advertising dollars.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggpubj/",
      "created": 1722785291,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggqo7w",
      "score": 1,
      "body": "The party is over, everybody back to work...",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggqo7w/",
      "created": 1722785576,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggt813",
      "score": 1,
      "body": "These companies are all morons and will lose many billions on their \"AI\" nonsense...once investors see this it's all over. There will never be broad AI. Congrats on the chat bots and fake voices, that's all this nonsense will ever be",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggt813/",
      "created": 1722786449,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggtzfq",
      "score": 1,
      "body": "AI is the internet on steroids, I use Chatpgt4o more than google. I’m just some random bum. AI will fully integrate into about everything we see to an extent. The amount of companies still uses excel is mind blowing, but excel is just some dumb spreadsheets. The AI wave is more than a bubble, it’s a game changer. I grew up with no internet, dial up, the dotcom bubble, the tech bubble, but this right here, it’s like damn near recreation of a better internet",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggtzfq/",
      "created": 1722786706,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggvkym",
      "score": 1,
      "body": "I think AI is not a bubble at all. It can be very useful in certain sectors, but more importantly the investment is about avoiding out competed by competitiors.\n\nI am paying a monthly fee for gpt already for analyzing and drafting long text, writing and checking computer codes. I'm sure lots of people in the tech and research sectors do that too and that's quite a big new market already. \n\nAnother example is Open AI vs google. Google stock price is already suffering from open ai developing search capability. Imagine the market share and revenue loss for Google if people switch to GPT for searching answers. That's why Google is trying so hard to get it's own Gemini ready. It will not bring much extra profit to Google, but the investment is spent to protect existing market shares against new competitors.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggvkym/",
      "created": 1722787252,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggwaah",
      "score": 1,
      "body": "People will continue training models and buying chips as they will need to stay competitive. Disruptions will happen the problem is people’s expectations that these companies will trim employees and save huge money while others will make massive profits.  That just isn’t realistic yet. Most employees don’t know how to use the tools yet eventually AI will be as big as the internet just not until well after the bubble has popped.  How long did Amazon et. Al go sideways after the dot com bust.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggwaah/",
      "created": 1722787494,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lggxl1z",
      "score": 1,
      "body": "It will be a case by case situation. Some will monetize it and others won’t. However, the societal downside is huge. The spread of misinformation and propaganda. The drain on the grid and increase in emissions. A cost benefit analysis really needs to be done. Costs besides financial.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggxl1z/",
      "created": 1722787942,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgg3gzf",
      "score": 1,
      "body": "AI already makes money. Here look at Open AI’s reported revenue. \n\nhttps://www.theinformation.com/articles/openais-annualized-revenue-doubles-to-3-4-billion-since-late-2023\n\nNow, the version of AI, most MMs and other investors have in their minds is very different. It is a fictional form of AGI and not chatbots. \n\nThat is a few decades away. It will take time. \n\nThat revenue won’t come in immediately.\n\nBtw, AI is already used in many other sectors like identifying breast tumor in nascent stage. \n\nhttps://news.mit.edu/2024/ai-model-identifies-certain-breast-tumor-stages-0722",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg3gzf/",
      "created": 1722776821,
      "depth": 0,
      "replies": [
        {
          "id": "lggdd5t",
          "score": -1,
          "body": "yes! Grammarly an AI powered writing assistant and has been profitable. AI is the future.",
          "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lggdd5t/",
          "created": 1722780832,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgg8fz3",
      "score": 1,
      "body": "Old AI is making money, but a new generative AI is too computer power-hungry/expensive to be profitable.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg8fz3/",
      "created": 1722778921,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgghc03",
      "score": 1,
      "body": "LLM bubble? Yes.\n\nAI bubble? No. Unfortunately, most people won’t educate themselves enough to know that “AI” is not just ChatGPT.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgghc03/",
      "created": 1722782302,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgg4ngp",
      "score": 0,
      "body": "I've been saying for years that there are particular sets of problems that AI/ML suit. Many of which were already being done before the LLM thing. Which mostly works for chatbots.\n\nIn my opinion, there will be more and more uses of AI, but I think people are realising that the excitement about how big it would be, quickly is evaporating.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg4ngp/",
      "created": 1722777337,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgg3uz2",
      "score": 0,
      "body": "$META said on its earnings call 3 months ago that their capex would go up and it would take years for AI to generate significant revenue. Their stock dropped in response but then recovered. \n\n\nThe market right now is demanding AI profits when they were frankly told it would take time. It further conflates the capex spend with only the Mag7. (Google, Amazon, and Microsoft are making record cloud numbers reselling AI compute. Cutting their capex makes zero sense when that capex is printing real money right now). The market has been selling \"AI shovel\" plays despite AI capex continuing to go up to try to meet demand.\n\n\nIs it a bubble when stock fundamentals improve but stock prices decline? When forward P/E for many AI plays now ranges from 10 to 30? When the end result has been known to take years to develop and remain capital intensive to achieve that result? Guess we find out what the market continues to think next week.",
      "permalink": "/r/wallstreetbets/comments/1ejt49n/interesting_development_in_technology_stocks_is/lgg3uz2/",
      "created": 1722776991,
      "depth": 0,
      "replies": []
    }
  ]
}