{
  "title": "My thoughts on META",
  "score": 54,
  "selftext": "**I'd like to start a dialogue on what investors think about META - please challenge or add onto this discussion. This is a long post, so I've posted the TLDR below.**\n\nGiven the recent negative non-farm jobs report and unemployment prints, I think the market is missing a great opportunity in META stock after a great earnings report.\n\nContext: META pre-earnings was about $470 and post earnings is now $488. They beat earnings by 8%. META is down from its high of $540.\n\nPosition: I have sold some META puts at lower strike points, so yes I am biased and want the company to perform well, but will change my mind if there's a compelling argument otherwise.\n\n**First thoughts on the market:**\n\nThe sell-off is a correction that gives long term investors an opportunity to buy companies at a less inflated P/E ratio. I think recession concerns are overblown given the following:\n\n* Absolute levels of unemployment remain very low\n* Meeting inflation targets are important for encouraging discretionary spending for lower income populations so that buying power won't be continuously eroded and we can move past this tightening cycle\n* The Fed has the ability to reduce interest rates significantly if warranted\n* Reduction in mortgage rates will allow: (1) existing homeowners to reduce interest burden and increase discretionary spending and (2) stimulate big ticket purchases (e.g. cars, homes, etc.)\n* Reduced bond yields means equities become more attractive in comparison. In the short run, the carry trade has largely unwinded from its highs in July 2024 and further downside risk is less than before - [see chart here from ING](https://think.ing.com/articles/jpy-peeling-back-the-carry-trade-onion/).\n\n**META specific thoughts:**\n\n* **Earnings:**\n   * Just crushed earnings expectations, their advertising business continues to run strong with user base growth. They stated that they have seen early benefits from their CAPEX spend on AI (not sure if it reaches desired ROI yet however).\n* **Reasonable valuation in the short run:**\n   * Currently trading at \\~25 PE (TTM) and forward PE is \\~21 to 24 depending on EPS forecasts. [Source linked here](https://stockanalysis.com/stocks/meta/forecast/). For context, Meta hit its lowest PE of 14 in December 2022 when people thought Meta wouldn't exist anymore due to ad spend concerns, apple privacy updates, and issues with facebook engagement.\n   * Compared to other tech companies investing in AI, Meta (along with Google) has one of the lowest P/Es with a comparable growth rate. Relative to its peers, its PEG ratio is lower as well. However, I think some of this difference is explained by its reliance on ad spend which is cyclical and less resilient in downturns.\n* **Long term bets:**\n   * Meta has invested in long term bets in AI and Virtual reality which have yet to pay off and are considered a cost burden.\n   * For example, in their recent earnings call, they've talked about using AI stand-in personas to help influencers and small businesses answer questions to followers. If they become the \"small business or personal\" AI, then they can deepen relationships with users and monetize in ways beyond ads through reoccuring services revenue. Reoccuring revenue and proving monetization of AI will give it a boost in EPS given investors value this type of revenue more.\n   * I believe Meta is trying to move away from reliance on ads and provide value to users in ways that cannot be pulled away as easily (similar to other SaaS companies)\n* **Spending Risks:**\n   * CAPEX is large which has a future drag on EPS, but I think they can scrap their VR initiatives if needed if cost efficiency is required.\n   * If AI doesn't work out, EPS growth will be harmed in the outer years (assuming near term growth is not expected to be fueled by AI).\n* **Economic Risks:**\n   * Short term dependence on ad spend which is cylical and impacted during recessions\n   * Chinese companies spending a lot on Meta for ads - this might go away\n   * I think given interest rates are coming down - hopefully any softness will be alleviated quickly.\n\n**TLDR:** Short term business is reasonably valued and forward valuations aren't priced for explosive AI monetization. This results in upside both from an EPS and P/E perspective if there is no prolonged economic downturn and especially if new AI products show early chutes of monetization. Would appreciate any thoughts/challenges to this from other investors.",
  "link_flair_text": null,
  "id": "1ejzv3k",
  "num_comments": 43,
  "created_utc": 1722790351,
  "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/",
  "comments": [
    {
      "id": "lgh4nem",
      "score": 1,
      "body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lgh4nem/",
      "created": 1722790352,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgh8t4q",
      "score": 58,
      "body": "im buying and holding Meta so long as the Zuck lives, thrives and breathes.",
      "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lgh8t4q/",
      "created": 1722791754,
      "depth": 0,
      "replies": [
        {
          "id": "lghhcdj",
          "score": 36,
          "body": ">im buying and holding Meta so long as the Zuck lives, thrives and breathes.\n\nI'm not disagreeing, but it's fascinating to see this voted to the top today when just a couple of years ago this same sub was adamantly saying Zuck was a terrible CEO and needed to be ousted during the whole transition from Facebook to Meta.",
          "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghhcdj/",
          "created": 1722794596,
          "depth": 1,
          "replies": [
            {
              "id": "lghp3xq",
              "score": 18,
              "body": "I think it speaks to how many steps ahead of the average person he is, everyone thinks a trailblazer is a fool until they see the path he has carved out.",
              "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghp3xq/",
              "created": 1722797205,
              "depth": 2,
              "replies": [
                {
                  "id": "lghvhic",
                  "score": 22,
                  "body": "Possibly, but I think it also speaks to this subs tendency towards recent outcome bias and projecting that onto future projections.  At the same time as this sub was bashing Zuck a couple of years back, they were praising Cathie Woods and new investors were told \"just invest in ARKK and forget it.\"",
                  "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghvhic/",
                  "created": 1722799388,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgi11fz",
                      "score": 11,
                      "body": "It’s definitely herd mentality on investing subreddits, especially as they’ve become even more mainstream. I see Reddit referenced on cable news investing channels pretty frequently now. I do remember reading back in 2022 some said that Zuck had changed the name of the most recognizable brand on the planet and that was a mistake, at the time I agreed with that. Now I feel like the company is becoming so diversified it’s hard to put your finger on it, and in hindsight that appears to be the aim, if anything the name was limiting. It doesn’t really make a big difference but they seem to be doing it more successfully than google did with alphabet. My understanding of all of this is extremely shallow and I think there in lies the issue with social media, anyone and everyone has a voice.",
                      "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lgi11fz/",
                      "created": 1722801306,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lgkk17o",
                          "score": 5,
                          "body": "Absolutely. I didn't realize it at the time, but the Zuck was moving beyond facebook. In a not so long future, it will only be a small part of Meta's assets. It was definitely a good lesson in not falling for herd mentality.",
                          "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lgkk17o/",
                          "created": 1722839844,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lghn7sn",
          "score": 4,
          "body": "I have been in since $19.   I am going nowhere.",
          "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghn7sn/",
          "created": 1722796568,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lghic08",
          "score": 3,
          "body": "What makes you so confident in Zuck?",
          "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghic08/",
          "created": 1722794925,
          "depth": 1,
          "replies": [
            {
              "id": "lghnvzm",
              "score": 6,
              "body": "Everything meta is today is thanks to him. \n\n  \nPersonally though - i don't see his vr bet paying off.",
              "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghnvzm/",
              "created": 1722796795,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lghzl8j",
              "score": 2,
              "body": "his past and current success",
              "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghzl8j/",
              "created": 1722800807,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgkzx42",
          "score": 2,
          "body": "Zuck is willing to sell all your souls to the devil for profit. I'm also meta with this guy.",
          "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lgkzx42/",
          "created": 1722850553,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lghadas",
          "score": 2,
          "body": "I think Zuckerberg is good but anyone see a path to a big payoff for his VR bet? Seems like people are writing that off as an L",
          "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghadas/",
          "created": 1722792281,
          "depth": 1,
          "replies": [
            {
              "id": "lght8q4",
              "score": 9,
              "body": "*Yes, 100%, but it's not what you think.*\n\nLeveraging their SAM2 model (which is amazing, btw), and innovations with their headsets, they will finally design a product as seamless and useful as the smart phone that people will use in their daily life. \n\n**But here's the key thing**: it has the ability to identify objects you see with the device. This will provide immense advertising potential. The current paradigm is \"advertise a product we think you might be interested in\" to \"advertise the product sitting right in front of you.\" \n\nImagine walking by something and instantly getting a tiny little flag that indicates this thing is on sale, discounted, or the lowest price it's been for a long long time. People will buy that thing..\n\nMETA is going to be the only game in town with this capability and will ensure their dominance in the advertising market for years to come. This is why billions has been spent on hardware and their segmentation models.",
              "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lght8q4/",
              "created": 1722798614,
              "depth": 2,
              "replies": [
                {
                  "id": "lghuchi",
                  "score": 2,
                  "body": "Very interesting take!  That would be slick.",
                  "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghuchi/",
                  "created": 1722798991,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lghw219",
                      "score": 5,
                      "body": "No kidding. With that device, you can measure how long someone is looking and considering the item. How often people walk by it, put it back.. Now imagine thousands and thousands of people with this device. That's a ton of crucial market insight that any business would love to have.",
                      "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghw219/",
                      "created": 1722799588,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lghbt31",
              "score": 7,
              "body": "I think VR will always be a little more niche but I think AR will become mainstream.  I'm hoping we get to see there new prototype soon, possibly in September.",
              "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghbt31/",
              "created": 1722792759,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lghbegd",
              "score": 6,
              "body": "Apple wrote it off as an L already, selling less than 1m units. \n\nI think they’re dumb. I own a oculus 3. I got it for Father’s Day from my kids. I played it once. They played it once. It has not been touched since with kids in and out of this house on the daily. \n\nThey are so niche. They are so extra. I don’t foresee them ever being cool. Kids like them for games. Reddit mods like them for Porn and Anime.\n\nApple tried to make them more like a AIO desktop computer. Which was a good idea. However, desktop computers are infinitely easier to use. Way less invasive. And much more reliable. And way cheaper. Do you want to enter a whole new world Every time you go on your computer that comes with a touch of motion sickness? Me either.",
              "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghbegd/",
              "created": 1722792625,
              "depth": 2,
              "replies": [
                {
                  "id": "lghrba4",
                  "score": 9,
                  "body": "> Apple wrote it off as an L already, selling less than 1m units.\n\nNo, that's the media telling you they wrote it off based on conflicting reports that go against common sense. \n\nApple knew from day one that this would be a long journey. They literally cannot source the components to manufacture even half a million units this year, they knew that before it launched.",
                  "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghrba4/",
                  "created": 1722797952,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lghff85",
                  "score": 2,
                  "body": "I agree. I do wonder why there aren’t more VR solutions for games like madden. I know there are VR arcades but would love to play madden with my feet and hands instead of with a controller",
                  "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghff85/",
                  "created": 1722793956,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lghrdr9",
                      "score": 2,
                      "body": "> I do wonder why there aren’t more VR solutions for games like madden.\n\nThere's maybe two ways to do this:\n\n1. You make it a \"real\" football game where you need to run around and actually play the game. But you'd need a huge playing area to work with that almost no one has. You've also got all the potential safety issues of running around a room essentially blind.\n\n2. You could make it so you're just a god watching the football game from whatever angle you wanna watch it at, which I think is more likely what could be done and could sell more copies. Like a VR add on to an existing game so they don't really need to change much.",
                      "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghrdr9/",
                      "created": 1722797976,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lghh7wb",
                      "score": 2,
                      "body": "Well first of all, no VR can handle that game. They are small. To play any resource heavy games you have to plug the headset into your desktop and basically stream the screen to the VR. Which I’ve tried, and it isn’t consistent. It’s like playing cloud gaming. It’s acceptable for demos, but you’re not going to use it long term for a game. Plus, you need a high end computer to do this in the first place. You might as well just play the game on your pc. And no one that wants a VR is going to buy a PC and a VR to play one. It just doesn’t make sense. So you’re limited to stand alone games. Which at the moment, is Beat Saber. That’s pretty much it. Lol.\n\nAlso, I’d imagine porting a game like that over to a VR requires A LOT. It’s probably extremely expensive if not, impossible to do. For the amount of market share is held by VR users, I’d imagine it’s very unprofitable. Otherwise companies would be doing it.\n\nIt’s a gimmick. It’s cool, for 20 minutes. The novelty wears off incredibly fast.",
                      "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghh7wb/",
                      "created": 1722794554,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lghrhgt",
                          "score": 3,
                          "body": "> Which I’ve tried, and it isn’t consistent. It’s like playing cloud gaming. It’s acceptable for demos, but you’re not going to use it long term for a game.\n\n99% of VR users have no such problems. This doesn't work like cloud gaming which uses remote servers; you connect to your PC either via direct wire or wirelessly. That said, the software layer is a pain quite often - though that's expected of PC software in general. \n\n>  So you’re limited to stand alone games. Which at the moment, is Beat Saber. That’s pretty much it. Lol.\n\nThere are plenty of popular and highly rated standalone VR games that you've never heard of. That doesn't mean they don't exist, it's just easy to find yourself in a bubble sometimes.",
                          "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghrhgt/",
                          "created": 1722798011,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lghumyu",
                          "score": 1,
                          "body": "Isn’t a PS5 capable of something like this? I’ve been to VR cafes with a bunch of games that are pretty decent. But I think online gaming with VR, space requirements, and quality of the visualization in the headset need to improve. Would be great if I can get on an omnidirectional treadmill and play madden",
                          "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghumyu/",
                          "created": 1722799094,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lgibsuk",
                  "score": 1,
                  "body": "try rayban meta glasses actually",
                  "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lgibsuk/",
                  "created": 1722804963,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lhdi4ze",
                  "score": 1,
                  "body": "The fundamental problem with VR: nobody is ever going to feel great plugging their kids into The Matrix",
                  "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lhdi4ze/",
                  "created": 1723254880,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lghjej5",
              "score": 2,
              "body": "Btw around the ratchets, we refer to him at The Zuck or Lizard man",
              "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghjej5/",
              "created": 1722795285,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgkm6y4",
          "score": 1,
          "body": "98% ad revenue makes me nervous, even though it has worked for all this time.",
          "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lgkm6y4/",
          "created": 1722841212,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lghdxkv",
      "score": 20,
      "body": "Meta prints cash. No reason not to hold it",
      "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghdxkv/",
      "created": 1722793463,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lghohux",
      "score": 15,
      "body": "Saw an interesting stat [post earnings](https://x.com/RihardJarc/status/1819010155154993348) (this account is a good follow if you want META specific analysis).\n\n> $META Family of Apps made $58.8B in operating income (last 12 months).\n> \n> In the same period the Reality Labs segment made a $16.7B loss. \n> \n> Without the RL segment, $META would have made $75.5B in operating income. At current prices the stock would trade at 17.6x operating income.\n\nMETA's earnings are stellar and this is despite this massive money-losing segment. If the bet turns out correct, huge upside to earnings. If it turns out to go nowhere, well, you get a natural boost from not throwing money into a black hole. Zuckerberg has a history of excellent capital allocation given the success of this company. Hopefully he is correct on this. (I'm skeptical of VR)\n\nAlso, it's interesting to point out: people were critical of META doing buybacks in 2021 before the stock had collapsed. The highest stock price META had achieved before the crash was ~$380 in September '21. Today the share price is ~$490, or ~30% higher. If you call that 3 years between then and now, that's a roughly 9% annualized return. But we can actually look at their actual buying price.  [From this source](https://x.com/borrowed_ideas/status/1819028343280599550), the average buy price in 2021 was $330, which comes out to ~13% annualized return.\n\nSo the buybacks during seemingly bubble territory turned out to be decent capital allocation in the end. The S&P 500 is only about ~20% higher than it's peak valuation, so those buybacks were market-beating.\n\n(Now consider the buybacks in 2022 at $173 average, before the 182% rally to today's share price...)",
      "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghohux/",
      "created": 1722797000,
      "depth": 0,
      "replies": [
        {
          "id": "lghu6s3",
          "score": 3,
          "body": "Wow that’s interesting and massive. Wonder if meta will be like the apple of smartphones but in AI personalization and use cases for the consumer",
          "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghu6s3/",
          "created": 1722798936,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgh8jt8",
      "score": 9,
      "body": "I\"m going over my weekend \"Oh \\*\\*\\*\\*!\" portfolio and I'll be keeping my META.",
      "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lgh8jt8/",
      "created": 1722791666,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgiagiy",
      "score": 6,
      "body": "If its price is not this high, I would be buying more. Meta has a lot going for. So much cash.  metaverse and AI investment will pay off in some way unexpectedly.",
      "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lgiagiy/",
      "created": 1722804503,
      "depth": 0,
      "replies": [
        {
          "id": "lgjwfha",
          "score": 6,
          "body": "Metaverse is trash. Mixed reality sunglasses are the more realistic bet. Likely not a huge market though , at best it will be an Apple Watch level of revenue. \n\nIts AI is the biggest possible but play but unknown how they will play out. \n\nMonetizing Ig and Facebook at almsot maxed out. The user experience can’t handle much more before it turns into a shithole. \n\nMessenger and WhatsApp have room to grow and monetize.\n\nOverall their current ad revenue can justify things. And upside is the AI",
          "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lgjwfha/",
          "created": 1722827184,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgj2u5o",
      "score": 6,
      "body": "I picked up a bunch of shares like 16 months ago for $100 a share.",
      "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lgj2u5o/",
      "created": 1722814987,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgjvz4o",
      "score": 6,
      "body": "Everyone uses IG. Every boomer still uses Facebook. Every country communicates via WhatsApp. By the time Facebook declines they’ll have a 4th act. \n\nOnly thing I don’t trust zuck in is his inability to let go of mistakes. He still believes jn reality labs. We are 30 years away from a true vision he wants. He doesn’t need to be the first mover like he thinks. \n\nThe rayban sunglasses are the future. But we are 10 years away from how the tech needs to be for the vision of having a new interface outside our phones. Sunglasses will be dual purpose in the future. \n\nEyeglasses are much longer ways away. But not important first move. \n\nTill then they’ll have their advertising propel them. And AI is an unknown upside",
      "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lgjvz4o/",
      "created": 1722826980,
      "depth": 0,
      "replies": [
        {
          "id": "lq9mpcl",
          "score": 1,
          "body": "Did you see their latest conference? I do think the future is getting closer than you think",
          "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lq9mpcl/",
          "created": 1728026773,
          "depth": 1,
          "replies": [
            {
              "id": "lq9pwlj",
              "score": 2,
              "body": "I’ve watched multiple of his speaking engagements and Orion presentation. He’s on a roll with all that publicity and his image. \n\nAnd I think what I said was exactly right. 10 years away from those glasses being replaced as the interaction tool. Phones will slowly become the brains of the glasses. \n\nI’m very bullish on Facebook. I think the glasses will go through a hype cycle. Just like absolutely everything does. We are climbing up to the peak and will reach there in about 2-3 years. And the next 5 will be steady slow progress with not much fan fare. In about 8 years you’ll have bigger adoption and mass adoption in 10. \n\nMy point on reality labs was in regards to his Metaverse. Which he has started to let go of. I was maybe wrong that he can’t let go. I think he realizes it’s not the near term goal and in 20 years when a virtual reality tech is better , then he can hype that back up. He is now distracted with a better more tangible goal. So ya it took him too long but he’s got a shiny new toy now. \n\nMeta has a lot of money to play with until they hit gold. And inevitably whether it’s glasses or llama or something else they acquire. They’ll get there. \n\nI do worry a little about Facebook itself. It’s a corpse of a product and in 20-30 years I don’t think will exist as we know it. I can see it pivoting to some sort of login page. \n\nBasically Facebook could become the login screen to all the other services they provide. And remove the social aspect as the main feature. But the old Facebook of uploading pictures and walls is going to change. Facebook gets a facelift. The first quarter where users decline is when they’ll start working on it. But this is a problem where they have many years to fix. \n\nIf I was mark id be putting a team of 6 super smart people focused purely the future of Facebook and prepping for its complete reimagining. Because it’s going to die. And he should be ready to replace it. It’s still a huge huge chunk of their revenue. Can’t ignore that. In fact as amazing as glasses sound. It won’t beat the pure profit of Facebook with its amazing margins.",
              "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lq9pwlj/",
              "created": 1728029035,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lghv5uo",
      "score": 2,
      "body": "I like the idea of Llama being open source AI recently. And a good move from Zuck.. I will buy some shares, it looks promising to invest.",
      "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lghv5uo/",
      "created": 1722799278,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgkqve0",
      "score": 2,
      "body": "I took a massive position in meta last week, just before the crash. Wish i had waited a couple of hours as the jobs data came out and the stock price crashed… but overall im bullish. It’s a great company. It has good leadership, meta has managed to stay ahead of the curve for the last 20 years and it’s still growing. Meta’s suite of products are still relevant across multiple generations and their platforms  are generally considered the most effective platforms for ad spend.  Meta is also competitive with other players- Google, apple etc. For instance, the AI lama chatbot that they’ve introduced is actually pretty good… and they have big ambitions for it to be the most used AI tool by December. I’m reasonably certain they will be able to monetize AI directly and indirectly… directly though AI powered ads (maybe tiered pricing or subscription models) and indirectly (through more precise data analysis, efficiencies etc). \n\nTheir VR spend is pretty excessive IMO - but it looks like Mark wants to create a new paradigm for interaction and has high conviction in this investment. To be honest, until VR is made significantly more comfortable to use, it’s not going to take off, but I think they are working on creating hardware that is more comfortable to use. I’m not as skeptical as I used to be, and I can imagine a lot of use cases where VR could be very useful. For instance, I live in a country 25 hours away from my immediate family. If there’s a VR headset that allows me to feel like I’m meeting my family in close proximity in a VR holiday location - I’d be game. But this is contingent on all of us having comfortable head sets - and price continues to be a factor that they will need lower to see mass adoption of VR. The AR glasses though, I can see more immediate value and uptake. I’m considering buying them now. \n\nI’m bullish on the stock in the medium to long term (12 months - 48 months). I have no idea what the stock is going to do in the short term  given macro environment. \n\nBut they are well capitalized to weather any storm, have a reasonably manageable amount of debt, and print money. Their most recent profit was over 13bn. In. A. Single. Quarter. 👏\n\nThis is a wonderful company in my opinion. \n\nAnd btw when meta fell to under 100, I bought, and my biggest regret was selling out at 192 rathe than riding the wave to 500+\n\n🤓",
      "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lgkqve0/",
      "created": 1722844325,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgi2ir4",
      "score": 1,
      "body": "I added to my position before earnings. Maybe should have been more patient to buy something else with the jobs data and all",
      "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lgi2ir4/",
      "created": 1722801811,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgperuf",
      "score": 1,
      "body": "It bounces back strongly. Might close in green tonight.",
      "permalink": "/r/stocks/comments/1ejzv3k/my_thoughts_on_meta/lgperuf/",
      "created": 1722908519,
      "depth": 0,
      "replies": []
    }
  ]
}