{
  "title": "Why The Rumored Delay Of NVIDIA's Blackwell GPUs is Unlikely To Be A Deal Killer",
  "score": 56,
  "selftext": "https://www.chaotropy.com/why-the-rumored-delay-of-nvidias-blackwell-gpus-is-unlikely-to-be-a-deal-killer/\n\n\nFrom the article:\n\n[ But even if there is a design flaw, it is most likely the interconnect between two Blackwell GB100s to a GB200. This would mean that the individual Blackwell GPUs are not affected. It has already been reported here that problems with this interconnect could lead to production delays of two weeks. However, such problems are not uncommon when starting production of a new, highly complex product like the GB200, and are usually resolved in a short period of time, resulting in an improved product.\n\nFor the above reasons, I think it's unlikely that \"The Information\"'s report uncovered a relevant problem at NVIDIA. No complex product has ever been rolled out at scale without at least some minor problems during development or production. ]",
  "link_flair_text": null,
  "id": "1ekb0of",
  "num_comments": 29,
  "created_utc": 1722819615,
  "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/",
  "comments": [
    {
      "id": "lgjf10g",
      "score": 30,
      "body": "That's right. Customers will still buy thousands and run 1 card at a time. So power consumption savings and cooling wont cost fortune.\n\nShare some more links from websites no one ever heard off. Bake some news!",
      "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgjf10g/",
      "created": 1722819867,
      "depth": 0,
      "replies": [
        {
          "id": "lgjgfc9",
          "score": 8,
          "body": "And pay two cards’ price. Win win",
          "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgjgfc9/",
          "created": 1722820442,
          "depth": 1,
          "replies": [
            {
              "id": "lgji1xs",
              "score": 2,
              "body": "Yeah, The more you buy the more you save.",
              "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgji1xs/",
              "created": 1722821128,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgji702",
      "score": 31,
      "body": "These GPUs are not immediately critical to NVDA.   What is a worry is the repeat of the Year 2000 problem for Cisco and Juniper.   Leading up to the rollover from 1999 to 2000 the world was worried computers would quit due to their clocks only having 2 digits for the year.   So every company on Earth bought a ton of new and expensive equipment and the Internet was built out for years in a few months.   Then 2000 rolled around and no problems.    So all of the next 5-7 years of internet hardware capex had been pulled forward into 1999, so CSCO and JNPR's sales fell off a cliff.\n\nWhat if the AI hype has pulled the next 6-10 years worth of investment in expensive AI chips forward into 2024 and it turns out that AI (which likely is the next great thing, but like the internet not the next great thing immediately) is slow to actually show a profit to the consumers of those expensive AI chips and they don't buy anymore for some years?   Then NVDA profits will crater and along with it their stock price.",
      "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgji702/",
      "created": 1722821186,
      "depth": 0,
      "replies": [
        {
          "id": "lgkfqz1",
          "score": 10,
          "body": "Because compute for AI is fundamentally different from networking equipment. \n\nHaving an overcapacity of networking equipment does not make internet speeds faster. Speed of light is speed of light. You can’t fill the networks with fake internet data. \n\nMeanwhile, compute for AI does not have a limit (yet). The more compute you have, the bigger the model, the better the training, the faster the AI inference, the more data you can feed into AI.",
          "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgkfqz1/",
          "created": 1722837195,
          "depth": 1,
          "replies": [
            {
              "id": "lgm1od7",
              "score": 1,
              "body": "\"Better the training\"? Based on what metric?\n\nAll the sources I see/hear show that in 2025, the AI models will consume organic natural information generated by humans faster than we can generate. Then the age of bullshit AI generated synthetic data used to train new AI models will begin.",
              "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgm1od7/",
              "created": 1722867966,
              "depth": 2,
              "replies": [
                {
                  "id": "lgmbqdz",
                  "score": 3,
                  "body": "It can never consume as much data as we can generate. LLMs still need to ingest real world data - which they've not done.",
                  "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgmbqdz/",
                  "created": 1722871310,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgjj8a4",
          "score": 3,
          "body": "Nailed it. 👍",
          "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgjj8a4/",
          "created": 1722821618,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgjklk4",
          "score": 6,
          "body": "It's an opportunity to sell H100 at high premiums. \n\nNo one wants to buy AMD MI300 even though they have high memory and theoretically higher performance per watt or performance per dollar compared to H100.",
          "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgjklk4/",
          "created": 1722822191,
          "depth": 1,
          "replies": [
            {
              "id": "lgjsx97",
              "score": 6,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgjsx97/",
              "created": 1722825663,
              "depth": 2,
              "replies": [
                {
                  "id": "lgk1zyh",
                  "score": 2,
                  "body": "Intel and AMD have been making gpus for 20 years. Do they ever threaten or even challenge NVIDIA’s doninance at any point in history? If these 2 cannot compete, what is the likelihood of other non-chip making gaints?",
                  "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgk1zyh/",
                  "created": 1722829757,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgk57cm",
                      "score": 1,
                      "body": "I don’t think the point is to challenge nvda position as a gpu provider but to not put all the egg in the nvda basket, eg rely on 1 supplier for all your hardware needs",
                      "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgk57cm/",
                      "created": 1722831339,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lgkhzp2",
          "score": 2,
          "body": "Y2K “didn’t happen” because everyone worked their asses off to fix it… basically now with vaccines. Idiots think measles is not a problem because people worked their asses off to fix it. AI will happen extremely fast (snowballing over the next 5 year) and be the biggest change humans have ever encountered.",
          "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgkhzp2/",
          "created": 1722838559,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgl3poi",
          "score": 1,
          "body": "It reminds me more of 2010 era AAPL when “everybody already has an iPhone” and people were fretting over watches and iPads because they couldn’t imagine where the next growth driver would come from.",
          "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgl3poi/",
          "created": 1722853026,
          "depth": 1,
          "replies": [
            {
              "id": "lgmiytg",
              "score": 1,
              "body": "And that is what counters the worry I mentioned.   The future is hard to see.",
              "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgmiytg/",
              "created": 1722873638,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgjw5jq",
          "score": 0,
          "body": "But is the impact to NVDA sales going to be seen this quarter or this year or in 2025 . I thought they had orders that they would continue to fill till Q3/4 of 2024 ? Maybe I was mistaken",
          "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgjw5jq/",
          "created": 1722827061,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgjgaa1",
      "score": 10,
      "body": "Nvidia already confirmed the rumor isn't true",
      "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgjgaa1/",
      "created": 1722820384,
      "depth": 0,
      "replies": [
        {
          "id": "lgjih24",
          "score": 7,
          "body": "Yeah. Buy at discount and wait till it falls another 30%",
          "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgjih24/",
          "created": 1722821302,
          "depth": 1,
          "replies": [
            {
              "id": "lgjm8sv",
              "score": 13,
              "body": "If NVDA falls another 30% it would be trading at a 28 forward PE with a EPS growth rate of 101%",
              "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgjm8sv/",
              "created": 1722822874,
              "depth": 2,
              "replies": [
                {
                  "id": "lgjo25o",
                  "score": -5,
                  "body": "You are right, reality check needed. Will Nvidia still able to sell at high premiums? \n\nWhat incentive they give customers to wait for another 3 to 6months?\n\n Or is it like American culture to enjoy waiting in line outside leather store waiting for doors to open and then shopper rush in to buy those leather jackets?\n\nShould traders continue to be stupid and believe NVDA margins will forever be high or keep increasing or have some sense about picks and shovels do not sell forever at premiums,",
                  "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgjo25o/",
                  "created": 1722823629,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgkaom7",
          "score": 3,
          "body": "No they didn’t… They never directly answered the question when they could’ve said that production wasn’t pushed back.",
          "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgkaom7/",
          "created": 1722834237,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgl2z80",
      "score": 2,
      "body": "Do think the news is very bullish for Google.  They are not dependent on Nvidia like their competitors.\n\nGoogle started their own chip over 12 years ago now and now has the sixth generation in production and working on the seventh.",
      "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgl2z80/",
      "created": 1722852564,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgkbi7i",
      "score": 2,
      "body": "Because it's fake news trying to create a dip to buy cheap, earning is coming up, the FUD is real.",
      "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgkbi7i/",
      "created": 1722834705,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgjg9l1",
      "score": 1,
      "body": "Hardly to believe a design flaw can be solved in two weeks. It’s not just modify design,TSM also need time to reconfigure their manufacturing environment",
      "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgjg9l1/",
      "created": 1722820377,
      "depth": 0,
      "replies": [
        {
          "id": "lgk39u0",
          "score": 3,
          "body": "also hard to believe that a severe design flaw will be found at such a late stage, you know these guys working on it are pros and have spent lif time working on such systems.",
          "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgk39u0/",
          "created": 1722830379,
          "depth": 1,
          "replies": [
            {
              "id": "lgk3sao",
              "score": 3,
              "body": "Well,INTC found flaw after sold to customers",
              "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgk3sao/",
              "created": 1722830629,
              "depth": 2,
              "replies": [
                {
                  "id": "lgk4o7c",
                  "score": 1,
                  "body": "see if a flaw is found before it is shipped then it can be easily fixed. its much easier to fix now.  \n\nbut it does not matter, wall st smell blood and this is all perfectly timed so story wont be ignored. facts can come later",
                  "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgk4o7c/",
                  "created": 1722831072,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgmdv5u",
          "score": 1,
          "body": "People use the term ‘design’ very very loosely.  It’s very highly doubtful that there is a logic design problem or a design implementation issue, at least one of significance.  It’s always a significant likelihood that there may be a design-for-manufacturability (DFM) problem due to pattern limited yield simply due to the combinatorics of new as yet unseen new pattern complexity and pressing the limits of a new node.  They limit process window and yield.  Happens commonly, even during manufacturing to improve yield over the first year.  There’s also significant likelihood of new technology modes in the packaging interposer between chips.  The DFM issues are typically quickly found and fixed with new masks within a few weeks but can be very complex.   I expect this to be a yield ramp issue as Blackwell systems are out being tested broadly.  This type of thing is not unexpected in the business and won’t impact sales.  People account for this.   Doubtlessly, TSMC is leading the DFM and interposer issues with an army of engineers to resolve.  I have nearly no concerns that this will be resolved.",
          "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgmdv5u/",
          "created": 1722871997,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgjir7v",
      "score": -4,
      "body": "If NVDA supply is affected short and sell AMD. AMD will fall another 30%.",
      "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lgjir7v/",
      "created": 1722821421,
      "depth": 0,
      "replies": [
        {
          "id": "lglkvy3",
          "score": 2,
          "body": "Source - trust me bro",
          "permalink": "/r/stocks/comments/1ekb0of/why_the_rumored_delay_of_nvidias_blackwell_gpus/lglkvy3/",
          "created": 1722861694,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}