{
  "title": "Intensifying Yen Rally Sinks Japan Stocks, Rattles Global Market",
  "score": 90,
  "selftext": "(Bloomberg) -- Turmoil in Japan’s financial markets intensified Monday as the yen extended its rebound against the dollar to almost 13% from July’s low and stocks headed for a bear market. Yields on benchmark Japanese government bonds tumbled by the most in two decades.\n\nThe intensity of the moves continued to take investors by surprise, hurting everyone from mom-and-pop traders of shares and currencies to large hedge funds and institutions. The slump in bond yields cast a shadow over bank earnings, triggering a record 21% intraday decline in the shares of Mitsubishi UFJ Financial Group Inc., the nation’s biggest lender.\n\nThe sharp appreciation of the currency, which has gathered pace since the Bank of Japan increased interest rates on July 31, is also rumbling through global markets as it upends countless investment strategies that were built on cheap borrowing in yen.\n\n“What a complex situation to be in for Japanese policymakers — a loose monetary policy kills your currency and a slightest hint of tightening breaks your stock market,” said Charu Chanana, head of currency strategy at Saxo Markets. The yen may get 140 to the greenback sooner rather than later if concern over the risk of a US recession continues to rise, which will further weigh on Japanese stocks, she said.\n\nAll 33 of the industry groups represented in the Topix index have fallen since the Bank of Japan raised interest rates. After falling into a correction on Friday with a slump of more than 10% from its July peak, the gauge is Monday set to enter a bear market with the decline now in excess of 20%.\n\n“Falling stock prices mean that companies’ business performances are expected to deteriorate in the future, and if the economy weakens, credit spreads may face widening pressure as well,” said Noritaka Oda, head of debt syndication at SMBC Nikko Securities Inc.\n\nThe benchmark 10-year Japanese government bond yield slid as much as 17 basis points, the most since 2003, according to data compiled by Bloomberg.\n\nThe risk-off sentiment isn’t all emanating from Japan. The rally in global bonds that’s sent yields spinning lower in large part reflects worries over the US economic outlook. Concern is growing that the Federal Reserve is behind the curve with policy support and global investors are ditching risk assets and going into safe havens.\n\n[https://finance.yahoo.com/news/intensifying-yen-rally-sinks-japan-053020546.html](https://finance.yahoo.com/news/intensifying-yen-rally-sinks-japan-053020546.html)\n\n",
  "link_flair_text": "Broad market news",
  "id": "1ekgzhu",
  "num_comments": 24,
  "created_utc": 1722839560,
  "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/",
  "comments": [
    {
      "id": "lgkneks",
      "score": 28,
      "body": "Can anyone ELI5 why a strong Yen mean a collapse in Japanese stock?",
      "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgkneks/",
      "created": 1722841997,
      "depth": 0,
      "replies": [
        {
          "id": "lgko1in",
          "score": 58,
          "body": "The Nikkei was being propped up because the Yen was historically weak and the bank of Japan raised interest rates meaning the yen strengthens. Traders borrowed the yen because it was so weak and had practically zero interest rates and used that to buy things like crypto, stocks, and bonds. Those same traders are liquidating their positions now to get out of that trade",
          "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgko1in/",
          "created": 1722842415,
          "depth": 1,
          "replies": [
            {
              "id": "lgkx5ax",
              "score": 18,
              "body": "This sounds  like history playing itself out again in a sequel.",
              "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgkx5ax/",
              "created": 1722848629,
              "depth": 2,
              "replies": [
                {
                  "id": "lgkxgia",
                  "score": 6,
                  "body": "Depends on how over leveraged institutions are on the yen.",
                  "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgkxgia/",
                  "created": 1722848848,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lgkwahz",
              "score": 17,
              "body": "I wished I was one of the modern aristocrats who are allowed to borrow several hundred thousands or millions to buy stocks lol.\n\nOnly way for us peasants to get bank loans in those numbers is financing houses",
              "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgkwahz/",
              "created": 1722848037,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgl1yem",
              "score": 3,
              "body": "When you take out the Bank of Japan loan to go buy crypto/stocks/bonds, don't you lock in a specific rate on that loan? Why would you need to liquidate to pay it back?",
              "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgl1yem/",
              "created": 1722851909,
              "depth": 2,
              "replies": [
                {
                  "id": "lgl34ou",
                  "score": 8,
                  "body": "They don’t take the loan from the bank of Japan itself. Some people can borrow from banks in Japan but usually it’s a margin loan in yen via a broker. If you’re in the US 99% of it is a margin loan via a broker and the whole trade unwinding is basically a margin call",
                  "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgl34ou/",
                  "created": 1722852662,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lgl58kv",
              "score": 4,
              "body": "I might’ve missed something here but didnt the jap gov only raise interest rates to 0.25%? Why would that triggered a mass selling by traders leveraging on cheap yen?",
              "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgl58kv/",
              "created": 1722853977,
              "depth": 2,
              "replies": [
                {
                  "id": "lgl7ek3",
                  "score": 5,
                  "body": "This is the second rate hike by the bank of Japan this year. Before the first hike their interest rates were actually negative, now they raised again which was a surprise. All the leverage was taken when rates were negative. The surprise last week with the recent hike is more to do with the selling rather than the 0.25% hike itself, it caught people with their pants down.\n\nIMO I think the selling of assets is overdone from it alone but might show that the amount of leverage taken on the trade might be more then anyone thought",
                  "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgl7ek3/",
                  "created": 1722855233,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgmk26j",
                      "score": 2,
                      "body": "there's some inconsistent things that don't line up here. BOJ hiked rate on Mar 19 early morning and equities rallied until Mar 21 or April 1. BOJ hiked rate again on Jul 30 but equities also strongly rallied. It wasn't until the manufacturing ISM that market started selling off, so I guess it was just looking for any reason to sell off since manufacturing ISM is basically not very important in the US (service economy). However, that ISM was released 10 AM EST and Japan trading already closed by then, so the selling off was actually done by Americans/Europeans.",
                      "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgmk26j/",
                      "created": 1722873991,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lgl812a",
                  "score": 5,
                  "body": "Also Look up Asian contagion in 1998, different circumstances but shows that currency fluctuations have a worldwide effect. The S&P tanked and tanked fast for a couple of months before it went to an all time high to close the year. Point being is that these things are usually short lived, unless it turns out a bunch of institutions get liquidated from this, (I personally don’t think so) but we will see.",
                  "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgl812a/",
                  "created": 1722855579,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lglbwi8",
                      "score": 3,
                      "body": "Thanks bro. Appreciate u taking the time to explain ❤️",
                      "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lglbwi8/",
                      "created": 1722857600,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lgles1g",
                  "score": 1,
                  "body": "Central bank interest rate jumps of 0.25 is insanely high. When you check other interest rate changes it is almost always in the 0.25 numbers and it moves markets",
                  "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgles1g/",
                  "created": 1722858976,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lglqmbd",
          "score": 10,
          "body": "It’s what’s called the carry trade. Japan had zero to negative interest rates for an eternity. So you could borrow in yen, which you didn’t have to pay any meaningful interest on, convert yen to dollars and buy things like US stocks. Leverage up at zero interest rate, sounds great. But then BOJ starts raising rates and the yen appreciates. \n\nYou’re still not paying much interest, but now you’ve got assets in dollars and you owe in yen. A 10% increase in the yen relative to dollars means your stocks have lost 10% in the currency you really own them in. You decide to reduce leverage, which means you sell stocks and buy yen. This makes it worse. Not only did you lose 10% to currency change, now stocks are plunging and you’re down 20%. So you gotta deleverage more. Also, there lots of other people doing the same thing. This is the carry trade unwinding.\n\nIt becomes a snowball effect, and this is a core problem of our economy being grossly over financialized.",
          "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lglqmbd/",
          "created": 1722864000,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgktrab",
          "score": 8,
          "body": "In global markets an asset priced in a certain currency will almost always move the opposite direction of its currency all else being equal.\n\nAll assets have a tendency to track towards being valued in USD because international investors want USD and market prices will moved around this.\n\nA big story of Japan’s bull market was just the yen becoming weak.\n\nIf for example you only look at international assets but quoted as USD you’ll see a lot less movement.",
          "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgktrab/",
          "created": 1722846307,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgle59b",
          "score": 1,
          "body": "They raised Japanese interest rates.\n\nYen getting stronger means weakening economy.\n\nThink this.. the economy has been operating off of little to no interest for damn near 40+ years… they now are fixing the problem.\n\n\nOh and carry trades (people who took out low interest Yen loans to convert them to USD or stocks, crypto, etc) are being skinned alive right now as we speak.",
          "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgle59b/",
          "created": 1722858681,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgkl92r",
      "score": 8,
      "body": "What’s it going to look like for us when our stock market opens?",
      "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgkl92r/",
      "created": 1722840613,
      "depth": 0,
      "replies": [
        {
          "id": "lgkp93h",
          "score": 20,
          "body": "Right now, even before premarket, S&P500 looks down 4%, NVDA is down 11.5%, MSFT -9%, AAPL -10%, and the US banks/brokers haven't even started getting into their position yet.\n\nIt is gonna be bad.",
          "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgkp93h/",
          "created": 1722843229,
          "depth": 1,
          "replies": [
            {
              "id": "lgkpmqk",
              "score": 10,
              "body": "actually right now would be the worst because Europe trading just opened. Prior to that, only Asia was trading, and Asia is where they want to unload US equities, so lots of sellers and not a lot of buyers, leading to crazy gap downs.",
              "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgkpmqk/",
              "created": 1722843486,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgkwl4l",
          "score": 14,
          "body": "Usually European buy the dip and then the pessimistic Americans come in and double crash the market ruining the moment europeans set.\n\nAlways the fucking case with americans selling. The biggest paper hands",
          "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgkwl4l/",
          "created": 1722848238,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgkm0ty",
          "score": 10,
          "body": "Bloody. ",
          "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgkm0ty/",
          "created": 1722841101,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgnyiu6",
      "score": 3,
      "body": "how is it that something as big as this and no one even mentioned it. I looked at news over the last week. 1 European guy with Barclays mentioned it on CNBC on Aug 1, 2 days after the news had already been announced. Only 1 more mentioned it on Aug 2 morning. Everyone just assumed the market sold off due to recession fears, but it looks like this carried a lot of weight behind the sell off prior to this weekend. \n\nBut what's important is how far towards the end are we?",
      "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgnyiu6/",
      "created": 1722890014,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgknivl",
      "score": 2,
      "body": "The hedge funds are getting killed on the Japanese yen, so they are selling equities to pay what they owe on carry trades …",
      "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lgknivl/",
      "created": 1722842074,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lglb5db",
      "score": 0,
      "body": "*Yen intensifying intensifies*",
      "permalink": "/r/stocks/comments/1ekgzhu/intensifying_yen_rally_sinks_japan_stocks_rattles/lglb5db/",
      "created": 1722857223,
      "depth": 0,
      "replies": []
    }
  ]
}