{
  "title": "What is happening",
  "score": 649,
  "selftext": "Hello... i am a noob\n\nwhat is going on. i looked at the news this evening (nz) and saw the japan market (?) or whatever it is called droped 12.5% and after a bit of reasearch and reading a few very confusing articles i looked up some other markets and saw the top three (i think) all dropped 1.5% or near that and europe dropping 2.5%... anyone care to explain a little to someone who was no idea whats going on, what it means and whats going to happen next (i dont invest or own any stocks or investments btw)\n\ncheers",
  "link_flair_text": null,
  "id": "1ekijpn",
  "num_comments": 199,
  "created_utc": 1722846105,
  "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/",
  "comments": [
    {
      "id": "lgl2jdv",
      "score": 3162,
      "body": "No one cares to explain it in normal terms so i'll try my best:\n\nMultiple things going on.\n\nInterest rates are at 5.25-5.5%. This means it's difficult to lend money and so slows down the economy. This was done to counter high inflation, which is 'under control' (debatable) right now. Keeping this to tight for too long, might cause economic growth to turn negative (recession). One of the first signs is upwards trend in unemployment. Last week we got signs of weakening of labor market with unemployment at 4.3% (up from 3.7% in Jan 2024). This is causing a bit of discomfort. \n\nSecondly, we got Japan. They decided to hike interest rates to 0.25% coming from near 0%. This means that lending Japanese Yen was \\~free before they decided to hike interest rates. People that can lend money for free tend to put that money to work. For example in the US stock market & dollar de-nomitated stuff. Being able to lend a currency for free, makes that currency less valuable. Hence USD/JPY rising. Now with this sudden hike, lending Japanese Yen isn't free anymore, currency becomes more valuable, investors have to sell in order to cover the cost of lending Yen, as well as cover the forex losses caused by strenghtening Yen. This is causing a sudden sell pressure on stocks. \n\nThis sell-off is mostly due to this Japan thing, which you'll hear people call the 'carry trade'. You can tell it is not a recession trade, as oil isn't really affected right now. \n\nAdd to this you have a potential war in Israel and you have uncertainty on top of uncertainty which is not something the market likes. \n\nAll in all, this sell of is mostly due to the 'carry trade' and should be temporary. I'm personally selling puts at market open to capture elevated IV. \n\nLook at oil to see what the next moves are. Oil down equals recession trade and this is bad for everyone. Oil up and we have escalation in Israel war. In case nothing happens, it's business as usual and US stock will continue moving upwards on growing earnings. \n\nHope this helped!",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgl2jdv/",
      "created": 1722852285,
      "depth": 0,
      "replies": [
        {
          "id": "lgl33r2",
          "score": 504,
          "body": "Excellent breakdown. I learned a couple new things from your reply to OP's question. Thank you for taking the time to write all that out",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgl33r2/",
          "created": 1722852646,
          "depth": 1,
          "replies": [
            {
              "id": "lgl3s3h",
              "score": 170,
              "body": "Glad it was useful! Cheers!",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgl3s3h/",
              "created": 1722853069,
              "depth": 2,
              "replies": [
                {
                  "id": "lgml43z",
                  "score": 41,
                  "body": "I’m surprised that the stock market is impacted so much by the Yen.  But then again, if the US and nearly every other major country has been increasing rates it makes sense that people were using the Yen as a way to get free money into US stocks.  Japan must be one of the only countries that has a 0% interest rate.  \n\nWith that said, I think in the end this is a good thing right?  If the Yen was indirectly inflating the US economy, this now gives the US a little more flexibility to lower rates right?  But then again, this also means that margin of pushing the US economy into a recession has decreased.  That it’s more difficult for a soft landing to occur.  \n\nAm I right to still expect a September rate drop?",
                  "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgml43z/",
                  "created": 1722874332,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgnz4ni",
                      "score": 25,
                      "body": "It's more like an infinite money glitch has been patched than the Yen being a big influence on the US Dollar.",
                      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgnz4ni/",
                      "created": 1722890207,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lgq4w44",
                      "score": 5,
                      "body": "It’s worth noting, for those reading about this, that Japan had negative interest rates for about 8 years and tends to maintain a 0 interest rate policy… something it’s has in place since 1999 (with a short break during the highly inflationary period just before the 2008 global financial crisis). There are tons of articles and YouTube videos that dive into this fascinating monetary policy.",
                      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgq4w44/",
                      "created": 1722919987,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lgoqusz",
                      "score": 1,
                      "body": "When you say people were using yen as a way to get free money, you mean japanese people? 🤔",
                      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgoqusz/",
                      "created": 1722899563,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lgpoeul",
                      "score": 1,
                      "body": "So, thoughts on using oil as a barometer for VIX puts?",
                      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgpoeul/",
                      "created": 1722912328,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lgpi541",
                  "score": 3,
                  "body": "Excellent. No need to get panic.",
                  "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgpi541/",
                  "created": 1722909828,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgm7j4y",
          "score": 87,
          "body": "We need to sticky this on r/stocks.\n\nThe yen carry trade is 100% why VIX is blowing up. Lots of hedge funds levered deep in carry trades on what used to be a sure thing. It makes perfect sense considering how much leverage they are running (trillions).\n\nThe BOJ's decision to hike rates last week no doubt caught a lot of institutions with their pants down, and that's why we see equities across all markets selling off hard. SAHM rule and the poor unemployment data no doubt added fuel to the fire, but the spark was absolutely 100% the BOJ decision.\n\nShort term, selling volatility is the play. You don't get VIX this high too often.\n\nLong term, this is cash gang's chance to get in and start DCAing into shares. This is what y'all have been waiting for",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgm7j4y/",
          "created": 1722869928,
          "depth": 1,
          "replies": [
            {
              "id": "lgp183u",
              "score": 10,
              "body": "Is this what we have been waiting for? SPY is at levels from May. \n\nUnless it keeps going for a few more days.",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgp183u/",
              "created": 1722903374,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgpxu2a",
              "score": 2,
              "body": "S&P 500 still up 10% ytd. Hopefully you have just been building a cash position for a few months at most",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgpxu2a/",
              "created": 1722916458,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgpncju",
              "score": 0,
              "body": "I’ll add that the AI excitement may not be sustainable for a long time. And the rate cuts that are being delayed.",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgpncju/",
              "created": 1722911894,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lglyedw",
          "score": 41,
          "body": "It still makes me laugh the investor sentiment now is that 5% is \"difficult to lend money\"",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglyedw/",
          "created": 1722866835,
          "depth": 1,
          "replies": [
            {
              "id": "lgo2ifu",
              "score": 13,
              "body": "Yea, I know its all relative, but when you think about it in the grand scheme of things its still a super low rate. When I was in high school I'd hear commercials all the time that were like \"refi while we're still at 5%, we probably won't ever see a rate lower than this!\"",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgo2ifu/",
              "created": 1722891277,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgtvtg6",
              "score": 1,
              "body": "It's all relative. The economy is still reordering itself after VC poured billions into lifestyle apps and stuff when money was free.",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgtvtg6/",
              "created": 1722975939,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgl9hrm",
          "score": 25,
          "body": ">You can tell it is not a recession trade, as oil isn't really affected right now.\n>\n>Add to this you have a potential war in Israel and you have uncertainty on top of uncertainty which is not something the market likes. \n\nThese ME issues likely also hold up oil, though. Tough to gauge. Could be recession + ME issues = no change in oil price.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgl9hrm/",
          "created": 1722856366,
          "depth": 1,
          "replies": [
            {
              "id": "lgmd9u2",
              "score": 17,
              "body": "Yeah it's not you it's ME.",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmd9u2/",
              "created": 1722871805,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lglix2s",
          "score": 14,
          "body": "Yea this was a pretty enjoyable read, ngl. Well put. I would read a market update if this guy wrote one, any day.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglix2s/",
          "created": 1722860855,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgllqj9",
          "score": 34,
          "body": "Tech stocks got way too frothy of late, this sell-off was way overdue which keeps the market healthy.  \n\"Keep calm and hodl!\"  hehe",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgllqj9/",
          "created": 1722862048,
          "depth": 1,
          "replies": [
            {
              "id": "lgmze0d",
              "score": 17,
              "body": "This literally did not happen. Google just posted record profits. This sell off is for other reasons.",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmze0d/",
              "created": 1722878857,
              "depth": 2,
              "replies": [
                {
                  "id": "lgo07ml",
                  "score": 6,
                  "body": "The general consensus is due mainly to tech stocks, Japan, and middle east f\\*ckery.",
                  "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgo07ml/",
                  "created": 1722890550,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgox22j",
                      "score": 2,
                      "body": "100% Japan. They sold Tech to cover cause it's going to recover quickly.",
                      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgox22j/",
                      "created": 1722901822,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lgp9swl",
                          "score": 1,
                          "body": "Not just Japan but several other factors combined, it was the perfect storm that just happened.",
                          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgp9swl/",
                          "created": 1722906617,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lgp9yas",
                  "score": 3,
                  "body": "Right, a couple of large caps like Google and NVidia carried the rally while others were lagging.  It's not a healthy market.",
                  "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgp9yas/",
                  "created": 1722906673,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lglz3xb",
              "score": 7,
              "body": "Fundamentals finally making some sense. Let’s see for how long.",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglz3xb/",
              "created": 1722867084,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgowwoj",
              "score": 1,
              "body": "No Man the Japan Carry Trade needs to unwind. The sell off was to cover the Yen trades. That's why it was so fat and brutal.",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgowwoj/",
              "created": 1722901767,
              "depth": 2,
              "replies": [
                {
                  "id": "lgp9fsq",
                  "score": 3,
                  "body": "It was a perfect storm of several factors... hope it blows over soon.  \nThe market doesn't like uncertainty, and this is one of those days.  \nNVidia adding 300+ billion to its market cap in a week, that's the valuation of entire companies.",
                  "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgp9fsq/",
                  "created": 1722906478,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lglypcc",
          "score": 19,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglypcc/",
          "created": 1722866941,
          "depth": 1,
          "replies": [
            {
              "id": "lgmcfhk",
              "score": 15,
              "body": "Good.   Bring on the dip.",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmcfhk/",
              "created": 1722871532,
              "depth": 2,
              "replies": [
                {
                  "id": "lgmm8ey",
                  "score": -6,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmm8ey/",
                  "created": 1722874693,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgmprqx",
                      "score": 12,
                      "body": "Same here, though be careful what you wish for. Layoffs may be around the corner.",
                      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmprqx/",
                      "created": 1722875835,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lgnrbrt",
                      "score": 2,
                      "body": "Username checks out",
                      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgnrbrt/",
                      "created": 1722887743,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lgmymhg",
              "score": 6,
              "body": "Why is a crash over due? Crash’s happen when something we’re not aware of occurs. A crash is an accident. Small corrections like we had in 2022 and now are much more healthier.",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmymhg/",
              "created": 1722878615,
              "depth": 2,
              "replies": [
                {
                  "id": "lgnulik",
                  "score": 7,
                  "body": "Right. People keep saying the crash is over due. Based on what? Is it over due for a crash because they missed the first run up?",
                  "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgnulik/",
                  "created": 1722888782,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lglu99r",
          "score": 5,
          "body": "It looks like oil future is down this morning, so does this mean recession trade or it has to be down over a certain percentage?",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglu99r/",
          "created": 1722865367,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgmuksa",
          "score": 2,
          "body": "Damn, thank you very much, I need to save this",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmuksa/",
          "created": 1722877340,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgnu7kp",
          "score": 2,
          "body": "Why is particularly Oil a measurement for recession?",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgnu7kp/",
          "created": 1722888658,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgq2wny",
          "score": 2,
          "body": "Any idea the scale of the Japan carry trade? I have a hard time believing that a foreign currency bet could tank the markets so hard, even with leverage.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgq2wny/",
          "created": 1722918957,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgvo9wb",
          "score": 2,
          "body": "cheers brother much appreciated",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgvo9wb/",
          "created": 1722998694,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lglvaee",
          "score": 3,
          "body": "Dude, oil is getting smoked right now. What are you talking about?",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglvaee/",
          "created": 1722865737,
          "depth": 1,
          "replies": [
            {
              "id": "lgm1gv1",
              "score": 5,
              "body": "Crude is down 1%. The S&P / Nasdaq are down 3%. Oil is not getting smoked.\n\nOil stocks might be getting smoked, but oil is not getting smoked",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgm1gv1/",
              "created": 1722867895,
              "depth": 2,
              "replies": [
                {
                  "id": "lgm1vqw",
                  "score": 9,
                  "body": "At the time you wrote your post:\n\nAt the time of writing, WTI had fallen by over 2.38% to $71.77 and Brent had dropped by 2.08% to $75.21. Oil markets look set for yet another week of high volatility as demand concerns clash with rising geopolitics risk.\n\nBrent down roughly 10% last 30 days.",
                  "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgm1vqw/",
                  "created": 1722868038,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lglivxz",
          "score": 2,
          "body": "What would you say caused the tech selloff over the last few weeks?",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglivxz/",
          "created": 1722860841,
          "depth": 1,
          "replies": [
            {
              "id": "lglp0t1",
              "score": 16,
              "body": "Weaker than expected earnings.  Valuations have basically assumed gangbusters growth and profitability, and the selloff represents just a small downwards revision in that expectation after seeing the latest earnings report.",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglp0t1/",
              "created": 1722863370,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lglrqtd",
              "score": 12,
              "body": "I think this tech selloff is the most normal human emotion correction that there's been for a long while. A *lot* of people sold to lock in gains, and a *lot* of people sold out of \"this can't go on forever\" nervousness. Couple that on top of uncertainty in the middle east and uncertainty in November, and a tech dip right now looks extremely normal. Short term investors just wanted to get their gains before any random asteroids. I think it would've happened even if the news cycle was boring as shit right now.",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglrqtd/",
              "created": 1722864427,
              "depth": 2,
              "replies": [
                {
                  "id": "lglzy0d",
                  "score": 0,
                  "body": "Makes sense.  I was a just a few weeks late I guess.  I'll just hang out till it goes back up.",
                  "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglzy0d/",
                  "created": 1722867375,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgm55lp",
                      "score": 1,
                      "body": "I'd be surprised if you had to wait any longer than next February. Probably before that, but I'm not a time traveler and this is not divination.",
                      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgm55lp/",
                      "created": 1722869146,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lgmaeqv",
                          "score": 0,
                          "body": "Lol already a bit of a rebound today.  Hoping the cash starts to flow and people are buying the dip.  Nvidia at 100, Microsoft under 400, Lily over 800...good valve out there.",
                          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmaeqv/",
                          "created": 1722870879,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lglkl4r",
              "score": 2,
              "body": "Tech was just where the majority of money was at the time of all these other sell offs. A huge portion of the S&P500 is just Tech",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglkl4r/",
              "created": 1722861568,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgqnasb",
              "score": 0,
              "body": "People have been tentative that its a bubble and have had their fingers twitching on the sell trigger for a while now. They were betting on AI and were expecting AI to have an effect on the profits of these companies this quarter. \n\nSome tech earnings are out and showing big AI spending but no real return on investment (yet), then Sahm Rule recession calculator says we have just gone into a recession and coincidentally Japan market takes a dive. They pull the trigger, panic and run ..from their perceived bubble; rats fleeing what they think is a sinking ship.  \n\n\nIf they understood AI learning/training they would know that AI is going to take time to show a return on investment. They understand venture capitalism but for some reason don't seem to understand that AI needs to be approached in the same way.   \n\n\nWe're seeing traders with monthly targets and deadlines getting out of tech to chase the the next high, but Investors are standing their ground.",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgqnasb/",
              "created": 1722931403,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgllg96",
          "score": 2,
          "body": "Sir if i understand it correctly, oil is the major indicator?",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgllg96/",
          "created": 1722861930,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgnu6z1",
          "score": 1,
          "body": "Great explanation. The only problem I have is believing a carry trade can have this big of an impact on the market. It feels like a huge overreaction.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgnu6z1/",
          "created": 1722888654,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgnxyy1",
          "score": 1,
          "body": "This was very well explained thank you",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgnxyy1/",
          "created": 1722889839,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgo9xvn",
          "score": 1,
          "body": "\n>Now with this sudden hike, lending Japanese Yen isn't free anymore, currency becomes more valuable, investors have to sell in order to cover the cost of lending Yen,\n\nCan you please explain this part again?\n\nThose that lend Yen have Yen with them, so why is it \"lending yen isn't free anymore\"?\n\nWhy are the investors with yen selling anything to lend it to someone else? Don't they already have the Yen they wish to loan out? \n\nI feel like I am missing something fundamental...",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgo9xvn/",
          "created": 1722893670,
          "depth": 1,
          "replies": [
            {
              "id": "lgoh8nj",
              "score": 7,
              "body": "The “carry trade” is when you borrow JPY for near zero, short (sell) the Japanese Yen and go long (buy) USD. You then are *supposed* to invest it at the risk free rate of USD (what they teach you in text books), which would be short term T Bills. You capture the interest rate differential between the countries. OP is apparently implying that hedge funds got naughty and instead of investing in T Bills and capturing the 5% gains, they instead invested them in capital appreciating assets like the Mag 7. Because they assumed that the Japanese government would keep rates at zero, they leveraged themselves up to the tits because they could service the borrowing costs. However now that there is a significantly higher cost of borrowing JPY, they are unwinding their positions, causing the sell off. \n\nI am not sure if OP is right because in my mind that doesn’t fully explain what is going on. I think it is probably part of it, but when volatility increases pass bands of what we’ve been observing, all the models get fucked and risk that was inline with different strategies appears to be understated, causing firms to unwind their positions. It’s just a confluence of different things causing big guys to sell.",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgoh8nj/",
              "created": 1722896157,
              "depth": 2,
              "replies": [
                {
                  "id": "lgqahi1",
                  "score": 1,
                  "body": "Thank you, now I understand it a lot better! :)",
                  "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgqahi1/",
                  "created": 1722923152,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgoif8v",
          "score": 1,
          "body": "But how will the 300 shares of Nintendo I bought at $11.76 fare in the short term?",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgoif8v/",
          "created": 1722896570,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgors17",
          "score": 1,
          "body": "Great write up wow!",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgors17/",
          "created": 1722899896,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgotvog",
          "score": 1,
          "body": "Good breakdown - Also buffet selling of 50% of apple and hoarding even more cash did not help niether",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgotvog/",
          "created": 1722900653,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgp40ew",
          "score": 1,
          "body": "Well said. Want to see the wsb version of thiss",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgp40ew/",
          "created": 1722904424,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgpsnkw",
          "score": 1,
          "body": "thanks for taking the time",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgpsnkw/",
          "created": 1722914114,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgq3rvi",
          "score": 1,
          "body": "Solid. But I’d throw in bad earnings pulling the market down.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgq3rvi/",
          "created": 1722919400,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgqoamp",
          "score": 1,
          "body": "Clearest explanation I've read yet. Thank you!",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgqoamp/",
          "created": 1722932082,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgqtyqq",
          "score": 1,
          "body": "almost everything here is very reasonable and could be used  as a professional level analytics. Great job and thank you!",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgqtyqq/",
          "created": 1722935936,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgrb086",
          "score": 1,
          "body": "Would you mind sharing your strategy on selling puts? (Which/when).",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgrb086/",
          "created": 1722945516,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgtfvxu",
          "score": 1,
          "body": "Fecking \"AAA\" ✌️",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgtfvxu/",
          "created": 1722971013,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgu4dgq",
          "score": 1,
          "body": "Very good",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgu4dgq/",
          "created": 1722978588,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgue3z8",
          "score": 1,
          "body": "Forgot the most important factor - Nikkei, was lagging for decades then took off up 100% in 5 years.  Buffett bought and created a frenzy. Got overheated - had to correct sometime.  Just needed an excuse to sell.  I sold last month.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgue3z8/",
          "created": 1722981744,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgmujjo",
          "score": 1,
          "body": "Damn, thank you very much, I need to save this",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmujjo/",
          "created": 1722877334,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgmujxy",
          "score": 1,
          "body": "Damn, thank you very much, I need to save this",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmujxy/",
          "created": 1722877334,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgmukdi",
          "score": 1,
          "body": "Damn, thank you very much, I need to save this",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmukdi/",
          "created": 1722877340,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgnabx7",
          "score": 1,
          "body": "Oil staying up is also partially potential unrest.  Not the best bogey to compare.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgnabx7/",
          "created": 1722882322,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgnecaq",
          "score": 1,
          "body": "This is incredibly helpful, nice to read an explanation without all the confusing jargon. In your opinion would you say it's worth buying more in the next week? Or do you think it's gonna keep going down for a while/be a long and slow bounce back? Cheers",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgnecaq/",
          "created": 1722883596,
          "depth": 1,
          "replies": [
            {
              "id": "lgohruq",
              "score": 1,
              "body": "It will definitely go down, but not before it goes up. Then it will go down again.",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgohruq/",
              "created": 1722896343,
              "depth": 2,
              "replies": [
                {
                  "id": "lgoow6l",
                  "score": 1,
                  "body": "And after that???!!!",
                  "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgoow6l/",
                  "created": 1722898858,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgm82c1",
          "score": 0,
          "body": "Tyfys",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgm82c1/",
          "created": 1722870103,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgmwuq1",
          "score": 0,
          "body": "You borrow money from somebody who lends it to you. I think you used the verb \"lend\" in a wrong way here.\nOtherwise good write up, thank you",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmwuq1/",
          "created": 1722878042,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgmbi6y",
          "score": 0,
          "body": "Great explanation!",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmbi6y/",
          "created": 1722871236,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgmctzj",
          "score": 0,
          "body": "Great answer! I am still reading it and learning. Cheers mate",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmctzj/",
          "created": 1722871663,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgmv04g",
          "score": 0,
          "body": "Top comment aka explanation. Thank you",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmv04g/",
          "created": 1722877467,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgmx2xk",
          "score": 0,
          "body": "Thanks for this . Won't Powell and his team reduce interest rates to help the economy now ?",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmx2xk/",
          "created": 1722878115,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgmxlpa",
          "score": 0,
          "body": "Very good explanation and congrats on your trade. Rare to see a well thought out post on here where people derive a potential trade directly from their logical observations",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmxlpa/",
          "created": 1722878285,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgmywp5",
          "score": 0,
          "body": "did you clean up this morning!",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmywp5/",
          "created": 1722878703,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgmzfb2",
          "score": 0,
          "body": "Thank you for the useful information!",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmzfb2/",
          "created": 1722878868,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgn1c6r",
          "score": 0,
          "body": "This was enlightening. Thanks for the edification.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgn1c6r/",
          "created": 1722879472,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgn5kk3",
          "score": 0,
          "body": "Great explanation",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgn5kk3/",
          "created": 1722880813,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgn76jo",
          "score": 0,
          "body": "Thank you very much.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgn76jo/",
          "created": 1722881324,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgne3zc",
          "score": 0,
          "body": "I was going to ask planet money the same thing. Thanks for the clarity of your answer",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgne3zc/",
          "created": 1722883523,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgnjd8x",
          "score": 0,
          "body": "But the stock market dropped 35%+ in 2022! No one seems to talk about that, this is nothing",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgnjd8x/",
          "created": 1722885203,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgnosuc",
          "score": 0,
          "body": "Well stated…only thing Id add to this is that I’d like to come up from behind Jerome Powell and with both hands pull his tightywhities over the back of his head.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgnosuc/",
          "created": 1722886940,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgnq3sn",
          "score": 0,
          "body": "Very interesting. I didn’t know, that Japan has that influence on the stock market 😮",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgnq3sn/",
          "created": 1722887355,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgnrgvm",
          "score": 0,
          "body": "id like to subscribe to this pls",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgnrgvm/",
          "created": 1722887788,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgoni6d",
          "score": 0,
          "body": "I bought 2k of YEN money last month on spec of a future holiday/travel trip. Good move??",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgoni6d/",
          "created": 1722898364,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgnog3n",
          "score": -1,
          "body": "On the part where you wrote Oil up and we have escalation in Israel war, I'm having trouble reading it. You're saying if oil goes up, the result is an escalation. Or are you saying that an increase in the potential of a war will cause oil prices to go up?",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgnog3n/",
          "created": 1722886828,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgkzmnl",
      "score": 152,
      "body": "Just don't do nothing. Panic selling is sth I have done and it was the worst mistake i could have done. Stock market is not always green. It would be too easy to make money then. Just stay in and try to find great buys.",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgkzmnl/",
      "created": 1722850352,
      "depth": 0,
      "replies": [
        {
          "id": "lglth74",
          "score": 46,
          "body": "Yup same thing as 2020.\n\nImagine you panicked and sold during Covid 2020. If you didn’t do anything, you’d still make profits than sell during Covid.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglth74/",
          "created": 1722865078,
          "depth": 1,
          "replies": [
            {
              "id": "lgpcn42",
              "score": 9,
              "body": "I sold in 2020 and am glad that I did. Panic selling is a bit of a misnomer, because the reason why anybody sells is because they want cash, or they expect their investments to lose value. The same reasons apply whether you're panicking or not.\n\nThe warning signs for COVID-19 were a bit obvious and had been beyond obvious for months. It's why the world laughed at the U.S.A. for its slow response. I dumped everything in January 2020 and bought everything back in March at probably the best discounts that I'll ever see in my life.\n\nThis year, I sold off and began buying dips. You have to be blind to the real world to be surprised by this data. Hell, even if you didn't interact with the real world because you're unemployed, then you were a statistic in bearish indicators. CPI increased. ISM decreased. Jobless claims increased. The unemployment rate increased beyond expectations. The SAHM Rule was triggered. The free money from Japan is no longer free. Carry trades have dried up. Inflation is still 0.9% above target. The Fed. is still sitting on their haunches despite all of the economic downturns and expectations from the market. What more are you looking for? At that point, if God came down and told you that a correction was imminent, then you still wouldn't believe it. When people are talking so much about not being able to find jobs and how they have to stop spending in order to save money to be able to afford goods, then you know that's a snowball that's going to soon crash into you.\n\nThe market doesn't always stay green, and bear markets can wipe you out. Small businesses were being wiped out left and right in 2000, 2008, and 2020 because people had stopped spending. Not everything comes back in time. Hell, it took the market about 14 years to recover from 2000? Imagine if you were 64 at the time.\n\nThroughout life, your gut feeling will tell you when something's off. Don't ignore it.",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgpcn42/",
              "created": 1722907699,
              "depth": 2,
              "replies": [
                {
                  "id": "lgpv6tu",
                  "score": 1,
                  "body": "How much did you buy today?",
                  "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgpv6tu/",
                  "created": 1722915236,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lglv2cj",
              "score": 10,
              "body": "I did. Didn't sell all, but still a lot. For example I sold apple which was bought in the end of 2018 for ~40 usd. Made some profit, but if i had kept it...",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglv2cj/",
              "created": 1722865657,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgn6in6",
              "score": 2,
              "body": "I did so much tax loss harvesting changing ETFs, it was great in retrospect. I bought a batch at the bottom of them market too. Never selling those",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgn6in6/",
              "created": 1722881114,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgmg7zb",
          "score": 23,
          "body": "As Buffet said (I think): \"Everyone has a  brain for trading, but not everyone has a stomach for it\".",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmg7zb/",
          "created": 1722872758,
          "depth": 1,
          "replies": [
            {
              "id": "lgna0hk",
              "score": 11,
              "body": "Not everyone has a brain for trading.",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgna0hk/",
              "created": 1722882222,
              "depth": 2,
              "replies": [
                {
                  "id": "lgosuc5",
                  "score": 7,
                  "body": "Yeah, there was a dude on another sub talking about how he just threw his entire inheritance into Intel. I'm almost certain the whole thing was fake, but it was a funny read.",
                  "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgosuc5/",
                  "created": 1722900279,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lgrelug",
                  "score": 1,
                  "body": "I remember back when I did warehouse work prior to getting my current gig and the only people who were buying stocks were loading up on pennystocks. Poor dudes were getting maybe $300/week and blowing what little they had in terms of savings on stocks that never went anywhere.",
                  "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgrelug/",
                  "created": 1722947112,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgq2c8a",
          "score": 2,
          "body": "Tbh, I got pretty good at \"panic\" selling from 2018 to 2020. I don't think this is a time to sell at all. I'm just buying more VOO and VUG each time the SP drops a percent",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgq2c8a/",
          "created": 1722918667,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgkw81u",
      "score": 140,
      "body": "Ignorance is bliss. No worry. Go back to sleep",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgkw81u/",
      "created": 1722847991,
      "depth": 0,
      "replies": [
        {
          "id": "lgky0t8",
          "score": 28,
          "body": "ok😂",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgky0t8/",
          "created": 1722849241,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgody7w",
      "score": 17,
      "body": "Red days are honestly the best time to buy, switching mindsets here is key. The stock market is a rollercoaster, that's why you should always have cash on hand for discount days. \n\nYou should be fearful when others are greedy, and greedy when others are fearful - Buffett.",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgody7w/",
      "created": 1722895015,
      "depth": 0,
      "replies": [
        {
          "id": "lgrezji",
          "score": 1,
          "body": "I always keep a good chunk in my HYSA so I can dump it into the market on days like yesterday.\n\nIt's a good system. I need the HYSA in case of emergencies anyways. Just don't overspend and replace it quickly.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgrezji/",
          "created": 1722947278,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lglye1g",
      "score": 35,
      "body": "Japanese interest rate changes.\n\n~10t in yen has been loaned at 1.5% over the last decade. Japan increased rates too fast and everything got margin called.\n\nInstitutions were taking cheap yen and dumping it in our bond and stock market which is weakening.\n\nFire sale - will be over fast. Also it’s coming at a time of “correction”. AI isn’t performing to the hype and the large tech stocks that those cheap loans were in are also dropping.\n\nGreed:)\n\nEdit: ignore anyone that has the words support/resistance or dark pool shit\n\nSomeone already posted something like this. Sorry for repeate",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglye1g/",
      "created": 1722866832,
      "depth": 0,
      "replies": [
        {
          "id": "lgo48zw",
          "score": 0,
          "body": "Thanks for sharing! how long do you think this fire sale will last?",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgo48zw/",
          "created": 1722891828,
          "depth": 1,
          "replies": [
            {
              "id": "lgo5kaq",
              "score": 4,
              "body": "No idea.\n\nIf I had to make a bet tho I’d say it’s all dependent on the yen. If it keeps pumping there will be kore margin calling and more selling of us equities to cover those calls",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgo5kaq/",
              "created": 1722892248,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgpnf1v",
              "score": 1,
              "body": "My guess is till NVDA earnings.",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgpnf1v/",
              "created": 1722911922,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgm6lox",
          "score": -2,
          "body": "Is there any good japanese stocks to grab while this sale is happening.. even just for a 1 or 2 percent of portfolio?",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgm6lox/",
          "created": 1722869625,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgm7789",
      "score": 28,
      "body": "Everytime I have sold because of panic or concern, I have got burned. Every single time. I’d have double or triple the portfolio value now if I had just held on.",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgm7789/",
      "created": 1722869822,
      "depth": 0,
      "replies": [
        {
          "id": "lgoiy2n",
          "score": 4,
          "body": "This",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgoiy2n/",
          "created": 1722896754,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgo96d6",
      "score": 8,
      "body": "There is lots of good reasons in these comments but I think it’s important to also understand how sentiment plays into it. Lots of stocks have been making lots of money for a long time. Assets prices have been high especially in tech. After a prolonged period of gains like we have had, everyone has their eye on the exits expecting a correction. \n\nWhen sentiment gets like this, people are waiting for an excuse to get out with their profits. It’s into this environment that the jobs report or the news about the Japanese Yen come out, then these become “the reason” for the selloff but the real reason is that we have gone up too high too fast and the pendulum needs to swing back the other way.\n\nBest part about these “selloffs” as they tend to over correct in relation to how overbought everything was previously so should be some good buying opportunities coming. \n\nToo bad I FOMOed into NVDA and AVGO with all my dry powder last month 🤦‍♂️",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgo96d6/",
      "created": 1722893420,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lglyp6f",
      "score": 20,
      "body": "Sorry y’all I bought two and only shares of NVIDIA on Friday.",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglyp6f/",
      "created": 1722866940,
      "depth": 0,
      "replies": [
        {
          "id": "lgomex7",
          "score": 5,
          "body": "At least you didn't use you grandmother's inheritance to buy Intel.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgomex7/",
          "created": 1722897980,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgo0lai",
          "score": 5,
          "body": "At least it wasn't Intel on Thursday",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgo0lai/",
          "created": 1722890669,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lglom9a",
      "score": 25,
      "body": "According to media, a weaker than expected jobs report in the US.    \nI can't help but wonder if the market is also factoring in the possibility of an all out regional war that makes the last 3 years look tame in comparison.  Oil prices suggest otherwise, but still... I wonder.",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglom9a/",
      "created": 1722863208,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgl4332",
      "score": 19,
      "body": "What you don’t know won’t hurt you",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgl4332/",
      "created": 1722853260,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgogeh3",
      "score": 3,
      "body": "High interest rates make borrowing money more expensive. In Japan, interest rates rose from nearly 0% to 0.25%.\n\nThis change forces investors to sell stocks to cover costs, leading to a drop in stock prices.\n\nThis is known as the \"carry trade\" and is the main reason for the current market sell-off.",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgogeh3/",
      "created": 1722895866,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgkxvp2",
      "score": 6,
      "body": "My guess is because the BOJ increased rates a knock on effect happened with the yen carry trade. Just my two cents and don’t know if that’s what’s actually happening…",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgkxvp2/",
      "created": 1722849144,
      "depth": 0,
      "replies": [
        {
          "id": "lgl33sl",
          "score": 3,
          "body": "this is it. \n\nNo more easy money (trillions in carry trades), everyone shits the bed in panic, liquidity dries up.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgl33sl/",
          "created": 1722852646,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgm8tpy",
      "score": 2,
      "body": "Time for babbages shorts to capitulate ",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgm8tpy/",
      "created": 1722870358,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgnehvr",
      "score": 2,
      "body": "Just a case of the Mondays",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgnehvr/",
      "created": 1722883645,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgoruaf",
      "score": 2,
      "body": "Perfect time to buy",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgoruaf/",
      "created": 1722899919,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgkuc53",
      "score": 2,
      "body": "Japan and greed from outsiders",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgkuc53/",
      "created": 1722846704,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgm3vem",
      "score": 1,
      "body": "I can't get a clear answer on what plug Biden tripped over to cause this. This is his fault right? I mean thats what my instagram said this morning?? /s  \n\nBuy Low",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgm3vem/",
      "created": 1722868716,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgm9bhf",
      "score": 1,
      "body": "TennisOnTheWII…good explanation!\nAnd I’d also like to say…I still hate Schwab!",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgm9bhf/",
      "created": 1722870521,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgmp1ao",
      "score": 1,
      "body": "In order for buy low sell high to work the market needs to get low periodically. Right now we are in the \"sell high\" stage.",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmp1ao/",
      "created": 1722875593,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgokuii",
      "score": 1,
      "body": "whatever the reason is should i be buying hard now?",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgokuii/",
      "created": 1722897425,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgp02n9",
      "score": 1,
      "body": "Warren buffet times the market",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgp02n9/",
      "created": 1722902944,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgp272b",
      "score": 1,
      "body": "market giveth and market taketh away",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgp272b/",
      "created": 1722903737,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgp3y96",
      "score": 1,
      "body": "Exchange rate and stock rebalance. What goes up/down too quickly will sometimes have a slight reset. That’s it and that’s all in my opinion. If you are nervous about investing, then dollar average cost in or out. Stay invested though. Don’t be a noob and sell everything, then only hold cash while the market later goes up.",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgp3y96/",
      "created": 1722904401,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgp804z",
      "score": 1,
      "body": "Welcome to HELL!!!",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgp804z/",
      "created": 1722905923,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgqlb7e",
      "score": 1,
      "body": "Historically the US markets drop up to 20% every 6 years.",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgqlb7e/",
      "created": 1722930049,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgqlxxu",
      "score": 1,
      "body": "I have to say this. Right now is not the best time for you to be a newbie in this market. After dealing with the Covid crisis and trying to keep my head above water. This is 100x worse. The vix is completely insane right now.",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgqlxxu/",
      "created": 1722930478,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgqpca1",
      "score": 1,
      "body": "Nothing is happening but what generally happens: the market moves and always will be moving. Some scary information causes people to overreact, but nothing more. There is no systemic issue. People trying to explain the relationships among market movements and different factors are just wasting time because it's not an exact science, and what they say is not based on replicable experimentation. Be aware of people who talk without any scientific foundation; they are merely opinionists. Look at the predictions of these opinionists—they are always wrong. You could beat them by throwing dice. I am a scientist and can make a reliable prediction—bulletproof. It will be true for the next year and beyond. This is my prediction: the market will move.\nThen, what do you need to know what is happening for? To invest? To be prepared to invest better? I have my doubts. All those who think they know these things do no better when they invest than a cat pressing keys on a trading app at home. Those who really make a lot of money when they invest know only two things: what they buy and at what price they buy it. Remember this, and you will be ahead even of a laureate Nobel in economics.",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgqpca1/",
      "created": 1722932794,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgr55jy",
      "score": 1,
      "body": "Join real vision - all the answers are there",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgr55jy/",
      "created": 1722942672,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgr9jd6",
      "score": 1,
      "body": "Nothing is happening but what generally happens: the market moves and always will be moving. Some scary information causes people to overreact, but nothing more. There is no systemic issue. People trying to explain the relationships among market movements and different factors are just wasting time because it's not an exact science, and what they say is not based on replicable experimentation. Be aware of people who talk without any scientific foundation; they are merely opinionists. Look at the predictions of these opinionists—they are always wrong. You could beat them by throwing dice. I am a scientist and can make a reliable prediction—bulletproof. It will be true for the next year and beyond. This is my prediction: the market will move.\nThen, what do you need to know what is happening for? To invest? To be prepared to invest better? I have my doubts. All those who think they know these things do no better when they invest than a cat pressing keys on a trading app at home. Those who really make a lot of money when they invest know only two things: what they buy and at what price they buy it. Remember this, and you will already be ahead of even a Nobel laureate in economics.",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgr9jd6/",
      "created": 1722944842,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgr9lp8",
      "score": 1,
      "body": "Chi è lo sfigato che elimina i miei commenti?",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgr9lp8/",
      "created": 1722944873,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgrxtfl",
      "score": 1,
      "body": "Political instability, bad jobs report, people screaming “recession is coming,” looming wars, and foreign markets dropping all add up to panic around the market. You witnessed a sell off.",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgrxtfl/",
      "created": 1722954163,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lguvb1v",
      "score": 1,
      "body": "invested in amd and nvda currently down on both plan to hold long term thoughts\n\nNVDA 38.5 shares avg cost 118\nAMD 28 Shares Avg Cost 158\nContinuing to dollar cost average",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lguvb1v/",
      "created": 1722987784,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgv1idn",
      "score": 1,
      "body": "I think that the ripple is over. It is the best policy not to bother on what short time traders do.",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgv1idn/",
      "created": 1722990025,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lglfluf",
      "score": -1,
      "body": "lotta gobbledegook explanations here. carry trade bla bla bla. \n\nyou're in a currency bubble that needs exponential printing to survive. when you slow it down pop goes everything.",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglfluf/",
      "created": 1722859363,
      "depth": 0,
      "replies": [
        {
          "id": "lglmxc7",
          "score": 4,
          "body": "Comments that say “hope this helps” almost never help or tell the actual reason/solution",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglmxc7/",
          "created": 1722862530,
          "depth": 1,
          "replies": [
            {
              "id": "lgm3awi",
              "score": 3,
              "body": "far too often the people that think they understand, have no actual clue.",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgm3awi/",
              "created": 1722868523,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgktonr",
      "score": 1,
      "body": "Bloomberg ",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgktonr/",
      "created": 1722846257,
      "depth": 0,
      "replies": [
        {
          "id": "lgku78j",
          "score": 0,
          "body": "As in https://Bloomberg.com for news",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgku78j/",
          "created": 1722846610,
          "depth": 1,
          "replies": [
            {
              "id": "lgky036",
              "score": 1,
              "body": "thanks",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgky036/",
              "created": 1722849227,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgkuatq",
      "score": -4,
      "body": "Many things but tension in the Middle East is not helping and NVDA may have some shipment delays (this moves indexes as it is the second(?) largest company in the world).",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgkuatq/",
      "created": 1722846679,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lglb6a3",
      "score": -4,
      "body": "What has happened to BTC?  Why the steep drop?  Was betting on it going to 100k a couple of months ago.",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglb6a3/",
      "created": 1722857235,
      "depth": 0,
      "replies": [
        {
          "id": "lglef7h",
          "score": 56,
          "body": "Contrary to popular belief, btc does in fact follow the stock market.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglef7h/",
          "created": 1722858810,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgm02vk",
          "score": 8,
          "body": "BTC prices are driven by pure speculation and crypto trades like a tech stock.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgm02vk/",
          "created": 1722867421,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lglofec",
          "score": 11,
          "body": "Everyone wants to go risk-off. Crypto is the riskiest gamble you can make in the market.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglofec/",
          "created": 1722863132,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lglgep8",
          "score": 10,
          "body": "People are looking for real investments, safe havens for money.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lglgep8/",
          "created": 1722859733,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgnmgfg",
      "score": -1,
      "body": "This could be 1929 all over again",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgnmgfg/",
      "created": 1722886193,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgmnz5s",
      "score": -6,
      "body": "Before an election the people who don’t pay taxes tank the stock markets to make the Democrats look bad. In turn to get their people elected, rinse repeat.",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgmnz5s/",
      "created": 1722875254,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgltins",
      "score": -5,
      "body": "This is a normal correction in a bull market I believe.\n\nThe long term average for interest rates is around 7%.\n\nWe've worked our way back up there nearly, from zero. So the FED has room to cut.\n\nSo this is business (in the grand scheme of things) as normal.",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgltins/",
      "created": 1722865094,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgkvkzv",
      "score": -62,
      "body": "Biden",
      "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgkvkzv/",
      "created": 1722847552,
      "depth": 0,
      "replies": [
        {
          "id": "lgl0cud",
          "score": -39,
          "body": "Kamala",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgl0cud/",
          "created": 1722850855,
          "depth": 1,
          "replies": [
            {
              "id": "lgm4wj2",
              "score": -5,
              "body": "This is the main reason why, but people won't admit it!",
              "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgm4wj2/",
              "created": 1722869062,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgkxd7n",
          "score": -50,
          "body": "Facts.",
          "permalink": "/r/stocks/comments/1ekijpn/what_is_happening/lgkxd7n/",
          "created": 1722848782,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ],
  "stockTickers": {
    "post_summary": "The Japan market dropped 12.5%, with other global markets including Europe also experiencing declines.",
    "companies": [],
    "tickers": [],
    "main_ticker": []
  }
}