{
  "title": "[deleted by user]",
  "score": 33,
  "selftext": "[removed]",
  "link_flair_text": null,
  "id": "1eljdz5",
  "num_comments": 25,
  "created_utc": 1722954898,
  "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/",
  "comments": [
    {
      "id": "lgs3v12",
      "score": 39,
      "body": "Lithium was only rare because nobody had a need for it. Once a demand was created the value jumped. With the increase in demand people went looking for it and suddenly it’s everywhere. Also it is being replaced in newer battery designs and that will affect the price negatively.",
      "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgs3v12/",
      "created": 1722956131,
      "depth": 0,
      "replies": [
        {
          "id": "lgw6f5o",
          "score": 1,
          "body": "What is it being replaced by? My understanding is that sodium batteries at least are not predicted to be replacing Lithium large scale for decades. The next step on battery tech will most likely be solid electrolyte lithium batteries that use even more lithium than current Li-batteries.\n\nThat said solid lithium batteries do have unresolved hurdles still, and of course it is possible for a new tech to replace them, no one knows how it'll play out.",
          "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgw6f5o/",
          "created": 1723007037,
          "depth": 1,
          "replies": [
            {
              "id": "lgyfnqi",
              "score": 1,
              "body": "Sodium batteries are already a thing. They are better suited for grid scale storage rather than vehicles because it is a bit heavier and are currently in use in some places. Not wide spread currently but moving fast.\n\n\nThere are also a few companies with EVs out there with sodium batteries but I don't know much about them. Iirc some Chinese EV make and a German one.",
              "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgyfnqi/",
              "created": 1723045979,
              "depth": 2,
              "replies": [
                {
                  "id": "lh83g8t",
                  "score": 1,
                  "body": "You are right that sodium batteries are being produced and used already. However I am sceptical about their widespread use on EVs in the near future. I think that Lithium batteries will maintain the lead as EV batteries with superior energy density, and also because all the supply chains etc. are already established. And it is EV adoption that will drive Lithium demand.\n\nBut who knows what will happen (I don't).",
                  "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lh83g8t/",
                  "created": 1723176368,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgs6pdi",
      "score": 12,
      "body": "I expect rare earths to go the same route as lithium and nickel have. The increases in demand are only expected to happen, not proven. There are processing capacity limitations but even they are exagerrated (most models assume China's production will one day become constrained or unavailable to the rest of the world). A lot of projects in construction already look like they won't be economical when they're finished as more efficient methods have been developed since (hard rock mining vs ionic clays). \n\nMost rare earths projects will likely fail, so it makes sense that the sector etfs that buy everything aren't doing well. You can't just buy the basket.",
      "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgs6pdi/",
      "created": 1722957043,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgs1ng5",
      "score": 29,
      "body": "Cobalt and lithium are not rare earth metals. Rare earth metals is stuff like dysprosium, neodymioum, yttrium and the like (i.e. stuff that is sometimes used in permanent magnet motors)\n\n[https://en.wikipedia.org/wiki/Rare-earth\\_element](https://en.wikipedia.org/wiki/Rare-earth_element)",
      "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgs1ng5/",
      "created": 1722955420,
      "depth": 0,
      "replies": [
        {
          "id": "lgs4boo",
          "score": 6,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgs4boo/",
          "created": 1722956279,
          "depth": 1,
          "replies": [
            {
              "id": "lgugzkq",
              "score": 1,
              "body": "AREC just did a proof of cencept for a new process that doesn’t use solvents for those magnet metals. Check em out. Looks good if they can figure out a way to make money",
              "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgugzkq/",
              "created": 1722982731,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgteote",
              "score": 1,
              "body": "Rare earth metals are controlled by China that have over 90% of the worldwide supply and will control pricing.   If US gets to crazy with tariffs, they will tighten the screws impacting the tech sector, especially military and telecommunications.",
              "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgteote/",
              "created": 1722970643,
              "depth": 2,
              "replies": [
                {
                  "id": "lgvw0hp",
                  "score": 1,
                  "body": "This comment hit the nail on the head .",
                  "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgvw0hp/",
                  "created": 1723001986,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lgw36g3",
                  "score": 1,
                  "body": "There are rare earth metals in the US too,  as many as China.    It's just that the mines are particularly destructive to the environment and many are located in vast open areas, which happen to be national parks in the US.   They could be locally sourced,  but the price would rise.",
                  "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgw36g3/",
                  "created": 1723005361,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgwwpeh",
                      "score": 0,
                      "body": "No, do a little research, China controls the critical ones for advanced semiconductors.",
                      "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgwwpeh/",
                      "created": 1723023534,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lgzsit8",
                          "score": 1,
                          "body": "Research says there are significant deposits of rare earths in Wyoming.   It is not currently being mined because it is alloyed with radioactive elements.   There is only  one active mine in the US at Mountain Pass, California.",
                          "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgzsit8/",
                          "created": 1723060865,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lgzsxlb",
                              "score": 1,
                              "body": "Yes, the mine in California does produce the most common, not the exotics.  MP was. Also sending material to China for refining.",
                              "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgzsxlb/",
                              "created": 1723060991,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgsfygc",
      "score": 11,
      "body": "China has literally trillions of dollars in rare earth metals they haven't excavated yet and dominate the market.\n\nImagine OPEC but with one member.\n\nIMO the market isn't investible with any meaningful edge unless you're an insider.",
      "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgsfygc/",
      "created": 1722959960,
      "depth": 0,
      "replies": [
        {
          "id": "lgt5ss1",
          "score": 3,
          "body": "Everyone has trillions in rare earth metals. They are fairly common. Cheap extraction is the hard part.",
          "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgt5ss1/",
          "created": 1722967902,
          "depth": 1,
          "replies": [
            {
              "id": "lgtd05v",
              "score": 2,
              "body": "Cheap labor is what China does better than anyone, so I agree. We’ve got pesky OSHA laws lol /sarcasm",
              "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgtd05v/",
              "created": 1722970125,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgs5zhc",
      "score": 3,
      "body": "Was a massive bubble over a decade ago and has a few mild bumps up only to go back lower. The REMX etf is down close to 90% since the peak in 2011.",
      "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgs5zhc/",
      "created": 1722956814,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgsjfcu",
      "score": 2,
      "body": "LIT or PICK are decent choices for this. You can easily go down the rabbit hole of microcap, penny stocks and that sort of thing if you want to. I wouldn't. Unless you're gambling with a small amount of money.",
      "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgsjfcu/",
      "created": 1722961048,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgtisil",
      "score": 1,
      "body": "Check out a Canadian junior called Doubleview Gold Corp DBG.V / DBLVF \nThey just dropped a savage MRE 2 weeks ago with metallurgy coming in a month or so. Poly metallic porphyry deposit with the usual suspects (gold, copper, silver) but also a ton of cobalt with a recovery of 78% or so. It’s one of the most significant sources of cobalt in North America and somehow market doesn’t give a shit. The kicker is they also have highly elevated levels of scandium (rare earth element used in aerospace as an alloy with aluminium, super expensive, makes aluminum stronger than steel and EV batteries lighter and last longer). They’ve been teasing a proprietary extraction process that doesn’t require HPAL and can be done at room temperature, and that is near zero in cost. 627M t deposit as it stands right now with an average of 28g Sc / t. Raw scandium $2-3/g and refined into scandium phosphate or oxide $200+/g. There’s a reason why heavyweights like Rio Tinto are investing millions into Sc recovery. They just built a scandium processing facility in Quebec and are getting 5% recovery. DBG getting 96% recovery 👀",
      "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgtisil/",
      "created": 1722971917,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgu2z97",
      "score": 1,
      "body": "Sven on yt has some good videos on Lithium investing I'd recommend",
      "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgu2z97/",
      "created": 1722978145,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgsra6w",
      "score": 1,
      "body": "Rare earth minerals are not rare, and all controlled by Chyyyna 🇨🇳.\n\nIMO it’s hard for western traded companies to compete",
      "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgsra6w/",
      "created": 1722963447,
      "depth": 0,
      "replies": [
        {
          "id": "lgulzm4",
          "score": 1,
          "body": "Unless tariffs for said metals rises dramatically",
          "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgulzm4/",
          "created": 1722984475,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgsykmo",
      "score": 0,
      "body": "Investing in companies that extract rare earths ≠ the same as investing in rare earths. Your strategy and thesis will depend significantly on what sort of rare earths exposure you’re seeking and why.",
      "permalink": "/r/stocks/comments/1eljdz5/deleted_by_user/lgsykmo/",
      "created": 1722965695,
      "depth": 0,
      "replies": []
    }
  ]
}