{
  "title": "PLTR: WTF DO THEY DO?",
  "score": 114,
  "selftext": "If you are bullish on AI, then you have to be bullish on PLTR. Here's a summary of what Palantir ACTUALLY does. I wrote a longer article but I feel like most people on here don't have the attention span for anything but bullets. \\*PLTR IS MY BIGGEST POSITION AND I'LL BE BUYING ON ANY DIPS BELOW $25\\*\n\n* Palantir leverages AI to process and analyze vast amounts of data within a company, process, or organization and then helps identify complex patterns and derive actionable insights.\n* If a company’s in-house data solution is data-Frankenstein, then Palantir is a data-Zeus, the god of all data solutions.\n* **Foundry**\n   * Think of Foundry as a super smart filing system that stores all sorts of information from different places. This tool can pull together bits of data from various sources, like spreadsheets, emails, and databases, so that everything is in one place. Then, it will use a really smart and well-trained robot to help your company make important observations and decisions based on the data.\n   * Puts data together: Foundry can take all sorts of information from different places and put it together so it’s easier to see everything at once.\n   * Keeps data safe: It makes sure that the data is secure and handled properly, following rules about privacy and safety.\n   * Helps make decisions: It uses AI to help people at a company make decisions by showing them patterns or trends in data that might not be obvious.\n   * Lets people work together: Foundry helps teams within a company work better together by sharing their findings and plans based on the data.\n   * Custom tools: Companies can create their own tools (code, low-code, and no-code tools) with Foundry to address specific needs they have, making their work easier and more efficient.\n   * Foundry uses AI to automatically combine data from different sources – this helps avoid the need for a lot of manual work to clean up and organize the data.\n   * Foundry makes it easy for you to use AI to make predictions or find patterns in data.\n   * AI in Foundry helps analyze words in documents or online posts to gather important information or see how people feel about something.\n   * AI helps create charts or point out important bits of data quickly, making it easier for people to understand what the data means.\n   * Foundry’s AI can help businesses plan better or test out ideas by simulating different scenarios. This is like trying out strategies in a computer game to see what might work best in real life.\n   * Foundry’s AI also helps keep the data secure by looking out for any unusual activity that might suggest a security problem.\n   * Ontology is a cataloging system for data – it organizes data into specific categories and relationships.\n   * Just like a well-organized library allows you to navigate through shelves of books effortlessly, a well-structured ontology allows computers to navigate through large datasets.\n   * What type of company should use Foundry? Any company that manages large volumes of data.\n   * Stellantis, Airbus, PGE&E, Tyson, Cleveland Clinic, British Petroleum, Exxon Mobil, and even Ferrari’s F-1 racing team have all partnered with Palantir Foundry.\n* **Gotham**\n   * Gotham’s main clients are military, defense, intelligence, counterterrorism, and law enforcement agencies.\n   * Gotham enhances military operations with an AI-powered kill chain that helps soldiers quickly identify and manage targets.\n   * Gotham can control sensors like drones and satellites either automatically with AI or manually with human input.\n   * Gotham transforms any location into a command center with mixed reality, allowing operators and commanders to work together virtually.\n* **Apollo**\n   * Put simply, Apollo helps a company manage, deploy, and scale Palantir software within their organization.\n   * Continuous software deployment is a lot more complex than it may seem.\n   * If SaaS was the hero to software deployment issues in the 2010’s, then Apollo is software deployment’s modern-say savior. This was all a long-winded way to say that Apollo helps companies easily manage continuous software deployment and integration so that they can focus their attention back to innovation and away from meaningless deployment and update issues.\n* **AIP**\n   * AIP is a no-code environment for creating, testing, and deploying AI functions using LLMs. You can build, test, and deploy features using a simple interface without needing to write complex code.\n   * AIP is absolutely game-changing for enterprises hoping to leverage AI into their operations. I think that within the next 3-5 years, most large enterprises will be using AIP someway somehow within their organization.\n* It's not just about managing information; it's about unlocking its full potential in the most fun and captivating way possible.",
  "link_flair_text": "DD",
  "id": "1elkytx",
  "num_comments": 99,
  "created_utc": 1722958675,
  "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/",
  "comments": [
    {
      "id": "lgsbv9k",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 24 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/) \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgsbv9k/",
      "created": 1722958681,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgsehpe",
      "score": 125,
      "body": "A Palantir is a dangerous tool, Saruman.",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgsehpe/",
      "created": 1722959505,
      "depth": 0,
      "replies": [
        {
          "id": "lgsook9",
          "score": 38,
          "body": "They are not all accounted for, the lost Seeing-stones. We do not know who else may be watching!",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgsook9/",
          "created": 1722962657,
          "depth": 1,
          "replies": [
            {
              "id": "lgu048r",
              "score": 8,
              "body": "https://preview.redd.it/e5z45c70w3hd1.jpeg?width=1530&format=pjpg&auto=webp&s=768fd0f9bd5adcd5619a3e790202d99549271794",
              "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgu048r/",
              "created": 1722977264,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lhca6f4",
          "score": 1,
          "body": "Dangerous indeed, but not to all.",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lhca6f4/",
          "created": 1723238414,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgsshsa",
      "score": 149,
      "body": "It is a cutting edge high-tech firm out of the Midwest awaiting imminent patent approval on the next generation of radar detectors that have both huge military and civilian applications",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgsshsa/",
      "created": 1722963817,
      "depth": 0,
      "replies": [
        {
          "id": "lgtp0ej",
          "score": 16,
          "body": "Thanks chat",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtp0ej/",
          "created": 1722973851,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgtxmpi",
          "score": 7,
          "body": "Bro really said it best",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtxmpi/",
          "created": 1722976493,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgscvbe",
      "score": 93,
      "body": "it's ok, no one else knows what they do, either",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgscvbe/",
      "created": 1722958997,
      "depth": 0,
      "replies": [
        {
          "id": "lgtcnlg",
          "score": 13,
          "body": "I thought they made plant based food.",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtcnlg/",
          "created": 1722970018,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgtvbav",
          "score": 9,
          "body": "They make money.  That’s what they do.",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtvbav/",
          "created": 1722975785,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgsii1p",
          "score": 16,
          "body": "I don’t think even Alex Karp knows what they do",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgsii1p/",
          "created": 1722960758,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgtic3v",
      "score": 50,
      "body": "There’s a guy I know fairly well, more than an acquaintance and less than a friend, who retired at 50 because he made so much money trading and the like. He calls me from time to time and a couple years ago when we were shooting the shit, I asked him what the next big thing would be and he said Palantir without even thinking about. It was dirt cheap at the time. I bought as much as I could and about 4x’ed my money. Happy with that advice.",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtic3v/",
      "created": 1722971775,
      "depth": 0,
      "replies": [
        {
          "id": "lguh9f7",
          "score": 35,
          "body": "Cool dick, call him up for our next tip 👍🏼",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lguh9f7/",
          "created": 1722982825,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgz4d2o",
          "score": 6,
          "body": "Can you dm the Next one lol",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgz4d2o/",
          "created": 1723053486,
          "depth": 1,
          "replies": [
            {
              "id": "lgz5ou8",
              "score": 3,
              "body": "I’m liking CDNS but kind of pricey. Think it has good upside though.",
              "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgz5ou8/",
              "created": 1723053891,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgshmmd",
      "score": 26,
      "body": "In their conference call, one example was given as Tampa General Hospital.\n\nThe CEO of said hospital has been quoted as saying average patient length of stay has gone down 30% and lives have literally been saved by the usage of PLTRs software.\n\nIn the conference call they said something like 3 years ago they had a $1M contract, last year was $4M, and this year its like $14M don't quote me on the numbers I was just amazed at how huge of growth that is from a single satisfied customer.\n\nThe companys that choose to not use PLTR are run by boomers who don't realize how easy it is to adopt PLTRs software into their systems.\n\nAlso if you look up their rule of 40 numbers in the presentation its pretty wild where they're at.\n\nhttps://investors.palantir.com/financials/quarterly-results",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgshmmd/",
      "created": 1722960485,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgsnw5d",
      "score": 20,
      "body": "They turn my money into more money 💸💸💸",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgsnw5d/",
      "created": 1722962417,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgt7ssn",
      "score": 17,
      "body": "I interned at a Fortune 500 company and when I spoke to a few people in the supply chain area about their pilot test of Foundry they said that although it was expensive and costing around 3k a day to use, it was saving almost 30k a day. Logically I bought more PLTR shares after hearing that",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgt7ssn/",
      "created": 1722968522,
      "depth": 0,
      "replies": [
        {
          "id": "lgtvt19",
          "score": 13,
          "body": "Why do I feel like your story is just five guys in a warehouse telling jagoff stories, the guy who calls himself manager just totally makes up stuff based on what he reads from 4chan?",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtvt19/",
          "created": 1722975936,
          "depth": 1,
          "replies": [
            {
              "id": "lgtxmdc",
              "score": 10,
              "body": "I don’t want to give specifics on the company obviously but it was during an internal tech event for employees to learn about what other teams are doing to innovate. It was during the morning hosted breakfast I spoke with a supply chain analyst and I asked her how the pilot program with Foundry went (as I had previously heard from another rotational analyst that it was a success and they are expanding it). Believe it or not but this technology will totally revolutionize all companies with huge swaths of data",
              "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtxmdc/",
              "created": 1722976490,
              "depth": 2,
              "replies": [
                {
                  "id": "lgtyeli",
                  "score": 1,
                  "body": "They tried to implement Foundry earlier but there was about a 6 month dilemma where the company didn’t want Palentir to train its AI with its data as its competitors may use the technology. Palentir agreed to not use their data for training and that’s when the company went ahead with Foundry",
                  "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtyeli/",
                  "created": 1722976735,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgu5ik8",
                      "score": 3,
                      "body": "Funny since the data is literraly owned by the company and not palantir in all instances. Palantir learns from uses cases experience, they arent a llm...",
                      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgu5ik8/",
                      "created": 1722978947,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lgu7zuj",
                          "score": 0,
                          "body": "Not sure the specifics on that I just know the company wanted to ensure their data was not training a model that competitors may use 🤷‍♂️",
                          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgu7zuj/",
                          "created": 1722979738,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgsw350",
      "score": 4,
      "body": "This is great info. Lots of details here. I've been back and forth not sure if it's too late for me to buy, this has me hopeful",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgsw350/",
      "created": 1722964933,
      "depth": 0,
      "replies": [
        {
          "id": "lgt4f5w",
          "score": 3,
          "body": "Go through their  (usecase) videos on their homepage and then everything should be clear. \n\nIt’s strange that so many people don’t understand it.  \n\n\nhttps://youtu.be/SIcModuhHJY?si=mIXsVHWL9LsXdvmQ",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgt4f5w/",
          "created": 1722967477,
          "depth": 1,
          "replies": [
            {
              "id": "li18m4p",
              "score": 1,
              "body": "Why are comments deactivated on their hype video?",
              "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/li18m4p/",
              "created": 1723616624,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgt4kgf",
      "score": 4,
      "body": "Above your pay grade, get back to the grill.",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgt4kgf/",
      "created": 1722967522,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgtjsqq",
      "score": 4,
      "body": "Regards wil buy at $50plus next year. Classic WSB",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtjsqq/",
      "created": 1722972231,
      "depth": 0,
      "replies": [
        {
          "id": "lvqwz8r",
          "score": 2,
          "body": "lol @ this happening in 91 days and not even next year",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lvqwz8r/",
          "created": 1730914497,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgwmxze",
      "score": 5,
      "body": "I dunno you basically said \"PLTR helps companies put data together in one place\", like 5 different ways, and some of them the same exact way, under different bullet points, when they didn't deserve another bullet point because you just said the same thing you said in another bullet point?  Wtf?\n\nThat being said, I'm holding until 45.",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgwmxze/",
      "created": 1723017090,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgszks1",
      "score": 34,
      "body": "As a person with a lot of experience from the inside, all I can say is: XD   \nYou have no idea what you are posting about.\n\nStuff like: If a company’s in-house data solution is data-Frankenstein, then Palantir is a data-Zeus, the god of all data solutions. \n\nMeans everything and nothing. Truth is, Palantir is Accenture with MBB-level marketing. \n\nNot even 2 years ago there was a companywide ban on AI. Seriously, if you wanted to develop any sort of ML for a client, it had to be developed by a third party. The AI rebranding is a 180 shift on where the company was 18 months ago. \n\nAs to all the platforms being so great, why did the model (adopted roughly 2 years ago) of self-serving and moving towards SaaS-like solutions that the customers can just use with no need for consultants fail? Why are Palantir \"deployments\" essentially built from scratch? Surely if there is a hospital managing solution that works, it would be very low-lift to use it in nearly any hospital instead of just one, right? Why are there no scalable products released?  Like if Apollo, Gotham and Foundry are so much better than the alternatives, why didn't they just release them straight to the customers? Why not become an actual product company? \n\nI think we all know the answer to that- the product is not scalable, the platforms very laggy and full of bugs. If they released it to the public, any developer would be aware of stuff like how \"Ontology\" is just a set of tables linked with foreign keys and the AI positioning is pure marketing.",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgszks1/",
      "created": 1722966003,
      "depth": 0,
      "replies": [
        {
          "id": "lgu5sd6",
          "score": 10,
          "body": "Sure mate, I'm sure you used it and know so much about saas software in general!",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgu5sd6/",
          "created": 1722979031,
          "depth": 1,
          "replies": [
            {
              "id": "lgus5dw",
              "score": 11,
              "body": "Wanna bet? $500k to cover the legal fees and I send you an email from a Palantir address",
              "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgus5dw/",
              "created": 1722986658,
              "depth": 2,
              "replies": [
                {
                  "id": "lgv4340",
                  "score": 3,
                  "body": "Best scam ever!",
                  "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgv4340/",
                  "created": 1722990976,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgubcmf",
          "score": 5,
          "body": "Dude, it's like you'd tell Tesla fanboys that Tesla doesn't actually have alien techs. \n\nCommon sense to sensible people but blasphemy to fanboys.",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgubcmf/",
          "created": 1722980833,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgupyt6",
          "score": 3,
          "body": "Their sales agents are all like used car salesman",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgupyt6/",
          "created": 1722985879,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhqnwqt",
          "score": 2,
          "body": "iv been trying to scim through a bunch of posts on reddit to see what palantirs products are really like. for the most part it seems to be good reviews about them albeit a lot of c-suite ish ones, with the devs not liking it so much. not trying to attack your point i actually appreciate the post a lot but do you imply the solution Palantir claims to deliver its clients could be derived from other existing products/programs online ect. Sorta that they dont really have some secret sauce algorithm like they claim? I just see a fair amount of posts from engineers saying its a garbage platform like you have, then some that say its good and delivers results and im a little confused. I do admit i am sitting nicely in profit on the last of my $PLTR position and am looking where i should take profit on some more of it.",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lhqnwqt/",
          "created": 1723468421,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lid9rry",
          "score": 2,
          "body": "Palantir feels like Snowflake with a tie and a suit. I feel like they are all ‘we’re oh so special coz muh government’ and that marketing is going to keep working until they have a big problem that’s too public, which they try to avoid by their lock and key we supply our guy model. \n\nAlso, can’t stand Karp.",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lid9rry/",
          "created": 1723790850,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgtidda",
          "score": 2,
          "body": "Hahahha roasted!",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtidda/",
          "created": 1722971786,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgu1u9y",
          "score": 3,
          "body": "This guy gets it.",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgu1u9y/",
          "created": 1722977791,
          "depth": 1,
          "replies": []
        },
        {
          "id": "llxsx9i",
          "score": 1,
          "body": "This dates me, but Palantir reminds me of SAP in the 90's. Using outside consultants to implement your tech can lead to big project failures in some industries. Unfortunately the lesson is re-learned in each generation of business leaders.\n\nAI seems to provide a boost to development companies, but is that demonstrable for the clients? The client companies are way too eager to take on the cost of these processes.",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/llxsx9i/",
          "created": 1725707233,
          "depth": 1,
          "replies": [
            {
              "id": "lly50m5",
              "score": 1,
              "body": "Very accurate comparison",
              "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lly50m5/",
              "created": 1725713458,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgu93p0",
          "score": 1,
          "body": "Not disparaging, but rapid revenue growth, and something much more useful, EPS growth has been growing rapidly due to acquiring many big name customers. If your complaints are as serious as you make them, wouldn't these customers observe that too..?",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgu93p0/",
          "created": 1722980100,
          "depth": 1,
          "replies": [
            {
              "id": "lguq7vv",
              "score": 7,
              "body": "Sure, the marketing has been great. The distribution is immaculate. so is MBB's and I praise the company for that. \n\nBut enterprise customers also benefit heavily from paying for MBB's slides. So there is no need to have state-of-the-art software when plenty of companies basically only use email and simple VBA. I think Palantir generates a lot of value for its customers, and rightly so. But if you are using an image of   a cutting-edge AI product company for valuation, I am not sure this is the case. You are buying a hype consulting company with perfect marketing and a charismatic leader who is capable of saying controversial stuff, not an AI champion with a suite of AI products and a history of having top-tier ML talent. Maybe the valuation of this company should be even higher. But it is not a product company, but an implementation center.\n\nJust for comparison, Palantir has been around nearly as long as Meta/Facebook. Meta released Llama, uses AI extensively and has published plenty of AI research. Palantir has big-name customers. So it is still the implementation that gets paid for, rather than the product. What would you say is the more scalable company that actually showed their AI skills?",
              "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lguq7vv/",
              "created": 1722985970,
              "depth": 2,
              "replies": [
                {
                  "id": "lguz21i",
                  "score": 2,
                  "body": "Very interesting, I appreciate the thoughtful reply. Their positioning as a cutting edge AI firm has certainly at least been believed by these big names and of course has led to a valuation multiple much higher than what the market would give them (and indeed perhaps more than they deserve) than if they were perceived instead as a consulting firm. So really, I agree with your take regarding this but also believe that any rational leadership would strive to maintain such an image for the above reasons.\n\n\nI think a big litmus test will be to what extent their clients can demonstrably improve their bottom line from their products long-term, and if its material enough, then the market may not care about how truly an AI champion they really are. Of course, I think all that would be predicated on the scalability of their products which I didn't realize was such an issue before reading your earlier point. I can't imagine that issue not being a major focus for the firm to improve upon.\n\n\nOne other point that's interesting though is that I don't think any company could acquire and integrate them fluidly and it appears by extension that they may have a pretty reliable moat in terms of intellectual capital and product offering. Any long term opinion of them?\n\n\nAddressing your question, Meta of course is much more scalable but I don't know how direct of a comp they are for PLTR just in terms of market cap, product mix, and of course different customer and geographic base.",
                  "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lguz21i/",
                  "created": 1722989135,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgsvvvd",
      "score": 12,
      "body": "Here we go again",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgsvvvd/",
      "created": 1722964871,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgsjfyz",
      "score": 7,
      "body": "I don’t understand what they do and I don’t understand why my calls didn’t pay off after earnings",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgsjfyz/",
      "created": 1722961052,
      "depth": 0,
      "replies": [
        {
          "id": "lgtf1xg",
          "score": 2,
          "body": "iv crush",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtf1xg/",
          "created": 1722970756,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgt7leb",
          "score": 1,
          "body": "What calls did u buy? I bought a month out atm and made a quick profit on them",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgt7leb/",
          "created": 1722968458,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lguehgq",
      "score": 6,
      "body": "DD writing needs work. I have no idea on PLTR but if you don’t know that ‘robot’ is a term for a physical device/machine then how can we trust your assessment of their AI? Your first bullet point is  like sales speak. Many of your bullet points are rephrasing or subsets of other bullet points.\n\nIf I made an excel data sheet that used multiple data sources, then added pivot tables to summarize that data and used copilot or bing ai to add some text I could use several of your bullet points to sell my ‘product’.\n\nGood luck.",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lguehgq/",
      "created": 1722981874,
      "depth": 0,
      "replies": [
        {
          "id": "lguehif",
          "score": 1,
          "body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lguehif/",
          "created": 1722981874,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgt6v62",
      "score": 9,
      "body": "Would you like to see my $38 bags ???",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgt6v62/",
      "created": 1722968232,
      "depth": 0,
      "replies": [
        {
          "id": "lhcbfvg",
          "score": 2,
          "body": "I bought some at $37. But I bought a whole lot more <$10.",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lhcbfvg/",
          "created": 1723238842,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgt9tss",
      "score": 3,
      "body": "Really drinking from the spigot on this one 🙄",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgt9tss/",
      "created": 1722969142,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lguvxjq",
      "score": 3,
      "body": "Once you go down that rabbit hole there is no returning.",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lguvxjq/",
      "created": 1722988007,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwzp02",
      "score": 3,
      "body": "Palantir is Salesforce for killing people.",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgwzp02/",
      "created": 1723025428,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgsfzx4",
      "score": 6,
      "body": "AIP is honestly a game changer, it’s basically chatGPT but with all of an organization’s data that they DO NOT want going into ChatGPT for confidentiality reasons. I just hope their sales team can pull it off. It’s all about the sales team and branding. 99% of people will never understand why or how Windows OS actually works, it just does and you have it because everyone else has it pre installed into desktops.\n\nIt’s all about the sales and branding.\n\nThe PROBLEM is they’re having to sell to data nerds in organizations that think they can build AIP themselves. Or organizations that are run by boomers who don’t GAF about LLMs.",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgsfzx4/",
      "created": 1722959972,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgt8k5b",
      "score": 5,
      "body": "Lol I've been hearing \"I'll buy any Palintir dips below $25\" since 2020.",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgt8k5b/",
      "created": 1722968755,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgtjyhe",
      "score": 2,
      "body": "They are creating Skynet.  \n\n[https://www.palantir.com/offerings/defense/](https://www.palantir.com/offerings/defense/)",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtjyhe/",
      "created": 1722972281,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgtmjok",
      "score": 2,
      "body": "Got it, puts on PLTR.",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtmjok/",
      "created": 1722973089,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgtncxw",
      "score": 2,
      "body": "I’m more curious about whether they use nvidia chips to power their ai systems.",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtncxw/",
      "created": 1722973340,
      "depth": 0,
      "replies": [
        {
          "id": "lk4dgp0",
          "score": 1,
          "body": "Did you find an answer to that? I am not very knowledgeable about this world, but have been seeing pltr namely associated with NVDIA a lot lately, not sure if it’s just a hype thanks to their marketing team or it is real.",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lk4dgp0/",
          "created": 1724729125,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgtzyp2",
      "score": 2,
      "body": "https://preview.redd.it/kdbtpffqv3hd1.jpeg?width=1200&format=pjpg&auto=webp&s=64be79f8ae09b7b8ecc59b97d345ac43fcc2956a\n\nme looking at adding more deep OTM $PLTR calls",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtzyp2/",
      "created": 1722977217,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgt70kw",
      "score": 2,
      "body": "Wait.. I thought they made bicycle pumps, FML another position to unwind. Thanks for the heads up!",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgt70kw/",
      "created": 1722968278,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgtmuyr",
      "score": 2,
      "body": "Stopped reading at \"leverages AI\"",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtmuyr/",
      "created": 1722973186,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgtte2j",
      "score": 2,
      "body": "Hard pass on another bubble stock. Earnings yield is .75%. My checking account has a higher yield.",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtte2j/",
      "created": 1722975200,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgu95tz",
      "score": 2,
      "body": "aka over hyped stocks using ai to hype people up, but reailty sets in so we get posts like this. \"\"im buying any dip below 25$\" Telling me your in the gme/bbby/amc mindset. where anything bad is FUD and this will be the next google ect.\n\nhes not trying to pump the stock and get more investors to pump his stock......no hes just speaking truth AI!!! it has AI!!!",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgu95tz/",
      "created": 1722980118,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgtkxw3",
      "score": 1,
      "body": "Cool! Sounds evil asf.",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtkxw3/",
      "created": 1722972585,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lguf4of",
      "score": 1,
      "body": "Position or ban, wtf MODS",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lguf4of/",
      "created": 1722982092,
      "depth": 0,
      "replies": [
        {
          "id": "lgxqrcb",
          "score": 1,
          "body": "Already posted",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgxqrcb/",
          "created": 1723037912,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lguzgpr",
      "score": 1,
      "body": "They do, uh, AI stuff",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lguzgpr/",
      "created": 1722989282,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lguzwox",
      "score": 1,
      "body": "It goes up and then goes down then up again.\n\nThis stock is similar to sofi; can’t ever break past a certain target and won’t ever drop below a certain target. \n\nBuy low, sell high, buy high, sell low. All day long.",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lguzwox/",
      "created": 1722989447,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwed5e",
      "score": 1,
      "body": "I've never liked PLTR and made some good trades on it recently. Not buying in again.",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgwed5e/",
      "created": 1723011613,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhm6mzy",
      "score": 1,
      "body": "It seems like foundry and AIP the same?",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lhm6mzy/",
      "created": 1723396718,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li4e9ft",
      "score": 1,
      "body": "War stock, bro",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/li4e9ft/",
      "created": 1723663370,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lm2o1rg",
      "score": 1,
      "body": "pltr sounds good; you recommend holding 10+ years?",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lm2o1rg/",
      "created": 1725775670,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgshyps",
      "score": 1,
      "body": "I attended one of their recruiting sessions years ago. They're essentially a consulting company that draws from the special operations and intelligence communities. It's no different than McKinsey or any other consultant, aside from them having a solid product to sell.",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgshyps/",
      "created": 1722960591,
      "depth": 0,
      "replies": [
        {
          "id": "lgslf9e",
          "score": 11,
          "body": "Essentially a consulting company, except they have a solid software to sell? Great way to end your comment by destroying your initial point. You would make an amazing lawyer!",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgslf9e/",
          "created": 1722961658,
          "depth": 1,
          "replies": [
            {
              "id": "lgsoj3h",
              "score": 2,
              "body": "I work in consulting/law and don't think you understand the business model. Accenture roughly does the same thing, along with many others. There are different service lines, but essentially implementation of their solution is what they sell. The consulting side is an assessment/sales pitch and they prefer operators to woo police and gov contracts. A consulting firm that doesn't have a unique product struggles in the marketplace long term.",
              "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgsoj3h/",
              "created": 1722962611,
              "depth": 2,
              "replies": [
                {
                  "id": "lgsuxhh",
                  "score": 1,
                  "body": "You are comparing them to Accenture? Then you clearly do not understand what Palantir is trying to achieve in the data analytics field. They are not trying to sell the implementation of their solution, they are trying to grow out the infrastructure of their platforms (Gotham, Foundry, etc) as well as their more scalable AIP platform. This will generate reoccurring revenues from several of their clients.\n\nThe biggest key factor is their 20 year head start in a field that is just starting to gain use cases commercially in the last 5 years. They have developed a ridiculous MOAT in the data analytics field, using their head start while being funded by the government.  Several of the largest tech companies have partnered with them to offer PLTR's platforms on top of their own services. Now you can see them growing with successful use cases from a variety of fields being presented at AIP conference. They are bottom line profitable and growing revenues/customer base in this challenging capital environment. I believe companies are realizing the benefits of PLTR's offerings are even more valuable during these challenging times where access to capital is more expensive and streamlining their businesses is crucial to navigate.",
                  "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgsuxhh/",
                  "created": 1722964575,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgsw0rx",
                      "score": 4,
                      "body": "As I said, I interviewed and saw what they were doing first-hand. I'm not knocking them, but just conveying what I saw and how I was told they made money.",
                      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgsw0rx/",
                      "created": 1722964914,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lgsxe9z",
                          "score": 0,
                          "body": "If revenue is growing nearly 30 percent YOY while maintaining margins to gain 0.09 EPS in today's investing environment.. I'll take that \"consulting\" money any day.\n\nUS commercial revenue increased 55 percent YOY, this is the metric that is key and is gaining. Government contracts are only half the equation.",
                          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgsxe9z/",
                          "created": 1722965337,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lgtbb21",
                              "score": 2,
                              "body": "It’s boutique consulting with in-house solutions. Are you regarded?",
                              "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtbb21/",
                              "created": 1722969602,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lgtcp0h",
                                  "score": 1,
                                  "body": "Lol I'm up 250k on PLTR with a $14 average. If that makes me regarded, I'll be a lifelong regard.",
                                  "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtcp0h/",
                                  "created": 1722970030,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lgv4dgx",
                                      "score": 0,
                                      "body": "How does that have an impact on pltr being a consulting company?",
                                      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgv4dgx/",
                                      "created": 1722991083,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lgwb9rw",
          "score": 1,
          "body": "https://x.com/arny_trezzi/status/1818997641507995873\n\nYour information is increasingly out of date.  Of all the companies to shout \"AI!\", Palantir is one of the few that has the right.  AI + Foundry is a marriage made in heaven.  Customers are seeing results within days, and fewer and fewer of them are requiring FDEs at all to deploy the software.  AIP has proven itself to have unbelievable value across the worlds largest and most important industries, including healthcare, aviation, manufacturing, shipping, retail, finance, government, military, and intelligence, and customers from each of these realms have testified to this at length.",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgwb9rw/",
          "created": 1723009764,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgsujx2",
      "score": -1,
      "body": "weaponized spyware to help governments spy and kill people, fun!",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgsujx2/",
      "created": 1722964459,
      "depth": 0,
      "replies": [
        {
          "id": "lgt16pd",
          "score": -1,
          "body": "Not only that! \n\nit’s also used by this renewable energy terrorists !\n\nhttps://youtu.be/SIcModuhHJY?si=mIXsVHWL9LsXdvmQ",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgt16pd/",
          "created": 1722966492,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgspq6s",
      "score": -2,
      "body": "This ain't no DD lmao stop copypasting bruh",
      "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgspq6s/",
      "created": 1722962974,
      "depth": 0,
      "replies": [
        {
          "id": "lgsq9lz",
          "score": 8,
          "body": "You must've lost money on PLTR today huh",
          "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgsq9lz/",
          "created": 1722963140,
          "depth": 1,
          "replies": [
            {
              "id": "lgsssn0",
              "score": 2,
              "body": "You posted a DD to promote PLTR and when it was pointed out that it had nothing proceed to accuse me of losing money lmao. Why don't you post your calls so we can see how much you've made bruh",
              "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgsssn0/",
              "created": 1722963911,
              "depth": 2,
              "replies": [
                {
                  "id": "lgstt0j",
                  "score": 7,
                  "body": "https://preview.redd.it/rmbwqp08t2hd1.png?width=608&format=png&auto=webp&s=eb7dfca455e9f009bad50fb1fc052ff8a1726cf9",
                  "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgstt0j/",
                  "created": 1722964227,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lgtukrk",
                  "score": 1,
                  "body": "Their new warp speed product. Will help re-industrialize America.. 600B market, and they’re out in front with no one close behind.",
                  "permalink": "/r/wallstreetbets/comments/1elkytx/pltr_wtf_do_they_do/lgtukrk/",
                  "created": 1722975562,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}