{
  "title": "Uber reports better-than-expected earnings and revenue for second quarter ",
  "score": 43,
  "selftext": "Uber on Tuesday reported second-quarter earnings results that topped Wall Street estimates. The stock rose about 6% at the market open.\n\nHere’s how the company did for the period ending June 30, compared with what Wall Street was expecting based on a survey of analysts by LSEG:\n\nEarnings per share: 47 cents vs. 31 cents expected\n\nRevenue:  $10.7 billion vs. $10.57 billion expected\n\nRevenue increased 16% from $9.23 billion a year earlier, Uber said in a press release. The company’s mobility unit reported a 23% increase in gross bookings to $20.6 billion. Gross bookings rose 16% in delivery to $18.1 billion, and were flat in the freight unit at $1.27 billion.\n\nCEO Dara Khosrowshahi had said the company expected around 20% growth for the second quarter, based on anticipated continued expansion in its core mobility business, and rising frequency of orders for food and trips through its membership subscribers.\n\nFor the third quarter, Uber expects bookings of $40.25 billion to $41.75 billion. The middle of the range, $41 billion, fell shy of the $41.18 billion average estimate, according to StreetAccount. The company expects adjusted earnings of $1.58 billion to $1.68 billion, with the middle of the range just above the $1.62 billion average estimate.\n\nUber’s “monthly active platform consumers,” or MAPCs, reached 156 million in the second quarter with 2.77 billion trips via the Uber platform. This compares with 137 million MAPCs and 2.28 billion trips during the same period a year ago.\n\nUber also reported $1.02 billion in net income for the quarter, which included a $333 million pretax benefit from “revaluations of Uber’s equity investments.”\n\nIn May, the company announced a partnership with Instacart that would add a “restaurants” tab to the grocery delivery app, enabling its users to order from restaurants and have deliveries fulfilled by Uber Eats.\n\nIn July, Chinese electric vehicle maker BYD and Uber announced a partnership to bring around 100,000 EVs to Uber drivers starting in Europe and Latin America. The companies also plan “to collaborate on future BYD autonomous-capable vehicles to be deployed on the Uber platform,” Uber said Tuesday.\n\nWhile BYD vehicles aren’t sold or available for lease in the U.S., Uber has a range of other incentives and options in place to motivate drivers to use Tesla and other battery-electric vehicles, rather than gas-powered cars.\n\nAnalysts on the earnings call asked Khosrowshahi about Uber’s experience with autonomous vehicles, including its partnerships and long-term strategy for the market. Uber and Waymo partner in Arizona to let Uber users book driverless rides and food deliveries as an option.\n\nKhosrowshahi didn’t disclose specifics about Waymo, but said broadly, “AV players” experience much higher utilization with Uber than they do “without a network on a first-party basis.” He said Uber “will continue to have the most liquid and largest marketplace” and that there will be a “pretty long hybrid period as autonomous is developing and regulators are trying to figure out exactly how to regulate it.”\n\n“We don’t think this will be a winner take all market,” Khosrowshahi said.\n\nUber shares were down 5% for the year as of Monday’s close, but are now up slightly after Tuesday’s rally.\n\nSource: https://www.cnbc.com/2024/08/06/uber-q2-2024-earnings.html",
  "link_flair_text": null,
  "id": "1elnadd",
  "num_comments": 5,
  "created_utc": 1722964170,
  "permalink": "/r/stocks/comments/1elnadd/uber_reports_betterthanexpected_earnings_and/",
  "comments": [
    {
      "id": "lgtbgat",
      "score": 9,
      "body": "Think it’s still a buy even after the gap up. Uber is one of a select few companies that isn’t currently a megacap that I could see being a megacap one day.\n\nThey started with ride hailing, added delivery and freight. I think there’s a good chance they’ll have their hands in every part of logistics over the next 5-10 years. And I also don’t see any legitimate threat to their ride hailing or delivery business. They will always exist as a duopoly with lyft and doordash\n\nFull disclosure it is my fifth largest position.",
      "permalink": "/r/stocks/comments/1elnadd/uber_reports_betterthanexpected_earnings_and/lgtbgat/",
      "created": 1722969647,
      "depth": 0,
      "replies": [
        {
          "id": "lgtvh2i",
          "score": 3,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1elnadd/uber_reports_betterthanexpected_earnings_and/lgtvh2i/",
          "created": 1722975834,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgxfgiz",
          "score": 0,
          "body": "Dont think Uber will survive. They make their money by exploiting drivers. 99% of drivers are not happy with Uber pay which covers the bare minimum.  There are new startups coming with ideas that will destroy Uber model and Lyft.",
          "permalink": "/r/stocks/comments/1elnadd/uber_reports_betterthanexpected_earnings_and/lgxfgiz/",
          "created": 1723033548,
          "depth": 1,
          "replies": [
            {
              "id": "lgxov5n",
              "score": 3,
              "body": "And what are these startups?",
              "permalink": "/r/stocks/comments/1elnadd/uber_reports_betterthanexpected_earnings_and/lgxov5n/",
              "created": 1723037224,
              "depth": 2,
              "replies": [
                {
                  "id": "lgxu8oy",
                  "score": 0,
                  "body": "I don't remember the name but google ride sharing startups in Texas",
                  "permalink": "/r/stocks/comments/1elnadd/uber_reports_betterthanexpected_earnings_and/lgxu8oy/",
                  "created": 1723039115,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgvymfs",
      "score": 2,
      "body": "Uber ain’t going anywhere \n\nI’m long",
      "permalink": "/r/stocks/comments/1elnadd/uber_reports_betterthanexpected_earnings_and/lgvymfs/",
      "created": 1723003171,
      "depth": 0,
      "replies": []
    }
  ]
}