{
  "title": "Reddit reports better-than-expected results for second quarter as digital ad market improves",
  "score": 88,
  "selftext": "[Reddit reported second-quarter results on Tuesday that topped analysts' estimates](https://www.cnbc.com/2024/08/06/reddit-rddt-q2-2024-earnings-report.html)\n\nHere are the key numbers:\n\n> Loss per share: 6 cents vs. the loss of 33 cents expected by LSEG\n\n> Revenue: $281 million vs. $254 million expected by LSEG\n\nSales in the second quarter rose 54% from a year earlier. The company's net loss narrowed to $10.1 million from $41.1 million in the same quarter a year earlier.\n\nOnline advertising revenue climbed 41% from a year prior to $253.1 million. The digital ad market is continuing to recover from a tough 2022, when businesses pulled back on promotional spending because of inflation and other factors.\n\nReddit's \"other revenue\" which includes the company's data licensing business, rose 691% to $28.1 million.\n\nReddit said it expects third-quarter sales of $290 million to $310 million. Analysts were expecting $278.7 million.\n\nThe company said its average revenue per user was $3.08 in the second quarter, topping analyst estimates of $3.02. The number of daily active users rose 51% year-over-year to 91.2 million, topping analyst estimates of 84.5 million, according to FactSet.\n\nThis is Reddit's second quarterly earnings report since the company went public in March on the New York Stock Exchange.",
  "link_flair_text": "Company News",
  "id": "1elsoxw",
  "num_comments": 53,
  "created_utc": 1722977071,
  "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/",
  "comments": [
    {
      "id": "lgu6sm9",
      "score": 35,
      "body": "I'm curious, is no one else concerned with the 437M spending on R&D? Seems like an awful lot considering it was around 130M in the past",
      "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgu6sm9/",
      "created": 1722979353,
      "depth": 0,
      "replies": [
        {
          "id": "lgu8xpq",
          "score": 27,
          "body": "That part is confusing me too. I was worried they were cooking their books and putting COGS in R&D.\n\nBut I am not so worried about that now. They increased their revenue by $98M, $82M of that went to free cash flow (83%). So I think their reported gross margin of 89% might actually be true.\n\nBut that still begs the question, what in the hell is the $437M going towards?",
          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgu8xpq/",
          "created": 1722980045,
          "depth": 1,
          "replies": [
            {
              "id": "lgu9o1h",
              "score": 11,
              "body": "Yeah I wasn't worried about them cooking the books until now (I hope they're being audited lol) but yeah I don't understand 437M. I'm guessing it's mostly AI (that's all they're talking about on the earnings call) but I feel like they're overspending. Feels like they're doing what WeWork was doing with leases.",
              "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgu9o1h/",
              "created": 1722980283,
              "depth": 2,
              "replies": [
                {
                  "id": "lial9ji",
                  "score": 1,
                  "body": "All websites, and especially ones as large and active as Reddit, require software engineers to maintain. Their salaries are included in R&D, and that allows tax rebates. Software engineers are highly paid.",
                  "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lial9ji/",
                  "created": 1723752179,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "liaripw",
                      "score": 1,
                      "body": "Thank you for your explanation, winning bigly. Shouldn't engineer salaries be included in the cost of operations? Thanks again and I hope you win bigly.\nCheers",
                      "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/liaripw/",
                      "created": 1723754159,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "liayubo",
                          "score": 1,
                          "body": "It's not. Because R&D gets tax credits.",
                          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/liayubo/",
                          "created": 1723756469,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lial8t0",
              "score": 1,
              "body": "All websites, and especially ones as large and active as Reddit, require software engineers to maintain. Their salaries are included in R&D, and that allows tax rebates. Software engineers are highly paid.",
              "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lial8t0/",
              "created": 1723752172,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgum29j",
          "score": 13,
          "body": "If they are to deliver better ads, that R&D is necessary for growth. Currently the ads targeting is lackluster, there is much room for improvement.\n\nI could see Reddit becoming a smaller version of Facebook in 5 years. Currently, Facebook is very much a non-anonymous version of Reddit. You mostly see group discussions and ads in you Facebook feed, and very rarely friends updates. Personally I think the discussion in here are much better than we see in Facebook.",
          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgum29j/",
          "created": 1722984500,
          "depth": 1,
          "replies": [
            {
              "id": "lgzw2n3",
              "score": 2,
              "body": "are you buying into the stock currently? Or do you have a target price to enter?",
              "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgzw2n3/",
              "created": 1723061949,
              "depth": 2,
              "replies": [
                {
                  "id": "lh02gio",
                  "score": 1,
                  "body": "I just buy in periodically. It's impossible to predict the future. \n\nI have some extra dry powder if the market crashes. If the prices keep falling then I'm going to add 42-46 USD, and then I'm going to use my last dry powder if it hits 36-38 USD. If it never hits those levels, then it's also fine.\n\nOther than that, I just plan to buy monthly regardless of price level, because I look at this investment from a 5-10-year perspective. There are a lot of avenues for future monetization and growth for Reddit.",
                  "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lh02gio/",
                  "created": 1723063893,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgum6n5",
          "score": 1,
          "body": "The same crew blew through billions over the last decade “developing” junk that no users asked for or wanted.",
          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgum6n5/",
          "created": 1722984543,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgv166z",
      "score": 25,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgv166z/",
      "created": 1722989902,
      "depth": 0,
      "replies": [
        {
          "id": "lgv60op",
          "score": 18,
          "body": "so even if you exclude the 575m IPO-SBC from calculation (which is difficult to do), the extrapolated annual Share Based Compensation of Reddit is now suddenly 250m. it used to be around 50m\n\n250m is almost 25% of revenue. and they are still operating at a loss, because of this SBC. by now there is no other reason but excessive pay. Reddit should have net earnings of at least 100m this year already.\n\nMeta, which is extraordinarily profitable, has SBC of 10% of revenue. average SBC is about 5% of revenue.\n\nto summarize, Q2/ 2023 vs Q2/2024: Reddit grew revenue 55%, and Share Based Compensation 550%. 10x\n\nit has to be expected they will continue to do that: align their compensation schemes along revenue growth to soak in all profits for themselves (CEO, Board, engineers), leaving shareholders with nothing. as of now this is more akin to a fraud than a business\n\nthey need someone thats shareholder/bottom-line conscious, someone like Alex Chriss, to replace Huffman imo",
          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgv60op/",
          "created": 1722991695,
          "depth": 1,
          "replies": [
            {
              "id": "lgxjy3f",
              "score": 6,
              "body": "And yet Meta pays way more than Reddit. SBC is important if the company wants to grow. You get what you paid for in talent, if SBC decreases you will have sub-par talent and the shit will go downhill real fast.",
              "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgxjy3f/",
              "created": 1723035374,
              "depth": 2,
              "replies": [
                {
                  "id": "lgy32q1",
                  "score": 3,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgy32q1/",
                  "created": 1723042039,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgybiiv",
                      "score": 2,
                      "body": "Interesting that they didn't grow their employee number. I am looking at their [press release from yesterday](https://investor.redditinc.com/news-events/news-releases/news-details/2024/Reddit-Announces-Second-Quarter-2024-Results/default.aspx) and it does not state the number of FTEs. Where can I find that? \n\n\n\nThey do however list the proceeds from exercising stock options. Is it possible employees are exercising stock options that were given many years ago and Reddit has very little control on that?",
                      "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgybiiv/",
                      "created": 1723044699,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lgz3dn7",
                          "score": 1,
                          "body": "[deleted]",
                          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgz3dn7/",
                          "created": 1723053191,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lgzqz5k",
                              "score": 2,
                              "body": "The stock underperformed because their ARPU didn't grow and their peers apart from Meta are not doing that great either. There is a general slow down in digital marketing due to US economy weakness.",
                              "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgzqz5k/",
                              "created": 1723060397,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lguapsc",
      "score": 44,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lguapsc/",
      "created": 1722980624,
      "depth": 0,
      "replies": [
        {
          "id": "lgxg7eh",
          "score": 4,
          "body": "Yeah for real, it’s an ad every other post on my feed and now they’re in the comments? Shit is going downhill.",
          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgxg7eh/",
          "created": 1723033860,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgu07t5",
      "score": 57,
      "body": "I dont understand the Reddit share this was a raise in guidence and still it drops like a fucking rock",
      "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgu07t5/",
      "created": 1722977294,
      "depth": 0,
      "replies": [
        {
          "id": "lgu0uzi",
          "score": 50,
          "body": "Because it’s carrying a $10B valuation and still working on narrowing losses. Its still up YTD but buyers were greedy with the valuation so its getting sold on earnings even though they weren’t bad",
          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgu0uzi/",
          "created": 1722977491,
          "depth": 1,
          "replies": [
            {
              "id": "lguf3py",
              "score": 11,
              "body": "Push comes to shove they could cut R&D and instantly become profitable. No clue why they are spending as much as they are.",
              "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lguf3py/",
              "created": 1722982083,
              "depth": 2,
              "replies": [
                {
                  "id": "lgufb0p",
                  "score": 12,
                  "body": "I genuinely don’t know enough about the company to say what exactly their R&D does for them, but I suspect their customer acquisition costs are not cheap",
                  "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgufb0p/",
                  "created": 1722982154,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgug8a4",
                      "score": 7,
                      "body": "That can't be high either. Everybody in the US at least knows about reddit and certainly plenty (at least who use Google) regularly see reddit pages in their search results. \n\nThe R&D spend really makes no sense at all and it's not even really something they touched on in the conference call today which is mind blowing considering it's basically the one thing keeping them from profitability.",
                      "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgug8a4/",
                      "created": 1722982470,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lgugqop",
                          "score": 7,
                          "body": "Just because people know about Reddit doesn’t mean they want to spend their ad dollars there. Everyone knows about Twitter but we all know how that went. Again I don’t know the company well enough to actually say so this is just speculating but I would think that Reddit would want to produce a lot of data showing how effective their ad engagement is, and I imagine to justify their valuation they are trying to show how they can continue growing at a high rate. So I can see why they might have a very high R&D budget, assuming you believe they can effectively monetize their user base, keep engagement high and attract advertisers",
                          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgugqop/",
                          "created": 1722982646,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lgui5kp",
                              "score": -3,
                              "body": "Reddit's political positioning (both the userbase and administration) is very much friendly towards advertisers. People cry about censorship, but nobody is accusing spez of being a fascist and and controversies are usually internal to the site itself (like the API fiasco) or caused by MAGAs throwing a fit because they can't be openly bigoted.",
                              "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgui5kp/",
                              "created": 1722983132,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lguige1",
                                  "score": 8,
                                  "body": "Even before Elons takeover, Twitter was struggling with several problems and not running a particularly lucrative business",
                                  "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lguige1/",
                                  "created": 1722983237,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lgveufv",
                          "score": 1,
                          "body": "> Everybody in the US at least knows about reddit\n\nThey might *know* about it but there are a lot of places in the US where it's not that popular as a discussion medium.",
                          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgveufv/",
                          "created": 1722995029,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lgu550r",
              "score": 14,
              "body": "It's not even expensive considering its growth and high margins.",
              "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgu550r/",
              "created": 1722978828,
              "depth": 2,
              "replies": [
                {
                  "id": "lgu60bk",
                  "score": 5,
                  "body": "I personally disagree. I think it’s plenty expensive. Growth does not always hold, and they have a lot of growth priced in. Margins do not always hold. Right now, the company hasn’t yet turned profitable so the valuation is entirely banking on growth expectations which carries a decent amount of risk",
                  "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgu60bk/",
                  "created": 1722979102,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgubij3",
                      "score": 5,
                      "body": "I get it but many analysts have the price target at $70 and it beat expectations.  Odd that it would fall",
                      "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgubij3/",
                      "created": 1722980886,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lgue27j",
                          "score": 7,
                          "body": "\"Many analysts\" say a lot of things.",
                          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgue27j/",
                          "created": 1722981727,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lguem53",
                          "score": 2,
                          "body": "Most analysts are stock analysts the same way random people on social media are journalists.",
                          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lguem53/",
                          "created": 1722981916,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lgu5ule",
              "score": 5,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgu5ule/",
              "created": 1722979051,
              "depth": 2,
              "replies": [
                {
                  "id": "lgukqyf",
                  "score": 7,
                  "body": "The number of years it existed before IPO is irrelevant. RDDT now has shareholders and is growing. The only thing that matters now is revenue and guidance and both of those things are increasing.",
                  "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgukqyf/",
                  "created": 1722984043,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lgu6biq",
                  "score": 2,
                  "body": "I agree I think people compare it to Facebook when Twitter seems more appropriate to me",
                  "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgu6biq/",
                  "created": 1722979201,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgu5a3p",
          "score": 6,
          "body": "Best time to buy...",
          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgu5a3p/",
          "created": 1722978873,
          "depth": 1,
          "replies": [
            {
              "id": "lgu6kxr",
              "score": 1,
              "body": "I mean so far April 19th was the best time to buy but we’ll see if this proves an opportunity or a trap",
              "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgu6kxr/",
              "created": 1722979284,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgukoz0",
          "score": 2,
          "body": "Because the market was pricing in higher guidance - once they saw the actual results, they saw the price was higher than they expected",
          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgukoz0/",
          "created": 1722984024,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgu0yu9",
          "score": 2,
          "body": "Earnings are a gamble",
          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgu0yu9/",
          "created": 1722977525,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgxa9nn",
          "score": 1,
          "body": "Fucking hell it's up 4% on the premarket. I was looking to buy...",
          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgxa9nn/",
          "created": 1723031256,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgxtoi5",
          "score": 1,
          "body": "It's also because insiders have been shorting the stock to lock in their stock price pre lock up expiry.  Expect more of a price decline as the lock up expiry arrives on Friday.",
          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgxtoi5/",
          "created": 1723038925,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgu1c7d",
      "score": 3,
      "body": "What ads?",
      "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgu1c7d/",
      "created": 1722977637,
      "depth": 0,
      "replies": [
        {
          "id": "lgu6k1i",
          "score": 2,
          "body": "Also wondering - have not seen that many ads",
          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgu6k1i/",
          "created": 1722979276,
          "depth": 1,
          "replies": [
            {
              "id": "lgu87co",
              "score": 13,
              "body": "Do you see those posts which say promoted next to them?",
              "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgu87co/",
              "created": 1722979805,
              "depth": 2,
              "replies": [
                {
                  "id": "lgu8isf",
                  "score": 3,
                  "body": "Yes! Forgot about them but just noticed one on my home screen so updated my comment. There are not that many that I have seen so I wonder how much they can really milk that without adding more ads",
                  "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgu8isf/",
                  "created": 1722979908,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lguc15r",
                      "score": 2,
                      "body": "They will ad more ads just like other social media sites after they went public. FB was pretty ad minimal before they went public and now it's nearly all ads. Expect more ads because as a public company they are expected to actually get profitable.",
                      "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lguc15r/",
                      "created": 1722981055,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgub4ci",
      "score": 1,
      "body": "I was expecting it to rocket like UPST",
      "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgub4ci/",
      "created": 1722980757,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgumfm3",
      "score": 1,
      "body": "Saw the incredibly trustworthy CEO on tv claiming American users are up 72% in the last month (or maybe it was quarter?)\n\nThat can’t possibly be true, can it?",
      "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgumfm3/",
      "created": 1722984630,
      "depth": 0,
      "replies": [
        {
          "id": "lgy6zsb",
          "score": 5,
          "body": "Fake American accounts are up 72% maybe",
          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgy6zsb/",
          "created": 1723043286,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgv079z",
      "score": -2,
      "body": "Reddit is not a good investment. It doesn’t have as strong a value proposition to users and advertisers as Amazon, Alphabet, Meta, etc.",
      "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgv079z/",
      "created": 1722989556,
      "depth": 0,
      "replies": [
        {
          "id": "lgx3xgs",
          "score": 7,
          "body": "To me, all of those are such bad comparisons. You are talking about trillion-dollar companies and trying to compare RDDT to them, that has a market cap of that is just pushing 10 billion?\n\nI think more fair comparisons are Pinterest or Snap. \n\nMy personal thesis is that Reddit is worth *at least* what Twitter was worth pre-Elon. For me, doubling from current price is absolutely in the scope of possibility.",
          "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgx3xgs/",
          "created": 1723027906,
          "depth": 1,
          "replies": [
            {
              "id": "lgx6kep",
              "score": -2,
              "body": "These types of social platforms are lower value to advertisers. I do not think Reddit has much growth potential.",
              "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgx6kep/",
              "created": 1723029373,
              "depth": 2,
              "replies": [
                {
                  "id": "lgx9o6t",
                  "score": 5,
                  "body": "Lower value than what? All of the platforms you mentioned? Of course. Reddit isn't a META or a Google or Amazon. \n\n> I do not think Reddit has much growth potential.\n\nOh, the potential is absolutely there. Ask any SEO about how Reddit has impacted search results over the past year. Reddit has low key become a household name over the past 5 or so years-ish. For me, it is just a matter if they can squeeze it out in a way that extracts money. They have the users. [They are the 6th most visited website on the internet](https://explodingtopics.com/blog/most-visited-websites). Extracting dollars from that is the challenge. \n\nThat, macro-economic changes for tech, in general, is a big worry for me.",
                  "permalink": "/r/stocks/comments/1elsoxw/reddit_reports_betterthanexpected_results_for/lgx9o6t/",
                  "created": 1723030974,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}