{
  "title": "Rivian tops Wall Street's second-quarter expectations amid cost cuts ",
  "score": 117,
  "selftext": "Rivian Automotive beat Wall Street’s top- and bottom-line expectations for the second quarter as the electric vehicle maker continues to take costs out of its business.\n\nHere is how the company did, compared to estimates from analysts polled by LSEG:\n\nEarnings per share: Loss of $1.13 adjusted vs. loss of $1.21 expected\n\nAutomotive revenue: $1.16 billion vs. $1.14 billion expected\n\nThe company’s adjusted net losses widened during the second quarter to $1.46 billion, or a loss of $1.46 per share, compared with a year earlier of $1.2 billion, or a loss of $1.27 per share.\n\nIts adjusted earnings before interest, taxes, depreciation and amortization, or EBITDA was about level from the same period as a year ago at a loss of $860 million.\n\nRivian on Tuesday reaffirmed its 2024 guidance of 57,000 total units of production, a loss of $2.7 billion in adjusted EBITDA and $1.2 billion in capital expenditures.\n\nThrough the first six months of the year Rivian produced about 23,600 vehicles, including only 9,162 during the second quarter due to downtime at the company’s plant to retool and reduce costs.\n\nThe second-quarter results come more than a month after Rivian held an investor day that focused on cost-cutting efforts, efficiency gains and in-house technologies and software. The event came days after Rivian announced plans for Volkswagen to invest up to $5 billion in the EV startup, starting with an initial investment of $1 billion.\n\nShares of Rivian are off 37% this year amid slower-than-expected demand for EVs as well as Rivian’s significant cash burn. The stock closed Tuesday at $14.80, up 1.3%.\n\nRivian, which is still losing thousands of dollars for every vehicle it makes, has been focused on reducing costs. Rivian CEO RJ Scaringe said in June that efficiencies earlier this year in products and manufacturing are expected to lead to 20% material cost reductions in its current vehicles, followed by 45% targeted reductions in its upcoming “R2” vehicles, which are projected to begin production in early 2026.\n\nRivian’s expenditures through the first half of the year were $537 million, including $283 million during the second quarter.\n\nRivian ended the second quarter with $9.18 billion in total liquidity, including $7.87 billion in cash, cash equivalents and short-term investments.\n\n\nSource: https://www.cnbc.com/2024/08/06/rivian-tops-second-quarter-earnings-expectations-following-cost-cuts.html",
  "link_flair_text": null,
  "id": "1eltaiu",
  "num_comments": 42,
  "created_utc": 1722978513,
  "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/",
  "comments": [
    {
      "id": "lgudygx",
      "score": 73,
      "body": "What's the most money a company has ever had in net losses before turning net profitable?\n\nFeel like Rivian has to be a contender",
      "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgudygx/",
      "created": 1722981692,
      "depth": 0,
      "replies": [
        {
          "id": "lgv2vt9",
          "score": 53,
          "body": "It took Uber like 15 years to get profitable after receiving nearly unlimited VC money and they weren't even selling a physical product like Rivian is. Lol.",
          "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgv2vt9/",
          "created": 1722990528,
          "depth": 1,
          "replies": [
            {
              "id": "lgvfluf",
              "score": 30,
              "body": "It's kind of amazing when you put it like that. Essentially they are an app that collects a fee while everyone else does all the work, takes all the risk, and provides all the physical product.\n\nIncredible that they weren't swimming in money fairly quickly.",
              "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgvfluf/",
              "created": 1722995317,
              "depth": 2,
              "replies": [
                {
                  "id": "lgvqncf",
                  "score": 22,
                  "body": "They would have been if they weren’t competing for market share with other money-fat startups. \n\nThey subsidized rides for a long time to try to grab market share",
                  "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgvqncf/",
                  "created": 1722999666,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgw3d6w",
                      "score": 7,
                      "body": "Which is always mentioned in talks about vc funded company wars. The market inefficiency is very real when unlimited money supply is funding competitors that otherwise wouldn’t exist which should allow for a healthy merger environment however that creates  monopolistic companies",
                      "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgw3d6w/",
                      "created": 1723005457,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lgueqj6",
          "score": 12,
          "body": "My guess would be Amazon or Tesla but not sure- good question.",
          "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgueqj6/",
          "created": 1722981957,
          "depth": 1,
          "replies": [
            {
              "id": "lgujk82",
              "score": 29,
              "body": "It's definitely not Tesla. One of the reason they've actually survived is because of how insanely capital efficient they've been\n\n@Alojoh on twitter made this really nice chart to visualize the cumululative losses of the various EV startups, including Tesla and Rivian -\nhttps://pbs.twimg.com/media/GOuMk6WWwAAOovJ?format=jpg&name=small\n\nIt's actually this chart that's made me wonder if Rivian's the company with the highest combined net loss. It's an absolutely absurd chart to look imo.\n\nedit - updated chart from a few hours ago - https://x.com/alojoh/status/1821075277444780450",
              "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgujk82/",
              "created": 1722983626,
              "depth": 2,
              "replies": [
                {
                  "id": "lgul82g",
                  "score": 7,
                  "body": "Ya good chart. Looks like Rivian might be the winner here.",
                  "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgul82g/",
                  "created": 1722984209,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgursdf",
                      "score": 5,
                      "body": "Uber?",
                      "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgursdf/",
                      "created": 1722986529,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lgus6l8",
                          "score": 3,
                          "body": "Another good pick",
                          "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgus6l8/",
                          "created": 1722986670,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lguu929",
                  "score": 6,
                  "body": "That's insane, I thought lucid was bad",
                  "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lguu929/",
                  "created": 1722987406,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lguud28",
                      "score": 14,
                      "body": "Lucid is way worse on a cost per car made basis. 100% going bankrupt if they ever lose their Saudi sugar daddy",
                      "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lguud28/",
                      "created": 1722987446,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lguvovp",
                          "score": 8,
                          "body": "They solely exist through sunk cost fallacy of the Saudis. Its going to take some magic for them to even get to break even let alone a positive cash flow",
                          "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lguvovp/",
                          "created": 1722987920,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lgv3w1g",
                  "score": 4,
                  "body": "I don't know Uber has been at the net loss game for a while as well. The numbers I found between 2014 and 2022 were over 31 billion.",
                  "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgv3w1g/",
                  "created": 1722990903,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lgxvymb",
                  "score": 2,
                  "body": "I remember hearing one assessment that applied to both Rivian and Lucid, they both started out will too much money and as such never were disciplined.",
                  "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgxvymb/",
                  "created": 1723039701,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lgv0fw3",
                  "score": 2,
                  "body": "Think this is because Tesla was the first to do it and Rivian wants to speedrun to where Tesla is with the support of their investors + Amazon so they don’t care to spend more to catch up",
                  "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgv0fw3/",
                  "created": 1722989641,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgwzwg2",
                      "score": 5,
                      "body": "Rivian isn't speedrunning anything though. They're 6 years younger than Tesla, so if they were speedrunning Tesla they should be ahead of where Tesla was 6 years ago. In order to be ahead of where Tesla was 6 years ago, Rivian would have to sell over 367k vehicles this year\n\nNeedless to say they are not even close to doing that",
                      "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgwzwg2/",
                      "created": 1723025556,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lgv7vzq",
                      "score": 9,
                      "body": "No it’s because Tesla scaled and released a mid income affordable vehicle. Rivians are still too expensive for mass consumer and cost too much to produce. \n\nNot sure if sleeping in the factory will help, but they haven’t figured out how to make what they have profitable. Tesla and Elon did.",
                      "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgv7vzq/",
                      "created": 1722992390,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lgvflly",
                          "score": 4,
                          "body": "What are you talking about they are doing the exact same thing. Model S was their high end expensive model and then launched a cheaper model 3. Rivian launched their expensive model and is coming out with their affordable in the upcoming years.",
                          "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgvflly/",
                          "created": 1722995314,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lgx0zod",
                              "score": 2,
                              "body": "Tesla was the cheap money era; that is certainly not the landscape anymore",
                              "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgx0zod/",
                              "created": 1723026211,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lgve6tv",
                  "score": 1,
                  "body": "Great chart, but wonder how it would look compared to Tesla adjusted for inflation.",
                  "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgve6tv/",
                  "created": 1722994782,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgwo26s",
                      "score": 3,
                      "body": "[https://x.com/alojoh/status/1806005139720806616](https://x.com/alojoh/status/1806005139720806616)\n\ndoesn't really seem to be much different. Rivian is still unrivaled when it comes to cash burning",
                      "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgwo26s/",
                      "created": 1723017830,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lhqisre",
                          "score": 1,
                          "body": "Thank you",
                          "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lhqisre/",
                          "created": 1723466336,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lguxadr",
      "score": 15,
      "body": "I’m struggling to understand how their loss did not improve when they took the line down to reduce their material costs by a double digit percentage",
      "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lguxadr/",
      "created": 1722988494,
      "depth": 0,
      "replies": [
        {
          "id": "lgv8r0k",
          "score": 22,
          "body": "Majority of their cost gains won't be seen until Q3 and Q4 for current gen2",
          "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgv8r0k/",
          "created": 1722992717,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgv93zs",
          "score": 7,
          "body": "This is Q2, efficiencies put in the 2nd gen R1s will be reflected in their Q3 since deliveries started only recently.",
          "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgv93zs/",
          "created": 1722992855,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lguksgf",
      "score": 22,
      "body": "Man, Rivian is good at losing money",
      "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lguksgf/",
      "created": 1722984057,
      "depth": 0,
      "replies": [
        {
          "id": "lgulsjd",
          "score": -4,
          "body": "Lol they learn from their parent Amazon.",
          "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgulsjd/",
          "created": 1722984406,
          "depth": 1,
          "replies": [
            {
              "id": "lguw9g2",
              "score": -1,
              "body": "To be fair to Amazon, Rivian wishes they had the kinds of finances that Amazon had way back in the day\n\nPeople really don't grasp how insanely bad Rivians finances are. They've literally never had a quarter where their net losses weren't greater than their total revenue in that quarter",
              "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lguw9g2/",
              "created": 1722988124,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgv9ile",
      "score": 25,
      "body": "I know lots of Tesla owners are planning to buy a Rivian, especially when R2 is available. It is a great car and it has a sane CEO.",
      "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgv9ile/",
      "created": 1722993008,
      "depth": 0,
      "replies": [
        {
          "id": "lgw0erl",
          "score": 10,
          "body": "You don't get to the accomplishments of Elon by being sane.\n\nSpaceX, Tesla, Neuralink, etc., aren't sane products. It's a guy who is highly obsessed. Who the heck starts a space rocket company because he wants to colonize Mars and by doing so, created the largest space rocket in human history that is reusable?\n\nYou can disagree with his politics but you can't question Elon's entrepreneurship.",
          "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgw0erl/",
          "created": 1723004014,
          "depth": 1,
          "replies": [
            {
              "id": "lgwyw48",
              "score": -13,
              "body": "It's funny because Elon was a traditional Democrat for most of his life. But now he's the one who's \"insane\" for supporting basic rights like free speech.",
              "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgwyw48/",
              "created": 1723024926,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lh1vh8d",
              "score": -2,
              "body": "neuralink?  really?  the monkey killer that implanted something in one human that only worked for a while and was technology we already had...most of which didn't even require putting shit in your brain?  That is before entertaining the idea of wanting elon musk's interests dictating what implants in your brain do.  The dude is an idiot.  Elon is one step from marketing medbeds at this point.  Everything he touches is going to start dying (or has already started: tesla, twitter) or has already died (boring company, his hyperloop nonsense that was never going to exist, solarcity which he used his other company to bail out basically).  The dude is a clown who can only succeed to the level actual engineers that are willing to work for him can succeed and the level at which elon stays out of their job instead of pretending he knows more than them.  \n\nSpaceX and Tesla are perfectly sane products.  He didn't invent rockets or cars or electric cars.  he just marketed well until he decided to become a drug addict internet troll on his own website he paid an arm and a leg for.",
              "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lh1vh8d/",
              "created": 1723087374,
              "depth": 2,
              "replies": [
                {
                  "id": "lh6b3ig",
                  "score": 1,
                  "body": "[removed]",
                  "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lh6b3ig/",
                  "created": 1723151949,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lh6po0b",
                      "score": 1,
                      "body": "Trolling, insults, or harassment, especially in posts requesting advice, is not tolerated.  Please try to keep discussions on /r/stocks civil by providing straightforward responses without including any insults or harassment.\n\nContinual abuse of /r/stocks rule #5 regarding trolling, insulting and harassment will result in your account being banned.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules",
                      "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lh6po0b/",
                      "created": 1723156874,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lhjwqjf",
                  "score": 1,
                  "body": "In regards to neuralink; it will never work because the brain recognizes the implants as foreign and creates a scar tissue barrier that essentially seals off any possible connection.",
                  "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lhjwqjf/",
                  "created": 1723357365,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lh1xlah",
                  "score": 1,
                  "body": "Neuralink is in a second brain now. We will see how it goes soon. Also, did the chips kill the monkeys or were the monkeys used because they had a terminal illness? Both end with the same result, one is more ethical.",
                  "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lh1xlah/",
                  "created": 1723088294,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgxx3gr",
          "score": 2,
          "body": "Elon or no Elon, I will not buy from Rivian until they show they can make a profit on the actual production of a vehicle. There is still every chance they can go the route of Fisker.  \n  \nThey claim they will show a gross profit on manufacturing but that doesn't full solve their money problem, 496m on SG&A alone! Add in the R&D over 400m means they will not be net positive anytime soon. That VW infusion made the quarter look better than it was.  Then comes that 18B deficit...",
          "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgxx3gr/",
          "created": 1723040082,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgvj97m",
      "score": 6,
      "body": "They do make a sexy vehicle.",
      "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgvj97m/",
      "created": 1722996719,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgx0gmq",
      "score": 1,
      "body": "Manufacturing in Irvine, CA is very expensive",
      "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgx0gmq/",
      "created": 1723025894,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgxjktz",
      "score": 0,
      "body": "Very difficult beating Tesla",
      "permalink": "/r/stocks/comments/1eltaiu/rivian_tops_wall_streets_secondquarter/lgxjktz/",
      "created": 1723035232,
      "depth": 0,
      "replies": []
    }
  ]
}