{
  "title": "What companies are on your \"DO NOT TOUCH\" list?",
  "score": 748,
  "selftext": "People have been saying Intel is a poorly run company for a while now. What other companies are on your list? Companies that may seem decent, but are run poorly and not set up to succeed in the long run. Comapnies like Boeing, Intel",
  "link_flair_text": "Industry Discussion",
  "id": "1em2jih",
  "num_comments": 1112,
  "created_utc": 1723004070,
  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/",
  "comments": [
    {
      "id": "lgwcvht",
      "score": 1437,
      "body": "AirBNB because they can be wiped out of a region with legislation.\n\nUber because their prices are no longer competitive and they too are being targeted for their contractor policies bringing parity to taxis.\n\nDoordash.\n\nAnything biotech because I don't understand it.   \n\nNetflix because I think they've hit peak subscribers and the content is like the bargain bin at wal mart.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwcvht/",
      "created": 1723010710,
      "depth": 0,
      "replies": [
        {
          "id": "lgwqtoj",
          "score": 474,
          "body": "Anything biotech as I don’t understand it.\n\nBased.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwqtoj/",
          "created": 1723019659,
          "depth": 1,
          "replies": [
            {
              "id": "lgxmdar",
              "score": 39,
              "body": "I just looked for biotechs that promise rejuvenating solutions and have an umbrella in the name.  Nothing can go wrong.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxmdar/",
              "created": 1723036305,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgx8t20",
              "score": 170,
              "body": "Yeah betting on biotech requires a deep knowledge of not only ailments but also how the FDA, EMA, and the general industry work.\n\nI’m a 15 year pharma veteran so I feel comfortable making bets there but the things I look for are so niche and situational that it’s hard to explain them to people.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx8t20/",
              "created": 1723030554,
              "depth": 2,
              "replies": [
                {
                  "id": "lgzk93z",
                  "score": 18,
                  "body": "I am currently working at a biotech startup, and from my experience - if I was to invest into another biotech company, I'd look at following (in order of importance):\n\n- Scientific background: look for the publications and where they are published (preferably high impact journals, such as Lancet / Nature)\n- Scrutinize results of published retrospective and prospective studies and trials (number of studies, methodologies, cohorts, sample sizes...)\n- Business strategy: what are the target markets, what's the strategy and roadmap for reimbursement and inclusion into clinical guidelines (without this information clear as day, I'd steer away)\n- QA / Regulatory healthcheck: e.g if the company's product is a medical device or SaMD, where on the roadmap is getting IVDR marking? What certs company has and which standards it complies with?\n- Is the company actively seeking and getting grants for studies and projects? To get grant money, usually you go through strict DD processes. Ofc, depending on who is granting the money - a big green flag is if EU institution grants the money\n\nThis is ofc, not an exhaustive list, but it would be a starting point for me if I was putting the money on the table. Other points would depend on the product: e.g if company is AI company - I'd have questions about source and exclusivity of training data, strategy for compliance with AI act, cybersecurity etc...",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgzk93z/",
                  "created": 1723058348,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lgy6rpn",
                  "score": 36,
                  "body": "I’m the former COO of a large cancer research institute, and I don’t have a clue which ones are golden and which ones are dog turds.",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgy6rpn/",
                  "created": 1723043214,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lgxaoeh",
                  "score": 27,
                  "body": "I've had good experiences with Bio so far, but finding the companies I'm comfortable buying, takes a long time. It's a relatively simple buisness that comes down to monitoring buisness progress and potential possibilities.",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxaoeh/",
                  "created": 1723031444,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lgxh3lg",
                  "score": 8,
                  "body": "Yeah, I'm 4 years into the industry and I would have a hard time figuring out where to put some money beyond the bigger companies. Anything in the smaller startup / R&D space is going to be a needle in a haystack with a pretty long return schedule barring a buyout or some sort of large external investment. Not to mention the added risk of someone running afoul of regulatory and getting shut down for a while.",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxh3lg/",
                  "created": 1723034231,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lgy3uow",
              "score": 19,
              "body": "Even if you don't know anything about biology, one thing that is easy to understand is that biotech startups pour billions into years-long clinical trials. They most often have zero revenue for years and are not guaranteed to ever make any of it back if they don't get approval. It's way more risky than even a tech startup, which is already risky.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgy3uow/",
              "created": 1723042287,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgx6quj",
              "score": 39,
              "body": "\"We are going to be the ones who finally cure cancer.\" - every biotech ever.\n\nSome day, one of them will be telling the truth... but that's a pretty big haystack to look for a needle in.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx6quj/",
              "created": 1723029472,
              "depth": 2,
              "replies": [
                {
                  "id": "lgx9xgt",
                  "score": 18,
                  "body": "Buy in early, sell before phase 3 comes out",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx9xgt/",
                  "created": 1723031094,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgx3cv6",
          "score": 31,
          "body": "Amazon prime has movies you find in the charity shop for 1 quid and nobody ever really knew existed.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx3cv6/",
          "created": 1723027588,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgxd5lt",
          "score": 27,
          "body": "AirBNB doesn't even need legislation. HOAs and COAs can ban them easier",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxd5lt/",
          "created": 1723032561,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgwse39",
          "score": 30,
          "body": "Agree with all…but Netflix I feel has potential to expand to more countries globally…its becoming very popular in Africa etc for example",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwse39/",
          "created": 1723020679,
          "depth": 1,
          "replies": [
            {
              "id": "lgxchab",
              "score": 11,
              "body": " Still waiting for \"why are you running 2 \" to be released on Netflix",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxchab/",
              "created": 1723032260,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgx9lxc",
          "score": 58,
          "body": "AirBNB should be wiped out. I firmly believe they are one of the main culprits of the housing crisis.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx9lxc/",
          "created": 1723030943,
          "depth": 1,
          "replies": [
            {
              "id": "lgy9spg",
              "score": 12,
              "body": "its more the REITs that are buying up houses.....thank jeff bezos",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgy9spg/",
              "created": 1723044164,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgwoy24",
          "score": 57,
          "body": "I agree with Netflix or any other subscription-based company like Spotify that has little room for more subscribers while subscriptions could plummet like a rock if another better app comes along. Remember when Pandora was on top of the music streaming world from around 2012 to 2020 then fell into obscurity nearly overnight? That could happen to Netflix or Spotify. Heck, Netflix killed Blockbuster quickly and ruthlessly and another company could kill Netflix just as easily.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwoy24/",
          "created": 1723018412,
          "depth": 1,
          "replies": [
            {
              "id": "lgxiunb",
              "score": 25,
              "body": "The takes on this sub...just wildly bad sometimes. \n\n> that has little room for more subscribers\n\nSometimes americans forget that literally the rest of the world exists.\n\n> could plummet like a rock if another better app comes along\n\nIts moved beyond just having a good app. All the big boys (spotify, netflix to use the two you point out) have built up a significant moat to their (basically non-existent) competition. just some examples:\n\nSpotify has crazy licensing deals with groups like Universal, Sony, Warner, that make it feasible for them have the catalogue they have at the price point they have it.  Its taken years for them to make these deals, and its because they were first on the scene. They also have publishing rights - which include mechanical licenses and performance rights. They also have exclusive partnerships (Joe Rogan as an example) that their size and capital allows them to aquire. Their royalty stucture (which killed pandora) has been meticulously crafted and lobbied for over like 2 decades to make it feasible to support the model they do. \n\nNetflix: Has partnerships with basically all major studios, they have global licensing rights, they have original content that they produce which includes exclusive distribution rights - and which is being increasingly targeted towards non-american consumers. They have a complex and robust royalty management program. A huge lobbying arm. \n\n\nLike to think that 'a pRetTiEr aPp cOuld kIlL tHeM' means you fail to realize the scale of these companies and the deliberate moat they have built up. This isnt a brick and mortar retailer that was killed by the literal advent of a new technology and repeated incompetence in the leadership team who displayed their complete inability to pivot. Spotify is also not a small time internet radio outlet who basically came about like some skunkworks plan and who was nearly eviscerated because of their complete disregard for the legal and regulatory constraints - I mean the fact that they spent literally no money trying to lobby against the changes made by the CRB in regards to royalties was the beginning of the end as them (pandora) to be a viable company.\n\nSeriously chuckleheaded take.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxiunb/",
              "created": 1723034943,
              "depth": 2,
              "replies": [
                {
                  "id": "lh27h9u",
                  "score": 5,
                  "body": "Netflix and Prime will slowly and steadily kill traditional media or atleast take their place. Sports are next in their portfolio. It's disney and fox who would be fucked by the money of these two titans.",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lh27h9u/",
                  "created": 1723093021,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lgytpv8",
                  "score": 4,
                  "body": "Could not agree more. This is why we make money. Most people use insanely lazy first-order thinking to place huge bets with their retirement money. \n\nSeriously this person should NOT invest their own money.",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgytpv8/",
                  "created": 1723050274,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lgwywqy",
              "score": 12,
              "body": "Couldn't Spotify move into TV/movies too?\n\nYour thesis seems to depend on them staying in music - which their past decisions to move into podcasts then books says they may not.\n\nJust a thought - you do you. Just providing a possible different idea.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwywqy/",
              "created": 1723024937,
              "depth": 2,
              "replies": [
                {
                  "id": "lgx2sp3",
                  "score": 12,
                  "body": "That's all audio though. I could see them move into concerts in some form as they already advertise them but I don't think they've got so much cash they're ready to chuck it into risky ventures. I don't think there's any chance of them moving into TV and movies, it's crowded and they'd be a tiny fish.",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx2sp3/",
                  "created": 1723027271,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lgyb0zj",
              "score": 3,
              "body": "They both have earnings til the year 3000 baked in already anyway.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgyb0zj/",
              "created": 1723044546,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgwsvei",
          "score": 8,
          "body": "Your damn right about uber, I'm sure it varies in pricing slightly from country to country but I'll talk from an Australian standpoint. When uber was first introduced or in its earlier stages it was competitive pricing and people were quick. Now it takes a while to find one, when you do there's a solid chance they drive in some random direction for a while before coming to you. To top it off it's basically no cheaper than booking a cab anymore, I often check and it'll be like 70$ for an uber somewhere that might take 30 mins to accept and get to you or 75$ for the cab that comes straight away. Simply put uber lost all of its competitive edge, didi is even worse. But I am optimistic about the future of ride shares, iv got a small parcel of $ACHR that I'm going to buy some more of soon. Would have diversified and also bought Joby but they're partnered with boeing, not much more to be said there.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwsvei/",
          "created": 1723020994,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgwiljr",
          "score": 23,
          "body": "Damn you make some good points.\n\nI hope netflix goes down to 200 again so I can buy and hold this time.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwiljr/",
          "created": 1723014257,
          "depth": 1,
          "replies": [
            {
              "id": "lgwjgxr",
              "score": 8,
              "body": "Lol I bought at 80 and sold at 140.   The fuck do I know what I'm doing haha.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwjgxr/",
              "created": 1723014808,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgwsi4i",
          "score": 57,
          "body": "I think Netflix has huge upside going into live sports and events.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwsi4i/",
          "created": 1723020752,
          "depth": 1,
          "replies": [
            {
              "id": "lgwynxr",
              "score": 25,
              "body": "Imagine if they got the contract for the Olympics instead of Discovery/Disney. That couldve been amazing content and had a host of new temp subscribers.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwynxr/",
              "created": 1723024785,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgwrpgt",
          "score": 11,
          "body": "Honestly think this will age like sour grapes but I guess we will see.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwrpgt/",
          "created": 1723020232,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgy7m0g",
          "score": 3,
          "body": "Why Doordash?",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgy7m0g/",
          "created": 1723043481,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lh2jbpj",
          "score": 3,
          "body": "Tesla, since the valuation is dependent on them pulling off some impossible shit",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lh2jbpj/",
          "created": 1723099887,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgw5rvm",
      "score": 563,
      "body": "CVNA - Carvana",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw5rvm/",
      "created": 1723006695,
      "depth": 0,
      "replies": [
        {
          "id": "lgwub49",
          "score": 100,
          "body": "I'm British so my brain fails to comprehend a car vending machine but from looking at the company they don't seem too bad tbh. The stock seems a little overpriced but nothing major. Am I missing something? I understand that in the UK Cazoo which was very similar collapsed.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwub49/",
          "created": 1723021948,
          "depth": 1,
          "replies": [
            {
              "id": "lgxh715",
              "score": 43,
              "body": "They got caught selling stollen cars.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxh715/",
              "created": 1723034271,
              "depth": 2,
              "replies": [
                {
                  "id": "lgzu3ih",
                  "score": 3,
                  "body": "How do you sell a car without (your name on) the title?",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgzu3ih/",
                  "created": 1723061349,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lgxeskn",
              "score": 20,
              "body": "Its a large company with basically a single revenue stream (two tied together if you count their in-house financing)...a revenue stream that is tied to an expensive and volatile consumer good. When rates were low, there was a lack of inventory because of 'supply chains', and everything was green all the time...they thrived. Things slow down, people become more skitish, rates are higher....well, the inverse happens.\n\nI dont think its going to crash and burn, but i don't see it as a crazy growth stock unless customer sentiment and rates change significantly.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxeskn/",
              "created": 1723033266,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgx0dr0",
              "score": 33,
              "body": "I think the cost is very high for them. They need a lot of clients to go around.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx0dr0/",
              "created": 1723025846,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgw8pyu",
          "score": 124,
          "body": "The company is cooked, for sure. It will fall like a house of cards.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw8pyu/",
          "created": 1723008296,
          "depth": 1,
          "replies": [
            {
              "id": "lgwb86a",
              "score": 113,
              "body": "House of cars",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwb86a/",
              "created": 1723009738,
              "depth": 2,
              "replies": [
                {
                  "id": "lgwcxyo",
                  "score": 47,
                  "body": "Vending machine of cars",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwcxyo/",
                  "created": 1723010750,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lgwfhaa",
              "score": 19,
              "body": "unfortunately only after many burn themselves buying puts…",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwfhaa/",
              "created": 1723012304,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgx3td8",
              "score": 3,
              "body": "Seems to be running",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx3td8/",
              "created": 1723027843,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgwcwuv",
          "score": 28,
          "body": "My dumbass actually tried to buy a car from them recently, worst car buying experience. Long story but I’m not even keeping the car. I’m pissed (cuz I need a car) and they’re losing hundreds of dollars for delivering it, filling it with gas, and coming back to pick it up lol",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwcwuv/",
          "created": 1723010733,
          "depth": 1,
          "replies": [
            {
              "id": "lgy7mse",
              "score": 10,
              "body": "I've never bought through them, but i did sell my car to them and holy crap it was the most seamless, simple, and efficient way I have ever sold a car. Plus, they offered me a wayyyyyy better deal than the dealership would have (I was upgrading to a better car). They gave me like $3k more than the dealership offered me which was amazing. The process was incredibly smooth and I would 100% recommend selling a car to them again. However, no idea what the buying process is like.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgy7mse/",
              "created": 1723043488,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgwe40y",
          "score": 10,
          "body": "Damn.  I entered the comment section to comment on Carvana.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwe40y/",
          "created": 1723011459,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgworvc",
      "score": 129,
      "body": "I’m just in here hoping people are not talking about things I own. 😂",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgworvc/",
      "created": 1723018300,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgw4hb2",
      "score": 330,
      "body": "Basically any Chinese stock. Not until sentiment around China changes, it's a losing game regardless of growth potential and actuals of companies.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw4hb2/",
      "created": 1723006022,
      "depth": 0,
      "replies": [
        {
          "id": "lgwdm1z",
          "score": 50,
          "body": "You can’t actually own Chinese stock, so… never would be the prudent answer",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwdm1z/",
          "created": 1723011155,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgy0lf4",
          "score": 8,
          "body": "That's the key point: sentiment. China isn't even doing that bad but the perception is bigger than reality.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgy0lf4/",
          "created": 1723041236,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgw1wg9",
      "score": 909,
      "body": "Anything china",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw1wg9/",
      "created": 1723004729,
      "depth": 0,
      "replies": [
        {
          "id": "lgwitit",
          "score": 102,
          "body": "Anything that grows large in China is beholden to the Chinese government and the CCP. Would you invest in the CCP? I wouldn't.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwitit/",
          "created": 1723014399,
          "depth": 1,
          "replies": [
            {
              "id": "lgwti4l",
              "score": 41,
              "body": "Yeah, heard from a Chinese man that the biggest goal over there is to do an IPO, because once it's properly gone public it's then owned by the CCP and they no longer control it. Not that it's a small task to do so lol.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwti4l/",
              "created": 1723021411,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgz33lw",
              "score": 3,
              "body": "Chinese companies at the moment ain’t doing great in manufacturing but their tech industry is growing well.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgz33lw/",
              "created": 1723053109,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgw7cc8",
          "score": 105,
          "body": "Agreed.. buying in the US you don't even actually own the company legally or have shareholder rights, you gets some crumby certificate that if push comes to shove is worthless lol",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw7cc8/",
          "created": 1723007536,
          "depth": 1,
          "replies": [
            {
              "id": "lgwknqc",
              "score": 55,
              "body": "That is actually the least worrying part of it. \nEven with real shares, if the chinese government decided that they now own the company or the business model is now illegal or whatever (which did happen in the past), those „real“ shares would be just as worthless as any certificate.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwknqc/",
              "created": 1723015571,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgw9add",
          "score": 26,
          "body": "Agreed Alibaba",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw9add/",
          "created": 1723008617,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgweyj2",
          "score": 41,
          "body": "Agreed. I’m 80% down on NIO. 20k down",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgweyj2/",
          "created": 1723011977,
          "depth": 1,
          "replies": [
            {
              "id": "lgy4l3u",
              "score": 6,
              "body": "People still talk about Nio? That shit was like GameStop times",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgy4l3u/",
              "created": 1723042520,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgyqsm7",
          "score": 5,
          "body": "Most of these reasons below are wrong. Fundamentally the Chinese stock market is used to raise money, the only ones that are benefitting are the stock seller and the company. The stock market’s role is not to create value for the shareholder. That’s why most companies IPO pump and dip out. Avoid hyped Chinese companies at all cost pretty much. \nWestern markets are pretty much create value for the shareholder at all cost. CCP is not a very big factor as to why Chinese avoid China stocks as well. Contrary to western opinion the control and seizing is almost non-existant. Of course there are exceptions as well. What's even worse if that most people have no idea what's going in the Chinese market: intense competition = low profit = low shareholder return. But it is the largest and most open market, where if a company can survive there, it can survive anywhere.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgyqsm7/",
          "created": 1723049392,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgwdr0e",
          "score": 13,
          "body": "I’m not gonna lie I do play FXI large cap China etf.. and PGJ.. i wouldn’t pick individual stocks. I do day trade them though.  China is gonna realize they need a stock market with foreign investments, free money funding your companies. It’s worth a shot buying large cap etf imo.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwdr0e/",
          "created": 1723011239,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgwhz2r",
          "score": 10,
          "body": "Yep and India too.\nWant to invest in so much green energy from corps over there. But something feels “cooked” to me",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwhz2r/",
          "created": 1723013871,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgw0xv1",
      "score": 422,
      "body": "Anything that Jim Cramer mentions.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw0xv1/",
      "created": 1723004263,
      "depth": 0,
      "replies": [
        {
          "id": "lgw54l4",
          "score": 213,
          "body": "Anything Cathy woods is in.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw54l4/",
          "created": 1723006358,
          "depth": 1,
          "replies": [
            {
              "id": "lgw7ns2",
              "score": 67,
              "body": "I was looking at her returns today. She could have taken those billions and put it in a CD or money market fund and she would do better. How this woman gets so much publicity and does so poorly is beyond me.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw7ns2/",
              "created": 1723007704,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgw5zrn",
              "score": 67,
              "body": "And buy anything she sells. LOL",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw5zrn/",
              "created": 1723006810,
              "depth": 2,
              "replies": [
                {
                  "id": "lgwosb3",
                  "score": 18,
                  "body": "The inverse Cathie Woods investment strategy.",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwosb3/",
                  "created": 1723018308,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgwa0qd",
          "score": 49,
          "body": "Such as Nvidia. He was the loudest proponent of the company since 2017 when no one was buying it. Was long Chipotle when everyone sold due to their pork problems.\n\nHis Nvidia call easily eliminated ANY bad calls, lol.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwa0qd/",
          "created": 1723009041,
          "depth": 1,
          "replies": [
            {
              "id": "lgwdpqi",
              "score": 51,
              "body": "Cramer has got a lot of important calls right as well. Here are some of his big winners cost basis / current price.\n\n* Lily: $257 / $793\n* Apple: $20 / $207\n* Nvidia: $14 / $104\n* Meta: $190 / $494",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwdpqi/",
              "created": 1723011218,
              "depth": 2,
              "replies": [
                {
                  "id": "lgx71rs",
                  "score": 20,
                  "body": "Now compare that to all the losers he called. You can´t cherry-pick like that.",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx71rs/",
                  "created": 1723029641,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgyaapu",
                      "score": 15,
                      "body": "The wins easily beat the losses, lol. Dogmatic comment. The Nvidia alone beats most or all his wrong calls. Also, any investor, even Cramer, says, \"DO YOUR HOMEWORK!. \n\nI like Cramer, but I now listen more for the jargon, just like The Compound and Friends. There are times He simplifies some aspects of the market.",
                      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgyaapu/",
                      "created": 1723044320,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lgw1t3h",
          "score": 57,
          "body": "Cramer called Nvidia years ago",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw1t3h/",
          "created": 1723004683,
          "depth": 1,
          "replies": [
            {
              "id": "lgwa6fs",
              "score": 59,
              "body": "People love to ignore this. Dude was so convinced of the stock and company that he named his dog after the company",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwa6fs/",
              "created": 1723009131,
              "depth": 2,
              "replies": [
                {
                  "id": "lgwf6v7",
                  "score": 19,
                  "body": "I guess even a broken clock … and so on ;)",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwf6v7/",
                  "created": 1723012122,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgxbx8j",
                      "score": 9,
                      "body": "yeah with the little difference here is that sometimes being right once is enough. Believing in nvidia years ago would have net you so much profit to trample all the bad decisions you might have made in the markets. \n\nIf you are not an absolute degen you need only a couple winners, and a broken clock might not be bad.",
                      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxbx8j/",
                      "created": 1723032009,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lgxi4fv",
              "score": 6,
              "body": "Cramer is an example of how if you make enough predictions you'll inevitably look both really good and really bad in hindsight to anyone cherry picking stats.\n\nThe problem with Cramer's job though is that he has to talk about so many different stocks that he can't possibly have had enough time to do a proper deep dive and due diligence into it. Hence of course he'll get a bunch of things wrong. But since the market moves up overtime he'll get a bunch of things right to.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxi4fv/",
              "created": 1723034650,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgw3v9m",
              "score": 18,
              "body": "And pushed Bed Bath and Beyond until one day he magical reversed course and started ranting about it.  \n\nThat's the only time I've seen him reverse course and mean it for the right reasons.  But for far too long he was pro- BBBY when it was a troubled company",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw3v9m/",
              "created": 1723005711,
              "depth": 2,
              "replies": [
                {
                  "id": "lgxl7wl",
                  "score": 4,
                  "body": "he magically turned course on it once his hedge buddy Tritton was gone. Literally the day he was fired he turned bearish",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxl7wl/",
                  "created": 1723035870,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgw1plv",
          "score": 42,
          "body": "I heard he mentioned your mom!",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw1plv/",
          "created": 1723004635,
          "depth": 1,
          "replies": [
            {
              "id": "lgw95os",
              "score": 10,
              "body": "It's true. Jim and I are Eskimo bros",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw95os/",
              "created": 1723008544,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgxifxk",
      "score": 29,
      "body": "Disney. I don't know how they can manage to have such a dominant position in entertainment and yet make no effing money. ESPN and Disney + are so poorly run its mind boggling. If you take out their COVID bump, the stock has managed to remain flat over the last 10 years and they're still trading at almost a 100 P/E.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxifxk/",
      "created": 1723034780,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgw2rts",
      "score": 218,
      "body": "BA\n\n“That worker told the NTSB that his team was “put in uncharted waters to where… we were replacing doors like we were replacing our underwear.”\n\n“The planes come in jacked up every day. Every day,” the second worker added. - 2 Boeing employees",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw2rts/",
      "created": 1723005159,
      "depth": 0,
      "replies": [
        {
          "id": "lgwdhdi",
          "score": 51,
          "body": "After the max 8 crashes I shorted BA expecting them to get lawsuits and higher cost to cover the quality control requirements that were mandated by the government save. Instead they refused the government's help, which has strings attached to keep the planes safe. They chose to raise money from investors, which had no strings attached. My short position was unprofitable and I covered the losses. In hindsight I should have just waited a few more years",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwdhdi/",
          "created": 1723011076,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgwiqd1",
          "score": 35,
          "body": "Held this turd for years. Useless.\n\nI thought this was a behemoth of civil aviation and the military industrial complex. Not a broken company.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwiqd1/",
          "created": 1723014343,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgw9j2p",
          "score": 30,
          "body": "Correct me if I am wrong, but Boeing is 100+ years old company and the country’s largest exporter, with the backing of the US government. The only real competition is from Airbus which is subsidized by EU. It has its problems now but that’s an anomaly not the norm. The government/FAA will keep wrist slapping Boeing but eventually it will go back to the good old days. I would say if your if horizon is more than 10 years it’s a good buy now.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw9j2p/",
          "created": 1723008757,
          "depth": 1,
          "replies": [
            {
              "id": "lgwd8rn",
              "score": 23,
              "body": "They won’t be anywhere close to “the good old days” until they have engineers leading the company again. And not these dumbass financial/business bros that don’t even know what lift is…",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwd8rn/",
              "created": 1723010931,
              "depth": 2,
              "replies": [
                {
                  "id": "lgwdip3",
                  "score": 15,
                  "body": "BA just got an engineer as CEO.",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwdip3/",
                  "created": 1723011099,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgwpiew",
                      "score": 8,
                      "body": "Yes, but it will take years to undo what the mba did.",
                      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwpiew/",
                      "created": 1723018787,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lgwd1vi",
              "score": 10,
              "body": "Also worth noting that Robert Ortberg is succeeding Dave Calhoun on the 8th and seems to have the competency and plan to improve Boeing over the next 4 to 5 years.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwd1vi/",
              "created": 1723010815,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgwb5y8",
              "score": 36,
              "body": "Boeing has a 10+ year order book priced at pre-inflation prices. All the sub-tier suppliers are increasing prices as contracts are renegotiated and Boeing has little options to setup new suppliers as some of these components have a 18 month lead time. If a new supplier fails it takes ages to recover. They are gonna be bleeding for a long long time. Also the stock price is heavily impacted by the news cycle. One incident and it plummets, I don't touch any airline or aircraft manufacturer for that reason.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwb5y8/",
              "created": 1723009703,
              "depth": 2,
              "replies": [
                {
                  "id": "lgwdw84",
                  "score": 24,
                  "body": "Boeing orders are escalated to an index tracking inflation, some above and some below. They are generally protected from inflation.",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwdw84/",
                  "created": 1723011328,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lgwa93v",
              "score": 20,
              "body": "You ever notice some of these too big to fail companies purposely fail to get that government money ",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwa93v/",
              "created": 1723009174,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgwuhk6",
      "score": 67,
      "body": "Anything that has had poor/lackluster returns for 5+ years. Half a decade is too long to be going in the wrong direction. At very best, any sort of turnaround is a \"show me story\" rather than automatically being a believer. \n\nAnything that has subpar management with a history of disappointing shareholders. There are companies that have underperformed in large part because of the choices of management and then people go, \"but what if they (random thing that could be done to improve)?\" If the company is where it is because the core business has not been run well, why am I confident that they'll do this well? Replacing management in/of itself isn't necessarily the answer, either - GE eventually turned things around under Culp but he wasn't the first CEO chosen to replace Immelt - initially they had someone who had been at GE for ages and with him at the helm the stock just continued South. \n\nAny industries that simply have proven themselves to be consistently underwhelming investments over time - pure play media (WBD, PARA) is an example. Or, similarly, industries where the fundamentals may have been fine at one point but have clearly turned into a melting ice cube (CVS/WBA, particularly the latter which really has no path to return to growth that I can see.)\n\nAnything that requires government to do something (build infrastructure, subsidies, etc) to be a business that can sustain itself.\n\nGenerally anything where something is the \"cheaper\" option but it's clear that it's the cheaper option for a reason vs peers that are more expensive because they are actually well-run businesses that deliver for shareholders.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwuhk6/",
      "created": 1723022065,
      "depth": 0,
      "replies": [
        {
          "id": "lgzhx2g",
          "score": 10,
          "body": "You are going to miss a lot of really good stocks doing this.  MSFT flatlined for a decade under Ballmer, AMD was cheaper in 2015 than it was when it went public in the 80s, Apple flatlined from the 90s to early 00s",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgzhx2g/",
          "created": 1723057623,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgxqk7g",
      "score": 76,
      "body": "Nestlé because fuck Nestlé.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxqk7g/",
      "created": 1723037841,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgw2tk8",
      "score": 207,
      "body": "People are mentioning Boeing, Reddit, and Intel, when there are so many companies that are worse than these.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw2tk8/",
      "created": 1723005183,
      "depth": 0,
      "replies": [
        {
          "id": "lgw96q7",
          "score": 285,
          "body": "I mean, buying Intel today is like buying an old house in Italy for 1€. You enter and you think, well it’s not bad, it has potential to recover, what can go wrong? One week after you discover it’s haunted by the ghost of a crazy nonna.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw96q7/",
          "created": 1723008560,
          "depth": 1,
          "replies": [
            {
              "id": "lgwatku",
              "score": 111,
              "body": "But nonnas ectoplasm cannolis do slap hard",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwatku/",
              "created": 1723009504,
              "depth": 2,
              "replies": [
                {
                  "id": "lgwek38",
                  "score": 36,
                  "body": "Let's not forget the penchant the Romans had for l'occhio marrone che si contrae or \"fun around the bum\" be it female, man, or goat. To have an ectoplasm tongue in the butchers pocket, a cheekily positioned salsiccia pounding away like a steam engine that'd have isambard kingdom brunel himself in awe of the rhythmic power, or even the drawn out sting of a long, curving yellowed fingernail dragged across the prostate, leaving Mario here a crumpled heaving mess on the floor.",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwek38/",
                  "created": 1723011730,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lgwn1ao",
                      "score": 29,
                      "body": "What a fantastic day to have eyes",
                      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwn1ao/",
                      "created": 1723017151,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lgxbhs1",
              "score": 22,
              "body": "Plot twist: it’s the nonna who left her degenerate grandson a 700k inheritance.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxbhs1/",
              "created": 1723031815,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgw56ap",
          "score": 68,
          "body": "Buying intel tomorrow after reading this topic here.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw56ap/",
          "created": 1723006383,
          "depth": 1,
          "replies": [
            {
              "id": "lgw9jmr",
              "score": 56,
              "body": "You have to wait for your grandma to die first.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw9jmr/",
              "created": 1723008766,
              "depth": 2,
              "replies": [
                {
                  "id": "lgwbern",
                  "score": 41,
                  "body": "Make sure she gives you 800k so you can waste 700k into Intel pre earnings",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwbern/",
                  "created": 1723009845,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lgx1h7w",
          "score": 15,
          "body": "I think reddit has a lot of potential, although their monetization sucks.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx1h7w/",
          "created": 1723026502,
          "depth": 1,
          "replies": [
            {
              "id": "lgz2pqc",
              "score": 9,
              "body": "Reddit having bad monetization is part of their potential.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgz2pqc/",
              "created": 1723052993,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgwq0vb",
          "score": 20,
          "body": "And yet when it came time for you to contribute you literally give the same 3 names and nothing else",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwq0vb/",
          "created": 1723019124,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgy0x2d",
          "score": 9,
          "body": "Redditors hear one thing then keep posting it so other people who heard that one thing can upvote. Echo chamber. \n\nYou can debate over Intel but to act like its a \"do not touch\" shows how knowledgable some on here are.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgy0x2d/",
          "created": 1723041342,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgwj1kr",
          "score": 5,
          "body": "That’s because it’s reddit and people believe they are certified financial advisors",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwj1kr/",
          "created": 1723014539,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgw32ia",
      "score": 575,
      "body": "Tesla",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw32ia/",
      "created": 1723005307,
      "depth": 0,
      "replies": [
        {
          "id": "lgwe9ck",
          "score": 141,
          "body": "Agreed, Musk keep overpromising  and under delivering. The company is still priced on promises which likely wont come true.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwe9ck/",
          "created": 1723011550,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgx3nik",
          "score": 31,
          "body": "I actually don't even want to hold etfs that have exposure to Tesla.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx3nik/",
          "created": 1723027752,
          "depth": 1,
          "replies": [
            {
              "id": "lgyeewj",
              "score": 9,
              "body": "Not easy",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgyeewj/",
              "created": 1723045599,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgwdsy8",
          "score": 14,
          "body": "I agree",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwdsy8/",
          "created": 1723011272,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgwe89o",
      "score": 45,
      "body": "Nikola…Peloton",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwe89o/",
      "created": 1723011531,
      "depth": 0,
      "replies": [
        {
          "id": "lh3t155",
          "score": 3,
          "body": "I can't believe that Nikola has somehow not gone bankrupt yet despite it being nothing but fraud, and investing in a failed technology that will never catch on due to all of it's obvious disadvantages (hydrogen vehicles).",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lh3t155/",
          "created": 1723124197,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgx772y",
      "score": 30,
      "body": "Literally any company I've never heard of until I saw it on this subreddit. My biggest losses in my life has been from following the crowd on shit like SENS and ARK. Luckily most of my money has been parked in more sensible things.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx772y/",
      "created": 1723029722,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgww3k6",
      "score": 12,
      "body": "Chinese ones. Never again since 2015.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgww3k6/",
      "created": 1723023135,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgzv8gv",
      "score": 13,
      "body": "Why is everyone listing my portfolio?",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgzv8gv/",
      "created": 1723061698,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgw7tza",
      "score": 64,
      "body": "Aurora cannabis, pretty much anything Marijuana related for now but that one extra far....",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw7tza/",
      "created": 1723007800,
      "depth": 0,
      "replies": [
        {
          "id": "lgybe7k",
          "score": 13,
          "body": "The weed game has gotten concentrated enough that the only people making big money are the dispensaries themselves.  Price per LB has tanked over the last few years, at least where I am at.  Like 3k --> less than 1K.  I don't see any of them rebounding without some of the big players consolidating.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgybe7k/",
          "created": 1723044662,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgwq8oq",
      "score": 11,
      "body": "BYND. I dont think normal, meat eating people will start eating vegan food regularly and they seem to think they can change peoples opinions on that.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwq8oq/",
      "created": 1723019269,
      "depth": 0,
      "replies": [
        {
          "id": "lgxnrcl",
          "score": 8,
          "body": "absolutely especially when it's not even healthier, if it was actually good for you i would eat it",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxnrcl/",
          "created": 1723036819,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgw3fn2",
      "score": 263,
      "body": "DJT\n\nExplanation not needed",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw3fn2/",
      "created": 1723005491,
      "depth": 0,
      "replies": [
        {
          "id": "lgw9ltj",
          "score": 108,
          "body": "Best company ever. Like I think it may be the greatest company on the face of the planet. I couldn't think of Any company better in the history of the world.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw9ltj/",
          "created": 1723008801,
          "depth": 1,
          "replies": [
            {
              "id": "lgwd5bk",
              "score": 77,
              "body": "Everybody says, and I know a lot of people, they say, Donald, it's the best company, the greatest company, I've never seen another company like that company.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwd5bk/",
              "created": 1723010874,
              "depth": 2,
              "replies": [
                {
                  "id": "lgyig2g",
                  "score": 6,
                  "body": "*\"the likes of which the world has never seen\". (Chapter 37)",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgyig2g/",
                  "created": 1723046835,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lgwayi1",
              "score": 14,
              "body": "“Frankly”",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwayi1/",
              "created": 1723009583,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgwd3fx",
              "score": 10,
              "body": "That's what a lot of people tell me",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwd3fx/",
              "created": 1723010842,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lh1culd",
              "score": 3,
              "body": "Well that’s what they tell me. A lot of people have told me that it’s the greatest company in the history of the world. They’re great people that told me that. The best investors in the world tell me it’s the greatest company.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lh1culd/",
              "created": 1723080054,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgwaeo7",
      "score": 91,
      "body": "Tesla. Learn how to do a DCF and then realize what sort of whackadoodle assumptions you need for the valuation to make any sense…",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwaeo7/",
      "created": 1723009263,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgx38te",
      "score": 20,
      "body": "Anything from China. You have every disadvantage it is possible to have, and fundamentals won't matter because you'll never get nearly as a reward for the risks you take as you would with US stocks\n\nOne example of your immediate disadvantage: You're probably not a Chinese person living in China's economy using Chinese products. You don't know sh*t about these companies other than what the fundamentals tell you and whatever other secondhand info you can acquire",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx38te/",
      "created": 1723027525,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwy2df",
      "score": 17,
      "body": "I avoid China.   There is just too much risk.  I am fine with Taiwan though and love TSM.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwy2df/",
      "created": 1723024410,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgw415j",
      "score": 113,
      "body": "There's a hilarious subreddit where they talk each other into buying the **most shorted** stocks on the market. \n\nThat's right. The ones short sellers are most heavily betting **against**. I remember this one time they were all excited about this company that sells orthodontic care out the back of a van. \n\nThey're called shortsqueeze if I recall. I pop in there every once in awhile. Anyway - whatever stocks they're talking about there.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw415j/",
      "created": 1723005795,
      "depth": 0,
      "replies": [
        {
          "id": "lgw5mst",
          "score": 102,
          "body": "Are you sure you’re not talking about wallstreetbets",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw5mst/",
          "created": 1723006621,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgwcpm6",
          "score": 30,
          "body": "Black berry is busting my balls, holding these bags hard",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwcpm6/",
          "created": 1723010613,
          "depth": 1,
          "replies": [
            {
              "id": "lgy901u",
              "score": 3,
              "body": "What's your avg?",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgy901u/",
              "created": 1723043917,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lgw5fro",
          "score": 51,
          "body": "It's not that stupid an idea. It's a massive gamble to be sure, but they're betting on short squeezes. If they pay out, they pay out big, which can mean positive EV (and therefore a smart trade)\n\nI mean, GME in 2021 was a no-brainer with >100% short interest (and was the one that brought short squeezes into the mainstream). I only wish I had bought more",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw5fro/",
          "created": 1723006517,
          "depth": 1,
          "replies": [
            {
              "id": "lgwew5g",
              "score": 22,
              "body": "For real people talk smack but anyone paying attention did well on meme stocks.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwew5g/",
              "created": 1723011937,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgwajwg",
      "score": 60,
      "body": "So the most hated stock here is Intel, thank you guys I am buying more tomorrow, you know, inverse reddit.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwajwg/",
      "created": 1723009347,
      "depth": 0,
      "replies": [
        {
          "id": "lgzqt4i",
          "score": 8,
          "body": "intel guy bought right before the stock market went into a crash he caused the market crash",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgzqt4i/",
          "created": 1723060345,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgxnonb",
          "score": 3,
          "body": "Meemaw does not approve.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxnonb/",
          "created": 1723036793,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgw4vq2",
      "score": 21,
      "body": "Buzzfeed",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw4vq2/",
      "created": 1723006231,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwa9e8",
      "score": 22,
      "body": "Blackberry. PoS barely has any momentum even during a meme stock rally and only ever gets faded.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwa9e8/",
      "created": 1723009179,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwa7nn",
      "score": 13,
      "body": "China and nestle",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwa7nn/",
      "created": 1723009151,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwi0mr",
      "score": 8,
      "body": "MCD - Out of touch executives are bean counting their way into low sales",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwi0mr/",
      "created": 1723013898,
      "depth": 0,
      "replies": [
        {
          "id": "lgx3e47",
          "score": 5,
          "body": "Oooooo betting against American obesity…. That’s bold my friend.  ",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx3e47/",
          "created": 1723027607,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgwmcjv",
      "score": 7,
      "body": "Peleton :/",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwmcjv/",
      "created": 1723016694,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwhczi",
      "score": 27,
      "body": "Intel, never again.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwhczi/",
      "created": 1723013486,
      "depth": 0,
      "replies": [
        {
          "id": "lgwzkki",
          "score": 12,
          "body": "I started buying stocks in the last 2 years and bought $2500 of Intel. Gonna hold it to remind myself that big companies can suddenly tank.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwzkki/",
          "created": 1723025352,
          "depth": 1,
          "replies": [
            {
              "id": "lgxtlro",
              "score": 6,
              "body": "I thought \"How could a once-dominant company with a near monopoly on US-based production now given billions of tax dollars fail?\"\n\nWell, I guess it's possible!",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxtlro/",
              "created": 1723038899,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lgwzpf8",
              "score": 8,
              "body": "I sold 200 shares last week, was a bag holder for a long-time and truly was looking at the big picture but they just have incompetent Leadership.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwzpf8/",
              "created": 1723025436,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgy7f10",
      "score": 6,
      "body": "Anybody still holding crowdstrike or just me?",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgy7f10/",
      "created": 1723043420,
      "depth": 0,
      "replies": [
        {
          "id": "lh0pd8s",
          "score": 6,
          "body": "I do, and so does Pelosi. Unfortunately, alternatives like SentinelOne and Palo Alto are even buggier than CrowdStrike. CrowdStrike is still the best US-based EDR.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lh0pd8s/",
          "created": 1723071478,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgw73qm",
      "score": 21,
      "body": "Airlines, wireless carriers, and Intel",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw73qm/",
      "created": 1723007404,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgw9ha9",
      "score": 25,
      "body": "Air bnb",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw9ha9/",
      "created": 1723008727,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwuxg1",
      "score": 6,
      "body": "Airlines. All airlines. Th nindustry had been destroying shareholder value for a century.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwuxg1/",
      "created": 1723022358,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgxktpo",
      "score": 6,
      "body": "Airlines, retail, restaurants, or any Chinese equities",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxktpo/",
      "created": 1723035715,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgw6x99",
      "score": 25,
      "body": "Intel and Tesla.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw6x99/",
      "created": 1723007306,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgxnmzt",
      "score": 17,
      "body": "Tesla. I will not give any money to Elon Musk",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxnmzt/",
      "created": 1723036776,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgw40dp",
      "score": 31,
      "body": "Anything Reddit mentions, whether good or bad",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw40dp/",
      "created": 1723005784,
      "depth": 0,
      "replies": [
        {
          "id": "lgwid3n",
          "score": 12,
          "body": "The subreddit for nvdia stock is ridiculous. I’m not subscribed yet it always pops up. The stupidity in there makes me want it to drop to 50.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwid3n/",
          "created": 1723014109,
          "depth": 1,
          "replies": [
            {
              "id": "lgxc2h4",
              "score": 9,
              "body": "It's because they have no idea what they're doing and other people on there (who I'm now convinced are on NVDA's payroll) we're like \"don't sell at $140 just keep buying because it'll go up forever! And don't pay attention to the P/E ratio in the corner who is also cashing in all your money!\". \n\nMeanwhile I'm sitting there selling my position in June and putting my money to work somewhere else until it fair values out. To be fair my basis was around $100.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxc2h4/",
              "created": 1723032075,
              "depth": 2,
              "replies": [
                {
                  "id": "lgy98yx",
                  "score": 5,
                  "body": "Honestly, since the fed doubled the money supply stocks have had nothing to do with proper valuation. 100 is a good basis",
                  "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgy98yx/",
                  "created": 1723043995,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgw4lrr",
      "score": 5,
      "body": "The Parent Company aka Gold Flora aka gram",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw4lrr/",
      "created": 1723006086,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwiv8b",
      "score": 4,
      "body": "Anything that does not make money, does not grow and has a high debt/cash ratio",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwiv8b/",
      "created": 1723014428,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwvhsl",
      "score": 4,
      "body": "I won't touch any company where the CEO has \"founder's shares\" or isn't accountable to the board for some other reason.\n\n  \nThat kind of ego-driven absolutism can deliver short-term results, or even decades of success, but has zero protection from a meltdown. (And I've seen many such meltdowns first-hand, it isn't pretty.)\n\n  \nThis covers a bunch of mid-sized tech companies, but also a surprising number of pharma and building/real-estate companies.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwvhsl/",
      "created": 1723022732,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgw12ir",
      "score": 46,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw12ir/",
      "created": 1723004325,
      "depth": 0,
      "replies": [
        {
          "id": "lgw86oh",
          "score": 26,
          "body": "Comments like this that get upvoted are a reminder that 95% of this sub doesn't do any actual analysis or even read earnings reports, they just base their opinion of companies on their own biases, even if those biases have nothing to do with the business itself.\n\n\nAt the risk of sounding like an old man shouting at the clouds, I remember a time before the event related to \"that stock\" when this sub was a gold mine. Miss those days.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw86oh/",
          "created": 1723007998,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgw1gyd",
      "score": 20,
      "body": "boeing intel",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw1gyd/",
      "created": 1723004519,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwo09g",
      "score": 10,
      "body": "Tesla. IDK what the fuck people see in that stock, it hasn't even been close to peak since 2021 and we've had the most bullish market globally ever",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwo09g/",
      "created": 1723017796,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwo0r3",
      "score": 10,
      "body": "Tesla, overvalued car company on promises",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwo0r3/",
      "created": 1723017804,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwnbhw",
      "score": 5,
      "body": "Chipotle",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwnbhw/",
      "created": 1723017338,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwnrb0",
      "score": 6,
      "body": "Electric car stocks apparently, after my past history investing there.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwnrb0/",
      "created": 1723017631,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgx3ajk",
      "score": 5,
      "body": "Anything owned by Elon. I am not betting against him ever, but he is too much of a wildcard to ever put my money with him again. I did trade TSLA several years back for a bit, but even before the weirdo shit I just felt the valuation of it was far too tied to the personality.\n\nNow that he is doing whatever he is doing - no way. I mean, the man takes a business whose main income is advertising and publicly tells advertisers to fuck off? oooook.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx3ajk/",
      "created": 1723027552,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgx3u1y",
      "score": 7,
      "body": "DJT",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx3u1y/",
      "created": 1723027854,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgxi223",
      "score": 6,
      "body": "Disney",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxi223/",
      "created": 1723034624,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwddjt",
      "score": 19,
      "body": "Really don't understand the excitement for\tPLTR.\n\nI consider them a old fashioned company with no clear business case.\n\nKinda SAP for government jobs.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwddjt/",
      "created": 1723011012,
      "depth": 0,
      "replies": [
        {
          "id": "lgwo4j3",
          "score": 5,
          "body": "I like the bussines, but not the p/e",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwo4j3/",
          "created": 1723017874,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lgxhq29",
          "score": 8,
          "body": "It's not the hype. It's the continual increase in revenue quarter after quarter. That's what it's about. Super bullish, every quarter gets better with more growth",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxhq29/",
          "created": 1723034488,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lh1lf3k",
          "score": 3,
          "body": "Haha stay out then",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lh1lf3k/",
          "created": 1723083315,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgw30hb",
      "score": 53,
      "body": "Disney.  They have decided agenda is more important than making money.  They spend way too much on every project and almost all of them are bombs.  How the heck do you spend $25M per episode of She Hulk and $160M on Peter and Wendy?",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw30hb/",
      "created": 1723005279,
      "depth": 0,
      "replies": [
        {
          "id": "lgw6z6d",
          "score": 35,
          "body": "I second this, won't touch Disney until they have a massive clear out of activist producers and executives.",
          "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw6z6d/",
          "created": 1723007334,
          "depth": 1,
          "replies": [
            {
              "id": "lgxz81a",
              "score": 11,
              "body": "Thank you.  People here still refuse to believe Disney went political although it is out in the open in all their public statements.  It's crazy how many people can be fooled.",
              "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxz81a/",
              "created": 1723040787,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lgw45w3",
      "score": 3,
      "body": "I'm adding FSLR to my list, horrible spreads and basically no volume",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgw45w3/",
      "created": 1723005860,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwcmet",
      "score": 3,
      "body": "Chinese VIE (shell companies) and Tobacco, also everything related to mariuana",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwcmet/",
      "created": 1723010560,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwfdck",
      "score": 3,
      "body": "All airlines, all china stocks",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwfdck/",
      "created": 1723012233,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwfwx0",
      "score": 3,
      "body": "Anything Chinese",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwfwx0/",
      "created": 1723012574,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwgz78",
      "score": 3,
      "body": "Ford",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwgz78/",
      "created": 1723013245,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwj9bo",
      "score": 3,
      "body": "Twillio. Not because they are poorly run or anything. But they are a 9.5 billion dollar company whose sole product is APIs for SMS, voice, and email based communication/authentication. How long until their entire company becomes a feature of AWS or any other major cloud provider?",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwj9bo/",
      "created": 1723014674,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwt3nz",
      "score": 3,
      "body": "China... Lost a lot of money bc the government thought some companies should not criticize them...\n\nLike tencent, alibaba etc.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwt3nz/",
      "created": 1723021146,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgwzuug",
      "score": 3,
      "body": "Temu, Alibaba, Shein, Nestle if I can avoid it, Intel is a new one for me and Boeing for sure. \nAnd companies that annoy me with invasive ads online.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgwzuug/",
      "created": 1723025529,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgx3vt1",
      "score": 3,
      "body": "Stuck in PTON",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx3vt1/",
      "created": 1723027880,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgx5wp6",
      "score": 3,
      "body": "SNAP",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx5wp6/",
      "created": 1723029008,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgx7p2a",
      "score": 3,
      "body": "Autonymous Driving - I don't care if the space advances or not, and obviously Elon is a pain in the ass.\n\nBiotech - They all say they're going to make great advancements. Some of them will. Most of them won't.\n\nRecreational Drugs (ie weed) - Stupidly oversaturated and that's only going to get worse.\n\nCryptocurrency - I'm sick of it. Find a real use case for the average person that isn't just \"generating a fiat profit\", or fuck off already.\n\nKids Entertainment - I don't agree with minors being used for entertainment, across the board. I literally mean I don't believe kids should be in entertainment, period. No movies, no TV, no music, no streaming, no influencing, nothing. Personal principle.\n\nCell Carriers - Impossible to predict what's next for the tech, and the major companies all seem incompetent. AT&T for example can't go 3 fucking days without a huge data breach.\n\nSocial Media - Reddit is the only site I use, and I generally consider social media a giant threat to public health. I don't think it will ever be treated that way within my lifetime, but initial research on mental impact suggests it's all getting shut down next generation or the one after. I just don't want involved.",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgx7p2a/",
      "created": 1723029992,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgxfgcq",
      "score": 3,
      "body": "I’m just investing in pumpkins for the next couple months",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgxfgcq/",
      "created": 1723033546,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgy63kg",
      "score": 3,
      "body": "Probably an unpopular opinion, but almost any tech stock outside of the Mag7. Not interested in the rollercoaster that comes with the sector",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgy63kg/",
      "created": 1723043002,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgz4xr2",
      "score": 3,
      "body": "Disney",
      "permalink": "/r/stocks/comments/1em2jih/what_companies_are_on_your_do_not_touch_list/lgz4xr2/",
      "created": 1723053661,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "The post discusses Intel and Boeing as companies that are poorly run and should be avoided.",
    "companies": [
      "Intel",
      "Boeing"
    ],
    "tickers": [
      "INTC",
      "BA"
    ],
    "main_ticker": [
      "INTC"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Discussion about companies perceived as poorly run and not recommended for investment.",
    "stock_recommendations": "The user is recommending not to invest in Intel and Boeing.",
    "is_recommending_stock_buying_or_selling": true,
    "buy_or_sell": "sell",
    "sentiment_summary": "There is negative sentiment as the author advises against investing in certain companies like Intel and Boeing due to poor management.",
    "sentiment": "negative"
  }
}