{
  "title": "CVS slashes profit outlook on higher medical costs, says top Aetna exec will leave ",
  "score": 35,
  "selftext": "CVS Health on Wednesday reported second-quarter earnings that topped expectations, but slashed its full-year profit outlook, citing higher medical costs that have been squeezing the U.S. insurance industry. \n\nThe company also said Aetna President Brian Kane, the top executive at the insurance unit, will leave the company. CVS CEO Karen Lynch will take over management of the business and CFO Thomas Cowhey will also help to oversee it.\n\nThe retail drugstore chain expects 2024 adjusted earnings of $6.40 to $6.65 per share, down from a previous guidance of at least $7 per share. Analysts surveyed by LSEG were expecting full-year adjusted profit of $6.97 per share. \n\nCVS also cut its unadjusted earnings guidance to a range of $4.95 to $5.20 per share, down from at least $5.64 per share. \n\nIt marks the third consecutive quarter that the company has lowered its 2024 profit guidance. \n\nCVS said its new outlook reflects continued pressure on its health insurance segment, which is seeing increased medical costs and the “unfavorable impact” of the company’s Medicare Advantage star ratings. Those ratings help Medicare patients compare the quality of Medicare health and drug plans. \n\nCVS owns health insurer Aetna. The company’s insurance division includes plans by Aetna for the Affordable Care Act, Medicare Advantage and Medicaid, as well as dental and vision.\n\nInsurers such as UnitedHealth Group, Humana and Elevance Health have seen medical costs spike as more Medicare Advantage patients return to hospitals for procedures they delayed during the pandemic, such as joint and hip replacements. \n\nMedicare Advantage, a privately run health insurance plan contracted by the federal Medicare program, has long been a driver of growth and profits for the insurance industry. But Wall Street has become more concerned about the runaway costs associated with those plans, which cover more than half of all Medicare beneficiaries. \n\nHere’s what CVS reported for the second quarter compared with what Wall Street was expecting, based on a survey of analysts by LSEG: \n\nEarnings per share: $1.83 adjusted vs. $1.73 expected\n\nRevenue: $91.23 billion vs. $91.5 billion expected \n\nThe company posted net income of $1.77 billion, or $1.41 per share, for the second quarter. That compares with net income of $1.90 billion, or $1.48 per share, for the year-earlier period. \n\nExcluding certain items, such as amortization of intangible assets and capital losses, adjusted earnings per share were $1.83 for the quarter.\n\nCVS reported sales of $91.23 billion for the quarter, up 2.6% from the same period a year ago due to growth in its pharmacy business and insurance unit. \n\nThe company noted that sales in its health services segment, which includes its pharmacy benefit manager Caremark, declined during the second quarter. CVS cited pharmacy client price improvements and the loss of a large unnamed client.  \n\nCaremark negotiates drug discounts with manufacturers on behalf of insurance plans, along with health-care services delivered in medical clinics, through telehealth and at home.\n\nTyson Foods in January said it had dropped CVS Caremark and instead chose PBM startup Rightway to manage drug benefits for its 140,000 employees starting in 2024. Months earlier, Blue Shield of California, one of the largest insurers in the U.S.’s most populous state, also dropped Caremark to partner with Amazon Pharmacy and Mark Cuban’s Cost Plus Drugs company. \n\nThose decisions represent a larger upheaval in the health-care industry, as startups and the government work to increase transparency and lower costs for U.S. patients. \n\nPressure on insurance unit\n\nCVS’ insurance segment generated $32.48 billion in revenue during the quarter, a more than 21% increase from the second quarter of 2023.\n\nSales were in line with analysts’ estimate of $32.37 billion for the period, according to StreetAccount. \n\nBut the division reported adjusted operating income of just $938 million for the second quarter. That is below analysts’ expectation of $962 million for the period, StreetAccount said. \n\nThe insurance unit’s medical benefit ratio — a measure of total medical expenses paid relative to premiums collected — increased to 89.6% from 86.2% a year earlier. A lower ratio typically indicates that a company collected more in premiums than it paid out in benefits, resulting in higher profitability.\n\nThat ratio came in lower than the 90.1% that analysts had expected, according to StreetAccount. \n\nCVS’s health services segment generated $42.17 billion in revenue for the quarter, down nearly 9% compared with the same quarter in 2023. \n\nThose sales were above analysts’ estimate of $41.25 billion for the period, according to StreetAccount. \n\nThe health services division processed 471.2 million pharmacy claims during the quarter, down from 576.6 million during the year-ago period. \n\nCVS’ pharmacy and consumer wellness division booked $29.84 billion in sales for the first quarter, up more than 3% from the same period a year earlier. That unit dispenses prescriptions in CVS’ more than 9,000 retail pharmacies and provides other pharmacy services, such as vaccinations and diagnostic testing. \n\nAnalysts had expected the division to bring in $30.22 billion in sales, according to StreetAccount.\n\nThe rise was partly driven by increased prescription volume, CVS said. Pharmacy reimbursement pressure, the launch of new generic drugs and decreased front-store volume, among other factors, weighed on the unit’s sales. \n\nSource: https://www.cnbc.com/2024/08/07/cvs-health-cvs-earnings-q2-2024.html",
  "link_flair_text": null,
  "id": "1em8ypi",
  "num_comments": 20,
  "created_utc": 1723028834,
  "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/",
  "comments": [
    {
      "id": "lgxjzz2",
      "score": 15,
      "body": "I’ll keep saying it every quarter. CVS is a terrible company. They probably won’t go away anytime soon because they are so huge, but I think they will continually decline indefinitely.",
      "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/lgxjzz2/",
      "created": 1723035395,
      "depth": 0,
      "replies": [
        {
          "id": "lh1a4z1",
          "score": 6,
          "body": "PE ratio of 10.2 and dividend yield of 4.5%.. I’ll gladly continue to buy shares",
          "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/lh1a4z1/",
          "created": 1723079043,
          "depth": 1,
          "replies": [
            {
              "id": "lh1ckqu",
              "score": 5,
              "body": "lol.\n\n\n\nDeclining revenue. \n\n\nGross margins at lowest point in over 20 years (looked back every quarter to 2003 and none had lower gross margins). \n\n\nOperating expenses increasing, even with revenue dropping. \n\n\n\nNet income is significantly declining with net margin below 2% (below average for cvs). \n\n\n\n\nEPS significantly falling and about have of the historic average. \n\n\n\nMacro factors also should be considered:\n\n\nIncreasing healthcare costs (insurance becomes less profitable) \n\n\n\nIncreased competition (HIMS, Amazon, better help, walmart, Costco, etc), also on a personal note I know Amazon is significantly better than CVS pharmacy. My wife is a pharmacist and Amazon has a better overall process for getting prescriptions out the door and with less mistakes. Employees work for less at Amazon because the environment is significantly better than CVS. \n\n\n\nDecreasing customer loyalty \n\n\n\nDecreasing employee loyalty\n\n\nIncreased theft (hurting their most profitable business and forcing stores to close). \n\n\n\n\nAlso most important factor, BAD MANAGEMENT. Can’t trust a company that has shown you the management can’t navigate changing environments. \n\n\nI’m glad you’re getting a decent dividend. That’ll most likely be the best returns you get from this company in the long term.",
              "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/lh1ckqu/",
              "created": 1723079954,
              "depth": 2,
              "replies": [
                {
                  "id": "lh1cvzz",
                  "score": 1,
                  "body": "All this to say: even if it ends up not being a loser company I wouldn’t invest. There are better companies to invest in that will offer the same or greater returns without all the risks. \n\n\nEvery investment has risks, but this one has a lot of risks and no clear path to improvement",
                  "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/lh1cvzz/",
                  "created": 1723080068,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lh1e701",
                      "score": 1,
                      "body": "It’s 4% of my portfolio so will not make or break me. I have 4 CVS’s within 5 miles of my house, they are on every corner and aren’t going anywhere. I think they’ll make the necessary changes and continue to diversify their business model, expanding their offerings, and a aging population. Stock is too cheap to ignore. I guess for every bear there is a bull",
                      "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/lh1e701/",
                      "created": 1723080557,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lh1ialv",
                          "score": 2,
                          "body": "Like you said cvs has stores on every corner, however they plan closing 10% of their stores over the next 2.5 years. Most of the customers will just go to another nearby store but some will switch to online orders from Amazon or go to their local Walmart/costco. So their revenue will probably drop even more, admittedly their margins will probably increase since the closing stores aren’t as profitable. \n\n\n\nIf you want cheap I’ll offer some recs that I’ve been looking at: \n\n\nBanking: $MFC 9 Forward PE and 4.84% dividend. $TD 9.5 forward PE and 5.3% dividend. $TFC I own already and has an 11 forward PE and 5.1% dividend. All three have been pretty beat up bc of the rate hikes and real estate issues, but all have solid financials and can make a good comeback. TFC is also unwinding their commercial real estate and making better investments. \n\n\nConsumer: ASO with a 7 PE and 1% dividend, LOW and HD with a 18 and 20 PE and 2.0/2.6% div.\n\n\nA couple random companies: EOG 10 PE and 3% div. AER that has a beautiful 5.8 PE and 1.1% dividend.\n\n\n Honorable mention to SBUX a higher 20 PE and 3% div",
                          "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/lh1ialv/",
                          "created": 1723082115,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lh3kgct",
                              "score": 1,
                              "body": "Thanks for the suggestions, I’ll check them out. Going to keep my CVS shares and see what happens… hedge funds are buying them up in bulk, what do they know that we don’t? We shall see",
                              "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/lh3kgct/",
                              "created": 1723120983,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lhaty5c",
                              "score": 0,
                              "body": "You can't conclude that 'their revenue will probably drop even more' based simply on retail pharmacy closing underperforming locations. \n\nIt makes no sense to compare a cyclical sector like banking to healthcare.  \n\nConsumer stocks trading at high teens PEs need a solid growth story to justify their valuations, and we have seen how quickly they can fall if that growth story comes into question.  A single digit PE like CVS is much less demanding.  The question for the stock is how successful they will be at recovering their margins, if they can, then the valuation will jump, and investors will get a substantial dividend while they wait.",
                              "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/lhaty5c/",
                              "created": 1723221849,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lgzy3fa",
      "score": 11,
      "body": "Everybody buying CVS and Walgreens are truly degenerates…. I don’t see what’s so bullish about them",
      "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/lgzy3fa/",
      "created": 1723062557,
      "depth": 0,
      "replies": [
        {
          "id": "lh4fbjl",
          "score": 5,
          "body": "They're trading at very cheap valuations relative to fundamentals. CVS is 10x earnings, Walgreens is trading at less than 2x what its earnings was just a couple years ago.\n\nThis is extremely cheap compared to the rest of the market which is trading at over 30x earnings. If they manage to turn their business around, or even just stabilize, the returns would be really high.\n\nA mediocre company at a good valuation is better than a good company at a bad valuation.",
          "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/lh4fbjl/",
          "created": 1723131402,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lh0avq2",
          "score": 6,
          "body": "Well price used to be higher. So obviously it will go back up to that. Free money",
          "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/lh0avq2/",
          "created": 1723066549,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lh6fu5m",
          "score": 1,
          "body": "Same guys who buy WBD, T, VZ and all the obvious value traps",
          "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/lh6fu5m/",
          "created": 1723153491,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lh19odh",
          "score": -1,
          "body": "Hedge funds are buying the shit out of CVS stock. What do they know that we don’t",
          "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/lh19odh/",
          "created": 1723078874,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lgxrbt1",
      "score": 2,
      "body": "It's time for Karen Lynch to prepare three envelopes",
      "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/lgxrbt1/",
      "created": 1723038111,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lgxlm0j",
      "score": 1,
      "body": "They really should have just stayed being a pharmacy/convenience store.",
      "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/lgxlm0j/",
      "created": 1723036019,
      "depth": 0,
      "replies": [
        {
          "id": "lgygel1",
          "score": 7,
          "body": "they can’t.  amazon is killing them and walgreens. both pharmacy/convenience stores at the core.",
          "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/lgygel1/",
          "created": 1723046207,
          "depth": 1,
          "replies": [
            {
              "id": "lh1pbnu",
              "score": 3,
              "body": "Walgreens has already announced major store closings. \nhttps://www.cbsnews.com/news/walgreens-stores-closing-locations/",
              "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/lh1pbnu/",
              "created": 1723084839,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lhata9o",
          "score": 2,
          "body": "Because that worked so well for Rite Aid, Walgreens, Duane Reed, etc.",
          "permalink": "/r/stocks/comments/1em8ypi/cvs_slashes_profit_outlook_on_higher_medical/lhata9o/",
          "created": 1723221644,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}