{
  "title": "Warner Bros. Discovery stock falls as it writes down $9.1 billion ",
  "score": 383,
  "selftext": "Warner Bros. Discovery’s stock dropped Wednesday after it reported a $9.1 billion write-down on its TV networks and missed analyst estimates on revenue.\n\nHere is how Warner Bros. Discovery performed, based on a survey of analysts by LSEG:\n\nLoss per share: 36 cents vs. a loss of 22 cents expected\n\nRevenue: $9.7 billion vs. $10.07 billion expected\n\nThe company’s shares were down roughly 9% in aftermarket trading.\n\nWarner Bros. Discovery on Wednesday reported the non-cash goodwill impairment charge, which was triggered by the reevaluation of the book value of the TV networks segment. The book value was higher than the market value as traditional TV networks continue to see customers flee and advertisers are opting to spend on digital and streaming instead.\n\n“While I am certainly not dismissive of the magnitude of this impairment, I believe it’s equally important to recognize that the flip side of this reflects the value shift across business models,” said CFO Gunnar Wiedenfels on Wednesday’s earnings call, adding that the company is focusing on growth in the studios and streaming units.\n\nHe said Warner Bros. Discovery’s balance sheet carries a significant amount of goodwill stemming from mergers and acquisitions, namely the combination of Warner Bros. and Discovery in 2022.\n\n“It’s fair to say that even two years ago market valuations and prevailing conditions for legacy media companies were quite different than they are today, and this impairment acknowledges this and better aligns our carrying values with our future outlook,” CEO David Zaslav said on Wednesday’s call.\n\nExecutives highlighted Warner Bros. Discovery’s continued mission of paying down debt, much of which stems from the 2022 merger. During the second quarter the company paid down $1.8 billion in debt. As of June 30, it had $41.4 billion in gross debt and $3.6 billion cash on hand.\n\nThe company also noted uncertainty surrounding future sports rights renewals, including the NBA. Warner Bros. Discovery sued the NBA in July, looking to forcibly invoke its matching rights on a package of games earmarked for Amazon’s Prime Video as part of the league’s new media rights deal.\n\nRevenue for Warner Bros. Discovery’s TV networks — a portfolio that includes TBS, TNT, Discovery and TLC — was down 8% to $5.27 billion during the second quarter, with both distribution and advertising revenue down in the segment.\n\nHowever, the company’s streaming business, centered around the platform Max, was a bright spot.\n\nThe company said Wednesday it added 3.6 million subscribers during the quarter ended June 30, bringing its total number of global streaming customers to 103.3 million.\n\nThe international expansion lifting subscriber growth, as well as increased ad spending on streaming, is propelling its streaming business toward profitability, executives said Wednesday, with the expectation that it would continue.\n\nZaslav also touted the streaming bundles Warner Bros. Discovery is forming — an entertainment pairing with Disney’s Disney+ and Hulu — and a sports bundle with Disney’s ESPN and Fox set to launch this fall.\n\nStill, direct-to-consumer streaming revenue decreased 5% to $2.57 billion, driven by content revenue dropping 70% due to a lower volume of third-party licensing deals. Yet advertising revenue for streaming was up 99%, the company said, driven by higher domestic engagement on Max, and ad-supported subscriber growth. Global revenue also increased 4% driven by the ad tier.\n\nTotal revenue for the quarter was down 6% to $9.7 billion. Total adjusted earnings before interest, taxes, depreciation and amortization decreased 15% to $1.8 billion.\n\nSource: https://www.cnbc.com/2024/08/07/warner-bros-discovery-wbd-earnings-q2-2024.html",
  "link_flair_text": null,
  "id": "1emox1r",
  "num_comments": 75,
  "created_utc": 1723068521,
  "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/",
  "comments": [
    {
      "id": "lh0iwel",
      "score": 263,
      "body": "Maybe after they merge with peacock, and then merge with paramount, and then get acquired by Apple, they will finally capitalize on their long term strategy.  They’ve only gone through like 3 massive mergers and acquisitions in the past 5 years.  Everyone knows you have to go through at least 8 before turning a profit",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh0iwel/",
      "created": 1723069226,
      "depth": 0,
      "replies": [
        {
          "id": "lh0kaqd",
          "score": 62,
          "body": "And then it will just be Disney, Apple, Netflix and Amazon. We still need to get down to a duopoly or monopoly or cable might make a comeback!!",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh0kaqd/",
          "created": 1723069711,
          "depth": 1,
          "replies": [
            {
              "id": "lh14wh5",
              "score": 14,
              "body": "I won't be content until we have exactly 0.5 media corpos price-gauging the shit out of everyone.",
              "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh14wh5/",
              "created": 1723077124,
              "depth": 2,
              "replies": [
                {
                  "id": "lh404vf",
                  "score": 9,
                  "body": "According to *Demolition Man*, Taco Bell is going to win the franchise wars",
                  "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh404vf/",
                  "created": 1723126599,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lh4hkcr",
              "score": 6,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh4hkcr/",
              "created": 1723132089,
              "depth": 2,
              "replies": [
                {
                  "id": "lh4jtpe",
                  "score": 3,
                  "body": "In all seriousness, quite likely or a similar scenario.",
                  "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh4jtpe/",
                  "created": 1723132780,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lh18wsp",
              "score": 9,
              "body": "Weird thing about these topics is how Sony always gets left out as a major movie studio.\n\nMaybe it keeps happening because Sony isn't Mag 7.",
              "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh18wsp/",
              "created": 1723078596,
              "depth": 2,
              "replies": [
                {
                  "id": "lh19cjs",
                  "score": -2,
                  "body": "Honestly, I was making a joke But in truth, I didn’t know Sony made movies anymore. When they sold spiderman to Disney then I thought it was them exiting. I can’t remember the last Sony movie I saw.",
                  "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh19cjs/",
                  "created": 1723078755,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lh1a9ia",
                      "score": 21,
                      "body": "They didn't sell Spider-Man to Disney, they have a contractual agreement that allows Disney to incorporate Spider-Man into the MCU that gets renegotiated every so often.",
                      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh1a9ia/",
                      "created": 1723079090,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lh2aacw",
                          "score": 5,
                          "body": "Spiderman rights would be a multi billion dollar deal.",
                          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh2aacw/",
                          "created": 1723094542,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lh1ed1m",
                      "score": 11,
                      "body": "Anything Columbia pictures is Sony",
                      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh1ed1m/",
                      "created": 1723080622,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lh1bvvh",
                      "score": -1,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh1bvvh/",
                      "created": 1723079696,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lh1ftao",
                          "score": 1,
                          "body": "Your username definitely checksout",
                          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh1ftao/",
                          "created": 1723081171,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lh1oq3x",
              "score": 3,
              "body": "D’FANG",
              "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh1oq3x/",
              "created": 1723084601,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lh0x7jh",
              "score": -3,
              "body": "Don't forget Alphabet with YouTube TV.",
              "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh0x7jh/",
              "created": 1723074275,
              "depth": 2,
              "replies": [
                {
                  "id": "lh3o8ae",
                  "score": -1,
                  "body": "I don't know who in their right mind would want to sign up for YouTube TV. It's so outrageously expensive (over $50 a month last I checked a few years ago) that I wouldn't even consider it no matter what content they have.\n\nIt's like they made the technology for the perfect a la carte cable offering, and decided to be just be like Cable TV anyway.",
                  "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh3o8ae/",
                  "created": 1723122442,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lh0wdyq",
          "score": 11,
          "body": "TBH, if it means that I don't have to interact with Peacock and Paramounts garbage interface, I'm perfectly fine with Apple buying both.",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh0wdyq/",
          "created": 1723073976,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lh15iie",
          "score": 4,
          "body": "Then there will only be 8 working writers and directors in Hollywood. Which ones? The worst ones.",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh15iie/",
          "created": 1723077348,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhbyceh",
          "score": 1,
          "body": "Apple already has its own media house. It doesn’t need to get involved in Warner brothers mess",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lhbyceh/",
          "created": 1723234571,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh0yfky",
      "score": 132,
      "body": "The best thing about Zaslav is he’s taught everyone in America that CEOs don’t have to be unique or specially talented or astutely business minded - they can just be empty figure heads, hollow suits , and puppets, elevated into their station just to take all the blame while the company craters and the Board siphons whatever value is left before whatever shareholders left are stuck holding the bag",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh0yfky/",
      "created": 1723074718,
      "depth": 0,
      "replies": [
        {
          "id": "lh2eyty",
          "score": 7,
          "body": "I’ll have you know my bag is not stuck sir. I will let it go when I feel the tingle.",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh2eyty/",
          "created": 1723097216,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh0xipw",
      "score": 45,
      "body": "I knew I should have sold the day T spun them off. Bag holding since then.",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh0xipw/",
      "created": 1723074386,
      "depth": 0,
      "replies": [
        {
          "id": "lh1hqek",
          "score": 9,
          "body": "Same, is has been down ever since.",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh1hqek/",
          "created": 1723081900,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lh27hwh",
          "score": 7,
          "body": "Same. My worst investment to date",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh27hwh/",
          "created": 1723093030,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lh3tar9",
          "score": 2,
          "body": "I sold them on less than an hour after Schwab finally gave me my shares. I still feel like I was slack in not getting rid of them fast enough. Still holding would be painful. ",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh3tar9/",
          "created": 1723124292,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lh81bbv",
          "score": 2,
          "body": "I made the same mistake, except I sold after it lost like 60 to 70 percent of it's value.",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh81bbv/",
          "created": 1723175371,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh15afa",
      "score": 33,
      "body": "They wrote down more than the entire value of paramount global lol rip me.",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh15afa/",
      "created": 1723077266,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh0kly0",
      "score": 89,
      "body": "Zaslav is horrific",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh0kly0/",
      "created": 1723069820,
      "depth": 0,
      "replies": [
        {
          "id": "lh53rhy",
          "score": 3,
          "body": "I don't think you understand the difficult situation he's been in or what the board is trying to accomplish. He's delivered a lot of high quality media content without breaking the bank. Most importantly, he's been able to consistently write down huge amounts of debt and maintain reasonably good cash flow. As long as that's happening, I think his performance is a success",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh53rhy/",
          "created": 1723138863,
          "depth": 1,
          "replies": [
            {
              "id": "lhbys3t",
              "score": 3,
              "body": "He’s being paid too much though",
              "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lhbys3t/",
              "created": 1723234712,
              "depth": 2,
              "replies": [
                {
                  "id": "lhbzjet",
                  "score": 1,
                  "body": "100% agreed",
                  "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lhbzjet/",
                  "created": 1723234955,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhc0dvs",
                      "score": 3,
                      "body": "Another point in your analysis that was missed was that for stagnating companies like this, they like to use their stock as toilet paper. Expect to be diluted severely in order to raise capital to survive.\n\nIt’s not shareholder friendly for this reason, but the shares do serve a purpose which is ultimately to raise money for the business.",
                      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lhc0dvs/",
                      "created": 1723235229,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lhcr842",
                          "score": 3,
                          "body": "With that much cash flow, I don't think they'll need to resort to share dilution. They did a lot of it in 21 and 22 but I don't think they have since. Definitely a gamble",
                          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lhcr842/",
                          "created": 1723244440,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lh124x6",
      "score": 40,
      "body": "how does David still have a job? objectively terrible executive",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh124x6/",
      "created": 1723076095,
      "depth": 0,
      "replies": [
        {
          "id": "lh4itp2",
          "score": 13,
          "body": "This isn't me trying to defend the guy, but a lot of these problems stem from AT&T buying Warner for too much money/debt.  When they spun off and merged with Discovery, a lot of the bad debt came with them and combined with Discovery's debt.  His job is to pay down this debt as fast as possible, while competing in a crowded field (streaming) and  a shrinking cash cow (cable).  WBD just lost the NBA rights, which will cause them to loose viewers of their cable channels.\n\nHe was a huge part in creating this mess, discovery probably shouldn't have merged with Warner.  He's seen the stock lose a ton of value, thousands have lost their jobs, and WBD looks like they will slowly bleed out, all while being paid 10s of millions of dollars.  WBD is my biggest loser, and these bags continue to be heavy.",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh4itp2/",
          "created": 1723132474,
          "depth": 1,
          "replies": [
            {
              "id": "lh4kje7",
              "score": 4,
              "body": "and he keeps giving himself massive bonuses. he seems like an absolutely terrible person",
              "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh4kje7/",
              "created": 1723133002,
              "depth": 2,
              "replies": [
                {
                  "id": "lh53k2b",
                  "score": 6,
                  "body": "He likes movies, and before WBD, was running a highly profitable but slowly dying company. I think he rushed to merge with Warner but didn't fully think it through and now is reaping what he sowed. \n\nI could argue that if AT&T didn't buy Direct TV, the Warner purchase could have worked since their balance sheet would have been healthier.  This would be a lukewarm argument at best.  I'm also bag holding AT&T",
                  "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh53k2b/",
                  "created": 1723138801,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lh81lel",
              "score": 3,
              "body": "And guess who agreed to pay way too much to buy Warner? It's WBD's current CEO David Zaslav. \n\nSo OP's point still stands, Zaslav got them into this mess, and the stock has just continued to go downhill ever since under his mismanagement.",
              "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh81lel/",
              "created": 1723175499,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lh0ih3l",
      "score": 60,
      "body": "Tell you what David, keep sinking this ship to $3-4 for me and I might be tempted to buy in. Looks like you were having a great time in Paris with Tom Cruise watching gymnastics. If only you put as much effort into running the company as you do on good times with celebs.",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh0ih3l/",
      "created": 1723069081,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh1j1ek",
      "score": 8,
      "body": "I’m buying more, I’m long on this bad boy",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh1j1ek/",
      "created": 1723082400,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh1t8ii",
      "score": 7,
      "body": "Yeah yeah goodwill, book value that's not tangible, whatever. What's the FCF?",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh1t8ii/",
      "created": 1723086430,
      "depth": 0,
      "replies": [
        {
          "id": "lh2c5na",
          "score": 8,
          "body": "They are FCF positive, about 7B for the last 12 months which they are almost fully using to pay down the debt by like 6B a year. Market cap is 18B + 38B in net debt currently. So even if you look at the FCF/EV ratio its less then 10.",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh2c5na/",
          "created": 1723095594,
          "depth": 1,
          "replies": [
            {
              "id": "lh2y9xb",
              "score": 5,
              "body": "They're worth a look at these prices. They're doing better than their earnings report would suggest. Not saying I'd buy but ... worth a look.",
              "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh2y9xb/",
              "created": 1723109657,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lh0wamm",
      "score": 15,
      "body": "I resubscribe to Max every time I want to rewatch the Sopranos. I can’t be the only one.",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh0wamm/",
      "created": 1723073942,
      "depth": 0,
      "replies": [
        {
          "id": "lh15ud5",
          "score": -5,
          "body": "Erm, sure, that's exactly what I do when I want to rewatch the Sopranos for the 10th time: give WB more money, duh.",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh15ud5/",
          "created": 1723077471,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh0vqzx",
      "score": 27,
      "body": "Fire the CEO, he’s not going to return value to shareholders if they stick with him.",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh0vqzx/",
      "created": 1723073746,
      "depth": 0,
      "replies": [
        {
          "id": "lh66o1l",
          "score": 1,
          "body": "Quite the opposite, as bag holders we will continue to be a piggy bank for this company. At this point, I see my Warner stock as a future tax loss harvest. ",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh66o1l/",
          "created": 1723150572,
          "depth": 1,
          "replies": [
            {
              "id": "lh6757e",
              "score": 4,
              "body": "I was shocked to see the comments of people trying to rationalise that large amount of debt that WB has. I honestly wish you could dump your WB holdings and just invest it in a quality stock like Costco. Good luck, mate.",
              "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh6757e/",
              "created": 1723150714,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lh102uv",
      "score": 6,
      "body": "They might be figuring out just now that consumers are switching over to streaming and not liking linear tv that much. You know, cause it’s 2014.",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh102uv/",
      "created": 1723075329,
      "depth": 0,
      "replies": [
        {
          "id": "lh1hei8",
          "score": 6,
          "body": "They WISH it was 2014.",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh1hei8/",
          "created": 1723081774,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh0wid4",
      "score": 29,
      "body": "They are still paying down debt from the AT&T fiasco that they dumped on them.  I think it's got solid IP and will be great once the debt is gone.  Not sure this is the bottom but I think the future is bright.",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh0wid4/",
      "created": 1723074020,
      "depth": 0,
      "replies": [
        {
          "id": "lh1lli4",
          "score": 16,
          "body": "When will that be? They paid $1.8B on $41B with interest.\n\n\nI don’t know anything about corporate debt but that looks like 10 years atleast",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh1lli4/",
          "created": 1723083383,
          "depth": 1,
          "replies": [
            {
              "id": "lh1unr5",
              "score": 6,
              "body": "The goal which was stated as far back as 2022 was to reduce its net leverage to between 2.5x and 3.0x.",
              "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh1unr5/",
              "created": 1723087026,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lh1ix5r",
          "score": 16,
          "body": "I wish more people understood this. They’re making great progress on that debt, losing the NBA was a fumble for sure but they are still in rebuild mode and should start turning things around soon",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh1ix5r/",
          "created": 1723082355,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lh1309e",
          "score": 12,
          "body": "Yea. In 2022 when spinoff happened they said it would be 2 years before they get through a lot of the merger stuff. We are on year 2 the problem is wall street and even Reddit doesnt want to wait multiple years for something to play out. Reddit is about saying what is popular in the current climate. Wall Street wants to see results quarter by quarter.\n\nThey just got started with their international expansion. This entire time the stock was getting attacked they werent even in Europe. I think more time is needed to judge the merger.",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh1309e/",
          "created": 1723076422,
          "depth": 1,
          "replies": [
            {
              "id": "lh3ddh8",
              "score": 5,
              "body": "Why would Wall Street wait? There was just a huge run up in tech with loads of money to be made and WBD was not part of it.",
              "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh3ddh8/",
              "created": 1723117960,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lh3rbna",
          "score": 1,
          "body": "It's hard to pay off the debt and have a healthier balance sheet when you keep losing money and writing off billions of dollars of assets.\n\nLike seriously, I'm looking at a chart of WBD's net income over the last 5 years, and they haven't had a quarter of positive net income in 8 years now. And worse yet, almost all of those negative net income quarters are larger losses (sometimes by as much as 6X) then their most positive net income numbers from the last 5 years.",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh3rbna/",
          "created": 1723123587,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh1lpvo",
      "score": 6,
      "body": "we need a new House of the Dragon season every three months or they're cooked",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh1lpvo/",
      "created": 1723083429,
      "depth": 0,
      "replies": [
        {
          "id": "lh2lkby",
          "score": 8,
          "body": "Not if the season finale's as bad and inconclusive as the most recent one.",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh2lkby/",
          "created": 1723101304,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh18zbh",
      "score": 5,
      "body": "Friendship with Disney being bought by Apple rumours ended\n\nFriendship with WBD being bought by Apple rumours begin",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh18zbh/",
      "created": 1723078621,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh3mebq",
      "score": 4,
      "body": "Have they tried paying David Zaslav more money? You know, so he is incentived correctly. Obviously his $50 million comp is not motivating him enough.",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh3mebq/",
      "created": 1723121745,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh5ey9u",
      "score": 2,
      "body": "Why does the Warner mergers remind me of AOL eating up CNN. History always repeats itself, and down the line it’s always about greed, making the biggest company and ending up with debt that almost destroys the company.",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh5ey9u/",
      "created": 1723142246,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh0s0rh",
      "score": 3,
      "body": "I have little faith in them at the moment but I just can’t believe they’ll go belly up. \n\nI started buying around this level hoping it’s the bottom. Maybe I’m wrong, time will tell.",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh0s0rh/",
      "created": 1723072409,
      "depth": 0,
      "replies": [
        {
          "id": "lh217ue",
          "score": 4,
          "body": "I’ve been watching them pretty closely for about 3 months now, still no position, short term I don’t see much helping them, but I doubt they go bankrupt, still have a solid amount of FCF to pay down debt, and worst case scenario for them they get acquired, I just don’t see these IPs going without offers being made.",
          "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh217ue/",
          "created": 1723089934,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh3reky",
      "score": 1,
      "body": "Pretty ugly earnings, the write down isn't a huge deal and not unexpected BUT the lack of growth in domestic streaming subs during a period that includes HOTD is a problem. Sure global subs are up due to their roll out overseas but they need to grow domestic soon if this will work. Can't have flat DTC growth(actually was negative after content). \n\nOtherwise, you're losing revenue in your cash flow machine and not offsetting it in the DTC space which is what they need.",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh3reky/",
      "created": 1723123617,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhby7fl",
      "score": 1,
      "body": "Media houses are typically not easy to value or hold",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lhby7fl/",
      "created": 1723234526,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhch1cx",
      "score": 1,
      "body": "I don't subscribe to any streaming services due to the high cost and very constant price increases. So if I want to watch something, I either pirate, go to the library to borrow movies or just buy my favs on DVD or BD. In this scenario, Greed is *NOT* good, no matter if Gordon Gecko was in charge of WBD.",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lhch1cx/",
      "created": 1723240770,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhmiatg",
      "score": 1,
      "body": "The last person to change the TV / cable industry was Ted Turner.\n\nCable is dying out. Now we just have the same subscriptions, only thru apps.\n\nLosing the NBA is huge, and the trend is starting - Netflix have picked up RAW (for now)[globally Raw, SD and NXT]\n\nF1 in Netherlands is only available on another streaming service.\n\nAnd these guys wonder why people purchase IPTV services.",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lhmiatg/",
      "created": 1723400660,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lifrset",
      "score": 1,
      "body": "They have a positive cash flow per share. From what sources?",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lifrset/",
      "created": 1723829441,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh0qs11",
      "score": 1,
      "body": "Oof",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh0qs11/",
      "created": 1723071973,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh1jxda",
      "score": 1,
      "body": "Damn how low does this falling knife go? $5?",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh1jxda/",
      "created": 1723082742,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh15b9q",
      "score": -18,
      "body": "Hollywood is fucked until they stop the woke bullshit and make good movies.",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh15b9q/",
      "created": 1723077275,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh15mu9",
      "score": -5,
      "body": "Maybe it’s time that Warner bow out and just produced content and sell it to Netflix, Amazon and Apple and quit streaming and broadcast. Similar like movie theaters where they show their movies but don’t own any of the theatres. Sell off all the networks to some right wing media mogul and move on. Whatever the ceo is trying to do ain’t working. \n\nAnd wait until that Superman movie doesn’t work out as expected and millions go down the drain.",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh15mu9/",
      "created": 1723077393,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh1lqfl",
      "score": -3,
      "body": "only way out. is buyout 100% from other competitors. and anyone hold at loss, accept the consequences abd go like what i made mistake at the past",
      "permalink": "/r/stocks/comments/1emox1r/warner_bros_discovery_stock_falls_as_it_writes/lh1lqfl/",
      "created": 1723083436,
      "depth": 0,
      "replies": []
    }
  ]
}