{
  "title": "Seesaw of Emotions",
  "score": 50,
  "selftext": "(UPDATE IN COMMENTS)\n\nI wanted to post this to tell ya’ll to not give up this trading thing if you’re behind right now. I am not going to act like I know anything at all, but probably just some dumb luck. Sold our house in June and made 120k, needed to get it to 131k to have the down payment for our house when we decide to buy this fall. \n\nSo like a proper regard I tanked it over the next month to 39k. Great progress so far. Then slowly started following a technical analyst, and making some plays. Had 67k in the account last Friday, and then made 123k Monday through today. 96 came from AAPL puts I bought Friday and held into the weekend, and the rest from AAPL and QQQ puts today. If I keep this up my wife may break up with her boyfriend. ",
  "link_flair_text": "Gain",
  "id": "1emu51j",
  "num_comments": 27,
  "created_utc": 1723082757,
  "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/",
  "url_overridden_by_dest": "https://i.redd.it/631n934plchd1.jpeg",
  "comments": [
    {
      "id": "lh1jzaq",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 week ago\n**Total Comments** | 28 | **Previous Best DD** | \n**Account Age** | 3 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1jzaq/",
      "created": 1723082763,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh1u1xy",
      "score": 23,
      "body": "I can spot a bear from their Robin Hood charts.",
      "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1u1xy/",
      "created": 1723086771,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh1qvon",
      "score": 8,
      "body": "What everyone fails to remember is the current healthcare crisis we’re in. Not the one you think we’re in, I’m talking about the one we set ourselves up for. Over-hiring during a pandemic on a national scale with current employee wages far exceeding the operational costs for healthcare settings. I’m talking hospitals, clinics, pediatrics, outpatient therapies and retirement/aging peoples-facilities. It’s all whispers until it’s roaring across social media and news outlets, but massive layoffs across national healthcare networks are already occurring and more are on the way. People wanna look for the next big move and it’s the one Wall Street wanted. Pick your favorite healthcare stock and start buying puts cause this US economy is about to buck. Need I even remind you when layoffs occur pensions and 401ks get moving, and that transfer is the initial kickoff for the market sell side, and upon transference, if the hundreds of thousands of workers don’t cash out on what they have saved the buy orders will flood back in, but at a significant lower volume. The same could be said about the next 10 years as the last of the boomers go, all of their material wealth is sold off, and most people who inherit lose merit, make mistakes, and buy intel at the worst fucking time possible. Don’t say I didn’t warn ya, the American Jubilee is coming.",
      "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1qvon/",
      "created": 1723085463,
      "depth": 0,
      "replies": [
        {
          "id": "lh1tqpn",
          "score": 6,
          "body": "Healthcare is crazy man. I don’t know how to fix it necessarily, but from a clinical standpoint, our system is failing us in this country. We have the most expensive medicine in the world, and yet our healthcare outcomes are among the worst in developed countries overall, because we have so many who can’t afford it even with the marketplace and stipends, because of high deductibles and out of pocket costs. \n\nI’m a cardiac clinical resource nurse and have my hands in a handful of administrative functions. I see what we bill patients for services, drugs, and treatments. Even though we are usually only reimbursed a lump sum by Medicaid and Medicare based on the diagnosis codes, and only by about 23% of what we bill, it’s still crazy what it costs. $73 for a glucose check, which we do four times a day minimum for diabetic patients. You can buy a meter and a months worth of strips for that. I think curbing those costs would be a great first step in fixing the healthcare issues we have, but of course it would have repercussions as well.",
          "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1tqpn/",
          "created": 1723086641,
          "depth": 1,
          "replies": [
            {
              "id": "lh250ym",
              "score": 2,
              "body": "Nationalized healthcare.  That's how you fix it.",
              "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh250ym/",
              "created": 1723091774,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lh2b7fz",
              "score": 2,
              "body": "I’ve seen the best and worst of the healthcare system in my lifetime and it’s saved as many as it’s ruined, countless lives, not that our medical practices are not beneficial, just ill managed and represented as well as healthcare being out of reach from the majority of the nation. From your perspective and professional experience how much stress and anxiety from the system itself leads people to poor health or poor mental state of being? I don’t believe a solution is possible so long as “Healthcare” and “Capitalism” are entwined. But alas the best research is done on someone else’s dime. I wouldn’t mind the taxes for free healthcare, by the people for the people, they already tax tobacco, liquor and weed. Might as well cover the costs to the diseases they propagate.",
              "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh2b7fz/",
              "created": 1723095056,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lh1rvc4",
      "score": 3,
      "body": "Did the wife know?",
      "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1rvc4/",
      "created": 1723085868,
      "depth": 0,
      "replies": [
        {
          "id": "lh1sq9n",
          "score": 8,
          "body": "Heck no lol",
          "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1sq9n/",
          "created": 1723086220,
          "depth": 1,
          "replies": [
            {
              "id": "lh1to3j",
              "score": 3,
              "body": "God, could you imagine?",
              "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1to3j/",
              "created": 1723086612,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lh2vd0j",
      "score": 4,
      "body": "I’ll happily take that 105k of buying power to fund my startup which involves traveling the world to luxury destinations like Dubai and Paris with a garantes return of 0%",
      "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh2vd0j/",
      "created": 1723107726,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh1setu",
      "score": 2,
      "body": "Wow influencer marketing is becoming next level.",
      "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1setu/",
      "created": 1723086089,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh1yime",
      "score": 2,
      "body": "Talk about a seesaw of emotions",
      "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1yime/",
      "created": 1723088706,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh3sgrm",
      "score": 2,
      "body": "https://preview.redd.it/04xdh7mb0ghd1.jpeg?width=1135&format=pjpg&auto=webp&s=2c7141be4f5581857e38276db6a32b6cedb5f9c1",
      "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh3sgrm/",
      "created": 1723123997,
      "depth": 0,
      "replies": [
        {
          "id": "lh4d7hv",
          "score": 1,
          "body": "People will be so quick to do that until they realize that most people have stood to lose more than they gain by tax loss harvest, and make even more from it.",
          "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh4d7hv/",
          "created": 1723130747,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh1lgxh",
      "score": 3,
      "body": "That’s horrifying. This recession has hit hard, but I see several things pushing through as time goes on. A couple of my stocks have already began to recover.",
      "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1lgxh/",
      "created": 1723083334,
      "depth": 0,
      "replies": [
        {
          "id": "lh1lkmg",
          "score": 8,
          "body": "https://preview.redd.it/0znepuninchd1.jpeg?width=1284&format=pjpg&auto=webp&s=0fd188beed0ce4b2681a32105161893c83f38086",
          "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1lkmg/",
          "created": 1723083373,
          "depth": 1,
          "replies": [
            {
              "id": "lh1m56r",
              "score": 1,
              "body": "My biggest worry at this point is the rumor of multiple companies going bankrupt. I’m hoping that none of those are anybody’s stock picks. based on what I’m seeing though it doesn’t look like any of the companies that you picked are going to be failing anytime soon. Makes me extremely happy to see others doing well.",
              "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1m56r/",
              "created": 1723083595,
              "depth": 2,
              "replies": [
                {
                  "id": "lh1ti45",
                  "score": 2,
                  "body": "Heard SPRW the other day but that industry needs consolidation.\n\nOther recents are SEDG and Fisker.",
                  "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1ti45/",
                  "created": 1723086542,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lh1mptq",
                  "score": 4,
                  "body": "I just pray the smaller businesses don’t layoff. I remember 2008 being such a crappy time for a lot of my friends and family. We always feel guilty as an NP and a teacher, things would have to get catastrophic for healthcare and public school jobs to be gone, but thankful to have jobs. I should probably take this as a blessing and cash out, knowing it’s just as likely I lose money in the future. I’m not taking on risky trades anymore as far as the amount of options though.",
                  "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1mptq/",
                  "created": 1723083815,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lh1mye6",
                      "score": 2,
                      "body": "Now is not the time for risky trades. I was in high school in 2008 when all of that was going on. Scary time for sure when the big three had to be bailed out, Ford refused to bail out. Washington mutual went bankrupt.",
                      "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1mye6/",
                      "created": 1723083907,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lh4uvzq",
      "score": 2,
      "body": "C'mon bud, be real. You weren't trying to turn $120k into $130k. You are trying to hit it big so you can surprise your wife. Honey look I was super smart at stonks and now we can buy our dream home with cash free and clear!\n\nYou got lucky. Please at least take the $130k and put it aside in something safe. Then you can be a degenerate regard with the rest.\n\nMake sure to update us in the fall with pics of the new house. Or the couch you're surfing while your divorce finalizes.",
      "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh4uvzq/",
      "created": 1723136176,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh6qsg9",
      "score": 1,
      "body": "Dude just buy asts with half the money . ( buy a call ending in oct ) it will beat earnings and rocket high",
      "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh6qsg9/",
      "created": 1723157269,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh1nf61",
      "score": 1,
      "body": "Which technical analyst did u follow",
      "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1nf61/",
      "created": 1723084089,
      "depth": 0,
      "replies": [
        {
          "id": "lh1nsbg",
          "score": 2,
          "body": "His name is AJ Monte. Sticky Trades.com. You can do a 15 day trial for free. Don’t even have to put in a credit card bc he thinks that’s a scam lol. I was seeing a patient in the hospital and noticed he had TOS up on his iPad and he told me I better give AJ a chance. He puts a weekly and mid week market report on YouTube for free, and picks a stock of the week to analyze on X, but with the paid subscription he does like 3-4 zoom calls a week.",
          "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1nsbg/",
          "created": 1723084231,
          "depth": 1,
          "replies": [
            {
              "id": "lh1nsc4",
              "score": 3,
              "body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
              "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1nsc4/",
              "created": 1723084232,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lh1ooj4",
              "score": 2,
              "body": "Thank u! Checking his channel out",
              "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1ooj4/",
              "created": 1723084583,
              "depth": 2,
              "replies": [
                {
                  "id": "lh1q88c",
                  "score": 2,
                  "body": "And no I’m not affiliated with them lol. The biggest bang for your buck is the zoom call on Wednesdays.. he calls it the rapid fire webinar I think, and you submit ticker symbols in the chat and he analyzes 60 in 60 minutes and gives a price target. That’s where I’ve made my money from. They log his price targets in a database, and I think he averages like 82% correct within 60 trading days, but most of them are met in the next week.",
                  "permalink": "/r/wallstreetbets/comments/1emu51j/seesaw_of_emotions/lh1q88c/",
                  "created": 1723085200,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}