{
  "title": "Thoughts on Axon (AXON)?",
  "score": 44,
  "selftext": "Axon is up 18% today following yesterday’s earning report. I’ve owned Axon since 2017 when I noticed that just about every police department getting body cameras was going with them, and absolutely love this company.\n\nThey make the bulk of their money using a SAS subscription model, licensing their evidence.com body camera video storage to law enforcement agencies. Evidence.com has since become a must-have for law enforcement agencies, District Attorney Offices, and even public defender offices and private defense attorneys are buying subscriptions to easily receive and review body camera evidence.\n\nThe company is a cash cow. At this point, with the widespread adoption of Axon body cameras, the company has a ton of government contracts, and the government agencies need the evidence.com subscriptions to maintain their evidence. The competition in the body camera market sucks, and the costs to switch are enormous. Axon can pretty much charge whatever they want, and they have all these government contracts with places that aren’t going to be able to easily get rid of them. Their costs to operate this type of business are pretty small.\n\nThose are my thoughts (especially as a Deputy DA who’s been using their services for years now). I’m curious what everybody else thinks about this company. ",
  "link_flair_text": null,
  "id": "1emutsi",
  "num_comments": 29,
  "created_utc": 1723084756,
  "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/",
  "comments": [
    {
      "id": "lh1p458",
      "score": 1,
      "body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh1p458/",
      "created": 1723084756,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh1rhtc",
      "score": 17,
      "body": "I love them and don’t get why they aren’t more talked about.  They’re the Apple of law enforcement.  Hook someone with the iPhone/taser/BWC and get them to get everything else in your eco system.  They’re also trying to branch out into other markets like getting body cameras on paramedics or every day workers.  So many ways this company can become even more successful in both the short and long term they’re still a no brain buy for me (I’ve bought regularly since they were in the 20’s).",
      "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh1rhtc/",
      "created": 1723085713,
      "depth": 0,
      "replies": [
        {
          "id": "lvwz38o",
          "score": 1,
          "body": "They should add them to regular cars too",
          "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lvwz38o/",
          "created": 1730995523,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh29csk",
      "score": 12,
      "body": "Great company/management. Really impressive on how they continue to grow ARR. Sticky business, govt software and hardware. Valuation has always been too rich for me, but that’s the price you pay for such a quality company. \n\nYou should look at Cellebrite. Same sector, crucial sticky police/govt software also used by just about every police department. It even integrates with evidence.com. Axon is an investor in it and my hope is they will try to acquire it at some point since they complement each other so well. It’s valued much cheaper than Axon so it’s a more reasonable investment for me.",
      "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh29csk/",
      "created": 1723094034,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh1v143",
      "score": 10,
      "body": "They have the market. No competition. They aren’t going anywhere and will only get bigger. Buy buy buy!!",
      "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh1v143/",
      "created": 1723087185,
      "depth": 0,
      "replies": [
        {
          "id": "lwd7fip",
          "score": 1,
          "body": "Even at $600?",
          "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lwd7fip/",
          "created": 1731214206,
          "depth": 1,
          "replies": [
            {
              "id": "lwdagjz",
              "score": 1,
              "body": "i would still buy some but not a lot, they have room to expand. Lots of law enforment pd's still need to buy gear.",
              "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lwdagjz/",
              "created": 1731215644,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lh305f5",
      "score": 7,
      "body": "Free cash flow is consistently negative after subtracting share-based compensation. The stock is overvalued.",
      "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh305f5/",
      "created": 1723110855,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh1vlbv",
      "score": 3,
      "body": "Love the company, one of my best holdings. Just wish I bought more. \n\n\nI didn’t see you mention it, but they started an additional program that helps police write their reports and use the footage/notes to make pretty detailed reports very quickly. This is huge for police as they try to hit budgets and can use the extra time saved in better ways. This can potentially be transferred to other fields like healthcare which they’re trying to get into. I think this is a pretty big deal as it’s a great way for them to diversify. \n\n\n\nThey also have taser, didn’t see that mentioned, which was their core business. Taser isn’t as much of a cash cow as body cam/cloud software is but still a growing segment. I think it will become more important with their newer models that have better stopping power which makes it safer for officers to use. \n\n\n\nRecently they acquired a drone company, I remember they had an interesting way to integrate it to the company but honestly forgot the details. Seems cool though and I think drones are becoming popular again as Ukraine showed how much of a game changer they are. I also think Axons management proved they have an idea for the future and use acquisitions as stepping stones to that future and integrate everything really well. I haven’t listened to the latest ER but I am interested to see how the drones do. \n\n\n\nWill end with: I will buy more, I bought some a month ago and a few shares every 6 months for the last 3 years.",
      "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh1vlbv/",
      "created": 1723087422,
      "depth": 0,
      "replies": [
        {
          "id": "lh22ez4",
          "score": 1,
          "body": "Yeah, as someone whose career has been in law enforcement (previously as a cop, now as a DA), I can absolutely see their AI report writing tool taking off. Apparently, it provides a really solid rough draft based on the officer’s body camera footage.\n\nThe drone stuff, though, I think is a waste of money. Taser drones just ain’t it. They’re cool, but come on. The situations where a taser drone is going to be the practical thing to deploy are far in few between. Also, communities go into outrage mode just over agencies buying bearcats and beanbag guns. Taser drones aren’t going to be politically popular. I wish they’d get off it",
          "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh22ez4/",
          "created": 1723090491,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh4jl40",
      "score": 3,
      "body": "Honestly impressed with the execution here. I manage a few portfolios for family and own it in one of them and it's been a big grower. I think they have a great product line, have embedded themselves into a variety of law enforcement areas with software and hardware and are growing well. \n\nOnly concern at this price is valuation, still not generating free cash flow after account for stock based compensation so always wonder when that switch will flip and what their final margins might look like. \n\nThis is one of those stocks that could see huge sell-off if they have an earnings that misses the mark with where it's valued but I'm happy holding it still after today's earnings.",
      "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh4jl40/",
      "created": 1723132706,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh4q4cx",
      "score": 3,
      "body": "Bullish AF. Been holding since Michael Brown's peaceful strongarm robbery in Ferguson MO.",
      "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh4q4cx/",
      "created": 1723134714,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh82b6q",
      "score": 2,
      "body": "Nice my Mom also grabbed a bunch of Axon back when she seen all the cops we’re gonna be using them. She made a pretty penny on that stock I had to sell it though I’m controlling her finances. & the market scared me",
      "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh82b6q/",
      "created": 1723175833,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw5er7d",
      "score": 2,
      "body": "Today showed all of you to be WINNERS in the long game if you still held on!",
      "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lw5er7d/",
      "created": 1731102041,
      "depth": 0,
      "replies": [
        {
          "id": "lw5f6i1",
          "score": 1,
          "body": "I am VERY pleased with my returns today",
          "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lw5f6i1/",
          "created": 1731102172,
          "depth": 1,
          "replies": [
            {
              "id": "lw6q5nm",
              "score": 2,
              "body": "28%\n\nI only regret not buying more back in 2020.",
              "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lw6q5nm/",
              "created": 1731118334,
              "depth": 2,
              "replies": [
                {
                  "id": "lwdahk7",
                  "score": 1,
                  "body": "same",
                  "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lwdahk7/",
                  "created": 1731215659,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lh232vc",
      "score": 1,
      "body": "Funny you post this, I was just reading about San Francisco voters approving a measure to use drones over the city when responding to calls. I spent some time looking into whose drones they're using or what service, couldn't find much info. Another person here said Axon had purchased a drone company recently, I strongly believe this is just the beginning for that hardware, putting Axon on my watchlist. Thank you!",
      "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh232vc/",
      "created": 1723090811,
      "depth": 0,
      "replies": [
        {
          "id": "lh2744e",
          "score": 1,
          "body": "They use mostly DJI drones, the Axon drones and programming is just ridiculously expensive right now compared to DJI (China company) but there’s worries about security issues with the DJI drones, and if government bodies are forced to use US made drones I’d imagine Axon would be near the top of the list.  Taser, body cameras, and SaaS is their bread and butter now but they basically have the whole police eco system available for purchase and their offerings are generally the best, but slightly more expensive.",
          "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh2744e/",
          "created": 1723092831,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh2a623",
      "score": 1,
      "body": "Have you ever come across VTSI?  Check them out and lmk what you think if you have a moment.  Company offers training simulators for law enforcement, military, and is breaking into other industries.",
      "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh2a623/",
      "created": 1723094476,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh2lf8l",
      "score": 1,
      "body": "I've been following Axon for a while and honestly, they're killing it. They're like the Apple of law enforcement – once agencies start using their body cams and evidence storage, they're hooked. Their SaaS model with [evidence.com](http://evidence.com) is a game-changer, locking in police departments, DA offices, and even defense attorneys.\n\nWhat I love most is their growth potential. They've got new programs that help cops write reports using their footage, saving tons of time. Plus, this tech could expand into other fields. I use Tamap for technical analysis, and my dashboard shows green on the 1-day timeframe, which is a positive signal.\n\nOverall, Axon feels like a solid long-term hold.",
      "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh2lf8l/",
      "created": 1723101212,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh1ycsv",
      "score": 0,
      "body": "It looks like a solid company but It has been going up a lot and the economy is horrible right now so I expect pullbacks",
      "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh1ycsv/",
      "created": 1723088634,
      "depth": 0,
      "replies": [
        {
          "id": "lh41wfl",
          "score": 1,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh41wfl/",
          "created": 1723127175,
          "depth": 1,
          "replies": [
            {
              "id": "lh435iq",
              "score": -1,
              "body": "The US stock market is in a recession that's worse than 2008. This drop in s&p 500 is only the beginning. \n\nAlso look at what the stock market was doing in the first and second world wor considering that we're basically in the third one right now. There is what the stock market is going to look like at best.",
              "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh435iq/",
              "created": 1723127578,
              "depth": 2,
              "replies": [
                {
                  "id": "lh43n9m",
                  "score": 3,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh43n9m/",
                  "created": 1723127736,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lh44gin",
                      "score": 1,
                      "body": "Exactly what people would have said if I told them this back in 2007.",
                      "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh44gin/",
                      "created": 1723127994,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lh4qwey",
                  "score": 3,
                  "body": "This is a dumb take.",
                  "permalink": "/r/stocks/comments/1emutsi/thoughts_on_axon_axon/lh4qwey/",
                  "created": 1723134961,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}