{
  "title": "Under Armour sales fall after retailer cuts discounts, promotions ",
  "score": 71,
  "selftext": "Under Armour on Thursday said quarterly sales fell 14% in North America, and adjusted its full-year profit guidance after settling a years-old securities lawsuit for $434 million.\n\nStill, the company beat Wall Street’s expectations on the top and bottom lines.\n\nHere’s how the athletic apparel company did in its first fiscal quarter compared with what Wall Street was anticipating, based on a survey of analysts by LSEG:\n\nEarnings per share: 1 cent adjusted vs. a loss of 8 cents expected\n\nRevenue: $1.18 billion vs. $1.15 billion expected\n\nIn the three-months ended June 30, Under Armour reported a loss of $305.4 million, or 70 cents per share, compared with a profit of $10 million, or 2 cents per share, a year earlier. Excluding one-time expenses, it reported a profit of $4 million, or 1 cent per share.\n\nSales dropped to $1.18 billion, down about 10% from $1.32 billion a year earlier.\n\nIn late June, Under Armour agreed to settle a years-old securities lawsuit for $434 million about three weeks before a trial was slated to begin. In 2017, Under Armour was accused of defrauding shareholders about its revenue growth in a bid to meet Wall Street’s forecasts.\n\nIn a press release, the company said it was not admitting fault or wrongdoing but had agreed to end the case – about seven years after it was filed – because of “the costs and risks inherent in litigation.” Under Armour said it would pay the settlement using cash from its revolving credit facility.\n\nThe company now expects to swing to a loss in fiscal 2025. It’s forecasting losses per share to be between 53 cents and 56 cents and adjusted earnings per share to be between 19 cents and 22 cents.\n\nUnder Armour previously expected full-year earnings of 2 cents to 5 cents per share, and adjusted earnings between 18 cents and 21 cents per share.\n\nThe athletic apparel company is in the midst of a broad restructuring plan as it fights to regain relevance, reverse a sales slump and boost profits. Earlier this year, Under Armour said it would lay off an unknown number of workers, cut back promotions and discounts and streamline its assortment to be more competitive. It’s also looking to take a page out of Nike’s playbook and position Under Armour as a premium brand.\n\nThe restructuring came two months after former Marriott executive Stephanie Linnartz was ousted as Under Armour’s CEO and its founder Kevin Plank returned to the helm once again.\n\nIn a statement on Thursday, Plank said the company is “encouraged by early progress” in its efforts. But sales still tumbled across Under Armour’s business during the quarter.\n\nIn North America, Under Armour’s largest market, sales dropped 14% to $709 million, but came in better than the $669.1 million that analysts had expected, according to StreetAccount. Wholesale revenue dropped 8% to $681 million, while direct-to-consumer sales declined 12% to $480 million.\n\nSales at stores owned and operated by Under Armour fell 3%, while online sales plunged a staggering 25% — a drop off the company attributed to “planned decreases in promotion activities.”\n\nApparel revenue fell 8%, footwear sales dropped 15% and accessories revenue slid 5%.\n\nAs Under Armour looks to get back to growth and position itself as a premium retailer in a crowded athletic apparel space, it’s adding fresh talent and expanding into sustainable fashion.\n\nOn Tuesday, the retailer announced it had acquired sustainable fashion brand Unless Collective and will bring on the brand’s founder, former Adidas-exec Eric Liedtke, as executive vice president of brand strategy. \n\n“Eric will … be globally accountable for amplifying Under Armour’s brand identity and storytelling, its comprehensive strategic planning process, and executing transformational initiatives that accelerate growth for UA while continuing to lead and curate, UNLESS,” a press release about the acquisition said.\n\n“He will report to President & CEO Kevin Plank and oversee UA’s brand presence through category marketing, consumer intelligence, creative, marketing operations, loyalty, social media, sports marketing, and all strategy functions,” the release said.\n\nUnless bills itself as “the world’s first all-plant, zero-plastic regenerative fashion brand” and said it was created to prove that plants could replace plastics in the manufacturing of apparel and footwear. \n\nSource: https://www.cnbc.com/2024/08/08/under-armour-uaa-earnings-q1-2025.html",
  "link_flair_text": null,
  "id": "1en4vtd",
  "num_comments": 17,
  "created_utc": 1723120731,
  "permalink": "/r/stocks/comments/1en4vtd/under_armour_sales_fall_after_retailer_cuts/",
  "comments": [
    {
      "id": "lh4f396",
      "score": 15,
      "body": "Its a super cheap comapny and I'm sure they make some nice stuff but its almost impossible to go back up market after what happened at UA. I just don't see how it could happen in the short or medium term. The very long term I guess its possible but I cant see how. Plus teh fact they are buying brands on top of managing their own brand so poorly is just odd. I hope they kill it but I just don't see how.",
      "permalink": "/r/stocks/comments/1en4vtd/under_armour_sales_fall_after_retailer_cuts/lh4f396/",
      "created": 1723131332,
      "depth": 0,
      "replies": [
        {
          "id": "lh4ug5j",
          "score": 10,
          "body": "They need to pull a Champion/Reebok/Abercrombie.",
          "permalink": "/r/stocks/comments/1en4vtd/under_armour_sales_fall_after_retailer_cuts/lh4ug5j/",
          "created": 1723136042,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh471fo",
      "score": 17,
      "body": "I feel like I'm singlehandedly propping this company up, I own about 12 different colors of the Velocity shirt (the plain single colored performance shirt). Their \"tech tee 2.0\" and generally all the other shirts became so unbelievably cheap and thin, they are see through if you hold them up to light. The velocity T's seem to have kept at least some of the thickness and they are so goddamn cool and comfortable to wear especially in the summer heat. I just wish their stupid website had more stock and options - I have to go to the outlet stores a couple times a year to check their stock and they typically have a new color or two which I don't have yet. It's mind boggling they can't stock such a basic and simple shirt on the website properly",
      "permalink": "/r/stocks/comments/1en4vtd/under_armour_sales_fall_after_retailer_cuts/lh471fo/",
      "created": 1723128813,
      "depth": 0,
      "replies": [
        {
          "id": "lh8wetz",
          "score": 3,
          "body": "I'm the same, every time I visit the US I stock up. UA is strange to me in that in the US it is seen as a budget sports brand whereas in the UK/Ireland it's seen the same if not better than Nike/Adidas.",
          "permalink": "/r/stocks/comments/1en4vtd/under_armour_sales_fall_after_retailer_cuts/lh8wetz/",
          "created": 1723193578,
          "depth": 1,
          "replies": [
            {
              "id": "lh9ahzq",
              "score": 5,
              "body": "That’s how it started in the US like 20 years ago",
              "permalink": "/r/stocks/comments/1en4vtd/under_armour_sales_fall_after_retailer_cuts/lh9ahzq/",
              "created": 1723202108,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lh5yui1",
      "score": 5,
      "body": "I buy UA shrirts because they are always on sale for 20 bucks. I won’t pay 40",
      "permalink": "/r/stocks/comments/1en4vtd/under_armour_sales_fall_after_retailer_cuts/lh5yui1/",
      "created": 1723148251,
      "depth": 0,
      "replies": [
        {
          "id": "lh6trla",
          "score": 5,
          "body": "This. UA clothing isn’t bad but I buy it when I don’t want to pay Nike prices. If their dry fit costs just as much as Nike, I’ll just buy Nike.",
          "permalink": "/r/stocks/comments/1en4vtd/under_armour_sales_fall_after_retailer_cuts/lh6trla/",
          "created": 1723158324,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh578ga",
      "score": 5,
      "body": "I like Under Armour gear personally - most of my stuff for running & working out is UA.  The workout clothes and even some everyday pants have served me well.\n\nOutside of their shoes that is.  That dept needs a near total overhaul.  They should hire an Adidas design exec in the same way Cadillac should hire an Audi design exec.  \n\nThey made some mistakes over the years for sure, but I don't think you can fairly pin its struggles entirely on UA itself.  It's just a *brutal* sector.  Even Nike isn't immune from changing tastes and smart upstarts like On & Hoka (DECK).  A brand can go from cool/must have to being undesirable so fast.\n\nInteresting the stock is skyrocketing today.  Belief in a turnaround with new exec team.",
      "permalink": "/r/stocks/comments/1en4vtd/under_armour_sales_fall_after_retailer_cuts/lh578ga/",
      "created": 1723139905,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh73zu0",
      "score": 3,
      "body": "Way overpriced at this point.   I love UA stuff honestly,  but I’m not going to pay $45 for a tee shirt & $60 for a sweat shirt.\n\nI keep an eye out for sales,  otherwise it’s not worth the price.",
      "permalink": "/r/stocks/comments/1en4vtd/under_armour_sales_fall_after_retailer_cuts/lh73zu0/",
      "created": 1723162050,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh7ira2",
      "score": 1,
      "body": "I love their golf polos and other attire",
      "permalink": "/r/stocks/comments/1en4vtd/under_armour_sales_fall_after_retailer_cuts/lh7ira2/",
      "created": 1723167681,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh80xdk",
      "score": 1,
      "body": "Stores here are often up to 75%. I bought a ton of stuff from them. Their t shirts are so comfortable to wear, jackets and shorts look and feel better than the competitions.",
      "permalink": "/r/stocks/comments/1en4vtd/under_armour_sales_fall_after_retailer_cuts/lh80xdk/",
      "created": 1723175190,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh8mqz4",
      "score": 1,
      "body": "In my view, under armour recent numbers show a company in transition, but with mixed results. They’re restructuring and aiming for a premium position, which could pay off long-term, but it’s uncertain right now. I’d personally wait for clearer signs of stability. I use Tamap to help pinpoint better entry points based on technical analysis, and currently, it suggests being cautious.",
      "permalink": "/r/stocks/comments/1en4vtd/under_armour_sales_fall_after_retailer_cuts/lh8mqz4/",
      "created": 1723187215,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhduc2g",
      "score": 1,
      "body": "The quality of UA is similar to other sports but the reputation/brand recognition isn’t the same compared to adidas or Nike \n\nTheir shirts , gym shorts, synthetic/athletic wear is fine\n\nTheir shoe reputation is worse, I don’t know a single person who wears UA shoes . \n\nThey don’t sell a lifestyle like lulu , nor can they compete at this time in that market\n\nCompetition is fierce with newer player entering the shoe market",
      "permalink": "/r/stocks/comments/1en4vtd/under_armour_sales_fall_after_retailer_cuts/lhduc2g/",
      "created": 1723260089,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh737n5",
      "score": -8,
      "body": "It's for white guys who want to appear in shape and are possibly MAGA.🤣",
      "permalink": "/r/stocks/comments/1en4vtd/under_armour_sales_fall_after_retailer_cuts/lh737n5/",
      "created": 1723161756,
      "depth": 0,
      "replies": []
    }
  ]
}