{
  "title": "These are the stocks on my watchlist (8/8)",
  "score": 45,
  "selftext": "Hi! I am an ex-prop shop equity trader.\n\nThis is a daily watchlist for trading: I might trade all/none of the stocks listed, and even stocks not listed! I only hold MAG7/market indices long-term. If you use Old Reddit, click “Show Images” at the top to expand the charts. Any positions stated aren’t recommendations, I’m following subreddit rules to disclose positions.\n\nSome stocks I post may be <$500M market cap. These are potentially good candidates to day trade; I have no opinion on them as investments. PLEASE ask specific questions. Questions like “Thoughts on \\_\\_\\_\\_\\_?” or “Is \\_\\_\\_ a good investment?” will be ignored or I’ll troll you unless you add detail and your own opinion. I will block you if you are a troll.\n\nNews: [JPMorgan Says Three Quarters of Global Carry Trades Now Unwound](https://www.bloomberg.com/news/articles/2024-08-08/jpmorgan-says-three-quarters-of-global-carry-trades-now-unwound)\n\n~~DT to make a news conference at 2 PM in Florida- speculation that Vance may be switched out. This is the first announcement since Walz was announced as VP pick. May position in the VIX (VXX) pre-announcement and have a tight stop.~~\n\n**EDIT: Trump stated that there will be no changes in political strategy. Got out of VXX at flat.**\n\n* [**LUMN**](https://finviz.com/quote.ashx?t=LUMN&p=d) - Watching $8 level for today, recently reported earnings. Stock has been stronger than expected despite pullback.\n* [**LLY**](https://finviz.com/quote.ashx?t=LLY&p=d) - Reported blowout earnings- raised guidance from $13.50-$14 to $16-16.60 for 2025. EPS of $3.92 vs $2.60. Revenue of $11.3B vs $9.92. Watching how this will trade at the open but will be light because stock is so high priced.\n* [**SMCI**](https://finviz.com/quote.ashx?t=SMCI&p=d) - Reported earnings two days ago, stock is still extremely weak. Will watch at open, but currently hands off for now due to high price.\n* Other semi-related stocks/ETFs I’m watching: [**AMD**](https://finviz.com/quote.ashx?t=AMD&p=d)/[**ARM**](https://finviz.com/quote.ashx?t=ARM&p=d)/[**MU**](https://finviz.com/quote.ashx?t=MU&p=d)/[**SOXL**](https://finviz.com/quote.ashx?t=SOXL&p=d)/[**NVDA**](https://finviz.com/quote.ashx?t=NVDA&p=d)/[**NVDL**](https://finviz.com/quote.ashx?t=NVDL&p=d). Still long NVDA.\n* [**ASTS**](https://finviz.com/quote.ashx?t=ASTS&p=d) - We saw a pretty big spike yesterday, they got cleared to operate Bluebird direct-to-smartphone satellites from the FAA. ASTS needs closer to 20 satellites (and plans to launch 168). I think an offering might be imminent from the way they need to raise capital. Not sure how else they can secure additional funding at that high valuation. Will elaborate in another post.\n* [**DDOG**](https://finviz.com/quote.ashx?t=DDOG&p=d) - EPS of 0.43 vs 0.35e. Revenue of $645M vs 623M expected. Guides increase in revenue.\n\nEarnings of note: [**SOUN**](https://finviz.com/quote.ashx?t=SOUN&p=d), [**ELF**](https://finviz.com/quote.ashx?t=ELF&p=d), [**PARA**](https://finviz.com/quote.ashx?t=PARA&p=d), [**RKLB**](https://finviz.com/quote.ashx?t=RKLB&p=d)",
  "link_flair_text": null,
  "id": "1en5b6u",
  "num_comments": 25,
  "created_utc": 1723121938,
  "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/",
  "comments": [
    {
      "id": "lh94egc",
      "score": 3,
      "body": "thoughts on rklb?",
      "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh94egc/",
      "created": 1723198702,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh4ibpt",
      "score": 3,
      "body": "ASTS bit seems uninformed... are you not aware of their AT&T deal? They have plenty of funding now",
      "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh4ibpt/",
      "created": 1723132321,
      "depth": 0,
      "replies": [
        {
          "id": "lh4my63",
          "score": -1,
          "body": "The stock has tripled since the AT&T deal announcement, it's old news and well priced in at this point. If I'm missing something new, please let me know if I am.",
          "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh4my63/",
          "created": 1723133748,
          "depth": 1,
          "replies": [
            {
              "id": "lh4p2db",
              "score": 3,
              "body": "What's priced in? huh\n\nYou're wondering if they'll do an offering because they need more funding and you're not sure how else they could raise capital... \n\nnew contracts? revenues after phase 1 (what ATT is funding)? how about just regular old debt?",
              "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh4p2db/",
              "created": 1723134393,
              "depth": 2,
              "replies": [
                {
                  "id": "lh4sh62",
                  "score": 9,
                  "body": "Does it make sense for a company that is:\n\n* negative EPS\n* publicly traded\n* has an inflated stock price (relative to what they are currently doing)\n\nTo take on debt rather than do an offering, especially when interest rates are expected to be cut twice this year? You are throwing away potentially millions of dollars if you take on long-dated debt right now. It makes infinitely more sense to skip the middleman at that point.\n\nYes stocks are forward looking, but the valuation that ASTS is trading at is MASSIVELY optimistic.\n\nCould I be wrong about an offering? Absolutely, but saying that 3 month old news isn't priced into a stock is very unlikely, especially with how well known ASTS is and it having tripled since the announcement. The market doesn't collectively say \"wow we forgot that ASTS is going to receive more revenue from one of its major contracts\" and then buy more three months after it was signed.\n\nSidenote: You don't NEED to have a pressing need to have cash to do an offering- GME was operating completely fine as a company before they announced the massive dilution 2 months ago, the stock was just trading at premium.",
                  "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh4sh62/",
                  "created": 1723135440,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lh5dwdx",
                      "score": 1,
                      "body": "you're confusing my point - i'm not pointing out the ATT deal because you should be trading the news here, i'm pointing out that funding options exists apart from ATMs.................\n\nwhich was also the point in mentioning debt, etc; your claim that they seem to have no other option could've been made 4 months ago, too - do you see what i mean?\n\n>MASSIVELY optimistic.\n\n>Could I be wrong about an offering? Absolutely, but saying that 3 month old news isn't priced into a stock is very unlikely, especially with how well known ASTS is and it having tripled since the announcement. The market doesn't collectively say \"wow we forgot that ASTS is going to receive more revenue from one of its major contracts\" and then buy more three months after it was signed.\n\nso far all i have to go on is you think the price increase is too rapid. idk what you expect from me or anyone else in this thread because there's very little substance to actually discuss here.\n\ni feel like you're describing a trading strategy where retail/institutions trade on news beats a \\~quarter at a time and you can measure the sustainability by the multiples of the share price? is that what you do?\n\notherwise all you're really saying here is \"this can't keep going up... because it can't, and if it does they'll do an ATM\" - do i have that right?",
                      "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh5dwdx/",
                      "created": 1723141926,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lh5edd3",
                          "score": 2,
                          "body": "My point is saying that an offering is the best choice, not the \"only\" one. I can't predict the future and say \"They're going to sign a 1 billion dollar contract with SpaceX!!!\" because that's just illogical and insider trading. Offerings are significantly easier to anticipate. There is a point where an offering becomes a logical thing to do, like when GME mgmt did an offering when it was trading around $60 a few months back. Do I think the stock price is overvalued? Absolutely! Could I be wrong? Absolutely lol.\n\n>i feel like you're describing a trading strategy where retail/institutions trade on news beats a \\~quarter at a time and you can measure the sustainability by the multiples of the share price? is that what you do?\n\nRegarding this, that's not what I do lol. At the end of the day it's a stock I'm interested in potentially watching and I'm listing the reason for why I'm watching it. Trading is about having a bias, and that's my bias. I could go long at some point as well if my bias changes.\n\nShort from $22 btw. At the end of the day both of us can be right- they can do an offering and the market can think they're going to go higher and the price can skyrocket past that. It's not a big deal lol.",
                          "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh5edd3/",
                          "created": 1723142070,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lh5h2ql",
                              "score": 2,
                              "body": "Edit- covered at 21.80",
                              "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh5h2ql/",
                              "created": 1723142884,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lh5i3sy",
                          "score": 1,
                          "body": "What's your opinion on ASTS?",
                          "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh5i3sy/",
                          "created": 1723143192,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lh7m3el",
      "score": 3,
      "body": "Thanks as always.",
      "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh7m3el/",
      "created": 1723168958,
      "depth": 0,
      "replies": [
        {
          "id": "lh7ougg",
          "score": 1,
          "body": "Thank YOU for reading 🤩",
          "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh7ougg/",
          "created": 1723170051,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh9nlkl",
      "score": 1,
      "body": "Do you think those stocks are grossly overvalued and that AI will have wide reaching economic benefits?",
      "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh9nlkl/",
      "created": 1723207893,
      "depth": 0,
      "replies": [
        {
          "id": "lh9oyi8",
          "score": 1,
          "body": "I'm a trader, not an analyst, my opinion is not the best you could seek out on this.",
          "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh9oyi8/",
          "created": 1723208419,
          "depth": 1,
          "replies": [
            {
              "id": "lha5y6a",
              "score": 1,
              "body": "Whats your opinion, always interesting?",
              "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lha5y6a/",
              "created": 1723214360,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lmn4nzi",
      "score": 1,
      "body": "SOUN 24.8% short - squeeeeze pleeeze",
      "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lmn4nzi/",
      "created": 1726078583,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh4a6dy",
      "score": 1,
      "body": "Hi! I am completely new to trading, so please pardon my somewhat simple questions. \n\nFirst, are you adding the news into your post because those things might affect your trade movements today? Naturally current events affect the stock market, but I am particularly curious about your choice to put Trump's possible VP change in bold. Do you believe that this decision would have a significant impact on the market and, if so, in what way?\n\nWhere do you get the data regarding expected revenue, reported earnings, etc? \n\nDoes you list of closely monitored stocks change frequently, or is this a pretty consistent grouping for you?\n\nTo be honest, I don't fully understand the implications of your past job. I googled what a prop shop is, but am still curious, from your experience, what is the biggest takeaway you learned about the stock market?\n\nI appreciate you sharing you insights!",
      "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh4a6dy/",
      "created": 1723129800,
      "depth": 0,
      "replies": [
        {
          "id": "lh4gleh",
          "score": 10,
          "body": "Hi!\n\nNews absolutely matters in deciding which stocks are worth trading day to day- on an average day, a stock typically doesn't have a significant news catalyst. The ones worth trading *typically* (but not always) do.\n\nI believe that Trump's pick will up his chances of winning the election (in the same way that Biden stepping down upped the chance of the Democrats winning the election with Kamala). And yes, I believe that there will be some market movement as a result- DJT (the stock) could go up if his VP pick is better than Vance, there could be more volatility depending on the candidate, the VP pick could have a historical precedent of being friendly towards certain industries, etc. Worth looking at charts of the market after Biden announced he was stepping down, and after the Trump assassination attempt (which boosted Trump's chances of winning the election)\n\nThe earnings reports are pretty much reported internet wide, just do a Google search and you'll be able to find it pretty quickly.\n\nI'd say it depends- the past week has been crazy so there are specific stocks that have been more interesting than others (semis, volatility, levered ETFs), but on a normal day it should change depending on what stocks have meaningful news- I post daily so you can reference my old posts in r/stocks as well.\n\nBiggest takeaway is that it is possible to beat the market, but the dedication and hard work you need to put in will genuinely be the hardest thing you do, and you need to keep putting in the effort. My mentor at the prop shop is someone I think who would have been a Michael Phelps-level Olympian if he had better physical  genetics, alas he had to settle for being one of the greatest day traders in America lol. I make this watchlist daily and share it because I like to keep current with the market, because I'll never have the discipline that he does.",
          "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh4gleh/",
          "created": 1723131792,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh58ej7",
      "score": 0,
      "body": "You buying LUMN with this drop?",
      "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh58ej7/",
      "created": 1723140258,
      "depth": 0,
      "replies": [
        {
          "id": "lh58rri",
          "score": 5,
          "body": "Nope, was interested in a continued move and that clearly isn't happening, so I'll stay away from now.",
          "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh58rri/",
          "created": 1723140371,
          "depth": 1,
          "replies": [
            {
              "id": "lh5c99x",
              "score": 3,
              "body": "Yep, on the same page. Good work with these write ups",
              "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh5c99x/",
              "created": 1723141431,
              "depth": 2,
              "replies": [
                {
                  "id": "lh5d15d",
                  "score": 1,
                  "body": "Thank you for being a reader! :)",
                  "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh5d15d/",
                  "created": 1723141665,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lh5zq90",
      "score": 0,
      "body": "Hello do you think semis and AI stocks will keep going up over next 2/3 years?",
      "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh5zq90/",
      "created": 1723148508,
      "depth": 0,
      "replies": [
        {
          "id": "lh6xqdh",
          "score": 5,
          "body": "I can’t tell the future, sorry. But I’m invested in NVDA",
          "permalink": "/r/stocks/comments/1en5b6u/these_are_the_stocks_on_my_watchlist_88/lh6xqdh/",
          "created": 1723159735,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}