{
  "title": "Am I Missing Something About Dutch Bros?",
  "score": 63,
  "selftext": "BROS released results after the bell and they were decent if not mind blowing:\n\n* **Revenue:** $324.9 million vs analyst estimates of $317.4 million (2.4% beat - 32% YoY)\n* **EPS (non-GAAP):** $0.19 vs analyst estimates of $0.13 ($0.06 beat - 280% YoY)\n* The company **lifted its revenue guidance for the full year** from $1.21 billion to $1.22 billion at the midpoint, a 1.2% increase\n* **Gross Margin (GAAP):** 27.8%, in line with the same quarter last year\n* **EBITDA Margin:** 20.1%, in line with the same quarter last year\n* **Locations:** 912 at quarter end, up from 754 in the same quarter last year\n* **Same-Store Sales** rose 4.1% year on year, in line with the same quarter last year\n\nHowever, the market reacted like they completely shit the bed down -20% in PM and now down about 26% time of writing. To give some real world context INTC (Intel) went down 26% when it slashed 15,000 jobs, cancelled its dividend and said they were cutting back on expansion efforts pretty much guaranteeing no future growth.\n\nI thought maybe BROS had at least mentioned dilution, but nope doesn't appear to be a thing. So, am I just being smooth-brained here and someone can explain one of the biggest stock drops I've ever seen on virtually nothing?\n\n\\*edit\\* Position: $40K @ $29.22, 1369 shares",
  "link_flair_text": "Discussion",
  "id": "1en6u41",
  "num_comments": 98,
  "created_utc": 1723125867,
  "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/",
  "comments": [
    {
      "id": "lh3xxv2",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 229 | **Previous Best DD** | \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh3xxv2/",
      "created": 1723125871,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh44yja",
      "score": 72,
      "body": "This was an insider sell off, Looks like someone sold off 3 million shares. They are at a nice discount now. Good time to buy.",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh44yja/",
      "created": 1723128153,
      "depth": 0,
      "replies": [
        {
          "id": "lh46u44",
          "score": 11,
          "body": "Thanks! That's good info to have!",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh46u44/",
          "created": 1723128746,
          "depth": 1,
          "replies": [
            {
              "id": "lh4bkmd",
              "score": 18,
              "body": "You're welcome. I like this as a long term buy in general. They have lots of potential expansion and market share to capitalize on. They remind me of SBUX, when they were taking off.",
              "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4bkmd/",
              "created": 1723130237,
              "depth": 2,
              "replies": [
                {
                  "id": "lh74tux",
                  "score": 7,
                  "body": "It is a most likely a great long term buy. You are right on point. Dutch Bros was just a small, pretty new coffee stand back when I was a kid. They had a little bit of local competition in their early years, but DB consistently was by far the busiest coffee stand in every town they were in. My town was very small, but they were successful enough to open up a second stand just five minutes from the first. They were always busy, virtually all day.\n\n\nThen as I got older and traveled the state more, I noticed that everywhere they were, they were always busy. Then in more recent years they have expanded quite a bit, and I've seen quite a few locations that are just ways insanely busy. So busy they cause minor disruptions in traffic on the street they're located. \n\n\nThey've always had a really cool, fun work culture and vibe. Their employees love working there, they always have, and it is a big factor in their success. They have a great selection, and have pretty decent coffee. They absolutely have the potential to be the next Starbucks. They have always specialized in the little drive-thru coffee shops, and were amongst the pioneers of the industry. It was wild seeing them become a publicly traded company. \n\n\nDedicated drive-thru coffee stands originated on the west coast, and there is a massive market for them. I don't think they're nearly as popular yet in a lot of the rest of the country. I know there are other regions ripe for the picking. I have friends who moved elsewhere and opened extremely successful stands. But Dutch Bros had proven to be the most popular everywhere they go. ",
                  "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh74tux/",
                  "created": 1723162366,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhcfy6o",
                      "score": 1,
                      "body": "Yep. I'm in the Boise area. Every time I drive by a Dutch Bros, whether it's sun, snow, rain, etc, there are huge lines. Considering they move the line pretty quickly, they must be doing extremely well around here. ",
                      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lhcfy6o/",
                      "created": 1723240389,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lhcjyfy",
                          "score": 3,
                          "body": "Yeah, they're extremely efficient. They have employees that constantly walk down the line of cars taking orders on tablets. ",
                          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lhcjyfy/",
                          "created": 1723241809,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lh405zp",
      "score": 22,
      "body": "Shareholders expected more",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh405zp/",
      "created": 1723126609,
      "depth": 0,
      "replies": [
        {
          "id": "lh49yk4",
          "score": 7,
          "body": "![img](emote|t5_2th52|27189)",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh49yk4/",
          "created": 1723129731,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lh410hl",
          "score": 2,
          "body": "Sure, I could see that being an instigating factor. You invest in a young high growth company for the rapid expansion after all, but, to me, that's worth maybe a five point drop even ten points if the market is having a bad day. 25 points... strikes me as crazy excessive that's 'something has gone badly wrong' drop, not a 'I wanted more gainz' drop.",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh410hl/",
          "created": 1723126888,
          "depth": 1,
          "replies": [
            {
              "id": "lh6co6s",
              "score": 2,
              "body": "I don’t think the forward guidance would be considered high growth",
              "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh6co6s/",
              "created": 1723152453,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lh43k1a",
              "score": 4,
              "body": "Happens even with bigtech. MSFT earnings need to increase by over 20% even 30% yoy to justify its pe",
              "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh43k1a/",
              "created": 1723127708,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lh45tgj",
      "score": 33,
      "body": "I’d guess because it’s not growing fast enough to keep up with its overvaluation and people are done waiting for it to do so.",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh45tgj/",
      "created": 1723128428,
      "depth": 0,
      "replies": [
        {
          "id": "lh47hcr",
          "score": 8,
          "body": "Fair, but so quickly and all on the same day?",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh47hcr/",
          "created": 1723128951,
          "depth": 1,
          "replies": [
            {
              "id": "lh49im2",
              "score": 11,
              "body": "Right after earnings….yea. That would be the catalyst that starts the sell off. Most tickers see a lot of movement right after earnings. Also, according to another commenter, it would appear an insider sold a shit load so that didn’t help either. Earnings not hitting expectations and a 3 million share sell off at the same time? GG",
              "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh49im2/",
              "created": 1723129593,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lh47lci",
      "score": 14,
      "body": "Their goal is 4000 stores. They’re a quarter of the way there. Every store I go to has a line. They started mobile orders to be picked up at the window or drive thru. If they start to offer door dash then that could also expand sales. I bought some more shares today as it was a significant dip but I still believe in the long term success of the company. I liked what I saw from earnings.",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh47lci/",
      "created": 1723128985,
      "depth": 0,
      "replies": [
        {
          "id": "lh4sdsp",
          "score": 3,
          "body": "We drove by one DB by our place and my wife said that's crazy they are slow today. I counted 10 cars in line. That's a slow day for DB. And we're not in a super popular area. I always say I'm going to buy BROS, I think today is a good day to start a position.",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4sdsp/",
          "created": 1723135412,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lh4bx2n",
          "score": 0,
          "body": "There is a difference between having a line because of high volume, and having a line because they are slow. BROS is the latter. Still worth it from time to time, but I can't go to a store on the go and not expect it to make me late.",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4bx2n/",
          "created": 1723130346,
          "depth": 1,
          "replies": [
            {
              "id": "lhtmulb",
              "score": 2,
              "body": "No offense but you’re not going to the riight Dutch bros then😂 I work for Dutch bros in Sacramento and our window average is 1 minute…HALF OF MCDONALDS",
              "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lhtmulb/",
              "created": 1723503177,
              "depth": 2,
              "replies": [
                {
                  "id": "lhum7we",
                  "score": 1,
                  "body": "Perhaps off peak hours, but I don’t think I’ve ever been in a bros drive thru line that has taken less than 10 minutes from joining the line to getting my drink unless it’s late in the afternoon. I usually walk up because it’s slightly faster",
                  "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lhum7we/",
                  "created": 1723516310,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lh40yaj",
      "score": 29,
      "body": "The number you didn't include is their PE ratio. NVDA peaked in the mid 60s with no shortage of people thinking it was overvalued, BROS was more than triple that and after this drop, is still >150x. That is an insane valuation, SBUX is around 21 for reference and they drive huge sales from mobile. BROS is in person only.",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh40yaj/",
      "created": 1723126868,
      "depth": 0,
      "replies": [
        {
          "id": "lh43jh6",
          "score": 10,
          "body": "You're comparing apples to oranges. \n\nSBUX is an established 'value' company in it's mid-stages, when you buy SBUX you do it not because you expect its market share percentage-wise to evolve rapidly, but more because it's stable (ish) and pays a dividend.\n\nBROS is a young 'growth' company in it's early-stage, it has nowhere near the capital/reach of SBUX, but unlike SBUX it can quite easily double in size every three years. The exponential growth is what you're paying for. It's also why 'PE Ratio' is irrelevant. The market doesn't use PE ratios when valuing young companies because young companies are burning money to acquire growth.\n\nTo give an example, Draftkings (DKNG) even after a rather nasty fall is valued at $15B it doesn't even have a PE Ratio because it only just turned one profitable quarter. Pretty much the same for Sofi Banks (SOFI) valued at $7B. \n\nTo reiterate, a poor PE ratio is unlikely to be the issue because until somewhat recently BROS didn't even have profits. In fact, actually having profits while still in rapid growth mode is a fairly strong sign.",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh43jh6/",
          "created": 1723127702,
          "depth": 1,
          "replies": [
            {
              "id": "lh45ys3",
              "score": 10,
              "body": "I think you mighta missed that their store opening growth slowed from last year. It’s the only real negative news I can find and could mean that their growth is slowing. This could be EXTREMELY detrimental when they are still valued as a growth stock. If your premise that they will continue to explode is correct just buy the fucking dip and don’t whine but you better hope at 150X PE that they can continue to grow fast and shrink that PE without slowing. It’s one of the larger risks with an inflated PE if the company continue to keep up with VERY high expectations such as when there is a retail consumer scare…",
              "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh45ys3/",
              "created": 1723128474,
              "depth": 2,
              "replies": [
                {
                  "id": "lh47dnt",
                  "score": 6,
                  "body": "I did miss that their store opening has slowed... which is something to hang my hat on. I'm not whining btw I'm just currently confused, but I seem to be getting some decent info here.",
                  "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh47dnt/",
                  "created": 1723128919,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lh4hpmm",
                      "score": 7,
                      "body": "Yea just remember that PE ratio is more a volatility identifier and will come down one of two ways fast, continuing rampant growth that will lead to good gains or slowing growth which tends to lead fast the other way.",
                      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4hpmm/",
                      "created": 1723132134,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lh4axzx",
              "score": 3,
              "body": "Call me crazy, but a 30 year old company with 900+ stores is far from being a startup. Are they growing? Absolutely. Is it fast? Sure is. But in the end, they are a consumer facing brand that requires physical locations, not a tech company with infinitely scalable market.\n\nIf we face facts, they are selling the same coffee flavored sugary beverages to kids that made Starbucks what it is today, but without the convenience of a mobile app to speed up delivery.\n\nIt's the hip version of Starbucks in markets where they operate, but I don't know that the 40+ crowd has the patience to wait for a \"hip\" beverage when they can get the same mediocre coffee they're used to someplace else faster and for less money. SBUX built itself on the \"third place\" concept, somewhere to hang out and such, but rocketed after they gave up on the \"vibes\" strategy and embraced mobile ordering.\n\nMy estimation is that BROS is a lot like BYND where they had an early run up in the share price due to strong believers in the product buying shares. That created hype that the stock couldn't live up to before a slow decline created a lot of bag holders.",
              "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4axzx/",
              "created": 1723130040,
              "depth": 2,
              "replies": [
                {
                  "id": "lh5xu4c",
                  "score": 1,
                  "body": "Good argument there, as a physical location they'll always lack the scalability that tech has, I hadn't considered that and thanks!",
                  "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh5xu4c/",
                  "created": 1723147947,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lh7jrd0",
          "score": 1,
          "body": "Bingo. Once they lowered the forecast for new stores coming online you can’t justify that growth PE valuation. I think it was a smart move to manage their growth despite that drop, but its valuation was way overpriced",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh7jrd0/",
          "created": 1723168066,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh3z7vw",
      "score": 14,
      "body": "I’m also trying to figure it out. Holding 150 shares and they got slaughtered. Welp, I was planning to hold long term, and now it’s solidified.\n\n\nEdit: I bought a couple months ago when a BROs was built near me in San Diego.  Nothing new has been getting built around here, and for them to put up a building when no one else was had me wondering.  Looks like promising growth for the chain.",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh3z7vw/",
      "created": 1723126295,
      "depth": 0,
      "replies": [
        {
          "id": "lh4cviw",
          "score": 3,
          "body": "Fire sale 🔥 👌 🙌 😍",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4cviw/",
          "created": 1723130644,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lh43v9z",
          "score": -3,
          "body": "I'm not an American, so we don't have dutch bros, but the brand doesn't look appealing at all. The cafes look like gas stations/hardware stores, the logo is garbage, and they only sell drinks? \nReal question is who wants to invest in dutch bros?",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh43v9z/",
          "created": 1723127808,
          "depth": 1,
          "replies": [
            {
              "id": "lh45dkp",
              "score": 30,
              "body": "Like you said you’re not an American. White women love shit like that. It’s a very American business model that will absolutely succeed long term. Its called the Becca Business Model",
              "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh45dkp/",
              "created": 1723128286,
              "depth": 2,
              "replies": [
                {
                  "id": "lh4615a",
                  "score": -7,
                  "body": "White women love local shops and Starbucks. I really don't see a company with \"bros\" in the title capturing the white woman market in the same way, probably ever. \n\n\nMaybe I'm jaded because the one in my area is a ghost town, while the Starbucks down the block has a line into the street every morning.",
                  "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4615a/",
                  "created": 1723128495,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lh4ef5b",
                      "score": 4,
                      "body": "You’re obviously not in an area with a Dutch Bros because every single one I’ve driven by there’s always a line of cars around the corner for the drive through and dozens of people standing in line outside. Probably a pretty close competitor to In n Out in terms of traffic. Dutch Bros is a money machines for anyone with eyes and two brain cells to rub together.",
                      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4ef5b/",
                      "created": 1723131126,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lh4kebq",
                          "score": 2,
                          "body": "You are absolutely correct. My town has more Dutch bros than Starbucks. It’s wild, bros is always busy here",
                          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4kebq/",
                          "created": 1723132959,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lh4mb25",
                          "score": 1,
                          "body": "> Probably a pretty close competitor to In n Out in terms of traffic.\n\n\nIn and Out doesn't exist in my region. Dutch Bros does, and it's not popular at all. \n\n\nI know this is going to sound shocking, but some chains only experience regional success.\n\n\nThey've been around 30 years, they aren't some new exciting company. I don't know why this sub has such a hard on for this coffee chain.",
                          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4mb25/",
                          "created": 1723133552,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lh50325",
                              "score": 0,
                              "body": "Dutch bros is literally a national chain and they’ve been expanding like crazy lmao. The only region they’re not in yet is the North East but in a few years they’ll probably have a hundred more locations peppered in. You probably thought chik fil can only succeed in the south too lol",
                              "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh50325/",
                              "created": 1723137754,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lh57dlx",
                                  "score": 2,
                                  "body": "Sure man, any day now they'll carry you to prosperity. That chart is abysmal lmao ",
                                  "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh57dlx/",
                                  "created": 1723139948,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lh59o8t",
                                      "score": 0,
                                      "body": "Yeah dude their spread is awful now for x, y, and z reasons but you can’t deny their earnings. Get out of here with the corporate raider mindset lmao",
                                      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh59o8t/",
                                      "created": 1723140647,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lh4gu89",
                  "score": -9,
                  "body": "There's fewer and fewer white women in US. Dying business model.",
                  "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4gu89/",
                  "created": 1723131868,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lh45x9p",
              "score": 8,
              "body": "They’re not cafes they’re drive throughs, coffees good excited young ladies who always work there can be a perk",
              "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh45x9p/",
              "created": 1723128461,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lh48rc8",
              "score": 6,
              "body": "It's Starbucks except the coffee isn't nearly as shitty.  \n\nAmerica is the land of gas stations - most Starbucks aren't in real cities, they're in minimalls (buidlings next to parking lots).",
              "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh48rc8/",
              "created": 1723129352,
              "depth": 2,
              "replies": [
                {
                  "id": "lh4rpsp",
                  "score": 4,
                  "body": "Nah. Their coffee is shitty and their core demographic are teenagers. Still think they’ll be successful. \n\nI live in the area it was founded. It’s 100% for children and they eat that shit up. Especially the merch. They used to give their employees gift cards periodically to have them shop at the main Dutch house where they sell their Dutch gear. \n\nThe merch, boys. That’s something Starbucks doesn’t have.",
                  "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4rpsp/",
                  "created": 1723135210,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lh4v2mi",
                  "score": 2,
                  "body": "I visited my first Dutch Bros in Idaho and they don’t even sell drip coffee.\n\nGarbage",
                  "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4v2mi/",
                  "created": 1723136231,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lh461fl",
              "score": 6,
              "body": "The American mind loves strip malls, enormous parking lots so you have to drive from store to store instead of walking along a pretty street with a sense of place, and drive-thrus. As a European, as soon as I saw Dutch Bros business model I bought 100 shares.",
              "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh461fl/",
              "created": 1723128497,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lh497wa",
              "score": 3,
              "body": "Every one of them in my area has a line alllll day long. They are very popular",
              "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh497wa/",
              "created": 1723129499,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lh46b5h",
      "score": 7,
      "body": "isn't that the norm these days? getting smashed after good earnings I mean",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh46b5h/",
      "created": 1723128583,
      "depth": 0,
      "replies": [
        {
          "id": "lh47jwe",
          "score": 4,
          "body": "Lol actually yeah pretty much 😒",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh47jwe/",
          "created": 1723128973,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh46x6i",
      "score": 7,
      "body": "Not good enough for a corn syrup and milk vendor",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh46x6i/",
      "created": 1723128774,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh4850w",
      "score": 4,
      "body": "Earnings report is for the past.\nThe market is forward looking - so something that was said during the call tipped the market off.\n\nEarnings itself dont push the stock, as it is priced in and expected. What comes in the next weeks/months is what drives stock up or down",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4850w/",
      "created": 1723129157,
      "depth": 0,
      "replies": [
        {
          "id": "lh5yaif",
          "score": 1,
          "body": "Fair, I'll be honest I never looked through the earnings transcript figuring anything big will be reported on, but maybe I should make a deep dive.",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh5yaif/",
          "created": 1723148083,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh4923y",
      "score": 5,
      "body": "Elon tweeted his imaginary robo taxis won't need coffee, market followed their ringmaster",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4923y/",
      "created": 1723129448,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh55r0y",
      "score": 3,
      "body": "I expect more and so did Nana. \n\n\nNana sends her regards BROS",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh55r0y/",
      "created": 1723139459,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh5ebea",
      "score": 4,
      "body": "Yeah, read the earnings transcript. The ceo doesn’t have a clue as to what will happen in the future. Doesn’t know how the stores will make more revenue than they do have now.  Wait till it hits below 20",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh5ebea/",
      "created": 1723142054,
      "depth": 0,
      "replies": [
        {
          "id": "lh5yh43",
          "score": 1,
          "body": "Ouch, should have paid more attention to that - thanks!",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh5yh43/",
          "created": 1723148138,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lh7kl6e",
          "score": 1,
          "body": "Yes thanks got a link to that transcript you can share ?",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh7kl6e/",
          "created": 1723168381,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh41psb",
      "score": 3,
      "body": "Short term voting machine, long term weighing machine. Disappointed forecasters who wanted more, cascading longs liquidated (unconfirmed)? I think it’s a good case to be a value now.",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh41psb/",
      "created": 1723127116,
      "depth": 0,
      "replies": [
        {
          "id": "lh44396",
          "score": 2,
          "body": "Fair enough, cascading longs/panic instigated by the liquidation of a large position does seem the most plausible scenario.",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh44396/",
          "created": 1723127878,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh49rdd",
      "score": 3,
      "body": "They pissed off the analyst by not answering certain questions. On top of that they seemed a little clueless in the q and a.",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh49rdd/",
      "created": 1723129668,
      "depth": 0,
      "replies": [
        {
          "id": "lh5ycbx",
          "score": 2,
          "body": "Thanks, good to know!",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh5ycbx/",
          "created": 1723148098,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh4vmab",
      "score": 3,
      "body": "BROS typically dumps on earnings. I used to buy $3-5k worth of ITM puts right before earnings for them and I’d eat every time. Wish I’d remembered to this time lol",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4vmab/",
      "created": 1723136394,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh40dr6",
      "score": 6,
      "body": "They are overvalued, simple as that.",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh40dr6/",
      "created": 1723126681,
      "depth": 0,
      "replies": [
        {
          "id": "lh41iwa",
          "score": 3,
          "body": "Debateable, but even if they are, they were over-valued before earnings and the earnings before that. Wouldn't justify the huge drop.",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh41iwa/",
          "created": 1723127054,
          "depth": 1,
          "replies": [
            {
              "id": "lh4f08f",
              "score": 3,
              "body": "They were way overvalued in a bull market like never seen before. Now they are way over valued in a market that's super jittery. 209 PE is too much especially in this economical climate and this particular stock market climate. The earnings fell at a wrong time. Simple as that. If indexes recover, BROS will too in no time. But if we continue drilling... It will take time. It's not the company the problem. It's the climate that changed.",
              "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4f08f/",
              "created": 1723131307,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lh44kd1",
              "score": 1,
              "body": "They trade at higher forward pe than Nvidia or Apple.  \n\n\nYou really think this coffee shop stonk will produce more revenue growth than tech?  It's obviously over valued.  They need to post double digit QoQ sales/revenue growth not anemic 4% yearly to justify even the current valuation.",
              "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh44kd1/",
              "created": 1723128028,
              "depth": 2,
              "replies": [
                {
                  "id": "lh45pi2",
                  "score": 3,
                  "body": "As I mentioned in an earlier post, you can't judge a young company on their PE Ratio.\n\nAdditionally, I think you're misreading one of the bullet points. Sales have increased in existing shops by an additional 4%, overall revenue though has increased approx. 30% YoY.\n\nMy fault, I'll edit to show YoY rev increase.",
                  "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh45pi2/",
                  "created": 1723128392,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lh479mj",
                      "score": 3,
                      "body": "Ill buy a few September 30 calls see if you're right ",
                      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh479mj/",
                      "created": 1723128884,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lh5y2ix",
                          "score": 1,
                          "body": "Good luck!",
                          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh5y2ix/",
                          "created": 1723148019,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lh6aeei",
                              "score": 2,
                              "body": "You can still judge a young company on their PE ratio, sort of.  But it is only the front end inputs of a discounted cash flow model.  In such model you can input your expectations for growth over the next 5-10 years and get a present day stock price. You can update these numbers after every earnings. That is essentially what the insider guy probably  did after slowed growth this earnings and probably no future guidance that growth would pick back up, and his model told him it was time to sell a bunch.\n\nFrom what I understand, they plan to open around 4000 stores eventually and are a quarter of the way there.  Their current PE is 150ish.  A mature company that is done growing ideally has a 10-15 PE.  That means you are expecting them to, within 5 years or so, 12x or more their earnings while just 4-5x their revenue.  Is that possible? I don't know, but smells overvalued to me.",
                              "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh6aeei/",
                              "created": 1723151727,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lhjkze5",
                              "score": 1,
                              "body": "So you won't respond to my comment?  Cmon I spent like 5 minutes typing it up.",
                              "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lhjkze5/",
                              "created": 1723350702,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lhtp35q",
                                  "score": 1,
                                  "body": "Since he didn’t respond I will…I don’t realistily think 12x earnings in 5 years is realistic….or ever really if the price of beans and milk doesn’t go sideways or drop..however I could see revenue increase 20 fold, or more specifically “PROFIT”. If they achieve 4000 stands in the next 8-10 years and stop investing all profits into expansion I could see a huge explosion in profit. I’m septical about their real estate tho..I work at dutch bros and wonder why don’t lease these shits? They have cash commercial real estate is low why don’t they just fucking buy them",
                                  "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lhtp35q/",
                                  "created": 1723503970,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lhut8f2",
                                      "score": 1,
                                      "body": "Not sure how they could increase revenue 20 fold. With 4k additional stores, each store (present and future) would have go over double current sales.",
                                      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lhut8f2/",
                                      "created": 1723519213,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lh46byl",
      "score": 2,
      "body": "What did they say on the earnings call?",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh46byl/",
      "created": 1723128590,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh4e7mb",
      "score": 2,
      "body": "Ran late because I was in line at DB with 2 cars in front of me and somehow got stuck there for 10-15 minutes because they kept yapping. \n\nPuts",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4e7mb/",
      "created": 1723131061,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh815f4",
      "score": 2,
      "body": "They really need better drive through options. The order ahead is decent. One caveat around me is they mostly hire young attractive people. Not your typical barista.",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh815f4/",
      "created": 1723175294,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhd238s",
      "score": 2,
      "body": "“ Dutch Bros’s stock price is down after investors flagged two metrics in the company’s 2Q results as causes for concern. First, the coffee chain reiterated its outlook for low single digit comps, “and that implies flattish-to-down comps in the back half of the year,” says Sharon Zackfia, an analyst at William Blair. “Wall Street is skittish, and decelerating comps set people on edge.” Second, Dutch Bros expects to hit the low end of its new store guidance this year, due to a new real estate strategy. However, Zackfia says these metrics don’t need to cause so much worry: “It’s a lot of angst, in my opinion, about a company that’s executing incredibly well.” -https://www.tradingview.com/news/DJN_DN20240808013321:0/",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lhd238s/",
      "created": 1723248478,
      "depth": 0,
      "replies": [
        {
          "id": "lhd2anw",
          "score": 2,
          "body": "I think they’re basically confirming that theres a slower growth. So its still growing, but not growing like how it was before. Much like AIRBNB saying its still growing, but theres consumer slow down.",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lhd2anw/",
          "created": 1723248556,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhojbwo",
      "score": 2,
      "body": "I loaded up.  This is once sleeper of a deep fucking value",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lhojbwo/",
      "created": 1723427032,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh56bz9",
      "score": 1,
      "body": "I visited a Dutch Bros. once. It was terrible. Not sure why anyone likes their drinks.",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh56bz9/",
      "created": 1723139635,
      "depth": 0,
      "replies": [
        {
          "id": "lhtpoyv",
          "score": 1,
          "body": "Did you talk to the barista or just order a random drink? lol you can order 1/4 sweet, 1/2 sweet, 3/4 sweet, half of coffee flavors are also offered in sugar free which half of redditors apparently don’t know…has anyone who shits on Dutch bros talked to someone who works there? You can literally customize a drink in any way imaginable, Starbucks could and would never",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lhtpoyv/",
          "created": 1723504185,
          "depth": 1,
          "replies": [
            {
              "id": "lhurwnn",
              "score": 1,
              "body": "It was at a drive through location. Honestly the line was insane, but I did ask the attendant who offered a few recommendations. My wife and I ordered separate ones based off their recs and we both thought it was overly sweet and not that good. \n\nNot sure if it was that specific location. But we weren't keen on trying it again as everything was just syrup.",
              "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lhurwnn/",
              "created": 1723518644,
              "depth": 2,
              "replies": [
                {
                  "id": "lhyn5ri",
                  "score": 1,
                  "body": "We use 1 tea soon (fl oz) of syrup or sauce depending on the drink flavor…one scoop…Starbucks is where you get 4,6,8 pumps of shit on your drink. I think you have it confused. And once again you can order a quarter sweet (quarter scoop) or half sweet without a worker looking at your sideways",
                  "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lhyn5ri/",
                  "created": 1723578598,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhyoixb",
                      "score": 1,
                      "body": "I have nothing confused. When did I mention Starbucks in my post?",
                      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lhyoixb/",
                      "created": 1723579022,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lh5i171",
      "score": 1,
      "body": "not good ENOUGH!",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh5i171/",
      "created": 1723143170,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh6ljq8",
      "score": 1,
      "body": "PE 200",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh6ljq8/",
      "created": 1723155418,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh82p5a",
      "score": 1,
      "body": "Would you like to leave a tip?",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh82p5a/",
      "created": 1723176015,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh8ajuv",
      "score": 1,
      "body": "Less profitable to be selling coffee these days. It is expensive to keep up with global inflation rates ☕",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh8ajuv/",
      "created": 1723179990,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh8e0bs",
      "score": 1,
      "body": "If you look at the chart it has no levels of support only gap ups so when a sell off begins it started a landslide with landing around the 27 dollar mark",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh8e0bs/",
      "created": 1723181931,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh8f55m",
      "score": 1,
      "body": "500 PE",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh8f55m/",
      "created": 1723182582,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhf1vpb",
      "score": 1,
      "body": "I have 15 coffee choices within 4 miles of my house.",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lhf1vpb/",
      "created": 1723286172,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhoosqo",
      "score": 1,
      "body": "It’s a sketchy company. Look at their company structure. Insider sell out big.",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lhoosqo/",
      "created": 1723429277,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh4fi61",
      "score": 1,
      "body": "Projected earnings and current forward PE. Overvalued. Their PE ratio is like 150 for christs sake.",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh4fi61/",
      "created": 1723131458,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh416oc",
      "score": 0,
      "body": "investors are rational that is why",
      "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh416oc/",
      "created": 1723126944,
      "depth": 0,
      "replies": [
        {
          "id": "lh43r2g",
          "score": 4,
          "body": "I... have often seen the opposite, but if you can expand on that I'd be interested in what you have to say.",
          "permalink": "/r/wallstreetbets/comments/1en6u41/am_i_missing_something_about_dutch_bros/lh43r2g/",
          "created": 1723127770,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}