{
  "title": "Paramount Global reports streaming profit for first time ever as shares rise ",
  "score": 68,
  "selftext": "Paramount Global is cutting 15% of its U.S. workforce, part of a broader cost-cutting plan as it prepares for a merger with Skydance Media.\n\nParamount has identified $500 million in cost savings, which include the head count reductions, as part of $2 billion in synergies related to its transaction with Skydance. The job cuts will affect the company’s marketing and communications department, as well as employees who work in finance, legal, technology, and other support functions, the company said during its earnings conference call Thursday.\n\nParamount agreed to a merger with Skydance Media last month. That deal includes a 45-day go-shop period — in which a special committee of Paramount’s board could find another buyer — that concludes later this month.\n\nEarnings surged as the company’s streaming division swung to an unexpected profit — the first time Paramount has announced a profitable quarter for its direct-to-consumer business.\n\nShares climbed more than 5% in after-hours trading Thursday.\n\nHere’s how Paramount performed in the quarter compared with what Wall Street was expecting, based on a survey of analysts by LSEG:\n\nEarnings per share: 54 cents adjusted vs. 12 cents expected\n\nRevenue: $6.81 billion vs. $7.21 billion expected\nRevenue falls\n\nSecond-quarter revenue dropped 11% and missed analyst estimates as licensing, TV advertising and cable subscription sales dropped.\n\nThe revenue drop was the largest miss compared to analyst estimates since February 2020, according to LSEG data. Paramount attributed the miss to a decline in TV licensing revenue, which can be difficult for analysts to model given their start and end dates.\n\nParamount+ revenue grew 46% on year-over-year subscriber growth and higher prices. Paramount+ customers decreased 2.8 million from last quarter to 68 million as the company unwound a Korean partnership deal with entertainment company CJ ENM’s Tving streaming platform.\n\nParamount’s streaming division turned a profit for the quarter of $26 million after losing $424 million a year ago. Analysts had estimated a loss of $265 million this quarter.\n\nParamount reaffirmed it’s on track to reach U.S. profitability for Paramount+ in 2025. The streaming service has raised prices and cut content spend.\n\nParamount’s quarterly profit is helped by not having an NFL licensing charge for the period, which will kick in later in the year.\n\nShares have slumped 31% so far this year amid declines among cable subscribers and a soft linear TV advertising market.\n\nParamount also took a $6 billion one-time impairment charge associated with the decline in its cable networks. It comes on the heels of a $9.1 billion write-down from peer Warner Bros. Discovery on Wednesday.\n\nThe company had to take the charge as an adjustment forced by its transaction with Skydance.\n\nSource: https://www.cnbc.com/2024/08/08/paramount-global-para-q2-earnings-report-2024.html",
  "link_flair_text": null,
  "id": "1engz63",
  "num_comments": 5,
  "created_utc": 1723150261,
  "permalink": "/r/stocks/comments/1engz63/paramount_global_reports_streaming_profit_for/",
  "comments": [
    {
      "id": "lh6ay5m",
      "score": 10,
      "body": "Fucked my puts so far but still pretty shit earnings overall so Im confident in a markets hours sharp drop",
      "permalink": "/r/stocks/comments/1engz63/paramount_global_reports_streaming_profit_for/lh6ay5m/",
      "created": 1723151901,
      "depth": 0,
      "replies": [
        {
          "id": "lh6e1ls",
          "score": 14,
          "body": "I’m long at $14 per share. \n\nLet’s just say Shari Redstone bent me (Warren Buffett, John Roger’s, Mario Gabellie, etc) over, diluted my ass, and had Skydance bust a $6 Billion goodwill impairment charge on my face. \n\nI’m never investing in a media company ever again,  the actors, the agents, the directors, the investors, the management… they’re all fucking lunatics",
          "permalink": "/r/stocks/comments/1engz63/paramount_global_reports_streaming_profit_for/lh6e1ls/",
          "created": 1723152900,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhewuwy",
      "score": 3,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1engz63/paramount_global_reports_streaming_profit_for/lhewuwy/",
      "created": 1723282801,
      "depth": 0,
      "replies": [
        {
          "id": "lhktkmf",
          "score": 1,
          "body": "It’s only profitable due to the weird timing of when the NFL expenses are accounted for this time\n\nThe streaming service is going to go back in the red for the next few quarters and will be consistently profitable (domestically) probably in late 2025 after one more price hike. \n\nThey will also probably add a few million Charter subs to offset backing out for Korea. \n\nI’d be happy if it weren’t for this dilution effectively raisin my cost basis",
          "permalink": "/r/stocks/comments/1engz63/paramount_global_reports_streaming_profit_for/lhktkmf/",
          "created": 1723378325,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh7utyf",
      "score": 1,
      "body": "I like how they soar and Disney tanks when Disney did the same thing",
      "permalink": "/r/stocks/comments/1engz63/paramount_global_reports_streaming_profit_for/lh7utyf/",
      "created": 1723172506,
      "depth": 0,
      "replies": []
    }
  ]
}