{
  "title": "Does LLY Crushing Earning's Help HIMS?",
  "score": 67,
  "selftext": "LLY up 10% on the day after crushing earning's, still richly valued but phenomenal long term hold it's panning out with 15 year CAGR at 23.6% and 10 year at 29.8%.\n\nHIMS crushed earning's as well, subscription based companies in this day and age with such high retention and growing members it's looking like it has a very promising future.\n\nI read when opex happens on Friday, HIMS should start to recover. My question for those who know more about these weight loss drugs, does LLY crushing earning's speak positively of HIMS weight loss future and possibly underpriced right now?",
  "link_flair_text": null,
  "id": "1enkfp1",
  "num_comments": 49,
  "created_utc": 1723159107,
  "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/",
  "comments": [
    {
      "id": "lh72dw3",
      "score": 126,
      "body": "90% of people who talk about HIMS on reddit don't understand HIMS. HIMS is not about GLP-1 or any other rival weight loss drug. HIMS is about disrupting the archaic insurance based health care industry in the US. It is a platform for easy, personalized and discreet access to generic medication with an incredible brand. It will be the Netflix of pharma.",
      "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh72dw3/",
      "created": 1723161441,
      "depth": 0,
      "replies": [
        {
          "id": "lh7h445",
          "score": 37,
          "body": "HIMS fills the weight loss, cosmetic, and sexual health drug gap created by health insurance companies generally excluding those conditions. \n\nIt’s a Pharma disruptor more than anything else.",
          "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7h445/",
          "created": 1723167047,
          "depth": 1,
          "replies": [
            {
              "id": "lh7hzin",
              "score": 5,
              "body": "Indeed. I can see them moving into other more and more catagories in the future though.",
              "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7hzin/",
              "created": 1723167385,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lh8n566",
              "score": 5,
              "body": "It’s its own segment. The companies themselves refer to this category as “confidence building meds” and they know many people are less likely to talk to someone about it face to face and these meds are relatively safe to prescribe with very little clinical interaction online so they’re there taking the money that’s on the table.",
              "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh8n566/",
              "created": 1723187468,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lh8op3o",
              "score": 5,
              "body": "I wonder if they’ll start getting into more off-label use, say Metformin. Currently insurance only covers it for diabetics, even though it reduces cancer, cardiovascular and dementia rates, and it’s a putative life-extension drug. \n\nhttps://www.health.harvard.edu/blog/is-metformin-a-wonder-drug-202109222605",
              "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh8op3o/",
              "created": 1723188474,
              "depth": 2,
              "replies": [
                {
                  "id": "lh9rqak",
                  "score": 4,
                  "body": "They have metformin already in their non glp-1 weight loss plan",
                  "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh9rqak/",
                  "created": 1723209464,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lh72rvq",
          "score": 9,
          "body": "I have around 3k shares. I sure hope you’re right.",
          "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh72rvq/",
          "created": 1723161588,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lh73f3s",
          "score": 9,
          "body": "Marketing costs are incredibly high.",
          "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh73f3s/",
          "created": 1723161835,
          "depth": 1,
          "replies": [
            {
              "id": "lh73qak",
              "score": 21,
              "body": "How do you expect them to grow 40% yoy without marketing while still being a small company that few have heard of? Who is gonna tell their peers that they got ED but fixed it with pills from HIMS?",
              "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh73qak/",
              "created": 1723161952,
              "depth": 2,
              "replies": [
                {
                  "id": "lh79pe9",
                  "score": -8,
                  "body": "You said it yourself that they had an “incredible brand”. If that was the case then everyone would already know them and use them if they had issues. I like the company but you cannot argue that their marketing costs are high and the return on that spend is not what it used to be.",
                  "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh79pe9/",
                  "created": 1723164226,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lh7b242",
                      "score": 10,
                      "body": "Their retention is over 90%, their gross margins over 80%. They are leagues ahead in presentation when it comes to their competition. I don't know what to tell you. If your requirement for a good brand is simply the number of people familiar with them, you must think Crowdstrike and Boeing have a good brands.",
                      "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7b242/",
                      "created": 1723164732,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lh7bs4p",
                          "score": -5,
                          "body": "Read the fine print on their retention definition and get back to me",
                          "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7bs4p/",
                          "created": 1723165004,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lh7dsbz",
                              "score": 3,
                              "body": "2 Years+. What is your point? Do you aim to compare this to the retention definition for some trivial service?",
                              "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7dsbz/",
                              "created": 1723165765,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lh7genw",
                                  "score": -8,
                                  "body": "Lol are you able to see risks associated with the business? 85% retention after two years. Means the business is not as sticky and their churn is incredible.",
                                  "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7genw/",
                                  "created": 1723166776,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lh7hj37",
                                      "score": 7,
                                      "body": "I'm afraid I only see your ignorance of the business.",
                                      "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7hj37/",
                                      "created": 1723167208,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lh8ikry",
              "score": 1,
              "body": "While I do agree that the marketing expense is high, they are making progress on this metric. \n“Marketing as a percentage of revenue improved nearly six points year over year to 46%, marking the lowest point in our history as a public company.”",
              "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh8ikry/",
              "created": 1723184616,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lh8ln5r",
          "score": 2,
          "body": "Until Lilly and Novo can cover the demand, Hims is allowed to sell glp 1 generics so it’s also part of their story\n\nhttps://investors.hims.com/news/news-details/2024/Hims--Hers-Announces-Access-to-GLP-1-Injections-Passing-Cost-Savings-Onto-Customers/default.aspx",
          "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh8ln5r/",
          "created": 1723186524,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lh7b3v9",
          "score": 4,
          "body": "The premium baked in is due to hope regarding GLP-1.  That’s risky due to their sourcing and work around for regulatory… which will close.\n\nIn therms of “disruptive innovation” they are pretty far behind several other private companies.",
          "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7b3v9/",
          "created": 1723164750,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lh74jqb",
          "score": 4,
          "body": "Do you really believe that?",
          "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh74jqb/",
          "created": 1723162259,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lh7fbya",
          "score": 3,
          "body": "Or ends up collapsing like that smile direct company.",
          "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7fbya/",
          "created": 1723166359,
          "depth": 1,
          "replies": [
            {
              "id": "lh7fz8n",
              "score": 1,
              "body": "Do you think it makes sense to compare the maker of a niche medical product that sold the product through online consultations to HIMS?",
              "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7fz8n/",
              "created": 1723166608,
              "depth": 2,
              "replies": [
                {
                  "id": "lh8lz12",
                  "score": 4,
                  "body": "On paper it’s pretty much the same. What Hims is selling are generics so nothing niche about that. The main difference is that Hims is already profitable, so their business model seems to work.",
                  "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh8lz12/",
                  "created": 1723186728,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lh7g7tw",
                  "score": -3,
                  "body": "[removed]",
                  "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7g7tw/",
                  "created": 1723166702,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lh7gzqn",
                      "score": 2,
                      "body": "Maybe you don't have an argument?",
                      "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7gzqn/",
                      "created": 1723167002,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lh75tjp",
          "score": 1,
          "body": "Easy access to medications is something very unpopular among politicians. There is a big risk from regulators and politicians. \n\n\nThe DEA already wants to limit it \n\nhttps://www.nytimes.com/2023/04/05/well/mind/telehealth-prescription-medication.html\n\n\nIn Canada Trudeau wants to eliminate it.",
          "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh75tjp/",
          "created": 1723162747,
          "depth": 1,
          "replies": [
            {
              "id": "lh76txn",
              "score": 10,
              "body": "Yes Big Pharma does not want to innovate or share profits. I guess this is kind of a risk. However, I would not bet against innovation in the long run. Even if some tighter restrictions would come into play I would not be overly concerned as HIMS does employ doctors to prescribe the medications and for consultations. HIMS is not generic drug buffeet, contrary to what some on this site might believe. In the far future we will be moving to AI doctors anyway for perscriptions, but that is not necessarily part of the HIMS thesis. The main point is the insurance-free access.",
              "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh76txn/",
              "created": 1723163131,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lh78m4w",
              "score": 4,
              "body": "Well Trudeau's a cock sucker, so anything that guy wants is definitely not what anyone else should do",
              "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh78m4w/",
              "created": 1723163814,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lh74ll3",
          "score": 0,
          "body": "Right but GLP-1 gets more people onto the platform and getting more bang for the buck they're putting into CAC",
          "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh74ll3/",
          "created": 1723162278,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh7kgmx",
      "score": 17,
      "body": "Maybe, but probably not. GLP-1 drugs are patent protected when not in shortage. They are currently in shortage, so HIMS can use a compounding pharmacy to make and sell Semaglutide. \n\nSo HIMS gets to exploit a temporary GLP-1 shortage.  While Lily reported great results, Novo Nordisk missed and said there were new margin pressures. I think this is more about Lilly outperforming Novo than a larger market that may extend HIMS’ allowed time in the market.",
      "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7kgmx/",
      "created": 1723168332,
      "depth": 0,
      "replies": [
        {
          "id": "lh7osvr",
          "score": 4,
          "body": "I was curious how long they could do it - but lily came off shortage this week and novo's is not too far behind.\n\nhttps://www.everydayhealth.com/weight/glp-1-drug-shortages-may-finally-be-easing-but-access-issues-persist/#:\\~:text=Meanwhile%2C%20semaglutide%20%E2%80%94%20the%20main%20ingredient,the%20weight%20loss%20drug%20Wegovy.",
          "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7osvr/",
          "created": 1723170034,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh8qq19",
      "score": 14,
      "body": "There seems to be a lot of confusion about Hims and GLP-1s and what Hims will do regarding GLP-1s in the future. Let me try to clear up a few things:\n\nFirstly, Hims started offering GLP-1s (Semaglutide) on May 20, 2024. They recorded approximately $16 million in sales between May 20 and June 30 that were included in their second quarter earnings. \n\nTo date, Hims has not yet offered Tirzepatide, which is the active ingredient in Zepbound and Mounjaro, which are both manufactured by Eli Lilly. \n\nWhat Hims is currently offering is a compounded version of Semaglutide, which is the active ingredient in Wegovy and Ozempic, which are both manufactured by Novo Nordisk. \n\nLast week all doses of Tirzepatide are no longer on shortage according to both Eli Lilly and the FDA website. \n\nThis week all but one dose size of Semaglutide (Wegovy 0.25 milligram) are no longer on shortage according to both Novo Nordisk and the FDA website. \n\nSo what happens now…\n\nHims made it clear on their earnings call this week that they are going to remain in the GLP-1 business even after these drugs are removed from the FDA shortage list. \n\nDirect quotes from CEO Andrew Dudum on the call:\n\n“The compounding and customization operates regardless of shortage. This is an exemption for which we operate the entire business under and we have for the last six or seven years and there is really an established precedent.”\n\n“The short answer is that the compounding exemption is relatively clear and theres been decades of established precedent with regards to what qualifies as personalized.”\n\n“There is really established precedents with regard to the compounding exemption which allows for this level of personalization.”\n\nWhat he is basically saying is that Hims can continue to sell these compounded GLP-1s as long as they are customized/personalized to the customer in a way that Eli Lilly and Novo Nordisk do not offer. \n\nThey are so confident in this that they announced they are acquiring an FDA registered 503B compounding facility located in the U.S. for approximately $31 million.  They are going to use this sterile facility to manufacture GLP-1s as well as introduce new product categories such as hormone therapy. \n\nThey plan on offering both Semaglutide AND Tirzepatide (again as long as they are personalized). They are also going to offer Liraglutide which is coming off patent in a couple of months. It’s not as effective as the others but it still works to a degree and will not need to be personalized to the customer since it will no longer be patent protected. \n\nThey will also offer the branded versions once supply becomes available. Although since Hims does not take insurance and these can be over $1,000 a month I’m not sure how many customers will actually buy them from Hims. \n\nObviously there is a ton of hype around the GLP-1s but don’t forget about the weight loss kits (oral pills) that Hims launched at the end of 2023 that already has a run rate of over $100 million in sales which is the fastest category launch in Hims history to reach that milestone. \n\nThere are over 100 million people who struggle with weight loss in the U.S., Hims is going to do everything that it can to reach as many of them as possible.",
      "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh8qq19/",
      "created": 1723189813,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh7cpwc",
      "score": 18,
      "body": "I’m pretty bullish on HIMS, was buying way store they announced GLP-1 original cost basis in the mid $6s.\n\n\n\nLLY doing well can be bullish in that it proves people really want GLP-1, like everyone I know who is even a little overweight is trying to get it and HIMS now offers it. But the negative here is that if LLY can prove it can meet the demand then the government can’t declare GLP-1 has a shortage, the shortage is what allows HIMS to produce and sell it. Once the shortage is over then the copyright kicks in again and HIMS will have to stop producing and selling, unless LLY or whatever company allows them to. \n\n\n\n\n\nLLY says the shortage will end at the end of 2024. I’m not totally convinced it will be since once the “shortage” ends then they’ll have to meet all the demand HIMS and other companies had and then the shortage will come back. It takes a long time to ramp up production and meet a near endless demand. But because it’s possible that the shortage ends I don’t want to put too much weight on GLP-1 for hims. \n\n\n\n\nHIMS most recent earnings didn’t include any GLP-1 sales and they still had insane growth and that is why I was originally bullish and why im still bullish.",
      "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7cpwc/",
      "created": 1723165357,
      "depth": 0,
      "replies": [
        {
          "id": "lh7f5vk",
          "score": 7,
          "body": "Now we're getting somewhere, so HIMS is only allowed to sell this medication meanwhile LLY has a shortage? That's not good so if demand is met 2025 than other companies have to pullback? LLY created the medication, holds the patent or copyright, while it's in short supply gov allows others to sell it but then copyright kicks back in. That seems why HIMS selling off, the product line is not a secure long term thing for them?",
          "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7f5vk/",
          "created": 1723166294,
          "depth": 1,
          "replies": [
            {
              "id": "lh7puqg",
              "score": 7,
              "body": "they are only allowed to have their compounder produce it while the FDA has it on a drug shortages list.\n\nOnce the manufacturer alleviates their shortage issue, the compounder is no longer supposed to produce it.\n\n[https://en.wikipedia.org/wiki/Drug\\_Quality\\_and\\_Security\\_Act](https://en.wikipedia.org/wiki/Drug_Quality_and_Security_Act)\n\n[https://www.fda.gov/drugs/human-drug-compounding/drug-compounding-and-drug-shortages](https://www.fda.gov/drugs/human-drug-compounding/drug-compounding-and-drug-shortages)\n\n[https://www.fda.gov/drugs/drug-safety-and-availability/drug-shortages](https://www.fda.gov/drugs/drug-safety-and-availability/drug-shortages)\n\n[https://www.accessdata.fda.gov/scripts/drugshortages/dsp\\_ActiveIngredientDetails.cfm?AI=Tirzepatide%20Injection&st=c](https://www.accessdata.fda.gov/scripts/drugshortages/dsp_ActiveIngredientDetails.cfm?AI=Tirzepatide%20Injection&st=c)\n\n  \n[https://www.accessdata.fda.gov/scripts/drugshortages/dsp\\_ActiveIngredientDetails.cfm?AI=Semaglutide%20Injection&st=c&tab=tabs-1](https://www.accessdata.fda.gov/scripts/drugshortages/dsp_ActiveIngredientDetails.cfm?AI=Semaglutide%20Injection&st=c&tab=tabs-1)",
              "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7puqg/",
              "created": 1723170454,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lh7ibw9",
              "score": 1,
              "body": "Pretty much my understanding of it. Some sort of “compounding” process that HIMS can do to make GLP-1s during the shortage. This is also a very cheap way to make GLP-1 and why HIMS can sell it for 1/7th-1/10th the price LLY does. They talked about it on the Q2 earnings call, HIMS is actually acquiring a level 2(? I think) compounding facility so they can make the medication themselves and not a third party. I’m sure the facility will be useful for other medications too. \n\n\n\nCurrently they have a couple level 1(? Again not sure this is off the top of my head) compounding facility where they make most of their drugs, but it isn’t clean enough or something for GLP-1s.\n\n\n\n\nBut yeah pretty much at any point the shortage can end and they have to stop producing GLP-1. Sure will definitely impact potential growth, but I don’t think it’ll change the current growth/trajectory since we haven’t seen the impact of GLP1 being added. In Q2 they had 52% revenue growth and 43% subscriber growth. I’m sure Q3 and Q4 will be much more impressive bc GLP1 will officially be added, but who knows if they’ll retain those subscribers and I’m almost certain once the shortage is over that level of growth comes to a halt. Still probably in the high 30s to mid 40s% growth.",
              "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7ibw9/",
              "created": 1723167519,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lh7o5a5",
      "score": 6,
      "body": "Who’s to say Lilly won’t partner up with HIMS?  Telehealth is  the future. Some people don’t like going to Dr. offices to get on a scale and shamed. Weigh watchers was smart to get on the GLP-1 train. It is the only way they can survive now.  HIMS is only in UK and US.  The potential for growth is crazy good. They are loosing $ now yes, but the trajectory in the next few years looks good.",
      "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7o5a5/",
      "created": 1723169771,
      "depth": 0,
      "replies": [
        {
          "id": "lhdxpyq",
          "score": 2,
          "body": "Y would Lilly partner with HIMS when there is a higher demand than a supply and loose money on their drug? Lilly is going direct to consumer and cutting out companies like HIMS",
          "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lhdxpyq/",
          "created": 1723261646,
          "depth": 1,
          "replies": [
            {
              "id": "lhid43c",
              "score": 1,
              "body": "Direct to doctors who have to write the prescriptions.  OL healthcare is much easier for people to get a prescription of Zepbound.  I know tons of people who state their regular GP is against the meds.  Lilly already goes through WW.  Why would they not with HIMS?",
              "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lhid43c/",
              "created": 1723331742,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lh9umwf",
      "score": 3,
      "body": "Why would u invest in HIMS instead of LLY or NVO is beyond me.\n\nHaving said this, not only it doesnt help, it will tank hims.",
      "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh9umwf/",
      "created": 1723210525,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh8ff0s",
      "score": 1,
      "body": "Probably not for a while. Yes, HIMS can prescribe GLP-1 drugs but LLY ([analysis](https://borncrisis.com/blog/eli-lilly-stock-predictions-2025-why-you-should-sell-lly-stock/)) and HIMS are not particularly correlated",
      "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh8ff0s/",
      "created": 1723182742,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh8umu2",
      "score": 1,
      "body": "LLY strong earnings show positive trends in pharma, but they don't directly affect HIMS's weight loss prospects. From my perspective, HIMS real edge is in shaking up health care access rather than just competing in the weight loss space. Their growth and high retention are impressive, and if they keep innovating and expanding, they’re set up for a bright future.",
      "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh8umu2/",
      "created": 1723192397,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhllbd7",
      "score": 1,
      "body": "So my biggest worry with HIMS is supply of the generic Glp-1s can be limited by LLY and NOVO. Apparently they can sell generic if there’s a shortage but LLY is building a huge factory just for GLP-1s so what happens when shortage ends…",
      "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lhllbd7/",
      "created": 1723389490,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhursef",
      "score": 1,
      "body": "Bullish long term.",
      "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lhursef/",
      "created": 1723518592,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lh6y32l",
      "score": -1,
      "body": "HIMS was up because LLY had problems with production. Copycat pharma is a tricky business.",
      "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh6y32l/",
      "created": 1723159862,
      "depth": 0,
      "replies": [
        {
          "id": "lh7ifar",
          "score": 11,
          "body": "I’m baffled why you’re being downvoted. Distribution during a drug shortage is permitted by the FDA. \n\nOnce the shortage is over, selling the active ingredient as a compounded product HOPING the FDA won’t come down on you isn’t the greatest idea.",
          "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh7ifar/",
          "created": 1723167555,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lh8j3fh",
      "score": -2,
      "body": "This stock is being mentioned everywhere lately. Is this some sort of campaign to overwhelm bots with positive sentiment about it?\n\nIn that case let’s add some keywords: “bad, fail, bear, low margin, debt, bankrupt”",
      "permalink": "/r/stocks/comments/1enkfp1/does_lly_crushing_earnings_help_hims/lh8j3fh/",
      "created": 1723184934,
      "depth": 0,
      "replies": []
    }
  ]
}