{
  "title": "Landbridge ($LB) DD- next TPL?",
  "score": 47,
  "selftext": "\nLandbridge recently IPO’d on June 28th and I think their business model presents an interesting growth opportunity. So who are they? Founded in 2021, Landbridge owns about 220,000 acres of land across Texas and New Mexico in the Permian Basin\n\nWhen I found out LandBridge owns land in the Permian, I immediately thought of the stock $TPL (Texas Pacific Land). TPL also owns land in the region (around 870,000 acres). Over the past decade, TPL has returned 1390%, while the S&P returned 225%. Why has TPL done so well? The Permian Basin is one of the most active regions in the United States for o&g exploration and development. Here’s the thing: companies like TPL/LB don’t actually produce any o&g. They simply own the land and get benefits like surface use rights/royalties, resource sales/royalties, and o&g royalties. Revenue opportunities include: fixed fee payments for using their land, revenue sales for materials used in construction of infrastructure, and any commercial leases. Instead of actually producing o&g, they basically just let others do the job and collect fees for barrels extracted. LB is essentially a mini TPL, since LB owns less land and is much younger.\n\nSo why not just invest in TPL? I mean why not TPL is still a great company, but I think Landbridge has a lot more potential. I’m bullish on several aspects:\n\n- Landbridge recently signed a letter of intent for a ground lease to support construction of a data center. If you’re bullish on the data center/AI story, this is a great sign. There’s potential to sign several more of these deals. (founder seems very bullish on data center hype)\n- Bitcoin mining has been an increasing trend in Texas in recent years. I don’t think you necessarily have to be bullish on crypto. It’s simply exposure to growth in crypto mining. Landbridge currently only has one crypto facility using its land but it still earned $52.2 million from that revenue. \n- LB owns land specifically in the Delaware part of the Permian, which actually sees 4x water production than oil production. Water is essential for the cooling of these data centers and mining facilities, among several other things. The same firm that started Landbridge also owns a company named Waterbridge, who are the ones responsible for the costs related to water infrastructure. Again, Landbridge simply collects royalties for all the use of their land. Waterbridge has a deal with TPL as well. \n- Landbridge has potential exposure to renewables through solar/wind farms\n- In their latest earnings, LB reported 20% YOY growth and has an adjusted EBITDA margin of 90%\n- FCF margin is 60% \n- There’s a potential for a dividend in the future (hinted at it in latest earnings report)\n\nNegatives: \n\n- They have debt, unlike TPL, but that’s not too concerning given their age and they’re also lowering it.\n- They’re pretty difficult to value since they’re so young. Lots of questions about how they’ll handle their future. How aggressively will they continue to pursue these deals? How will they handle their debt? How can they diversify?\n- Since a portion of their revenue comes from o&g production, they do have some exposure to the markets. This correlation can be observed in TPL, however LB has significantly less reliance on o&g revenue to begin with. Again, LB doesn’t actually produce o&g so this exposure is significantly less than an actual oil producer like Exxon or Chevron. However, there would still be a decrease in revenue if o&g demand went significantly down. I’m pretty bullish on energy in general and think o&g demand still hasn’t peaked. \n- Regulations on certain industries could prevent future deals and potential revenue streams. I’m not too concerned given the general deregulated environments in Texas.\n\nTLDR: this company owns thousands of acres in the Permian Basin and its business model allows for multiple revenue streams. Given its youth, there is still massive potential for expansion. \n\nI recently started a small position of 50 shares @ 32 but will look to expand that a lot more.",
  "link_flair_text": "DD",
  "id": "1epp2fy",
  "num_comments": 17,
  "created_utc": 1723394029,
  "permalink": "/r/wallstreetbets/comments/1epp2fy/landbridge_lb_dd_next_tpl/",
  "comments": [
    {
      "id": "lhlyr4b",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 63 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1epp2fy/landbridge_lb_dd_next_tpl/lhlyr4b/",
      "created": 1723394038,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhmz9qn",
      "score": 13,
      "body": "I like that this company is thinking outside the box in ways of utilizing their land.",
      "permalink": "/r/wallstreetbets/comments/1epp2fy/landbridge_lb_dd_next_tpl/lhmz9qn/",
      "created": 1723406426,
      "depth": 0,
      "replies": [
        {
          "id": "lhtxnqc",
          "score": 2,
          "body": "Permian Basin, though.",
          "permalink": "/r/wallstreetbets/comments/1epp2fy/landbridge_lb_dd_next_tpl/lhtxnqc/",
          "created": 1723507062,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhn677g",
      "score": 5,
      "body": "Isn't it important what land they own? If TPL has much better land than that would explain the difference in valuation?",
      "permalink": "/r/wallstreetbets/comments/1epp2fy/landbridge_lb_dd_next_tpl/lhn677g/",
      "created": 1723408746,
      "depth": 0,
      "replies": [
        {
          "id": "lhp4k85",
          "score": 7,
          "body": "Yeah that’s a good point. TPL owns a lot more land (nearly 4x as much) but it’s also way older so it makes sense it would be bigger. TPL was founded in the 1800s and LB was founded in just 2021. So yeah, that explains the major difference in valuation. That’s why I’m curious to see how aggressive LB gets with these deals. They need to keep acquiring more land. \n\nI don’t think “better” land is the case here. Obviously more land for TPL = more oil&gas production, but keep in mind the Permian has a bunch of land that can’t be extracted for natural resources (oil, gas, water). So if TPL isn’t really making use of this empty/useless land, is it really better? To me, LB is looking to diversity a lot more. Exposure to data centers, renewables (solar/wind farms), water infrastructure.. not as reliant on o&g production. Again, TPL is still a great investment on its own",
          "permalink": "/r/wallstreetbets/comments/1epp2fy/landbridge_lb_dd_next_tpl/lhp4k85/",
          "created": 1723436573,
          "depth": 1,
          "replies": [
            {
              "id": "lwd7gd5",
              "score": 1,
              "body": "Landbridge doesn’t produce oil and gas. They have saltwater disposal wells and pipelines , and they take oil and gas companies old frack water and pump it down wells , and transport fluids through pipelines. \n They also have much better land positioning, since the bulk of the exploration and production has moved over by Orla , TX in the Permian. Which is where LB has been buying up assets for a number of years now.\nI own part of an oil and gas service company, and Landbridge (actually named Waterbridge) is one of our main customers. We have worked with them for a number of years. They have been around since before 2021, but they operated under different names .",
              "permalink": "/r/wallstreetbets/comments/1epp2fy/landbridge_lb_dd_next_tpl/lwd7gd5/",
              "created": 1731214217,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lhp4kmv",
      "score": 5,
      "body": "Im not an expert and I probably dont know crap what im gonna say will make sense or is a sound analysis but I took a look at their balance sheet and income statement and their gross margins are like 95+% but their operating profit is -50M, how are these operating selling and admin expenses so much?, their price to sales are also incredibly high above industry standards more than 3x, their BS also reflects an extreme negative cash balance harbouring near 368M long term and 35M short term debt whereas their cash and cash equivalents are only 25M, they also stopped having treasury stock and net profit of negative 50M, and their Q2 earnings EPS was x10 in the wrong direction",
      "permalink": "/r/wallstreetbets/comments/1epp2fy/landbridge_lb_dd_next_tpl/lhp4kmv/",
      "created": 1723436579,
      "depth": 0,
      "replies": [
        {
          "id": "lhp6xhf",
          "score": 3,
          "body": "The net loss was from IPO costs. Yes they do have debt and that was one of the concerns I pointed out, but they’ll need to borrow to acquire more land. They reported they were able to reduce their debt, but they’ll need to be careful managing it moving forward",
          "permalink": "/r/wallstreetbets/comments/1epp2fy/landbridge_lb_dd_next_tpl/lhp6xhf/",
          "created": 1723437832,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lho5kaa",
      "score": 4,
      "body": "Great write up. Texas Pacific LT has def been a good stock. I’d hope LB can replicate that success.",
      "permalink": "/r/wallstreetbets/comments/1epp2fy/landbridge_lb_dd_next_tpl/lho5kaa/",
      "created": 1723421566,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhofx0c",
      "score": 3,
      "body": "Thanks for the post. Was watching this as an upcoming IPO and forgot. Any idea of comparisons, o&g land leases? I know it’s happened across Texas for years, but don’t know if the contractors are a segment of a large energy company or just different private companies ",
      "permalink": "/r/wallstreetbets/comments/1epp2fy/landbridge_lb_dd_next_tpl/lhofx0c/",
      "created": 1723425662,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhpdjc9",
      "score": 2,
      "body": "ghat dayum where was this post when I needed it 2 months ago.",
      "permalink": "/r/wallstreetbets/comments/1epp2fy/landbridge_lb_dd_next_tpl/lhpdjc9/",
      "created": 1723441581,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lw85yns",
      "score": 1,
      "body": "Been holding them since ipo. And have been thinking about doubling my position. Thei q3 confirms that they are purchasing more land. And are starting to get a positive cash flow.\nGood dd btw",
      "permalink": "/r/wallstreetbets/comments/1epp2fy/landbridge_lb_dd_next_tpl/lw85yns/",
      "created": 1731144957,
      "depth": 0,
      "replies": []
    }
  ]
}