{
  "title": "Europe’s Auto Chipmakers Have a Deepening China Habit",
  "score": 70,
  "selftext": "Source: https://www.bloomberg.com/news/articles/2024-08-09/china-s-ev-growth-is-bright-spot-for-chipmakers-infineon-texas-instruments-nxp?leadSource=reddit_wall\n\nFull article:\n\nEurope’s Auto Chipmakers Have a Deepening China Habit\n\nLatest earnings show China’s EV growth as a rare bright spot\nBeijing’s push for tech independence threatens foreign sales\n\nAs advanced semiconductor companies in the US and allied countries pull back from China, a less glamorous sector of the chip market is turning even more to the world’s second-biggest economy.\n\nThis season’s earnings show just how important China is to the largest players in automotive chipmaking at a moment when sales are suffering due to inventory gluts and slowing adoption in the West for electric vehicles, a key driver of demand.\n\nIn the past two weeks, Kurt Sievers, chief executive officer of NXP Semiconductors NV, contrasted weakness in industrial markets in Europe and the Americas with the “staggering growth” of EV sales in China this year. Infineon Technologies AG CEO Jochen Hanebeck said that China’s resilience helped the German chipmaker’s bottom line even as a broader recovery from the EV slump remains elusive. For Texas Instruments Inc., China business is up as much as 20% across all five of its product markets.\n\nDeepening engagement with China could become a double-edged sword for these chipmakers as geopolitical tensions expand into the automotive arena. The European Union and the US have imposed tariffs on Chinese EV imports and Beijing is threatening a response. Now, even supplies of mature, so-called legacy chips are under scrutiny in Washington and Brussels.\n\nUS-China tensions over technology have to date focused on Washington’s efforts to curb Beijing’s access to leading-edge semiconductors and the equipment used to make them. That’s prompted a Chinese push to build out its technological self-sufficiency, notably in automotive chips. Since these don’t depend on the latest manufacturing processes and are largely unaffected by US export controls, there’s little to stop China from ramping up their development, and displacing foreign chipmakers down the line.\n\n“Just as a strong automotive industry in the EU has supported European leaders in automotive chips such as Infineon, NXP and STMicroelectronics, the world-leading expansion of China’s EV industry is boosting development of Chinese vendors of such chips,” researchers John Lee and Jan-Peter Kleinhans wrote in a recent report for the German Council on Foreign Relations. That helps Chinese carmakers become more competitive, “with potentially major impacts for European firms and national economies,” they said. Automotive chips, a market McKinsey forecasts will be worth $150 billion by 2030, is one area of the semiconductor industry where Europe punches above its weight. Its expansion is due to increasingly sophisticated technology that’s turning cars, and especially EVs, into computers on wheels, with climate control, infotainment, self-driving functions and safety features now completely dependent on the tiny electronic components.\n\nChina is both the largest producer and the world’s biggest market for EVs: Shenzhen-based BYD Co. reported deliveries of a record 340,800 passenger vehicles in July, up 31% from the same month last year. Yet Chinese manufacturers mostly rely on foreign companies for the multiple chips that modern high-end cars require, including sensors, power chips for regulating the flow of electricity, and microcontroller units, or MCUs, which are effectively small computers used for functions like braking.\n\nChina’s automotive chipmakers can only meet about 10% of domestic demand at present, according to Lee and Kleinhans. That’s a boon for Infineon, NXP and French-Italian concern STMicroelectronics NV, which each earn about a third of their revenue from China. For Renesas Electronics Corp. of Japan and Texas Instruments, two of the other main players, it’s about 25% and 20%, respectively.\n\nThe Chinese government has asked EV firms such as BYD and Nio to increase their purchases from local auto chipmakers, and most new chip fabrication plants being built in China are for automotive. As a result, the European Commission is raising concerns that its chipmakers are at risk of losing substantial market share in China, Bloomberg News reported in June.\n\nWhile quarterly results are not usually broken down by region, presentations made to investors this season offer some insight into just how critical China is to European chipmakers, especially in the current challenging times: Shares in Tokyo-based Renesas fell the most in more than 15 years on July 25 after its operating profit underwhelmed.\n\nInfineon’s Hanebeck, reporting disappointing third-quarter sales on Aug. 5, cited “tepid” demand in Western markets while singling out China as a bright spot witnessing “healthy consumer demand, which helps us particularly given our No. 1 automotive market position there.” STMicro, while lowering its revenue forecast, sending its stock down the most in four years, stressed the potential upside of a long-term agreement announced in June with China’s Geely Automobile Holdings Ltd. to supply it with silicon carbide power devices for EVs, along with a joint lab “to share knowledge and explore innovative solutions.”\n\nThat follows a joint venture it announced last year with Sanan Optoelectronics for silicon carbide device manufacturing in China. Germany’s Robert Bosch GmbH, another autochip player, meanwhile signed a $1 billion, 10-year contract for the development of silicon-carbide power modules in Suzhou, China. Also last year, Volkswagen AG announced a joint venture with China-based autonomous driving chip developer Horizon Robotics.\n\n“European auto chipmakers appear to be following in the footsteps of German automakers in choosing to deepen partnerships with Chinese entities as an insurance policy in the China market,” Rhodium Group researchers led by Reva Goujon said in a May report.\n\nThe question is whether either the EU or the US is ready to act against China’s capacity to produce its own autochips. In April, the EU-US Trade and Technology Council expressed concerns aimed at China about “non-market economic policies and practices” that may lead to excessive dependencies for legacy chips, saying they may develop “joint or cooperative measures” to address distortionary effects. For Goujon, though, European joint ventures with China — what she calls “entanglements” — make it less likely that countries like Germany “would endorse economic security measures that entail unwinding transactions in China — unless they were already losing significant market share, revenue, and jobs in the Chinese market with little left to lose.”\n\nChipmakers are of course aware of the dangers, but at least in public they have adopted varying degrees of concern. “We all know that Chinese local competition is coming,” starting with “low-end” MCUs, NXP’s Sievers said July 23. His answer is to push his company’s development into higher performance processors.\n\nChina’s attempts to localize its chip supply will “be a slow process given foreign chipmakers still offer quality and reliability,” which are particularly important assets in the automotive market, said Ken Hui, a senior technology analyst with Bloomberg Intelligence. Given that China is adding more chip manufacturing capacity than the rest of the world combined, it may be only a matter of time before it catches up.\n\nTexas Instruments CEO Haviv Ilan certainly sounds far from sanguine about China. While he said July 24 that “we can compete and we can win business,” he acknowledged that competition was growing stronger. “I think it’s a mistake for us to think that these guys are only doing, you know, simple parts,” he said. “These are very ambitious, highly educated competitors.”",
  "link_flair_text": "Industry News",
  "id": "1eprqnl",
  "num_comments": 11,
  "created_utc": 1723400787,
  "permalink": "/r/stocks/comments/1eprqnl/europes_auto_chipmakers_have_a_deepening_china/",
  "comments": [
    {
      "id": "lhmiogc",
      "score": 1,
      "body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1eprqnl/europes_auto_chipmakers_have_a_deepening_china/lhmiogc/",
      "created": 1723400788,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhogt94",
      "score": 12,
      "body": "Time to put tariffs on everything we don’t like and then act shocked when those things end up elsewhere as parts.",
      "permalink": "/r/stocks/comments/1eprqnl/europes_auto_chipmakers_have_a_deepening_china/lhogt94/",
      "created": 1723426019,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhogl2t",
      "score": 6,
      "body": "Nothing new here. Every country will protect their own interests.",
      "permalink": "/r/stocks/comments/1eprqnl/europes_auto_chipmakers_have_a_deepening_china/lhogl2t/",
      "created": 1723425927,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhn8zo4",
      "score": 14,
      "body": "Let China be China on this one and make their own chips. Demand is indeed down in western countries for these chips but will come back eventually.",
      "permalink": "/r/stocks/comments/1eprqnl/europes_auto_chipmakers_have_a_deepening_china/lhn8zo4/",
      "created": 1723409675,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhppcmz",
      "score": 8,
      "body": "1. US starts imposing restrictions on US companies on selling chips to China.  \n  \n2. China says to its own local manufacturers that they need to help domestic production of chips as US is restricting their imports.  \n  \n3. China is a bad guy here.",
      "permalink": "/r/stocks/comments/1eprqnl/europes_auto_chipmakers_have_a_deepening_china/lhppcmz/",
      "created": 1723449235,
      "depth": 0,
      "replies": [
        {
          "id": "lhqqaui",
          "score": 6,
          "body": "And even after they succeed in manufacturing their own domestic chips because no one can sell to them, they get accused of stealing IP.\n\nAs if restrictions were supposed to keep them in the stone age forever.",
          "permalink": "/r/stocks/comments/1eprqnl/europes_auto_chipmakers_have_a_deepening_china/lhqqaui/",
          "created": 1723469341,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhov4sw",
      "score": 2,
      "body": "Many such cases!",
      "permalink": "/r/stocks/comments/1eprqnl/europes_auto_chipmakers_have_a_deepening_china/lhov4sw/",
      "created": 1723432024,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhp9z5d",
      "score": 2,
      "body": "VT and Chill.\n\n\nGimme the money be it USA, Europe or China.",
      "permalink": "/r/stocks/comments/1eprqnl/europes_auto_chipmakers_have_a_deepening_china/lhp9z5d/",
      "created": 1723439512,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhn3kyl",
      "score": 1,
      "body": "This is just china being china . What are real implications. ",
      "permalink": "/r/stocks/comments/1eprqnl/europes_auto_chipmakers_have_a_deepening_china/lhn3kyl/",
      "created": 1723407867,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhmnux7",
      "score": -14,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1eprqnl/europes_auto_chipmakers_have_a_deepening_china/lhmnux7/",
      "created": 1723402549,
      "depth": 0,
      "replies": [
        {
          "id": "lhmwys7",
          "score": 1,
          "body": "Trolling, insults, or harassment, especially in posts requesting advice, is not tolerated.  Please try to keep discussions on /r/stocks civil by providing straightforward responses without including any insults or harassment.\n\nContinual abuse of /r/stocks rule #5 regarding trolling, insulting and harassment will result in your account being banned.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules",
          "permalink": "/r/stocks/comments/1eprqnl/europes_auto_chipmakers_have_a_deepening_china/lhmwys7/",
          "created": 1723405651,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}