{
  "title": "Bank Of Japan Likely To Delay Further Interest Rate Hikes Until 2025, Ex-Official Predicts ",
  "score": 376,
  "selftext": "",
  "link_flair_text": "News",
  "id": "1eqfdw7",
  "num_comments": 121,
  "created_utc": 1723473400,
  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/",
  "url_overridden_by_dest": "https://www.benzinga.com/markets/cryptocurrency/24/08/40310031/bank-of-japan-likely-to-delay-further-interest-rate-hikes-until-2024-ex-official-predicts",
  "comments": [
    {
      "id": "lhr1rfn",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 4 days ago\n**Total Comments** | 25 | **Previous Best DD** | \n**Account Age** | 6 days | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhr1rfn/",
      "created": 1723473402,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhrd35p",
      "score": 117,
      "body": "They already messed up. Never should’ve allow such astronomical carry trade on its currency. Fed rate cut is coming, and Yen will appreciate blowing up more carry trade. This respite is just delaying inevitable pain. US Fed has to cut because the interest income is expanding monetary supply and inflation, and debt burden is unsustainable.",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrd35p/",
      "created": 1723477108,
      "depth": 0,
      "replies": [
        {
          "id": "lhs9zli",
          "score": 36,
          "body": "How does Japan fix the problem though? Japan is in a incredibly bad spot as an economy. Lowering population, lots of debt & island nation needing to import resources. I have not read any actual solution for Japan to get out of their economical hell hole.",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhs9zli/",
          "created": 1723487401,
          "depth": 1,
          "replies": [
            {
              "id": "lhtxzk1",
              "score": 12,
              "body": "They have to either allow high inflation, allow equities to crash, or allow immigration for sustainable population/economic growth. None of these options are tolerable to them.",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhtxzk1/",
              "created": 1723507180,
              "depth": 2,
              "replies": [
                {
                  "id": "lhuz3jj",
                  "score": 7,
                  "body": "Maybe phrase it differently. If they don't do something new, eventually, the only people to carry on Japanese culture will be weebs.",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhuz3jj/",
                  "created": 1723521902,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhvey8m",
                      "score": -5,
                      "body": "Maybe if the weebs spent less time studying the blade and more studying economics, thatd be OK for the japs?",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhvey8m/",
                      "created": 1723530820,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lhscxka",
              "score": 27,
              "body": "Immigration and tourism? Have to fix the demographics somehow. Though, they are not as culturally open as other Asian nations. \n\nTheir major exports ICE autos are becoming increasingly less competitive against Chinese EVs. They will most likely continue to decline.",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhscxka/",
              "created": 1723488321,
              "depth": 2,
              "replies": [
                {
                  "id": "lhtj3pi",
                  "score": 12,
                  "body": "https://www.bbc.com/news/world-asia-63830490\n\n\nfantastic article on Japan and their refusal to accept immigration",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhtj3pi/",
                  "created": 1723501854,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhtpl3d",
                      "score": 2,
                      "body": "Thanks. Interesting read. \n\nContrast Japan against China. Both faced superior western powers. China failed to industrialize and was dominated by others for a century. Both grew rapidly then slowed. Both experienced property bubbles and are in debt crisis. Two of the safest countries with best high speed rails. China is far more accepting of foreigners and foreign cultures though. They were conquered by Mongols and Manchu, said cool, no problem, rule us for hundreds of years.",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhtpl3d/",
                      "created": 1723504148,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lhsyszi",
                  "score": 6,
                  "body": "Is it actually true Japanese people in general are quite xenophobic?",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsyszi/",
                  "created": 1723495105,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lht968y",
                      "score": 25,
                      "body": "Very kind and welcoming to tourists, but if you want to live their you're expected to fit in, not the other way round.\n\n\nJapanese people have to dye their hair black for job interviews, even if it's brown..\n\n\nYou will always be a foreigner if you're not Japanese.",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lht968y/",
                      "created": 1723498437,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lhu2kjd",
                          "score": 8,
                          "body": "Assimilation is key to any immigration. But that's a lil too far",
                          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhu2kjd/",
                          "created": 1723508879,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lhubnh3",
                              "score": 3,
                              "body": "Yeah agreed. Unfortunately you will never be Japanese as a foreigner, even if you have children with a Japanese person, your kids will be bullied at school for being different.\n\n\nYou'll never fit in.\n\n\nAbsolutely beautiful country with beautiful people, and fantastic to visit. But if you choose to stay just know you're signing up for.",
                              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhubnh3/",
                              "created": 1723512271,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lht0rp7",
                      "score": 9,
                      "body": "I think more insular and not interested in multiculturalism than xenophobic. It’s a generalization. But relative to other cultures definitely more insular.",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lht0rp7/",
                      "created": 1723495715,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lht49p0",
                      "score": 4,
                      "body": "Their Xenophobia is assisted by being a geographic island surrounded by cold water and sharks.  \n\nKeeps the uninvited away from their land.",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lht49p0/",
                      "created": 1723496826,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lhvetvk",
              "score": 6,
              "body": "Shout \"fuck it\" and raise rates.\n\nTheir population is in decline because it's basically impossible for young people to climb the wealth ladder anymore. \n\nAll jobs are in Tokyo. Rents are insane, property prices are so-so, but wages never grow. Saving accounts have no purpose because negative rates for a decade, and their domestic market has been stagnant for just as long.\n\nThey might well default on their debt, but shit, it's better to burn it down and start over than watch your population literally go extinct.",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhvetvk/",
              "created": 1723530740,
              "depth": 2,
              "replies": [
                {
                  "id": "lhwlr31",
                  "score": 1,
                  "body": "Defaulting isn't an option. They survive on imports, remember? So if they raise rates, then they'll have to raise taxes. Everyone loves taxes",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhwlr31/",
                  "created": 1723554956,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhwn4vf",
                      "score": 2,
                      "body": "Yes that'll help, drive the economy further into the ground, crush the upward mobility of your people even more. \n\nAll you get from hiked taxes is an acceleration of current trends. \n\nAssuming they can't \"figure something out\" for their import needs, their population is shrinking at an accelerated rate. Eventually they hit equilibrium and no longer need imports. \n\nYou're also forgetting they're a huge exporter of goods, btw. They can take payment in foreign currencies and pay for imports with those. \n\nHell, they can temporarily use an entirely foreign currency to back their economy until they stabilise domestically. Aka, be Argentina. (A bit hyperbolic but ya haha)",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhwn4vf/",
                      "created": 1723555479,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lhu3h2r",
              "score": 2,
              "body": "invent time machine\n\nbitch slap the BoJ president who was there during their housing bubble in 1990",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhu3h2r/",
              "created": 1723509218,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lhxr0ru",
              "score": 3,
              "body": "There is no actual solution to Japan's debt burden.  They are in a debt spiral.  It has been sustained an unusually long time due to the US treasuries war chest (both public and private) they built up during their boom times decades ago.  As this slow moving train wreck plays out, they will start to offload their US treasuries.  Each time the yen drops lower against the USD, selling their treasuries is more attractive.  This won't buy their way out of the debt spiral but it will prop up the boomer wealth so they can live our their last days as the ship goes down.  Eventually they will print the yen into oblivion, at some point no matter how much yield they offer nobody will want it, the yen will fail as a currency, Japan will default on its debt.  The country will experience a prolonged crisis like a post-war time until debts are forgiven and a new cycle can begin.\n\nIt gives me no pleasure to say this.  But it is the end state fiat currencies throughout history.\n\nThe thing to watch will be how much pressure the US puts on Japan to not sell treasuries.  The US treasury market is already not in a great place, the last thing they want is someone to flood the supply side.  US debt hovers around the magic 130% debt-to-gdp ratio, Congressional spending continues to expand the debt while no economic growth miracle is in sight (unless you believe AI, but all AI can do is accelerate wealth inequality).\n\nNevertheless, when Japan does start to offload treasuries the US bond market will enter a crisis and the Fed will be required to step in.  The game will be up.\n\nNew terms will be invented to make it sound complicated, like Collateral Damage was an obfuscation in the Iraq wars, and Quantitative Easing was an obfuscation for money printing in the GFC.  The banks and financially literate people will understand what is happening, and likely find a way to profit from it.  Regular people everywhere will experience a decline in living standards, much like the post-covid inflation surge.  I don't know whether it will be short or long lived, I don't know how severe it will be.  There was a post about a war being used as a coverup.  I am genuinely too scared to look in to that.",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhxr0ru/",
              "created": 1723568468,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lhvuah4",
              "score": 1,
              "body": "They leave rates at 0.1% for a few years then 0.25% for a few years\n\nIt will take decades to slowly normalize rates without blowing that debt pile up",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhvuah4/",
              "created": 1723541083,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lhsmyd0",
              "score": -7,
              "body": "Import other men to increase birth rates because Japanese culture makes their men deplorable and unable to find relationships or have sex.",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsmyd0/",
              "created": 1723491448,
              "depth": 2,
              "replies": [
                {
                  "id": "lhsyy26",
                  "score": 4,
                  "body": "I get the feeling Japanese people wouldn't date outside their culture (barring individual anecdotes)",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsyy26/",
                  "created": 1723495148,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lhrn73r",
          "score": 5,
          "body": "What's your guess as to when the next down week is going to be, as a result of your thesis?",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrn73r/",
          "created": 1723480321,
          "depth": 1,
          "replies": [
            {
              "id": "lhrqmjd",
              "score": 21,
              "body": "No thesis. Just saying monetary supply is inflating asset bubbles. Japan just showed they have no appetite in fixing the problem. US doesn’t either because it’d take raising taxes and cutting spending. \n\nFed cutting rates may not be bullish. If USD weakens as money flows into other currencies to find better returns, these carry trades are going to continue to unwind, which means selling USD assets to pay back JPN loans.",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrqmjd/",
              "created": 1723481404,
              "depth": 2,
              "replies": [
                {
                  "id": "lhslmd4",
                  "score": 2,
                  "body": "Why would people not have closed their positions already? Why would people continue to run carry trades at such a high risk low reward? The damage was already done and overblown.",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhslmd4/",
                  "created": 1723491027,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhspaf8",
                      "score": 7,
                      "body": "I read from sources the carry trade amount is massive, trillions. Maybe they are slowly unwinding. There should still be a lot there still to go, more than $1T in the medium term. \n\nIt was a low risk high reward trade. Yen was cheap and cheap for decades. Long trade on tech has been massively profitable. As long as these trades are not super leveraged. They are still sitting on large gains. These managers do not want to hold them through a rate cut cycle though. Even if US equity does well through it, they’ll owe more as JPN rises with US rate cuts.",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhspaf8/",
                      "created": 1723492173,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lhsrz34",
                      "score": 1,
                      "body": "because they waited for the recover bounce to get out at less loss?",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsrz34/",
                      "created": 1723492999,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lhts3nz",
                      "score": 1,
                      "body": "The foundation of most carry trades were opened more than a year ago when YEN was at 130 or even lower.\n\nWith funding cost differences between two currencies, it's still free money.",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhts3nz/",
                      "created": 1723505046,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lhrzeng",
          "score": 13,
          "body": "If only there was another way to drain excess liquidity out of the economy. \n\nLike some kind of targeted way to pull some money out from the places and people who are sitting on absolute mountains of it.\n\nHmm, I’m totally stumped…\n\nI guess we’ll just have to keep pulling the interest rate lever back and forth.",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrzeng/",
          "created": 1723484120,
          "depth": 1,
          "replies": [
            {
              "id": "lhs0wlj",
              "score": 9,
              "body": "There are ways, just never going to happen in the current US politics system. \n\n-break two party system. Then add rank choice elections.\n-raise taxes on top 1% by a large amount.\n-one time unrealized gain tax on asset wealth built from Covid era monetary injection.\n-some stimulus and infrastructure spending offset the economic crash.",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhs0wlj/",
              "created": 1723484581,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lhucndw",
              "score": -1,
              "body": "Just shows you how taken over reddit is when comments like this get upvoted on WSB.",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhucndw/",
              "created": 1723512646,
              "depth": 2,
              "replies": [
                {
                  "id": "lhufaob",
                  "score": 0,
                  "body": "\"taken over\" LoL. Ok brain worm.",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhufaob/",
                  "created": 1723513648,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhufnx6",
                      "score": 2,
                      "body": "Truly regarded.",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhufnx6/",
                      "created": 1723513785,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lhug7s2",
                          "score": -2,
                          "body": "Yes I bow to you on that.",
                          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhug7s2/",
                          "created": 1723513990,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lhugbl9",
                              "score": 3,
                              "body": "One look at your post history shows all a rational person needs to know",
                              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhugbl9/",
                              "created": 1723514030,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lhtlnlq",
          "score": 3,
          "body": "they literally dont have a choice. The only way to stop the carry trade is to reduce the spread between US bond yields and Japanese bond yields. \n\nTheir national debt is like 260% of gdp. in 2023 22% of their budget went to debt service with a blended rate of .86. long dated US debt is \\~4. In order to make the carry trade not lucrative, they would end up paying more money in interest per year than the entire government brings in. \n\nThis is the least bad option, the mistakes was made decades ago. The only choice they have, wait until the fed cuts, raise rates the little that you can, and pray for dear life that things stabilize",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhtlnlq/",
          "created": 1723502756,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhvelmw",
          "score": 2,
          "body": "Interest rates are inflationary now?\n\n...\n\n???",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhvelmw/",
          "created": 1723530591,
          "depth": 1,
          "replies": [
            {
              "id": "lhwaq68",
              "score": 1,
              "body": "Copied from my responses here. \n\nUS consumption is not strongly based on borrowing cost. High rate does cool inflation. However, US is raising a lot of debt from high yield treasury bonds. These interest income are real cash that injects into the economy constantly. The effects are competing. \n\nSome economists argue that high rates have done as much as it can on inflation. Getting sub-2% is not about cutting rates or not. It’s about reducing liquidity, which would take painful fiscal policy.",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhwaq68/",
              "created": 1723550350,
              "depth": 2,
              "replies": [
                {
                  "id": "lhwbf4d",
                  "score": 1,
                  "body": "Meanwhile, in another thread, there's a dude saying high rates will help Japan manage its debt by limiting inflation while they print money.\n\nIts not the interest rates driving the inflation. It's the deficit spending. This seems wildly obvious. If you don't have to print more money, you don't have to issue new debt at those higher rates. \n\nBlaming rates at *historically average levels* for inflation is just blatant misdirection.",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhwbf4d/",
                  "created": 1723550664,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhwdum7",
                      "score": 2,
                      "body": "No blame just pointing at competing effects. Historically average rates and extraordinary deficit printing of money together are inflationary.",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhwdum7/",
                      "created": 1723551748,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lhwe02e",
                          "score": 2,
                          "body": "Fair fair. We agree! Though I think we can summarise it down to just \"deficit printing is inflationary\".",
                          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhwe02e/",
                          "created": 1723551814,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lhs3urt",
          "score": 4,
          "body": "Normally rate hikes are known to cool inflation because it’s harder to borrow. I’m not to familiar with the situation in the US, is there a reason why it would aid inflation with you guys?",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhs3urt/",
          "created": 1723485489,
          "depth": 1,
          "replies": [
            {
              "id": "lhs6zs8",
              "score": 11,
              "body": "US consumption is not strongly based on borrowing cost. High rate does cool inflation. However, US is raising a lot of debt from high yield treasury bonds. These interest income are real cash that injects into the economy constantly. The effects are competing. \n\nSome economists argue that high rates have done as much as it can on inflation. Getting sub-2% is not about cutting rates or not. It’s about reducing liquidity, which would take painful fiscal policy.",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhs6zs8/",
              "created": 1723486470,
              "depth": 2,
              "replies": [
                {
                  "id": "lhsb737",
                  "score": 4,
                  "body": "Interesting, thank you for the response!",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsb737/",
                  "created": 1723487778,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lhsngho",
                  "score": 5,
                  "body": "I thought I was on /r/investing when I read this nuanced take.",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsngho/",
                  "created": 1723491605,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lhsbuum",
          "score": 4,
          "body": "Why can't these boomers & GenXers care about their grandchildren & children  for once?",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsbuum/",
          "created": 1723487984,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhwj7p4",
          "score": 1,
          "body": "I mean they will be paid back? I don’t think this is an issue for anyone but a few of those regards who need to sell their stuff to pay back the loan.(or don’t, what Japan going to do)",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhwj7p4/",
          "created": 1723553970,
          "depth": 1,
          "replies": [
            {
              "id": "lhwuoug",
              "score": 1,
              "body": "Paying back means selling equity in usd. That has to do with us. Japan’s balance sheet is a mess. Their inflation is creeping up, which means they need to raise rates. Their debt is so large that they can’t afford to pay interest on positive rates. So they have to sell assets to cover the debt. That means selling US treasury. Their mess can hurt the world economy.",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhwuoug/",
              "created": 1723558168,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lhwz038",
          "score": 1,
          "body": "They went negative rates, they knew it was going to happen.",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhwz038/",
          "created": 1723559606,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhrnpyl",
      "score": 18,
      "body": "Why does anyone believe this BS. You make money on the Carry trade so long as the the rates are spread wide enough and the currency rates do not move against your favor. When the yen went from 160 to 143 in a matter of days, a lot of hedgies got crushed. The Japanese treasury spent an estimated 22 and 8 billion  (USD) to so called stabilize the currency. That was their biggest mistake, and not this miniscule rate increase.\n\nThe hedgies had to raise yen fast, so their japanese stock portfolio was sold off. The Nikkei went in a free fall where all the CB around the world had to prop up the world markets. It takes a lot of towels to mop up a 20 trillion yen carry trade.  \n\nThat's my take. Does anyone think otherwise?",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrnpyl/",
      "created": 1723480489,
      "depth": 0,
      "replies": [
        {
          "id": "lhroy37",
          "score": 5,
          "body": "Basically Japan is inevitably fucked? Cash positions it is",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhroy37/",
          "created": 1723480880,
          "depth": 1,
          "replies": [
            {
              "id": "lhs0hcm",
              "score": 19,
              "body": "They have been fucked since the 90s. They would not let their unhealthy banks die.",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhs0hcm/",
              "created": 1723484451,
              "depth": 2,
              "replies": [
                {
                  "id": "lhs0u6y",
                  "score": 5,
                  "body": "Dammit Japan, give me the tendies",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhs0u6y/",
                  "created": 1723484561,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhsedn1",
                      "score": 1,
                      "body": "Remember kids, \"When tendies\" can be shortened to \"Wendies\", which is the greatest conspiracy of them all.",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsedn1/",
                      "created": 1723488767,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lhsal8f",
                  "score": 6,
                  "body": "Whoa.   Careful now.  Someone on Wall Street might take offense to that suggestion.",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsal8f/",
                  "created": 1723487588,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhsq26n",
                      "score": 4,
                      "body": "Guess my name. I'm okay, I'm okay. I don't need a bailout. After being shotgun wedding'd to another insolvent bank they announce a $50 billion loss for the quarter. \n\nHint. They were known for their bull. Half of them should be working behind a wendy's dumpster.",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsq26n/",
                      "created": 1723492411,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lhsaotj",
              "score": 8,
              "body": "Japans economy is an incredible read if you are interested. If they raise interest rates, their debt is going to be too hard to manage whereas if they lower rates inflation and their own currency is worse off.",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsaotj/",
              "created": 1723487620,
              "depth": 2,
              "replies": [
                {
                  "id": "lhsi2ut",
                  "score": 4,
                  "body": "Raising rates will have minimal impact on national debt as it is overwhelmingly yen denominated.",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsi2ut/",
                  "created": 1723489920,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhvg0u5",
                      "score": -2,
                      "body": "That doesn't stop anything.",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhvg0u5/",
                      "created": 1723531515,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lhvrqi1",
                          "score": 2,
                          "body": "Yes it does. National debt is only a large concern it is denominated in a foreign currency. Otherwise the BoJ can just print yen/use yen reserves",
                          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhvrqi1/",
                          "created": 1723539344,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lhvux59",
                              "score": -1,
                              "body": "\"And that's the story of how the government hyperinflated us into poverty kids\"",
                              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhvux59/",
                              "created": 1723541503,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lhw4f9y",
                                  "score": 1,
                                  "body": "Except that higher interest rates will counteract that by pushing up the value of money (by increasing the cost of borrowing)",
                                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhw4f9y/",
                                  "created": 1723547276,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lhw9we5",
                                      "score": 1,
                                      "body": "You know what beats interest rates? \n\nDevaluing your currency by printing it. Which is what Japan will have to do if they can't find room in the budget to accommodate rate hikes.\n\n[Weimar](https://en.m.wikipedia.org/wiki/Hyperinflation_in_the_Weimar_Republic#:~:text=This%20strategy%20failed%20as%20Germany,economic%20resources%20to%20back%20it.) Denominated their debt in their sovereign currency, and it totalled less than 50% GDP. They even kept their industrial capacity post-war. Reparations+debt were too big, their budget couldn't handle it, so they printed.",
                                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhw9we5/",
                                      "created": 1723549969,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lhrvkhf",
          "score": 4,
          "body": "how far along do you think the Yen carry trade has unwinded? Some banks say around 50-60%, but more carry trade might have been added after BOJ said that they will be more cautious to not cause market volatility.",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrvkhf/",
          "created": 1723482939,
          "depth": 1,
          "replies": [
            {
              "id": "lhs032a",
              "score": 3,
              "body": "My estimate would be about 25 percent unwound. The action was pretty quick, so the holders of this losing trade did not have to liquidate everything. \n\nI agree that some are buying back into the carry trade. They trade what they know, and now Japan has said that they won't raise rates and probably won't interfere with their exchange rate. \n\nSome Hedge funds are probably leveraged 20 to 1 as well. I would think that they were more likely leveraged even higher based on historical figures from 2008.",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhs032a/",
              "created": 1723484329,
              "depth": 2,
              "replies": [
                {
                  "id": "lhsayh7",
                  "score": 5,
                  "body": "I think it was likely what you say, 25% or less.  JPM even came out and said it’s 1-2 trillion total.  That event last week didn’t even unwind what it was going to, as it patched right back up within 24 hours.\n\nAnyone else just see the situation as plain as the nose on our faces?  Shit is heavily levered from sovereign entities down to your neighbor who pays $900 bucks a month for a clapped out Altima.",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsayh7/",
                  "created": 1723487703,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhsoslw",
                      "score": 3,
                      "body": "I heard the estimates on the carry trade at 20 trillion, so that would put it at around 10 percent.\n\nAll derivatives notional value is over 1 quadrillion dollars. It's all about counterparty risk. A fund may be okay, but if their counterparty on their winning trade  cannot pay, then it is 2008 time 10.",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsoslw/",
                      "created": 1723492020,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lhsf8i2",
                  "score": 2,
                  "body": "the action over the weekend was pretty quick, but I think it already started around mid July as the Yen got stronger. Perhaps it was just running in the background, creating selling pressure and preventing market from making new highs. And then it got stronger after the BOJ decision on July 31 evening, stopping the buying momentum after META earnings and then accelerated down from there.",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsf8i2/",
                  "created": 1723489028,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhsqqd7",
                      "score": 2,
                      "body": "Wait until CRE starts to vomit everywhere. Right now its at the early stage of the frat party. Many Mid level banks should be FDIC'd over by now.",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsqqd7/",
                      "created": 1723492619,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lhsrgv4",
                          "score": 1,
                          "body": "I think CRE has been known for so long it's not gonna crap out of nowhere. Maybe some intermediary financial instrument linked to CRE might, but not CRE. Plus 10 year rates is just gonna go down from here, lessening the blow, and RTO is just gonna go up from here.",
                          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsrgv4/",
                          "created": 1723492843,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lhr52t3",
      "score": 84,
      "body": "he says she says, no one knows\n\nbut what's clear is that Japan is careful about the rates, and they also don't like their stock market crashing. \n\nThey literally cancelled the rate hike when they saw the markets crashing.\n\nI cannot believe people didn't talk about that enough. It might have been a big reason why the crash only lasted 2 days.",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhr52t3/",
      "created": 1723474502,
      "depth": 0,
      "replies": [
        {
          "id": "lhreu54",
          "score": 53,
          "body": "US millionaires and hedge funds told them that they crash the market again, they're going to find some black SUVs waiting to pick them up.",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhreu54/",
          "created": 1723477667,
          "depth": 1,
          "replies": [
            {
              "id": "lhrpe8i",
              "score": 9,
              "body": "And take them to a high rise hotel? Booked the top room with a glorious balcony?",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrpe8i/",
              "created": 1723481020,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lhs9ey9",
              "score": 4,
              "body": "Boeing Hitman is on speed dial, and he keeps an apartment in Hong Kong.",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhs9ey9/",
              "created": 1723487222,
              "depth": 2,
              "replies": [
                {
                  "id": "lht74ab",
                  "score": 2,
                  "body": "Boeing does all the dirty jobs in highway motel parking lots not high rise hotels. Inflation is fucking up their budgets",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lht74ab/",
                  "created": 1723497756,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lhral2m",
          "score": 17,
          "body": "They didn't cancel their rate hike right, they let the first one happen anyway?",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhral2m/",
          "created": 1723476304,
          "depth": 1,
          "replies": [
            {
              "id": "lhrcyte",
              "score": -15,
              "body": "cancelled but actually not sure. They said they would maintain their current level of QE but on paper did raise the rates it seems? Google is full of useless headlines and misinformation but I found this:\n\n[https://x.com/martypartymusic/status/1821017167384735841/photo/1](https://x.com/martypartymusic/status/1821017167384735841/photo/1)",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrcyte/",
              "created": 1723477071,
              "depth": 2,
              "replies": [
                {
                  "id": "lhrtvd7",
                  "score": 21,
                  "body": "Don't be parroting false news you aren't even sure about. In the actual article linked for this thread it confirms there was a rate hike but additional ones are paused until atleast March. \n\nYou're the top comment in this thread and you're purely incorrect and spreading a false narrative.",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrtvd7/",
                  "created": 1723482412,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhvy98j",
                      "score": 0,
                      "body": "It's not a false narrative. It's just unclear what they're saying.\n\nThey raised the interest rate, but also said they will maintain current levels of QE due to market instability.\n\nDoes this mean current levels of QE post rate hike? Or maintaining the previous level? They literally said this a day or two after the rate hike, so I suspect the former.\n\nAnd of course, further rate hikes are not on the table for now either.\n\nAll these English articles are shit because they don't go deeper than \"interest rate went up\".\n\nBut I agree, my wording could have been better.",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhvy98j/",
                      "created": 1723543667,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lhrfc3r",
                  "score": 3,
                  "body": "That’s not even what the paper he linked says",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrfc3r/",
                  "created": 1723477825,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lhrev4j",
          "score": 19,
          "body": "Yet we get that constant drum beat of how the market doesn't sway Fed policy from the Fed and from the idiots on CNBC.  We all know they want to keep the pump going.\n\nJapan and US will keep pumping until it all comes crashing down.  When? I havr idea but we got a taste of what will happen when the federal Banks are unable to stop a tsunami  when it comes.",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrev4j/",
          "created": 1723477675,
          "depth": 1,
          "replies": [
            {
              "id": "lhrx28d",
              "score": 9,
              "body": "the US Fed was actually created for financial stability, not for inflation or max employment. If the financial market breaks, they're gonna abandon their other 2 mandates to stabilize financial market. That's what BOE did in 2022, and BOJ might do this year. However, they're likely to do it late (reactive) rather than precautionary.",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrx28d/",
              "created": 1723483399,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lhs71a2",
          "score": 8,
          "body": "They absolutely did not cancel the hike. Where did you get that from?",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhs71a2/",
          "created": 1723486483,
          "depth": 1,
          "replies": [
            {
              "id": "lhs9n6s",
              "score": -3,
              "body": "Then, correction: they were *persuaded* to cancel their rate hike, if they were *considering* one.",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhs9n6s/",
              "created": 1723487292,
              "depth": 2,
              "replies": [
                {
                  "id": "lhsivb3",
                  "score": 7,
                  "body": "No, that is wrong. They did the rate hike, they ruled out any future ones for now.",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsivb3/",
                  "created": 1723490168,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhvx9wm",
                      "score": 1,
                      "body": "they said they would maintain the current levels of QE though, like a day or two after they hiked it on paper",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhvx9wm/",
                      "created": 1723543050,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lhsgzqd",
          "score": 2,
          "body": "Cancelled the hike? Wtf are you on about?",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsgzqd/",
          "created": 1723489575,
          "depth": 1,
          "replies": [
            {
              "id": "lhvx74n",
              "score": 1,
              "body": "they said they will maintain the current levels of QE",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhvx74n/",
              "created": 1723543000,
              "depth": 2,
              "replies": [
                {
                  "id": "lhw47xf",
                  "score": 0,
                  "body": "QE is about money supply and nothing to do with interest rates. Your statement is misleading",
                  "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhw47xf/",
                  "created": 1723547165,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhw9m5h",
                      "score": 1,
                      "body": "How does that have nothing to do with interest rates? Interest rates are a part of it.\n\nIf the government says they are changing interest rates, but doesn't actually change what they're doing, interest rates won't actually change.\n\nLook at the actual bond yields. If you look at these charts, it shows things haven't really changed yet:\n\n[https://www.worldgovernmentbonds.com/country/japan/](https://www.worldgovernmentbonds.com/country/japan/)",
                      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhw9m5h/",
                      "created": 1723549838,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lhwanl5",
                          "score": 0,
                          "body": "The BoJ changed their policy rate from 0.1% to 0.25% in July. They haven’t reversed that decision, end of conversation.",
                          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhwanl5/",
                          "created": 1723550318,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lhsd3te",
          "score": 1,
          "body": "And if they know, they won't tell us ahead of time",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsd3te/",
          "created": 1723488375,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhrpy7d",
          "score": 1,
          "body": "They never confirmed they were going to hike rates. They floated the idea and it got shot down",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrpy7d/",
          "created": 1723481195,
          "depth": 1,
          "replies": [
            {
              "id": "lhtt397",
              "score": 1,
              "body": "They increased it from a target in the range of 0.0-0.1% to 0.25%",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhtt397/",
              "created": 1723505403,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lhr23wb",
      "score": 24,
      "body": "If trump wins the election, Japan will start to hike the rate since he doesn’t like lower currency in other countries and then the usd will go down to export more",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhr23wb/",
      "created": 1723473519,
      "depth": 0,
      "replies": [
        {
          "id": "lhr4eum",
          "score": 7,
          "body": "Your prediction if the election goes another way?",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhr4eum/",
          "created": 1723474285,
          "depth": 1,
          "replies": [
            {
              "id": "lhr58ni",
              "score": 8,
              "body": "Well to read the market would be easier as we have witnessed for the whole time with Biden !",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhr58ni/",
              "created": 1723474554,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lhsah4w",
              "score": -9,
              "body": "Which it will….its been pre-ordained that Queen Kamala would ascend the throne from sometime in 2022, when it became clear to insiders that Biden just needed to get to November 2024 to assure it.\n\nThe “what if Trump wins” crowd can calm down.\n\nNow, back to actual business…I would have to assume that when Kamala moves into the Oval Office, less of a shit will be given about the economy, because she’s an easy pawn to sacrifice.  No one on either side gives a shit if she’s any good at the job.  \n\nMeanwhile, the entire economy continues to hum along with everyone looking over own shoulders expecting a fall out event at any time.  Yay.  Minimum of 4 more years of “recession coming!” talk.  And it never does, like the watched pot.",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhsah4w/",
              "created": 1723487552,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lhr66du",
          "score": 3,
          "body": "Dang, I bought so much Hentai with the low yen as well.",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhr66du/",
          "created": 1723474858,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhs8v9y",
      "score": 18,
      "body": "i think Japan was just the canary. we have a lot of problems right now and the markets are telling you we're in a risk-off regime.\n\nonly WSB regards seem to have 100% equity exposure right now. everyone else is something like 30% with the rest in US gov bonds/cash. i don't see the whole market but i can tell you a lot of fund managers with clients in the $5-20M range are very much in risk-off mode right now.\n\nthey all want to pile back in, but aren't.\n\noh yeah, they all knew things were going to shit back in June. i shoulda talked to them BEFORE buying INTC.\n\nwell it was only $70k and not $700k :)",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhs8v9y/",
      "created": 1723487053,
      "depth": 0,
      "replies": [
        {
          "id": "lhse45k",
          "score": 7,
          "body": "If we were truly in a risk off regime, stocks like COIN, MSTR, crypto in general, and meme trash like asts/gme/lumn would have fallen a lot harder then they did. \n\nrisk-off would mean bitcoin should be at like 40k at the highest.",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhse45k/",
          "created": 1723488685,
          "depth": 1,
          "replies": [
            {
              "id": "lhtdoc5",
              "score": 3,
              "body": "Hey ASTS isn’t a meme relax",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhtdoc5/",
              "created": 1723499950,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lhrwg29",
      "score": 2,
      "body": "Predictions mean nothing these days",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrwg29/",
      "created": 1723483209,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhrxh23",
      "score": 2,
      "body": "Wait what future interest rate hikes? 🫤",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrxh23/",
      "created": 1723483526,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhs5249",
      "score": 2,
      "body": "So should we buy now or leverage against it?",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhs5249/",
      "created": 1723485864,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhs9aoz",
      "score": 2,
      "body": "You’re god dam right they will.\n\nThey’ll adjust their national funds rate when their Uncle Sam tells them they can.  Cucked by America.  \n\nIt’s gotta start pissing them off at some point.",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhs9aoz/",
      "created": 1723487186,
      "depth": 0,
      "replies": [
        {
          "id": "lhscopl",
          "score": 3,
          "body": "If the Japanese feel they need America's defense against their Pacific region foes, it might take a lot for them to detach economically, which was part of the Biden administration foreign policy during his term.\n\nSome feel it is a mistake, which we are now coping with.",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhscopl/",
          "created": 1723488243,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhts5x0",
      "score": 2,
      "body": "Never take the word of an ex.Anything. If you haven't learned that by now you got some growing still.",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhts5x0/",
      "created": 1723505068,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhrb06i",
      "score": 1,
      "body": "Looks like dolphin and whale are back on the menu boys!",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrb06i/",
      "created": 1723476437,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhrod5c",
      "score": 1,
      "body": "Yes! Fljh will thrive again",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrod5c/",
      "created": 1723480695,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhrwgg5",
      "score": 1,
      "body": "Some rich people threatened them.",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrwgg5/",
      "created": 1723483212,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhs7fa7",
      "score": 1,
      "body": "I personally think once US rate cuts come they will sneak in a few hikes in japan",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhs7fa7/",
      "created": 1723486603,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhuifnj",
      "score": 1,
      "body": "Japan is collapsing too?",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhuifnj/",
      "created": 1723514830,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhumreo",
      "score": 1,
      "body": "If the carry trade is already unwound why delay hikes?",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhumreo/",
      "created": 1723516526,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhr3lll",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhr3lll/",
      "created": 1723474017,
      "depth": 0,
      "replies": [
        {
          "id": "lhr3qrd",
          "score": 2,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhr3qrd/",
          "created": 1723474065,
          "depth": 1,
          "replies": [
            {
              "id": "lhr4bqs",
              "score": 6,
              "body": "![img](emote|t5_2th52|4640)",
              "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhr4bqs/",
              "created": 1723474256,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lhrgr8d",
      "score": 0,
      "body": "Raising was pointless to begin with.  Any moves the BOJ make is minuscule compared to the Federal Reserves.  No point raising rates like 0.15% when the US can cut 0.5 to 1% this year.",
      "permalink": "/r/wallstreetbets/comments/1eqfdw7/bank_of_japan_likely_to_delay_further_interest/lhrgr8d/",
      "created": 1723478272,
      "depth": 0,
      "replies": []
    }
  ]
}