{
  "title": "Home Depot expects sales to weaken as consumers grow more cautious ",
  "score": 143,
  "selftext": "Home Depot on Tuesday topped quarterly expectations, but cautioned that sales will be weaker than expected in the back half of the year as high interest rates and consumer uncertainty dampen demand.\n\nThe home improvement retailer said it now expects full-year comparable sales to decline by 3% to 4% compared to the prior fiscal year. It had previously expected comparable sales, a metric that takes out the impact of store openings and closures and other one-time factors, to decline about 1%.\n\nHome Depot’s total annual sales will get a boost from its recently completed acquisition of SRS Distribution, a company that sells supplies to professionals in the landscaping, roofing or pool businesses. Total sales are expected to increase between 2.5% and 3.5% including a 53rd week in the fiscal year and approximately $6.4 billion in sales from SRS. Yet excluding sales from SRS, its new full-year forecast would have amounted to a revenue cut.\n\nIn an interview with CNBC, Chief Financial Officer Richard McPhail said Home Depot has contended with consumers who have a “deferral mindset” since the middle of 2023. Interest rates have caused them to put off buying and selling homes and borrowing money for bigger projects, such as a kitchen renovation. \n\nYet over the past quarter, he said surveys of customers and home professionals like contractors have captured another challenge: a more cautious consumer.\n\n“Pros tell us that, for the first time, their customers aren’t just deferring because of higher financing costs,” he said. “They’re deferring because of a sense of greater uncertainty in the economy.”\n\nHere’s what the company reported compared with what Wall Street expected for the three month period that ended July 28, based on a survey of analysts by LSEG:\n\nEarnings per share: $4.60 vs. $4.49 per share expected\n\nRevenue: $43.18 billion vs. $43.06 billion expected\n\nShares fell more than 4% in premarket trading.\n\nHome Depot kicks off a wave of retail earnings, as economists, investors and politicians pay close attention to the health of the American consumer and try to forecast the economic outlook, including the odds of a recession. Though inflation has cooled, higher prices – particularly for everyday costs like groceries, energy and housing – continue to frustrate customers. They’ve also become a major talking point on the 2024 campaign trail.\n\nConsumer clues will keep coming this week and next, as Walmart reports earnings and the government shares retail sales numbers on Thursday. Other retailers, including Target, Macy’s and Best Buy, will also post results in the coming weeks.\n\nCompared with many other retailers, Home Depot has a more financially stable customer base. About half of its sales come from home professionals and about half come from do-it-yourself customers. About 90% of those DIY customers own their own homes.\n\nYet Home Depot still felt the impact of consumer uncertainty, McPhail said. He said the company saw slower demand for a wide range of project-driven items, including lighting and flooring.\n\nHome Depot’s net income for the fiscal second quarter decreased to $4.56 billion, or $4.60 per share, from $4.66 billion, or $4.65 per share, in the year-ago period.\n\nRevenue rose slightly from $42.92 billion in the year-ago period.\n\nComparable sales dropped 3.3% in the quarter across the business and declined 3.6% in the U.S. That was worse than the 2.1% decrease that analysts expected, according to StreetAccount.\n\nIt marked the seventh consecutive quarter of negative comparable sales at Home Depot.\n\nConsumers have postponed projects in part because of a widely anticipated rate cut by the Federal Reserve, McPhail said. In late July, Fed Chair Jerome Powell said policymakers could cut rates at the central bank’s September meeting if the data supports it.\n\nThat would lead to lower mortgage rates and borrowing costs for homeowners who want to tack on an addition or finance a project, such as a bathroom remodel.\n\n“What our customers tell their pros is, ‘Everything I read tells me interest rates will be lower in three to six months,’” McPhail said. ”‘Why would I borrow to finance the project now rather than just wait a few months?’”\n\nYet Home Depot leaders have emphasized home improvement’s bright long-term outlook, referring to the country’s aging homes, its shortage of houses and significant property value gains, especially during the years of the Covid pandemic. \n\nAnd McPhail said most of Home Depot’s customers remain financially healthy and employed, even if they’re spending less on home improvement right now.\n\nShares of Home Depot closed at $345.81 on Monday. As of Monday’s close, the company’s shares are down less than 1% so far this year, trailing behind the S&P 500′s 12% gains. \n\nSource: https://www.cnbc.com/2024/08/13/home-depot-hd-q2-2024-earnings.html",
  "link_flair_text": null,
  "id": "1er54wg",
  "num_comments": 37,
  "created_utc": 1723547595,
  "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/",
  "comments": [
    {
      "id": "lhwj1ys",
      "score": 88,
      "body": "When Home Depot is saying weakening economy, it is better to listen and move accordingly.",
      "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhwj1ys/",
      "created": 1723553908,
      "depth": 0,
      "replies": [
        {
          "id": "lhx3ig2",
          "score": 39,
          "body": "Weaker spending on the type of home improvement products Home Depot offers, at least.  Just being cautious on how to read this.  Also offset by the \"wait and see\" hopes of lower interest rates in Sep. for financing larger home improvements.\n\nWhere I live currently (outside the US), the Home Depot product line is akin to Wal-Mart:  Lowest quality, cheapest prices.  If I want quality flooring, lighting, network, solar, etc., I go to a dedicated supplier.\n\nThere is an interpretation here where home owners who are not deferring are actually spending on more *upscale* home improvements that are not part of HD's supply profile.  Not trying to change the narrative, but pointing out there is more than one read of their financial guidance if we cut away the fluff.",
          "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhx3ig2/",
          "created": 1723561065,
          "depth": 1,
          "replies": [
            {
              "id": "lhx4x3x",
              "score": 5,
              "body": "I appreciate your point of view. I didn't know about the spending of higher quality products not being home depots clientele. I knew they served contractors/home owners but it makes sense this is for us poors lol.",
              "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhx4x3x/",
              "created": 1723561512,
              "depth": 2,
              "replies": [
                {
                  "id": "lhxtgec",
                  "score": 6,
                  "body": "This is definitely not universally true. There are plenty of higher quality brands that Home Depot sells under its umbrella, but I certainly noticed this is a regional thing.\n\nFor example, where I grew up in NY, Home Depot’s tended to have higher end brands (Kohler, Toto, etc) and also tended to have much higher grade laminate and composite flooring for use with heated floors. Whereas where I live in Colorado now, you’d never see any type of high end brand and typically just see your garbage landlord special laminate and low end appliances and bathroom fixings (no Toto, cheap kohlers, cheap American standard, etc) \n\nBut overall the housing improvement market has vastly slowed due to high interest rates, so I’m surprised it took this long for HD to see the impact",
                  "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhxtgec/",
                  "created": 1723569223,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lhxtgaj",
          "score": 7,
          "body": "Usually when Home Depot worries about the economy, we listen.  I'm not sure that actually pertains in this specific case.\n\nFirst, people have been living in their same homes for a while.  They are done renovating for the most part.  Second, for the people who want to do home projects, they just cost too much money now.  Prices have to come down.\n\nIt's the same as Disney World.  Usually they are a good indicator of future recessions.  And they just said they had weaker than expected revenues at the parks.  The reality is that they just increased the price too quickly.  If they dropped prices, attendance would be right back up.\n\nCorporate greed has taken over.  They have had amazing profits since covid.  That honeymoon is over.  They can still make money, just not as much.",
          "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhxtgaj/",
          "created": 1723569223,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhzople",
          "score": 5,
          "body": "When they quit contributing millions of dollars to Trump, maybe, then, I will want to know what Home Depot says about the economy.",
          "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhzople/",
          "created": 1723592391,
          "depth": 1,
          "replies": [
            {
              "id": "li2j2hy",
              "score": 1,
              "body": "If someone doesn't agree with you politically everything they say must be worthless",
              "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/li2j2hy/",
              "created": 1723641811,
              "depth": 2,
              "replies": [
                {
                  "id": "li2r3fi",
                  "score": 3,
                  "body": "I prefer getting my facts from unbiased sources and I have learned not to trust MAGA information.",
                  "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/li2r3fi/",
                  "created": 1723644625,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lhyjv0v",
          "score": 2,
          "body": "Time to sell off the portfolio!",
          "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhyjv0v/",
          "created": 1723577556,
          "depth": 1,
          "replies": [
            {
              "id": "lhykcdo",
              "score": 1,
              "body": "Lmaoo",
              "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhykcdo/",
              "created": 1723577713,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lhyha6c",
          "score": 3,
          "body": "You mean people arent moving and HD is suffering? \n\nThis isnt indicative of the broad economy",
          "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhyha6c/",
          "created": 1723576728,
          "depth": 1,
          "replies": [
            {
              "id": "lhyklyy",
              "score": 1,
              "body": "That's a part, but home owners are passing on/ holding back on upgrades/repairs due to the economy also just don't know how big of a impact it really is as you stated.",
              "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhyklyy/",
              "created": 1723577797,
              "depth": 2,
              "replies": [
                {
                  "id": "lhylqtf",
                  "score": 4,
                  "body": "People go to Home Depot the most when theyve either just bought a house or are about to sell it. The volume of homes trading hands hurts HD",
                  "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhylqtf/",
                  "created": 1723578155,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "li2j7tt",
                  "score": 2,
                  "body": "Which means contractors aren't getting jobs, garbage haul away companies aren't getting work, suppliers or contractors of those contractors aren't getting work so now they have less to spend, its bigger than someone just deciding to wait a year to redo their tub.",
                  "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/li2j7tt/",
                  "created": 1723641866,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "li2jpr3",
                      "score": 2,
                      "body": "I agree it's a Domino effect. Recently, someone in my personal life mentioned that trucking slowing down hurts everyone in the economy. Relate that too this.",
                      "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/li2jpr3/",
                      "created": 1723642048,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lhzmtfh",
          "score": 1,
          "body": "Who does renovation projects in the fall and winter with Thanksgiving and Christmas!?",
          "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhzmtfh/",
          "created": 1723591699,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhwkc1l",
      "score": 27,
      "body": "HD doesn't stock anything other than shitty \"builder grade\" products anymore. For instance, industry trend for home construction is leaning towards a focus on energy efficiency and durability in materials. Lowe's near me (in Oregon) now stocks ZIP System sheathing and accessories. HD doesn't carry anything like that.",
      "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhwkc1l/",
      "created": 1723554411,
      "depth": 0,
      "replies": [
        {
          "id": "lhyhrjl",
          "score": 4,
          "body": "Yeah but Home Depot has the red power tools",
          "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhyhrjl/",
          "created": 1723576883,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhy6sdv",
      "score": 5,
      "body": "Up 1.8%.  Ok. I'll take it",
      "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhy6sdv/",
      "created": 1723573387,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxd5yk",
      "score": 8,
      "body": "Ok, is this real or did Home Depot just raise prices too much????",
      "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhxd5yk/",
      "created": 1723564088,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzkn9k",
      "score": 3,
      "body": "Also, everyone has already made their kitchens open concept.  Need to start some shows on HGTV where influencers build walls in their kitchens to make the kitchen a more well-defined space.",
      "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhzkn9k/",
      "created": 1723590871,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzubwg",
      "score": 3,
      "body": "Lemme see, during Covid, HD and others they made a fortune on people staying home and working on projects using their inflated priced products. Maybe all the projects are done and people are traveling and spending money on other things now. Just a guess.",
      "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhzubwg/",
      "created": 1723594459,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhwc3jb",
      "score": 7,
      "body": "Doesn't sound bad? Premarket is recovering",
      "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhwc3jb/",
      "created": 1723550971,
      "depth": 0,
      "replies": [
        {
          "id": "lhwdfwk",
          "score": 8,
          "body": " This is what we  need.  Weakening consumers.  NO big deal.",
          "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhwdfwk/",
          "created": 1723551567,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhxogqk",
      "score": 5,
      "body": "I work for a vendor that supplies Home Depot and sales have decreased on our end compared to last year.",
      "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhxogqk/",
      "created": 1723567678,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhx83uc",
      "score": 4,
      "body": "the consumer has been weakening for 2 years now. Its a slow bleed. I suspect most pros know that already",
      "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhx83uc/",
      "created": 1723562514,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxh4ol",
      "score": 5,
      "body": "Bullshit I’m there every other weekend and it’s packed to the tits.",
      "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhxh4ol/",
      "created": 1723565325,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyjrdo",
      "score": 2,
      "body": "I just spent over $1k at Home Depot over the weekend 😭",
      "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhyjrdo/",
      "created": 1723577523,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyy952",
      "score": 1,
      "body": "Home Depot saying recession incoming, people got no money",
      "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhyy952/",
      "created": 1723582431,
      "depth": 0,
      "replies": [
        {
          "id": "li0arg5",
          "score": 1,
          "body": "Since when does that stop Americans? It’s our one super power",
          "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/li0arg5/",
          "created": 1723600627,
          "depth": 1,
          "replies": [
            {
              "id": "li1qn2z",
              "score": 1,
              "body": "Well we actually have recessions when people in general hit their cc limit. LoL. We really should try to move away from a debt based economy.",
              "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/li1qn2z/",
              "created": 1723628205,
              "depth": 2,
              "replies": [
                {
                  "id": "li2hhgo",
                  "score": 1,
                  "body": "Are you speaking from a moral stand point or more from a nuts and bolts stand point? ",
                  "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/li2hhgo/",
                  "created": 1723641230,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "li2l8lm",
                      "score": 1,
                      "body": "Nuts and bolts.",
                      "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/li2l8lm/",
                      "created": 1723642598,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lhz1cni",
      "score": 1,
      "body": "[Home sales are down about 5%](https://www.bankrate.com/real-estate/existing-home-sales/#:~:text=Existing%2Dhome%20sales%20keep%20ticking,million%20transactions%20in%20June%202024), due to interest rates being high and no need for existing homeowners to sell their homes, because fundamentally the economy is fine. So, of course Home Depot sales are weakening by a few percentage points.\n\nFewer people moving into recently purchased homes means less renovation is going on, and thus less action at Home Depot. Not sure why this is being framed as anything deeper than that.",
      "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhz1cni/",
      "created": 1723584010,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0suqw",
      "score": 1,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/li0suqw/",
      "created": 1723608129,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy5ksk",
      "score": 1,
      "body": "Reading this while in the middle of a bathroom remodel wondering if I should be concerned",
      "permalink": "/r/stocks/comments/1er54wg/home_depot_expects_sales_to_weaken_as_consumers/lhy5ksk/",
      "created": 1723573005,
      "depth": 0,
      "replies": []
    }
  ]
}