{
  "title": "I have a 12 year son who seems interested in investing. Should I let him trade on investopedia?",
  "score": 247,
  "selftext": "Hey there, dad here. My son, has taken a real interest in trading on investopedia and I don’t think it’s normal. I don’t want him to be focusing on money at this age but, he could get really good at investing. \n\nI mean it, he has a REAL passion for it. Is there something I can do about this situation? I know warren buffet started at 11. Idk I feel it’s too early and I don’t want him feeling sad about loses. Advice?",
  "link_flair_text": "Advice",
  "id": "1ercarc",
  "num_comments": 274,
  "created_utc": 1723566384,
  "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/",
  "comments": [
    {
      "id": "lhxkhdx",
      "score": 1,
      "body": "Welcome to r/stocks!\n\nFor stock recommendations please see our portfolio sticky, sort by hot, it's the first sticky, or see [past portfolio stickies here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all)\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxkhdx/",
      "created": 1723566385,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxokob",
      "score": 318,
      "body": "Fidelity had a great account designed for youth.  As a savings account it earns close to 5% and allows investing directly from savings as well as access to ATM and debit card usage.  In addition there are monetary rewards for the child watching educational sessions and taking tests regarding personal finance.  It becomes a regular account when the child turns 18 but until then it’s a great tool and resource for exposing your children to personal finance and investment.  Both my kids use it and they have been not only encouraged to save seeing the interest paid, but to monitor their investments they started years ago and transfer money when they see an opportunity or speculation.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxokob/",
      "created": 1723567712,
      "depth": 0,
      "replies": [
        {
          "id": "lhxpraj",
          "score": 61,
          "body": "What a wonderful tool! Your children are going to be in a great spot, and it's the perfect time to get them used to emotional regulation in response to money. I wish this was around when I was a kid and won $1000. Saved 3/4 of it, but I was too afraid to invest.",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxpraj/",
          "created": 1723568080,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhy1jds",
          "score": 49,
          "body": "I'd also add that Fidelity is a respected broker, and doesn't gamify investing like some other brokers (Robinhood...) do.",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy1jds/",
          "created": 1723571727,
          "depth": 1,
          "replies": [
            {
              "id": "lhy5ai6",
              "score": 11,
              "body": "That's true for now, but I'm legitimately worried how long it can last under their current leadership with how crypto obsessed they've become lately. \n\nTheir Director of Global Macro literally has a price target on BitCoin of $1 billion dollars a coin by 2038, which is so utterly absurd that it makes me distrust everything he says.",
              "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy5ai6/",
              "created": 1723572914,
              "depth": 2,
              "replies": [
                {
                  "id": "lhz31xl",
                  "score": 17,
                  "body": "[https://www.fool.com/investing/2024/03/17/could-bitcoin-be-a-billionaire-maker/](https://www.fool.com/investing/2024/03/17/could-bitcoin-be-a-billionaire-maker/)  \n*Editor's Note: This article has been edited to clarify that Jurrien Timmer did not predict that Bitcoin could reach $1 billion by 2038 but instead posed a hypothetical valuation based on a stock-to-flow model.*\n\nHim saying that under a specific model, Bitcoin could reach $1B by 2038 =/= him predicting it will reach $1B by 2038. It's like someone saying based on Moore's Law, the number of transistors in an integrated circuit could reach X amount by year X. But that person is not necessarily predicting we will indeed reach that number by then, as there are limits to the law and the law is already being called into question.\n\nI would also recommend looking into the context of why Jurrien Timmer brought up the model. Was he setting a price target to advocate for Bitcoin? Or was he using the model to illustrate another point (e.g. \"based on this model, Bitcoin will skyrocket, but does that mean we should jump in\" sort of thing)? In my experience watching him on Fidelity's livestreams/videos and reading his newsletters, he's NEVER peddled anything crazy and is always advocating for a more level-headed approach to thinking about news headlines and numbers, which is why I am so doubtful that he actually set a price target for Bitcoin.",
                  "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhz31xl/",
                  "created": 1723584613,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lhylfoo",
          "score": 5,
          "body": "How do you keep your kids from doing stupid things like betting it big on penny stocks or selling naked calls?",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhylfoo/",
          "created": 1723578057,
          "depth": 1,
          "replies": [
            {
              "id": "lhysqyt",
              "score": 11,
              "body": "Options trading isn’t available to my knowledge, as far as the gambling on $.01 that’s part of the risk/reward of learning the process.  I also worked with them trading apart for a few months so they could see the volatility before their initial investments a few years ago.  The nice side of the newer accounts is they can also track on their mobile phones via the App and see the growth or in some cases the losses.  \n  If you have concerns about them chasing WSB and going full YOLO maybe more conversations are needed, or a DraftKings account instead?\n\nHonestly it’s the conversations that have started because of their hands on management that will be priceless later in life, and as a parent anytime a dialogue opens about life lessons it’s a win in my book.",
              "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhysqyt/",
              "created": 1723580357,
              "depth": 2,
              "replies": [
                {
                  "id": "lhz6eyx",
                  "score": 5,
                  "body": "Even with a regular Fidelity brokerage account an investor has to qualify for options trading, I’m sure the kiddies would be safe.",
                  "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhz6eyx/",
                  "created": 1723585763,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "li0bn7j",
              "score": 6,
              "body": "Let them. Better to make mistakes when they’re young. The only caveat is that you guide them and make sure they are learning from their mistakes. It’s the best education they’ll ever pay for. Real world experience.",
              "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li0bn7j/",
              "created": 1723600962,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lhzncd6",
          "score": 5,
          "body": "Can I as an adult open one? My investing literacy isn’t much better than a child’s",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzncd6/",
          "created": 1723591891,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li0py0g",
          "score": 3,
          "body": "Wow this sounds amazing I found its just called Youth account https://www.fidelity.com/go/youth-account/overview?",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li0py0g/",
          "created": 1723606799,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li00lt7",
          "score": 2,
          "body": "This is really good info! Thanks",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li00lt7/",
          "created": 1723596803,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhxw8eo",
      "score": 147,
      "body": "don't be a pussy and let him have at it with 100 dollars and no margin",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxw8eo/",
      "created": 1723570078,
      "depth": 0,
      "replies": [
        {
          "id": "lhyjum9",
          "score": 40,
          "body": "This is what I’d do. Maybe have a mock account for like 6 months to a year to get a feel for market fluctuations. If he’s done OK, then give him a Benjamin to invest in the market. But if he blows it, “Oh well.” 🤷🏻‍♂️\n\nI think what I’d emphasize is returns are built over years or decades, not days or weeks.",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyjum9/",
          "created": 1723577552,
          "depth": 1,
          "replies": [
            {
              "id": "li0bhpc",
              "score": 5,
              "body": "Investopedia is a mock account right? If not I have like 2.5 billion and need to upgrade my bathroom",
              "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li0bhpc/",
              "created": 1723600904,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lhz9e7m",
          "score": 5,
          "body": "What sub is this?",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhz9e7m/",
          "created": 1723586783,
          "depth": 1,
          "replies": [
            {
              "id": "lhzi64c",
              "score": 16,
              "body": "Stocks, not WSB",
              "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzi64c/",
              "created": 1723589943,
              "depth": 2,
              "replies": [
                {
                  "id": "li2qeq4",
                  "score": 8,
                  "body": "WSB would be the exact same answer, but with $100k and some version of “literally cannot go tits up”",
                  "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li2qeq4/",
                  "created": 1723644392,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lhxm3py",
      "score": 109,
      "body": "He could try paper \"investing\" (not trading). I would tell him to focus on finding and buying good companies rather than trading. ThinkorSwim has a good platform for that also teaches him how to use the ui with actual money. I'd pair that with teaching him actual fundamental analysis, where to find earnings reports and how to read them, and math to inform his picks.\n\nIf he moves on to investing actual money, be clear that he can invest any money from his existing allowance/that he earns and make sure he has no access to margin.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxm3py/",
      "created": 1723566934,
      "depth": 0,
      "replies": [
        {
          "id": "lhxydqb",
          "score": 11,
          "body": "I did this at that age with our daily newspapers. It was great to get interested but I don't think was really learning what I was doing. Something interactive that explains why things are happening would have be much more useful.",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxydqb/",
          "created": 1723570746,
          "depth": 1,
          "replies": [
            {
              "id": "lhywhpx",
              "score": 6,
              "body": "The app starts you out with $100k (funny money) to invest, and allows you to make picks and track gain/loss over time. It’s kind of perfect for anyone who wants to learn about financial devices without actually using real money. I used it to understand options trading without risking a real loss",
              "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhywhpx/",
              "created": 1723581542,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lhxr6lg",
          "score": 7,
          "body": "this",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxr6lg/",
          "created": 1723568519,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhxmost",
      "score": 53,
      "body": "The question is do YOU have money sitting around for him to lose?\n\nIf not: There are resources available that will let him invest pretend money.\n\nThose two points aside, I think it’s perfectly fine for him to be interested and play with this stuff.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxmost/",
      "created": 1723567124,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxoph3",
      "score": 260,
      "body": "Set him up on binance with levered crypto futures to start",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxoph3/",
      "created": 1723567754,
      "depth": 0,
      "replies": [
        {
          "id": "lhxrwn3",
          "score": 131,
          "body": "Generational debt 🙌",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxrwn3/",
          "created": 1723568743,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhxrd3h",
          "score": 22,
          "body": "This. It's probably the most responsible way to learn about the market",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxrd3h/",
          "created": 1723568575,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhxpn7e",
          "score": 11,
          "body": "My man",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxpn7e/",
          "created": 1723568045,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhxr2ze",
          "score": 6,
          "body": "Pretty sure that’s what his son said too. Can confirm he’s a natural.",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxr2ze/",
          "created": 1723568487,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhxz4qn",
          "score": 6,
          "body": "Kid will either end up super broke or driving a Lambo.",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxz4qn/",
          "created": 1723570978,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhxrif7",
          "score": 4,
          "body": "Hell yeah brother.",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxrif7/",
          "created": 1723568621,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhy0w2w",
          "score": 2,
          "body": "Great idea. He'll learn the most important lessons early",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy0w2w/",
          "created": 1723571527,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhxp8jm",
      "score": 21,
      "body": "Let him practice with you as his \"broker\". Tell him that you'll keep a record of every asset he \"purchases\", and he can check with you on the asset's performance any time. Dangle the carrot on a stick that if he makes good choices through Daddelity/Dadguard/DadSchwab, then you'd be willing to talk about him working with real money under your supervision. (Whether you actually ever do that is up to you, it's just an incentive motivator. \"I said we could talk about it, I never said yes\".)\n\nLive reality: he tells you \"I want 5 shares of Intel\". You write that down, and explain cost basis to him. Ask him why he chose Intel and let him explain, but don't argue, let him make bad choices and learn about them. Now, any time, he can check with you to see how his pretend Intel purchase is doing. The two of you can see if any dividends were issued, you can explain reinvesting them vs taking them. As time goes on, he can simulate buys/sells, lose, gain, generally get portfolio management experience with optimal customer support through asking you any question he has. The two of you can hit the internet together if he asks something you don't know.\n\nI think this is a phenomenal opportunity to teach your son about the basics, using live examples. Maybe if he makes enough good pretend trades, he can get a toy at the store.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxp8jm/",
      "created": 1723567917,
      "depth": 0,
      "replies": [
        {
          "id": "lhzg1ee",
          "score": 3,
          "body": "Or, he can post all picks from his son and we buy short term options?",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzg1ee/",
          "created": 1723589161,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhxs4bs",
      "score": 48,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxs4bs/",
      "created": 1723568809,
      "depth": 0,
      "replies": [
        {
          "id": "lhycbab",
          "score": 25,
          "body": "It’s not like he’s starting a private equity fund lol. Kids can (and should) have stocks.",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhycbab/",
          "created": 1723575142,
          "depth": 1,
          "replies": [
            {
              "id": "lhyrjzc",
              "score": 4,
              "body": "Yeah, I wish I learned way earlier than 21 years old. At 12, OP just needs to heavily monitor any real transactions and teach him on a paper account to get the basics.",
              "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyrjzc/",
              "created": 1723579977,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "li0dr2e",
          "score": 5,
          "body": "A guy named Warren Buffet started at 11 years old. Just saying.....",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li0dr2e/",
          "created": 1723601768,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhxrcyq",
      "score": 36,
      "body": "Ewww “you don’t want him to feel sad” \n\nJust remember you’re raising your son to become a young man. To protect him from all negative consequences is to do a disservice in the long run.\n\nStart with paper trading, but also give books and literature on markets, finance, and maybe even computer programming. \n\nIt’s a great thing that your child wants to learn about finance. Just focus on *investing* first, learning markets, and building wealth before trading.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxrcyq/",
      "created": 1723568574,
      "depth": 0,
      "replies": [
        {
          "id": "li78ru1",
          "score": 2,
          "body": ">Just remember you’re raising your son to become a young man. To protect him from all negative consequences is to do a disservice in the long run.\n\nAbsolutely right. It's not \"nice\" to harm children by overprotecting them. The son is interested in stocks, which are part of the adult world, so he's saying he's ready to start the journey. \n\nThough OP should know what his son can take and we don't. \n\nOP, if you let him paper \"trade\" with you, then simulate transaction costs. That would be the best inoculation against committing churning against himself.",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li78ru1/",
          "created": 1723703523,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhxlup2",
      "score": 22,
      "body": "Does he want to trade or invest? Big difference.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxlup2/",
      "created": 1723566852,
      "depth": 0,
      "replies": [
        {
          "id": "lhyb2ox",
          "score": 6,
          "body": "Exactly, should have him do a bit of both to realize how fast you can fall on your face, I lost 3,800 in 3 days in my senior year",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyb2ox/",
          "created": 1723574753,
          "depth": 1,
          "replies": [
            {
              "id": "lhyvhe1",
              "score": 4,
              "body": "Username fits",
              "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyvhe1/",
              "created": 1723581217,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lhxw6lg",
      "score": 10,
      "body": "Investing should be boring for most people. Most people should VOO & chill. Your son is no exception. \n\nAt 12 years old, your son does not have deep technical or domain knowledge, nor financial analysis acumen, nor experience in accounting. \n\nBuilding capital to invest is the first step of being an investor. If your son does not have his own capital to invest, you should not be giving him any. \n\nI say this because it does not make sense to let a 12-year-old invest your money but give him the gains. It’s basically like giving a kid money to go gamble in a casino, where he gets to keep the winnings, but you have to bear the losses. \n\nYou can’t teach this lesson unless you have actual skin in the game. It has to actually hurt when you lose.\n\nThat being said, when I was your son’s age, I told my parents they needed to invest in Google shortly after they IPO’d. They said it was too expensive. Well, obviously, that was probably a mistake. So I do think that young people can spot emerging internet and cultural trends ahead of the market.\n\nSo I would say, support your son in allowing him to research companies that would make a good investments. For each of these recommendations he makes, you should request a written report that analyzes the strengths and weaknesses of the particular company and why your son believes that its growth will outpace the S&P 500. \n\nThen, if you think it’s a good report, pay him what you think the report is worth. Maybe $50 or $100. And then invest that cash into the company he is recommending. \n\n(The other option would a paper trading account, where he can “play around” with an account that allows paper stock trading. Note that these should not be used to trade low volume securities or options.)",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxw6lg/",
      "created": 1723570063,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxrvgl",
      "score": 13,
      "body": "Read up on intel grandma $700k.\nLearn first before blindly investing.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxrvgl/",
      "created": 1723568734,
      "depth": 0,
      "replies": [
        {
          "id": "li0c1rt",
          "score": 6,
          "body": "Lol you think this dad is gonna go from “I’m worried this isn’t healthy” to “here son have $700k”",
          "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li0c1rt/",
          "created": 1723601116,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhxm2ws",
      "score": 12,
      "body": "Start him off with paper trading. Show him where to find important information like SEC reports and how to read releases. \n\nTell him math is very important.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxm2ws/",
      "created": 1723566927,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxnb2r",
      "score": 5,
      "body": "Might as well. Investopedia has prices delayed by 15 minutes so he won’t be able to trade intraday if you’re worried about the short-term side of things.\n\nWith regards to his age, I got into trading at a similar age and have enjoyed learning everything about it, whether that’s been the maths or the ‘critical reading’ (for lack of better wording) of financial statements. I’ve learned a lot and wouldn’t change a thing about it. If he enjoys it, then that’s great! If he doesn’t, then that’s fine too but if you don’t let him try these things out he may end up turning 18 and discovering WSB and running up a nice $1.2mn margin call because he won’t see it as being anything more than gambling.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxnb2r/",
      "created": 1723567317,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxx9e1",
      "score": 5,
      "body": "Trying to prevent kids from feeling sad about losses isn't helpful. It would be better to learn to deal with losses early and gain the confidence required to risk them. It's a better way to approach life overall. Let him try if it's what he wants. Voluntary assumption of risk is a good learning experience at least.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxx9e1/",
      "created": 1723570397,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxm3nt",
      "score": 5,
      "body": "I would let my 8 year old if he asked. I don’t think there is a negative to letting them try new things young. Especially if they ask to.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxm3nt/",
      "created": 1723566934,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxrm3j",
      "score": 2,
      "body": "I feel like the age doesn’t play as much as a role, as the right way to learn how to invest. \n\nIt’s really about investing, not trading. Otherwise he’ll just get addicted to gambling at an early age. \n\nSimilar to any subject in school, it’s best to start with „some“ theoretical foundation. Ideally you can start leaning something, and then testing this with a papermoney trading account. \n\nMaybe you’ll give him additional pocket money in case he can explain some theories to you and how he has tried them and made profits?",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxrm3j/",
      "created": 1723568653,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxsh31",
      "score": 2,
      "body": "My middle school had a stock market club using fake money which met in the mornings over the newspaper. I wish I had joined, but my brother did and enjoyed it. There may be similar places online now for children interested in the market, or you can make your own.  He should use pretend money until either earning his own and/or until he demonstrates enough wisdom, strategy, a realistic goal, can articulate why a trade or investment profited or lost, what did he learn, how does he feel and how did he manage those emotions, and learn knowledge of fundamentals. In the meantime, real or fake money could go into VOO etc for comparison as an investment.\n\nFeeling sad about losses, even in a pretend game, is a normal and appropriate response. It's how the sadness is managed which is important. Does he dump more pretend money into a lost cause? Does he YOLO into something else? Plus, all the biophysical ways of expressing and coping with such emotion. Now is the best time to practice. Sometimes children learn a lot by experimenting in a game just to see what happens, or feel motivated to sit down and read a big dry book to get better at it. Once he is earning his own money with labor, that will be a whole new dimension and influence his goals (hopefully in a healthy manner)",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxsh31/",
      "created": 1723568919,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxuikr",
      "score": 2,
      "body": "Investopedia has a trading simulator, that's a great place for him to learn. I work with middle schoolers and they are wanting to introduce the stock market to help them begin to understand finances at an early age. If your son is passionate about it, help guide him. You can even help him when he experiences losses to learn to how to deal with it. No different than losing in sports, it's important to learn how to cope with that because in life, losses happen all the time.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxuikr/",
      "created": 1723569551,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxut1s",
      "score": 2,
      "body": "I don't see any problem with treating it as an educational tool.  But I'd recommend you limit it to money that you can afford to lose.  Treat it mentally like spending money on sporting equipment for a sport that your kid may play for a year and never play again.\n\nYou definitely want to also be personally involved to make sure it doesn't turn into getting a kid hooked on what could turn into a gambling habit.  This is a real problem that kids already have these days whether it is for CoD/CS skins, loot boxes, etc.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxut1s/",
      "created": 1723569639,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzupq3",
      "score": 2,
      "body": "If the alternative is video games, movies, social media, etc; it actually sounds like it could be better for him all around.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzupq3/",
      "created": 1723594603,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li02ap9",
      "score": 2,
      "body": "The sooner the better in my opinion, as long as you teach risk management and how to not over leaverage yourself.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li02ap9/",
      "created": 1723597438,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li07jau",
      "score": 2,
      "body": "When I was 12 I told my stepdad to invest in Activision as COD was blowing up.  Glad he listened.  Wish I had some of my own money to follow suit at the time.  \n\nShit went over 10x and split several times before then getting bought out at a higher price by MSFT.  Jesus that would have been nice if he had thrown some serious money behind that, would be set for life.  I will never get something that right ever again.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li07jau/",
      "created": 1723599412,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxojie",
      "score": 2,
      "body": "you say in the title that he is interested in investing but the in the text that he is interested in trading. Those are two very different things. Most traders are essentially gamblers that lose money in the long run. Investing on the other end is mostly just boring buy and hold etfs and doesn't require a lot of knowledge. Letting him try to day/swing trade on a paper account is harmless but also probably won't bring him much valuable kowledge and will mostly be a waste of time. Learning about investing, etfs, companies financials, or even giving him a bit of money to invest in stocks or bonds can on the other hand be a real asset for his future financial health.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxojie/",
      "created": 1723567702,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxrr7c",
      "score": 3,
      "body": "Heres the actual answer:\n\nIntroduce him to accounting 101 and reading balance sheets. See if hes still interested after that.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxrr7c/",
      "created": 1723568697,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxrcur",
      "score": 1,
      "body": "Is his passion specific to doing the research required to make informed, sound, long-term investment decisions? Or is his passion more specific to seeing numbers go up and getting lucky with options, i.e. gambling? \n\nIf its the former, for sure. Get him some good reading materials that will teach him the fundamentals of investing. \n\nIf it's the latter, I would tread carefully. Would you be open to him playing online poker with fake money?",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxrcur/",
      "created": 1723568573,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxrkh5",
      "score": 1,
      "body": "35 years ago, my 12 or 13 year old son took and interest and recommended I buy blockbuster and Berkshire Hathaway. Too bad I didn’t listen. But he didn’t invest on his own I would encourage it if he does well in school and life in general for someone his age. Also great discussion and bonding topic for you both. That I did have with my son and we still talk stocks to this date",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxrkh5/",
      "created": 1723568639,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxseiv",
      "score": 1,
      "body": "Hey man, why not? I'm currently 24 and trying to figure it out. I wish I started learning and even doing it myself at such a young age. It's a good thing I think, just don't let him get so addicted that it becomes his life, I know there's a lot of people on here who can attest to that issue XD",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxseiv/",
      "created": 1723568897,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxspa0",
      "score": 1,
      "body": "Confused: investopedia is not a brokerage.\n\nIt’s a decent information site and a good default go-to for definitions.\n\nThey have a simulator.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxspa0/",
      "created": 1723568990,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxsqxf",
      "score": 1,
      "body": "Give him all your life savings because he’s obviously going to blow up in social media by losing half your account! That’s where the money is! Hawk Thua!",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxsqxf/",
      "created": 1723569005,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxt2dz",
      "score": 1,
      "body": "Your child is exploring part of the world. Nurture your child's safe exploration of the world. Simulated trading is safe. Excessive control is harmful.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxt2dz/",
      "created": 1723569103,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxu3f2",
      "score": 1,
      "body": "There are few considerations. First of all do you understand investments, to allow you to guide your child?  If you are looking for trading l, that's a completely different matter and for retail customer borderline gambling. To many YouTubers and tiktokers making it an easy way to make money, the fact is that 95% of retail trades are losing money, even worse if they are using margins as they can lose more than put in.\n\nI would encourage my children (too young yet) to understand investments. My kids already hold some stocks and ETFs in their portfolio. If they wish to learn I will guide them and they will discover their portfolios. If not, they will have a nice surprise when 18ish (providing they will be responsible enough at that age).\n\nUltimately, investing and learning can be fun and engaging (was for me), but children and children need guidance as they might not understand risk management and tolerance to risk. \n\nIf you are not familiar with investing, before you allow your child to go into the deep end educate yourself that you can understand different derivatives to ensure your child will not make a mistake costing him/her/you more than you are willing to lose (especially if you refering to trading, which I would not recommend), but everyone making their own choices.\n\nBest of luck!",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxu3f2/",
      "created": 1723569421,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxudw1",
      "score": 1,
      "body": "You should give him $100 to invest and see what happens",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxudw1/",
      "created": 1723569511,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxuexq",
      "score": 1,
      "body": "Yes, of course. You never know, he might be the next Jonathan Lebed!",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxuexq/",
      "created": 1723569520,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxuzwh",
      "score": 1,
      "body": "Paper account and make sure he’s learning how the market works",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxuzwh/",
      "created": 1723569697,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxvnew",
      "score": 1,
      "body": "Has he heard about options yet?",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxvnew/",
      "created": 1723569897,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxvo3b",
      "score": 1,
      "body": "If he's REAL passionate about it then i see no problem. I actually applaud your son. \n\nThere have to be rules! He has to use his own money, and needs to understand what investing actually is. I also advise you to learn with him. Make sure he's doing alright and maybe you'll start investing too.\n\nAlso, there are some kid friendly apps/brokers/courses whatever you want to call them. I don't know the laws of your country. If it's allowed, invest it into a retirement portfolio. \n\nMake sure he shares what he's doing with you. Look through things together, get involved too, but do not make the choices. He's got to learn. I know i learned from my mistake.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxvo3b/",
      "created": 1723569903,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxwxe7",
      "score": 1,
      "body": "get him a paper trading account on like think or swim or something. stocks aren't really money, and they are much more living things. I think its fantastic he is interested. Honestly, my parents taught me TERRIBLE financial habits, and I have been starting early with them on respecting their money, not wasting it, the value of saving and deferred gratification.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxwxe7/",
      "created": 1723570293,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxx1yz",
      "score": 1,
      "body": "There is a big difference between \"trading\" and investing. You should encourage him to invest his money for the long term. There are multiple investment  platforms that he can use that buy fractional shares and don't charge commissions. Let him do his own research and spend his allowance or grass cutting money to invest long term in companies he understands NOT the hottest fads.  He can trade if he needs to rebalance his portfolio but the best way to make money in the market is to buy good stocks and hoid them for the long term.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxx1yz/",
      "created": 1723570332,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxz41z",
      "score": 1,
      "body": "I think the investopedia simulator is a great tool for learning, he can even attempt riskier strategies without real world consequences, and if they backfire he can learn his lesson the easy way. I played with options on the simulator and that was enough to help me realize I don’t like gambling like that lol\n\nIf you see him being responsible and doing well, maybe you could replicate some of his trades on your account and then give him the cash sometime in the future to reward good investment strategy?",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxz41z/",
      "created": 1723570972,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxzark",
      "score": 1,
      "body": "Open him a Roth IRA and let him invest in his future. Obviously monitor him so he doesn’t get crazy but let him invest $50/mo or something until he is old enough for a job and then let him invest his own money.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxzark/",
      "created": 1723571030,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhxzcd6",
      "score": 1,
      "body": "This will be the best decision you and him ever made. Set him up on a platform with only investing in good company's or etfs with small money every so often pocket money, birthday card money etc and teach him about loses, gains and all about investing. By the time he is 30 he could retire with nearly 20 years of investing under his belt. Even better get him buying Bitcoin every to by the time he is 30 he will definitely be grateful you let him invest.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhxzcd6/",
      "created": 1723571044,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy0e4h",
      "score": 1,
      "body": "Well my brother taught my niece at 11 about PE and various ratios.  Now 40, her largest holdings are APPL, AMZN and ABNB.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy0e4h/",
      "created": 1723571370,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy0h2t",
      "score": 1,
      "body": "When I was in school, you could do stock market simulators where we would get 100k and invest it in real time, and the whole class would see who is the best investor. Maybe start him out on something like that.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy0h2t/",
      "created": 1723571396,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy0nkl",
      "score": 1,
      "body": "How many shareholder meetings has he attended, has he figured out how to calculate the NPV of money?\n\nI think he's interested in gambling, not investing.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy0nkl/",
      "created": 1723571452,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy15hv",
      "score": 1,
      "body": "I think \"investing\" (buy and hold) is one thing and can be good to learn how money works from a young age. However, I would be very cautious about \"trading\" (buy and sell repeatedly in short time frame). I know people who treat the stock market the same way people play slot machines, and truly have a gambling addiction. There are a lot of things that can be a gateway to gambling addiction, things as simple as phone apps and games. The stock market can be the same for some people so as a young kid, I would emphasis \"investing\" and doing research about companies and their businesses and steer away from \"trading\". If it was my kid, I would allow investing but not trading.\n\nAs far as \"I don't want him feeling sad about loses\", does your kid play any sports? Sports teach kids how to handle losing and competition. Investing can be the same so I don't see that as much of a concern.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy15hv/",
      "created": 1723571608,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy16gn",
      "score": 1,
      "body": "Grow your child to understand stocks. Do not let them try to learn it at 30+ with over 100k to lose! Teach them young, kids usually find the graphs the most interesting. They also love making screeners, compared to understanding trading terminology. They’ll learn that on their own overtime. Eventually just let them sim trade up until they’re 18. Maybe follow a few of their trades here and their lightly to keep them motivated :)",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy16gn/",
      "created": 1723571616,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy1ove",
      "score": 1,
      "body": "Let him invest regularly by putting pocket money into an index or something.\n\nDon't let him become one of those tik tok trading gurus 💀",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy1ove/",
      "created": 1723571775,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy257v",
      "score": 1,
      "body": "\"I mean it, he has a REAL passion for it.\"\n\nWhat specifically does he have a passion for? It is seeing the $$$ go up? Is it seeing the numbers in green every day? Or is it researching and finding companies he thinks will be good, and testing his theory? If it's the last option I would encourage this (with restraint). It teaches how to research something, how to predict results, and how to handle if and when his predictions don't come true.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy257v/",
      "created": 1723571917,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy293o",
      "score": 1,
      "body": "Encourage your son's interest in investing by teaching him financial literacy and emphasizing a long-term approach to investing. Utilize educational resources like stock market games and age-appropriate books, while maintaining open communication about the risks involved. Ensure he balances his passion for trading with other activities and responsibilities, helping him build resilience in the face of losses.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy293o/",
      "created": 1723571950,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy2kaf",
      "score": 1,
      "body": "1. Open live account straight away, every year not investing is a wasted year\n2. Show him how to buy Intel stocks\n3. Say: ''son in 30years you will, either be a millionaire or in the same place as you are right now, most likely 2nd option but be optimsitic, heads up champ\".",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy2kaf/",
      "created": 1723572046,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy2xcf",
      "score": 1,
      "body": "There are two ways to make a ton of money with investing. Starting early, or dying old. Warren Buffet is doing both.  \n  \nWhy would you keep your kid from becoming skilled at something that could be very valuable? just give him $100 to prove himself with then more and more if he seems to be good.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy2xcf/",
      "created": 1723572162,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy4ipz",
      "score": 1,
      "body": "Get him into coins and buy a coin book for him to start with",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy4ipz/",
      "created": 1723572668,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy4wqj",
      "score": 1,
      "body": "Send him straight to options for a real world lesson",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy4wqj/",
      "created": 1723572792,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy5527",
      "score": 1,
      "body": "Bloom, it’s owned by fidelity",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy5527/",
      "created": 1723572866,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy580y",
      "score": 1,
      "body": "What about demo accounts?",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy580y/",
      "created": 1723572892,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy5qhr",
      "score": 1,
      "body": "Absolutely allow him to learn about investing as young as possible. Especially since he has a passion about it. I would recommend buying some starter investing books for him as well to quench that thirst. Like what others have said however, emphasize long term investing (preferably in index funds) than trading in and out.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy5qhr/",
      "created": 1723573055,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy5zs5",
      "score": 1,
      "body": "We all have hobbies and we have all gone down weird knowledge rabbit holes. \n\nYour son should not have the mathematical skills at 12 to be able to solve some of the algebraic problems that are used in finance. Which is why he is turning to investopedia to fill in some of the gaps on terms and solving equations. Seeing them done step by step is advancing his mathematical knowledge whether he knows it or not.\n\nIf I remember correctly PEMDAS isn't even taught in public school until 7th grade prealgrabra. I do remember integers being taught in the 6th grade and a lot of people could not mentally process negative numbers especially when subtracting. Anyways your son won't have that problem as he is learning math with something tangible to trace it to... money.\n\nThis is going to not only going to advance his knowledge in math and finance but boost his confidence to learn more complex subjects in the future. \n\nFinance and investing can be difficult to learn for people who have the math skills. Having to learn the mathematical principals, terminology and the actual concept he wants to learn is no easy feat. He has a drive and a passion for this that you should encourage that.\n\nLet him paper trade(play money) on an account and encourage him through his wins and losses. Most importantly let him do his thing. He may find a different hobby in 3 months. He is 12. However, compared to all the different things he could be pursuing at that age, finance isn't the worst. Yes, he maybe money driven but finance is a long game and if he is willing to learn finance, he will learn patience along the way.\n\nAdded bonus as math doesn't change so what he learns now will still be used 10 years from now when he is in college. Same applies to most finance topics. Add in your son learning math, the value of patience and many life lessons along the way and I believe you can see the pros outweighs the cons.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy5zs5/",
      "created": 1723573136,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy64om",
      "score": 1,
      "body": "Yes give him your credit card and carte blache and just wait for tendies to start rollimg in",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy64om/",
      "created": 1723573179,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy6ion",
      "score": 1,
      "body": "Allow him to have a Reddit account, let him follow wallstreetbets and give him access to your broker, your financial freedom is settled then 🚀",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy6ion/",
      "created": 1723573301,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy7wx7",
      "score": 1,
      "body": "> I don’t want him to be focusing on money at this age but, he could get really good at investing.\n\nL mentality.  \nYes, let him trade.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy7wx7/",
      "created": 1723573749,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy83xn",
      "score": 1,
      "body": "You can let him invest on any site like etrade with a uniform gift to minor’s act account",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy83xn/",
      "created": 1723573811,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy8511",
      "score": 1,
      "body": "Set up a brokerage account for him and let him paper trade for a couple years.  Fund the account like an allowance, and take the training wheels off when it's time.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy8511/",
      "created": 1723573821,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy8soi",
      "score": 1,
      "body": "When I was maybe 10 I traded a mock portfolio on AOL. Then there was this company that looked really cool where you could buy books online and you’d have them delivered in a week, which was a big deal at the time. My mom would get books delivered constantly. When I was little older and had real money to invest I bought AMZN at $4 a share (split adjusted). Still holding to this day! So, yes, I think that is a great idea!",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy8soi/",
      "created": 1723574030,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhy8t01",
      "score": 1,
      "body": "I think the first question to ask yourself is this: \"Does my son have an investment/brokerage account?\" If he  doesn't then set one up for him. \n\nThe next question you should ask him is if he's in investments for the long haul or short haul. If long than teach him about mutual funds and index funds. Have him start there.  If he's not in investments for the long haul then started teaching him about trading. \n\nBest of luck. There's many ways to approach investing with kids. My son, also 12, has a ROTH IRA through Fidelity that I opened up for him a long time ago. Recently he's also become interested in investments. I've sat down with him, showed him his account,  talked to him about different investments,  showed him my investments,  and talked to him about compound interest and budgeting. \n\nGood job getting your kid involved with investing. He'll thank you later on in life hopefully.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhy8t01/",
      "created": 1723574033,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhycmgk",
      "score": 1,
      "body": "I currently use fidelity youth (16 M) and I have loved it. They have a great interface and it is pretty easy to use.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhycmgk/",
      "created": 1723575239,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyd1qr",
      "score": 1,
      "body": "Its a nice curiosity to have ..\nI myself invested on dad's behalf since i was 10.\nI did quite good for myself and sad things followed into adulthood on him and mom being bitter on my success ..\n\nI gave up most of life fun during those years, as i scrapped every penny to put at first in individual stocks(where i got 4%) and then moved to the good old sp500 ..\n\nAs regards to your son, if you wont let him, he will resent you later .. try to be supportive and do as other suggested, in letting him paper trade at first, try reading to him the \"the little book that still beats the market\" and teach how to read a quarter report ..\nAnd please, when he will invested all of his money, buy out of a small gift that candy he spent on market ..",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyd1qr/",
      "created": 1723575372,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhydfco",
      "score": 1,
      "body": "set ground rules.  no optons.  no buying on margin, etc.\n\nexplain why!\n\nHave him trade for a year with fake money.  if he is doing great, give him a thousand real bucks, and see what he can do with it.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhydfco/",
      "created": 1723575491,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhydhzb",
      "score": 1,
      "body": "Get him some Bitcoin in self custody, by the time he’s 18, I promise he’ll thank you.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhydhzb/",
      "created": 1723575514,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhygeyd",
      "score": 1,
      "body": "Does your mom have 600k earmarked for her grandson? Does your son like Intel or AMD?",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhygeyd/",
      "created": 1723576447,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhygmds",
      "score": 1,
      "body": "I'd just open a Wealthsimple/Robinhood account for yourself and put whatever money he earns and wants to lose into it. It's good to feel the real loss of money early. You can buy fractional shares these days.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhygmds/",
      "created": 1723576515,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhygv3m",
      "score": 1,
      "body": "Market watch has a good training program where you can “invest” with virtual money and see how well your choices do.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhygv3m/",
      "created": 1723576594,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyhobf",
      "score": 1,
      "body": "howthemarketworks allows you to trade with the real market and fake money",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyhobf/",
      "created": 1723576854,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyhoxe",
      "score": 1,
      "body": "I would either let him trade on one of those systems that's basically like fantasy football were you just choose stocks for an imaginary purchase at a certain price to see how much you would have made or lost... \n\n\nor maybe if you want to give him limited access to real investments, just use something like Fidelity that gives you access to fractional share Investments so you can invest as little as a dollar at a time in each investment and see how much you can make or lose on a dollar. It's a good test of your skills as an investor at that age with very little risk",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyhoxe/",
      "created": 1723576860,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyhupf",
      "score": 1,
      "body": "Is he interested in investing or gambling? That is what you need to find out. What sparked the interest? Much of the content on social media is more gambling. If he can tell you what a balance sheet and a P/E ratio is then perhaps he has a legitimate interest.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyhupf/",
      "created": 1723576910,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyi1ik",
      "score": 1,
      "body": "You're a good dad. I had the same interest around that age and my dad said \"that's for rich people and I ain't rich. We don't do that sort of thing.\" That was the end of trying to learn about investing until my mid 20s.\n\n I tried to tell mom that we should invest in apple back around 2003 or so and that conversation died immediately after I suggested it. I was a teenager at the time.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyi1ik/",
      "created": 1723576971,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyi3zr",
      "score": 1,
      "body": "Just buy them a monopoly game …or the stock exchange board game…",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyi3zr/",
      "created": 1723576992,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyiv61",
      "score": 1,
      "body": "I would get him a Robinhood account and teach him about how to DCA into VOO and BTC, maybe do 95% VOO and 5% BTC. I'm sure by the time he is 50, he'll be ecstatic that you did.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyiv61/",
      "created": 1723577233,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyj6qd",
      "score": 1,
      "body": "Make sure that it isn't (and doesn't become) gambling. It can be addictive.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyj6qd/",
      "created": 1723577336,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyjad0",
      "score": 1,
      "body": "Hell yes.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyjad0/",
      "created": 1723577368,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhykjzy",
      "score": 1,
      "body": "It's okay to let him. Give him just $10 and see if he can double it. Tell him to invest in penny stocks and see how it fluctuates. He \\*will\\* make mistakes and this is likely in folly, but he will learn a valuable lesson about money.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhykjzy/",
      "created": 1723577780,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhykqmx",
      "score": 1,
      "body": "Be careful, its likely he saw wallstreetbets, u dont want him end up a regard and lose ur house ",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhykqmx/",
      "created": 1723577838,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyl3fw",
      "score": 1,
      "body": "Use paper trading. Don't use actual money. He can learn the ropes by using simulators or live market data online.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyl3fw/",
      "created": 1723577950,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyla9d",
      "score": 1,
      "body": "You should teach him how to live within one’s means and that money outside of play or other short term goals should be squirted away in an IRA or brokerage account.\n\nTurn him into a millionaire at 40.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyla9d/",
      "created": 1723578010,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhylskw",
      "score": 1,
      "body": "Yes, teach him what you know. Paper trading on Investopedia is a great way to start. Nevermind him feeling sad about losses. That is something that most people on reddit have a hard time with too. There are hundreds of posts on here with people thinking about selling it all on one down day. He can learn what it looks like when things bounce around. Personally, I think you take full interest in any of the interests of your children. But that's just me.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhylskw/",
      "created": 1723578170,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhylwsp",
      "score": 1,
      "body": "Get him to focus on risk. Being able to calculate risk probabilities is the key to managing money successfully.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhylwsp/",
      "created": 1723578207,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhym1n9",
      "score": 1,
      "body": "Have him start of with paper trading on thinkorswim",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhym1n9/",
      "created": 1723578250,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhym519",
      "score": 1,
      "body": "does his grandma have 700k lying around",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhym519/",
      "created": 1723578279,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhymvxp",
      "score": 1,
      "body": "I started to trade quite young myself, gains and losses come along the way. One thing I would say however, is how my parents allowed me to understand the value of money and value of time. \n\nWhile many others have recommended paper trading, I think that real money makes a significant difference. This is not saying that you should give them free money, but rather let them learn that money is earned.\n\nI learned that I have to earn money by doing work. Before I had enough money to invest, I had to earn my money by doing housework, hand-made things, and help my parents to work on projects to earn pocket money. Then I learned how to use money to make more money, how to use knowledge to make more money, and eventually learned my way to invest, in the stock market, fx, bond, etc. \n\nMy parents are in the banking and finance industry, even though they are not in any investment company, they taught me everything about investment, risk, time value of money, and so on. I had my very first bank account when I was 9 and learned about interest payments. And every so often we would have discussions about news and history about the real world. I think the consistency of learning knowledge and having interest in this area allowed me to accumulate experience in the field.\n\nNow I’m in the finance research field, and have long been a long-term investor in the market. I highly recommend you work along with your kid, learn/teach economics, finance, history, and (when they are old enough) politics systematically and consistently together. That’s what I would do with my kids too.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhymvxp/",
      "created": 1723578513,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyn06b",
      "score": 1,
      "body": "somewhat unrelated, but sooner than later let him trade with a little real money\n\nhe will learn real fast what his taste for risk is, when he loses 6 months of allowance (which is nothing compared to the amounts you invest later on) over a dumb trade\n\nor perhaps he likes the risky stuff and enjoys investing in idk, up and coming pharma companies and becomes an insane investor too",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyn06b/",
      "created": 1723578549,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhynqt6",
      "score": 1,
      "body": "Just let him trade on a paper account (basically a real trading account but the money is fictional) those accounts are made for developing a strategy for a few months,focusing on what he would do if it was actually real money,let’s see what happens first but the truth is investing in an index fund and holding ling term is probably a lot more profitable but less exciting",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhynqt6/",
      "created": 1723578781,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyort4",
      "score": 1,
      "body": "Give him $100 dollars get him started on toning good doing some call options. Check on him in a year.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyort4/",
      "created": 1723579100,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyr8u1",
      "score": 1,
      "body": "Use a real brokers paper trading account if you'd like him to practice - each brokers tool is different and has a learning curve.\n\nI would consider it your account until he's 18 - let him make all the decisions with you operating the account.\n\n\nNLA.NFL.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyr8u1/",
      "created": 1723579877,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhythc9",
      "score": 1,
      "body": "There are platforms with simulated trades. You can practice trading and research without losing any real money. Schwab has their Think or Swim platform. They let you simulate options trading and it is all based on real time data.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhythc9/",
      "created": 1723580587,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyw7ov",
      "score": 1,
      "body": "Demo mode",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyw7ov/",
      "created": 1723581451,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhywbx2",
      "score": 1,
      "body": "yes. I have a relative in the same age who is also quite invested, he loves math and numbers. Buy him some good literature on the topic and monitor it until he is 18. If you are a real G you cover his losses until that point.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhywbx2/",
      "created": 1723581490,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyx7wg",
      "score": 1,
      "body": "Your child will learn trading, not investing.  Investing means you deeply research a company, build your thesis then put your money into the company and step away for a period of time.  As a 12 year the stocks will go up and down on a daily basis and they will be making changes out of emotion.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyx7wg/",
      "created": 1723581777,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyxvpj",
      "score": 1,
      "body": "Yes!!!!!!!!",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyxvpj/",
      "created": 1723582265,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyyvcx",
      "score": 1,
      "body": "One tip: pray he doesn’t use nana’s inheritance on intel",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyyvcx/",
      "created": 1723582711,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyzqpm",
      "score": 1,
      "body": "Buffet says to buy the s&p and forget about it",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhyzqpm/",
      "created": 1723583358,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz1ehy",
      "score": 1,
      "body": "No, he’s twelve and that’s illegal. What you can do, though, is make trades on his behalf. You should be the one doing any clicking and typing and everything needs to be in your name.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhz1ehy/",
      "created": 1723584029,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz1y0r",
      "score": 1,
      "body": "https://www.stockmarketgame.org/\n\nIt's everything you need. Includes lesson plans that provide an actual education eg why do companies issue stocks? Stocks vs bonds, etc.\n\nAlso provides paper trading account.\n\nI started my kids at 10 and 11 years old. \n\nThree years later and they can have a conversation about finances that most adults are incapable of.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhz1y0r/",
      "created": 1723584224,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz3pt4",
      "score": 1,
      "body": "I told my Dad I wanted to buy Apple when it was $16 and I was 14. So he did the trade on my behalf in his account. I’ve had a lifelong interest in trading ever since. So I wouldn’t discourage it, as long as you set some guardrails.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhz3pt4/",
      "created": 1723584845,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz3uwq",
      "score": 1,
      "body": "Wish I was investing at 12 years old, let little man start the grind you'll be happy when he's 30",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhz3uwq/",
      "created": 1723584894,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz6t4c",
      "score": 1,
      "body": "You, he, and everybody needs to stick to QQQM and VOO. Don’t buy individual stocks ever.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhz6t4c/",
      "created": 1723585897,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz77xs",
      "score": 1,
      "body": "😆",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhz77xs/",
      "created": 1723586038,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz7q5f",
      "score": 1,
      "body": "That's a wee bit sooner than me... 8 learned with pen+ paper plus the WSJ.   Keep notes... Have a strategy and goals and *WRITE Them Down*",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhz7q5f/",
      "created": 1723586208,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz7v6o",
      "score": 1,
      "body": "No, do not let him focus on money. Money has no practical use in life.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhz7v6o/",
      "created": 1723586257,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz9bpk",
      "score": 1,
      "body": "As hobbies go, he could do worse. He could also retire when he’s 30.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhz9bpk/",
      "created": 1723586758,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzbm0e",
      "score": 1,
      "body": "Have him paper trade. Losses are part of the game.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzbm0e/",
      "created": 1723587559,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzc3es",
      "score": 1,
      "body": "I was the same way. My dad didn't know enough to teach me.  I had to learn the hard way. If he's got that fire encourage him. Buy him accounting books. Sign him up for classes in financial statements. Buy him books by Peter Lynch. Message me if you need help.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzc3es/",
      "created": 1723587729,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzf03s",
      "score": 1,
      "body": "let him try",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzf03s/",
      "created": 1723588782,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzfmfy",
      "score": 1,
      "body": "Hell yeah man. I’d probably start him off paper trading. Maybe even let him do it in thinkorswim, he could really learn a lot from that program. Then maybe give him a monthly allowance for something if you can spare it. I imagine a kid that young watching it grow over time would get ecstatic. $20 used to feel like $2000 to me when I was 12",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzfmfy/",
      "created": 1723589008,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzkrib",
      "score": 1,
      "body": "Greenlight has a great investing and savings for kids. My daughter started it at 12",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzkrib/",
      "created": 1723590916,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzl8pk",
      "score": 1,
      "body": "You should absolutely nurture this and teach him how to evaluate companies, basic accounting, etc. Also introduce him to the world of indexing. It’s amazing he is curious about this at a young age.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzl8pk/",
      "created": 1723591101,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzptt2",
      "score": 1,
      "body": "Do kids pay taxes? It will be win-win if he can make money without taxes.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzptt2/",
      "created": 1723592799,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzqow1",
      "score": 1,
      "body": "I started “investing“ at 10 yo or so. I basically told me dad to put buy a certain amount of stocks for a certain price. My dad cashed me out and bought stocks for me whenever I wanted. I believe it was like this because back in the day it was really hard to get an account for a child. I thought it was amazing my dad gave me this opportunity. I also learned a lot from that. \nSo if he has saved up a couple bucks or wants to invest his next allowances/ gifts I see nothing wrong with letting him trade with that. \nJust make sure he is aware of the risk of loosing and does not let the dopamine take over his thinking. \nHowever Im sure your son will be careful if its his own money ;)",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzqow1/",
      "created": 1723593116,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzqtgt",
      "score": 1,
      "body": "VOO and VBK",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzqtgt/",
      "created": 1723593161,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzr1xk",
      "score": 1,
      "body": "Does your mother have a 700k inheritance for your son?",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzr1xk/",
      "created": 1723593247,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzrngb",
      "score": 1,
      "body": "Speaking as someone who had a keen interest in investing at that age but wasn't allowed to do so as a kid:\n\nLet him start. Let him learn. Let him do everything he can to break free. Let me give you an example:\n\nIn 2009, BTC was trading at 0.0001 per share. I was 16. I had enough money to buy 100k shares for $100. Wasn't allowed though. My family thought it was crazy, and I didn't have my own credit card, bank, nothing at the time.  In 2013, 4 years later, that same BTC was worth 10 million. I was 20. Today it fluctuates between 5 and 6 billion.\n\nNow imagine if your son who is 12, spent $100 of allowance on a stock and had 10 million dollars by the time he ws 18. \n\nI mean BTC is obviously a extreme and example case, but the principle holds that the sooner he learns, the better off he will be when it's time for him to enter society as an adult. I think it's important for him NOT to trade short term until he has learned more about investing. But I wouldn't advise against any of it if he really is that interested. It'll get him farther in life than anything else he chooses to do at that age.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzrngb/",
      "created": 1723593464,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzsb5q",
      "score": 1,
      "body": "Give him a couple hundred bucks. My first investment at 18 is still my best. Your son might have some beginners luck in him",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzsb5q/",
      "created": 1723593708,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzst2v",
      "score": 1,
      "body": "“I don’t want him focusing on money at this age….but I mean he could get SUPER FCKN RICH!!!!”\n-Solid logic my guy",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzst2v/",
      "created": 1723593893,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzttuj",
      "score": 1,
      "body": "Let him papertrade options on webull",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzttuj/",
      "created": 1723594274,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzxcun",
      "score": 1,
      "body": "As long as it’s his own money and he doesn’t have options enabled. I say go for it!",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzxcun/",
      "created": 1723595591,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzxrci",
      "score": 1,
      "body": "There are some practice trading apps that work off the real market. I'd let him use those for awhile, before I let him loose with actual money",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/lhzxrci/",
      "created": 1723595740,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li04kgx",
      "score": 1,
      "body": "I’d totally help him. Start  a small account, maybe in his name.\n\nAnd feeling bad about losses isn’t a bad thing. It’s the average when you trade, and it’s an important lesson to learn. Stocks are brutal, and your 13 year old probably isn’t going to have the patience to hold long term(but who knows). \n\nSo yeah I’d definitely help him, maybe offer extra chores or something to help juice the account haha. \n\nBut the long term lesson, should really be, keep your account suitably invested etc. him losing some of the money, is better to do now than later.\n\nIf you’re really trying to teach your son a lesson. Have a secret mirrored account. Match his contributions, but invest solely in appropriate index funds.\n\nAfter awhile, maybe a year or 2 , or if he gives up. Show him your account and compare. Really hammer home how little work it was to invest your account.\n\nThen he learns the greatest investing lesson of all. Ya need to learn to make money.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li04kgx/",
      "created": 1723598289,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li05sv6",
      "score": 1,
      "body": "Open a Fidelity Youth Account when he turns 13. \n\nI opened one for my son as soon as he turned 13 when he expressed interest in investing as well, it’s been a year and working out great so far.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li05sv6/",
      "created": 1723598754,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li09t4a",
      "score": 1,
      "body": "Even as an adult I used Investopedia's trading app to learn on and observe. it's a great tool. I would recommend this to kids/teens who show interest. It's something you could do together and eventually if you can get him to explain what he's learning to you, you would be winning at parenting. It'd be unofficial home schooling. In the end though, who's schooling who? Time will tell. Go for it!",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li09t4a/",
      "created": 1723600267,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0akri",
      "score": 1,
      "body": "Let him paper trade! OR give him small amounts like $200 to start. And then see how he does. Yolo",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li0akri/",
      "created": 1723600557,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0aoo7",
      "score": 1,
      "body": "Open up a custodial account and teach- I do that with my three youngest kids",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li0aoo7/",
      "created": 1723600598,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0hlja",
      "score": 1,
      "body": "Could be that feeling bad about losses is exactly what he needs? Sometimes lessons are learned the hard way.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li0hlja/",
      "created": 1723603279,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0hsgc",
      "score": 1,
      "body": "Either: let him put a little money into a low cost index NOW a little at a time (which will make it possible for him to retire in comfort some day), OR buy him a tenth of an ounce of gold 4X a year (which will do the same thing, without the volatility) -",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li0hsgc/",
      "created": 1723603356,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0lxpj",
      "score": 1,
      "body": "You’re using the words investing and trading. You don’t want your kid addicted to trading(gambling) on his phone. You do want him educated on money and investing.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li0lxpj/",
      "created": 1723605050,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0scel",
      "score": 1,
      "body": "Exposing money concept at early age is a great idea, i dont see any harm in it. My mother taught me about saving when i was at that age too, and that has mold me who i am today. But i think you should teach your son more on investment rather than trading, teach him on snowball effect, which brand he is interested and etc",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li0scel/",
      "created": 1723607890,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0t1vc",
      "score": 1,
      "body": "On Schwab Think or Swim your son can practice virtual trade, it's called a paper trading account. Real figures but rest everything is fake. Good for practice you get like 200k paper trade to practice real stocks.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li0t1vc/",
      "created": 1723608222,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0uyoz",
      "score": 1,
      "body": "My dad let me trade $1,000 for him on E*trade when I was 16. In the beginning I was making really well informed trades and doubled my money within a year. I ended up “gambling” it all in options and lost everything  \n\nPoint to my story is, even though I lost all the money, it was the most valuable lesson I have had. My dad basically paid $1,000 on a crash course to all things investing, and I know I won’t make the same mistake again when I have more money I could have lost to the same situation.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li0uyoz/",
      "created": 1723609146,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0wv0c",
      "score": 1,
      "body": "I would just give him $100 or $1k and have him read a couple of books/pdfs on asset allocation, then set him free with an account. It is better to learn through doing then learning all the theory like a professor for 10 years. At age 12 you should just remind him when he is about to do a trade to, \"buy low to sell high and buy high to sell higher.\" That's it, and wish him smarts and luck.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li0wv0c/",
      "created": 1723610092,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0xjla",
      "score": 1,
      "body": "Set up a paper trade account with $100K to start and tell him it’s real. ",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li0xjla/",
      "created": 1723610441,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li15uxg",
      "score": 1,
      "body": "have him get his feet with paper trading? [https://www.tradingview.com/support/solutions/43000516466-paper-trading-main-functionality/](https://www.tradingview.com/support/solutions/43000516466-paper-trading-main-functionality/)",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li15uxg/",
      "created": 1723614972,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li18w7x",
      "score": 1,
      "body": "Use a platform that offers a pretend money account. Thats always the best way to get started and learn. I absolutely would not be learning with real money, child or otherwise.\n\nFrankly you cannot make a reliable career from investing in and trading stocks, shares, commodities, etfs, etc.. etc... it is a zero sum game and you are competing with super computers and armies of coporate traders. Certainly for stocks anyway.  \n\nWarren buffet was born into a wealthy family with political ties and graduated from 3 different universities. His father was also a stock broker that personally trained him. It took him around 20 years from there to become truly successful even with all his advantages and even then it was as a partnership.\n\nHe mad his fortune by starting and inserting himself into successful bussineses.",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li18w7x/",
      "created": 1723616795,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li18xnm",
      "score": 1,
      "body": "I think everyone's missing that investopedia is a simulator with fake money. Go for it",
      "permalink": "/r/stocks/comments/1ercarc/i_have_a_12_year_son_who_seems_interested_in/li18xnm/",
      "created": 1723616820,
      "depth": 0,
      "replies": []
    }
  ]
}