{
  "title": "Lithium down bigtime. What's the move? ",
  "score": 99,
  "selftext": "Lithium is down like 95% and looks like a great time to buy for next cycle whenever that is. \n\nSo far what I understood is that we are seeing a slowdown in the EV market, particularly in China. The rapid demand in EV drove the growth, leading to now an oversupply.\n\nTrying to gather info on this sector. Major lithium deposits are in Australia, Chile, and Argentina, with Australia being the largest producer.\n\nIs there anything else that contributed to this?\nAny good picks with big deposits taken to maintenance or better yet waiting to go online? \n\nI have experience from Uranium but havn't invested in any other minerals \n",
  "link_flair_text": null,
  "id": "1ergu30",
  "num_comments": 77,
  "created_utc": 1723577337,
  "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/",
  "comments": [
    {
      "id": "lhynp7w",
      "score": 110,
      "body": "Lithium is extremely abundant, which is why Tesla invested in a refinery, and Elon's mentioned a decrease in lithium usage from battery tech evolution.\n\nNations with large deposits currently being mined will only be useful if there is domestic comparative advantage in the downstream, which there really isn't.\n\nThe only reason the price spiked during the pandemic was supply disruptions as well as a pivot from cobalt amid the overall constraint derived inflation. Lithium could still drop another 50% before reaching an ATL.",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhynp7w/",
      "created": 1723578768,
      "depth": 0,
      "replies": [
        {
          "id": "lhyyof1",
          "score": 24,
          "body": "Lithium is extremely abundant but it’s not easy to find a competent mine building team. I think supply will still struggle to catch up to demand in the long run.",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhyyof1/",
          "created": 1723582606,
          "depth": 1,
          "replies": [
            {
              "id": "li0q7ic",
              "score": 6,
              "body": "Also major growth in lithium battery recycling",
              "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li0q7ic/",
              "created": 1723606916,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "li0ot27",
          "score": 4,
          "body": "Whoa.. great DD",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li0ot27/",
          "created": 1723606286,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li0egrk",
          "score": 5,
          "body": "Domestic comparative advantage?  \n\nA redditor that knows something about econ?  \n\nListen to this person everyone.",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li0egrk/",
          "created": 1723602045,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhzjwl9",
          "score": 7,
          "body": "you dont see any issue with world lithium dependance on Chinese overproduction?? The whole reason they are overproducing is to hook the world on their supply and force interdependance in these material sectors... Then they hold power over this whole green revolution. The comparatve advantage will come from gov intervention, there's a reason both libs and dems want to tax and tariff china to hell, they are an adversary as of now",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhzjwl9/",
          "created": 1723590591,
          "depth": 1,
          "replies": [
            {
              "id": "li28oh6",
              "score": 5,
              "body": "China isn't the major lithium producer. Australia produces more than twice a much and Chile also produces more than China. \n\nChina is 'only' the major lithium *refiner* but that is something likely to change in the future as other countries - or even individual companies like Tesla - aim to keep that part of the revenue stream for themselves.",
              "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li28oh6/",
              "created": 1723637750,
              "depth": 2,
              "replies": [
                {
                  "id": "li71ulk",
                  "score": 1,
                  "body": "Great points.\n\nAnd all of this is ignoring the fact that a ion substitute for lithium batteries is sodium. Which is available for real cheap as rock salt and sea salt.\n\nThere is no way China is going to gain geopolitical power over lithium mining OR refining like OPEC did with oil.",
                  "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li71ulk/",
                  "created": 1723699452,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ls2t7j8",
                  "score": 1,
                  "body": "sorry to be responding to an old thread- but chinese companies have at least 50% stake in the largest lithium mines in australia",
                  "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/ls2t7j8/",
                  "created": 1729016805,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lhzp73n",
              "score": 9,
              "body": "How are they going to hook the global economy on a resource that's globally abundant and being innovated away from?",
              "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhzp73n/",
              "created": 1723592569,
              "depth": 2,
              "replies": [
                {
                  "id": "lhzw611",
                  "score": 7,
                  "body": "The same way the Arab states have the world hooked on oil…they streamline the production of it to the point that people would rather pay them than produce their own supply line",
                  "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhzw611/",
                  "created": 1723595146,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhzxgsd",
                      "score": 2,
                      "body": "If they're the same, then why is oil up several hundred percent from its decades lows while lithium just dropped to a mere 50% above decade lows?\n\nChina may do well and fine meeting their own supply, and competing in the global market for a devaluing commodity. But lithium and crude oil is apples and oranges, or the market would be pricing in lithium with more potential growth than it is currently.\n\nAllocate how you want to allocate. People thought the same thing about cobalt. The scarcity dynamic is vastly different for lithium and crude - just look at the US SPR - and crude has much fewer substitutes. Additionally, lithium can be recycled.",
                      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhzxgsd/",
                      "created": 1723595632,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "li00id3",
                          "score": 3,
                          "body": "OPEC. Production costs. All the easy oil has been tapped.",
                          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li00id3/",
                          "created": 1723596767,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "li0p84j",
                          "score": 1,
                          "body": "They're at different points in the cycle... \n\n1) drop prices to disincentivise production in competitors\n2) consolidate your monopoly control or the resource/supply chain\n3) milk profits\n4) get greedy, other nations start their own production\n\n\nOil is at (4), lithium is at (1), but countries are expecting (3) because of OPEC and trying to protect their own economies.  Fwiw lithium can be way more problematic than oil because refining has complexity but not that much, the amount of space for battery innovation and improvement is potentially much higher, so getting locked out early is much worse. (Though it's also possible that the world pivots away from lithium technologies as batteries, maybe less likely especially short/medium term though)",
                          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li0p84j/",
                          "created": 1723606476,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "li0qgc7",
                              "score": 3,
                              "body": "The product life cycles doesn’t apply to commodities, but even if they were at “different points in the cycle,” they’re entirely different commodities with different uses, scarcity levels, and subject to the same trade laws.\n\nIt is literally not profitable to mine lithium, which goes against publicly traded mines’ bylaws and security regulations. They can’t just dump it, outside of anti-dumping laws, and they can’t afford to consolidate without divestment. There’s no profits to milk bro - find us one profitable lithium mine with growing revenue.\n\nDid you know over 50% of the world’s uranium supply is being stockpiled by Sprott? They do that to create scarcity. Lithium companies don’t have that luxury - why? Because just like with crude, it and uranium has scarcity. Lithium is extremely abundant, which is why Tesla invested in refinement and not mining.",
                              "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li0qgc7/",
                              "created": 1723607025,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "li0u03a",
                                  "score": 0,
                                  "body": "It's almost as if someone is flooding the market to keep prices down, while simultaneously building up refining and manufacturing capabilities for their supply chain, which is hugely profitable, to disincentivise investment from external sources... I wonder if they could monopolize that capacityand raise prices once they've driven down competition?\n\nThe bottom line is that abundant or not, if you want high grade lithium for batteries you need a bunch of capex. Then you need battery manufacturing ability. If you think about \"batteries\" as a product in place of \"oil\" (instead of lithium directly) it may be more obvious.",
                                  "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li0u03a/",
                                  "created": 1723608682,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lhyv3df",
      "score": 32,
      "body": "Wait two years for most of the companies to shut down and supply to start to constrain. There was never a shortage of lithium, only processing capacity, and that has been over-built in response to the EV hype bubble.  Some projects still in construction won't be economical when they're finished due to the fallen price, others will lose out to cheaper methods that have been developed in the interim. The major oil companies have to handle a lot of lithium as a waste product, if they get a handle on extracting it from petroleum brines it's game over for hardrock miners. It can also be extracted from waste seawater brines in desalination plants.\n\nIt's different to uranium in that we don't actually know if lithium batteries will be required in the long term for EVs. Sodium-ion batteries are being rolled out, and solid state types and emerging. It's not a solved problem yet (range especially) so betting on the winner is extremely risky.",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhyv3df/",
      "created": 1723581093,
      "depth": 0,
      "replies": [
        {
          "id": "lhz1m9j",
          "score": 8,
          "body": "> It's different to uranium in that we don't actually know if lithium batteries will be required in the long term for EVs. Sodium-ion batteries are being rolled out\n\nSo when it comes to Sodium-ion batteries it has some advantages over Lithium, mainly being it's cheaper and more abundant. But the disadvantage is it's not as energy dense, and it's heavier, which puts it at a disadvantage in vehicles.\n\nLong term the cheaper EV's (like those made as daily commuter vehicles) will likely use sodium-ion batteries. But those met to have longer range, or to be more premium luxury vehicles will have Lithium-ion batteries. This is what's already happening in China, where ICE vehicles are quickly going extinct in the new car market.\n\nThat said, when it comes to battery storage Sodium-ion is definitely going to eat up Lithium's market share, since the disadvantages of Sodium-ion batteries (like more weight and more space being taken up to store the same amount of energy) aren't really much of an issue for stationary battery storage.",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhz1m9j/",
          "created": 1723584107,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhyufxy",
      "score": 14,
      "body": "If lithium then ->>> Albemarle (ALB)\nThey were the largest provider of lithium in 2020. Not just that but they also have some bromine extraction sites. I think ALB is the play when lithium prices start to rise again",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhyufxy/",
      "created": 1723580888,
      "depth": 0,
      "replies": [
        {
          "id": "li0buhr",
          "score": 3,
          "body": "What about LAC",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li0buhr/",
          "created": 1723601040,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhzka0y",
          "score": 1,
          "body": "ALTM as well. Both great companies being done in by chinese overproduction. The chinese are used to overproducing just to consolidate the whole mkt with gov intervention when it becomes unprofitable. Producing double the worlds demand of these will lead to a loss and restructure from China, and then these compoanies will look like huge discounts. Only risk really is long term replacement of lithium as the main component of these EV/storage systems",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhzka0y/",
          "created": 1723590732,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhzvsr1",
          "score": 1,
          "body": "At least ALB should be able to weather the storm with income from their other businesses. Small lithium only producers are the ones who will die first.",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhzvsr1/",
          "created": 1723595007,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhymdn5",
      "score": 30,
      "body": "Battery chemistry is changing to reduce the amount of lithium per battery by a lot. Elon mentioned this change of chemistry in the last earnings call",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhymdn5/",
      "created": 1723578355,
      "depth": 0,
      "replies": [
        {
          "id": "lhyuksj",
          "score": 15,
          "body": "So Lithium was supposed to be the pick and shovel play for EVs. But then people started using bulldozers.\n\nAnother example of why the obvious move often doesn’t work out.",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhyuksj/",
          "created": 1723580930,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhynuyc",
          "score": 8,
          "body": "Right on. It is even possible the next generation of batteries are completely Lithium free (couple of contenders rn).",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhynuyc/",
          "created": 1723578817,
          "depth": 1,
          "replies": [
            {
              "id": "li1op6y",
              "score": 1,
              "body": "Yes.",
              "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li1op6y/",
              "created": 1723626918,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lhytzdz",
              "score": -8,
              "body": "No",
              "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhytzdz/",
              "created": 1723580744,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "li2slnt",
          "score": 1,
          "body": "I just read through the last two earnings calls (July and April) and I can’t find anything regarding a change in chemistry of the battery.",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li2slnt/",
          "created": 1723645131,
          "depth": 1,
          "replies": [
            {
              "id": "li8bnv4",
              "score": 0,
              "body": "Google Elon musk new battery with no lithium, lots of articles, and videos of him describing the new chemistry’s",
              "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li8bnv4/",
              "created": 1723725648,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lhyw17d",
      "score": 3,
      "body": "My thoughts on this: \n\nBull case: \n- New Lithium mines in europe planned e.g. Germany has a lot in the ground which hasn't even been touched yet\n\nBear case:\n- New technology (e.g. Sodium-Ion Battery) \n- Already protests in europe cause of Nature 🍀 It will be really hard to justify if the price stays this low\n\nATM I'm watching from the sidelines. I'm watching for a shift in politics/incentives: If the need for electric cars in europe comes quickly due to bans of diesel and others in the next years the local car industry might still habe to use \"old battery\" technology in case they didn't keep up with research and thus need lithium. \n\nBut this is just an Idea, I haven't done a ton of research",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhyw17d/",
      "created": 1723581394,
      "depth": 0,
      "replies": [
        {
          "id": "lhz2zx3",
          "score": 4,
          "body": "\"New Lithium mines in europe planned e.g. Germany has a lot in the ground which hasn't even been touched yet\"\n\nEhh... I think your bull case indicates that there's untapped supply that can be mined to cap any price increases that might come with a substantive increase in demand, right? That certainly doesn't seem super bullish for lithium to me. Am I misunderstanding what you're saying here?",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhz2zx3/",
          "created": 1723584594,
          "depth": 1,
          "replies": [
            {
              "id": "lhz41ze",
              "score": 2,
              "body": "Sry I didn't specify enough. I was looking into regional mining stocks. You're totally right with your argument.",
              "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhz41ze/",
              "created": 1723584963,
              "depth": 2,
              "replies": [
                {
                  "id": "lhz5x6v",
                  "score": 1,
                  "body": "Makes sense... Do you know of one that's setting up an operation in Germany? That'd be interesting...",
                  "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhz5x6v/",
                  "created": 1723585596,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhz73m6",
                      "score": 3,
                      "body": "Here's the one I found: https://zinnwaldlithium.com   I'm not super convinced though. I think it will be cheaper and easier for Germany to import from another EU Country. Too much hassle with regulations, environment and labour costs. There are plans to mine in Serbia which is however answered with huge protests (https://www.bbc.com/news/articles/cged9qgwrvyo). I haven't checked other EU mines, let me know If you find sth",
                      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhz73m6/",
                      "created": 1723585997,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lhz752r",
                          "score": 1,
                          "body": "It looks like you shared an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.bbc.com/news/articles/cged9qgwrvyo](https://www.bbc.com/news/articles/cged9qgwrvyo)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)",
                          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhz752r/",
                          "created": 1723586011,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lhzj3ug",
          "score": 1,
          "body": "Germany seems like a tough jurisdiction to work in. I know for Uranium they shutdown their plants and went back to Coal( atleast that's what I last recall).",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhzj3ug/",
          "created": 1723590293,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhzfnql",
      "score": 4,
      "body": "Commodity cycle usually bottom after 5 years from peak.\n\nSupply for lithium is still far more than demand.  Hybrid are more popular than full EV until charging networks ate actually built. And that'll be a while.\n\nUntil you can present a thesis why demand will outpace supply, you should stay clear.\n\nCommodities are notorious for boom bust cycles that can last a decade.",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhzfnql/",
      "created": 1723589021,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzkt08",
      "score": 7,
      "body": "Check out $LAC… speculative long term play but it’s been beaten down recently and had a nice day today….",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhzkt08/",
      "created": 1723590932,
      "depth": 0,
      "replies": [
        {
          "id": "li0c0gx",
          "score": 1,
          "body": "Some people are betting on it, I’m just not sure.",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li0c0gx/",
          "created": 1723601102,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhylsl8",
      "score": 7,
      "body": "I'm still adding to Piedmont Lithium. Let's see if it pays off",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhylsl8/",
      "created": 1723578170,
      "depth": 0,
      "replies": [
        {
          "id": "lhzlmlz",
          "score": 4,
          "body": "Spoiler Alert: It hasn't",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhzlmlz/",
          "created": 1723591248,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhzbj4p",
      "score": 3,
      "body": "I'm accumulating ALB rn",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhzbj4p/",
      "created": 1723587531,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzgqmd",
      "score": 3,
      "body": "God damn it Marie they're minerals",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhzgqmd/",
      "created": 1723589418,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhytgyr",
      "score": 5,
      "body": "For me ALB is the way to go.  They have a lot more than just Lithium mines and their drop is almost entirely due to lithium.  Super good miner and pays you to sit on it.  Great IRA holder...",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhytgyr/",
      "created": 1723580583,
      "depth": 0,
      "replies": [
        {
          "id": "lhyv14c",
          "score": 4,
          "body": "They're bleeding cash and could/should cut their dividend any quarter to divest the hell out of lithium.\n\nThere's a reason they're trading below book value, such as negative net income and negative return on equity while their revenue is dropping. \n\nI'm thankful I don't own any, but GLHF",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhyv14c/",
          "created": 1723581072,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhzk9m3",
      "score": 2,
      "body": "My question is, there are so many other stocks around. Why lithium? This commodity no longer has any guarantee that it will go up like it has previously.",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhzk9m3/",
      "created": 1723590728,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lii7j2d",
      "score": 2,
      "body": "LAC",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lii7j2d/",
      "created": 1723860573,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhyknw0",
      "score": 6,
      "body": "FWIW, I’m buying into lithium through LIT.  The need for battery power isn’t going away and I think you’ll see more and more demand for new hybrids that have the savings of electric and the range of gas.",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhyknw0/",
      "created": 1723577814,
      "depth": 0,
      "replies": [
        {
          "id": "lhyon0u",
          "score": 12,
          "body": "Yeah the need for battery power wont go away. But the need for lithium might.",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhyon0u/",
          "created": 1723579057,
          "depth": 1,
          "replies": [
            {
              "id": "lhyrouk",
              "score": 3,
              "body": "No, it’s far too commonly used and has other electronic applications. It’s just a demand shift, and it’s likely cyclic with runs of overproduction and underproduction.",
              "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhyrouk/",
              "created": 1723580020,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lhzg5xx",
          "score": 1,
          "body": "But stationary battery may pivot to sodium-cobalt.",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhzg5xx/",
          "created": 1723589208,
          "depth": 1,
          "replies": [
            {
              "id": "lhzimjg",
              "score": 3,
              "body": "Like I said, the market will find a balance.",
              "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhzimjg/",
              "created": 1723590112,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lhz4od3",
      "score": 2,
      "body": "Patriot Battery Metals has a large deposit located in Northern Quebec, and it keeps getting bigger as they do more drilling. They're very early in the process though.",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhz4od3/",
      "created": 1723585176,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li03zuq",
      "score": 2,
      "body": "I like uranium stocks right now. Just bought a little Cameco and NexGen from the TSX.",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li03zuq/",
      "created": 1723598073,
      "depth": 0,
      "replies": [
        {
          "id": "li06zus",
          "score": 1,
          "body": "Hello fellow uranium investor! 👋",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li06zus/",
          "created": 1723599206,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhz2d0a",
      "score": 1,
      "body": "A lot of mining is on sale, Vale is back to 10 bucks",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhz2d0a/",
      "created": 1723584372,
      "depth": 0,
      "replies": [
        {
          "id": "lhzca1g",
          "score": 1,
          "body": "You got my attention with Vale, have seen this name multiple times before. \n\nNeed to check their deposits and the jurisdiction.",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhzca1g/",
          "created": 1723587793,
          "depth": 1,
          "replies": [
            {
              "id": "lhzgmzf",
              "score": 2,
              "body": "China is pivoting their economy from Real estate to tech, so iron ore usage will collapse.\n\nSteel prices are collapsing now.\n\nIf India, builds like China did, than yeah, another iron ore supercycle.  But no one thinks India can build inftastructure and houses like China.",
              "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhzgmzf/",
              "created": 1723589381,
              "depth": 2,
              "replies": []
            },
            {
              "id": "li0pq1f",
              "score": 1,
              "body": "The ideal time to buy it is between 5 and $6, at $10 it's one of those things you might buy like 10 shares of just so it's on your radar and cost average into. It's a long-term play though because you are really sure when the next ramp up in global GDP will take place. Normally you sell Vale at the end of a cycle and buy it during the reset which is what we're going through right now, it often bottoms in the single digits though",
              "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li0pq1f/",
              "created": 1723606699,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lhz45qe",
          "score": 0,
          "body": "can’t wait for it to hit $30 on the next upswinf",
          "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhz45qe/",
          "created": 1723584998,
          "depth": 1,
          "replies": [
            {
              "id": "li0pwrq",
              "score": 2,
              "body": "It likely will, the question is just how many years it takes, I've made money with it a few times in my life and the best strategy is to buy it under 10 and forget you own it until things get hot again. If you can play the long game, it does work",
              "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li0pwrq/",
              "created": 1723606783,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lhz7m3t",
      "score": 1,
      "body": "Let’s see if those salt-based batteries are viable, and if they will ever replace lithium ones",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhz7m3t/",
      "created": 1723586170,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz9b2y",
      "score": 1,
      "body": "puts on ALB and SQM",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhz9b2y/",
      "created": 1723586752,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzlxig",
      "score": 1,
      "body": "New processes emerging, DLE is the bet as of now but lots of interesting technologies past piloting phase that were showcased at the recent conferences in Calgary/Las Vegas. \n\nSLI is who I’m on currently as a forefront for DLE in North America. LCE as well but full disclosure I’m down bad on both 😂 still have faith though long term",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/lhzlxig/",
      "created": 1723591363,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li03u49",
      "score": 1,
      "body": "I",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li03u49/",
      "created": 1723598012,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0kynu",
      "score": 1,
      "body": "Due to Chinese industrial policies, it’s probably fair to compare to Silicon.  You might make a buck in the short run here or there.  In the long run, you’re not gonna have a good time.",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li0kynu/",
      "created": 1723604640,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0uz7u",
      "score": 1,
      "body": "Maybe someone with more knowledge on the subject can elaborate, but don't EV batteries also need minerals like cobalt, which are rare and also a serious conflict mineral in places like the Congo? Would that affect lithium stocks at all because of the codependency?",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li0uz7u/",
      "created": 1723609152,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li24x5t",
      "score": 1,
      "body": "Consider advances in battery technology could make lithium obsolete in less than 2 decades. So many innovations in the pipeline right now that don’t include lithium, in addition to improving efficiency",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li24x5t/",
      "created": 1723636093,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li2g0y1",
      "score": 1,
      "body": "I walked away from lithium a while ago now. I decided it was way over hyped.\n\nFyi, lithium batteries don't have as much lithium in them as you think. Off the top of my head, I think they have a lot more nickel than lithium in them.\n\nI believe lithium batteries will go down in history as a stepping stone to newer more stable battery tech and that tech is just around the corner.",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li2g0y1/",
      "created": 1723640685,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li4lsl5",
      "score": 1,
      "body": "If we could just get one person to make an investment case that ISNT “thing down so it’s a good time to buy” I would die of happiness",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li4lsl5/",
      "created": 1723665863,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li4y7yh",
      "score": 1,
      "body": "There's already viable battery prototype going on as we speak that doesn't require the use of rare Earth Metals like Lithium. \n\nIt's my belief that Lithium and most rare Earth metals are the next go out of fashion after fossil fuels.",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li4y7yh/",
      "created": 1723669737,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li547u6",
      "score": 1,
      "body": "The is abundant supply in US. ABAT has six sites could be in mining production quickly. They have a battery recycling plant in full production already. Everything is recycled in that plant.",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li547u6/",
      "created": 1723671688,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li5von9",
      "score": 1,
      "body": "Rio Tinto is currently exploring ways to mine lithium in Serbia. The estimated reserves are 1,1 million tonnes, which covers 90% of the EU needs. \n\nMining is set to start in two years.",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/li5von9/",
      "created": 1723681376,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liaess8",
      "score": 1,
      "body": "Nili.v",
      "permalink": "/r/stocks/comments/1ergu30/lithium_down_bigtime_whats_the_move/liaess8/",
      "created": 1723750113,
      "depth": 0,
      "replies": []
    }
  ]
}