{
  "title": "Bloomberg: US Considers a Rare Antitrust Move: Breaking Up Google",
  "score": 3313,
  "selftext": "A rare bid to break up Alphabet Inc.’s Google is one of the options being considered by the Justice Department after a landmark court ruling found that the company monopolized the online search market, according to people with knowledge of the deliberations.\n\nThe move would be Washington’s first push to dismantle a company for illegal monopolization since unsuccessful efforts to break up Microsoft Corp. two decades ago. Less severe options include forcing Google to share more data with competitors and measures to prevent it from gaining an unfair advantage in AI products, said the people, who asked not to be identified discussing private conversations.\n\nRegardless, the government will likely seek a ban on the type of exclusive contracts that were at the center of its case against Google. If the Justice Department pushes ahead with a breakup plan, the most likely units for divestment are the Android operating system and Google’s web browser Chrome, said the people. Officials are also looking at trying to force a possible sale of AdWords, the platform the company uses to sell text advertising, one of the people said.\n\nThe Justice Department discussions have intensified in the wake of Judge Amit Mehta’s Aug. 5 ruling that Google illegally monopolized the markets of online search and search text ads. Google has said it will appeal that decision, but Mehta has ordered both sides to begin plans for the second phase of the case, which will involve the government’s proposals for restoring competition, including a possible breakup request.\n\nAlphabet shares fell as much as 2.5% to $160.11 in after-hours trading before erasing some losses.\n\nA Google spokesman declined to comment on the possible remedy. A Justice Department spokeswoman also declined to comment.\n\nThe US plan will need to be accepted by Mehta, who would direct the company to comply. A forced breakup of Google would be the biggest of a US company since AT&T was dismantled in the 1980s.\n\nJustice Department attorneys, who have been consulting with companies affected by Google’s practices, have raised concerns in their discussions that the company’s search dominance gives it advantages in developing artificial intelligence technology, the people said. As part of a remedy, the government might seek to stop the company from forcing websites to allow their content to be used for some of Google’s AI products in order to appear in search results.\n\n**Breakup**\n\nDivesting the Android operating system, used on about 2.5 billion devices worldwide, is one of the remedies that’s been most frequently discussed by Justice Department attorneys, according to the people. In his decision, Mehta found that Google requires device makers to sign agreements to gain access to its apps like Gmail and the Google Play Store.\n\nThose agreements also require that Google’s search widget and Chrome browser be installed on devices in such a way they can’t be deleted, effectively preventing other search engines from competing, he found.\n\nMehta’s decision follows a verdict by a California jury in December that found the company monopolized Android app distribution. A judge in that case hasn’t yet decided on relief. The Federal Trade Commission, which also enforces antitrust laws, filed a brief in that case this week and said in a statement that Google shouldn’t be allowed “to reap the rewards of illegal monopolization.”\n\nGoogle paid as much as $26 billion to companies to make its search engine the default on devices and in web browsers, with $20 billion of that going to Apple Inc.\n\nMehta’s ruling also found Google monopolized the advertisements that appear at the top of a search results page to draw users to websites, known as search text ads. Those are sold via Google Ads, which was rebranded from AdWords in 2018 and offers marketers a way to run ads against certain search keywords related to their business. About two-thirds of Google’s total revenue comes from search ads, amounting to more than $100 billion in 2020, according to testimony from last year’s trial.\n\nIf the Justice Department doesn’t call for Google to sell off AdWords, it could ask for interoperability requirements that would make it work seamlessly on other search engines, the people said.\n\n**Data Access**\n\nAnother option would require Google to divest or license its data to rivals, such as Microsoft’s Bing or DuckDuckGo. Mehta’s ruling found that Google’s contracts ensure not only that its search engine gets the most user data – 16 times as much as its next closest competitor — but that data stream also keeps its rivals from improving their search results and competing effectively.\n\nEurope’s recently enacted digital gatekeeper rules imposed a similar requirement that Google make available some of its data to third-party search engines. The company has said publicly that sharing data can pose user privacy concerns, so it only makes available information on searches that meet certain thresholds.\n\nRequiring monopolists to allow rivals to have some access to technology has been a remedy in previous cases. In the Justice Department’s first case against AT&T in 1956, the company was required to provide royalty-free licenses to its patents.\n\nIn the antitrust case against Microsoft, the settlement required the Redmond, Washington, tech giant to make some of its so-called application programming interfaces, or APIs, available to third-parties for free. APIs are used to ensure that software programs can effectively communicate and exchange data with each other.\n\n**AI Products**\n\nFor years, websites have allowed Google’s web crawler access to ensure they appear in the company’s search results. But more recently some of that data has been used to help Google develop its AI.\n\nLast fall, Google created a tool to allow websites to block scraping for AI, after companies complained. But that opt-out doesn’t apply to everything. In May, Google announced that some searches will now come with “AI Overviews,” narrative responses that spare people the task of clicking through various links. The AI-powered panel appears underneath queries, presenting summarized information drawn from Google search results from across the web.\n\nGoogle doesn’t allow website publishers to opt-out of appearing in AI Overviews, since those are a “feature” of search, not a separate product. Websites can block Google from using snippets, but that applies to both search and the AI Overviews.\n\nWhile AI Overviews only appear on a fraction of searches, the feature’s roll-out has been rocky after some excerpts offered embarrassing suggestions, like advising people to eat rocks or to put glue on pizza.\n\nhttps://www.bloomberg.com/news/articles/2024-08-13/doj-considers-seeking-google-goog-breakup-after-major-antitrust-win",
  "link_flair_text": "Company News",
  "id": "1eriwi8",
  "num_comments": 598,
  "created_utc": 1723582995,
  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/",
  "comments": [
    {
      "id": "lhz2f7z",
      "score": 771,
      "body": "When the DOJ Googles what to do in this situation, Google will inform the DOJ to let Google be. Always listen to what your Godgle tells you to do! Godgle is our Lord and Savior! Godgle has all of the answers!",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz2f7z/",
      "created": 1723584394,
      "depth": 0,
      "replies": [
        {
          "id": "lhz8s77",
          "score": 149,
          "body": "I laughed as I read this on my Google Pixel phone",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz8s77/",
          "created": 1723586569,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhzhchk",
          "score": 25,
          "body": "Godgle!",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzhchk/",
          "created": 1723589640,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li0rtnf",
          "score": 7,
          "body": "Lougle",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0rtnf/",
          "created": 1723607650,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhzbx6i",
          "score": 19,
          "body": "Google should respond by banning all US government IP addresses from their websites.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzbx6i/",
          "created": 1723587669,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhz2z8j",
          "score": 9,
          "body": "This comment is great",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz2z8j/",
          "created": 1723584588,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li2ww0u",
          "score": 2,
          "body": "I read this in the bat dad’s voice from south park.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li2ww0u/",
          "created": 1723646545,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhz54xg",
      "score": 669,
      "body": "I love how all the comments here have no defense in light of the argument that Google is monopolistic, but rather that we should let them continue their success which is in part by virtue of their monopoly or provide some highly irrelevant tangential points",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz54xg/",
      "created": 1723585332,
      "depth": 0,
      "replies": [
        {
          "id": "lhz7jm9",
          "score": 361,
          "body": "Breaking up Google would obviously be great for shareholders as well, it would unlock huge value in all of the new companies. People seem annoyed by the idea that monopolies are even bad, which is hilarious.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz7jm9/",
          "created": 1723586148,
          "depth": 1,
          "replies": [
            {
              "id": "lhzdmdx",
              "score": 248,
              "body": "Chrome is a free product subsidized by Google revenue, so is Android. If they tear those off, you get two profitless husks that have virtually no revenue.",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzdmdx/",
              "created": 1723588274,
              "depth": 2,
              "replies": [
                {
                  "id": "li0n6jq",
                  "score": 78,
                  "body": "What is the point of trying to make an independant company out of a browser? Why would Apple and MSFT not need to do the same? Makes no sense. And how is a browser a business?",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0n6jq/",
                  "created": 1723605576,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "li2b4xw",
                      "score": 15,
                      "body": "Ask Brave, Duckduckgo, Firefox (Mozilla), etc.",
                      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li2b4xw/",
                      "created": 1723638774,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "li2we9l",
                          "score": 21,
                          "body": "And where do Mozilla main source of income come from.... Google",
                          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li2we9l/",
                          "created": 1723646385,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "li3sjaz",
                              "score": 3,
                              "body": "Mozilla, the organization behind Firefox, is a non-profit foundation.\n\nIts primary revenue comes from:  [1. Who we are - Mozilla Foundation](https://foundation.mozilla.org/en/who-we-are/#:~:text=Founded%20as%20a%20community%20open,Foundation%2C%20which%20leads%20our%20movement)[foundation.mozilla.org](https://foundation.mozilla.org/en/who-we-are/#:~:text=Founded%20as%20a%20community%20open,Foundation%2C%20which%20leads%20our%20movement)\n\n\n\n* **Search partnerships:** Mozilla partners with search engines like Google to display search results within Firefox. These partnerships generate revenue.  [1. Mozilla Corporation - Wikipedia](https://en.wikipedia.org/wiki/Mozilla_Corporation#:~:text=With%20the%20creation%20of%20the,the%20ensuing%20search%20results%20pages.%22)[en.wikipedia.org](https://en.wikipedia.org/wiki/Mozilla_Corporation#:~:text=With%20the%20creation%20of%20the,the%20ensuing%20search%20results%20pages.%22)\n* **Donations:** The organization also relies on donations from individuals and corporations to support its mission.  [1. Donate Now - Mozilla Foundation](https://foundation.mozilla.org/en/donate/#:~:text=Thousands%20of%20people%20like%20you,the%20Web%20open%20and%20free.)[foundation.mozilla.org](https://foundation.mozilla.org/en/donate/#:~:text=Thousands%20of%20people%20like%20you,the%20Web%20open%20and%20free.)",
                              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li3sjaz/",
                              "created": 1723656548,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "li5wu59",
                                  "score": 2,
                                  "body": "So Google?",
                                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li5wu59/",
                                  "created": 1723681804,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "li2uwks",
                          "score": 2,
                          "body": "Isn't DDG also a search engine?",
                          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li2uwks/",
                          "created": 1723645894,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "li2cf23",
                      "score": 2,
                      "body": "Browsers should be simple pieces of software rendering standardized boxes with text and images. The reason they are basically an operating system is Google turning them into one so they can have control.",
                      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li2cf23/",
                      "created": 1723639292,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "li10dl0",
                      "score": 7,
                      "body": "> how is a browser a business?\n\nThe same way a search engine, mailing platform, and free Microsoft office are. They sell your data",
                      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li10dl0/",
                      "created": 1723611904,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "li12thi",
                          "score": 10,
                          "body": "Chrome does not do anything with your data that any other browser can't do. Chrome makes no revenue. It just directs users to their search engine.",
                          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li12thi/",
                          "created": 1723613247,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "li14pge",
                              "score": 11,
                              "body": "It does make it easier for Google to collect cookies, while it gives them the option to limit 3rd party cookies.\n\nhttps://www.theguardian.com/technology/2024/apr/01/google-destroying-browsing-data-privacy-lawsuit\n\nhttps://www.cookiebot.com/en/google-third-party-cookies/\n\nIf chrome was a separate business and not connected to Google it would give other search engines a fair chance to be used.\n\nEspecially since it would mean they would have to make a deal with a search engine to make money.",
                              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li14pge/",
                              "created": 1723614309,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "li1taf5",
                                  "score": 7,
                                  "body": "Not really, Google would just do the same thing they do with Firefox, pay them a ton of money to have Google be the default search engine. The main difference would just be that Chrome now needs to find other sources of income instead of just being subsidised by Google, potentially leading to a worse product overall.",
                                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li1taf5/",
                                  "created": 1723629906,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lhzfewc",
                  "score": 27,
                  "body": "Yes, mobile devices are well known for being impossible to monetize.",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzfewc/",
                  "created": 1723588931,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "li051wr",
                      "score": 64,
                      "body": "Android isn’t the mobile devices though. It’s just the software. If it split off, they would have pixel, an extremely small part of the market share. Then, they would need to begin charging high fees for their R&D to all the other phone brands. \n\nBut the biggest players would just build off of the last free version of Android. Google play services would no longer be relevant to phones, so  Samsung’s OS likely becomes an isolated platform worth targeting like iPhone, with their own App Store taking 30%. \n\nOver time, diverging operating systems would mean apps will only target the biggest players. With no Google services, the Android company loses relevance. The next big app is only available on Samsung Galaxy and iPhone because they have the largest market shares. Small phone manufacturers like Nothing and OnePlus can no longer compete without apps, they can’t afford the R&D of their own OS, and neither can the Android company without income from services nor big manufacturer license fees.\n\nConsumers now have less hardware choice. They end up with 2 primary operating systems, but now Samsung doesn’t allow other brands to benefit from their work the way Google did.\n\nI’m no fan of monopolies but Google has really detached their income streams from their individual products. It would be a struggle to break them up in any meaningful way.",
                      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li051wr/",
                      "created": 1723598470,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "li0j3y0",
                      "score": 16,
                      "body": "They actually are. Look at the revenue & profit of individual Android OEMs. Apple has 82% of the global operating profit in the smartphone sector.",
                      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0j3y0/",
                      "created": 1723603883,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "li6kwma",
                          "score": 4,
                          "body": "If Apple isn't a monopoly I don't know what is.... Walled garden af",
                          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li6kwma/",
                          "created": 1723691161,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "li02iem",
                      "score": 43,
                      "body": "Android the OS. which isnt a device.......... \n\nI mean its already partly open source so it might just spin off as some type of non-profit and just remove the blobs.",
                      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li02iem/",
                      "created": 1723597517,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "li1448p",
                          "score": 19,
                          "body": "and then the project dies, because nonprofit will pay maybe 40% of the original google engineer salaries and all the people who know shit about fuck related to android leave\n\ngreat plan if you're apple tbh",
                          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li1448p/",
                          "created": 1723613974,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lhzi7mr",
                      "score": 23,
                      "body": "It's a miracle apple survived.",
                      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzi7mr/",
                      "created": 1723589958,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lhzirgv",
                          "score": 6,
                          "body": "Has anyone sent a welfare check-in to 1 Infinity Dr recently?",
                          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzirgv/",
                          "created": 1723590164,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lhzq6zk",
                              "score": 8,
                              "body": "Well there's the issue. It's One Infinite Loop. No wonder they're struggling, they never got it.",
                              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzq6zk/",
                              "created": 1723592934,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lhz7yia",
              "score": 43,
              "body": "Then why aren't the shareholders already electing directors who will break up the company through spinoffs? Activist investors already push boards to do this when they believe it will unlock value.",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz7yia/",
              "created": 1723586288,
              "depth": 2,
              "replies": [
                {
                  "id": "lhz9foz",
                  "score": 74,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz9foz/",
                  "created": 1723586797,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "li0s6ih",
                      "score": 12,
                      "body": "For real. IMO the government really shouldn't allow such a voting structure to exist. \n\nWeWork showed exactly how such a voting structure can easily blow up in the faces of everyone who isn't the dictator of the company via such voting structures.",
                      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0s6ih/",
                      "created": 1723607815,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lhzc3s0",
                  "score": 6,
                  "body": "Because there is risk in the breakup while right now they own a monopoly.",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzc3s0/",
                  "created": 1723587733,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lhzjj76",
              "score": 19,
              "body": "Why do people always say this? You would end up with several different companies as a result of a breakup. Some completely useless, others that are money printing machines. There would be a sell off for the unprofitable divisions.",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzjj76/",
              "created": 1723590452,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lhzaqsq",
              "score": 62,
              "body": "I hate  Google specifically because of the abnormal rate they fire and layoff workers compared to other tech companies. \n\n Sundar Pichai needs to go. He’s turning Google into an Indian company from an American one ",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzaqsq/",
              "created": 1723587250,
              "depth": 2,
              "replies": [
                {
                  "id": "lhzb2fg",
                  "score": 14,
                  "body": "I'm assuming you meant *hate because that would be a weird reason to hold their stock lol",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzb2fg/",
                  "created": 1723587366,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhzc7tv",
                      "score": 16,
                      "body": "“I appreciate when a company is willing to fire staff and off-shore to cheaper countries. If it’s good for profits, it’s good for the stock price!”",
                      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzc7tv/",
                      "created": 1723587772,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lhzknt2",
                  "score": 27,
                  "body": "It already is. Seen some of the dumbest people get hired there because nepotism runs deep. And not just that YouTube employees in India are helping authoritarian regimes in neighboring countries manipulate algorithms to curtail dissenting voices",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzknt2/",
                  "created": 1723590877,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lhzh0mn",
                  "score": 14,
                  "body": "How are layoffs indian lol?",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzh0mn/",
                  "created": 1723589520,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "li03rbn",
                      "score": 15,
                      "body": "My company does it too, a lil better cause they dont lay anyone off just let the US based employees attrition and not hire anymore. Everyone hired is from India and mexico now cause they are cheaper. Theres no shortage of it and its not exactly a secret, entire google core products have been shifted to indian teams after mass layoffs and hiring sprees in bangalore\n\nEdit: Its always a mixed bag, you get 4 devs in blr for 1 dev in the US. Youll hear a lot of takes on it, especially surrounding quality and how jobs eventually come back since its a lesson companies have to relearn every time management turns over.",
                      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li03rbn/",
                      "created": 1723597983,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lhzhxbc",
                      "score": 31,
                      "body": "I think he means laying off salaried employees and hiring non-employee Indian contractors in their place, although to be real I’m not sure.",
                      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzhxbc/",
                      "created": 1723589853,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lhzqb9x",
              "score": 4,
              "body": "Because it’s easier to make money on something that is arguably undervalued P/E wise right now then try and figure out what to switch to based on breaking up a trust. I couldn’t give a shit less about a company having a 2T market cap because at that point I see it as too big to fail and relatively safe investment wise.",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzqb9x/",
              "created": 1723592977,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lhz9poc",
          "score": 59,
          "body": "seems to me people willingly choose google as their search engine, it’s just as easy to use Bing or DuckDuckGo or whatever. Maybe Google should be compelled to cease the deals with Apple/Firefox/etc that made them the default engines on those platforms but I don’t agree their majority market share is due to monopolistic control.\n\nBut whatever, I’m not a lawyer I could be wrong",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz9poc/",
          "created": 1723586893,
          "depth": 1,
          "replies": [
            {
              "id": "lhzha7e",
              "score": 37,
              "body": "Yeah google is just straight up better at this point",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzha7e/",
              "created": 1723589617,
              "depth": 2,
              "replies": [
                {
                  "id": "li0jos0",
                  "score": 2,
                  "body": "Google search actually sucks now",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0jos0/",
                  "created": 1723604116,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "li0sp04",
                      "score": 12,
                      "body": "Google Search is actively destroying other search engines to with what it's done to SEO and the way it's killed so many sites that had good quality content on niche subjects. You can find a lot of stories about niche businesses that were literally destroyed overnight by Google search engine changes that allowed content farms with inaccurate data to grab all the search traffic.",
                      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0sp04/",
                      "created": 1723608054,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "li1t30b",
                      "score": 7,
                      "body": "Yea I was a Google fanboy for a long time because their products were so good. Many of them still are. But search is fucking atrocious now because almost all the results you see are sponsored ads. They became exactly what they were fighting against in their early “don’t be evil” days when they presented the best results first. Unfortunately competitors aren’t much better except for a subscription search provider I found (Kagi) but it doesn’t work well with iOS.",
                      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li1t30b/",
                      "created": 1723629777,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "li1dd4y",
                  "score": 1,
                  "body": "Yeah google is so good, right? All you get are results that got boosted artificially, whereas before I could actually get answers for complex inputs",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li1dd4y/",
                  "created": 1723619470,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lhzm6nd",
              "score": 10,
              "body": "Yeah, I think not paying would actually let Google just keep the cash and probably hurt Apple way more, but don't fix what isn't broken and they seem happy to pay Apple that money.",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzm6nd/",
              "created": 1723591461,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lhzllq3",
              "score": 3,
              "body": "I really want to know what Google calculates that default to be worth revenue-wise. The $15 billion price tag just seems insane to me. Vast majority of people seem to default to thinking of Google for searches. I just can’t believe being the default setting is worth that much.",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzllq3/",
              "created": 1723591239,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lhz8j8j",
          "score": 63,
          "body": "To me it’s more that this won’t actually do anything to help consumers.\n\nWalmart has an absolute monopoly on in person grocery . They absolutely hurt consumers. No action is taken.\n\nHow does breaking off android from google help consumers? Android isn’t even the leading IOS.\n\nEdit: changed retail to grocery, \n\nadd https://www.supermarketnews.com/news/antitrust-expert-takes-aim-walmart-food-suppliers-new-book\n\nadd https://ilsr.org/wp-content/uploads/2019/06/Walmart_Grocery_Monopoly_Report-_final_for_site.pdf",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz8j8j/",
          "created": 1723586485,
          "depth": 1,
          "replies": [
            {
              "id": "lhzb4wb",
              "score": 35,
              "body": "How does Walmart have a monopoly when there are companies like Amazon, Costco, Target, etc.?\n\nAndroid does lead globally, just not in the US.",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzb4wb/",
              "created": 1723587390,
              "depth": 2,
              "replies": [
                {
                  "id": "lhzck2m",
                  "score": 10,
                  "body": "https://ilsr.org/wp-content/uploads/2019/06/Walmart_Grocery_Monopoly_Report-_final_for_site.pdf\n\nBasically shopping isn’t the same.\n\nWalmart gets away with having more controll over a direct market which it achieved by literally using price techniques which are by definition anti competitive. \n\nWalmart sells goods at a loss, drives out local competition, and then increases prices back up.",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzck2m/",
                  "created": 1723587891,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhze9mo",
                      "score": 4,
                      "body": "I think you missed the boat, the last time when Walmart should have been targeted was like back in the 1990s before the rise of Amazon. Just because a tiny nonprofit says they are does not make them a monopoly. I can just as easily find other sources that say they are not a monopoly.\n\nFrom the introduction of your link:\n\n>But when it comes to another facet of life — buying groceries\n— the options in Lawton are far more limited. Residents can\nshop at one of several Walmart stores. But beyond Walmart,\nthe pickings are slim. Country Mart, a local chain, has two\nsmall grocery stores, each about a 15-minute drive from\ndowntown Lawton, on opposite sides of the metro area. Aldi\noperates a small store in the city. Williams Discount Food\nhas an outlet on the far northeastern edge of the metro, in\nthe town of Elgin, a 20-minute drive from central Lawton.\n\nThat's not a monopoly. Lawton has options beyond just Walmart. Some of the other towns might be considered to be monopolized by Walmart, but we are talking about increasingly small fractions of the US population. There are bigger targets to prioritize.",
                      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhze9mo/",
                      "created": 1723588512,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lhzefz6",
                          "score": 10,
                          "body": "So then neither is google. Bing exists.\n\nLike??",
                          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzefz6/",
                          "created": 1723588576,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "li2e1k6",
                  "score": 2,
                  "body": "There are two full-size Walmart stores in the Seattle region. That most certainly is a monopoly. I think there are only 55 Safeways in the same area. ",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li2e1k6/",
                  "created": 1723639926,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lhze171",
              "score": 29,
              "body": "Because all these cases are being brought by lobbying competitors who want to hurt Google, not by actual customers who are being harmed via monopoly. I get the idea of what they want to do, but all the solutions seem like they just took the Microsoft Anti-trust and are trying to graft it onto Google which doesn't map coherently to that case.",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhze171/",
              "created": 1723588426,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lhz98gm",
              "score": 38,
              "body": "Exactly what I was wondering about, if they do this to Google then what about Apple and its “Walled Garden”",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz98gm/",
              "created": 1723586727,
              "depth": 2,
              "replies": [
                {
                  "id": "lhza0wg",
                  "score": 47,
                  "body": "I don’t get it. \n\nApple literally brags about its monopolistic pipeline of products, in a market which is dominates (85% of new phone buyers are getting iPhones), while using its walled ecosystem to make AI but the DOJ sleeps.\n\nWalmart has 60% of all retail US shopping, uses price manipulation to push out local competitors, and then rely on goverment handouts to feed its employees l. DOJ sleeps.\n\nGoogle pays APPL to default them on those devises, while using its search engines to work on ads. DOJ think of the consumer!!!! Let’s spin off… android? \n\nWhy just google? If apples default is so important isn’t the Apple IOS ecosystem a monopoly?\n\nIt seems like the remedy here was literally “how can we hurt google” not “how can we help the consumer”. Even when the DOJ fights a monopoly it isn’t for our benefit.\n\nEdit; added something at the bottom",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhza0wg/",
                  "created": 1723587001,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lhzd1fi",
                      "score": 39,
                      "body": "You have no idea what you are talking about, The Department of Justice is currently suing Apple for Antitrust violations *for the exact reasons you stated*\n\nTruly incredible how retail investors just completely ignore the news.\n\nhttps://www.cnn.com/2024/03/21/tech/apple-sued-antitrust-doj/index.html\n\nhttps://apnews.com/article/apple-antitrust-monopoly-app-store-justice-department-822d7e8f5cf53a2636795fcc33ee1fc3",
                      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzd1fi/",
                      "created": 1723588062,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lhzcuak",
                      "score": 13,
                      "body": "“DOJ sleeps”\n\nMeanwhile… https://www.justice.gov/opa/pr/justice-department-sues-apple-monopolizing-smartphone-markets",
                      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzcuak/",
                      "created": 1723587991,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "li05yar",
                      "score": 3,
                      "body": "Where the fuck did you get that Walmart is 60% of retail?",
                      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li05yar/",
                      "created": 1723598811,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lhzc6ro",
              "score": 10,
              "body": ">Android isn’t even the leading IOS.\n\nYes it is, just not in the US",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzc6ro/",
              "created": 1723587762,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lhzfket",
              "score": 7,
              "body": "Walmart has 9% of the retail market in the US.",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzfket/",
              "created": 1723588987,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lhzb4du",
              "score": 5,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzb4du/",
              "created": 1723587385,
              "depth": 2,
              "replies": []
            },
            {
              "id": "li0e0r7",
              "score": 2,
              "body": "Lol, they don’t care about helping consumers. Bro just want his rival stock to go back up",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0e0r7/",
              "created": 1723601872,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lhzckkd",
              "score": 1,
              "body": "Walmart has 8.5% of the market share of American Retail.\n\nhttps://capitaloneshopping.com/research/walmart-statistics/\n\nGoogle has a ***87%*** of the market share of Search Engine use in America\n\nhttps://searchengineland.com/googles-huge-search-market-share-loss-wasnt-real-data-revised-440191",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzckkd/",
              "created": 1723587895,
              "depth": 2,
              "replies": [
                {
                  "id": "lhzfua9",
                  "score": 11,
                  "body": "And in Europe where they force choice via regulation, Google's market share is even higher than in the US. People are choosing to use Google despite regulations to promote competitors.",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzfua9/",
                  "created": 1723589088,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lhzhcfg",
          "score": 20,
          "body": "Google has monopolistic practices, but I will argue Google is weaker than ever.\n\nChatgpt (msft) is a disrupter: there are people who may now turn to chatgpt for answers instead of going through the heaps of SEOed garbage results (though chatgpt also has a lot of garbage).\n\nMobile wise, android is already pretty open: the apple walled garden imo is far more problematic.\n\nGCP def behind Azure and AWS.\n\nEvery tech giant has their own thing going for them: such as Amazon for online retail, Microsoft still has Windows.\n\nIn an odd twist, breaking up Google might end up causing its main competitor in the browser war (mozilla's Firefox) since Google's money is what bankroll the Mozilla foundation.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzhcfg/",
          "created": 1723589639,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li0ddrf",
          "score": 2,
          "body": "Yes, because monopolies themselves aren't illegal. What's illegal is using that monopoly power to stifle competition **at the harm of the consumer**. If the consumer isn't benefited here, nothing else really matters.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0ddrf/",
          "created": 1723601628,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li197lp",
          "score": 2,
          "body": "It is monopolistic, but does the monopoli help or hurt consumers? I find the Google ecosystem really convinient to be honest",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li197lp/",
          "created": 1723616988,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhz8llz",
          "score": 2,
          "body": "I care about what's good for me, the customer.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz8llz/",
          "created": 1723586507,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhzf1qs",
      "score": 130,
      "body": "Are people still pretending like google search smoked whoever their search engine competition was at the time ( yahoo/ lycos /ask Jeeves /bing ) only because of alleged monopoly moves and NOT because they made a search engine that was so much better than whoever 2nd place was?",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzf1qs/",
      "created": 1723588799,
      "depth": 0,
      "replies": [
        {
          "id": "li2s9ty",
          "score": 29,
          "body": "Microsoft literally tried to force all their users to use Bing and failed. But when Microsoft came up with an actually *good* product (Chatgpt) they started generating user excitement. And now Apple and Google are also working hard on their own search AI assistants.\n\nThat kind of proves the market is working as intended.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li2s9ty/",
          "created": 1723645022,
          "depth": 1,
          "replies": [
            {
              "id": "li35qd1",
              "score": 27,
              "body": "Yes, except Microsoft didn't come up with ChatGPT. They bought it.\n\n\nAnd ChatGPT built their Generative AI using the Transformer technology invented by Google itself.",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li35qd1/",
              "created": 1723649376,
              "depth": 2,
              "replies": [
                {
                  "id": "li4cs4n",
                  "score": 2,
                  "body": "> Microsoft didn't come up with ChatGPT. They bought it.\n\nThat seems like a different issue. The point is it's proof that if something better comes along consumers are willing to try it. \n\n>ChatGPT built their Generative AI using the Transformer technology invented by Google itself.\n\nIsn't that further proof that Google's monopoly didn't prohibit other competitors from gaining marketshare when competitor have good products?",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li4cs4n/",
                  "created": 1723662872,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "li3hnqw",
          "score": 12,
          "body": "Dude this!! Google still dominates because even as it falters everything else sucks. Please greasy neckbeard at State State, drop out and invent something better and become a billionaire, you can have my dollars.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li3hnqw/",
          "created": 1723653156,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li1h2ay",
          "score": 2,
          "body": "They were better (maybe still are), but that was 20+ years ago by now. This case is about their practices to avoid competition in the current day.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li1h2ay/",
          "created": 1723621776,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhznhb7",
      "score": 94,
      "body": "Can someone explain why Android should be divested (they mention over 2 billion devices worldwide) but no one cares that Apple has over 2 billion devices worldwide? Wtf?!",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhznhb7/",
      "created": 1723591941,
      "depth": 0,
      "replies": [
        {
          "id": "lhzvhnl",
          "score": 52,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzvhnl/",
          "created": 1723594892,
          "depth": 1,
          "replies": [
            {
              "id": "li00nam",
              "score": 21,
              "body": "It’s not about market share for these products. It’s that by virtue of providing Google Play Services to OEMs they can dictate terms for Android device manufacturers to include non-removable Google search features in their software, thereby extending Google’s **search** monopoly. Same with Chrome, which by virtue of having such large market share enforces the Google **search** monopoly by being the default search engine. This is all about search, if Google were to spin off Android and Chrome there would be the possibility of a competitor emerging to Google Search since it wouldn’t be necessarily the default on 90% of devices and browsers",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li00nam/",
              "created": 1723596818,
              "depth": 2,
              "replies": [
                {
                  "id": "li0ej2i",
                  "score": 5,
                  "body": "Wound the most simple approach be simply ruling that they can’t do that and implement that ruling?\n\nI don’t see how you really justify breaking up the company, seemingly as a punitive measure, over an ambiguous at best anticompetitive( which probably does significantly impact there market share and is unlikely to create new competition) business practice when you could simply ban the business practice and provide clearer guidance for future practices",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0ej2i/",
                  "created": 1723602069,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "li16ruz",
                  "score": 2,
                  "body": "I would rather have one functioning search mechanism than have to go to a solution like Netflix+ Hulu + Max + Disney+",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li16ruz/",
                  "created": 1723615511,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "li01e1g",
                  "score": 4,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li01e1g/",
                  "created": 1723597096,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "li012fy",
              "score": 4,
              "body": "Add to that Amazon AWS is bigger for cloud services and OpenAI is better and more used for AI. The only things Google leads market in is browser use and search engine.",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li012fy/",
              "created": 1723596975,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "li0pq75",
          "score": 9,
          "body": "If Google gets broken up the massive beneficiary will be Apple as the Google/Android ecosystem gets fractured and less integrated. Amazon (cloud), Microsoft (cloud/search) and Facebook (social/advertising) will also benefit quite a bit unless the DOJ comes for them next.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0pq75/",
          "created": 1723606701,
          "depth": 1,
          "replies": [
            {
              "id": "li1nvs6",
              "score": 10,
              "body": "The massive beneficiary will be China\n\nAndroid alternative will come from China. Huawei is already back up after being barred from Android\n\nThe DoJ is either an idiot or compromised for hammering Google which spreads American influence globally, as Android is far more popular outside the US than inside. Where's the sanctions against TikTok? Temu?",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li1nvs6/",
              "created": 1723626375,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "li17cw2",
          "score": 3,
          "body": "Who says this wont effect other companies? A huge part of US law is precedent. This going through could set a more modern precedent for tech anticompetitive tech companies. One much more recent than say AT&T in the 80's.  Could set the stage for these big tech giants  to be brought under closer scrutiny. It has to start somewhere.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li17cw2/",
          "created": 1723615861,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhz7thq",
      "score": 219,
      "body": "Just like in the Microsoft case it'll take years of litigation and never actually lead to anything significant. Google will lobby hard and agree to a whopping 10b DOJ fine that they'll recover from within a quarter tops. \n\nOr that's just me on hopium for what is my 2nd biggest position..",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz7thq/",
      "created": 1723586240,
      "depth": 0,
      "replies": [
        {
          "id": "lhzvfft",
          "score": 53,
          "body": "Never actually lead to anything significant? Google and Apple were both given a chance they wouldn’t have had but for the antitrust effect. Like we literally have behemoths of Google and Apple precisely because Microsoft had to reform their business practices in the late 90s. Even today, literally every single business and product decision at Microsoft is screened for antitrust implications.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzvfft/",
          "created": 1723594870,
          "depth": 1,
          "replies": [
            {
              "id": "li0183z",
              "score": 6,
              "body": "Windows still is greedy as ever - example even\nA simple save default location from office products is straight to their cloud service - it’s super annoying and totally monopolistic that we can’t easily choose where to default to - and that is just a single example.",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0183z/",
              "created": 1723597034,
              "depth": 2,
              "replies": [
                {
                  "id": "li0u0es",
                  "score": 4,
                  "body": "I mean this is a very broad discussion but using their OS and having defaults to their services isn’t that wild to me. \n\nWith google you are using their services as a default regardless of OS/Device.",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0u0es/",
                  "created": 1723608686,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "li1pwdo",
          "score": 2,
          "body": "Half a quarter if they lay off a bunch of people too!",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li1pwdo/",
          "created": 1723627719,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li058ft",
      "score": 35,
      "body": "Oh God, are they going to make half of us use Bing?",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li058ft/",
      "created": 1723598538,
      "depth": 0,
      "replies": [
        {
          "id": "li0g3qj",
          "score": 9,
          "body": "NOOOOOOOO",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0g3qj/",
          "created": 1723602682,
          "depth": 1,
          "replies": [
            {
              "id": "li0ujey",
              "score": 7,
              "body": "Thank you for reading my comment\n\n- Brought to you by Bing",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0ujey/",
              "created": 1723608937,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "licmkiv",
          "score": 2,
          "body": "At work I can only use Bing.. Chrome is blocked.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/licmkiv/",
          "created": 1723778653,
          "depth": 1,
          "replies": [
            {
              "id": "liikz3s",
              "score": 2,
              "body": "Gross",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/liikz3s/",
              "created": 1723866633,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "li12pxd",
      "score": 24,
      "body": "Consumers will hate a broken up Google. Also Americans should hate it too because Google is a crown jewel of America. Google has literally kick started the exponential progress we see today with tech. It's happening because Google search made knowledge accessible to everyone, from the dumbass to the brightest, and they made a great business out of it as well.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li12pxd/",
      "created": 1723613190,
      "depth": 0,
      "replies": [
        {
          "id": "li537b5",
          "score": 3,
          "body": "On top of this, breaking up Google will seriously gimp one of the US's most powerful tech companies, with comparable scale and AI infra to compete with Baidu, Alibaba, Tencent, Bytedance. It's as much about geopolitics as it is a business story. It will be fun to see if this is just political posturing for election year (I have a feeling it is), or there's actual teeth behind it. The cynical side of me says this will be abandoned and forgotten about in 6 months.\n\nYeah, they're a monopoly.. but there are a lot of them in the US. History has shown that the government won't touch monopolies that protect US interests.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li537b5/",
          "created": 1723671354,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhzbfpd",
      "score": 114,
      "body": "2 months ago ChatGPT was going to destroy Google because why would anyone use search? Now Google is a monopoly that needs to be broken up because it has no competition? The Bipolar narratives continue as usual. Can't wait to scoop up more Alphabet shares at lower prices.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzbfpd/",
      "created": 1723587497,
      "depth": 0,
      "replies": [
        {
          "id": "lhzkd2z",
          "score": 20,
          "body": "Two separate claims can exist independently. Google was threatened by ChatGPT when it didn’t have its Bard AI. However it is monopolistic when it comes to its search engine because it pays Apple $20 billion a year to stay as the default search engine.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzkd2z/",
          "created": 1723590765,
          "depth": 1,
          "replies": [
            {
              "id": "li0a3ti",
              "score": 14,
              "body": "Right. And when you have a default search engine, it’s not something that you can easily change, and in Safari you can’t just type “bing.com” to get to a different search engine. \n\nMy dishwashing machine came with a packet of cascade (because cascade pays them to do so), so now I’m obviously locked into buying and using Cascade cleaner for the rest of my life. ",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0a3ti/",
              "created": 1723600380,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "li00jol",
          "score": 11,
          "body": "I have no idea how Google is monopolistic. The only thing they don’t really have much competition in is their search engine. Everything else, they aren’t the leader. Cloud services? Amazon is bigger. AI? OpenAI is bigger. Phones? Apple is bigger. No clue why they would need to be broken up.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li00jol/",
          "created": 1723596781,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhz3jq8",
      "score": 101,
      "body": "Spin out YouTube! Let it compete freely.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz3jq8/",
      "created": 1723584786,
      "depth": 0,
      "replies": [
        {
          "id": "lhzs2mk",
          "score": 72,
          "body": "YouTube is a rare company that is continuously expanding in size and content. It's very expensive to maintain on its own without a parent company. \n\nThere's a reason YouTube has never had any real competitors, the nature of operating such a platform is something no company aside Google is willing to spend tens of billions on.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzs2mk/",
          "created": 1723593620,
          "depth": 1,
          "replies": [
            {
              "id": "li01m0l",
              "score": 34,
              "body": "Yes its crazy.  Its the de facto video library of the world(except china).",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li01m0l/",
              "created": 1723597180,
              "depth": 2,
              "replies": [
                {
                  "id": "li1oag2",
                  "score": 10,
                  "body": "You bet China is laughing as America destroys the tools that allowed it gain such global influence (and bring global money to itself), while letting TikTok proliferate",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li1oag2/",
                  "created": 1723626646,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lhz9atj",
          "score": 25,
          "body": "YouTube is not profitable and would immediately die. Google has been fine operating it as a loss-leader",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz9atj/",
          "created": 1723586749,
          "depth": 1,
          "replies": [
            {
              "id": "lhz9zrz",
              "score": 22,
              "body": "Same goes for Twitch and Amazon",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz9zrz/",
              "created": 1723586990,
              "depth": 2,
              "replies": [
                {
                  "id": "lhzazr7",
                  "score": 3,
                  "body": "Same goes for TikTok and ByteDance",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzazr7/",
                  "created": 1723587339,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lhzk2p9",
              "score": 14,
              "body": "If YouTube was spun off, it would raise prices to become profitable. Then it would lose revenue because people aren’t willing to pay bullshit prices for what was originally a free site to share videos.",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzk2p9/",
              "created": 1723590655,
              "depth": 2,
              "replies": [
                {
                  "id": "lhzlp1c",
                  "score": 5,
                  "body": "People want lambos for the price of smart cars",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzlp1c/",
                  "created": 1723591274,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lhzhlmi",
              "score": 42,
              "body": "YouTube does not lose money",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzhlmi/",
              "created": 1723589734,
              "depth": 2,
              "replies": [
                {
                  "id": "li021ie",
                  "score": 21,
                  "body": "You’re both kinda wrong, alphabet no longer reports YouTube earnings separately, so no one knows if it’s making or losing money, but for all the years they did report YouTube earnings separately, it was losing money",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li021ie/",
                  "created": 1723597342,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "li0u2t7",
                      "score": 5,
                      "body": "Agreed. All we know for sure is YouTube's revenue, which is not profit.\n\nIMO YouTube is almost certainly either A) still losing money, or B) has very low margins and barely makes any money in comparison to the revenue numbers.",
                      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0u2t7/",
                      "created": 1723608718,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "li1suaj",
                          "score": 2,
                          "body": "They wouldn't be pushing YouTube premium and disabling adblockers in chrome if it was making good money so yeah I really doubt they are making a profit. The cost of operating a site like YouTube must be astronomical, I'm really surprised they even allow 4k content and don't really see they point of doing it. Higher bitrate 1080p would be enough. I mean does anyone actually watch stuff in 4k?",
                          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li1suaj/",
                          "created": 1723629626,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "li0igjm",
                  "score": 3,
                  "body": "Sure, but it also won't be making enough to satisfy the shareholders if it gets spun off to it's own entity. Then YouTube will have even more ads, higher premium prices, and other means to generate even more profits.\n\nWithout Google, YouTube is dead.",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0igjm/",
                  "created": 1723603624,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lhzj6al",
              "score": 6,
              "body": "YouTube makes a ton of money!\n\nhttps://variety.com/2024/digital/news/youtube-q2-2024-ad-revenue-tv-spending-alphabet-google-earnings-1236081700/?%20-%2014638941",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzj6al/",
              "created": 1723590318,
              "depth": 2,
              "replies": [
                {
                  "id": "lhzprk6",
                  "score": 24,
                  "body": "Is it profitable though? Streaming video is very expensive to run.",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzprk6/",
                  "created": 1723592776,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lhzunx0",
                  "score": 15,
                  "body": "Revenue isn't profit.",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzunx0/",
                  "created": 1723594584,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lhzybyr",
                  "score": 7,
                  "body": "If I buy $1000 worth of tomatoes and sell them for $20, I haven't \"made\" $20.",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzybyr/",
                  "created": 1723595952,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "li2d225",
      "score": 20,
      "body": "I don't see why google would be broken up in this case. The ruling said they used monopolistic means to maintain their position by paying for default. It seems like fining them for that action + making it illegal to do in the future solves that problem.\n\nThe court had no issue with the fact that they were dominant, and only ruled against the pay for default.\n\nTheres a lot of google hate i really don't get, pretty much all the great parts of the modern web were subsidized by google.\n\n\\* Chrome is a superior browser to anything that came before it.\n\n\\* Maps is an insane product to exist for free, they took a picture of like every traversable inch of the country and will share it with you and give you near perfect directions at no cost \n\n\\* g-suite is a free alternative to Microsoft's products that are superior for pretty much everything beside advanced excel\n\n\\* gmail was a massive step forward from anything that came before it and is still the best product available\n\n\\* android allowed smaller manufacturers to compete with apple in a way that they couldn't on their own (look at maemo from nokia or palm os)\n\n\\* the v8 engine makes the web way more enjoyable (used by everyone besides apple)\n\n\\* cloud started at google, amazon made all the money, but in terms of user benefit we have a lot to thank google for there\n\n\\* They funded the pure research that lead to the current ai evolution.\n\n\\* TPU is the only meaningful competitor to nvidia atm.\n\nI'm very happy google exists them being broken up would be a major loss, and more importantly a really weird solution to what the judge ruled against.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li2d225/",
      "created": 1723639541,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz2upj",
      "score": 87,
      "body": "Good luck breaking out chrome and adwords, two products that literally originated from the company.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz2upj/",
      "created": 1723584544,
      "depth": 0,
      "replies": [
        {
          "id": "lhz7kuk",
          "score": 49,
          "body": "It doesn’t matter if it originated with the company, it matters if they are operating as a as monopoly. For shareholder value it might be a better deal for Google to be split up.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz7kuk/",
          "created": 1723586159,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhzb5en",
          "score": 5,
          "body": "Search originated from the company, and they illegally bribed *all* of their competitors to use their products so they would never have to compete in an open market. What’s your point here?",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzb5en/",
          "created": 1723587395,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhzys2p",
      "score": 5,
      "body": "Too bad it’s not Facebook. The sheer wordplay that would surround Mehta ruling on Meta would be epic. \n\nOn topic, what do y’all suppose this’ll do to QQQ?",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzys2p/",
      "created": 1723596122,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzlh5r",
      "score": 9,
      "body": "This is going to wreak havoc on the stock won’t it? My second biggest position with an average in high $170’s. ![gif](emote|free_emotes_pack|dizzy_face)![gif](emote|free_emotes_pack|dizzy_face)",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzlh5r/",
      "created": 1723591191,
      "depth": 0,
      "replies": [
        {
          "id": "lhzs5fc",
          "score": 5,
          "body": "Or be a sign of bull. DOJ basically said Google is a big dog monopoly that is too OP and needs to be nerfed.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzs5fc/",
          "created": 1723593648,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhzqpx7",
      "score": 10,
      "body": "Welp... I literally bought 2k of it today, fun",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzqpx7/",
      "created": 1723593126,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhza7mz",
      "score": 28,
      "body": "How is this hurting the consumer?  Maybe I'm just not getting it.  \n\nHow about they break up big oil companies?\n\nHow about they break up fuckin ticketmaster already.\n\nHow about they break up Sinclair Broadcasting that owns all the local tv stations spewing their right wing propoganda?\n\nSo much more things to go after than Google.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhza7mz/",
      "created": 1723587066,
      "depth": 0,
      "replies": [
        {
          "id": "liaq2ia",
          "score": 3,
          "body": "Oil companies have already been broken up. Look up standard oil, if they existed today they would be a behemoth of a company.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/liaq2ia/",
          "created": 1723753706,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhz4r7e",
      "score": 25,
      "body": "Yea, sure. Good luck with that.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz4r7e/",
      "created": 1723585203,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz6i99",
      "score": 17,
      "body": "Never going to happen.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz6i99/",
      "created": 1723585794,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz5i5r",
      "score": 33,
      "body": "weren’t they supposed to break up meta first? that hasn’t happened in the slightest. DOJ is a bunch of cowards since Garland took over",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz5i5r/",
      "created": 1723585456,
      "depth": 0,
      "replies": [
        {
          "id": "lhzt6h3",
          "score": 7,
          "body": "If Harris wins she better get rid of Garland",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzt6h3/",
          "created": 1723594033,
          "depth": 1,
          "replies": [
            {
              "id": "li00clr",
              "score": 3,
              "body": "he won’t have a federal job in 2025, that’s for sure",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li00clr/",
              "created": 1723596708,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lhzgal8",
          "score": 15,
          "body": "What exactly were they doing before that Garland stopped? I somehow missed the news of all the exciting antitrust action coming out of Trump DoJ.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzgal8/",
          "created": 1723589255,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhziqwo",
      "score": 9,
      "body": "Divestment of android would speed up the death of open source android by a good few years.\n\nIt was already on its way, but open source android doesn't make sense as a stand-alone company.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhziqwo/",
      "created": 1723590158,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0h1dw",
      "score": 11,
      "body": "Google isn’t operating as a monopoly, the competitors were shit for so long. I think Bing is finally catching up, especially with Copilot. I’m not saying it’s better or as good, but people use it a lot (especially at companies). \n\nI’m disappointed the DoJ keeps attempting this, when they should be tackling duopolies and oligopolies like the US agricultural industry or grocery store chains. Competition is stifled in those industries. At least there are competitors in pretty much all segments of Google’s business and they are gradually improving.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0h1dw/",
      "created": 1723603056,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0k5n3",
      "score": 9,
      "body": "Almost all of Alphabet's profit is brought in via search. This is not like Bell or Standard Oil where you can break up by geography. It's also not like Meta where they're horizontally integrating and you can break up by product. Alphabet is a conglomerate that's buoyed by mainly search, and who's gonna try to break up an algorithm? Willing to bet this whole thing has no legs.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0k5n3/",
      "created": 1723604305,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzgocb",
      "score": 6,
      "body": "I don’t think DOJ would expect this to happen but more so to send another message to big tech to act carefully. The issue is all these big tech companies blew up at a unique point in history when the internet was beginning to take off. Even if they broke up Google, Amazon, Meta, etc it would still be almost impossible for 99.99999% of tech startups to get to their scale. The other challenge the DOJ faces is consumers love big tech products. Meta and Google are free for god’s sake.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzgocb/",
      "created": 1723589395,
      "depth": 0,
      "replies": [
        {
          "id": "lhztj8q",
          "score": 6,
          "body": "I think the problem is that they're approaching tech companies they way they did with Standard Oil and At&t. \n\nIt was one thing to punish Microsoft since people hated Internet Explorer but were forced to use it but with Google,Amazon, Meta people actively use their products out of choice so it may be counterproductive to break them up.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhztj8q/",
          "created": 1723594163,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhzgrz9",
      "score": 3,
      "body": "I hope analysts think this is a problem, giving us all another opportunity for cheap shares.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzgrz9/",
      "created": 1723589432,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzr7qx",
      "score": 3,
      "body": "If Google is first then Microsoft must be next",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzr7qx/",
      "created": 1723593305,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li1qncl",
      "score": 3,
      "body": "Eh won't happen",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li1qncl/",
      "created": 1723628210,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li48svj",
      "score": 3,
      "body": "The DOJ is about 5 years too late. Google is about to get cut down to size all on its own by all the AI alternatives to using a search engine that returns 10 blue links. So 1999.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li48svj/",
      "created": 1723661610,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li1336q",
      "score": 5,
      "body": "Terrible move.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li1336q/",
      "created": 1723613399,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz4lfz",
      "score": 12,
      "body": "I don’t invest in tech but this could be very bullish. How many projects do they (and microsoft) waste money on and then throw away because they are useful but not materially worth it to the company as a megacap? And wouldn’t the parts get a chance to trade at higher multiples?\n\n\nBiggest beneficiary though would be overall society. Progressives in the early 1900s’ biggest contribution may actually have been trust busting. Good luck to the DoJ",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz4lfz/",
      "created": 1723585149,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz8sdd",
      "score": 7,
      "body": "Why can Microsoft load up their OS with Azure crap, force AD integration to only work with Azure, their office monopoly?",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz8sdd/",
      "created": 1723586571,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzo7uy",
      "score": 4,
      "body": "Brin and Page the neighborhood nerd genius kids teamed up and built an incredible toy. \\[ the AI brain\\]\n\nand now the neighborhood bully has come to take away the toy and smash it into pieces because hes bigger and he can.\n\nand u guys applaud? im disgusted. and so is the ZUCK.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzo7uy/",
      "created": 1723592212,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzn0x3",
      "score": 2,
      "body": "Can they please break up  Comcast too",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzn0x3/",
      "created": 1723591775,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzroin",
      "score": 2,
      "body": "Yea but they are great and work well.\n\nMaybe separate them from YouTube ?",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzroin/",
      "created": 1723593475,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li206q9",
      "score": 2,
      "body": "The Play Store competes with F-Droid and direct APK distribution. The main reason the Play Store is so popular is because direct APK distribution is perceived as insecure since anyone can put any program as an APK, and F-Droid only allows open-source software released under permissive or copyleft licenses such as the GNU GPL or the Apache license and many developers don't want to make their apps open-source, plus developing and maintaining an app store is hard work which is why other companies haven't bothered competing (except Huawei, but the US government banned Huawei from selling their phones in the USA - they ban the competition and then complain about monopolies smh). Plus, the Play Store competes with the Snap Store and Flathub on other Linux Mobile distributions (also the App Lounge on /e/os but that takes apps from the Play Store and I'm not sure if it's fully legal).",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li206q9/",
      "created": 1723633818,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li2d5wa",
      "score": 2,
      "body": "Interesting they are going after Google to try and break it up. So does the parent company just gets a pass? They keep talking about just Google, fuck alphabet owns them? If they split google in two but alphabet still owns them, then what does that solve? Im pretty sure nothing.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li2d5wa/",
      "created": 1723639583,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li30cxa",
      "score": 2,
      "body": "I think the most likely thing is that they will ban google for paying to be the default browser (which Ironically will probably bankrupt Mozilla one of their competitors )",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li30cxa/",
      "created": 1723647660,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li35pbh",
      "score": 2,
      "body": "It’s funny all these things happens when (Microsoft) search gpt is announced. You can’t make this up. They literally just discovered this in 2024…",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li35pbh/",
      "created": 1723649367,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz03mc",
      "score": 16,
      "body": "How about a breakup plan for Boeing and Intel that will actually benefit society",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz03mc/",
      "created": 1723583522,
      "depth": 0,
      "replies": [
        {
          "id": "lhz1y66",
          "score": 76,
          "body": "How does Intel have a monopoly, exactly? They are losing market share by the day and progressively fading into irrelevance.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz1y66/",
          "created": 1723584226,
          "depth": 1,
          "replies": [
            {
              "id": "lhz6xxa",
              "score": 55,
              "body": "They have a monopoly on losing nana's inheritance.",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz6xxa/",
              "created": 1723585942,
              "depth": 2,
              "replies": [
                {
                  "id": "lhzzslh",
                  "score": 5,
                  "body": "It's still funny lmao.",
                  "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzzslh/",
                  "created": 1723596501,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lhz2d6b",
          "score": 22,
          "body": "How would breaking up Intel benefit society? They are losing share every quarter and if this continues, their existence becomes a going concern",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz2d6b/",
          "created": 1723584373,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhz28ci",
          "score": 8,
          "body": "They actually still have some serious competition left (which is eating their lunch). \n\nGoogle by contrast doesn't really in the areas focused in the lawsuit, in part because of their anti-competitive actions to make sure that the little competition there is doesn't become a threat.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz28ci/",
          "created": 1723584326,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhz0l1i",
          "score": 7,
          "body": "Oh, we’d rather pursue the successful companies.\n\nIf this were to be successful, they’d just go after Amazon and Apple, think also Meta, but it’s going to be years as this is going to be tied up in court.\n\nFor now, this is a nothing, but it appears it’s what’s putting a brick on Google’s head instead of AI stuff like the early spring.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz0l1i/",
          "created": 1723583718,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhz7w3t",
          "score": 4,
          "body": "Lol this, how does this help normal people? Why not go after Boeing and predatory hedge funds that destroyed companies like Red lobster etc",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz7w3t/",
          "created": 1723586266,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhzhfx9",
          "score": 2,
          "body": "Boeing is a real monster. Consistent and persistent complacency and lack of regard for safety.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzhfx9/",
          "created": 1723589675,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li0bmo8",
      "score": 3,
      "body": "Very unlikely Google will be broken up based on previous precedent. Mostly likely exclusionary contracts will be re evaluated and the possibility of a screen choice browser may be introduced.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0bmo8/",
      "created": 1723600956,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzameb",
      "score": 3,
      "body": "As long as green line go up, leave it the fuck alone.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzameb/",
      "created": 1723587208,
      "depth": 0,
      "replies": [
        {
          "id": "lhzbyus",
          "score": 8,
          "body": "Ah yes, a true pro-consumer outlook.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzbyus/",
          "created": 1723587685,
          "depth": 1,
          "replies": [
            {
              "id": "li0hat3",
              "score": 2,
              "body": "I mean 99% chance he’s also a consumer",
              "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0hat3/",
              "created": 1723603161,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lhz669g",
      "score": 3,
      "body": "I hope this will present a big buying opportunity.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz669g/",
      "created": 1723585681,
      "depth": 0,
      "replies": [
        {
          "id": "lhzhpvi",
          "score": 4,
          "body": "Google sitting at a 20PE under S&P if im not wrong. with huge AI investment",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzhpvi/",
          "created": 1723589778,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhzcfub",
      "score": 3,
      "body": "Highly doubt they will break up Google.  But if they did it would be worth more money.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzcfub/",
      "created": 1723587849,
      "depth": 0,
      "replies": [
        {
          "id": "lhzdvu7",
          "score": 3,
          "body": "How so?",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzdvu7/",
          "created": 1723588372,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhzlj63",
      "score": 2,
      "body": "If they are going to break up google then what are they going to do against Apple? Surely the walled garden can't survive",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzlj63/",
      "created": 1723591212,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li22pbn",
      "score": 2,
      "body": "People don't know what's good for them. When they think competition, they think small US companies. No, when you're talking about a global market which Google operates in, the competition can be from foreign adversaries like China\n\nDestroying American companies that dominated the world currently is a footstep into devastating ruin for the United States.\n\nSolution:\n\nSplit monopolies that only makes money off the American people with no foreign competition, e.g. Comcast\n\nEncourage monopolies that increase American global influence and make money from other countries for the US, e.g. Google & Apple",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li22pbn/",
      "created": 1723635065,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzbnp5",
      "score": 2,
      "body": "election season is here!",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhzbnp5/",
      "created": 1723587576,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li00thd",
      "score": 1,
      "body": "How ridiculous. Google is far from a monopoly in every department.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li00thd/",
      "created": 1723596883,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz6h86",
      "score": 0,
      "body": "I think there’s a very legitimate argument to be made that tech monopolies like Google should have been broken up. \n\nBut imo it’s too late. “Google” is literally a verb. Even if you did try to spread the love in the world of search engines - it wouldn’t take. Consumers prefer Google and will continue using it. Anything new would be DOA.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/lhz6h86/",
      "created": 1723585784,
      "depth": 0,
      "replies": [
        {
          "id": "li0ig7v",
          "score": 4,
          "body": "Yeah this kind of captures my thoughts, but it's not even just consumers. I work in software development and work with stuff that was originally developed in house in Google (or Meta, Amazon, etc.,) all the time. Things become open source, become new standards, entities get spun off into their own independent organizations all the time, etc.,. Whatever the opinion is on the business models, they're responsible for a lot pieces of software infrastructure we take for granted every day even when not using their products. It's easy for me to imagine big tech companies in a diminished form being a drag on the rest of the industry.",
          "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0ig7v/",
          "created": 1723603620,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li0duxq",
      "score": 1,
      "body": "This could be an elaborate way to have google subpoena competitors",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0duxq/",
      "created": 1723601810,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0h7m1",
      "score": 1,
      "body": "After Stadia it was all downhill.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0h7m1/",
      "created": 1723603126,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0q7hv",
      "score": 1,
      "body": "Consider but their lawyers won’t let it happen.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0q7hv/",
      "created": 1723606916,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0ytzp",
      "score": 1,
      "body": "Fucking yes.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li0ytzp/",
      "created": 1723611095,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li11rpq",
      "score": 1,
      "body": "Nvda monopoly when?",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li11rpq/",
      "created": 1723612660,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li12hb2",
      "score": 1,
      "body": "Good",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li12hb2/",
      "created": 1723613054,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li20oaf",
      "score": 1,
      "body": "I want Apple to be broken up.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li20oaf/",
      "created": 1723634066,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li23sxr",
      "score": 1,
      "body": "And what about microsoft and amazon lol",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li23sxr/",
      "created": 1723635584,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li2bfvn",
      "score": 1,
      "body": "There’s no way they can get that remedy — for real “you’re too big” is an entirely different case from “these contracts allowed you to monopolize the marketplace “",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li2bfvn/",
      "created": 1723638898,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li2h9oa",
      "score": 1,
      "body": "Never happen…. 3 years from now it’s a fine \nAlthough \nI would buy YouTube stock",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li2h9oa/",
      "created": 1723641150,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li2n017",
      "score": 1,
      "body": "Your fiefdom has grown too large, milord. It must be dealt with *appropriately.*",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li2n017/",
      "created": 1723643213,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li2nisx",
      "score": 1,
      "body": "Break up all billion dollar corporations. In fact just make it so corporations can't own other corporate entities.",
      "permalink": "/r/stocks/comments/1eriwi8/bloomberg_us_considers_a_rare_antitrust_move/li2nisx/",
      "created": 1723643397,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "The US Justice Department is considering breaking up Alphabet Inc.'s Google following a ruling that it monopolized the online search market.",
    "companies": [
      "Alphabet Inc.",
      "Google",
      "Microsoft Corp.",
      "Apple Inc."
    ],
    "tickers": [
      "GOOGL",
      "MSFT",
      "AAPL"
    ],
    "main_ticker": [
      "GOOGL"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "The US Justice Department is considering breaking up Alphabet Inc.'s Google following a court ruling of monopolizing the online search market.",
    "stock_recommendations": "The user does not recommend buying or selling any stocks.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": "none",
    "sentiment_summary": "The post discusses possible antitrust actions against Google but does not express sentiment about buying or selling stocks.",
    "sentiment": "neutral"
  }
}