{
  "title": "Google launches first AI-powered Android update and new Pixel 9 phones",
  "score": 112,
  "selftext": "Google on Tuesday announced new artificial intelligence features that are coming to Android devices. The move to bring its Gemini AI assistant to supported devices shows again how Google aims to put its AI in front of consumers before Apple, which will launch its AI on iPhones, Macs and iPads later this year.\n\nGoogle doesn’t make a lot of money from its hardware business but the latest Android features could help drive new revenue through the company’s Gemini AI subscription program.\n\n“We’ve completely rebuilt the assistant experience with Gemini, so you can speak to it naturally the way you would with another person,” said Android Ecosystem President Sameer Samat in a Tuesday blog post. “It can understand your intent, follow your train of thought and complete complex tasks.”\n\n“Starting today, you can bring up Gemini’s overlay on top of the app you’re using to ask questions about what’s on your screen,” Samat wrote. It will be available on hundreds of phone models from dozens of device makers, according to Google.\n\nGoogle previously had some AI features in Android, but this is the first year it’s heavily emphasizing new capabilities powered by a large AI language model installed on devices.\n\nOne example the company provided involved a user uploading a photo of a concert list and asking Gemini to see if their calendar is free, after which Gemini checks Google Calendar. If the user has availability in their schedule, Gemini offers to create a reminder to check ticket prices later that night.\n\nThe assistant can also perform tasks using information from Google apps.\n\n“For example, Gemini can help create a daily workout routine based on your personal trainer’s email, or use your resume in Google Drive to write a work bio,” the company stated in its blog post. \n\nThe company also said a user might ask the Gemini assistant to draft an email and “create an image of a cake for someone who loves space,” which the assistant can create and attach to the email. Or, in YouTube, a user might ask Gemini a question about the content in a video.\n\nYou can ask about what’s on your phone screen in other apps, too, like Maps, Flights and Gmail. Google said it’s working to add support for third-party extensions, which suggests developers may be able to add the option to their apps later.\n\nGemini’s assistant has a range of voices. A user can have a human-like conversation through its Gemini “Live” feature, which the company first announced at its May developer conference. “Live” will initially be available for select devices and subscribers to Google’s Gemini Advanced program, which costs $19.99 per month.\n\nIn June, Apple announced its long-awaited artificial intelligence push, Apple Intelligence, that can do tasks like recognize notifications important to personal context, and do cross-application tasking as well as letting Siri tap into OpenAI’s ChatGPT when needed for tasks such as its writing tools and creating images.\n\nApple’s system is currently in testing. Some early features will launch this fall alongside new iPhones, but the bulk of the system won’t be released until next year.\n\nNew Pixel 9 phones and Pixel Watch 3\n\nGoogle also announced its latest line of homegrown “Pixel” phones, including the Pixel 9, the Pixel 9 Pro, the Pixel 9 Pro XL and the Pixel 9 Pro Fold, which come with the Gemini AI features.\n\nThe Pixel 9 series has, among other new features, an upgraded camera and a screen that’s 35% brighter for better viewing in direct sunlight. It ships with Google’s latest Tensor G4 processor and 16GB of RAM to support AI use. RAM stands for random access memory —an important part of a computer’s hardware that stores data needed to run applications.\n\nRAM is a crucial component for running artificial intelligence inside a smartphone. Google has said that the amount of memory is a major factor in determining whether a phone can run AI.\n\nBy contrast, only high-end iPhones released in 2023 can run Apple Intelligence, which AI developers believe is due to lower amounts of memory installed on older iPhones.\n\nThe Pixel 9 starts at $799, which costs $100 more than the Pixel 8, however, smartphone costs have risen across most phone makers in the last year. The Pixel 9 Pro, which comes with a free year of “Gemini Advanced” subscription, starts at $999 and the Pixel 9 Pro XL starts at $1,099. The Pixel 9 Pro Fold starts at $1,799.\n\nLastly, Google also announced the Pixel Watch 3. It’s available in two sizes, 41 millimeter and 45 mm, with larger screens than earlier models. New features include the option to plan running workouts, information on your recovery with readiness and cardio load data, and AI-powered workout recommendations. Google also said the Pixel Watch 3 is more deeply embedded with its ecosystem, allowing you to access Nest camera and doorbell feeds, the Google TV remote, offline Google Maps, and more. The Pixel Watch 3 offers up to 24 hours of battery life, or up to 36 hours with Battery Saver mode.\n\nSource: https://www.cnbc.com/2024/08/13/google-pixel-9-phones-first-ai-powered-android-update-announced.html",
  "link_flair_text": null,
  "id": "1erimom",
  "num_comments": 43,
  "created_utc": 1723581713,
  "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/",
  "comments": [
    {
      "id": "lhzgtxt",
      "score": 28,
      "body": "> Starting today, you can bring up Gemini’s overlay on top of the app you’re using to ask questions about what’s on your screen\n\n\nHuh? You've been able to do that for a while now",
      "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/lhzgtxt/",
      "created": 1723589452,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz2uoe",
      "score": 47,
      "body": "I watched the event and was really disappointed. Google is pushing out an incomplete product and charging an extra $100 for it. The live demos failed like three times. It couldn't consistently complete tasks and generated partial smudges at least once when asked to edit images. Plus, they're delaying a lot of features. Android 15 isn't launching with the Pixel 9 like normal. Only the features specifically made for the Pixel 9 are coming out, so who knows when the rest will be released. \n\n\nAll these phone companies have staked everything on AI, but it's just not a consistent product and it's unclear when it will be. Apple is having the same problems with Apple Intelligence since part of it has been delayed till next year too. It's all just burning up brand credibility.",
      "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/lhz2uoe/",
      "created": 1723584544,
      "depth": 0,
      "replies": [
        {
          "id": "li2govd",
          "score": 5,
          "body": "> I watched the event and was really disappointed. Google is pushing out an incomplete product and charging an extra $100 for it.\n\nThat's what all the big tech companies are doing, and it's insane to me how little backlash they're getting (read: none).\n\nNever going to forget Microsoft Github's Copilot 2 launch event, where it was essentially touted as a perfect and working AI coder. Some of the specific features they bragged about were straight up lies.\n\nHow trillion dollar companies can be ok with releasing such blatantly shitty products and lie so much (and get away with it)... I just don't understand.",
          "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li2govd/",
          "created": 1723640934,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lhzubsm",
          "score": 15,
          "body": "It's almost as if AI isn't useful enough to justify the massive spending on it for the past few years.\n\nAt least Apple is spending comparatively little by using on-device inferencing a lot instead of cloud-based.",
          "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/lhzubsm/",
          "created": 1723594458,
          "depth": 1,
          "replies": [
            {
              "id": "lhzz87c",
              "score": 11,
              "body": "This has been my opinion for over a year, but sharing it on Reddit will typically get you downvoted to oblivion. Until it works consistently, it's all just hype. I can't imagine any other industry getting away with saying, \"This product sometimes lies to you and only works correctly 85% of the time, but I promise it's worth billions and you should completely reorient your business and life around it.\"",
              "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/lhzz87c/",
              "created": 1723596290,
              "depth": 2,
              "replies": [
                {
                  "id": "li0266i",
                  "score": 11,
                  "body": "i think the issue is this is the most promising tech innovation to happen in awhile. If big tech doesn't invest in this, what will they invest in. Faster chips? better cameras? Both are already very good.",
                  "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li0266i/",
                  "created": 1723597390,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "li7179p",
                      "score": 3,
                      "body": "For Pixel? Yes give us better cameras and chips.\n\nGoggle still hasn't fixed the camera overheating problem in Pixels. Say what you want about Samsung or Apple but neither have problems addressing fundamental flaws with hardware like Google does.",
                      "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li7179p/",
                      "created": 1723699085,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "li24uvh",
                  "score": 5,
                  "body": ">only works correctly 85% of the time, but I promise it's worth billions and you should completely reorient your business and life around it.\n\nAre you familiar with the term yield in semiconductor manufacturing?",
                  "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li24uvh/",
                  "created": 1723636065,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "li0gi5w",
          "score": 1,
          "body": "frighten tart aback ripe angle repeat fuzzy shocking office frightening\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li0gi5w/",
          "created": 1723602842,
          "depth": 1,
          "replies": [
            {
              "id": "li0shid",
              "score": 2,
              "body": "Depends on the task, but I think they showed examples of both over the course of the event.",
              "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li0shid/",
              "created": 1723607957,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "li13yxd",
          "score": 0,
          "body": "Ye it looks like a glorified siri or search engine, still waiting to see real world useful application ",
          "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li13yxd/",
          "created": 1723613892,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhyzbtx",
      "score": 17,
      "body": "I hate all of the AI shit and disable it when possible. I've been using Android since it was first released with the T-Mobile G1 and it's gone downhill every release since then.\n\nGet off my lawn, you damn kids!",
      "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/lhyzbtx/",
      "created": 1723583045,
      "depth": 0,
      "replies": [
        {
          "id": "lhz91lo",
          "score": 2,
          "body": "That was a great phone!",
          "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/lhz91lo/",
          "created": 1723586661,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li1oi83",
          "score": 1,
          "body": "AI shit is really shit. They’re automating all the fun stuff so we have more time to do the shit stuff.",
          "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li1oi83/",
          "created": 1723626788,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lhz5igd",
      "score": 11,
      "body": "we need some open source Linux phone software ",
      "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/lhz5igd/",
      "created": 1723585459,
      "depth": 0,
      "replies": [
        {
          "id": "lhz6yi3",
          "score": 56,
          "body": "Android is open source Linux phone software",
          "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/lhz6yi3/",
          "created": 1723585947,
          "depth": 1,
          "replies": [
            {
              "id": "lhz8mlc",
              "score": 1,
              "body": "so why we don't see constantly updating alternate forks? like the way we have Ubuntu/Linux mint etc? correct me if I am wrong there are ways you can flash your phone but I don't think we are there with software security/ compatibility with with hardware ",
              "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/lhz8mlc/",
              "created": 1723586516,
              "depth": 2,
              "replies": [
                {
                  "id": "lhz939c",
                  "score": 16,
                  "body": "Binary blobs in drivers, due to proprietary graphics drivers and cellular cards.",
                  "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/lhz939c/",
                  "created": 1723586677,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "li04lgl",
                      "score": 2,
                      "body": "Binary blobs?",
                      "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li04lgl/",
                      "created": 1723598299,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "li0dvh5",
                          "score": 4,
                          "body": "Proprietary drivers and firmware that prevents open software.",
                          "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li0dvh5/",
                          "created": 1723601815,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "li2bzeo",
                              "score": 3,
                              "body": "I’m just being silly- “blob” being “binary large object.” Binary binary large object. ATM machine.",
                              "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li2bzeo/",
                              "created": 1723639118,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "li405o5",
                                  "score": 1,
                                  "body": "Ah that's interesting.",
                                  "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li405o5/",
                                  "created": 1723658912,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "li0svn3",
                      "score": 1,
                      "body": "We have that on desktop too though.",
                      "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li0svn3/",
                      "created": 1723608141,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "li0sqh0",
                  "score": 3,
                  "body": "We have a few, but most people aren't willing to maintain mobile codebases for free.",
                  "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li0sqh0/",
                  "created": 1723608073,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "li0ybc1",
                      "score": 1,
                      "body": "who pays for the likes of Ubuntu and all those Linux free software? ",
                      "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li0ybc1/",
                      "created": 1723610829,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "li25g8e",
                  "score": 1,
                  "body": "You can, and I think there are a lot of forks.\n\nThe problem though is that to use Android's online services (basically all of google services and playstore), the device must be certified by Google and be provisioned with a certified key.",
                  "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li25g8e/",
                  "created": 1723636333,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "li1tbk0",
          "score": 1,
          "body": "The only real Linux phone is the PinePhone. Sadly, it is very far from the level of the current android phones.\n\nWe already have some good Android forks though, like Graphene OS, which supports all the recent Google Pixels.",
          "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li1tbk0/",
          "created": 1723629927,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li2dn0i",
      "score": 2,
      "body": "I didn't know r/stocks and r/GooglePixel were one and the same",
      "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li2dn0i/",
      "created": 1723639769,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzctoz",
      "score": 8,
      "body": "AI has endless possibilities and all we get are shitty assistants and screen OCR. We live in the worst timeline.",
      "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/lhzctoz/",
      "created": 1723587985,
      "depth": 0,
      "replies": [
        {
          "id": "lhzu0u1",
          "score": 2,
          "body": ">AI has endless possibilities\n\nMaybe people are starting to realize AI is more limited than we initially thought. \n\nSure, there's a ton of potential, but I don't think we're anywhere close to what people have been hyping it up to be.",
          "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/lhzu0u1/",
          "created": 1723594346,
          "depth": 1,
          "replies": [
            {
              "id": "li0nbvq",
              "score": 3,
              "body": "Nah, people were bashing on gen 1 iPhone. \n\nEven Steve Ballmer, CEO of MSFT at the time had to take back his statements.\n\nPeople don't understand you don't get a perfect product from gen 1. Product gets refined each gen",
              "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li0nbvq/",
              "created": 1723605639,
              "depth": 2,
              "replies": []
            },
            {
              "id": "li29lwp",
              "score": 2,
              "body": "You mean fucking Microsoft and their favorite hype man Sam Altman? Their PR campaign around fuckin ChatGPT is what caused all of this lunacy. Like a trillion or more in valuation expansion to be able to charge 1000 people $19.99/month. Nuts.",
              "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li29lwp/",
              "created": 1723638140,
              "depth": 2,
              "replies": []
            },
            {
              "id": "li1omfg",
              "score": 1,
              "body": "Its good at wiping out jobs in the creative industries I guess. That really solved a massive issue for our times.",
              "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li1omfg/",
              "created": 1723626866,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lhzgm52",
      "score": 3,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/lhzgm52/",
      "created": 1723589372,
      "depth": 0,
      "replies": [
        {
          "id": "li2850k",
          "score": 1,
          "body": "I think where it may make more money is on the Business side. Such as using AI in some form to support advertisers generate more advertising revenue",
          "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li2850k/",
          "created": 1723637519,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li4ynml",
      "score": 1,
      "body": "If you come to reddit to get an unbiased impassioned neutral logical opinion then you're looking in the wrong places. This entire website is filled with Apple cultists, Google fanboys and linux zealots ready to grassroots comment on anything related to their respective tech religion.",
      "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li4ynml/",
      "created": 1723669875,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li0px4r",
      "score": 1,
      "body": "Google is really inconsistent with its products. Like their CEO",
      "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li0px4r/",
      "created": 1723606788,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzxuj0",
      "score": 1,
      "body": "I guess I'm glad I don't get software updates anymore.",
      "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/lhzxuj0/",
      "created": 1723595773,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhz1nnl",
      "score": -1,
      "body": "Pass",
      "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/lhz1nnl/",
      "created": 1723584121,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li07lvv",
      "score": 0,
      "body": "Ugh I guess it’s not too long until they don’t let us turn off the AI phone assistant bullshit huh",
      "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li07lvv/",
      "created": 1723599440,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lhzsyby",
      "score": -4,
      "body": "Gemini Sucks",
      "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/lhzsyby/",
      "created": 1723593948,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li1cwjh",
      "score": -1,
      "body": "last time I used Gemini it told me to google the answer.",
      "permalink": "/r/stocks/comments/1erimom/google_launches_first_aipowered_android_update/li1cwjh/",
      "created": 1723619275,
      "depth": 0,
      "replies": []
    }
  ]
}