{
  "title": "The Consumer Recession of 2023-2024 and the Future",
  "score": 173,
  "selftext": "Alright so this going to be a long post so bear with me. I think we are currently in a consumer recession right now. Now you’re probably thinking ok but how? GDP continues to grow, unemployment continues to be stable, and the market is higher than ever right now. I am going to talk about some companies here that will hopefully give support to my theory.  \n\n1. Microsoft (MSFT)\n\nNow you’re probably wondering why this is the first company I am bringing up when Microsoft grew revenue and income. Microsoft grew revenue by 10% and net income by 20%. Microsoft does both software and hardware. The software parts of the business like Office, Cloud, and Services increased substantially. However when you look at the hardware side of the business it paints a different picture. \n\nDevice revenue decreased 20%. These are things like personal computers, accessories, and other electronics that Microsoft sells and this part of their business declined considerably. Gaming revenue decreased by 5% with Xbox hardware sales falling 11%. We are currently seeing a similar trend in 2024. People are pulling back on items like PCs and gaming consoles. \n\nNow you’re probably thinking “yeah random redditor not everybody buys PCs/Xboxs every year. This means nothing.” \n\nSo now we go to our next company. \n\n2. Apple\n\nLike Microsoft Apple is a big tech company that is integrated into our society and the every day consumer. If you don’t personally use them you know someone who uses their products. If we look at Apples results in 2023 and we look at product sales they declined from 316.1 billion to 298 billion. Hardware sales were down across the board. Macs, iPhones, iPads, and Wearables all declined. However no what didn’t decline? Services. Like Microsoft services grew for Apple from 78.1 billion to 85.2 billion. Once again we are seeing this pattern of physical products that appeal to the middle class consumer fall. \n\nNow you’re probably thinking “yeah random redditor but Apple isn’t cool anymore so of course their products are not selling. So that makes no sense and means nothing in the grand scheme of things.” Ok let’s keep going. \n\n3. Nike\n\nNike is a global fashion and one of the biggest in the world if not the biggest. Like Apple if you don’t use their products you personally know someone who uses them. They’re everywhere. Nike reported a decline in revenue by 2% in 2024 and is currently forecasting a 10% drop in Q1 2025 and a drop for the full year of 2025. We saw Nike report product declines like their shoes in 2024 and it’s expected to get worse in 2025. The stock is currently sitting at a multi year low and besides Covid these levels haven’t been seen since 2018.\n\nNow you’re probably thinking “ok random redditor but Nike isn’t cool anymore and Adidas is better and sells more track suits to the Eastern Europeans. So it makes sense why it’s down.” Ok lets look at more. \n\n4. Home Depot and Lowe’s\n\nThe two home building retailer giants of the US. If you own a home or have done work on your home you’re familiar with these 2 companies. These 2 companies are staples to the entire US economy. Similar to UPS and FedEx if you want to get a general look at how the economy is doing you’re paying attention to these two companies as they’re crucial to its health. In 2023 we saw Home Depots sales decrease by 3% and earnings decrease by 9.5%. We just saw Home Depot recently report their earnings and according to them they expect more pain as the consumer continues to pullback. We saw a similar result for Lowe’s. They reported a net sales decrease of 11% and are forecasting another sales decrease in 2024. With expectations being another 2-3% fall in comparable sales. \n\nBoth Home Depot and Lowe’s stock are still down from their highs in 2021. Home Depot is down 16% and Lowe’s down 10% which was close to 3 years ago. \n\nNow you’re probably thinking “ok random redditor but those are boomer companies nobody cares about.” Ok how about another one. \n\n5. Target \n\nTarget is a company that you know well cause you either have a mom or a girlfriend or both who spends their day there. Target is the upperclass Walmart that is a bit more luxurious and like all the other companies I mention they appeal to the middle/high class. \n\nIn 2023 Target reported a sales decline of 1.7% and a comparable sales decline of 3.7%. Full year revenue decreased by 1.7%. The company going forward is expecting a continued consumer pullback and is expecting either flat or declines. Target stock is currently down 48% from its high with its high being in 2021. \n\nI can really keep going with this. Here is some more. \n\n1. Estee Lauder: massive stock decline\n\n2. Ulta Beauty: massive stock decline\n\n3. UPS (a crucial economic stock): massive stock decline\n\n4. Lululemon: massive stock decline\n\n5. Dollar General: massive stock decline\n\n6. Hershey: massive stock decline \n\n7. Starbucks: massive stock decline\n\nNow what is the point of all of this and all these companies mentioned and talked about? These are all companies that sell a semi luxury product that appeals to the middle class consumer. Now we are seeing the middle class  consumer pull back on these products. Maybe you’re not buying the next Microsoft PC this year, or the new iPhone, or the new pair of Nike sneakers due to rising costs in other areas. This is causing the market to price in future bad results and causing the stock price to crash. \n\nWe are seeing a case where the market is not reflecting the economy. Businesses all across various industries are showing declines across the board and it’s only expected to get worse. Now with all these declines in other industries why is the market so high? The answer is tech. Companies like Nvidia, Google, Amazon, Microsoft, Apple, Meta, Broadcom, Qualcomm, AMD, etc. are dominating the market. With these stocks continuing to increase and other stocks continuing to decrease it’s only getting worse. They have a heavy weight on the indexes and they’re causing most of the gains in the index while we are seeing other sectors decline. \n\nThis has caused tech valuations to soar and other areas of the market to lag. Now what does this mean going forward. Are we due for a massive decline in the market where we see tech finally come down? \n\nI personally don’t think so. However I think going forward we won’t see the returns that tech has given now going forward. I think these stock declines in the market has presented opportunities and we can possibly see a sector rotation. For example the Fed cutting rates and alleviating pressure on the consumer. A case where tech lags behind and we see other areas of the market which have fallen start to climb. I could be wrong on this but these are just my thoughts. Let me know what you think about this theory.",
  "link_flair_text": null,
  "id": "1eruoyr",
  "num_comments": 120,
  "created_utc": 1723617465,
  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/",
  "comments": [
    {
      "id": "li1r2e1",
      "score": 41,
      "body": "Let me give this post extra information to support it: \nIn Belgium right now, new clothing is selling less and second hand clothing from Vinted is booming, because clothing over there is sold so cheap. \nPeople in Belgium are also less happy to spend money at an expensive restaurant. The cheaper restaurants are really busy right now (I take my example from Metropole, a cafe at Oude Markt, Leuven, which still sells Pasta Bolognese under 15€, very large portion. This cafe is full through the whole afternoon and evening. Other restaurants that offer more expensive food are less and less crowded.\n\nWe are definitely pulling back as consumers over here, but I think it also has to do with our priorities shifting. Maybe more and more of us realize that second hand clothing isn't bad and cooking at home is rewarding and cheap restaurants are also just as fun.\n\nOn the other hand, people still have money and they are spending it elsewhere i guess: on the stock market buying tech stocks. If demand stays high they won't crash, if people want to buy Target and Lululemon, then there will be a sector shift.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1r2e1/",
      "created": 1723628484,
      "depth": 0,
      "replies": [
        {
          "id": "li278lt",
          "score": 19,
          "body": "Same in Montreal Canada. Daily consumption has reduced, mainly due to the cost of life rising by a lot and salary not following up. In 2022 my corner breakfast place was around 12$ for the big basic breakfast coffee included, now it’s 18$ + 1.25$ for coffee. ",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li278lt/",
          "created": 1723637132,
          "depth": 1,
          "replies": [
            {
              "id": "li2poxi",
              "score": 10,
              "body": "Crazy right? Your common sense just doesn't want to spend that much money anymore.\nCan you tell me more about Montreal? Are the house prices also through the roof? This is also a big recession indicator i think. As we've seen in the USA in 2001-2007, Japan in 1990's and now China, the economy is very dependent on if houses get sold and if they don't, all banks who lend money to home building companies make big losses -> stock market returns plummet for the affected companies.\n\nI saw a video about Canada where the commentator indeed said that house prices are incredible expensive and also the rent! (E.g. 2000 to 3000 CAD dollars a month for an appartment)",
              "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2poxi/",
              "created": 1723644147,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "li22mr1",
          "score": 11,
          "body": "Also, the customers of the services of these tech stocks are also businesses, not consumers. This means that only when these businesses start noticing that at the end of the product chain the consumers aren't buying more, even with the AI technology finding its way to their wants and needs, the tech stocks will notice a drop in their service sales. This is when officialy, the tech bubble will pop.\n\nAlso, tech stocks aren't big dividend givers, this means that we stockholders will suffer when their numbers will drop, the later we jump on the bus, the more stops we've missed to get off it before it's reached its final destination: B2C doesn't generate the revenue we might've hoped for. \n\nOnly thoughts no research",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li22mr1/",
          "created": 1723635030,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lia7ft0",
          "score": 1,
          "body": "I disagree, Inflation has been out of control",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/lia7ft0/",
          "created": 1723747753,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li20bv3",
      "score": 17,
      "body": "TLDR: OP is saying a lot of consumer stocks are down substantially (and there is a long list of additionals that OP did not mention) so there is a consumer recession (I don't think across the board, but imo it's gradually moving in the direction towards an eventual, broader consumer recession.) OP sees tech lag and further sector rotation if the fed cuts rates.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li20bv3/",
      "created": 1723633891,
      "depth": 0,
      "replies": [
        {
          "id": "li71yc4",
          "score": 5,
          "body": "Op is right we’ve been in a recession for a while. It’s just that we’ve had money printing going straight to the corporations to keep the stock market up and eventually you’ll start to see it turn over. Although I don’t follow the market as actively as I once did, I don’t think there is anything that will continue to drive the market up. Eventually calling inflation profits will start to backfire.",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li71yc4/",
          "created": 1723699511,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li1avuv",
      "score": 202,
      "body": "We aren’t in a recession by any economic metric. It’s just that wealth inequality feels like there is a recession for the lower income class with fixed costs like insurance groceries and rent and cars going up.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1avuv/",
      "created": 1723618014,
      "depth": 0,
      "replies": [
        {
          "id": "li1cxag",
          "score": 55,
          "body": "We're in economic expansion combined with consumer pullback. The benefits of this tech bounty won't go to 80% of the population, except maybe I'm their 401(k)s and IRAs of they can afford to keep up contributions.",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1cxag/",
          "created": 1723619288,
          "depth": 1,
          "replies": [
            {
              "id": "li6uniw",
              "score": 2,
              "body": "401k? IRA? Over 60% of Americans don’t have much saved.  \n\nAccording to a 2024 MarketWatch survey, 66.2% of Americans say they’re living paycheck to paycheck, meaning they have little to no money left over for savings after paying their monthly expenses.",
              "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li6uniw/",
              "created": 1723695622,
              "depth": 2,
              "replies": [
                {
                  "id": "libl8ou",
                  "score": 2,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/libl8ou/",
                  "created": 1723764172,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "libm1wq",
                      "score": 3,
                      "body": "Consumer debt is at all time highs.  As are defaults",
                      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/libm1wq/",
                      "created": 1723764463,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "libm8km",
                          "score": 0,
                          "body": "[deleted]",
                          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/libm8km/",
                          "created": 1723764530,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "libo5cp",
                              "score": 3,
                              "body": "Uh Because consumers are taking on debt",
                              "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/libo5cp/",
                              "created": 1723765218,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "libp4ya",
                                  "score": 0,
                                  "body": "[deleted]",
                                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/libp4ya/",
                                  "created": 1723765574,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lic5nrs",
                                      "score": 2,
                                      "body": "It’s actually the reverse.  We’re taking on debt for needs more than wants",
                                      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/lic5nrs/",
                                      "created": 1723771738,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lia7mf7",
              "score": -1,
              "body": "Joe Biden has been a terrible president ",
              "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/lia7mf7/",
              "created": 1723747810,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "li2go29",
          "score": 36,
          "body": "If we took government spending out of GDP we would have been in a recession for over a year. The only reason we aren’t in a recession is because the government spends so much. The same thing can be said about unemployment. If the government wasn’t hiring so much, unemployment would currently be in double digits.\n\nWe are paying to not be in a recession with government debt.",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2go29/",
          "created": 1723640926,
          "depth": 1,
          "replies": [
            {
              "id": "li2mqb4",
              "score": 18,
              "body": "The government is a huge employer and part of the economy.",
              "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2mqb4/",
              "created": 1723643120,
              "depth": 2,
              "replies": [
                {
                  "id": "li3nuhn",
                  "score": 7,
                  "body": "Kinda like Greece until that house of cards collapsed.",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li3nuhn/",
                  "created": 1723655096,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "li43z8m",
                      "score": 8,
                      "body": "Greece doesn’t issue the world reserve currency.",
                      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li43z8m/",
                      "created": 1723660108,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "li2ooc4",
                  "score": -2,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2ooc4/",
                  "created": 1723643797,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "li2qcm7",
                      "score": 19,
                      "body": "The government isn’t a company and has the ability to tax. Debate on deficit spending aside, it’s still part of the economy, a huge employer, and correctly included in GDP.",
                      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2qcm7/",
                      "created": 1723644372,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "li4yanv",
                  "score": -1,
                  "body": "[removed]",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li4yanv/",
                  "created": 1723669761,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "li52exb",
                      "score": 1,
                      "body": "source?",
                      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li52exb/",
                      "created": 1723671097,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "li5xagv",
              "score": 1,
              "body": "You can say that about any part of the economy. Delete a part and the whole is smaller. \n\nThere's nothing about government spending that's less real than anything else.",
              "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li5xagv/",
              "created": 1723681973,
              "depth": 2,
              "replies": []
            },
            {
              "id": "li3o5xl",
              "score": -2,
              "body": "Good strategy if you're the Biden administration. Boost the economy before the next election cycle. Long term won't be so good, but who cares about that.",
              "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li3o5xl/",
              "created": 1723655196,
              "depth": 2,
              "replies": [
                {
                  "id": "li3tpcp",
                  "score": 7,
                  "body": "What an astute observation. Might I ask you who in the government makes the budget",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li3tpcp/",
                  "created": 1723656909,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "li52hy5",
                  "score": 4,
                  "body": "bro just thinks biden waves a wand and can boost the economy",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li52hy5/",
                  "created": 1723671124,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "li8u20r",
                      "score": 1,
                      "body": "It's pretty simple, print a bunch of money and spend it on American companies. The economy is propped up just like Greece before they crashed.",
                      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li8u20r/",
                      "created": 1723732232,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "li4n0d0",
          "score": 3,
          "body": "To your point i recently read an article that said 59% of Americans believe we’re in a recession.",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li4n0d0/",
          "created": 1723666243,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lia7kh3",
          "score": 1,
          "body": "The middle income class if being hit the hardest not the lower income class",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/lia7kh3/",
          "created": 1723747792,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li24z4c",
          "score": 0,
          "body": "This is just a dumb thing to say. There are so many factors I dictating a recession. If you actually think there aren't, you are blind as a mole. \n\nCredit is at all time highs, consumer goods are down, the market is on the edge, the housing market is on its head, national debt, INFLATION, and deficit are soaring. There are so many signs flashing, so WHAT ARE YOU TALKING ABOUT?",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li24z4c/",
          "created": 1723636118,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li3il97",
          "score": 1,
          "body": "Wouldn’t the metric be 2 consecutive backwards GDP? I thought we had that already lol",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li3il97/",
          "created": 1723653451,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li1blgg",
          "score": -9,
          "body": "We are not in a recession currently but a recession might be coming. Jamie Dimon said recently that he still expects a recession. Multiple indicators such as the Sahm rule suggests a recession is coming. Emmanuel Saez released a new paper that calculated the recession chance at 40%.",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1blgg/",
          "created": 1723618460,
          "depth": 1,
          "replies": [
            {
              "id": "li1fsgu",
              "score": 42,
              "body": "Jamie Dimon - \n\nMar 2024\nhttps://qz.com/jamie-dimon-recession-jpmorgan-chase-1851328555\n\nNov 2023\nhttps://edition.cnn.com/2023/11/29/investing/jamie-dimon-recession-jpmorgan-economy/index.html\n\nOct 2022\nhttps://www.google.com/amp/s/www.cnbc.com/amp/2022/10/10/jpmorgan-jamie-dimon-warns-us-likely-to-tip-into-recession-soon.html\n\nJun 2022\nhttps://www.cnbc.com/2022/06/01/jamie-dimon-says-brace-yourself-for-an-economic-hurricane-caused-by-the-fed-and-ukraine-war.html\n\nMy point is, there guys get paid to make the recession guess every. Single. Week, on the basis that they work for a financial institute and therefore their words should be taken as gospel, when in reality, they get like 4-5 things right out of every 100 things they say to the press.\n\nI really don't understand why we ever say \"oh but this financial guy said there might be a recession so we gotta be careful\".\nNo, what we should do is, look at a person's track record of what they say, and see how accurate they've been. That would provide better clarity and validity on the points they make. \n\nThese recession predictors are like the story, Peter and the wolf, but we seem to allow peter in these cases to scream wolf every week and take it as gospel.",
              "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1fsgu/",
              "created": 1723620941,
              "depth": 2,
              "replies": [
                {
                  "id": "li1ft72",
                  "score": 4,
                  "body": "It looks like you shared an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot). Fully cached AMP pages (like the one you shared), are [especially problematic](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.cnbc.com/2022/10/10/jpmorgan-jamie-dimon-warns-us-likely-to-tip-into-recession-soon.html](https://www.cnbc.com/2022/10/10/jpmorgan-jamie-dimon-warns-us-likely-to-tip-into-recession-soon.html)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1ft72/",
                  "created": 1723620955,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "li2407x",
                  "score": 4,
                  "body": "These guys are no better at predicting the future than my parish priest.",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2407x/",
                  "created": 1723635677,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "li49c9g",
                  "score": 1,
                  "body": "I'm still new to investing, so I could be wrong, but I feel like the primary problem with these talking heads is that they HAVE to say something\n\nthey can't just take a few days, weeks or even months off and say \"hey, let's wait and see what happens\". they have to put out articles every single day, and people expect them to say something\n\nso, they say what they can based on what they know, and pick the most likely scenario as they can't say nothing",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li49c9g/",
                  "created": 1723661779,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "li3l9yr",
                  "score": 0,
                  "body": "If we just gave credence to the words of people based on that criteria, we would search for an eternity. It's like Lance Armstrong said or thereabouts, if we gave the Tour De' France titles to only the clean riders, we would have to award them to the last place finishers.",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li3l9yr/",
                  "created": 1723654290,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "li1ny77",
              "score": 7,
              "body": ">Sahm rule\n\nEven the creator of the Sahm rule doesn't think it's right in this case\n\nhttps://fortune.com/2024/08/02/recession-indicator-claudia-sahm-rule-trigger-unemployment-rate-jobs-report/",
              "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1ny77/",
              "created": 1723626420,
              "depth": 2,
              "replies": [
                {
                  "id": "li3ep6w",
                  "score": 3,
                  "body": "It’s more nuanced than that. Right now is not code red but still code yellow. I said a recession might be coming and there is evidence, not that we are in a recession already or that a recession is guaranteed.",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li3ep6w/",
                  "created": 1723652218,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "li29tu6",
                  "score": -11,
                  "body": "Claudia should've been a stay at home mom.",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li29tu6/",
                  "created": 1723638232,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "li2ne82",
                      "score": 3,
                      "body": "^ threatened by smart, successful women.",
                      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2ne82/",
                      "created": 1723643352,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "li1qc6n",
              "score": 4,
              "body": "Jamie is a lying bastard who will sell his kids for extra profit. Everything he says is to be viewed as manipulation ",
              "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1qc6n/",
              "created": 1723628007,
              "depth": 2,
              "replies": [
                {
                  "id": "li52h5p",
                  "score": 1,
                  "body": "I’m not typically a fan of bankers but I do have respect for Jamie Dimon. What are your qualms with him?",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li52h5p/",
                  "created": 1723671117,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "liazkvc",
                      "score": 1,
                      "body": "Dear Jamie, at minimum, we all remember the London Whale \"incident\". ",
                      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/liazkvc/",
                      "created": 1723756709,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "li1v7af",
              "score": 6,
              "body": "Lmfao imagine quoting Jamie Dimon of fucking Morgan Stanley and thinking you’ve made a point.",
              "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1v7af/",
              "created": 1723631068,
              "depth": 2,
              "replies": [
                {
                  "id": "li37qc1",
                  "score": 2,
                  "body": "Imagine thinking you made a valid counterpoint by getting Jamie Dimon’s company wrong.\n\nAnd just ignore the other 2 economists, yeah?",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li37qc1/",
                  "created": 1723650008,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "li40z0j",
                      "score": 2,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li40z0j/",
                      "created": 1723659167,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "li429lo",
                          "score": 2,
                          "body": "Yeah I did. Like I wrote in another comment, there is more nuance and evidence than people are saying. Warren Buffett sold half his Apple position and has over $200B in cash now. The status is not code red but more like code yellow.",
                          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li429lo/",
                          "created": 1723659575,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "li1fyip",
              "score": 4,
              "body": "so 60% chance of no recession nice",
              "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1fyip/",
              "created": 1723621051,
              "depth": 2,
              "replies": [
                {
                  "id": "li3ara4",
                  "score": 0,
                  "body": "You realize that 60% is pretty bad right? Close to being a coin flip. Anyway, not code red yet but like code yellow right now.",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li3ara4/",
                  "created": 1723650959,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "li5xfja",
          "score": 0,
          "body": "Lower income groups have been getting bigger pay increases than average.",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li5xfja/",
          "created": 1723682025,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li746p6",
          "score": 0,
          "body": "Oh boy.\n\nI don't even know where to start with how absolutely wrong this is.\n\nIt's breathtaking.",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li746p6/",
          "created": 1723700778,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li1jf66",
      "score": 9,
      "body": "I agree that there has definitely been a consumer pullback on luxury expenses",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1jf66/",
      "created": 1723623348,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li1okih",
      "score": 36,
      "body": "As for recession and spending trends, I'm not clued up or qualified to know better, but that was insightful and well researched. \n\nReading, through, I was initially going to say that Microsoft (MSFT) acquired GitHub not too long ago and have a foot-hold on AI products, only to remember that GitHub isn't really consumer based and their use of AI isn't fully fleshed out yet. So what you've shared is a good observation. \n\nIt seems Warren Buffet might be thinking similar? [https://www.cnbc.com/2024/08/05/warren-buffetts-decision-to-sell-stocks-and-raise-record-cash-before-sell-off-sends-wake-up-call.html](https://www.cnbc.com/2024/08/05/warren-buffetts-decision-to-sell-stocks-and-raise-record-cash-before-sell-off-sends-wake-up-call.html)",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1okih/",
      "created": 1723626831,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li2e68i",
      "score": 40,
      "body": "Or it's just the logical continuation of the K-shaped recovery. The top economic quintile is getting richer. The CEO  of some hotel chain was on Bloomberg an hour ago and their average price per night is over $1300.\n\nThe second quintile is doing OK. They are focused on moving money offshore, and getting GOP politicians elected to help them move up to the top quintile \n\nThe rest of the population is on the same downward glide path they've been on since they were downsized a decade or two ago and started getting paid on a 1099 as \"self employed\" for the same work they did before on a W2 with associated benefits. \n\nThe economy is just a bunch of numbers until you stand out on the street and start matching numbers with faces. \n\nIt may not be a recession for you but it's definitely a recession for someone not very far away from you. \n\n/rant",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2e68i/",
      "created": 1723639976,
      "depth": 0,
      "replies": [
        {
          "id": "li3iw28",
          "score": 14,
          "body": "This is my take too. Wealth inequality is finally getting so severe that it's impacting even middle class consumerism. Considering there has been no policy to address this, expect a K-shaped economy to become continually more pronounced.",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li3iw28/",
          "created": 1723653545,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li4pb38",
          "score": 8,
          "body": "I agree with you but quintile is being generous. It's more like the top .1 percent and the top 5 percent while most everyone else falls in the last category.",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li4pb38/",
          "created": 1723666943,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li1vs2v",
      "score": 8,
      "body": "OP- this is something I was wondering yesterday as well. You can add McDonalds as case in point. Sustained high inflation has taken a toll on consumer goods companies and there is little improvement in sight at the moment.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1vs2v/",
      "created": 1723631407,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li39jm2",
      "score": 6,
      "body": "Recession is a process, not an event. The economy is clearly trending downward and the unemployment is curling up. The unemployment rate has gone up every month in the last 6 months. We could be in a recession right now. I know it sounds crazy but Sahm rule and other similar unemployment rules triggered recently and they only trigger within recessions. \n\nClaudia Sahm, the economist, has said that her rule is a head fake this time because of COVID distortions and other things such as immigration. Her explanation is hand wavy. There are good counter arguments to everything she is saying if you dig into the data. If you just talk to an average person on the street who is looking for a job, it’s extremely difficult to get a job right now, even low paying jobs.\n\nThat said, economy is not falling apart but the direction of the trend is downward so stay cautious.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li39jm2/",
      "created": 1723650582,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li23opl",
      "score": 13,
      "body": "Recession ended last Monday",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li23opl/",
      "created": 1723635530,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li27yeg",
      "score": 8,
      "body": "The luxury market is also seeing decline in revenues because guess what - 27% of luxury goods revenue comes from, you guessed it right, middle class folks.\n\nYour hypothesis is spot on and all the data points support it. However, stock concentration is absurdly in favor of wall street and they can remain irrational until the point where they start jumping of tall buildings. Then the government steps in and makes everything right again.\n\nSo, moral of the story, don’t count on declines in the stock market, especially in an election year.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li27yeg/",
      "created": 1723637439,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li1zdlx",
      "score": 23,
      "body": "Not a consumer recession. Stock declines you've listed are a result of poor company operations. You're attributing weak company performance to broader factors outside their control. \n\nYou claim that the market is up because of tech. This is not true. You can look at the 1-year performance of sector ETFs to see everything except energy is up.\n\nYou've listed declines in poor performing stocks such as EL, DG and HSY which are defensives. \n\nContrast your 3 defensives with the other end of the spectrum COST, WMT and CL.\n\nPoor performing consumer cyclical stocks EL, ULTA, NKE, SBUX and LULU.\n\nNow look at DECK, CMG and AMZN. \n\nIf you cannot pick the right stocks, don't blame a consumer recession, invest in ETFs. \n\nOn MSFT - MSFT device segment was never a good or consistent performer. Xbox has no purpose.\n\nOn AAPL - Macs, iPads and wearables are cyclical and haven't been growth segments in years. \n\n\nI can inverse your entire post by cherry picking companies whose stocks are up YoY and have grown revenues double digit YoY then conclude the consumer is massively booming.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1zdlx/",
      "created": 1723633396,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li28jra",
      "score": 8,
      "body": "4. Home depot and lowe’s, you’re missing a crucial factor. HD conducted many surveys with their clients and customers, Many said that they were pulling back their home projects, and business was slowing. YES, HOWEVER they also stated their customers said they were waiting till rate cuts in september. So not that consumers were exactly pulling back, and a recession is near, rather consumers are becoming smarter waiting a few months to capitalize.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li28jra/",
      "created": 1723637694,
      "depth": 0,
      "replies": [
        {
          "id": "li3428p",
          "score": 16,
          "body": "the average home depot customer specifically stated they were waiting until rate cuts to start a new home project??? I find that hard to believe. Remember that we who are interested in stocks live in a bubble. I would imagine that the average HD/LOW customer has no idea what “rate cuts in september” even means",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li3428p/",
          "created": 1723648845,
          "depth": 1,
          "replies": [
            {
              "id": "li3izov",
              "score": 7,
              "body": "While I want to agree with the sentiment here, there probably is some truth to it. Maybe they didn’t say “September rate cut” but they might have said “waiting to refinance until rates come down”\n\nWe’ve seen a massive boom in refi’s already. People are stretched and need that HELOC money for upgrades/repairs.",
              "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li3izov/",
              "created": 1723653577,
              "depth": 2,
              "replies": []
            },
            {
              "id": "li34l36",
              "score": 1,
              "body": "Nothing said the “average home depot customer”HD did not mention the general public. Obviously this survey was done amongst their contractor/wholesale “customers”. (the larger clients)",
              "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li34l36/",
              "created": 1723649011,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "li1ena8",
      "score": 35,
      "body": "You analysis is perfect, but this sub is full of bulls. They don't care what you have to say. Keep pumping it, until...",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1ena8/",
      "created": 1723620192,
      "depth": 0,
      "replies": [
        {
          "id": "li1x6rl",
          "score": 29,
          "body": "People keep crying recession and it never comes.",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1x6rl/",
          "created": 1723632214,
          "depth": 1,
          "replies": [
            {
              "id": "li2zbix",
              "score": 12,
              "body": "When it does, the mainstream propagandists just redefine what a recession is to say we aren't in one. Case in point, the very short recession of 2022.",
              "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2zbix/",
              "created": 1723647328,
              "depth": 2,
              "replies": [
                {
                  "id": "li3mk85",
                  "score": 1,
                  "body": "Personally, I couldn't even tell in 2022. Nothing for me nor the 20 or 30 people that I know changed. I think for a true recession it needs to be a major impact and last for at least 10 months.",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li3mk85/",
                  "created": 1723654688,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "li4kknb",
                  "score": 1,
                  "body": "No one is saying a recession will never come, of course one will happen sometime maybe even soon. But a few cherry picked examples of companies in decline does not mean there’s a recession. \n\nHead to an airport in a major city this weekend and then tell me how slow the economy is.",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li4kknb/",
                  "created": 1723665482,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lic6cqu",
                      "score": 1,
                      "body": "You are confused; I did not say we are in recession, the original post did. I just stated the obvious - people lie.",
                      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/lic6cqu/",
                      "created": 1723772016,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "li21554",
          "score": 7,
          "body": "im up 40% the last 2 years as people kept saying 2022 was the beginning and flat decade",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li21554/",
          "created": 1723634302,
          "depth": 1,
          "replies": [
            {
              "id": "li2bzzd",
              "score": 2,
              "body": ".... Y'all have been calling the crash for 6 years now \n\nSame with housing. \n\n\n\nAll my investments from 10 years ago are up 200 to 800 percent. \n\n\nWhen a 30 percent correction from the top happens... \n\n\nWho gives a fuck",
              "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2bzzd/",
              "created": 1723639124,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "li1tc9n",
          "score": 1,
          "body": "KABOOM?",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1tc9n/",
          "created": 1723629939,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li2jz1i",
          "score": 1,
          "body": "Far from perfect my friend",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2jz1i/",
          "created": 1723642140,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li4jx86",
          "score": 1,
          "body": "He has some points but has also cherry picked specific companies that fit his narrative while omitting those who don’t. There are logical explanations outside of the general economy for all of his examples. \n\nFor a counterpoint, Costco has seen an 8% increase in revenue, travel has been booming with 10 new records in amount of travelers screened by tsa occurring so far this year, meta who makes almost all their money off of advertising has seen growth meaning tons of businesses are doing well enough to pay for more ads than previous years. \n\nTo attack some of the specific examples given. Apple has seen decline in hardware sales because they have not released any exciting new hardware in almost a year, I expect this next iPhone to be the best selling in years because of the new ai features exclusive to the new model, target is down because it’s a mismanaged company in decline giving a worse experience while their competitors like Walmart are upping their game. Home Depot has seen lower sales because the housing market is slow due to interest rates, once housing picks up so will Home Depot.",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li4jx86/",
          "created": 1723665280,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li2bwmc",
          "score": -3,
          "body": ".... Y'all have been calling the crash for 6 years now \n\nSame with housing. \n\n\n\nAll my investments from 10 years ago are up 200 to 800 percent. \n\n\nWhen a 30 percent correction from the top happens... \n\n\nWho gives a fuck",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2bwmc/",
          "created": 1723639087,
          "depth": 1,
          "replies": [
            {
              "id": "li2chzf",
              "score": 2,
              "body": "Obviously. You are one example of success. Who jumps later (and there are a lot to support your sucess) will be the worse hit. There is no much science.",
              "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2chzf/",
              "created": 1723639324,
              "depth": 2,
              "replies": [
                {
                  "id": "li3nkq3",
                  "score": 1,
                  "body": "I can't lie though, all of my investments are up right around 210% since 2019. I mentioned in another post that for 20-30 people that I know, they're basically living the same from 2019 until now. Maybe, sure, a few won't pay high prices for gas or spend 80.00 on a restaurant, but they aren't looking for the cheapest buy in town either. \n\nI guess my ideology comes from my 20s. Back then I couldn't afford much food or more than a few pair decent pants. When you've come from that to where I am now, recession doesn't mean anything unless it forces me back to near those mid 1990s living style.",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li3nkq3/",
                  "created": 1723655010,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "li2k9sx",
                  "score": -4,
                  "body": "I'm explaining to you whatever crash happens doesn't hurt the economy.   It just makes weak hands weaker and everything continues on",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2k9sx/",
                  "created": 1723642248,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "li23t75",
      "score": 3,
      "body": "This also seems to happen when there are no new and exciting must have products. Interestingly, we are going from a time when everyone was wearing all sorts of contouring makeup and trying to look like a mannequin to much more natural looks, my iPhone and laptop still work and while Apple has some cool stuff there is not enough local market saturation to have the products matter.  \n\nThat being said, housing prices are still really high and that affects disposable income. Also, people are getting tired of overpaying for shit.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li23t75/",
      "created": 1723635587,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li278fn",
      "score": 5,
      "body": "I partly agree with this, however, for this analysis to make sense you would have to look at the entire sector. Not just a couple of companies in isolation.\n\nAs an example, Nike is underperforming but the market size is not shrinking, actually it is expanding (volume/$). They’re losing market share to other brands. So consumers are buying footwear and athleisurewear just to Nike’s.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li278fn/",
      "created": 1723637130,
      "depth": 0,
      "replies": [
        {
          "id": "li2hl33",
          "score": 4,
          "body": "How would one analyze an entire sector this way?",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2hl33/",
          "created": 1723641268,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li2p8yb",
      "score": 2,
      "body": "Economic slowdown != Recession\n\nHell, economic slowdown is the whole point of what the Fed has been doing for the past two years.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2p8yb/",
      "created": 1723643994,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li2q1zu",
      "score": 2,
      "body": "I get your point, but it might not be as bad as it seems. The economy’s still growing, and tech stocks are backed by real innovation, not just hype. Plus, the slowdown could be more about middle-class pressure, not a full-on consumer recession. Some sectors are cooling down naturally after pandemic highs, so it’s not all doom and gloom. Tech could keep driving the market forward.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2q1zu/",
      "created": 1723644272,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li42x1h",
      "score": 2,
      "body": "all of those major stock declines happened because of china. their economy is fucked, their real estate market is death spiraling, and consumers, which make up a fifth to a quarter of those company businesses (ie lululemon, starbucks, nike, apple, estee lauder, etc), suddenly vaporized overnight,",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li42x1h/",
      "created": 1723659777,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li4i3or",
      "score": 2,
      "body": "Maybe your belief is correct and there’s some hidden recession taking place.  But not sure these cherry picked anecdotes are the proof.  For example, you cite a decline in game console sales.  But it’s well established that console sales fade in the cycle between generation refreshes, so that’s not really unusual.  \n\nYou cite UPS falling, but ignore that Fedex has surged.  \n\nYou cite other fashion names falling, while ignoring that other competitors have surged.  \n\nYou cite software companies fading hardware sales, but ignore they have for several years stated they are planning to fade hardware and promote services.\n\nOther anecdotes are more explainable as having unusual comps, or with explainable pull-forward sales, or as being rate sensitive.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li4i3or/",
      "created": 1723664685,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li4xoyj",
      "score": 2,
      "body": "Ok random redditor, what about wal mart?",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li4xoyj/",
      "created": 1723669569,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li6jpkp",
      "score": 2,
      "body": "I’m sorry but this kinda reads like something in wallstreetbets that would be better to inverse. I remain bullish specially with the Mag7 and the whole index fund thing",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li6jpkp/",
      "created": 1723690650,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li23s6h",
      "score": 4,
      "body": "Nice write up but market is forward looking and we eventually won’t have a recession so…",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li23s6h/",
      "created": 1723635575,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li1b616",
      "score": 4,
      "body": "Nah.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1b616/",
      "created": 1723618192,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li25e7k",
      "score": 2,
      "body": "Unemployment isn’t exactly stable, it’s up .9% within a year and in my opinion it’s going to continue going up because companies are starting cost cutting measures because the consumer demand isn’t what it used to be.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li25e7k/",
      "created": 1723636308,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li23u6b",
      "score": 2,
      "body": "Is this the same impending recession I've been hearing about from financial analysts for the past 3 years?",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li23u6b/",
      "created": 1723635600,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li3fmg2",
      "score": 1,
      "body": "Extremely well written.  While the metrics and data claim the economy is doing well, most people feel less prosperous vs a few years ago",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li3fmg2/",
      "created": 1723652511,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li1zlsl",
      "score": 2,
      "body": "This post would have been better (and shorter) without the needless narrative “ok random redditor” paragraph in the first 4 points.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1zlsl/",
      "created": 1723633515,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li2gh7t",
      "score": 1,
      "body": "What are bookings at cruise lines looking like? That’s one of my measures of consumer spending, not mentioned here.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2gh7t/",
      "created": 1723640855,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li2plbp",
      "score": 1,
      "body": "Anecdotally speaking I’ve started to see a lot more deals on goods and a huge push from advertising to buy.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2plbp/",
      "created": 1723644112,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li39d77",
      "score": 1,
      "body": "Inflation erodes bond yields, so stocks are more favorable.  Nobody knows what inflation will do so they may hold short term bonds or equities.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li39d77/",
      "created": 1723650525,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li48fjp",
      "score": 1,
      "body": "it's interesting, because most of those brands are both decreasing in sales, but each \\*also\\* has some special circumstances \n\nNike \"hasn't seen these sales since 2018\"...well, their frequent collaborator Virgil Abloh, who started working with them heavily around 2018, has just passed away\n\nNike also pumped out enormous amounts of shoes during the pandemic. I myself have HUNDREDS of pairs, as do most collectors (who, prior to 2018, would have only bought \\~5-10 pairs a year MAX)\n\nI think, a long with the working class having issues with affordability, the upwardly-mobile classes have come to terms with an overconsumption issue as well, one that seems far worse now these storm clouds are on the horizon",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li48fjp/",
      "created": 1723661495,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li4nlbk",
      "score": 1,
      "body": "Seems like the wealth inequality gap is widening more than ever and faster than ever. Wonder how this concludes to a resolution?",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li4nlbk/",
      "created": 1723666423,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li1f40q",
      "score": 0,
      "body": "Tldr. You could be spot on. You might not. Stocks go up, stocks go down.\n\nThere could be a recession, there might not be. We could have world war 3, we could not.\n\nI can't predict the future, nor guess it based on current events. I just buy VOO and will cash out when I retire in 20-30 years time",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1f40q/",
      "created": 1723620494,
      "depth": 0,
      "replies": [
        {
          "id": "li24cvw",
          "score": 4,
          "body": "no offence but why be active in a stocks subreddit it that is your strategy.",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li24cvw/",
          "created": 1723635840,
          "depth": 1,
          "replies": [
            {
              "id": "li26y0b",
              "score": 1,
              "body": "To speak reason back into folks. I think he’s right. VOO is a buy.",
              "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li26y0b/",
              "created": 1723637003,
              "depth": 2,
              "replies": [
                {
                  "id": "li28oie",
                  "score": 3,
                  "body": "it’s generally the best investment strategy for the majority of people i agree, but this is like joining a subreddit for arguing who is the best footballer in the world and then commenting it’s impossible to know! like yeah i guess but that’s not what we are here for…",
                  "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li28oie/",
                  "created": 1723637750,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "li1c416",
      "score": 1,
      "body": "I agree with yiu",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1c416/",
      "created": 1723618781,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li29qin",
      "score": 1,
      "body": "here's the prob with what you're saying everything you are saying the market knows...hence the vix is higher stocks dropped etc...we're betting on what we don't know yet so stop looking backwards mate",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li29qin/",
      "created": 1723638193,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li6wsfe",
      "score": 1,
      "body": "Consumers are feeling the squeeze.\n\nLayoffs are starting to pile up.\n\nWe’ve tripped through a few recession predictors over this rate cycle.\n\nWe’ve seen a lot of less than stellar earnings this earnings season.\n\nThere’s an obvious desperation to make more money and pander to shareholders lately with many of the streaming services changing fees/plans/adding ads for more revenue.\n\nThe fed has literally never in its history accomplished a “soft landing” with inflation as high as it was.\n\nDespite the bit of recovery in indicies many things not in them have barely recovered if at all from that large drop.\n\nYeah I’ve already recession proofed my 401k and personal investments. I’m personally betting Julys high was the market high for this cycle before recession. If it does rally more and go higher it’ll probably break down early next year I’d bet after Santa rally. I’m just sitting waiting to make some money when it does drop and down the line shift those gains back into the market when its more discounted",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li6wsfe/",
      "created": 1723696711,
      "depth": 0,
      "replies": [
        {
          "id": "li8m21x",
          "score": 1,
          "body": "Some might miss about todays “better than expected retail sales” is that the positive growth ones have been mostly around cars/car parts/appliances. Necessities for mondern life from getting to work to cooking food/washing clothes/etc., while other sales went negative despite the July being the beginning rush of back to school shopping.",
          "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li8m21x/",
          "created": 1723729549,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li1jim7",
      "score": -1,
      "body": ">Alright so this going to be a long post so bear with me. I think we are currently in a consumer recession right now. Now you’re probably thinking ok but how? GDP continues to grow, unemployment continues to be stable, and the market is higher than ever right now. I am going to talk about some companies here that will hopefully give support to my theory. \n\nthis isnt a secret atm. look at the earnings report for various blue chip stocks. They all have decreasing sales. consumers are currently looking for more cost efficient avenues. Instead of that $12 mcdonalds burger, they are looking for deals that will give more food for the same $12.\n\nalso, your \"analysis\" is another one of those typical reddit lazy \"analysis\". its literally just a copy paste of their earnings call.... it may gotten better after your paragraph about apple. but i stopped there since you just followed the same formula as every other redditers \"analysis\"",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li1jim7/",
      "created": 1723623411,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li226e8",
      "score": 0,
      "body": "I think you should continue to invest in good quality companies that have long term growth potential and if you dca when the stock price drops then you are buying at a discount.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li226e8/",
      "created": 1723634809,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li3tdhb",
      "score": 0,
      "body": "This is reddit so we're not allowed to acknowledge anything outside of the urban monoculture but Target, Nike, Hersheys and Starbucks all took sides in culture war politics and pissed off 40% of the market. Companies that stayed out of it did just fine.\n\nYou can say that's all fake news but I personally know many people that stopped shopping with these companies. You see the same poor stock performance with Disney, Ubisoft and Budweiser.\n\nIt used to be common knowledge that you don't mix business with politics but activist millennials seem to have missed that lesson in college.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li3tdhb/",
      "created": 1723656808,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li3x85y",
      "score": 0,
      "body": "I think  op is cheery picking a bit too much. Yes, the bottom 50% is getting squeezed, but they are moving their spending to stores like Walmart and costco, both of which had great earnings. \n\nAs for iPhone sales, the iPhone has not had any significant improvements in years, so it's no wonder why iPhone 14 users may be unwilling to buy the iPhone 15.\n\nAs for microsoft, the Xbox is a couple years old now, and their overall hardware line isn't that impressive. I had a surface 7, and as much as I wanted to like it, it was ass compared to my M1 air.\n\n However, the \"recession\" consumers are feeling now is overall exacerbated by greedy corps raising prices and then blaming it on inflation.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li3x85y/",
      "created": 1723657993,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li42i61",
      "score": 0,
      "body": "But you also need to account for things that have seen an explosion in sales? We dont live in a bubble. There is only x amount of disposable income. For example, weight loss drugs cost $500-$1000 a month. How much disposable income have those gobbled up?\n\nYou talk about Nike but what about competitors? You bring up Starbux but what about the fact that BROS is literally opening locations across the street from them everywhere? Who isnt offering fancier coffee these days? Who doesnt have a Keurig or espresso machine at home? You bring up Target but I dont know anyone who goes there simply because of class... It has nothing to do with wealth. Its due to convenience. Walmart is everywhere. Target is not. Walmart has grocery and their own bakeries and such. Also Amazon is a thing. You bring up Hersheys but I hate their chocolate. Its too sugary and their bar is dry probably because it has low cocoa butter content. Further they keep buying out other companies and changing their bars to their own recipe which sucks... my poor Symphony... gone...\n\nLook im sure things are slowing. Im just not sure its as much as people think.",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li42i61/",
      "created": 1723659649,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li2bi9i",
      "score": -1,
      "body": "You idiots need to buy rycey before ww3 officially starts",
      "permalink": "/r/stocks/comments/1eruoyr/the_consumer_recession_of_20232024_and_the_future/li2bi9i/",
      "created": 1723638925,
      "depth": 0,
      "replies": []
    }
  ]
}