{
  "title": "Deep dive into Dutch Bros ($BROS)",
  "score": 65,
  "selftext": "**1.0 Introduction**\n\nDutch Bros ($BROS) is capturing the attention of many with its impressive location growth.\n\nWhat started as a small pushcart selling espresso drinks back in 1992, expanded to a chain with over 900 locations, posing the question: ***Is it the next Starbucks?***\n\n\n\n**2.0 The Secret To Its Success**\n\nUnlike the competitors, over ***90% of the business is conducted through drive-thru***, allowing it to operate using smaller (in size) shops.\n\n* 50% of all the revenue comes from the sale of coffee;\n* 25% from energy drinks (including its own proprietary Blue Rebel), and;\n* 25% from other beverages (teas, lemonades, sodas, and smoothies).\n\nSince 2008, the company has transitioned to an internal franchising model that required potential franchisees to have worked for the company for **at least three years**. Although this leads to fewer locations, it leads to better quality, which is best reflected in the number of closed locations. \n\nOver the last 5 years, **only one location was permanently closed** (back in 2021). Today, roughly 1/3 of all the locations are franchises.\n\nThe management expects a more capital-efficient market entry process that will begin to deliver a stronger new shop return after 2025. The different types of shops give the company greater flexibility to match the market needs in a certain area.\n\n\n\n  \n**3.0 The Potential Growth Drivers**\n\nThere are 3 ways the company’s topline will grow over time:\n\n**3.1 Number of locations**\n\nThe management’s long-term target **is 4,000+** locations (vs. 912 locations as of June 2024). At the current pace of \\~160/year, there are 2 decades of growth ahead.\n\nThis target represents roughly 10% of the total locations of Starbucks, which indicates:\n\n1. The management intends the company to remain focused on certain key markets.\n2. There are no plans for international expansion.\n\n***The number of new locations has been growing over time:***\n\n2018: **36 new locations**\n\n2019: **42**\n\n2020: **71**\n\n2021: **97**\n\n2022: **133**\n\n2023: **160**\n\nH1-2024: **81**\n\nThis means likely the target of 4,000+ locations will likely take 10-15 years to reach (instead of 20).\n\nIn my opinion, **Duch Bros isn’t the next Starbucks**, for the following reasons:\n\n1. Dutch Bros has a different business model leveraging drive-thrus.\n2. The management has no intention (currently) to grow to the size of Starbucks.\n\nOnce it reaches maturity, the excess cash flow generated will likely be used to buy back shares and/or dividends.\n\n**3.2 New product introduction**\n\nIn theory, introducing new products could lead to higher revenue per location. Based on the historical data, it is quite clear that this isn’t the case. The average revenue per location has been growing **more or less in line with inflation**. This means the sales coming from the new products introduced cannibalize the sales of the existing products.\n\n**3.3 Inflation**\n\nAlthough not in control of the company, inflation plays a role in its costs and will eventually be passed on to the consumers.\n\n  \nTherefore, for my estimate for the future revenue growth, I take into account the growth in the number of stores, and inflation.\n\n  \n**4.0 The Historical Financial Performance**\n\nLet’s take a look at the fun stuff. The revenue growth is definitely there, from $238m back in 2019 to $1.1b for the last twelve months (ending June 30th, 2024). However, the margins are a bit unstable.\n\nThere was a big drop due to Covid-19 when the demand was temporarily reduced. But the management cited two more reasons:\n\n1. Increase in rent; and\n\n2. Increase in direct costs (related to beverage, food, and packaging)\n\nSince 2022, the gross margin has been stable (\\~25%), but its operating margin has increased by 8%. The main reason behind it is - **Economies of scale**\n\nThe SG&A as % of revenue continues to decrease, leading to significant margin expansion. The management is targeting **30% Adjusted EBITDA**, which translates to **\\~18%** **operating margin**.\n\nFor comparison, this is slightly higher than the operating margin of Starbucks of 16%.\n\n\n\n**5.0 Valuation**\n\nBased on my assumptions, the fair value of the company is close to $5 billion (**$32/share**), not that far from today’s price ($29/share).\n\nThe revenue assumption has already been explained above. Based on my input, there will be a bit over 3,300 stores in 10 years. Combined with inflation, that leads to revenue increase of almost 400%.\n\nAs for the operating margin, I do think the management is overly optimistic, and the 18% operating margin is a stretch. For that reason, in my model, I’ve used **16% which is more in line with its mature competitors.**\n\n\n\nHere’s how the valuation (per share) changes if you have different assumptions than mine regarding the revenue growth & the operating margin:\n\n|Revenue / Operating margin|14%|16%|18%|CAGR (Revenue)|# of locations|\n|:-|:-|:-|:-|:-|:-|\n|342% ($5.0b)|$24,0|$29,0|$33,8|***16,0%***|***3,000***|\n|394% ($5.5b)|$26,7|$32,3|$37,6|***17,3%***|***3,352***|\n|416% ($5.8b)|$27,8|$33,7|$39,2|***17,8%***|***3,500***|\n\nAs I’m writing this, the share price is \\~$29, meaning **for Dutch Bros to be undervalued**, it needs to **increase the number of locations to at least 3,000** in the next decade and increase its **operating margin to at least 16%.**\n\nIf the management delivers the guided margin expansion to 18%, the fair value today is **over $35/share.**\n\nI hope you enjoyed this post, feel free to share your thoughts.\n\n",
  "link_flair_text": "Company Analysis",
  "id": "1es8snp",
  "num_comments": 51,
  "created_utc": 1723659410,
  "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/",
  "comments": [
    {
      "id": "li44b24",
      "score": 28,
      "body": "Thanks for that write up, as I have been trying get more familiar with this company",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li44b24/",
      "created": 1723660212,
      "depth": 0,
      "replies": [
        {
          "id": "li45p4b",
          "score": 13,
          "body": "It's my pleasure!",
          "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li45p4b/",
          "created": 1723660647,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li5cyu3",
      "score": 28,
      "body": "I wish we drank better coffee in this country, but I've watched my favorite local roasters go out of business one by one, while these chains grow steadily\n\nwe just don't have a cafe culture outside of big cities in the US, sadly. nobody has the hour to sit down and do nothing while they drink in a cafe and watch the world go by... everything is car-centric and go-go-go\n\nnice write-up!",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li5cyu3/",
      "created": 1723674677,
      "depth": 0,
      "replies": [
        {
          "id": "li8owus",
          "score": 5,
          "body": "The best coffee is in individual shop, not chains, in the US, and those unfortunately get gentrified out and replaced by Starbucks. Also, chains don't really want you to linger like that. While some occasionally have a non cozy arm chair, none really are set up to stay long term.  I'd happily camp out in one that was, but thr ones with comfy armchairs, coffee tables, and wall outlets get run out of business by landlords who can get rich selling so the can build another strip mall with a Panera, a Chipotle, and a Starbucks.",
          "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li8owus/",
          "created": 1723730530,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li5iqwo",
      "score": 10,
      "body": "Explain to me scale of economics for a company like this in a hyper competitive space, and a shrinking middle class and increasing wealth inequality? Personally, I may just open a short position on Dutch bros. They literally sell sugar water for the price of a Starbucks drink.\n\nAdditionally, we've seen many rapidly expanding restaurants come and go over the years. Just because it works in one market doesn't mean it does in another.",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li5iqwo/",
      "created": 1723676718,
      "depth": 0,
      "replies": [
        {
          "id": "li5jd62",
          "score": 7,
          "body": "Let me elaborate. If the number of locations doubles, the SG&A won't double. The company won't have 2x the employees, 2x CEOs, 2x CFOs, twice the number of marketing specialists, accountants, lawyers, etc.",
          "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li5jd62/",
          "created": 1723676937,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li6ykwj",
          "score": 3,
          "body": "I live pretty much where this company started and now you can't go more than a couple block without running into a copycat drive-thru barista kiosk with different branding. A couple of them are trying to remix more into limited-menu, single-bowl fast-food deals or something akin to a slightly more permanent food truck stand.",
          "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li6ykwj/",
          "created": 1723697648,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li6n3ax",
      "score": 6,
      "body": "A few popped up in my city. I tried their latte once, but it was inferior to Starbucks. I appreciate having another option, but I would only go there if Starbucks wasn’t available.\n\nAnecdotally, it never seems busy, but I assume they do 90% of their business during the morning commute when I’m not around.\n\nI could see them having modest growth, but they seem too niche to be the next Starbucks.",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li6n3ax/",
      "created": 1723692111,
      "depth": 0,
      "replies": [
        {
          "id": "lia5g3m",
          "score": 6,
          "body": "I have never been to a Dutch Bros where the line is not insanely long. Its ALWAYS busy (for me)",
          "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/lia5g3m/",
          "created": 1723747127,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li5zjy3",
      "score": 3,
      "body": "I’m long $BROS. Bought another 100 shares after the earnings drop",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li5zjy3/",
      "created": 1723682808,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li5zqdq",
      "score": 3,
      "body": "Overvalued in a hyper competitive industry and I don't see it's competitive advantage over other coffee chains.",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li5zqdq/",
      "created": 1723682875,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li4ao88",
      "score": 2,
      "body": "How do you derive your price target with these factors?",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li4ao88/",
      "created": 1723662198,
      "depth": 0,
      "replies": [
        {
          "id": "li4bofd",
          "score": 8,
          "body": "I don't think there's any point in deriving price targets. All I can do is compare the fair value based on my assumptions vs. the price today. What the market will do in the next months and even years can be irrational. However, I do think it is efficient in the long-run.",
          "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li4bofd/",
          "created": 1723662518,
          "depth": 1,
          "replies": [
            {
              "id": "li4dvlg",
              "score": 3,
              "body": "To be more clear, I mean how did you arrive at fair value?",
              "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li4dvlg/",
              "created": 1723663241,
              "depth": 2,
              "replies": [
                {
                  "id": "li4es0t",
                  "score": 5,
                  "body": "I use a DCF model.",
                  "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li4es0t/",
                  "created": 1723663545,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lil3zd6",
                      "score": 1,
                      "body": "What interest rate do you use to discount cash flows?",
                      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/lil3zd6/",
                      "created": 1723912751,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "limrtjf",
                          "score": 1,
                          "body": "The discount rate is around 10.5%",
                          "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/limrtjf/",
                          "created": 1723934165,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "li6i6fp",
      "score": 2,
      "body": "Their coffee is horrifying",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li6i6fp/",
      "created": 1723690019,
      "depth": 0,
      "replies": [
        {
          "id": "liaej2g",
          "score": 0,
          "body": "It is.  And the lack of drip coffee keeps me away.\n\nStill, I'm long the stock because they're addicting teens to sugar and caffeine *despite* having coffee that's horrifying.",
          "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/liaej2g/",
          "created": 1723750026,
          "depth": 1,
          "replies": [
            {
              "id": "liajdvs",
              "score": 0,
              "body": "wait they really don't just have \"coffee\"?",
              "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/liajdvs/",
              "created": 1723751587,
              "depth": 2,
              "replies": [
                {
                  "id": "liamfma",
                  "score": 1,
                  "body": "Nope.   If you want \"Black Coffee\" (all I drink) I believe they pour you an Americano instead.  They don't pour drip coffee like SBUX does.  No \"dark roast\" option, which is what I drink.  \n\nThey also will sell their own coffee beans on Amazon, but not at their stores.",
                  "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/liamfma/",
                  "created": 1723752551,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lib3q7f",
                      "score": 1,
                      "body": "wow, TIL. Thanks",
                      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/lib3q7f/",
                      "created": 1723758068,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lib72f2",
                          "score": 2,
                          "body": "Ha, no worries.  Again, I'm long BROS and a daily coffee drinker.  I'll buy a cup of McDonalds black coffee for half the price vs ordering \"coffee\" from BROS.  \n\nBut I'm not the target market for BROS.  They got their hooks into young folks who think nothing of spending $8 on an Iced Slammer Jammer Monster Smash Rammer 4x a week.",
                          "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/lib72f2/",
                          "created": 1723759182,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "li6kh6t",
      "score": 2,
      "body": "Bought some calls, feel like it is worth at least $35, $40 max.\n\nShould be room for Dunkin Donuts, Starbucks and BROS.",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li6kh6t/",
      "created": 1723690976,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li6xl2s",
      "score": 2,
      "body": "Oh, hey - Dutch Bros.! They started, like, a half hour from me here in Oregon back in 1992. When I was in high school, Dutch Bros. was, like, *the* sought-after part-time job for girls that were old enough. Also, you couldn't go 5 feet anywhere without tripping over a teenage girl drinking a Kahlua Kicker, and your way to the ground you'd probably hit another one.  \n  \nIt's been sort of a local \"I wish I'd gotten in on the ground floor\" sort of story for years and years, now.",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li6xl2s/",
      "created": 1723697127,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li5hvp2",
      "score": 3,
      "body": "Dutch Bros Coffee is much better than starbucks and you get alot more for price.",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li5hvp2/",
      "created": 1723676414,
      "depth": 0,
      "replies": [
        {
          "id": "li6iieg",
          "score": 4,
          "body": "Colored sugar water.",
          "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li6iieg/",
          "created": 1723690154,
          "depth": 1,
          "replies": [
            {
              "id": "li6wju9",
              "score": 1,
              "body": "They're really a milk company. Made by dairy farmers to sell excess stock",
              "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li6wju9/",
              "created": 1723696586,
              "depth": 2,
              "replies": []
            },
            {
              "id": "li7wyhn",
              "score": 0,
              "body": "K",
              "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li7wyhn/",
              "created": 1723718879,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "li93ar8",
          "score": 1,
          "body": "I think it is just a different version of lousy. Tastes are different and Starbucks is huge without even selling donuts so in some sense what people think of the coffee is irrelevant. Personally I only ever have gone to the Dutch Bros to be entertained by the over the top positivity banter, do they still do that?",
          "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li93ar8/",
          "created": 1723735175,
          "depth": 1,
          "replies": [
            {
              "id": "li96b0i",
              "score": 2,
              "body": "not really lol. I just get my sugar water and go hahs.\n\nIm not a coffee fanatic so it taste good to me.\n\nOut of starbucks , scooters and seven brew. Dutch Bros is by far the best",
              "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li96b0i/",
              "created": 1723736114,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "li62rgw",
      "score": 1,
      "body": "P/E is almost 5x SBUX.",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li62rgw/",
      "created": 1723684011,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li6lb2g",
      "score": 1,
      "body": "How is their product quality? I don’t have any locations within 3 hours of me ",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li6lb2g/",
      "created": 1723691337,
      "depth": 0,
      "replies": [
        {
          "id": "lia9ujb",
          "score": 1,
          "body": "They sell Liquid Sugar. Quality is not part of the equation.",
          "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/lia9ujb/",
          "created": 1723748510,
          "depth": 1,
          "replies": [
            {
              "id": "liav2ir",
              "score": 2,
              "body": "So a Starbucks clone ",
              "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/liav2ir/",
              "created": 1723755266,
              "depth": 2,
              "replies": [
                {
                  "id": "liccwbr",
                  "score": 2,
                  "body": "Yeah. Except without all the advantages that Starbucks has as a business model. Like location advantage, economies of scale, brand equity, efficiency advantage, App advantage, licensing advantage, etc. BROS one advantage is that it is not Starbucks. Which it competes with Dunkin, Mcdonald's, and any other regional or local coffee shop with. One perceived advantage by people on here is that they sell their coffee for cheaper, also known by investors as smaller margins. That is not a good thing. \n\nIt doesn't mean Bros can't be profitable. But to think they are the next Starbucks is insanity.",
                  "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/liccwbr/",
                  "created": 1723774611,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "li6z2rm",
      "score": 1,
      "body": "What do you do about their atrocious price to earnings?",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li6z2rm/",
      "created": 1723697914,
      "depth": 0,
      "replies": [
        {
          "id": "li7agji",
          "score": 2,
          "body": "The P/E is a terrible ratio to look at in isolation. Especially for a growing company, that is in the process of expanding margins.",
          "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li7agji/",
          "created": 1723704567,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li806dj",
      "score": 1,
      "body": "I’m sure they have room to grow, but I personally have a hard time putting money into a glorified sugar water company.",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li806dj/",
      "created": 1723720542,
      "depth": 0,
      "replies": [
        {
          "id": "li93rei",
          "score": 1,
          "body": "Come on, its basically Coca-Cola in 1919.\n\n(I got banned from r/Portland for touting as my sarcasm wasn't clear enough)",
          "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li93rei/",
          "created": 1723735318,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li8h50e",
      "score": 1,
      "body": "Its coffee next",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li8h50e/",
      "created": 1723727763,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li8vm65",
      "score": 1,
      "body": "skip for now",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li8vm65/",
      "created": 1723732737,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li9ah7o",
      "score": 1,
      "body": "Are the stores corporate owned or franchise?",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li9ah7o/",
      "created": 1723737426,
      "depth": 0,
      "replies": [
        {
          "id": "li9tari",
          "score": 2,
          "body": "2/3 company owned, 1/3 franchised.",
          "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li9tari/",
          "created": 1723743323,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "liron7k",
      "score": 1,
      "body": "That P/E ratio though would require major expansion to justify the current sp",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/liron7k/",
      "created": 1724012196,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj6ai8h",
      "score": 1,
      "body": "Starbucks is THE coffee brand.  I'm sticking with it.",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/lj6ai8h/",
      "created": 1724224857,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li96zru",
      "score": 1,
      "body": "Here is my write up: Every single time I go there is a gigantic line, the employees are always happy and the drinks are delicious (if completely terrible for you).\n\nIt is an amazing product and will absolutely explode when expanded to east coast markets.",
      "permalink": "/r/stocks/comments/1es8snp/deep_dive_into_dutch_bros_bros/li96zru/",
      "created": 1723736326,
      "depth": 0,
      "replies": []
    }
  ]
}