{
  "title": "Unfounded recession worries with soft landing firmly in place.",
  "score": 301,
  "selftext": "Two new economic data showed recession worries are overblown:\n\n1. Retail sales rose 1% in July, above the expected 0.4%.\n2. Filings for unemployment insurance fell more than expected last week with 227,000 (vs, 235,000 expected) initial jobless claims filed in the week ending August 10th, down from 234,000 the week prior.\n\n* \"There was almost nothing in the July retail sales report for the perma-bears to latch on to, with the rebound in retail sales led by a recovery in vehicle sales, but encouragingly broad-based with control group sales rising even further,\" the team at Capital Economics wrote.\n* \"All of a sudden, things have come together,\" BMO Wealth Management US chief investment officer Yung-Yu Ma stated,  \"And what seems like almost a Goldilocks scenario for the data is a tremendous shift from what we had a week or so ago when we had the market sell-off.\"\n* The chief investment officer added, \"We think the soft landing is firmly in place.\"\n\n[https://finance.yahoo.com/news/latest-economic-data-cools-recession-worries-141217185.html](https://finance.yahoo.com/news/latest-economic-data-cools-recession-worries-141217185.html)",
  "link_flair_text": "Industry Discussion",
  "id": "1esxoqc",
  "num_comments": 161,
  "created_utc": 1723734704,
  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/",
  "comments": [
    {
      "id": "li99206",
      "score": 386,
      "body": "Anyone can cherry pick data on a weekly basis to confirm their opinion is right, but only time will tell",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li99206/",
      "created": 1723736976,
      "depth": 0,
      "replies": [
        {
          "id": "li9nobe",
          "score": 118,
          "body": "Every week on this sub, either the markets are down and the recession doomers are voted to the top or the markets are up and the soft landing folks are. The opinions of this sub changes with the winds.\n\nBest is to just sit back and continue to DCA.",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9nobe/",
          "created": 1723741575,
          "depth": 1,
          "replies": [
            {
              "id": "libctpx",
              "score": 5,
              "body": "DCA gods, to valhalla and beyond",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/libctpx/",
              "created": 1723761187,
              "depth": 2,
              "replies": []
            },
            {
              "id": "liacqxo",
              "score": 6,
              "body": "I still think a more significant market correction is coming in the next few months but I'm still investing like hell. Plus, the volatility of the market is making me insane gains. ",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liacqxo/",
              "created": 1723749444,
              "depth": 2,
              "replies": [
                {
                  "id": "lij4t4t",
                  "score": 1,
                  "body": "Depends on who is leading  in the polls. ",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lij4t4t/",
                  "created": 1723878023,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lia7231",
          "score": 16,
          "body": "Didn’t this entire sub cherry pick one single jobs report?",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lia7231/",
          "created": 1723747635,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li9mq9w",
          "score": 38,
          "body": "Jpow proved his worth\n\nWhat he and his team managed to do has actually been very impressive - we went through some really really crazy times  during and post covid that most people have actually forgotten. \n\nIts never technically over( the inflation battle) but its def stabilized a lot- and that soft landing is going to happen\n\nHats off to the Pow!",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9mq9w/",
          "created": 1723741274,
          "depth": 1,
          "replies": [
            {
              "id": "lia5ret",
              "score": 34,
              "body": "You're congratulating the pilot while you're still at 5,000 ft. Wait until the plane has landed.",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lia5ret/",
              "created": 1723747226,
              "depth": 2,
              "replies": [
                {
                  "id": "liaiyc8",
                  "score": 13,
                  "body": "There never going to be ‘landing’ is the point. \n\nIf inflation goes below the target- its already too late. \n\nAlso i am one of bandwagon of the 2% number is basically BS at this point and the 2% number - if needed is going to take a very very slow landing ‘approach’  while playing with the controls and flaps - which may take a 10k landing strip( aka multiple months if not years)- while attempting to land in stormy weather. \n\nPeople need to realize that life is never going to be same before 2020 and pivot expectations as well.",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liaiyc8/",
                  "created": 1723751450,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "liet5va",
                      "score": 5,
                      "body": "....he said confidently, backing up his prediction with absolutely no semblance of a rational argument other than \"but this time it's different!!!!\"",
                      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liet5va/",
                      "created": 1723818505,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "licmkdf",
                      "score": 1,
                      "body": "Hopefully if they’ve taken anything away from this it’s that we never can shut the world down again. Barring a disease that will literally wipe humanity out, we just have to ride it out and this is coming form a burnt out ICU nurse who worked through COVID watching 10 people die a week during delta.",
                      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/licmkdf/",
                      "created": 1723778651,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "liectju",
                          "score": 8,
                          "body": ">**we** never can shut the world down again\n\nI think that \"we\" is the operative word because the shutdowns were not at all coordinated nor were they unified, which exacerbated the impact. Each state, country, industry, citizen reacted differently and it was a total shit show. If \"we\" had a more coordinated and proactive plan it would have been much less impactful economically. It was really fortunate that the disease was not worse and more transmutable and deadly or we would have been absolutely fucked.",
                          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liectju/",
                          "created": 1723812711,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "licpug7",
                          "score": 9,
                          "body": "> we never can shut the world down again\n\n...why?",
                          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/licpug7/",
                          "created": 1723780125,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "licvvq2",
                              "score": -8,
                              "body": "Because that is what landed us in this situation to begin with. At a certain point you have to put the continuity of the world over people dying, it sucks but it’s the truth. The reality is that COVID wouldn’t have really killed a ton more people in my opinion, all the people that died from it were going to die regardless of the interventions. Rounding the curve or whatever did help the hospitals but from my experience the shit was packed to the brim anyways with people dying because we were out of ventilators. The only thing it truly did in the end was send us into an economic shitstorm that we are now paying the price for in increased costs globally.",
                              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/licvvq2/",
                              "created": 1723783021,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lidw76j",
                                  "score": 6,
                                  "body": "Shutting down the world wasn’t the problem. It was a mixed bag of many different things to try to keep the global economy staying how it was plus previous policies that caused a perfect shitstorm",
                                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lidw76j/",
                                  "created": 1723805217,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lie6mtg",
                                      "score": 2,
                                      "body": "Imagine thinking shutting down the vast majority of transport and trade worldwide isn’t the reason we’re in this mess. If we didn’t inflate the dollar we would’ve been in a depression.",
                                      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lie6mtg/",
                                      "created": 1723810175,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "lie7jye",
                                          "score": 2,
                                          "body": "It's a scary situation but we're definitely still standing; we're actually doing pretty well if you look at the stock market since 2020.  Just goes to show you what's possible in the modern era.  If Jpow can pull off a feat like this, imagine what else is possible.",
                                          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lie7jye/",
                                          "created": 1723810568,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "liesayg",
                                  "score": 2,
                                  "body": "My friend was a covid nurse during the peak of it and she still has PTSD. She wakes up in a sweat having dreams of people screaming at her because they're dying and she can't save them. \n\nImagine thinking one year of inflation is worse.\n\n> At a certain point you have to put the continuity of the world over people dying\n\nObviously in times of mass death most people would just go to work, right? Gotta keep the world turning and profits coming in! \n\nThat's how we all felt over covid ya? Can't wait to get back to the office?",
                                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liesayg/",
                                  "created": 1723818223,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "liesxts",
                  "score": 1,
                  "body": "idk it's been 4.5 years since March 2020\n\nI'd say that the plane has probably landed",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liesxts/",
                  "created": 1723818430,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "liaqlmi",
                  "score": 1,
                  "body": "But wait there is more to this Farside story: “Fifi seized the controls and saved the day”.",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liaqlmi/",
                  "created": 1723753872,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "liaf78r",
              "score": 9,
              "body": "Seems like you’ve actually, selectively forgotten his “Inflation is transitory” BS.\n\nIt’s like someone setting fire to a building and then getting praised for putting out said fire.",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liaf78r/",
              "created": 1723750244,
              "depth": 2,
              "replies": []
            },
            {
              "id": "li9wd0b",
              "score": 9,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9wd0b/",
              "created": 1723744275,
              "depth": 2,
              "replies": [
                {
                  "id": "libhtwj",
                  "score": 4,
                  "body": "Yeah I’m waiting one of two things to happen. The yield curve to no longer be inverted or if unemployment rises above 5%. Once we cross those thresholds we’ll know if we are in a recession or not.",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/libhtwj/",
                  "created": 1723762951,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "li9sb2c",
              "score": 20,
              "body": "He really did increase the money supply, like Bernanke, Greenspan, and Volcker before him.  \n\n\nHats off to salary debasement to entrench asset prices and equity values.  They really were successful at making cash a negative yielding liability, that encouraged people borrow money to increase the velocity of money to create the asset bubbles we call economic growth.",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9sb2c/",
              "created": 1723743016,
              "depth": 2,
              "replies": [
                {
                  "id": "liah6fw",
                  "score": 18,
                  "body": "Hats off to completely and totally discounting the actual real life implications of a global pandemic to be glib.\n\nIn the span of about a month a huge chunk of the workforce found themselves jobless, some temporarily, some for longer, and many without a clue for how long.\nBecause the resulting recession (and it was a recession by the definition) was short lived, people like to pretend it wasn't made shorter and less harsh by monetary policy. And since rates were too low pre-pandemic (no political will to raise them and suffer any little downturn - look at 2018-2019), all that was left in the Fed's tool belt was increasing the balance sheet to increase money supply. \nPlus, the resulting inflationary period was exacerbated by pandemic effects as well. Supply chain issues were a real thing, with lingering production stops during local outbreaks and difficulty obtaining materials from overseas, etc.\n\nI'm not saying you're wrong, because you are not, but it is convenient to ignore the conditions unrelated to the Fed that added to the positive feedback loop of currency devaluation",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liah6fw/",
                  "created": 1723750884,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "liaifsl",
                      "score": -4,
                      "body": "I'd be fine if we had a running tally of 2% inflation, an average.  So if a pandemic created 8% inflation we would do -6% the next year.  But it always errs on the side of more inflation.",
                      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liaifsl/",
                      "created": 1723751287,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "liexcd1",
                          "score": 1,
                          "body": "Average inflation over the past hundred years has been more like 3%, and that's about where we are now.  I don't see the problem here.",
                          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liexcd1/",
                          "created": 1723819858,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lifg7fn",
                              "score": 3,
                              "body": "The problem is what inflation is.  Its some ever changing basket of goods that excludes asset prices, as food gets worse quality and the median home value to income ratio keeps growing.  What has M2 grown at versus inflation, and how does that reflect in asset values?\n\n\nWhat seems to me to be happening is the farther you get from the gold standard the more debt you need to take on for basic life.  I guess the question is whether a low cost of capital, being funneled into a finite asset that the CPI doesn't capture, is considered a good thing.  Also it seems people are eating less healthy, as meat prices rise faster than processed food, and dollar stores with dried food grow more and more prominent.  Is this the main cause of the obesity epidemic, as people give up meats for carbs?",
                              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lifg7fn/",
                              "created": 1723825810,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lia4xch",
                  "score": 4,
                  "body": "Thank you for saying that. It's almost as if redditors can't comprehend how currency actually works.\n\nAll hail saint powell, ye who screwed us up with inflation and then unscrewed us (partially), what a genius and all that...",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lia4xch/",
                  "created": 1723746964,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "liat3re",
                      "score": 2,
                      "body": "They called it \"not QE\", its so fantastical a misdirection that I can understand it fooling people.",
                      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liat3re/",
                      "created": 1723754653,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lib7lay",
                      "score": 3,
                      "body": ">\tThank you for saying that. It’s almost as if redditors can’t comprehend how currency actually works.\n\n95% of people don’t have a fucking clue how currency works",
                      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lib7lay/",
                      "created": 1723759360,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "libqg37",
                          "score": 0,
                          "body": "The measuring stick of the currency is the CPI, which changes regularly on the subjective whims of an unaudited group of bureaucrats we are promised are non-political, who were also found to be insider trading.",
                          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/libqg37/",
                          "created": 1723766053,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lianrnj",
                      "score": 4,
                      "body": "Yes, Powell was to blame for inflation, when the rest of the world had same or worse inflation in the same period. Powell- Chair of the Global Reserve",
                      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lianrnj/",
                      "created": 1723752985,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "liaq9d7",
                          "score": 0,
                          "body": "Not sure if you're trying to be sarcastic but that is exactly his role. The US is the world reserve currency. Jpow printing half of all the currency currently in existence is exactly why the entire world is facing inflation...",
                          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liaq9d7/",
                          "created": 1723753766,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "liavxlb",
                              "score": 4,
                              "body": "> Jpow printing half of all the currency currently in existence is exactly why the entire world is facing inflation...\n\nDid you just pull this stat out of your ass?\n\nETA: since PP is not going to answer. The actual number is less than 5%. When comparing only the four largest central banks, The US injected 5 trillion against the total of ~86 trillion dollars of M2 money supply.",
                              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liavxlb/",
                              "created": 1723755535,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lieoz3v",
                                  "score": 1,
                                  "body": "Sorry I don't live on reddit...\n\nhttps://fred.stlouisfed.org/series/M1SL\n\nEdit: I think what may be confusing you is my use of the word currency in my previous post. I should have specified USD.",
                                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lieoz3v/",
                                  "created": 1723817107,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lieu3bz",
                                      "score": 1,
                                      "body": "You really shouldn't use M1 to make this point - the reporting changes that happened in 2020 make the spike look much more substantial than it was (it was still substantial, but nothing like what the chart presents). M2 is a better representation if you want to isolate for stimulus during covid.",
                                      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lieu3bz/",
                                      "created": 1723818810,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "liaz20v",
                          "score": -4,
                          "body": "Oh buddy. This old tired argument. Tell me that you didn't follow news in 2020-2022 cycle without telling me you didn't watch news in 2020-2022 cycle.\n\nAt the beginning, trump gov & FED, in cooperation with equally dumb EU gov & ECB, decided to push oversized stimulus during early covid scare. Huge money print, but it did not budge inflation too much because the covid disruptions were real at the time.\n\nThe real sin happened in 2021 when biden gov started, pushing his nonsensical trillion BBB package while covid disruptions disappeared, with Powell doing NOTHING for a whole year, sitting on his ass watching everything bubble form. ECB did roughly same, idiots that they are for coordinating policies with FED.\n\nWhatever rest of the world did, doesn't matter. FED + ECB account for about 75% of tradeable volume, so the rest followed. It wasn't that \"FED experienced same inflation as rest of the world\". It's really \"FED and ECB exported inflation to the rest of the world\".\n\nBut to be fair, okay - I blame Powell and Lagarde equally for this whole inflation robbery fuckup.",
                          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liaz20v/",
                          "created": 1723756538,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "libs7kk",
                              "score": 8,
                              "body": "Blah blah blah ... Trump masterful on economy, Biden bad. Tell me you are glued to Fox News without telling me you're glued to Fox News",
                              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/libs7kk/",
                              "created": 1723766707,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "libxgml",
                                  "score": -9,
                                  "body": "Not my fault if you're mad at facts. Trump was better on economy than biden. It's actually what each and every US poll shows for quite some time. Do you think they all watch fox too?",
                                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/libxgml/",
                                  "created": 1723768648,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lic8ggl",
                                      "score": 5,
                                      "body": "I thought you guys thought polls were fake. That's what Dear Leader says, right?",
                                      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lic8ggl/",
                                      "created": 1723772857,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "lidwnwv",
                              "score": 3,
                              "body": "Being a liberal, I actually agree with your take. However, let’s not forget Trump’s TCJA package was completely unnecessary and it played a role in the US inflation problem",
                              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lidwnwv/",
                              "created": 1723805464,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lifn7pd",
                                  "score": 1,
                                  "body": "I would be lying if I'd say I'm not equally worried about trump presidency as I am about kamala presidency.\n\nBut, dems were *supposed* to be the adults in the room. What is happening?",
                                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lifn7pd/",
                                  "created": 1723828002,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "liafufg",
                  "score": 0,
                  "body": "So when interest rates are low, it encourages people to borrow money?  And when interest rates are high, it... encourages people to borrow money?",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liafufg/",
                  "created": 1723750454,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "liarmld",
                      "score": 0,
                      "body": "Well logically given cash is a negative yielding asset yes it does.  Which is why the rich tend to have negative balances of cash while the poor have positive balances.",
                      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liarmld/",
                      "created": 1723754193,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "liesq60",
              "score": 1,
              "body": "Yeah but then who am I going to use as a strawman for my shitty stock picking ability?!\n\nSure as fuck isn't going to be me \n\n*[chortles heartily]*",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liesq60/",
              "created": 1723818361,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "liaegba",
          "score": 4,
          "body": "Does time ever tell? I feel like time only leads to more \"It's coming next year!\"",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liaegba/",
          "created": 1723750001,
          "depth": 1,
          "replies": []
        },
        {
          "id": "licxjps",
          "score": 1,
          "body": "Whatever Reddit thinks is going to happen, the opposite will actually happen.\n\nKramer Rule.",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/licxjps/",
          "created": 1723783870,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lialtli",
          "score": 1,
          "body": "Exactly with all these job layoff announcements everyday, something does not sit well.",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lialtli/",
          "created": 1723752356,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li9rjkp",
          "score": 0,
          "body": "So calls or puts?",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9rjkp/",
          "created": 1723742782,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li9misl",
      "score": 69,
      "body": "Uh oh soft landing mentioned. Time to sell everything",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9misl/",
      "created": 1723741209,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li9dpc6",
      "score": 93,
      "body": "10 days ago this sub and every economy/stock/finance related sub was calling for a recession greater than the dot com bubble and 2008 recession combined. Like it was a full blown conclusion to most of the people commenting.\n\nJust goes to show, don’t listen to people on Reddit because they don’t know any more than anyone else, and especially don’t listen to people who are convinced they know what the future holds.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9dpc6/",
      "created": 1723738454,
      "depth": 0,
      "replies": [
        {
          "id": "li9ohsr",
          "score": 11,
          "body": "These things don't start on reddit. They were in the news first.",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9ohsr/",
          "created": 1723741832,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li9e3s7",
          "score": 30,
          "body": "Reddit is mostly bots and NPCs that are essentially human bots.",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9e3s7/",
          "created": 1723738581,
          "depth": 1,
          "replies": [
            {
              "id": "li9f8ff",
              "score": 20,
              "body": "Nah, it's just the internet amplifies alarmist and extreme views no matter how credible or rational they are. Mostly because engagement is the number 1 metric. \n\nThis has been seeped heavily into politics and the mass media so every week the sky is falling.",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9f8ff/",
              "created": 1723738933,
              "depth": 2,
              "replies": []
            },
            {
              "id": "li9ws4q",
              "score": 1,
              "body": "If I had an emotional core capable of it I think I would take offense at your comment.",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9ws4q/",
              "created": 1723744405,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "li9l51m",
          "score": 4,
          "body": "I laugh thinking about all the posts of people talking how they pulled their money and put 80 percent on the sidelines and they've already missed the almost instant recovery. Thinking they are genius they are actually idiots lmao. Way too scared to be allowed to touch any stocks they've purchased. ",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9l51m/",
          "created": 1723740780,
          "depth": 1,
          "replies": [
            {
              "id": "lib8qlt",
              "score": -6,
              "body": "[deleted]",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lib8qlt/",
              "created": 1723759757,
              "depth": 2,
              "replies": [
                {
                  "id": "lidgzou",
                  "score": 3,
                  "body": "Most redditors shouldn't own stock because their portfolios are tiny, and it makes no sense from a risk/diversification perspective. So etfs are the right choice. The number of idiots on here who have sub $5k invested and hold over a dozen individual company stocks in their portfolio is absurd. \n\nAlso. Even high net wealth folks =/= they know how to pick a stock; and often they are also better off just buying the ETF.",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lidgzou/",
                  "created": 1723795566,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lidjda0",
                      "score": 0,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lidjda0/",
                      "created": 1723797150,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lidmqoh",
                          "score": 1,
                          "body": "I mean... we're talking about fees of like $300 a year on a $1MM portfolio here, right?",
                          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lidmqoh/",
                          "created": 1723799388,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lid68q2",
                  "score": 1,
                  "body": "I'll bite - how does one \"own\" a stock?",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lid68q2/",
                  "created": 1723788690,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lid8jbk",
                  "score": 1,
                  "body": "So you don't own stocks if you buy VOO or VTI? Like, what?",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lid8jbk/",
                  "created": 1723790091,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lidk1o9",
                      "score": -2,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lidk1o9/",
                      "created": 1723797603,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lih355u",
                          "score": 2,
                          "body": "Because my time is better spent elsewhere than micromanaging an asset allocation ratio for hundreds of stocks. An expense ratio of 0.03% is negligible for the service they provide.  \nNever heard of Bogleheads mass panicking, and certainly not anymore than the average stock picker.",
                          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lih355u/",
                          "created": 1723844845,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "liiw42w",
                  "score": 1,
                  "body": "Don't know why you got downvoted, that's just the cold, hard truth lol. Barely any difference between this sub and r/boggleheads and r/ETFs nowadays.",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liiw42w/",
                  "created": 1723872656,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "li9up8j",
          "score": 1,
          "body": "\"Blood in the streets Monday. What is your play to capitalize on the massacre?\"",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9up8j/",
          "created": 1723743761,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lif15hu",
          "score": 1,
          "body": "Stock market isn’t the economy",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lif15hu/",
          "created": 1723821065,
          "depth": 1,
          "replies": [
            {
              "id": "ligxs1a",
              "score": 1,
              "body": "And the economy is objectively doing fine by all available metrics.",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/ligxs1a/",
              "created": 1723842987,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "liac8td",
          "score": 0,
          "body": "Why do I have a feeling even this comment might backfire",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liac8td/",
          "created": 1723749281,
          "depth": 1,
          "replies": []
        },
        {
          "id": "li9g5wz",
          "score": -15,
          "body": "Wait! You're telling me I shouldn't have listened to all the COVID medical Vax advice all through 2021-22 and the mainstream political subs? I thought reddit was a reflection of true daily life!! /s",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9g5wz/",
          "created": 1723739224,
          "depth": 1,
          "replies": [
            {
              "id": "li9hbq9",
              "score": 4,
              "body": "Wat",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9hbq9/",
              "created": 1723739588,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "liajrce",
      "score": 23,
      "body": "my friends who lost their jobs in layoffs have not been able to find new jobs for months\n\npart of that may be due to HR filters and AI, and their resumes not being optimized to pass them, but a big part is the climate\n\nI work for a tech startup that sells software to big companies, and can feel a big difference in the attitudes of those companies as well\n\nthere's a lot more to a forecast than numbers. I have no idea what will happen, just saying, I don't think any of us truly do.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liajrce/",
      "created": 1723751705,
      "depth": 0,
      "replies": [
        {
          "id": "lib9cve",
          "score": 6,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lib9cve/",
          "created": 1723759970,
          "depth": 1,
          "replies": [
            {
              "id": "liceqs8",
              "score": 2,
              "body": "> Many smart people are foreseeing this as the era of very concentrated economic gains.\n\nWhere can I read more on that?",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liceqs8/",
              "created": 1723775352,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lig2agg",
              "score": 2,
              "body": "Yeah, I work in DevOps Security and it's been a super weird time\n\nI work for a software company that makes security products for cloud (we do sell a SaaS version of it, too haha), so my skill set is more hands-on DevOps engineering than running security reports \n\nI used to get calls 2-3x a week for job interviews, in security and just in DevOps. now I barely get one a quarter. the market has changed SIGNIFICANTLY, for sure \n\nmy friends are not in advanced positions, they're mostly going for $50-60k a year stuff, which might also be part of the problem. many companies, in tech at least, have laid off all the low-earning teams, which makes it hard to get in the door (and \\*stay\\* in)\n\nreally hoping things improve and the economy finds a balance soon!",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lig2agg/",
              "created": 1723832767,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "li95bw2",
      "score": 60,
      "body": "Wait you mean the media have overblown the situation??",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li95bw2/",
      "created": 1723735809,
      "depth": 0,
      "replies": [
        {
          "id": "li9lix6",
          "score": 23,
          "body": "What happened to guy who came on CNBC claiming sky is falling and Fed needs to do emergency 50 bps rate cut ASAP.",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9lix6/",
          "created": 1723740900,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lia3ij6",
          "score": 8,
          "body": "I mean most consumer staples reported in their 10Q that they saw a slowdown in consumer demand",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lia3ij6/",
          "created": 1723746513,
          "depth": 1,
          "replies": [
            {
              "id": "lidwzjv",
              "score": 2,
              "body": "Just sharing some thoughts that have crossed my mind:\n\nBelieve Walmart actually is predicting a better rest if the year. People are digesting that as good news; however, to me I have had the thoughts maybe it’s because of a slowdown that people would be spending less money on luxury goods, restaurants, etc.",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lidwzjv/",
              "created": 1723805631,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "li989jd",
          "score": 27,
          "body": "The whole point of the media is to scare retail into selling low so institutes can scoop things up for cheap.",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li989jd/",
          "created": 1723736720,
          "depth": 1,
          "replies": [
            {
              "id": "li9dwzf",
              "score": 25,
              "body": "False, they also pump stocks while they're high just before they crater.",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9dwzf/",
              "created": 1723738521,
              "depth": 2,
              "replies": [
                {
                  "id": "li9h2um",
                  "score": 6,
                  "body": "Buy high, sell low. The winning retail strategy. I feel like the only institutional buyer who hasnt figured out to not do this is the queen herself Cathie wood",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9h2um/",
                  "created": 1723739510,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "li9dstb",
              "score": 4,
              "body": "Its retail who is dumb",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9dstb/",
              "created": 1723738484,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lia9dyz",
      "score": 26,
      "body": "I think people should go back to the discussions about a rolling recession. That is what has happened. We have significant parts of the economy that are doing fine and other parts that are not. Its been that way since the pandemic in particular.\n\nInstead of thinking about recession or not a better way would be to think about what works for the new normal post pandemic and what doesnt. Then think about are those things priced for those outcomes. Office buildings are in serious trouble. Restaurant locations that depended upon the office crowd for business are in trouble. Retail that depended upon commuters heavily are in trouble. Services in the vicinity of homes are doing ok to great. All of that has to shake out and stabilize. When it does we will go up from there. Until then expect parts of the market to leg down further, some parts to tread water, and for parts that are doing fine to leg up rapidly when concerns about them are resolved. \n\nIf you are in a part of the economy that is treading water it likely feels like a recession. If you are in a part of the economy that is struggling from the changes in the new normal you probably feel like its about to be a depression. \n\nThen there is the rates. Until rates come down materially dont expect people to be buying things that are typically financed. That means, homes, cars, large appliances, many home upgrades, campers/rvs/boats are all under pressure with the exception of some luxury parts of those markets. \n\nIf that is all too much for you, just think about it like this. The economy shifted in a dramatic way because of the pandemic and the new normal post pandemic is significantly different from the pre pandemic for a substantial part of the economy. The pricing for assets does not accurately reflect all of that yet so expect things to be in flux for a few more years. I figure it would take 5 years from the height of the pandemic before we settle into the new normal more or less. \n\n  \nNow if you disagree with that view thats fine, but please think about it and why you think it isnt valid enough. If you haven't thought about it like this before mull over it for a few days and see if it makes sense to you. If you can think of holes to poke into it feel free to comment with them.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lia9dyz/",
      "created": 1723748364,
      "depth": 0,
      "replies": [
        {
          "id": "liaweq4",
          "score": 5,
          "body": "I think one key factor is that the economy is great from Corporate America's perspective:\n\n* They keep charging high prices due to \"inflation\" even though their costs have gone down.\n* Employee costs will gradually go down as more automation and AI make smaller workforce more efficient.\n\nSo while the big companies are doing fine, the consumers/employees are feeling poor.\n\nUltimately that is not a Fed problem. That is a political problem. The People have to decide how to equitably divide up spoils of technological advancement -- should it keep flowing to billionaires?",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liaweq4/",
          "created": 1723755684,
          "depth": 1,
          "replies": [
            {
              "id": "lib3t87",
              "score": 4,
              "body": "good points. \n\nOne thing that is interesting is to look at how the plague played out for serfs in Europe. Basic data suggests strongly that for the survivors it actually turned into a boom time. Serfs were able to demand much more for their labor and were able in many cases to vastly improve their quality of life. Its not 100% correlated, but its probably the closest historical reference to what has happened. We had a lot of people die, but nowhere near those numbers.\n\nA big thing that happened then was that the powers that be tried a bunch of things to counteract that but for the most part it didnt work out for them. Inflation appears to have been high and I'm sure it was a terrible time, but in the end the average person who survived likely had a better share of the fruits of the labor. We are experiencing a similar event but so far the average people are falling into two camps. The ones who are getting ahead and the ones who are falling even further behind. Its likely that the ones falling behind wont catch up in large part because the ones getting ahead are not united with them against the folks at the top of the heap. Im not saying how it should play out just that so far it looks like this time around the have not crowd is once again getting the short end of the stick. \n\nOn the other hand when I was a kid I never imagined walking around with several hundred dollars of fragile tech in my pocket, but that is the norm now. We all have smart phones. That one single thing doesnt seem like a big deal, but it is. We are all paying for it of course in some manner, but it is there. Can you imagine someone from the 1950s popping up and seeing us all having smart phones? How would they react? So in that sense we definitely have an improvement to our quality of life in at least that aspect. We have other issues that are negatives, but on the whole I think we are all richer, but some people are much much richer. Where things have gone off the rail is that we have a major issue with homelessness, mental illness, and drugs. Id rather see that fixed than deal with the issue of the super rich.",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lib3t87/",
              "created": 1723758095,
              "depth": 2,
              "replies": [
                {
                  "id": "licjt5o",
                  "score": 3,
                  "body": "That's very interesting. If you enjoy thinking about the economic dynamics of the plague, you might enjoy the Kingsbridge series by Ken Follett. It's a mesmerizing historical fiction that shows how the plague actually created social mobility and entrepreneurship.\n\n>we are all richer, but some people are much much richer. \n\nYeah I think overall all our QOL has improved. But I guess sometimes people like to measure the differences instead of how much their basic necessities are met.",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/licjt5o/",
                  "created": 1723777462,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "licoy5n",
                      "score": 2,
                      "body": "I will add that to my reading list",
                      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/licoy5n/",
                      "created": 1723779716,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "libdbta",
              "score": 3,
              "body": "Outside of America things are looking different, [some countries](https://nos.nl/artikel/2532328-nederlanders-minder-productief-efficienter-werken-steeds-moeilijker) \n according to some statistics already having hit \"maximum efficiency\" or being damn near close to it. This would either require significant technological advancements, or significant changes in the market.  \n  \nAt that point things become difficult because our economies are basically built for infinite growth. When the line stops going up, is when trouble is around.  \n  \nSome companies are seeing those effects, as they can't increase output without also increasing input; all of this while margin is somewhat stagnant and main costs are wage costs.  \n  \nASML and Airbus are some examples of this, they can't get the numbers up, because they lack facilities and personnel around those facilities. Centralizing things leads to housing around your factory becoming more expensive, which leads to higher wage demands. Both wage and margin spirals are bad, and I honestly think some companies overdid it on the \"grabflation\" or simply making service worse.",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/libdbta/",
              "created": 1723761362,
              "depth": 2,
              "replies": [
                {
                  "id": "libz8oo",
                  "score": 2,
                  "body": "fair points. One major factor in economic growth is people. If your population shrinks its really hard to have real economic growth. You can hide that with inflation, but at the end of the day people and what they do is really the economy. \n\nEurope, Japan, China, and the US are all looking at serious demographic issues to various degrees. It boggles my mind that people are against immigration with the act of more people being in your economy will likely be more beneficial than not. There are diminishing returns of course, but it still more people with more supply and demand of labor. \n\nI dont think our economies are built for infinite growth. I think our expectations for the economy are for infinite growth and we get that growth through increasing efficiency, increasing population, or inflation. We dont want much inflation but we want some. We want increased efficiency but not so much that its too disruptive to society. We want population increases, but at a rate that doesnt disrupt our lives too much. \n\nIn the end individuals have an image that their slice of that pie will be bigger over time(think the American dream) and that the slice will grow faster than inflation. If individuals realize their slice is actually shrinking as the pie gets bigger they tend to be upset. Once they get upset either they figure out how to get more, or they make peace with it, or they thrash about because its not fair in their minds. They might be right. They might not. If they figure out how to get more through more work or better skills thats wonderful. If they make peace with it that sucks for them, but not end of the world for society usually. The problem is people thrashing about. If they have a valid issue it can be disruptive but resolved. If the issue isnt valid though that is where we have real trouble. What that thrashing about looks like varies but I think we all can all point at events and say that is thrashing about. Determining the validity of the claim is a political question and the answer rarely makes everyone happy so I will skip that part. \n\nThe major issue for the next 100 years or so is that population globally will likely peak and the decades before that and after it will almost certainly be full of a lot of people thrashing about. Much of that will be due to climate change and the impacts it has. Places get too hot for your way of life you suffer with it or you move. If your area floods you put up with it or you move. All that moving will generate frustration and anger on the part of the people moving and the people who have new neighbors. We all see at least some aspect of that happening already. Its already bringing out some ugly reactions. Bad actors are definitely riling up people about some aspects of it. In some places they go on and on about illegal immigrants. In others its about the mistreatment of immigrants. In others its racism or religious extremism. Some of it is cross international borders. In some places its internal. Try living somewhere that is pricing locals out of the market. Try living somewhere where you cant get affordable insurance for your house. \n\nMy guess is that a lot of companies are seeing a lot of these issues impact them in various ways and tbh they likely dont have answers for much of the problem. If I had to make a guess its going to have a huge impact on their revenues and on the value of many currencies and commodities over time. It might not look like it as it will all be in motion, but like the tide coming in it will happen. \n\nIf I could convince everyone of one thing it would be to show a little bit of consideration for everyone else around you. This is not going to be an easy thing for younger generations to deal with and it will be even worse if we convince them that thrashing about is the solution to the problems. Dont leave anyone behind because eventually you might be the odd one out. I dont care if they look different, act different, are an asshole, are morons, idc. Im not saying bend over backwards to help them, but for sure dont go out of your way to make it harder on them. \n\nAnyway apologies for getting on my soapbox.",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/libz8oo/",
                  "created": 1723769296,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "licks2f",
                      "score": 3,
                      "body": ">Dont leave anyone behind because eventually you might be the odd one out.\n\nVery well said. In theory our progress and advancement should be giving us more freedom and safety. Will we use that for the common good and be our brother's keeper? I hope so. We are capable of it.",
                      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/licks2f/",
                      "created": 1723777873,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lidb4v0",
          "score": 2,
          "body": "You are describing a soft landing.\n\nA recession is similar, but so severe that a pullback in one sector impacts others.\n\nIt's too soon to say if that might be the case, but it certainly looks possible. \n\nTech stocks are overpriced. Housing is overpriced. Unemployment is trending up. Inflation is softening.",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lidb4v0/",
          "created": 1723791702,
          "depth": 1,
          "replies": [
            {
              "id": "liddsvl",
              "score": 2,
              "body": "Inflation is put a fork in it done. \n\nTech stocks might be overpriced in many cases, but some may actually be cheap vs where they will be in a few years. Id say NVDA for example will likely continue up. TSLA is probably overpriced. MSFT will go up long term. Googl might have issues. apple likely isn't as much a growth stock as it used to be. meta is still growing, but it will slow down before too much longer. Many of the smaller but still big tech are a mixed bag of potential and issues. \n\nHousing is overpriced due to throttled supply. Most homeowners are not willing to trade their low rate for higher rates due to the risks involved with a higher mortgage. When rates drop a bit supply will likely jump up dramatically. That will likely be when fed cuts about 150-200 basis points so we are still quite a ways off from that tipping point. Tack on the issues with insurance in many areas and you have people leaving those places and going elsewhere that is putting pressure on the already limited housing supply where they are going. For example I bet Florida house prices will drop over the next few decades, but further north in NC and TN it will be pressured by many FL folk moving there. CA will see similar issues, but I dont know where they are all moving towards. I live in NC and anecdotally Im seeing a huge influx of FL plates in the area year around now. They built around 50 homes a few hundred yards from my house and roughly half of them were bought by people from FL. Few of the homes were bought by locals. Beyond the FL crowd we got a mix of people from other states with few NC residents moving in there. I have friends in TN and they are seeing similar things in their area. Lots of new homes going up, but most of them being bought by folks from elsewhere. Not complaining about it. I'm observing its happening and its makes sense for it to continue to happen.\n\nUnemployment has trended up a bit, but not spiked and all of that is relative to where its been for the past few years. A bigger issue is that skilled labor is excessive in one place and absent in another due to the housing issues. People aren't going to bear that cost  and risk for a bit more pay. Businesses aren't willing to cover that cost for the most part and its becomes a chicken and the egg kind of situation. Rates come down enough, people move, critical skill shortages get filled, economy stops grinding on problems the rates are causing. It doesnt help that many of these skilled labor jobs are not super high skilled labor, but rather just critical for a smooth operation. Without them you cant spin up all the related jobs. As an example the local hospital has had several opening for higher end nursing. The jobs aren't being filled and they are trying to make do with temp nurses. Not enough nurses are willing to move here and these specific jobs are mid to late career type nursing jobs. The pay offered is fine in normal times, but if the nurse you need has to sell the house out of town and get a house here then they either need to come out ahead or the new job has to pay enough to make it sensible. right now that simply isnt the case. Sell your house for a profit, get the same exact amount of mortgage in the new place, pay more due to rate by several hundred dollars a month at a minimum and your 24 or 25 mortgage is now back to 30 years. I know because I used to work at the hospital and someone I know there literally had this discussion with someone a few months ago. The lady didnt take the job because moving was only going to net her perhaps another $100 a month if you dont factor in the rental truck, the hours of packing, and if you factor in getting the prices just right on both the sale and the purchase.",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liddsvl/",
              "created": 1723793433,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lietfhb",
          "score": 1,
          "body": ">  That is what has happened. We have significant parts of the economy that are doing fine and other parts that are not. Its been that way since the pandemic in particular.\n\nThat's how the status quo situation has always been?\n\nAsk yourself this: has the economy only been this way since the pandemic?\n\nor\n\nWas the start of the pandemic the first time in your life you really started following the economy and gain an interest in finance / markets?\n\n/r/hmmm",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lietfhb/",
          "created": 1723818592,
          "depth": 1,
          "replies": [
            {
              "id": "lif1mpb",
              "score": 1,
              "body": "It's a matter of degree. If this was earthquakes the pandemic was a 7 or 8 and we usually only have a 3 every year and a 4 or 5 every few years.",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lif1mpb/",
              "created": 1723821215,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lib9qwb",
          "score": 0,
          "body": "What's not doing well?",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lib9qwb/",
          "created": 1723760105,
          "depth": 1,
          "replies": [
            {
              "id": "libbwt3",
              "score": 5,
              "body": "Well if you compare it to pre pandemic times:\n\n1. New cars.\n\n2. Appliances\n\n3. Home renovations was doing well, but is now struggling.\n\n4. Office buildings.\n\n5. Restaurants near office buildings in particular. They lost the lunch crowd and still have the high lease cost. \n\n6. Retailers that were located to be hit on the way home from work. Think about the underground mall in downtown Atlanta for example. It has great access for office towers around it, but otherwise quite limited access for everyone else. \n\n7. RVs are doing terrible now. They were doing ok early pandemic, but demand is satisfied and now they have a glut of inventory. Just look at camping world on a 5 year chart. You can see it play out. Its starting to bounce a bit as they hope for rate cuts bringing in customers. I would expect that boat manufacturers and outfitters are seeing similar issues. \n\n8. Retail in general is still suffering as people shop from home ever more. Consumer staple retailers are doing ok, but places like Best Buy? I suspect they are 10 years out at most from a major issue. Leases are likely hurting them a great deal.\n\n9. Housing Real estate. Transactions are down dramatically. That will likely mean a lot of people are technically employed, but are missing a ton of commissions. A bunch of related services are not happening either. New home sales are fine, but existing home sale issues have a lot of knock on impacts. When rates decline to around 4% or possibly 3% I expect we will see a huge amount of transactions start occurring. \n\n10. Insurance companies with large exposure to wildfires out west or hurricanes in Florida continue to struggle.\n\nThis is not a complete list, but it should give you some ideas.",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/libbwt3/",
              "created": 1723760866,
              "depth": 2,
              "replies": [
                {
                  "id": "libvggc",
                  "score": 2,
                  "body": "Yup worst case scenario a few companies will shake off the sp500 but not likely.  Look at Mr Cooper",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/libvggc/",
                  "created": 1723767917,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "libzo4x",
                      "score": 2,
                      "body": "Yeah its definitely not end of the world. We always have parts of the economy that are struggling and other parts that are fine. The list of problems change over time. The list of doing well changes as well. Investing is really about identifying who is about to get onto or off of those two lists and buy or sell them before the reality sets in.",
                      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/libzo4x/",
                      "created": 1723769454,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "li9fgx7",
      "score": 32,
      "body": "When the economy thinks it’s free from recession fears and people get greedy is EXACTLY when the recession comes through.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9fgx7/",
      "created": 1723739006,
      "depth": 0,
      "replies": [
        {
          "id": "liajoho",
          "score": 7,
          "body": "“I don’t care if you’re Warren Buffett or Jimmy Buffett. Nobody knows if a stock is going to go up, down, sideways, or in fucking circles.”",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liajoho/",
          "created": 1723751680,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lib88l7",
          "score": 6,
          "body": "i remember someone linking boglehead threads back in 2008. Any worry was dismissed cause the numbers were good at the time.",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lib88l7/",
          "created": 1723759585,
          "depth": 1,
          "replies": []
        },
        {
          "id": "liaws50",
          "score": 3,
          "body": "Doesn't this greed encourage people to spend money and therefore encourage a growth in the economy? This could be bad if the banks are currently lending money in a unsuitable way, I suppose, like the housing bubble.",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liaws50/",
          "created": 1723755803,
          "depth": 1,
          "replies": []
        },
        {
          "id": "libjqvb",
          "score": 1,
          "body": "The only numbers that matter are the jobs numbers. I will only feel better if we start seeing U3 start to retreat. If U3 continues to go up, it will only be a matter of time before that flows into \"problem zone.\"\n\nI haven't sold a single share of my mega cap profitable stuff, but I did zero out completely anything that is not profitable in my portfolio. I don't care if rates are 0%, if unemployment continues to go in this way, lending will tighten up.",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/libjqvb/",
          "created": 1723763633,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lianeeb",
      "score": 4,
      "body": "Firmly? Can't confirm anyrhing yet, call me in 5 years",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lianeeb/",
      "created": 1723752865,
      "depth": 0,
      "replies": []
    },
    {
      "id": "libp4db",
      "score": 3,
      "body": "You're reading this wrong.  \n\nThe recent retail/jobless report is going to no nothing more than reassure the Fed they can go slower with rate cuts.  You'll see a quarter cut in September and maybe a quarter at the next meeting.  Which is way too slow.  Things are fine \\_now\\_, but we're on a razor's edge, and you can see that by the unemployment rate which is trending up and accelerating.  There's a reason people never see the recession/collapse/disaster until it's upon them, and that reason is ignoring trends and subtle signals.  People are spending far less than they were (shopping at Walmart instead of upscale places), company bottom lines are stretched with customers pushing back on valuation concerns, and consumer debt obligations are jacked...none of this points to long term stability.  \n\nAnd the Fed is moving far, far too slow to arrest this decline.  We're still in \"significantly restrictive\" rate territory, when at best we should be \"restrictive\" or even \"neutral\" rate territory.  And we won't get there until well into 2025 at the rate the Fed wants to move.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/libp4db/",
      "created": 1723765568,
      "depth": 0,
      "replies": [
        {
          "id": "lie86q4",
          "score": 2,
          "body": "This is my take as well. The July jobs report released last week was not the first bad one, the first bad one was the May one, then June was pretty rough, then July was really quite bad. The initial signals were not interpreted as poorly as July because the headline jobs numbers were still okay, whereas July was a real and meaningful slowdown. \n\nHeck, PPI was well under expectations, which points to loss of pricing power from companies. CPI was also fairly soft outside of shelter. Retail sales obviously pumped absurdly, which is interesting. That is probably the one very good report out this week, the rest are more subtle, as you said.",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lie86q4/",
          "created": 1723810833,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lidddlr",
      "score": 4,
      "body": "Bro you need to visit the small business subreddit.  Shit is on fire everywhere.  Small businesses are dying fast.  A recession is coming but just not a big one.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lidddlr/",
      "created": 1723793151,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li9smff",
      "score": 7,
      "body": "Let’s see what happens at the end of august. Still a lot of volatility and this “recovery” will be interesting to see when stocks start testing those highs from only a month ago so quickly.\n\nI’m on team downward channel.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9smff/",
      "created": 1723743114,
      "depth": 0,
      "replies": [
        {
          "id": "liamnmy",
          "score": 2,
          "body": "Uh, the downtrend is most certainly NOT intact for the S&P, it's blown through every key line.\n\n\nJust completely absurd stuff. The last and best hope if you're bearish is probably a 2022 Jackson Hole like deal (but why?) OR NVDA getting hammered on earnings, because the option I think I still probably prefer is honestly neutral ultimately (consolidate to November).",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liamnmy/",
          "created": 1723752623,
          "depth": 1,
          "replies": [
            {
              "id": "liasbp2",
              "score": 1,
              "body": "I’m just skeptical. I’ve got no numbers to back anything up. Just watching it flip from greed to fear to greed again so quickly and so many huge days ina row… oh. And the bullish bots. They’ve been flooding the subs. Something just doesn’t feel right. \n\nI think we are going to just be in a period of lower highs and lows for a bit. Choppy seas. All that. \n\nI no bear or bull. I bought NVDA at $99 when it dropped and sold it at $115. And I’m sitting out till the next drop. Then I’ll swing again. I’m thinking the end of august..",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liasbp2/",
              "created": 1723754409,
              "depth": 2,
              "replies": [
                {
                  "id": "licauvr",
                  "score": 3,
                  "body": "Market becomes more volatile every year",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/licauvr/",
                  "created": 1723773804,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "li983lf",
      "score": 28,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li983lf/",
      "created": 1723736669,
      "depth": 0,
      "replies": [
        {
          "id": "li9bkid",
          "score": 4,
          "body": "I can already see it. The second they cut rates morons just thinking it’s back to 2021 and just pile all this cash on the sidelines into all sorts of stuff. Main reason I decided against going in on TLT.",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9bkid/",
          "created": 1723737771,
          "depth": 1,
          "replies": [
            {
              "id": "li9fviz",
              "score": 1,
              "body": "I am frontrunning with TQQQ",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9fviz/",
              "created": 1723739134,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lidz8q6",
              "score": 1,
              "body": "I mean, the Nasdaq has already been doing everything it’d do in 2021 (really late 2019 through 2024 with 1 year that was an exception, the COVID crash just temporarily interrupted what was already going on). \n\nI’m not sure rate cuts are making what’s already going on worse, and in fact, there is a shot they’d be helpful at stemming the tide and we got a preview of that. \n\nIn reality, once the Fed was helpful with the regional bank problem, it was over. That officially marked the end of what went on in 2022 (really Feb 2021-Feb 2023, even though the market did well until 2022) and the beginning of large caps for the US doing what they wanted.",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lidz8q6/",
              "created": 1723806789,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "liaqp6g",
      "score": 3,
      "body": "The market certainly shrugged it off for now. Massive rally and tons of short covering this week.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liaqp6g/",
      "created": 1723753903,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liavj9m",
      "score": 3,
      "body": ">\"We think the soft landing is firmly in place.\"\n\nThat.... seems a bit strong. I'd settle for \n\n* \"a soft landing is definitely a 50/50\" and\n* \"even if we don't get a soft landing, it is highly unlikely we're going to be a huge crash. At worst the recession will be quick and moderate.\"\n\nThat's a good enough condition to stay in the market or even buy more shares of company you believe in, IMHO.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liavj9m/",
      "created": 1723755411,
      "depth": 0,
      "replies": []
    },
    {
      "id": "licld5h",
      "score": 3,
      "body": "Gaslighting",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/licld5h/",
      "created": 1723778125,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li9tep8",
      "score": 2,
      "body": "Funny we were all (myself included) shouting in the internet about emergency cuts….\n\nTwo weeks ago",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9tep8/",
      "created": 1723743357,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liaqzgn",
      "score": 2,
      "body": "I still do not get the jobs.   I would think by now we would start to see them go away.   That is coming eventually.\n\nMy guess is that enough people like myself are retiring early and that is making enough space to make it so there is not a job issue.\n\nPlus my age is like the top of the baby boom.  So there is a lot my age which is basically now retirement ageish.  I retired in my late 40s early and would be unusual.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liaqzgn/",
      "created": 1723753992,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lia8ehh",
      "score": 3,
      "body": "Say it with me, thanks J.Powell thanks J.Biden.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lia8ehh/",
      "created": 1723748054,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li9frnw",
      "score": 4,
      "body": "You mean this isn't the worst economy since the rest depression like I'm being told by certain politicians?",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9frnw/",
      "created": 1723739100,
      "depth": 0,
      "replies": []
    },
    {
      "id": "libbdee",
      "score": 2,
      "body": "It's an election year. Trust nothing.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/libbdee/",
      "created": 1723760676,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li9v0sl",
      "score": 2,
      "body": "The very low end consumer is hurting badly from government created inflation\n\nWalmart has seemed to find a way to capitalize on them \n\nEveryone else is doing decent too good",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9v0sl/",
      "created": 1723743860,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li9xtd5",
      "score": 2,
      "body": "This is a useless post considering you can pick whichever way you want to stand and have a good case",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9xtd5/",
      "created": 1723744724,
      "depth": 0,
      "replies": [
        {
          "id": "liav5e0",
          "score": 1,
          "body": "Hmmm... arguably sometimes those conditions is what generates the most interesting debates. =)",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liav5e0/",
          "created": 1723755290,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lib1p96",
          "score": 1,
          "body": "Nobody knows shit except for Nancy Pelosi.",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lib1p96/",
          "created": 1723757403,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li9njmj",
      "score": 2,
      "body": "It's an election year. Rs are going to say the economy is terrible!",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9njmj/",
      "created": 1723741532,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li9q7wb",
      "score": 1,
      "body": "!Remindme 1 month",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9q7wb/",
      "created": 1723742369,
      "depth": 0,
      "replies": [
        {
          "id": "li9qe5l",
          "score": 1,
          "body": "I will be messaging you in 1 month on [**2024-09-15 17:19:29 UTC**](http://www.wolframalpha.com/input/?i=2024-09-15%2017:19:29%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9q7wb/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1esxoqc%2Funfounded_recession_worries_with_soft_landing%2Fli9q7wb%2F%5D%0A%0ARemindMe%21%202024-09-15%2017%3A19%3A29%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201esxoqc)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9qe5l/",
          "created": 1723742423,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "liarzpn",
      "score": 1,
      "body": "What significance do retail sales one month ago have for recession probability over the next 12 months",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liarzpn/",
      "created": 1723754306,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lic5ukv",
      "score": 1,
      "body": "Mission accomplished ",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lic5ukv/",
      "created": 1723771813,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lic6t0e",
      "score": 1,
      "body": "I’ve been hearing recessions and layoffs since Covid. \n\nI get fear sells, but what a joke.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lic6t0e/",
      "created": 1723772197,
      "depth": 0,
      "replies": []
    },
    {
      "id": "licig4i",
      "score": 1,
      "body": "I ain't holding my breath until after February 2025.\n\nI expect this Christmas to be shit, worse than last.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/licig4i/",
      "created": 1723776885,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lie3w4c",
      "score": 1,
      "body": "That report was \"as of \" July , but does not include July",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lie3w4c/",
      "created": 1723808977,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lie7ok7",
      "score": 1,
      "body": "Sounds too good to be true",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lie7ok7/",
      "created": 1723810622,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lifn6vl",
      "score": 1,
      "body": "I have to say my VOO is up 16% YTD. Thats wild.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lifn6vl/",
      "created": 1723827994,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liftfpu",
      "score": 1,
      "body": "I can’t put my finger on it, but it just doesn’t feel right.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liftfpu/",
      "created": 1723829961,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lig22js",
      "score": 1,
      "body": "Home Depot just published the exact opposite. That sales are down and projected to be down.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lig22js/",
      "created": 1723832698,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligdufc",
      "score": 1,
      "body": "Imagine being one of the losers who dumped shares the past 2 weeks ",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/ligdufc/",
      "created": 1723836496,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lij6rpy",
      "score": 1,
      "body": "Famous last words. LOL",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lij6rpy/",
      "created": 1723879313,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lin9juu",
      "score": 1,
      "body": "The unemployment rate doesn't lie, and history repeats.  When unemployment trends change, fed funds rate changes, and the market actually hates rate cuts which is counter to what CNBC would have you believe.\n\nOpen a chart. Plot fed funds on one, unemploymnet on the other, and SPX at the top. When fed fund rates are increasing, or moving sideways, the market rallies. When the rate gets cut, the market delivers a negative return when the cut cycle has ended.\n\n[edit] Sorry. It's not that the market hates cuts, it's that the cuts are a response to weakening data and the market seems late to respond.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lin9juu/",
      "created": 1723941188,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lio49gk",
      "score": 1,
      "body": "There is 0 chance of a soft landing. When have never had a soft landing from a rate hiking cycle. Rates are stressing businesses and banks are being selective with new credit. We haven't seen the bankruptcy yet but if you look at where banks are marking their loans you continue to see a tick up in concerning loans. Additionally, you hear from McDonald's, Walmart and from Disney saying people are stressed.  They are looking for value. High income people are going to Walmart. They aren't showing up at Disney's parks. There are cracks in the economy and what happened with the market crashing and volatility spiking is the result of investors being on edge because of what is going on. \n\n\nI don't think we get a bad recession but I think we get a recession. You have to remember that the Fed's soft landing is like a surgeon saying he can fix your heart with a rock and a hammer. Rates aren't precise and there is a big lag between when the fed takes actions and when they actually hit the real economy. I'd just question the validity of saying that the fed can now do this soft landing thing that has never been done before. Maybe we get lucky and it happens but it's not something I'd count on. ",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lio49gk/",
      "created": 1723954599,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lioojna",
      "score": 1,
      "body": "Earnings reports will tell the story.\n\nThey’re getting ugly.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lioojna/",
      "created": 1723966430,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ln5rnsk",
      "score": 1,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/ln5rnsk/",
      "created": 1726353818,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li9x8ls",
      "score": 1,
      "body": "No chance this is the case. Unemployment will show a sustained rise over the next few months, markets will tank and we will firmly be in the middle of recession.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9x8ls/",
      "created": 1723744547,
      "depth": 0,
      "replies": [
        {
          "id": "linan5w",
          "score": 1,
          "body": "People really should take this seriously. Unemployment will continue to rise over time and the market responds, very aggressively, the other direction.",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/linan5w/",
          "created": 1723941629,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "li9mo7j",
      "score": 1,
      "body": "Ultimately people confused a weaker economy with a weak economy",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9mo7j/",
      "created": 1723741256,
      "depth": 0,
      "replies": []
    },
    {
      "id": "li9rjdx",
      "score": 0,
      "body": "Waiting with my finger on the trigger for my move into SQQQ. Until then it’s long positions all the way. This recession talk has been going on all year.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9rjdx/",
      "created": 1723742780,
      "depth": 0,
      "replies": [
        {
          "id": "liaunaa",
          "score": 0,
          "body": "How do you decide whether to own SQQQ or to buy calls?",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liaunaa/",
          "created": 1723755133,
          "depth": 1,
          "replies": [
            {
              "id": "liaxvdi",
              "score": 1,
              "body": "Well I don’t fuck with options because I’m not that savy or that foolish depending on your outlook, and I only buy SQQQ on days bad economic news comes in and I can count on it to move the same way all day. Triple witching days are the best days of the year to buy SQQQ. We only have a few a year and one of them pumped this year so I wait for the downward momentum to get well established. And I don’t buy it the day before when it’s on sale because you never know how that CPI or Jobs report is gonna go.",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liaxvdi/",
              "created": 1723756155,
              "depth": 2,
              "replies": [
                {
                  "id": "liaz06x",
                  "score": 2,
                  "body": "Thanks! I appreciate the tips.",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/liaz06x/",
                  "created": 1723756521,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "li95902",
      "score": -7,
      "body": "I am enjoying the ride too but I would urge to sell into a rally once S&P 500 goes above 6000. I bought a lot of stuff last week but will unload into the rally.",
      "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li95902/",
      "created": 1723735785,
      "depth": 0,
      "replies": [
        {
          "id": "li96p5l",
          "score": 41,
          "body": "Ok random internet person, consider it done. As soon as my stocks start gaining momentum, I’ll promptly sell everything. Thanks for free investment advice kind stranger!",
          "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li96p5l/",
          "created": 1723736235,
          "depth": 1,
          "replies": [
            {
              "id": "li9lhwq",
              "score": 3,
              "body": "When will people learn just hold and stop being scared little fools.",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9lhwq/",
              "created": 1723740891,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lia6shl",
              "score": 1,
              "body": "Make sure to sell all of your winning tech stocks from the past decade and pile that cash into the Russell 2k!  Media knows what's best for you!",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/lia6shl/",
              "created": 1723747551,
              "depth": 2,
              "replies": []
            },
            {
              "id": "li96x7l",
              "score": 1,
              "body": "Don't sell everything! Trimming  to be able to scoop up cheap stocks like last Monday!",
              "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li96x7l/",
              "created": 1723736305,
              "depth": 2,
              "replies": [
                {
                  "id": "li9fcdk",
                  "score": 3,
                  "body": "never a full shave!  just a trim",
                  "permalink": "/r/stocks/comments/1esxoqc/unfounded_recession_worries_with_soft_landing/li9fcdk/",
                  "created": 1723738967,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}