{
  "title": "Puts on Dropbox? (DBX)",
  "score": 74,
  "selftext": "Dropbox (DBX) has never been a particularly good stock - but I have reason to believe that the stock might plummet significantly sometime after November of this year due to a massive decrease in revenue. I work in film/media and have used Dropbox’s unlimited storage plan for more than 6 years.  It’s been great!  I’ve paid $98/month and have around 250 TB stored on their cloud. However, Dropbox is doing away with their unlimited plan.   Last year, a rep from Dropbox called me and I was informed that I would have until November of this year (2024) to remove my data or have to pay a significantly higher price.  They are now charging per 5TB.  My new price would be over $2000/month.  Obviously this is an insane increase in price and something I won’t pay and after calling today to make sure they didn’t design some sort of retention offer, which they indeed haven’t, I have begun the process of removing all my data from their cloud and storing it locally.  So the question becomes - if thousands of people like me all jump ship and leave Dropbox, how much could this affect their revenues?   Some people with unlimited plans pay more than me - as the price is based on how many users you have on your unlimited account, so there can be other users with unlimited accounts that pay $200 or  $500 or even 1000 per month, their pricing would also likely 10x or 20xI’m picturing 50k or more $100-$500/ month plans all leaving.  I’m not a stock picker and don’t usually try to make plays based on speculative things like this - but this is a situation that has peaked my interest.  I currently hold zero positions in DBX.   But curious how others might see this playing out. ",
  "link_flair_text": "Company Discussion",
  "id": "1et5rio",
  "num_comments": 58,
  "created_utc": 1723754136,
  "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/",
  "comments": [
    {
      "id": "liavdhs",
      "score": 159,
      "body": "This is bullish as fuck.",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/liavdhs/",
      "created": 1723755361,
      "depth": 0,
      "replies": [
        {
          "id": "libn1dx",
          "score": 69,
          "body": "Going to second this. Worked for a few companies and they use Dropbox at scale. $2k is nothing compared to the cost to move infrastructure.",
          "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/libn1dx/",
          "created": 1723764819,
          "depth": 1,
          "replies": [
            {
              "id": "lidj2do",
              "score": 19,
              "body": "Plus freeloading users will leave and they’ll save on storage costs as a result, some pay you 10x and some leave entirely. Revenue is going to increase and costs decrease most likely",
              "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lidj2do/",
              "created": 1723796948,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "liawleh",
          "score": -26,
          "body": "How so?  You think people will pay a 10x price from what they’re used to?  \n\nFor what I would pay in one year at the new price, I could literally buy a local server made of  significantly faster SSD’s that would hold 1000 TB or more. \n\nI could see them maybe not needing to expand their storage as much, maybe saving on expenses but I do really well in my industry and there’s still no fucking way I would pay 10 X the price of what I currently pay. \n\nGenuinely curious how this might be interpreted as bullish.",
          "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/liawleh/",
          "created": 1723755744,
          "depth": 1,
          "replies": [
            {
              "id": "liaxw48",
              "score": 70,
              "body": "The whole of Reddit called on the end of Netflix when they announced they were going away with people sharing accounts. Everyone was bearish on Netflix. The stock exploded upwards at their next earnings calls because guess what, they fucking killed earnings. In hindsight, no shit. They kicked half the platform off and made them pay. Sure only 10-20% ended up paying, but hey, that’s big money.\n\n\nYou’re just a guy. You’re not a billion dollar corporation who has this whole business protected and store in Dropbox. The amount of work it will take colleges and businesses to ditch drop box to save $2k/month, isn’t profitable. They’ll just bite the bullet and pay the insignificant (to them) price increase.",
              "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/liaxw48/",
              "created": 1723756162,
              "depth": 2,
              "replies": [
                {
                  "id": "liaz0zu",
                  "score": -23,
                  "body": "I see where you’re coming from, but I do think that this is a little bit different situation. I would argue that guys like me utilize the most space.  Video files are ginormous compared to data and documents and even photos…. I guess my point is, it would not surprise me if me being a small guy has more stuff stored on Dropbox then say, a local community college. \n\nSure, I know I’m a small fish to them but if 50,000 small fishes leave, I would still imagine that’s gonna hurt their bottom line. But maybe the big fish that still pay will make up for it.",
                  "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/liaz0zu/",
                  "created": 1723756529,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lib2zcg",
                      "score": 66,
                      "body": "At $98 a month with 250 TB of data you are likely costing them money.  Dropping you as a client will benefit them in the long run.",
                      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lib2zcg/",
                      "created": 1723757823,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lict5rv",
                          "score": 10,
                          "body": "There's no way it's not costing then money. At $20/TB in disk cost alone, it would take 50 months to turn an ROI, not factoring in servers, network, and data transfer costs. Probably pushes that out to 10 years, and there's no way they aren't replacing hardware by then. And that's just assuming the data exists on one set of drives, which it must certainly doesn't.",
                          "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lict5rv/",
                          "created": 1723781689,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lidhzax",
                          "score": 5,
                          "body": "This. If anything the move will massively improve their margins. Even if it may affect the top line.",
                          "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lidhzax/",
                          "created": 1723796223,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lieohtu",
                          "score": 3,
                          "body": "Exactly. Overusers like you are the reason we can't have nice things. They are probably ok if you pay, but hoping you find a similar plan at the competition and overuse that.",
                          "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lieohtu/",
                          "created": 1723816942,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lib0fr1",
                      "score": 20,
                      "body": "The big fish always are the bulk of a business.\n\nThey don’t want people like you on the platform. This is a way of getting rid of their lowest profitable customers. While at the same time rising cost for the customers they want to keep.",
                      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lib0fr1/",
                      "created": 1723756990,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lidbnzu",
                          "score": 3,
                          "body": "They did want people like him on the platform, when they needed him/everyone to help grow it.  That's why they offered the plan.\n\nThey don't need nor want him anymore, so...  here we are.\n\nIt's now business.",
                          "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lidbnzu/",
                          "created": 1723792042,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "libuh0m",
                          "score": 2,
                          "body": "This^",
                          "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/libuh0m/",
                          "created": 1723767553,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "licqc86",
                      "score": 1,
                      "body": "You are probably correct they will lose small fish like you and me who use the service like this.  But they will start raking in tons more from their big customers who use the enterprise level plans.",
                      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/licqc86/",
                      "created": 1723780351,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "libs6dz",
      "score": 86,
      "body": "250TB for $98 a month?  That’s tens of thousands of dollars of equipment you were using for $1200 a year. $2000 a month sounds steep, but Dropbox was losing their shirt charging you $98 a month.\n\nThat’s like leasing a car for $100 a month. There’s no way it made sense on DBX’s end.",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/libs6dz/",
      "created": 1723766695,
      "depth": 0,
      "replies": [
        {
          "id": "lie8923",
          "score": 6,
          "body": "1) most people arent even using close to the 250 TB limit\n2) when you upload a file, Dropbox isn't storing the entire file. Dropbox finds overlaps between files and only stores one copy. For example, if you upload the bee movie, Dropbox already has 1000 copies of that movie and it just stores that you have a copy of that file. You upload a 2 GB file, but it only takes up 10 kilobytes of space.The 250 TB of storage is actually significantly less than 250 TB in reality.",
          "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lie8923/",
          "created": 1723810860,
          "depth": 1,
          "replies": []
        },
        {
          "id": "libvs3f",
          "score": -16,
          "body": "Maybe so.. but it’s not like I was uploading that much every month.  That was accumulated over 5 years.  So I’ve paid a total of $6k+ for that amount.  A 1TB drive costs guys like us $100 bucks but I’d bet 1TB is like $10 for DBX.  \n\nThe rep I talked to said that this decision was largely influenced because of accounts that had multiple Petabytes of storage.  So like 5000 TB or more..\n\nAlas, it is what it is.",
          "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/libvs3f/",
          "created": 1723768034,
          "depth": 1,
          "replies": [
            {
              "id": "libz79t",
              "score": 23,
              "body": "An online service like Dropbox has your data on multiple drives in different regions so that if the drive breaks or even the whole data center is destroyed they’ll still have your data safe. A single hard drive at your house or office is not anywhere close to comparable. \n\nIf this is work data your livelihood depends on then you 100% need an offsite backup at minimum. Also for remote access you’ll need a server, that you maintain.  Do you have the skills and time to setup and maintain 250TB servers in different locations with sufficient up time?  \n\n Truthfully I don’t think you appreciate the service cloud storage providers provide.  \n\nIf there’s a ton of old data you don’t need fast access to then look into cold storage providers and just keep the data you need hot in Dropbox.",
              "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/libz79t/",
              "created": 1723769281,
              "depth": 2,
              "replies": [
                {
                  "id": "lic7re5",
                  "score": -8,
                  "body": "I mean they're just a wrapper for S3 though right?",
                  "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lic7re5/",
                  "created": 1723772578,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lic8zd3",
                      "score": 12,
                      "body": "Dropbox hasn't used S3 for storage for almost 10 years. They have their own systems that are custom built",
                      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lic8zd3/",
                      "created": 1723773065,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "licql72",
                      "score": 2,
                      "body": "They primarily use their own Datacenters. They have some interesting storage related tech blog posts if you’re interested:\n\nhttps://dropbox.tech/infrastructure/inside-the-magic-pocket\n\nhttps://dropbox.tech/infrastructure/four-years-of-smr-storage-what-we-love-and-whats-next\n\nhttps://www.infoq.com/articles/dropbox-magic-pocket-exabyte-storage/",
                      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/licql72/",
                      "created": 1723780464,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "libhzpn",
      "score": 40,
      "body": "Of all the bloated tech stocks out there you pick the ones with a totally reasonable pe, sitting near alt time loans and having just posted an earnings beat. It’s a bold strategy",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/libhzpn/",
      "created": 1723763009,
      "depth": 0,
      "replies": [
        {
          "id": "licr74i",
          "score": 8,
          "body": "Also lots of insider buying. Hell, I might buy a call as a lottery ticket",
          "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/licr74i/",
          "created": 1723780751,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lic02uv",
      "score": 12,
      "body": "Where do you store 250TB for $1200 yearly now?",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lic02uv/",
      "created": 1723769605,
      "depth": 0,
      "replies": [
        {
          "id": "liceion",
          "score": 12,
          "body": "Nowhere.",
          "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/liceion/",
          "created": 1723775261,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "libf97u",
      "score": 26,
      "body": "See r/datahoarder\nunlimited storage plans are a marketing gimmick, and most providers have come to the realization it just doesn’t make sense to attempt to offer that lie to customers anymore. \n\nI personally think companies like backblaze are more the future and Dropbox is the past.",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/libf97u/",
      "created": 1723762040,
      "depth": 0,
      "replies": [
        {
          "id": "libhfr6",
          "score": 1,
          "body": "This makes sense, I had thought that maybe once fiber Internet became so widespread that storage providers started rethinking “unlimited” \n\nPrior to having fiber Internet, it was impossible to upload terabytes worth of media. But now I can upload one terabyte of data in less than half an hour.  I think that probably had something to do with the change as well.",
          "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/libhfr6/",
          "created": 1723762811,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lieyxqm",
      "score": 10,
      "body": "Having worked in this industry, Dropbox is most certainly losing significant amounts of money storing 250TB for $98/month. They're probably still losing money at $2000/month. Their profits comes from those who pay for the 2TB plan while only storing 20GB which represents most of their paying user-base.\n\nAll the whale users like yourself leaving the platform will just make them significantly more profitable.",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lieyxqm/",
      "created": 1723820363,
      "depth": 0,
      "replies": []
    },
    {
      "id": "licmoe4",
      "score": 7,
      "body": "$2500/mo would be about $0.01 per GB, which is about average for cloud storage if we’re talking the big names (AWS, GCP, Azure). I’ve heard Backblaze is around half what the big boys cost, but that’s still $1250/mo. You were getting an insanely good deal at $98/mo and it makes sense they would adjust their prices to fit with the market.",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/licmoe4/",
      "created": 1723778699,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liaumbu",
      "score": 6,
      "body": "They talk about it on the earnings calls.",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/liaumbu/",
      "created": 1723755125,
      "depth": 0,
      "replies": [
        {
          "id": "liav9wt",
          "score": -21,
          "body": "So you’re saying it’s likely priced in?  I don’t listen to those so I wouldn’t know.",
          "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/liav9wt/",
          "created": 1723755330,
          "depth": 1,
          "replies": [
            {
              "id": "lic9hij",
              "score": 28,
              "body": "Buying puts (maybe the least likely directional play to succeed) on a company whose esrnings calls you dotn listen to is a brave move.",
              "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lic9hij/",
              "created": 1723773263,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "licrmug",
      "score": 3,
      "body": "Where did your “50k” number come from? Or any of your other estimates for that matter?\n\nEither way, if you are confident in your assessment, their profits will under perform on their earnings release. Just buy puts the day before or just short some shares…",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/licrmug/",
      "created": 1723780959,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liawpgg",
      "score": 7,
      "body": "I left dropbox ages ago. It was a great product when it first launched and now no longer serves any purpose of in the market place.\n\nWhat you are calling out is their road to obsolescence but the issue is of course timing.\n\nYou have to be able to call the exact moment that the cash cow will be done being harvested which is easier said than done imo.",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/liawpgg/",
      "created": 1723755779,
      "depth": 0,
      "replies": [
        {
          "id": "liaxegi",
          "score": 1,
          "body": "I’ve really loved their product. It’s nice when a client emails me for a file and I can just click to my phone and send it in an instant. Going to be really bummed to leave, but the service is not worth what they’re trying to charge now.  \n\nI think if there’s a mass exodus of people like me, maybe they will try and send out some retention offers.  \n\nWhat made you leave?",
          "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/liaxegi/",
          "created": 1723756002,
          "depth": 1,
          "replies": [
            {
              "id": "lic5z76",
              "score": 1,
              "body": "So what’s your alternative?",
              "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lic5z76/",
              "created": 1723771865,
              "depth": 2,
              "replies": [
                {
                  "id": "licg069",
                  "score": 1,
                  "body": "Building a server.  Storing locally.",
                  "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/licg069/",
                  "created": 1723775868,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "licz7bl",
      "score": 4,
      "body": "Super bullish. They’re losing their ass on that unlimited plan, for sure.",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/licz7bl/",
      "created": 1723784734,
      "depth": 0,
      "replies": []
    },
    {
      "id": "libbahs",
      "score": 2,
      "body": "What is better about Dropbox than google drive?",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/libbahs/",
      "created": 1723760648,
      "depth": 0,
      "replies": [
        {
          "id": "libh70o",
          "score": 3,
          "body": "Just the way the whole ecosystem works on your desktop. If you use the Dropbox application, you can passively navigate through all of your files from your computer and see them all as if they were stored locally on your drive. (I use Apple so for me, I just open Finder and can find any file I want in a matter of seconds). Then, if you need something, you just write click it and choose the option to make it available locally. \n\nMaybe Google Drive offers something like that now but when I signed up for Dropbox forever ago, they didn’t. I don’t even think Google Drive offered unlimited storage at the time either.",
          "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/libh70o/",
          "created": 1723762726,
          "depth": 1,
          "replies": [
            {
              "id": "libhw2h",
              "score": 3,
              "body": "Ah, yeah google drive is cheap and uses a similar interface now. I think this adds to your bearish case tbh",
              "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/libhw2h/",
              "created": 1723762972,
              "depth": 2,
              "replies": [
                {
                  "id": "libwspf",
                  "score": 1,
                  "body": "Google drive isn’t much cheaper than Dropbox and has a worse app + website.",
                  "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/libwspf/",
                  "created": 1723768404,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "libwn9i",
              "score": 2,
              "body": "Dropbox is still a nicer more reliable app in my experience. Google doesn’t offer unlimited storage either anymore. ",
              "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/libwn9i/",
              "created": 1723768348,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "libl67p",
      "score": 1,
      "body": "This sounds like the VMWare playbook Broadcom deployed... though their enterprise customers were really sticky and had no choice but to put up with 3-10X increase.",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/libl67p/",
      "created": 1723764147,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lic4fzd",
      "score": 1,
      "body": "What's going to be your alternative though?",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lic4fzd/",
      "created": 1723771261,
      "depth": 0,
      "replies": [
        {
          "id": "licfuk7",
          "score": 1,
          "body": "Storing locally.",
          "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/licfuk7/",
          "created": 1723775804,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lic5vyi",
      "score": 1,
      "body": "The their revenue decline won't show up until the following quarter",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lic5vyi/",
      "created": 1723771828,
      "depth": 0,
      "replies": []
    },
    {
      "id": "licenj4",
      "score": 1,
      "body": "All good things must come to an end, and free things never last forever.",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/licenj4/",
      "created": 1723775315,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lid7zr9",
      "score": 1,
      "body": "I work in cloud for a Hyperscaler 250TB a month for $98 is crazy cheap. And that was in hot storage?",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lid7zr9/",
      "created": 1723789756,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lie0dv2",
      "score": 1,
      "body": "Don’t you think they have any inkling of reasoning that such a massive price increase is going to work out for them?\n\nI mean, seriously, how can you expect a corporation to do something like that without them expecting a positive return",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lie0dv2/",
      "created": 1723807349,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lifoie8",
      "score": 1,
      "body": "So, June Calls 2025 - 30 USD strike?",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lifoie8/",
      "created": 1723828415,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lig1l2z",
      "score": 1,
      "body": "Look at it through eyes other than your own, to see farther into the distance.",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lig1l2z/",
      "created": 1723832543,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lijnvb1",
      "score": 1,
      "body": "I would wait for one last wave towards 30+ then consider shorts",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lijnvb1/",
      "created": 1723890990,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liu7kbv",
      "score": 1,
      "body": "First of all, $98 for 250TB is a steal. \nI’m assuming you want a hot storage, then it’s gonna cost you some, since the speed and frequency of the visits. $2k-$5k a month is probably at cost, not sure how much Dropbox makes money out of it.",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/liu7kbv/",
      "created": 1724051365,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liz0kuf",
      "score": 1,
      "body": "I don’t think Dropbox gets credit for making reasonable acquisitions to bolster the end user experience either. They’ve now added functionality similar to Docusign without overspending by actually acquiring Docusign and they’re working towards implementing zero-knowledge thru their Boxcrytor acquisition, which was a major reason some companies were avoiding using Dropbox. It seems they understand they’re in a very competitive market with Microsoft and Google bundling storage with their productivity offerings so they try to find ways to differentiate themselves while offering integrations with both Microsoft 365 and Google Docs.",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/liz0kuf/",
      "created": 1724117730,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lul2qn9",
      "score": 1,
      "body": "20% layoff, you may have been onto something!",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lul2qn9/",
      "created": 1730320861,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lidxhyn",
      "score": 0,
      "body": "Stock will skyrocket, remember netflix.",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lidxhyn/",
      "created": 1723805901,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lic3sza",
      "score": -5,
      "body": "Dropbox stinks. Commodity play...MS and Google offer unlimited storage as part of their cloud collaboration platform. Stay away from Dropbox.",
      "permalink": "/r/stocks/comments/1et5rio/puts_on_dropbox_dbx/lic3sza/",
      "created": 1723771010,
      "depth": 0,
      "replies": []
    }
  ]
}