{
  "title": "Worldwide markets all showing the most recent dip (early august)",
  "score": 66,
  "selftext": "I have some AEX (Dutch), SP500 (US) and MSCI World ETF stocks. All of these suffered from the recent dip (but have since recovered).   \n  \nLooking at data from the past few weeks, I noticed that the Dutch AEX index had a very similar dip at the same time compared to the MSCI World ETF. Looking at other European countries, all those indices also dipped the same way. And if I look at US and Asian markets, again the same dip.\n\nI thought I had spreaded the risk by doing a Dutch index, a World ETF and a US ETF, but now I am starting to think this is not spreaded at all. \n\nShould I diversify my stocks? Or leave them and don't think to much of it? ",
  "link_flair_text": null,
  "id": "1etirjc",
  "num_comments": 41,
  "created_utc": 1723793801,
  "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/",
  "comments": [
    {
      "id": "lidfxyv",
      "score": 65,
      "body": "Stocks, wether global or regional, are correlated. To truly diversify you must find uncorrelated, inverse correlation, or at least very low correlation.",
      "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lidfxyv/",
      "created": 1723794861,
      "depth": 0,
      "replies": [
        {
          "id": "lidgpku",
          "score": 4,
          "body": "Can you give an example of uncorrelated stocks? Or should I look at stuff like bonds ?",
          "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lidgpku/",
          "created": 1723795376,
          "depth": 1,
          "replies": [
            {
              "id": "liebgm4",
              "score": 16,
              "body": "When a liquidity crisis hits, everything pretty much becomes correlated and sells off, with bonds usually being the only exception, although even in true crisis a bond ETF can go down due to forced selling.\n\nGenerally speaking, the more different asset classes you add into a portfolio, the less correlated to equities you are and your portfolio volatility decreases.\n\nWouldnt say to do this, but like 25% stocks, 25% gold, 25% bonds, 25% real estate (you get the point) would have minimum volatility and be not that corrleated to SPY.",
              "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/liebgm4/",
              "created": 1723812173,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lie9jnx",
              "score": 7,
              "body": "Keep in mind that in any market downturn correlation between even low correlation assets rise since there is a flight to liquidity",
              "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lie9jnx/",
              "created": 1723811399,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lidj8fn",
              "score": 14,
              "body": "Bonds, real estate, hysa, art, gold, and even just stocks in different sectors not just different countries. Though, if you’re spread too thin you may not grow. The trade off is typically high risk high reward or low risk low reward.",
              "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lidj8fn/",
              "created": 1723797060,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lidj9rv",
      "score": 15,
      "body": "Economies are extremely linked to each other. Also as a Dutch man myself. The AEX is an absolute piece of shit. You might as well just select the best companies from it as there are only 25 companies in the AEX. Of which over half are shit. And that’s being soft. If you’re strict maybe 3 companies are worth looking at",
      "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lidj9rv/",
      "created": 1723797085,
      "depth": 0,
      "replies": [
        {
          "id": "liecswr",
          "score": 7,
          "body": "Yep. You need to pick stocks with Europe. The ETFs are full of crap",
          "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/liecswr/",
          "created": 1723812704,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lifclhm",
          "score": 1,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lifclhm/",
          "created": 1723824674,
          "depth": 1,
          "replies": [
            {
              "id": "lioxs11",
              "score": 1,
              "body": "Europe overall has very high private ownership of companies. Most of Germany’s not unsubstantial economy consists of non-public companies.",
              "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lioxs11/",
              "created": 1723972688,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lifd8cx",
          "score": 1,
          "body": "An Euro Stoxx 50 ETF is maybe more diversified than just the AEX/DAX/CAC/FTSE/etc ?",
          "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lifd8cx/",
          "created": 1723824874,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lidivm6",
      "score": 6,
      "body": "I wouldn't worry about it. It was the Japanese carry trade unwind. That is the second time that unwind has happened in 16 years. If something happens roughly once every 16 years and it doesnt blow up you account I think your fine. \n\nJust to be clear the only thing I saw do well at all during this event was some the Vix and US bonds and I think that was mostly because some people misread what was happening and bought bonds thinking this was going to be the big plunge into a recession. The VIX was just what it was and unless you had calls already in place there really wasnt much to be done with that. \n\nSo imagine you do something to address your exposure to this event. What would that look like? I honestly am not sure there is a real solid option other than perhaps to always have puts on the currency that is doing the carry trade. That would be a losing position for many years and then take off for a short time. Would that short burst of gains overcome the losses sustained for all those years? I doubt it.",
      "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lidivm6/",
      "created": 1723796822,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lidfaut",
      "score": 17,
      "body": "When the US goes down, the world goes down with it (something something Colosseum falling Rome falling).\n\nCountry diversification isn't about short term losses, but about long term differences. See, well, every single US index crash in history, they always spread throughout the world. The idea is rather that if one country underperforms over a prolonged period of time, country diversification can spread that risk.\n\nPersonally I've been moving more and more money from Europe to the US. I started EU-centric, only using US assets as diversification, but man European companies are shit. A US recession hits European companies hard anyway and European recessions barely bother US companies ¯\\\\\\_(ツ)\\_/¯ Country diversification be damned. Not saying I don't own any other country's assets, but I don't own them for the sake of diversification anymore.\n\nI don't know if Youtube links get deleted on here (I think they do), so you'll have to look it up yourself: \"International Diversification\" by Ben Felix is a good video on the topic that doesn't share my own strategy.",
      "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lidfaut/",
      "created": 1723794428,
      "depth": 0,
      "replies": [
        {
          "id": "lidh8vd",
          "score": 15,
          "body": "It takes experience living in the EU to understand why investing in EU securities is a tough cookie.",
          "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lidh8vd/",
          "created": 1723795735,
          "depth": 1,
          "replies": [
            {
              "id": "liec8tl",
              "score": 5,
              "body": "EU has some great companies, but there’s a lot of crap pulling the ETFs down. I’m someone who mostly buys ETFs, but when it comes to the EU, I only invest in specific companies. Currently in ASML, RPI, and UMG to name a few",
              "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/liec8tl/",
              "created": 1723812485,
              "depth": 2,
              "replies": [
                {
                  "id": "lihsx3u",
                  "score": 2,
                  "body": "Exactly why a lot of folks, myself included, strongly prefer active management when it comes to international markets. It’s worth the difference in ER.",
                  "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lihsx3u/",
                  "created": 1723854650,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lihwr2o",
                      "score": 1,
                      "body": "Any specific funds you’d like to shout out?",
                      "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lihwr2o/",
                      "created": 1723856213,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "linum1p",
                          "score": 1,
                          "body": "What exactly are you looking for? Dodge & Cox, MFS, American Funds, DFA, Avantis, etc all have solid funds depending on what style you want.",
                          "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/linum1p/",
                          "created": 1723950092,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lids2dn",
          "score": 4,
          "body": "Honestly this is what a lot of people just don’t understand. Everyone says “I invest in the world not just the US”, which is fine for sure, but if the US crashes, so does the rest of the world. Bottom line, if they go down, we are in serious trouble",
          "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lids2dn/",
          "created": 1723802831,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lidjim3",
          "score": 3,
          "body": "Agree, I cut Europe out of my portfolio too in favor for US. Diversifying only makes sense to a certain point, but the main goal of investing remains to have returns on investment, not necessarily being invested in everything.",
          "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lidjim3/",
          "created": 1723797249,
          "depth": 1,
          "replies": [
            {
              "id": "lidsjsw",
              "score": 1,
              "body": "Aex is 2% up this week. Idk what op is talking about",
              "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lidsjsw/",
              "created": 1723803125,
              "depth": 2,
              "replies": [
                {
                  "id": "liduxty",
                  "score": 1,
                  "body": "The dip of early august (around 5th august)",
                  "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/liduxty/",
                  "created": 1723804526,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lidv2ml",
                      "score": 1,
                      "body": "Because there was huge panic and it seems there was going to be a global recession. Global.",
                      "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lidv2ml/",
                      "created": 1723804600,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lidvu3x",
                          "score": 1,
                          "body": "That's why I typed \"since recovered\".",
                          "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lidvu3x/",
                          "created": 1723805022,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lidvbgb",
      "score": 2,
      "body": "I just bet on the s/p 500 and hedge with an hysa at this point. Guaranteed returns are guaranteed and 5.3% is a pretty good rate.",
      "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lidvbgb/",
      "created": 1723804736,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lie4rto",
      "score": 2,
      "body": "AEX seems moved by the recent AI hype - ASML made a big component on it",
      "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lie4rto/",
      "created": 1723809368,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lifl0y1",
      "score": 2,
      "body": "I really think the world dip is this yen carry trading that has been happening for a while and due to the yen crashing and subsequent rate increase made all these big hedge funds wealth managers  forced to close many over leverage positions around the world and moving money around causing the mass temporary dip…. But again if you have more money on the side it was a good time to deploy a little of it since the market retraced itself by like 3 months… I think even bonds and equity has correlations because money is finite and big funds will move money  around if they think they have an edge… which itself will create a self fulfilling prophecy… and no one is immune to raising interest rates…",
      "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lifl0y1/",
      "created": 1723827314,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lidgrq8",
      "score": 4,
      "body": "Diversification from US assumes that you are betting against Uncle Sam, as you except American capital to magically stay away from good investment opportunities.",
      "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lidgrq8/",
      "created": 1723795418,
      "depth": 0,
      "replies": [
        {
          "id": "lidh2y8",
          "score": 2,
          "body": "The reason to diversity across countries is to not limit your exposure to good companies based on geography, and not to hedge against the US (sorry for the double negative).",
          "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lidh2y8/",
          "created": 1723795628,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lidnujy",
      "score": 1,
      "body": ">Should I diversify my stocks? Or leave them and don't think to much of it?\n\nIn terms of the stock market by owning broad-market global ETFs you're already very diversified.\n\nIn general terms, you're not diversified because you're invested in only one asset class. Bonds, real estate, gold, etc.",
      "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lidnujy/",
      "created": 1723800122,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lie441w",
      "score": 1,
      "body": "Why are you so concerned about the volatility of a dip? You are diversified and will get the average return of the world market over a longterm timeframe",
      "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lie441w/",
      "created": 1723809077,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lie61f9",
      "score": 1,
      "body": "Today you learned stocks are correlated asset's",
      "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lie61f9/",
      "created": 1723809920,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liehwja",
      "score": 1,
      "body": "Are you Dutch? If so basically MSCI world is something like s&p500 + euro/usd exchange rate. In the recent past this has worked in favor of reducing volatility for MSCI world. Regional indices are also correlated, but volatility can be still higher because they are usually smaller, with fewer companies.",
      "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/liehwja/",
      "created": 1723814616,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liev7qt",
      "score": 1,
      "body": "I do a ladder approach and always make sure I have some cash if I have to withdraw due to min withdrawal rules in retirement that way it’s no panic things always seem to recover",
      "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/liev7qt/",
      "created": 1723819176,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lijk31q",
      "score": 1,
      "body": "Unfortunately there are global panics in the market which can cause downswings across almost all assets.\n\nTLT is a good hedge. It went up significantly during the recent panic.",
      "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lijk31q/",
      "created": 1723888463,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liejgpd",
      "score": 0,
      "body": "check out the thread on [bogleheads.com](https://bogleheads.com) about US vs Int'l, theres a lot of excellent discuss and pros and cons to both arguments. one of them is the fact that Int'l markets have become extremely correlated to US markets the last 20 years, where as in the past they were much farther apart. Also our world economies are very connected now, I think something like half of all revenue in the SP500 is from overseas.",
      "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/liejgpd/",
      "created": 1723815182,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lidrja2",
      "score": -6,
      "body": "Gold is definitely an inverse of s&p",
      "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lidrja2/",
      "created": 1723802505,
      "depth": 0,
      "replies": [
        {
          "id": "lidthph",
          "score": 4,
          "body": "No it isn’t.",
          "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lidthph/",
          "created": 1723803691,
          "depth": 1,
          "replies": [
            {
              "id": "lidtqjq",
              "score": -6,
              "body": "Ok stay poor",
              "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lidtqjq/",
              "created": 1723803838,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lie6g74",
          "score": 1,
          "body": "It's not an inverse, but there is a low correlation. For it to be inverse it would frequently do bad when stocks do good and vice versa. It's much more random than that. Bonds are more inversely correlated to stocks.",
          "permalink": "/r/stocks/comments/1etirjc/worldwide_markets_all_showing_the_most_recent_dip/lie6g74/",
          "created": 1723810096,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}