{
  "title": "ASTS Due Diligence and inevitable dilution",
  "score": 120,
  "selftext": "ASTS is the stock taking the market by storm recently, headlined by its nearly 1,000% return in the past 3 months, the stock has gone parabolic. Investors are now claiming the stock will be reaching triple digits here soon as its meteoric rise continues.\n\nBut the question remains… What is special/significant about AST SpaceMobile?\n\nSpaceMobile is seen as the “competitor” to Elon’s Starlink. But investors are clamoring over ASTS claiming it “has no rivals and dominates the space.”\n\nSo how many satellites does ASTS have in space?\n\nZERO, with plans to launch their first sometime in the month of September.\n\nStarlinkl has over 5,000 satellites already in space that are fully operational and being used by consumers.\n\n \n\nThe simple comparison here is we already have a “star” in the industry being Starlink, however they are a private company still. So investors are flocking to a sub par competitor only because they are a public company.\n\n \n\nSurely ASTS has a super healthy balance sheet and impressive valuation numbers.\n\nTrading at\n\n3,393X price to sales\n\n32.7x price to book\n\nN/A price to earnings, (no profitability)\n\nROE -103%\n\nROA - -30%\n\n \n\nWell surely their earnings report was good and there’s a clear path to profitability… Right??\n\nhttps://preview.redd.it/bmj7enu7d2jd1.png?width=975&format=png&auto=webp&s=4d1919e53ad6a5e7adef72ff386fa161413fef87\n\nThe adjusted EPS missed by over 2x with a staggering loss of $0.51 per share, or a $77,000,000 loss for the quarter.\n\n \n\nFuture Dilution: just my 2 cents\n\nASTS has announced they plan to spend around $115,000,000 to launch their first 5 satellites. They have also stated they will need around 60 satellites to provide service from coast to coast across the U.S. Assuming all costs remain the same to launch these satellites this would require $1,380,000,000 (1.38 billion) to launch all 60. Now ASTS only has 285 million on hand currently, and are operating at a very steep loss. Now how is ASTS going to acquire all this additional capital to fund their launches of these satellites. DILUTION.\n\nASTS will have a dilution fairly soon to raise further capital and will leave retail investors holding heavy bags.\n\n \n\nFuture:\n\nI do believe in the far future (2030 and beyond) ASTS may have increasing potential, if they find ways to avoid drowning in debt with the costs of launching new satellites and maintaining the network. However, there is a reason Verizon, AT&T, and T-Mobile all have over 140 billion in debt. Telecommunication is a very low margin business that is very capital intensive.\n\nIn the meantime investors need to brace for dilution and hardship watching gains evaporate as ASTS raises capital to launch more satellites and maintain the business.",
  "link_flair_text": "DD",
  "id": "1etva8u",
  "num_comments": 495,
  "created_utc": 1723830561,
  "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/",
  "comments": [
    {
      "id": "lifvcws",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 months ago\n**Total Comments** | 47 | **Previous Best DD** | \n**Account Age** | 3 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifvcws/",
      "created": 1723830564,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lig2nzp",
      "score": 389,
      "body": "\n> SpaceMobile is seen as the “competitor” to Elon’s Starlink. But investors are clamoring over ASTS claiming it “has no rivals and dominates the space.”\n\nNo, it is targeting the D2C market, which Starlink and TMobile only began targeting AFTER they realized AST was indeed going to succeed in launching their test satellite. The timing and nature of the announcement were telling. \n\nSo rather, Starlink is attempting to compete with AST. In the future, it is possible AST eats at Starlink's core market and viceversa, but that's down the road. \n\n> So how many satellites does ASTS have in space?\n\n> ZERO, with plans to launch their first sometime in the month of September.\n\nThey have BW3. Which is a test satellite, I admit. But it did earn revenue from a gov contract. It is also the sane size as the current production satellites, but with 10x less processing bandwidth. It will assist in providing commercial services, though. But to say they have no satelllites is misleading because it implies we don't even know if their current model will work. It will.\n\n> Starlinkl has over 5,000 satellites already in space that are fully operational and being used by consumers.\n\nYes, for stationary wifi. Not cellular service. If you're thesis were true, Comcast would've bankrupted Verizon and AT&T. But we all know that wasn't what happened.\n\nEven if you account for the D2C Starlink V2 minis, there are only around 100 with maybe 20 beams each? AST sats have 5600 each. They may only be launching 5 sats, but sat count ignores sat capabilities.\n\n> ASTS will have a dilution fairly soon to raise further capital and will leave retail investors holding heavy bags.\n\nThe stock skyrocketed specifically because they stated no more dilution in 2024 and probably none in 2025 as they target prepayments and ExIm financing. Currently it costs about 20m per sat, launch included. Prepayments from Voda, Verizon, and At&t now average 4m, 20m, and 5m per sat respectively give or take conditional on successful launch, operation, and FCC approval, all of which are imminent. And that is only 3 of about 40 MNO partners contributing. Currently, if they did 50/50 debt/prepayment, each MNO would only have to prepay 400k per sat if they take 2 years to build with Opex at 120m per year.\n\nAnd why would MNO want to pay for the sats? Because that's a small price to pay for global coverage, no dead zones, reduced tower costs, improved service, emergency service for disasters, especially when you get half the ARPU. The list goes on.\n\nSorry, but your estimation is ignorant of the reality of the situation. The price will vary a lot over the next two years, but at the end of the day, they now have a service that works, a product to launch, and 40 of the largest telecoms on Earth who want them to succeed, nevermind the US military.\n\nEdit: just a note on my math: (85 sats*20m/sat)+(120m opex*3)=2.060B/40 mno/85 sats/2=300k/sat. I forgot how my napkin math earlier worked out to 400k, I had a reason, but didn't write it down.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig2nzp/",
      "created": 1723832887,
      "depth": 0,
      "replies": [
        {
          "id": "ligba2w",
          "score": 224,
          "body": "OP missed the boat and is boat hurt",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligba2w/",
          "created": 1723835655,
          "depth": 1,
          "replies": [
            {
              "id": "ligptn6",
              "score": 52,
              "body": "he has puts obviously",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligptn6/",
              "created": 1723840392,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lii5q5d",
              "score": 14,
              "body": "Considering everything going on with this stock I think it has the potential to be >100/share. So he didn't miss the boat, he definitely just wants to feel smarter than the market",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lii5q5d/",
              "created": 1723859828,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ligpisd",
              "score": 26,
              "body": "I mean its still at $31/share. Plenty of people can still jump on this boat. Look at NVDA. In early 2023 it was trading (taking into account the split) at about $15 per share. Everyone who avoided it because \"it can't possibly keep going up\". Yet it at $124/share now. The issue I see is that options are really expensive and people are upset because their gambling is not exponentially more expensive.",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligpisd/",
              "created": 1723840294,
              "depth": 2,
              "replies": [
                {
                  "id": "lih2m3k",
                  "score": 30,
                  "body": "I promptly sold 30k worth of nvidia that my dad gave me several years ago when it was 130 a share.  I figured it already went up so much how much more could it go?  I watched in horror as the stock skyrocketed and kept mad thinking I fucked up.  All I had to do was buy back in…. Which I finally did right before it peaked like a true regard.  I had so many opportunities to buy that I talked myself out of.",
                  "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lih2m3k/",
                  "created": 1723844657,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lihuws7",
                      "score": 15,
                      "body": "Classic textbook fomo",
                      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lihuws7/",
                      "created": 1723855460,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ligpx73",
                  "score": 10,
                  "body": "Yeah I agree, just historically if something pumps this much it might be a minute before anymore growth comes.",
                  "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligpx73/",
                  "created": 1723840424,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ligt0tc",
                      "score": 5,
                      "body": "That pause will happen during testing, after the launch, I think.",
                      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligt0tc/",
                      "created": 1723841418,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ligqgsf",
                      "score": 10,
                      "body": "which to me is fine since I focus on long term growth. Its the options people who are really upset.",
                      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligqgsf/",
                      "created": 1723840602,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ligt4jp",
                          "score": 5,
                          "body": "Not if one holds LEAPS. (Or for that matter shorter dated contracts.)",
                          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligt4jp/",
                          "created": 1723841452,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ligsuak",
                  "score": 4,
                  "body": "Agreed.",
                  "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligsuak/",
                  "created": 1723841359,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ligeuov",
          "score": 25,
          "body": "This lmao! It’s amazing how many people don’t know the difference jn tech. Starlink was more about internet at first not d2c. Now they are playing catchup and want to boost power lol.",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligeuov/",
          "created": 1723836826,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lihmi20",
          "score": 9,
          "body": "And this is the reason I believe in ASTS. Not because of simple replies to legitimate concerns like \"MOASS tomorrow\" or faith related bullshit. There is proper counter argument that is sound and logical.\n\nIf anything yesterday's pump and dump was the reflection of FOMO and WSB. The growth after every favorable news is real.",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lihmi20/",
          "created": 1723852098,
          "depth": 1,
          "replies": [
            {
              "id": "lii6im4",
              "score": 6,
              "body": "I think that was due to institutions buying on new ratings, retail, and shorts covering. We have a lot of real longs, not a lot of swing trading. Also, we are really corelating to SPY. I think algos are moving a lot of shares, too.",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lii6im4/",
              "created": 1723860152,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ligg6wh",
          "score": 33,
          "body": "Thank you, I got so angry reading this post. OP got all the facts wrong. No idea why he called hist post \"due diligence\".",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligg6wh/",
          "created": 1723837263,
          "depth": 1,
          "replies": [
            {
              "id": "lii3gq8",
              "score": 2,
              "body": "\"Nonsense I made up because I was too lazy to read the Wikipedia page.\"",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lii3gq8/",
              "created": 1723858916,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lihs7fl",
          "score": 8,
          "body": "Came here to respond something similar. Will only add that OP is probably revenge trading after getting burned on his puts and now desperately trying to create FUD like a 🤡🐻",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lihs7fl/",
          "created": 1723854361,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ligaooz",
          "score": 34,
          "body": "He says telecoms is incredibly low margin which is correct for the legacy companies. AST is projected to have ~95% margins due to incredibly low opex. It costs very little to run sats.",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligaooz/",
          "created": 1723835459,
          "depth": 1,
          "replies": [
            {
              "id": "lih3jym",
              "score": 18,
              "body": "I do not believe for a second that they will have close to 95% margins. I think its a cool company but let's try to be realistic here.",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lih3jym/",
              "created": 1723844991,
              "depth": 2,
              "replies": [
                {
                  "id": "lii79ad",
                  "score": 6,
                  "body": "There is significant DD quantifying why this is the case. You can have a hard time believing it, but that estimate is real and based on the data.",
                  "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lii79ad/",
                  "created": 1723860459,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lih0frc",
          "score": 12,
          "body": "Thank you for typing this out. OP has no idea what his talking about or just lost his shorts.",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lih0frc/",
          "created": 1723843900,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lih03rt",
          "score": 6,
          "body": "u/disastrous_mess8820 care to respond to all of these points?",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lih03rt/",
          "created": 1723843785,
          "depth": 1,
          "replies": [
            {
              "id": "lii3dsu",
              "score": 3,
              "body": "That would require him having a clue. ",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lii3dsu/",
              "created": 1723858884,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lii6s0t",
          "score": 3,
          "body": "Well said. I've been doing deep dives into information about this company and everything you stated is exactly what I would have said if I had the time to care about OP's statements enough! Glad you said it. I hope people listen to your statements!",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lii6s0t/",
          "created": 1723860259,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lig2o1a",
          "score": 6,
          "body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig2o1a/",
          "created": 1723832887,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ligga69",
          "score": 4,
          "body": "> The stock skyrocketed specifically because they stated no more dilution in 2024 and probably none in 2025 as they target prepayments and ExIm financing.\n\n\nCan I get a source on this? Not saying u are wrong just curious for myself",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligga69/",
          "created": 1723837292,
          "depth": 1,
          "replies": [
            {
              "id": "ligt1ck",
              "score": 11,
              "body": "Last two EC. Just read the tranripts. They aren't in ExIm yet, but it will  happen as revenues increase.\n\nI think the other thing to keep in mind is that a large chunk of their sat costs are supposedly launch costs. Looking at 1500 kg/sat and about $3800/kg for F9, you get about half of the cost being launch costs. When/If Starship comes that will cut margins almost in half. Which is nuts.\n\nAlso, they do cost 20m per sat, but if only 10m to build, they can build a lot more with their current cash than everyone thinks. Im pretty sure they have 280+$x raised using ATM in July (so maybe 30m?)+50m debt+120m warrants=480m. They COULD build (480m-120m annual opex-120m runway cushion)/10m/sat=24 sats next year if they can get to 2/mo cadence. Then they only need 15 more sats for continuous coverage in Norther ln hemisphere. Just building them gives leverage to partners for financing launch costs. It's much better to go to partners/debt markets with \"hey we have 25 of these money printers on the ground, but they belong in space\" than \"hey we need halp to build them\". Especially if BBB2 works as intended/proves market.\n\nAnd that brings me to the most important part. The MAIN issue this company had was executing production. Sure, they cost 115m for 5 sats, but it took two years, so that's 240m opex. It shouldve been 120m. They had issues with supply chain and also did a surprise rework of their antennae elements. That is how we wound up in the 2's. But that's likely, with a high degree of certainty, behind us. They still have more to prove with manufacturing, but their current targets are 17 for 2025. \n\n\nI think we will see 25 launched by 2026 end given current pacing. That sounds pessimistic, but it scales with their cadence record, AND  having intermittent coverage 50% of the time whereas before you had it 0% is actually huge to the point a lot of customers may not notice that much, especially if the service keeps getting better over time.",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligt1ck/",
              "created": 1723841423,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ligfnpl",
      "score": 52,
      "body": "Found the bag holder who bought Puts",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligfnpl/",
      "created": 1723837089,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lifwi8c",
      "score": 464,
      "body": "Just say u missed the ass and tits train man.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifwi8c/",
      "created": 1723830925,
      "depth": 0,
      "replies": [
        {
          "id": "lifxtbt",
          "score": 108,
          "body": "He's not wrong. This will be expensive to fully implement, and they could fund this via share dilution at a \\~1,200% greater return than they could have 2 months ago. They'd be crazy not to take advantage if they need the funds. \n\n  \nI don't think its going back to $2, but it almost certainly is not staying at $31. I'd be very cautious about dumping your portfolio into it at this price.",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifxtbt/",
          "created": 1723831336,
          "depth": 1,
          "replies": [
            {
              "id": "liggxww",
              "score": 30,
              "body": "They promised that there would be no dilution in 2024 and they repeated that promise at the earnings. Since they need to rebuild shareholder trust, they won't do it.\n\nBesides, they have plenty of other financing ways, and insiders own the majority of the stock.",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/liggxww/",
              "created": 1723837504,
              "depth": 2,
              "replies": [
                {
                  "id": "lij3a3h",
                  "score": 3,
                  "body": "Personally if I was a shareholder, Id WANT them to do a dillution at current prices REGARDLESS. yes. they stated it wasn't necessary yet, and weren't planning on it this year. But not taking advantage of a $31 share price would be ridiculous.\n\nAs, if I was a shareholder, like we all know, 1-2 more dillutions were required in the future to continue long term funding. If these dillutions could be condensed into a single, SMALLER dillution due to the 1200% share price gain. IM FLOORED!\n\nThis wouldn't be springing something on investors we didn't know was coming, and actually ADDS value to the stock long term as investors had already anticipated dillutions in their value analysis, and now the dillution would be LESS than previously anticipated.\n\n  \n(not an investor but ngl I like the company and their leadership is brilliant)",
                  "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lij3a3h/",
                  "created": 1723877032,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ligi6y8",
                  "score": 21,
                  "body": "lol look guys! They promised  they won’t do it!",
                  "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligi6y8/",
                  "created": 1723837908,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ligikb5",
                      "score": 47,
                      "body": "You must have no inkling whatsoever how business and the stockmarkets work. Poor baby. This is not the government, public statements do matter.",
                      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligikb5/",
                      "created": 1723838026,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lij3gcs",
                          "score": 3,
                          "body": "they didn't promise. They just stated they didn't anticipate needing to do any more offerings for the remainder of 2024l, no guarantees.",
                          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lij3gcs/",
                          "created": 1723877143,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "ligqra0",
                          "score": 4,
                          "body": "Always maintain a healthy dose of professional scepticism… they most likely won’t dilute, but you can’t say that with a 100% certainty.\n\nIf push come to shove they will make an equity offering and a prudent investor needs to have a plan in place for any such eventuality.",
                          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligqra0/",
                          "created": 1723840696,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lihjs3c",
                      "score": 2,
                      "body": "That's some righteous DD there.",
                      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lihjs3c/",
                      "created": 1723851059,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "liip6zg",
                  "score": 2,
                  "body": "You should be more careful with wording. “No plans to dilute” does not mean they’re legally bound to not dilute",
                  "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/liip6zg/",
                  "created": 1723868780,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ligehbt",
              "score": 13,
              "body": "Dude their future satellites are getting cheaper as they start getting revenue. It’s actually better for them lol. I’ll see it here when it’s at 100 lmao. Just say like me you want it to dip so you can buy more. No need to dance around it. 🤣",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligehbt/",
              "created": 1723836703,
              "depth": 2,
              "replies": [
                {
                  "id": "ligg0gd",
                  "score": 7,
                  "body": "RemindMe! 1 year",
                  "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligg0gd/",
                  "created": 1723837204,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ligk9nc",
              "score": 6,
              "body": "The CEO already declared that there would be no dilution in 2024. \n\nIt was stated in the Q2 earnings call",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligk9nc/",
              "created": 1723838581,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ligb414",
              "score": 15,
              "body": "i was cautious at 10 and did not hop on, thought that it is overvalued going so quickly from 2 to 10, now i am 3x more cautious...",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligb414/",
              "created": 1723835600,
              "depth": 2,
              "replies": [
                {
                  "id": "lii0vyj",
                  "score": 4,
                  "body": "If you believe the long term thesis, and aren't trying to daytrade this, this entry is still fine with major upside for long term holders. If they execute, this is going to be something like $300/share minimum in 2027 and that would be with a p/e ratio under 20 (and that's pretty conservative). Deutsch Banks target is $627/share in 2027...",
                  "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lii0vyj/",
                  "created": 1723857881,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lihfc9j",
                  "score": 10,
                  "body": "Gonna be 3x wrong lol. Get rekt gey bear",
                  "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lihfc9j/",
                  "created": 1723849365,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lij1zhi",
                      "score": 5,
                      "body": "what a regard, dont tell someone they are gay bear if they consider an entry too risky\n\ntell that to short sellers and people who actively bet bearishly on the stock",
                      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lij1zhi/",
                      "created": 1723876205,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ligbr6a",
          "score": 6,
          "body": "I love ass and tits. I can't belive I missed that. Oh well, I will keep my eyes on this sub.",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligbr6a/",
          "created": 1723835812,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lifwyny",
          "score": 4,
          "body": "I most certainly did! But I have no problem riding the train right back down to the bottom.",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifwyny/",
          "created": 1723831068,
          "depth": 1,
          "replies": [
            {
              "id": "ligrxkx",
              "score": 11,
              "body": "Ghey bear alert, 1st stage is always denial.. bargaining will be when it gets entertaining",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligrxkx/",
              "created": 1723841073,
              "depth": 2,
              "replies": [
                {
                  "id": "lihfj0c",
                  "score": 3,
                  "body": "Always funny that the bears forget stonks only go up",
                  "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lihfj0c/",
                  "created": 1723849438,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lig852u",
              "score": 10,
              "body": "I just bought today at $28 and sold just a little ago at $31.50. Over 10% gain in a few hrs ain't bad. \n\n\nLook, I agree with you, the financials don't look good, and I doubt it's going to maintain this price for long, but there's very clear momentum so why not just take advantage of it. ",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig852u/",
              "created": 1723834633,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lig6q6f",
      "score": 55,
      "body": "I feel like maybe the OP did not see the in depth technical analysis of the technology being put to use in BB1 (and the future models) in comparison to Starlink sats. This was something showing how much more directed (angle of the dangle/beam?) AST sats will be vs Starlink being more wide and thus less throughput.\n\nThere are a lot of factors into AST becoming quite profitable. I personally can see the stock hitting 100+, although I was originally thinking 2030 onwards. I may think differently if this ~30 price holds for a while.\n\n\nTL:DR. There are highly technical data analysis of the tech AST sats use and directly compares the tech from Starlink. Search it up. Make your own informed decision on how off this post really is.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig6q6f/",
      "created": 1723834175,
      "depth": 0,
      "replies": [
        {
          "id": "lighqfp",
          "score": 19,
          "body": "100 by 2030 is way too easy. They’ll be making a lot more money by then",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lighqfp/",
          "created": 1723837762,
          "depth": 1,
          "replies": [
            {
              "id": "lih10x0",
              "score": 5,
              "body": "Add a zero and it sounds about right",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lih10x0/",
              "created": 1723844105,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lig5ans",
      "score": 132,
      "body": "Stopped reading where you said they have zero satellites up.\n\nThey even announced two new government contracts on the back of the one satellite they already have up.\n\nEnjoy Elon’s dick mate.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig5ans/",
      "created": 1723833718,
      "depth": 0,
      "replies": [
        {
          "id": "ligcart",
          "score": 63,
          "body": "So much inaccurate info. So weird to make such a long post and not research the basics. ",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligcart/",
          "created": 1723835988,
          "depth": 1,
          "replies": [
            {
              "id": "ligcfjg",
              "score": 47,
              "body": "Weird? No, no my friend. This is called desperation that you’re going to get margin called after you entered a short position.",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligcfjg/",
              "created": 1723836032,
              "depth": 2,
              "replies": [
                {
                  "id": "ligi6g7",
                  "score": 14,
                  "body": "This man knows what's up",
                  "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligi6g7/",
                  "created": 1723837904,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lig3k12",
      "score": 54,
      "body": "This post gives off \"I missed the boat\" energy",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig3k12/",
      "created": 1723833168,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liggxlr",
      "score": 42,
      "body": "Sometimes I think WSB has great takes and then posts like this remind me any uninformed regard can make one",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/liggxlr/",
      "created": 1723837501,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lifxt5e",
      "score": 79,
      "body": "This is riddled with innacurate info. Without digging too deep, the first 5 sats will provide \"coast to coast\" coverage. It just will not be continuous. They need 20 sats, not 60 to provide continuous coverage in the continental US.\n\nAlso comparison to starlink's existing sats is kind of silly because they serve different markets. Starlink's core business is coverage to ground units, not existing cell phones. There is no overlap. Starlink is trying, with much difficulty, to break into d2d market, but you cannot use their existing, non-d2d sat numbers as having any bearing on that effort.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifxt5e/",
      "created": 1723831335,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lifyulm",
      "score": 30,
      "body": "In their earnings call they stated they do not want to use dilution to raise capital and instead use prepaid agreements with partners like AT&T etc to be their primary source of capital generation. They stated diluting the stock will be a disservice to shareholders and so they don’t plan on doing so.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifyulm/",
      "created": 1723831666,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lig46ed",
      "score": 27,
      "body": "Call roaring kitty brother.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig46ed/",
      "created": 1723833363,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligsp0t",
      "score": 21,
      "body": "Starlink: Regenerative architecture, onboard 4G LTE eNB low area spectral efficiency, SISO no US regulatory OK. Problems with interference. Weak narrow midband SISO. Frequent handovers, low orbital lifetime, many sats. Adopted / patch on 4G tech onto an architecture built for VSAT internet. Few MNO partners.\n\nAST: Transparent architecture, terrestrial Nokia 5G gNB, medium area spectral efficiency, regulatory OK. Many patents and superior tech assures no problem with interference. Wide swaths of partner spectrum High penetration lowband, later also midband and c-band MIMO, few handovers, few sats, high orbital lifetime. Built from first pribciples for 3GPO 5G and 6G. Many MNO partners (50, with 3 billion subs)",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligsp0t/",
      "created": 1723841312,
      "depth": 0,
      "replies": [
        {
          "id": "lihu2ak",
          "score": 3,
          "body": "🚀🚀🚀",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lihu2ak/",
          "created": 1723855115,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lifx6nq",
      "score": 52,
      "body": "Starlink is not competitor to ASTS. Complete different type of service. Don't compare apples to peanuts.\n\nNo dilution this year.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifx6nq/",
      "created": 1723831138,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligikvc",
      "score": 8,
      "body": "Oh Lord, valuing a pre revenue stock with PE ratios.....\n\nSpaceX has 5000 satelites, but not for direct to cell. \nSpaceX just wants to get the FCC to weaken their rules for their direct to cell satellites, because their tech is shit and they arent able to get it done within the rules.\n\nASTS has done it within the rules, FCC granted an Experimental License.\n\nAnd yes, you are betting on future income here with ASTS. \nWhen their satellites are up there, they have minimal costs for their WORLDWIDE service. Their profit margin is expected to be 90+%.\n\nThey have MNOs with partners, that have 3 billion clients.\n\nhttps://www.reddit.com/r/ASTSpaceMobile/s/RRqhliPvut\n\nSo how much is it worth to have connection everywhere, on the sea, even in an airplane. Lets say only 200 million of the clients are willing to pay 5 usd a month, and ASTS gets 50%, then thats 500 million revenue per month and with their profit margin lets say just 250 million profit PER MONTH. So lets say 3 billion profit a year and a PE Ratio of 20, thats 60 billion market cap or 250-300 stock price. \n\nAh, and we havent even talked aboud DoD contracts. ASTS already got a small DoD contract (900k), but its also just a test Satellite up there right now. \n\n\nDilution: wont be needed. If a MoU wants a commercial Agreement, they need to make prepayments like AT&T did. Together with the revenue comming 2025 they have enough cash to get the next 20-30 sattelites up there and then they will be cash flow positive.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligikvc/",
      "created": 1723838031,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lifz21l",
      "score": 38,
      "body": "\"investors claim of triple digits soon\" \n\nYeah, a minority of mostly delusional investors. \n\nThis rise can be attributed to months of great news, huge de-risking, MNO agreements, delivery of satellites and a launch schedulednfor early September. \n\nThis valuation is basically going off the potential, not the present, valuation. Is it a bit high? Maybe. It might start settling after launch, once the dust has settled you could see a major pull back as people take profits, but nobody trades based off what a PRE REVENUE COMPANY is worth today, its the potential. \n\nThat being said, this is very uninformed DD. Starlink is a competitor, but to say they have 5000 satellites, as if they are all capable of D2D, is misleading. They are in a stalemate and unless they convince the FCC to lax their permitted interference levels, they won't be launching their service anytime soon. This can go either way and we will have to see what the verdict is.\n\nASTS will be worth $100/share in 2 years, probably sooner. Assuming no disasters with launch and unfurling.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifz21l/",
      "created": 1723831733,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likc8iz",
      "score": 7,
      "body": "https://preview.redd.it/0x1mrpn8c8jd1.png?width=279&format=png&auto=webp&s=ca4e6400229afd70df642204afa2878d85e5c1ef",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/likc8iz/",
      "created": 1723902849,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligb7bg",
      "score": 16,
      "body": "Tell me you’ve done 5 minutes of half assed DD without telling me you’ve done 5 minutes of half assed DD. Just straight up factually incorrect bullshit all throughout this.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligb7bg/",
      "created": 1723835629,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lig07oj",
      "score": 18,
      "body": "A classic 5min DD research saying ASTS is a perfect short. If you spent a little more time like maybe 15mins you would realize this long opportunity is absolutely massive even at these levels.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig07oj/",
      "created": 1723832105,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liiypu9",
      "score": 4,
      "body": "It’s just hype. The deal with VZ was the catalyst for this. People go after the rabbit. Once they start to notice that it is time to leave, SP will drop to the 12-13. Triple digits in 2030…maybe…but then you can find many other companies. This was like going to the moon and of course, it’s unrealistic not based on fundamentals. You have profit loss when you sell…at the moment you are at the same point. You just need to convince someone to buy your good stuff.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/liiypu9/",
      "created": 1723874198,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lifx1al",
      "score": 24,
      "body": "All that DD and no position? Boo this man ![img](emote|t5_2th52|27421)",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifx1al/",
      "created": 1723831091,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lifxghj",
      "score": 11,
      "body": "They might dilute next year but they won't for the rest of 2024.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifxghj/",
      "created": 1723831223,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liggiz8",
      "score": 7,
      "body": "\"Due diligence\" whar a joke. A hater making a post rife with inaccuracies which shows he doesn't know the first thing about the actual stock, but wants you to ditch it because he bought puts.\n\nI'm too tired right now, but if anyone wants the inaccuracies, I'll be happy to sum them up tomorrow.\n\nAs for the stock itself, don't listen to trolls like OP trying to manipulate you, and don't listen to the true ASTS believers either. Just do your own due dilligence and act on that, dont be a sheep.\n\nAnd for the record, Starlink is a flaming pile of poo.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/liggiz8/",
      "created": 1723837371,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lig23qy",
      "score": 5,
      "body": "[removed]",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig23qy/",
      "created": 1723832708,
      "depth": 0,
      "replies": [
        {
          "id": "lig8eob",
          "score": 4,
          "body": "Two.  Don't forget about BW1",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig8eob/",
          "created": 1723834718,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lig9fsl",
          "score": 3,
          "body": "He's a regard who has no idea what he's talking about",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig9fsl/",
          "created": 1723835052,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lifypgy",
      "score": 11,
      "body": "ASTS is not touching 15 again let alone 20 man. I would sell those puts while you still can ![img](emote|t5_2th52|31226)",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifypgy/",
      "created": 1723831621,
      "depth": 0,
      "replies": [
        {
          "id": "ligxznn",
          "score": 4,
          "body": "Let me keep selling them to him. His premium is funding my gains.",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligxznn/",
          "created": 1723843059,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lii87cp",
      "score": 3,
      "body": "WSB sentiment is to buy, inverse time?",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lii87cp/",
      "created": 1723860860,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liidwho",
      "score": 3,
      "body": "You’re correct on this.  Post must be too long for people to understand… or perhaps it’s Reddit and people are too … to understand",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/liidwho/",
      "created": 1723863338,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lig2jkh",
      "score": 8,
      "body": "Telecommunication is a very low margin business that is very capital intensive. - That is the MOAT of ASTS tech, you only need the sats, not anything else. It scraps the towers, hence, lower CAPEX. On top of that, they have succesfully launched a test satellite so it is not that they dont know what they are doing.\n\nIf I were you, I would have waited until the stock goes higher. 15 is too low and it is not going to happen (below warrant value) and 20 is too low still but you might have a chance to get some profit.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig2jkh/",
      "created": 1723832847,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lig0rzh",
      "score": 16,
      "body": "GTFOutta here with logic, reason and ANALysis",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig0rzh/",
      "created": 1723832285,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lig904x",
      "score": 4,
      "body": "Jesus so many wrong info in here, stfu if you don't know what you're talking about, instead of writing this crap like you know anything",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig904x/",
      "created": 1723834908,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lifxudr",
      "score": 14,
      "body": "Positions: $15 Puts exp: 2/21/25 and $20 puts. Exp: 9/20/24",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifxudr/",
      "created": 1723831345,
      "depth": 0,
      "replies": [
        {
          "id": "lig994y",
          "score": 8,
          "body": "!remindme 20 september",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig994y/",
          "created": 1723834991,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lifycvk",
          "score": 17,
          "body": "GUH ![img](emote|t5_2th52|4640)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifycvk/",
          "created": 1723831509,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lifzc2y",
          "score": 13,
          "body": "100% agree with you. I would do a Call for Nov to hedge. They have a transport launch in Sept.",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifzc2y/",
          "created": 1723831823,
          "depth": 1,
          "replies": [
            {
              "id": "ligiymn",
              "score": 7,
              "body": "Please join them. I wanna laugh so hard at this",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligiymn/",
              "created": 1723838154,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lihgrvq",
          "score": 5,
          "body": "LMAOOOOOOO",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lihgrvq/",
          "created": 1723849915,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lig0ku2",
          "score": 5,
          "body": "!RemindMe 6 months",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig0ku2/",
          "created": 1723832221,
          "depth": 1,
          "replies": [
            {
              "id": "lig4u2q",
              "score": 4,
              "body": "!RemindMe 6 months",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig4u2q/",
              "created": 1723833570,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ligad67",
          "score": 7,
          "body": "Show the positions, not list them",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligad67/",
          "created": 1723835354,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lig7cms",
          "score": 3,
          "body": "!RemindMe 6 months",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig7cms/",
          "created": 1723834376,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ligecmv",
          "score": 3,
          "body": "RemindMe! 2 months\n\n  \n[Disastrous\\_Mess8820](https://www.reddit.com/user/Disastrous_Mess8820/): Positions: $15 Puts exp: 2/21/25 and $20 puts. Exp: 9/20/24",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligecmv/",
          "created": 1723836660,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lih2irm",
          "score": 2,
          "body": "!remindme 20 sep",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lih2irm/",
          "created": 1723844625,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lihuh3o",
          "score": 2,
          "body": "!remindme 20 september\n \n!remindme 21 February\n \n🤡🤡🤡🤡🤡",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lihuh3o/",
          "created": 1723855281,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lnz4uhi",
          "score": 2,
          "body": "Trading at 28$. Did you manage to pull any profit from those September puts?",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lnz4uhi/",
          "created": 1726791450,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lig149c",
          "score": 2,
          "body": "Screen shot?  I mean anyone can type some options out",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig149c/",
          "created": 1723832394,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lifw66n",
      "score": 13,
      "body": "Please tell me how SpaceX owns satellites.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifw66n/",
      "created": 1723830819,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligcufq",
      "score": 4,
      "body": "I do not agree with your reasons but i do agree with the outcome. The whole point of ASTS is that it has a patented technology for the signal to reach mobile phones without any additional equipment other than your phone as a receiver. Starlink needs additional receiver that is klunky and ugly AF. Also, the business model of ASTS is smart, they will be offering their service through already established carriers, so they dont need to \"build up\" the \"distribution\" of their product. People will just have an additional option on their already existing mobile phone bill if they want to pay extra for \"global coverage\" and that will go to ASTS. Also, you cannot value a pre-revenue company on a balance sheet data, are you dumb?\n\nThat being said. Dilution is very likely if not certain. The durability of satelites is questionable, given just their sheer size (largest sats ever put up to enable the transmission and especially signal receiving from earth), if there is any issue with space debree and one of the initial 5 is down, it could mean disaster. Global coverage is VERY VERY far away. And lastly - are we sure EVERYONE is going to want to pay more for this fabled global coverage? Like, a grandma in maine is going to pay extra for this service? How many places are actually not covered by the existing 4g network already? Not that many actually. So ASTS is being priced as if the global adoption is a given, when in reality it could be that only adventurers and outdoors people will use the service. That is not a very huge market that would justify putting up 60 satelites in space to service their needs (unless the subscription is priced hundreds of dollars per month - which means even fewer people using it), meaning their revenues will likely be way lower than what we think today, and profitability might not ever be achieved. So yeah, id value this as a 1.2-1.6 billion market cap company atm. Definitely not 10b where its going currently.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligcufq/",
      "created": 1723836167,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lifz6ai",
      "score": 15,
      "body": "TDLR. People are only pumping the stock because SpaceX is a private company. This company won’t be a competitor(not profitable) for another 10 years at the latest. SpaceX is already launching hundreds of direct to mobile satellites. \n\n\nTotally agree with everything you said here, I was going to make a post myself after my DD. Investors are insane to think that this is going to compete with Elon’s Starlink. Oh by the way he is also the number one launch provider and right now it is a year and a half wait to get on another transport mission.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifz6ai/",
      "created": 1723831772,
      "depth": 0,
      "replies": [
        {
          "id": "ligsm6k",
          "score": 4,
          "body": "RemindMe! 2 months",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligsm6k/",
          "created": 1723841286,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lig2ixr",
          "score": 11,
          "body": "1 comparison to starlink is terrible. Because starlink won’t compete with asts tech for d2d. Starlink has no fcc approvals and is struggling to make fcc make exceptions for them because…. They don’t have the tech! And arnt even close. However asts has the tech and it’s been proven! Asts has test sats up this isn’t their first sat and starlink cannot do d2d yet and even their tech now needs additional devices not straight to existing mobile device. Asts will run the d2d game and that’s why they will continue to soar well into the triple digits \n2 asts already has the next launches reserved with space x so the year and a half wait doesn’t apply. And rocket labs rockets will be ready soon the handle further launches if they ever needed to switch",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig2ixr/",
          "created": 1723832842,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lifzeut",
          "score": 10,
          "body": "Everybody is just clamoring because of huge gain porn posts being made.",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifzeut/",
          "created": 1723831847,
          "depth": 1,
          "replies": [
            {
              "id": "ligaihf",
              "score": 4,
              "body": "When should a pullback be expected? After initial launch?\n\nI guess FOMO will pump some more, than the dilution begins as they plan their next step.",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligaihf/",
              "created": 1723835402,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lifzm18",
              "score": 7,
              "body": "100%. This stock is inflated as fuck. Being very familiar with the industry it makes me laugh, we will see it plunge. \nIf people are going to invest in the space industry, it should be rocket lab.",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifzm18/",
              "created": 1723831912,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ligis12",
          "score": 4,
          "body": "Ah yes you’re smarter than google, Verizon, AT&T. You heard it here first folks! Your arguments are trash. No dilution, spacex can’t even get approvals, they needs 1000s of sats and ASTS only needs 100s. With spacex current service you can send ascii emojis to the other bears. Feel free to short. Would love to take your money.",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligis12/",
          "created": 1723838096,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ligeqw3",
          "score": 3,
          "body": "That’s not how smart ppl on Wall Street think. They aren’t going to pump money into a losing company just because they really wish they owned a piece of SpaceX. What kind of idiot logic is that? Say what you will about the long term feasibility of ASTS’ business model but it’s absolutely insufferable reading people try to sound smart on here with their smooth-brained logic. You can just admit you missed your chance to buy the stock low 😂",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligeqw3/",
          "created": 1723836791,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ligsn0t",
      "score": 2,
      "body": "See, you were wrong in the intro. But. Ok I’ll keep reading.\n\nEdit: wrong full through.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligsn0t/",
      "created": 1723841294,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligw09v",
      "score": 2,
      "body": "This is why I come here. Passionate opinion, passionate counterpoints, for the love of the game not clickbait. Boat jokes. Appreciate OP and all the commenters.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligw09v/",
      "created": 1723842386,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligxtm0",
      "score": 2,
      "body": "You’re really butt hurt on missing the boat on this one, huh?",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligxtm0/",
      "created": 1723843002,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lih5ai8",
      "score": 2,
      "body": "Worst dd I’ve ever read lmao. Dude just made up a bunch of shit",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lih5ai8/",
      "created": 1723845605,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lihb0lm",
      "score": 2,
      "body": "Im also hoping this company fails.. i just ordered 100k in puts with a strike price of 19",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lihb0lm/",
      "created": 1723847716,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liiem3s",
      "score": 2,
      "body": "Thought we'd get the dilution announcement ac for an offering.\n\nIt'll be a big one.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/liiem3s/",
      "created": 1723863655,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lij7d1h",
      "score": 2,
      "body": "Gay Bear",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lij7d1h/",
      "created": 1723879717,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lik50z6",
      "score": 2,
      "body": "Disaster in the making, and I'm not  taking about ASTS.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lik50z6/",
      "created": 1723899860,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lik9a6v",
      "score": 2,
      "body": "Judging by the number of regards hyping this pos, I have increased my short position by %800. Will buy further puts on Monday. Seems like it is gonna be the easiest money of my life.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lik9a6v/",
      "created": 1723901658,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likypy6",
      "score": 2,
      "body": "You failed to mention Apple has their own LEO ambitions.  If Apple gets more into this market, it will massively reduce the TAM for ASTS.\n\nhttps://www.investors.com/news/technology/apple-stock-satellite-connectivity-could-drive-iphone-upgrades/#:~:text=Globalstar’s%20network%20now%20includes%2024,currently%20active%20in%2016%20countries\n\nIt cost ASTS about 69m per launch. This will become a massive issue for them. \n\nHonestly, this reminds me of GOGO.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/likypy6/",
      "created": 1723910914,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liq4xqp",
      "score": 2,
      "body": "I see someone post asts going to the moon so I buy",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/liq4xqp/",
      "created": 1723993569,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lirmvvi",
      "score": 2,
      "body": "You understand that Musk can just…buy ASTS…right?",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lirmvvi/",
      "created": 1724011618,
      "depth": 0,
      "replies": []
    },
    {
      "id": "livmg65",
      "score": 2,
      "body": "Overpriced. Will buy back in around $8",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/livmg65/",
      "created": 1724077479,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lig0e8m",
      "score": 4,
      "body": "Whatever I made $5k. Next?",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig0e8m/",
      "created": 1723832163,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lig2o8s",
      "score": 2,
      "body": "PROFIT TAKERS TODAY.....NO WORRIES WE RIDE LONG TERM",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig2o8s/",
      "created": 1723832889,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liglqye",
      "score": 3,
      "body": "The market is not that big anyways, they have no special moat (~12 MBPS download speed is laughable) and the big telecoms \"invested\" because they probably don't want Starlink monopoly. It's all a sham, their satellites were supposed to be launched last March and now scheduled for September but they all admit these 5 Block 1 satellites are effectively obsolete and need many more Block 2 to even do a decent signal. \n\nThe pump worked, back to $10 after the hype dies down.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/liglqye/",
      "created": 1723839069,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligltth",
      "score": 4,
      "body": "Most disingenuous ill informed ‘due diligence’ post award 🥇",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligltth/",
      "created": 1723839094,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligs2m0",
      "score": 3,
      "body": "Your math assumes no economy of scale. Clearly you have no idea what you are talking about",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligs2m0/",
      "created": 1723841116,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligu9lv",
      "score": 3,
      "body": "Everyone here blabbering yet no one has stopped to think… do we actually care about D2C? When’s the last time you NEEDED satellite connectivity on your phone?",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligu9lv/",
      "created": 1723841813,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lig0tl7",
      "score": 3,
      "body": "u/Disastrous_mess8820 thank you for taking time to do DD…. Even if you are wrong do not let people angrily bully you while they themselves don’t bother putting up DD…\n\nMost are from single stock sub…. Its blatantly obvious",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig0tl7/",
      "created": 1723832299,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lifxw38",
      "score": 4,
      "body": "No position no conviction",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifxw38/",
      "created": 1723831360,
      "depth": 0,
      "replies": [
        {
          "id": "lifyant",
          "score": 2,
          "body": "Position in comments",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifyant/",
          "created": 1723831489,
          "depth": 1,
          "replies": [
            {
              "id": "lifzz9b",
              "score": 4,
              "body": "They are on record saying no more dilutions this year just FYI",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifzz9b/",
              "created": 1723832030,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lifz6kw",
      "score": 2,
      "body": "There's too many people who want Elon to lose. \n\nHe pretty much outcasted half of potential buyers and customers. \n\nHere in Southern California, I'm starting to see more instances of Rivian. \n\nI don't think Elon will do well long term, his drug usage has influenced him to make poor and inflammatory decisions where he has more interests than his own business interests. \n\nIt seems like his political ambitions are just as important to him as his businesses, if not more at this point - and because of this I have lost faith in Elon. \n\nAgain, not because of his political viewpoints, but because he isn't calm and collected enough to not make inflammatory decisions causing his businesses to take hits here and there. \n\nI don't believe in Elon nor his companies in the future.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifz6kw/",
      "created": 1723831774,
      "depth": 0,
      "replies": [
        {
          "id": "lig49go",
          "score": 5,
          "body": "What drugs are Elon taking to effect his decision making abilities ![img](emote|t5_2th52|4271)",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig49go/",
          "created": 1723833390,
          "depth": 1,
          "replies": [
            {
              "id": "lig4g59",
              "score": 4,
              "body": "it is well documented that elon is taking ketamine",
              "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig4g59/",
              "created": 1723833448,
              "depth": 2,
              "replies": [
                {
                  "id": "lig4p1z",
                  "score": 2,
                  "body": "I’m on those right now and I’m capable of the fondest of decisions to make",
                  "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lig4p1z/",
                  "created": 1723833526,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ligffg6",
      "score": 2,
      "body": "Nice try. ",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligffg6/",
      "created": 1723837014,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligg7r1",
      "score": 2,
      "body": "Just bought some 8/30 $27 puts and just made 10% in 5 mins. Lol I love volatility.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligg7r1/",
      "created": 1723837270,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligsgxr",
      "score": 2,
      "body": "We call this kind of shit due diligence now?",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligsgxr/",
      "created": 1723841240,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lih3mg0",
      "score": 2,
      "body": "Agreed. \n\nThis is a low margin business, people don’t pay much for their mobile or internet/broadband contracts.\n\nHuge competition from SpaceX/Starlink - Musk has the ability to actually launch satellites cheaply (not ASTS)\n\nMasses more shareholder dilution incoming.\n\nWho are the future customers? \n\nMajority of high wealth people and companies already have excellent data and cell connection…",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lih3mg0/",
      "created": 1723845015,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lifyane",
      "score": 1,
      "body": "Well, I bought some at $1980 during the dip thanks to Regards here... I am up almost $2K.   \nWould have been up $4k but I sold covered calls that went quickly in the money.   \nRiding it until it reaches............ $50.. or more.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifyane/",
      "created": 1723831489,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lifztwq",
      "score": 1,
      "body": "[removed]",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifztwq/",
      "created": 1723831983,
      "depth": 0,
      "replies": [
        {
          "id": "lifzw7k",
          "score": 3,
          "body": "TLDR - stop crying for not jumping in on asts",
          "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lifzw7k/",
          "created": 1723832003,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ligc38s",
      "score": 1,
      "body": "SpaceX shares are popping as well",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligc38s/",
      "created": 1723835921,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligclr6",
      "score": 1,
      "body": "I sold. Might buy more in the future if it goes down again but I think there’s just too much speculation in SpaceMobile.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligclr6/",
      "created": 1723836087,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligd1d0",
      "score": 1,
      "body": "I don’t think this is crazy take there money to be made though now for the time being though",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligd1d0/",
      "created": 1723836230,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liged6n",
      "score": 1,
      "body": "I’m cashing out in a few weeks when the satellites launch. I’m up 2200% since May. As long as satellites don’t explode I’ll be happy with whatever it ends at",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/liged6n/",
      "created": 1723836665,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligepzu",
      "score": 1,
      "body": "Not enough rocket emojis",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligepzu/",
      "created": 1723836783,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liggrek",
      "score": 1,
      "body": "You truly have no idea what you’re talking about",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/liggrek/",
      "created": 1723837445,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligh0cs",
      "score": 1,
      "body": "As far as I’m concerned, I missed the train by a long shot, and the stock no longer exists.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligh0cs/",
      "created": 1723837526,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lighpev",
      "score": 1,
      "body": "Short the stock, I dare you.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lighpev/",
      "created": 1723837753,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liglv58",
      "score": 1,
      "body": "Starlink satellites were designed for a different purpose. Starlink requires an antenna to work. ASTS works directly with existing phones (no extra hardware needed). Doesn’t really sound like you know what you are talking about here.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/liglv58/",
      "created": 1723839106,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lign29e",
      "score": 1,
      "body": "In at 11 \nOut at 32\nGonna get back in if it’s under 20. \nIf it goes to the moon. I’ll watch from here.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lign29e/",
      "created": 1723839498,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lign7xe",
      "score": 1,
      "body": "after the inevitable crash: this is how stock cults are born",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lign7xe/",
      "created": 1723839550,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lignpya",
      "score": 1,
      "body": "u/CatSE---ApeX--- can you please talk about this?",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lignpya/",
      "created": 1723839711,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligqopg",
      "score": 1,
      "body": "RemindMe! 1 month",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligqopg/",
      "created": 1723840673,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligvupl",
      "score": 1,
      "body": "It goes down to 20 next week and is 75 by the end of the year. \n\nI think if the successfully launch and get the satellite working this thing goes apeshit",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligvupl/",
      "created": 1723842334,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligvw2e",
      "score": 1,
      "body": "The sell signal we needed (and yes, before you ask, I missed this boat)",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligvw2e/",
      "created": 1723842347,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligx10b",
      "score": 1,
      "body": "They do not make sat themselves. They do not have launch vehicle. It’s DOA",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligx10b/",
      "created": 1723842731,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligxgze",
      "score": 1,
      "body": "This will be shorted into Narnia in no time",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligxgze/",
      "created": 1723842882,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ligyxa6",
      "score": 1,
      "body": "I’ve got some nice 10 and 15 C 2026 Jan leaps I bought a few months back. I think I should delete Robinhood for a year and come back then?",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/ligyxa6/",
      "created": 1723843377,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lih0wss",
      "score": 1,
      "body": "I live in the area, and they're always hiring.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lih0wss/",
      "created": 1723844065,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lih187s",
      "score": 1,
      "body": "Bad research, but even worse investment opportunity. ASTS is really high risk, really low reward, at least if you exclude the decentralized pump and dump aspect of it that is.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lih187s/",
      "created": 1723844174,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lih1iga",
      "score": 1,
      "body": "I agree with everything you wrote (I have puts dated for November)",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lih1iga/",
      "created": 1723844272,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lih1xia",
      "score": 1,
      "body": "Sir this is way too well thought out and logical for this subreddit",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lih1xia/",
      "created": 1723844418,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lih28w7",
      "score": 1,
      "body": "You have been proven wrong on all your so-called DD. Just want to add a few points that I haven't really seen mentioned here:\n\n1. Starlink does not adhere to interference. The big carriers just spent 81 billion dollars on auctions for the 5G spectrum. You think uncle Sam will just let Starlink illegitimize that. That is a shit ton of income the US government will protect. ASTS works with carriers using this spectrum. Many also mentioned that telecom is a debt burdened business. But that is mostly because of these spectrum licenses and expenses infrastructure, ASTS won't have these costs.\n\n2. There will be no dilution. There is additionally outstanding warrants that ASTS can redeem.\n\n3. The market cap is only like 9billion. And ofc it doesn't make a lot of money it's prerevenue. But it will start making some real money this year still. The margins on the sat revenue is 90%. Just ask your daddy Elon about how Tesla did it for a decade.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lih28w7/",
      "created": 1723844528,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lih50g9",
      "score": 1,
      "body": "Seems people have forgotten this is a SPAC, and the Public Warrants will soon be exercisable as $ASTS has been over $18 for some time.\n\nThis will dump hard once the Warrants are exercised.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lih50g9/",
      "created": 1723845507,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lih5ps9",
      "score": 1,
      "body": "Hi",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lih5ps9/",
      "created": 1723845757,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lihanzf",
      "score": 1,
      "body": "Did you use an AI to help write this? The only people who use \"taking the market by storm,\" \"meteoric,\" \"clamoring,\" and \"flocking\" are either dead or writing for MarketWatch. lol Genuinely curious.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lihanzf/",
      "created": 1723847582,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lihbii1",
      "score": 1,
      "body": "\"ASTS will have a dilution fairly soon to raise further capital and will leave retail investors holding heavy bags.\"\n\n  \nThat's all need be said. If 'investors' don't know this then that's on them for being ignorant.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lihbii1/",
      "created": 1723847906,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lihcq1w",
      "score": 1,
      "body": "You did no DD on this company at all if you can’t even listen to the ER call and realize they already disproved your statement before you wrote it.\n\nhttps://preview.redd.it/o3k4pm49u3jd1.jpeg?width=1170&format=pjpg&auto=webp&s=80c604ba733799d1ee14cf85dd0626d55ae13426",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lihcq1w/",
      "created": 1723848370,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lihgb07",
      "score": 1,
      "body": "Obviously didn’t listen to the earnings call. No dilution in 2025 all funded with cash on hand and prepayments from MNOs",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lihgb07/",
      "created": 1723849735,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lihlihe",
      "score": 1,
      "body": ">So how many satellites does ASTS have in space? ZERO\n\n\nWell, your username certainly checks out.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lihlihe/",
      "created": 1723851720,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lihn8jr",
      "score": 1,
      "body": "Already clocked in 6 figures of this shit. Your DD is for the birds. Make money and move on",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lihn8jr/",
      "created": 1723852381,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lihqur5",
      "score": 1,
      "body": "Shorting it is",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lihqur5/",
      "created": 1723853815,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lihz85n",
      "score": 1,
      "body": "Number of Class A shares went from 90M last year to 135M this year, let that sink in.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lihz85n/",
      "created": 1723857221,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lii1act",
      "score": 1,
      "body": "Thank you for your DD. This is exactly what I needed.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lii1act/",
      "created": 1723858040,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lii80xq",
      "score": 1,
      "body": "god i love seeing posts like this because it reminds me how stupid and uninformed the majority of people throwing money in the market are. all of these points could be addressed with 5 minutes of DD and the critical thinking of a 7th grader. instead of buying puts, please short shares so you can fuel the squeeze even more as we range upwards in price discovery.",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/lii80xq/",
      "created": 1723860784,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liiprs3",
      "score": 1,
      "body": "Puts position or ban",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/liiprs3/",
      "created": 1723869088,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liiralp",
      "score": 1,
      "body": "If it’s on wall street bets , it’s already too late",
      "permalink": "/r/wallstreetbets/comments/1etva8u/asts_due_diligence_and_inevitable_dilution/liiralp/",
      "created": 1723869918,
      "depth": 0,
      "replies": []
    }
  ]
}