{
  "title": "What insights / trends did you see when making previous bets on long term winners?",
  "score": 87,
  "selftext": "What knowledge about a previous company or trend that you followed gave you conviction in buying a company that turned out to be a multi bagger? \n\nConsidering the current trends in our market today(AI, space, crypto), what have you learned from investing in previous cycles? For example, those pre internet - what lead you to invest in a company based off the benefits the internet would provide that company? Or was there ever a specific time a company released a product like the iPhone for Apple or chips with Nvidia that you made you invest? \n\nWhich companies did you feel like would change the future and could 10x? Were you right? Wrong? What did you learn?\n\nCurrent plays are welcome too!",
  "link_flair_text": null,
  "id": "1euapw1",
  "num_comments": 42,
  "created_utc": 1723874315,
  "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/",
  "comments": [
    {
      "id": "likmmi7",
      "score": 21,
      "body": "I marvelled at the incompetence and stupidity of Steve Ballmer and the moronic moves he made while CEO of Microsoft. Yet somehow, the company kept making money.  The day he stepped down and Satya Nadella took over, I bet hard on MSFT figuring that if a clown like Ballmer could keep that ship afloat, a smart guy like Nadella could take it to the moon.  No regrets.",
      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/likmmi7/",
      "created": 1723906720,
      "depth": 0,
      "replies": [
        {
          "id": "lilqz9c",
          "score": 4,
          "body": "This is something I haven’t put as much thought into when looking at other companies, makes sense. It explains the difference we saw in stock price for chipotle and Starbucks this week. Also reminds me of when they announced Bob iger going back to Disney",
          "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lilqz9c/",
          "created": 1723920722,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lij4cak",
      "score": 56,
      "body": "I have a 9 year old daughter who plays Roblox which you could say is a kind of metaverse sort of thing. While I don't pay for anything on it, I know plenty of other parents who willingly allow their kids to buy the in game currency to buy a whole load of random stuff related to the game. \n\nI remember when Facebook or Meta tanked hard a couple of years ago because investors were concerned about the sheer amount they were and still are spending in their version of a metaverse. But when I saw my kid and many others spending time and money on this stuff, it appears to me that Meta is building a foundation for their future revenue and along with their already solid fundamentals, I took a punt and bought a fair amount at an average of 114 and have just sat back and watched it surge over the years. \n\nHave I managed to replicate this success with other businesses? Not yet, but it has changed my whole mentality of investing and I am more comfortable to spend more time investigating a company beyond just the numbers.",
      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lij4cak/",
      "created": 1723877720,
      "depth": 0,
      "replies": [
        {
          "id": "lijfqjb",
          "score": 41,
          "body": "This is a good Peter Lynch way of investing. Some personal experience combined with rational business analysis. \n\nGood on you man!",
          "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lijfqjb/",
          "created": 1723885424,
          "depth": 1,
          "replies": [
            {
              "id": "lilrkuq",
              "score": 3,
              "body": "I agree! I think that’s where I was going with this post. Peter Lynch’s book, one up on wall street has had an influence on me haha",
              "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lilrkuq/",
              "created": 1723920933,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "likc699",
          "score": 9,
          "body": "I personally also believe that \"investigating a company beyond just the numbers\" is important, and if I can't envision the future potential of the company I stay away.",
          "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/likc699/",
          "created": 1723902824,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lika0ya",
          "score": 5,
          "body": "Lol, had the same experience with RBLX. The kids were playing it and then stopped. Then it re-started and even the older kids were playing. That's when I bought.",
          "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lika0ya/",
          "created": 1723901962,
          "depth": 1,
          "replies": [
            {
              "id": "likrrvx",
              "score": 4,
              "body": "Roblox burns money like a bonfire every quarter despite that.",
              "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/likrrvx/",
              "created": 1723908518,
              "depth": 2,
              "replies": [
                {
                  "id": "liky2mt",
                  "score": 2,
                  "body": "True. My average is right around $26 so I have a lot of buffer. Holding it for the long term with the expectation that the platform will continue to evolve and over time profitability will happen. Also wouldn't rule out an acquisition by a Meta but that is not something I am counting on. The stock has done pretty well and its in my bucket of risky stocks. You can't just own VOO and some Mag-7's although that alone is enough to rise with the inflationary tide.",
                  "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/liky2mt/",
                  "created": 1723910689,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lijnl0v",
      "score": 31,
      "body": "In my teenage years, i did a lot of gaming. Went on to build my own computer (assembling it) and pick all the parts. At the time, nothing beat NVIDIA graphic cards. They were so much ahead, if you wanted more FPS.\nLuckily, i didnt just buy the graphic card but also some stock.\n\nThe rest is history.",
      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lijnl0v/",
      "created": 1723890803,
      "depth": 0,
      "replies": [
        {
          "id": "likawvh",
          "score": 4,
          "body": "I'm still very young but I have seen that this works a lot. I bought TKO because of same reason few months back (they ownufc,WWE) and now they are 20% up. I like CD Orojekt red video games and they are up over 18%. Idk if gains will hold (I am betting they will) but this clearly works in short term. This increase is despite rest of market struggling.",
          "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/likawvh/",
          "created": 1723902320,
          "depth": 1,
          "replies": []
        },
        {
          "id": "limo4bz",
          "score": 2,
          "body": "Same, Warcraft 3, Starcraft, World of Warcraft, Dawn of War, RTS games needed good graphics cards to run big matches. NVDA was my god as a kid growing up, they felt like the future and graphics cards were like most advanced thing I'd ever known of and knew NVDA was the best. I wish someone asked me what stock to buy, my parents had rocks for brains.",
          "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/limo4bz/",
          "created": 1723932711,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lijokea",
          "score": 3,
          "body": "I love everything about this comment. I believe in investing in what you believe in: tech, healthcare, energy, etc. if you a specific company that you or your friends spend money with in retail then I say invest in that company. \n\nI believe that AI is the future & we are only in the beginning stages right now. I like NVDA so I’m invested there. I was a mortgage loan originator & really like UWMC, especially with impending rate cuts coming from the Fed…so invested there. I think CLOV has a great strategy to providing healthcare so I invested there. Just my example",
          "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lijokea/",
          "created": 1723891439,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lijgcls",
      "score": 11,
      "body": "There are many ways to invest and so many way to win, and lose, in the markets. \n\nThe method of picking out ‘future tech’ stocks is incredibly difficult. Most of these are no-profit, risky speculative bets, and by the time your average Joe has heard of them they’ve been hyped up to the moon. \n\nInvesting is as much about protecting your downside and, over the long run, you’ll find it much better to invest in steady cash flows than speculative tech. \n\nDon’t get not wrong there’s a space for the latter in any portfolio - but keep it small and diversify.",
      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lijgcls/",
      "created": 1723885848,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lij3mdo",
      "score": 28,
      "body": "The most successful trades I have made is usually with companies who have high returns.\n\nThe returns are mainly focus on ROIC, ROA, ROE, ROCE.  If these are growing and/or consistent, these are the best long term plays.\nAnything over 10% is what I am looking for.\n\nMost important is patience and time.  The market is volatile, the price action should not cloud your judgement.  \n\nSome of My current long stocks which I like are NVDA, PLTR, LMT, JNJ, KO\n\nThese just some, a mixture of growth, value and income",
      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lij3mdo/",
      "created": 1723877250,
      "depth": 0,
      "replies": [
        {
          "id": "likcgwl",
          "score": 1,
          "body": "What are good numbers for ROE etc? I have a video game company called CDPR with ROE etc around 25-30% higher than competitors. It is slightly tricky since video game releases every 4-5 years and hence have no constant revenue. But I like theie financials, their company and see massive growth. I expect market cap to grow another 40-50% easily. What do you think?",
          "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/likcgwl/",
          "created": 1723902939,
          "depth": 1,
          "replies": [
            {
              "id": "lknlysc",
              "score": 1,
              "body": "I can't find this ticker, are you sure it's correct?  Send the name of the company and ill take a look",
              "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lknlysc/",
              "created": 1725017525,
              "depth": 2,
              "replies": [
                {
                  "id": "lkoaalw",
                  "score": 1,
                  "body": "CDPR is the company. Ticker might be CDR. Or OTGLY is the ADR in US.",
                  "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lkoaalw/",
                  "created": 1725026823,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lkydjgd",
                      "score": 1,
                      "body": "looks really interesting.  On the original topic about ROE, this does looks really attractive.  20% ROE on a company like this seems reasonable for a low market cap company.  It looks like the returns are great compared to the size of the company.    \n  \nHowever, it looks likes it is high growth and very cyclical.  For example there is periods where there is extreme revenue and then all of a sudden it drops fast from one Qtr to the next.  \n\nThis is where I would be a bit curious.  The RoE seems to spike when the revenue pops, but takes a massive hit when the revenue drops.  This means they are carrying extremely large fixed costs.  I would read from this that they can potentially do more with what they have, which leads me to believe their commercial strategy needs some work.  \n\nIts not really something I would personally invest in, but if you have the risk appetite for the volatility and can stay the course, I would say its not a bad stock to hold in the portfolio for a moon shot.",
                      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lkydjgd/",
                      "created": 1725174304,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lkyjuvn",
                          "score": 1,
                          "body": "Great thanks! Yeah it is definitely cyclical. It is still a fairly new company and has only 2 big releases - but these 2 have been very very big and propelled them to the very top. For next decade they have 4-5 big games on plan, with a new a studio in Boston, so as to have steady revenue. The moonshot relies on this growth plan working. \n\nSince I made that comment I'm up almost 20%! So I'll just see what happens.",
                          "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lkyjuvn/",
                          "created": 1725178464,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lik6oz7",
      "score": 8,
      "body": "I bought PFE leaps early in the stages of covid, and made a lot. I learned the trading range and behavior and balance sheet of PFE really well. I had no intention of trading it again, but when I saw it break into the 25's this year with 10's of billions of cash on hand, I couldn't help myself and loaded up on shares and leaps again. I've also learned that I don't really \"learn\" a stock If I don't have skin in the game, so If I get an itch to own a stock, I will immediately buy one, and just sit on it for a while. Helps that I can hit the buy button when I have my FOMO moments and get that sweet sweet dopamine, but limits my downside and gives me some time to actually learn the stock, and very rarely is that actually an entry I should have taken with any size anyway. Lastly I devested a lot before covid really hit, which seemed genius at the time, but now I would just hedge.",
      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lik6oz7/",
      "created": 1723900575,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liklu8h",
      "score": 11,
      "body": "I typically invest in companies I use and like using on a daily to weekly basis. I am relatively shrewd in what I buy, so if they are getting my money in real life they are likely worth investing in.\n\nGOOGL, APPL, MSFT, V, AMZN, CAVA, NVDA\n\nThen I have a few flyers which are high risk but have the potential for societal transformation\n\nASTS, JOBY, RKLB",
      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/liklu8h/",
      "created": 1723906440,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liku415",
      "score": 8,
      "body": "The first stock I ever bought, SONY was after reading about the BetaMax and how it was going to revolutionize recording. \n\nIt didn't but the stock quadrupled in a year and I was hooked.  I bought what is now META because everyone, besides me, was on it and I bought it when the IPO crashed and burned.  Last time I looked, I was up 2600%.  \n\nBought NVDA when I asked a gamer friend what game coming out excited him.  I was going to buy a gaming stock, he instead said their graphics card was what every gamer wanted.  At the time it was $13 a share and paying a 4% dividend.\n\nWhenever I visit my Oncologist, Dermatologist, ID doctor, I ask them what drugs in the pipeline excite you.",
      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/liku415/",
      "created": 1723909321,
      "depth": 0,
      "replies": []
    },
    {
      "id": "limz9l7",
      "score": 4,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/limz9l7/",
      "created": 1723937084,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lijt40g",
      "score": 7,
      "body": "Costco - I shop there. Always busy. They open up 30 new stores a year. They own their own real estate. You’ve never seen a Costco not busy.",
      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lijt40g/",
      "created": 1723894112,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likx47p",
      "score": 3,
      "body": "You can use social media for decent market insight on consumer brands/businesses, just do not use reddit or twitter. The anonymous nature and skewed demographics make them very bad sources.  \n\nI've used social media trends from facebook and instagram (hashtags, mentions, posts, etc.) for *ideas* of good plays in the past. You have to then dig into the financials because a brand/company can have tons of buzz but still be a bad financial bet.\n\nFor social media I want to highlight that Reddit in particularly is horrible at gauging the market, because it skews towards a young, less social, tech focused, white, male demographic that is not representative of the whole market.",
      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/likx47p/",
      "created": 1723910357,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likydce",
      "score": 2,
      "body": "A good tip would be: What companies do I use on a daily, weekly, yearly basis?  at the time new tech was springing up when I started investing: computers, cell phones, gaming, streaming services, and although I wasn't using all of them, many I did use like Marvel comics, I could see Netflix was going to be a good idea, Amazon seemed good too, etc.   It seems a bit harder these days, but still it's good to take note of that.",
      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/likydce/",
      "created": 1723910792,
      "depth": 0,
      "replies": []
    },
    {
      "id": "limeug3",
      "score": 2,
      "body": "Math. When the math adds up but the media is arguing against the company solely based on either factually wrong or overly emotional arguments you know there's a divide between what the company trades at and what it's actually worth. (TSLA)",
      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/limeug3/",
      "created": 1723929224,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lip20x0",
      "score": 2,
      "body": "People tend to forget (me included) but it's all about value creation.\n\nI made the mistake with Cannabis although it is certainly a huge potential market that the margins are just extremely low. Investing in the cannabis market is thus kind of a waste. Rather you should be looking for brands that can sell at a proper margin.\n\nI also got some winners though. Tesla just made a lot of sense to me in 2017. EVs made like normal cars rather than trying some fancy stuff. The fact they had the Roadster at the time which was relatively successful meant there was a lot of value to be added there. Tesla had a massive first-movers advantage (thus a lot of value). Combined with the initial vision, which still hasn't been pulled off. Tesla was supposed to be an all-electric solution/replacement. Tesla Solar, Battery and of course cars. The fact they still didn't pull this off whilst competitors have been catching up was reason with a massive valuation was reason for me to divest.\n\n\nNvidia was a pretty obvious one as well in 2022. First-movers advantage in combination with the hype of ChatGPT and now they can sell their 1-5k cost basis AI cards for like 30-40k. Also the reason why I went into Microsoft at the time with their co-pilot initiative.\n\nA few others are simple swing trades. During Covid oil prices sunk to negative prices and Oil companies fell with it. Managed to 3x my investment in Shell at the time with great dividends.\n\nBanks in 2020 were also at a massive discount. Was quite clear that interest rates had to be raised at some point resulting in the massive profits banks gained in the past 2 years.\n\n*Now I'm a huge Intel simp. Massively undervalued in my opinion and can sink even lower depending on lawsuits for 13th and 14th gen chips. It seems to have a 3x to 10x return in 2 to 5 years. Intel at this value makes sense if they were still massively behind on AMD. On a consumer glance that does seem the case. However, if you look at datacenters their new Sierra Forest is equal on performance with AMD whilst they will still produce improved versions in a few months. Their new 20A and 18A chips will also be a massive improvement introducing technology that TSMC hasn't pulled off yet in backside power delivery. In addition, to using the new ASML machines.\n\nThe only explanation for their low value is due to declines in revenue and profits. However, if you look at the multiples. Intel has 3x revenue and 2x profit than AMD but is trading at 2-3x lower value.",
      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lip20x0/",
      "created": 1723975568,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lijisn2",
      "score": 2,
      "body": "Look for companies/CEOs that face organised hate machine, like\nMETA AMAZON MRNA TSLA SBUX MCDONALDS, they rise back up fast.",
      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lijisn2/",
      "created": 1723887572,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilzcdu",
      "score": 2,
      "body": "Tesla. \n\nWas an admirer of the vehicle and Elon too actually. Loved the mission. In my head even back in 2012-2014 it made sense to not own a gas powered vehicle if an electric vehicle with even 200 miles is available. \n\nThen got the experience the model s for the first time from a family member who was an extremely extremely early adopter. Loved it. \n\nBeen holding shares since then. Wish I never sold some of it like I did in 2018 I think. But regardless definitely my longest individual hold so far. \n\nI see some of those same things with rivian too. Don’t think they will ever be as successful as tesla but if the stick 5x from here, I would be super happy.",
      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lilzcdu/",
      "created": 1723923740,
      "depth": 0,
      "replies": [
        {
          "id": "lim3eji",
          "score": 1,
          "body": "Nice! I missed that one, always too worried about valuation but definitely have regrets.\n\nWhat made you sell at the time? \n\nWhat’s keeping you from selling now?",
          "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lim3eji/",
          "created": 1723925184,
          "depth": 1,
          "replies": [
            {
              "id": "lim5j5m",
              "score": 1,
              "body": "Yeah there are some stocks that I disregard valuation on. I know it’s crazy to say but it’s been good to me. \nDon’t have regrets though because it was insane investing in it back at that time. Anyone that did it was basically rolling dice. \n\nI made a lot of profit and doubted my own thesis. I was surrounded by Tesla haters and kept hearing they will go bankrupt any day. Reading Reddit on Tesla made it worse back in those days too. It’s my fault for doubting myself though. Would have been so much more if I had held on. But at least I have a chunk of it from back then still. \nI feel the same way about rivian when I read on it now. The same Tesla doubters in my friends and family doubt Rivian but I’ll stick with my hypothesis and keep buying every time they go below 14 a share. \n\nI think Tesla has massive avenues to increase profits that nobody else does. Their energy storage business is growing at a great rate, and I do believe they will be closest to solve driving autonomy. I had FSD beta for months and have seen it myself. Nothing will ever be perfect just like human drivers now. But it will be great. \nAlso humanoid robots have a lot of potential. It’s all very ambitious as always with Elon.",
              "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lim5j5m/",
              "created": 1723925935,
              "depth": 2,
              "replies": [
                {
                  "id": "limcoez",
                  "score": 2,
                  "body": "Interesting take on rivian. \n\nDo you think you might be attributing prior success from investing in tesla? Tesla was first of their kind with a visionary ceo. Rivian is an expensive truck with nothing too unique? I’m not too knowledgeable on them but I’m about 10 minutes from their HQ and see them all over.\n\nDo you similarly feel like you’re “rolling the dice” with Rivian? Understandably you might be anticipating future growth based off the trends in electric vehicles, Amazon backing and projections for upcoming profitability(?).\n\nI’ll have to look into Rivian some more, regardless thanks for the input!",
                  "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/limcoez/",
                  "created": 1723928438,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "limlu88",
                      "score": 3,
                      "body": "I do feel like I’m rolling the dice a bit with rivian but far less than I did with Tesla. Tesla had every single uphill battle because they were the first ones. Rivian buyers already accepted EVs cuz of Tesla so rivian has a less tough hill to climb in the social aspect at least. \n\nYou highlighted a lot of the reasons why I like Rivian. But think about it like this, your expensive truck comment could have been said and was said to Tesla as well when only the model s and X were for sale and that’s way before any of this energy, robots, AI stuff. \nIt’s the model 3 and Y that made Tesla work. \n\nRivian is coming with the R2 and the R3. I do think the R2 will blow up and if Rivian can execute on delivery then it will be magnificent for their company. Maybe not to the scale as model 3 or y was for Tesla but even 1/4 of that would be great for the company and stock. \n\nThe market is big enough for both Tesla and Rivian to succeed. Also Elon has done a fantastic job to drive a decent bit of consumers away from Tesla over the last 4 years and they will go to another EV maker. Rivian will be that EV maker. \n\nElon’s political saga and whether Tesla would really suffer or not can be a whole different post it self. I have talked about it in depth before with other people on here so won’t go into it now. But Tesla will be fine. \n\nI love talking about this stuff so thanks for asking!",
                      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/limlu88/",
                      "created": 1723931831,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lim46u6",
      "score": 1,
      "body": "I saw Shorts but went Long 😭🤣",
      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/lim46u6/",
      "created": 1723925463,
      "depth": 0,
      "replies": []
    },
    {
      "id": "linfz2b",
      "score": 1,
      "body": "Companies if they have a monopoly will likely to split up. AT&T was forced to breakup after years of monopolize communication industry. GE split up finally.  I smell BA can be next target to have more accountability.  Johnson and Johnson is a new split.  I sold the consumer division at gain kept JNJ.  Most gains are unplanned got them early on from actualy research cheap but affordable stocks. These 15 dollars stocks often do quite well when gets noticed with strong earnings.",
      "permalink": "/r/stocks/comments/1euapw1/what_insights_trends_did_you_see_when_making/linfz2b/",
      "created": 1723943820,
      "depth": 0,
      "replies": []
    }
  ]
}