{
  "title": "My natural gas thesis - would like to hear more thoughts on this.",
  "score": 60,
  "selftext": "Natural gas (UNG) is near a 10 year low. About 10-20% of data centers use natural gas as their backup power source. The rest mostly rely on diesel fuel. NG is cleaner, easier to store, lasts much longer and presently about 12 times cheaper per BTU of energy generated.\n\nSerious replies and perspectives welcomed. I'd love to hear all angles.\n\nEDIT: Thanks all! Great info. Appreciate everyone's inputs. Not bad, only 2 fart jokes and just 1 douchey comment out of the bunch. Y'all are great \n\nEDIT 2: Contango defined by ChatGPT. Contango in natural gas is when future prices are higher than current prices, meaning it’s expected to cost more later than now.",
  "link_flair_text": "Discussion",
  "id": "1eujrxu",
  "num_comments": 115,
  "created_utc": 1723906931,
  "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/",
  "comments": [
    {
      "id": "likn8b9",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 28 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likn8b9/",
      "created": 1723906936,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likx3ek",
      "score": 97,
      "body": "Be careful!! UNG invests in Gas Futures (Henry Hub). So that means it invests in gas delivered 1-2 months out. They sit currently at 2.1 or whatever. However, prices for Jan/Feb futures sit at >3.5. i suggest you read up on the term Contango. Basically, everything else equal, natgas front month could just tick up to 3.5 while UNG doesn‘t gain a single cent! Let that sink in. Put in other words: Contango brings high rolling cost, when you change from front month to next, you can pay up. So while on the screen it shows you that gas is more expensive, UNG didn‘t increase. It just changed the contract.\n\n\nOn the fundamental side: there is a massive gas glut in US going on. Oil producers just do „drill baby drill“ because shale oil production is massively in the money. Those guys ger natgas as side product, so even if gas sits at 1.6, 1.7$/mmbtu, the guys keep drilling because oil pays for the side product to get rid off. Check out what happened in spring: only around 1.6-1.7$, gas producers started to shut in. Not before.\n\n\nLong story short: if nothing fundamentally changes, the play is short natgas. If you bet on dropping oil prices, middle east escalation and massively hot (in summer) and cold (in falls/winter), then you can do long natgas. Default play this year is short natgas.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likx3ek/",
      "created": 1723910349,
      "depth": 0,
      "replies": [
        {
          "id": "lil1xm6",
          "score": 36,
          "body": "This is the correct answer. Everyone else in this thread has no clue what they are talking about and the factors op lists in his thesis are completely irrelevant. I personally think long nat gas is good play on a very long time horizon given secular energy trends but UNG is not the vehicle to do this",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lil1xm6/",
          "created": 1723912035,
          "depth": 1,
          "replies": [
            {
              "id": "lilnhe9",
              "score": 4,
              "body": "[deleted]",
              "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lilnhe9/",
              "created": 1723919497,
              "depth": 2,
              "replies": [
                {
                  "id": "lilrqdz",
                  "score": 19,
                  "body": "Look into some of the natural gas movers and producers in North America. A few that I'm long on are ET, RRC, AM, and AR. \n\nI agree that natural gas is a solid, long term play. In Europe and the rest of the world, natural gas is really expensive. In the United States/North America it is very cheap (comparatively). Over time I expect these prices will converge, especially as the US builds up its export capacity. As such, the companies that stand to gain the most from this are going to be the North American producers and movers.",
                  "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lilrqdz/",
                  "created": 1723920989,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lilsjhd",
                      "score": 6,
                      "body": "[deleted]",
                      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lilsjhd/",
                      "created": 1723921282,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lin5jsp",
                          "score": 4,
                          "body": "And PAA",
                          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lin5jsp/",
                          "created": 1723939564,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lilrzic",
                  "score": 6,
                  "body": "ENFR.  Gas pipeline/processing/storage stocks.  Pays a good dividend and doesn’t necessarily correspond to gas prices.",
                  "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lilrzic/",
                  "created": 1723921079,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "liwxtu7",
                      "score": 1,
                      "body": "wow, it's on a roll! though entering now at ATH takes cojones",
                      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/liwxtu7/",
                      "created": 1724092736,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lilv76v",
          "score": 5,
          "body": "That was solid.  The things I'm interested in, I can rip like this, but damn that was a class in energy investing.  You have me intrigued. Where can I learn more about all this shit?  Or would I need to be an insider or in the industry?\n\nI don't even rip options anymore, I just come here for the luls.  But this isn't something that I see every day.  Someone who knows shit instead of the same tired ass meme.\n\nHow did you learn this stuff?  In the industry or just due diligence?",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lilv76v/",
          "created": 1723922245,
          "depth": 1,
          "replies": [
            {
              "id": "lim1yze",
              "score": 8,
              "body": "Thanks for the flowers! Indeed, it‘s a lot of industry insights from working in power trading and in the inner circles of one of the biggest LNG desks in the world. I changed field some time ago but keep fiddling with natgas and oil. But you can learn a great amount from publicly available sources. My comment above is just scratching the surface tbh.",
              "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lim1yze/",
              "created": 1723924676,
              "depth": 2,
              "replies": [
                {
                  "id": "limedvy",
                  "score": 1,
                  "body": "[deleted]",
                  "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/limedvy/",
                  "created": 1723929056,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lioldwi",
                      "score": 3,
                      "body": "The hell is even this question lol",
                      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lioldwi/",
                      "created": 1723964390,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lip9es6",
                      "score": 3,
                      "body": "Hmm, tough to say. So on the gas / power trading side the holy grail is to handle the fact that power is extremely \"spiky\" because it cannot be stored effectively. i.e. if you have a slight mismatch between demand and supply, your grid trips withing milliseconds. Different markets and roles are designed to secure stable operations. But for a trader that results in super nasty math, especially with more and more renewables entering the game. Think of it this way: Generation is of highly stochastic nature, e.g. sun shines or doesn't, you know basically 5 min ahead and can lose double digit % generation in a few minutes; same with wind. Demand is a bit more projectable, but still stochastic (depending on temperature, holidays, events, grid trips, etc.). So you have random input, random output, random pricing, random trader behaviour, etc. in a pretty fragile system and illiquid market. The arms race there is predicting and interpreting weather better and be able to trade, dispatch and balance extremely fast.\n\n  \nOn gas it's similar, a bit less dramatic because you can store and compress to a certain extent (grid doesn't trip in milliseconds, but rather minutes or hours). But trading is very much coupled to power, so it brings the same challenges as all is connected through nasty feedbacks. On top the challenge for gas is the geopolitical mess.\n\n  \nIn LNG the worst I have worked with are flexible LNG cargos, so basically you have a physical option with \"floating strikes\". Say you have a cargo LNG that is set for Japan, but you can reroute if it's more profitable to send to Europe. You can think of it as an option with the strike being the difference between European and Japanese gas price, and on top of it the freight cost and fuel difference. All of this is variable. Now if you take such a decision momentarily, you can fix all of it and lock in the profit for rerouting. The challenge starts when you need to value such an option in the future, e.g. to know how much you are willing to sell it for or buy it for. Figuring that out I would say is one of the most \"secret sauce\" for an LNG operation.\n\n  \nJust off the top of my head, no claim for completeness or anything and I'm sure there are pros around here that can challenge me on all this.",
                      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lip9es6/",
                      "created": 1723980227,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lir6bbb",
                          "score": 2,
                          "body": "Are there any stock plays that seek to capitalize on smoothing out the inherent volatility using tech, A.I., etc?",
                          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lir6bbb/",
                          "created": 1724006026,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lirq9ro",
                              "score": 1,
                              "body": "Yes, the good performing and pure play natgas traders, producers, distributors and shippers. Some other comment has mentioned a few. Key is to understand their business model though to understand what they are exposed to. Maybe you can use Co-pilot in edge to help with the DD.",
                              "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lirq9ro/",
                              "created": 1724012736,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lipklty",
          "score": 2,
          "body": "The gas situation is actually even worse. In some gas hubs like waha the price has gone negative as there is too much associated gas from the Delaware basin.",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lipklty/",
          "created": 1723985882,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "likseor",
      "score": 118,
      "body": "I produce natural gas everyday after some mexican food",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likseor/",
      "created": 1723908733,
      "depth": 0,
      "replies": [
        {
          "id": "likuiad",
          "score": 42,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likuiad/",
          "created": 1723909457,
          "depth": 1,
          "replies": [
            {
              "id": "lin16fg",
              "score": 1,
              "body": "More of a put vs call",
              "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lin16fg/",
              "created": 1723937830,
              "depth": 2,
              "replies": [
                {
                  "id": "lirjeh2",
                  "score": 1,
                  "body": "None of the shorts want anything to do with this guy.",
                  "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lirjeh2/",
                  "created": 1724010452,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lil2vgi",
          "score": 14,
          "body": "There’s nothing natural about gas after Mexican food. I would say more supernatural…. I would be more concerned about the market correction in your pants.",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lil2vgi/",
          "created": 1723912368,
          "depth": 1,
          "replies": []
        },
        {
          "id": "likynm5",
          "score": 7,
          "body": "How much gas are you producing and how much was the meal? I’m trying to get a cost basis so I can value your gas properly.",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likynm5/",
          "created": 1723910892,
          "depth": 1,
          "replies": [
            {
              "id": "likzv99",
              "score": 6,
              "body": "His carbon footprint is more than S&P 500 combined",
              "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likzv99/",
              "created": 1723911313,
              "depth": 2,
              "replies": [
                {
                  "id": "liln1o9",
                  "score": 4,
                  "body": "The Dutch invented carbon sequestration years ago with their oven.",
                  "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/liln1o9/",
                  "created": 1723919345,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lil20rm",
          "score": 2,
          "body": "So calls on Chipotle?",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lil20rm/",
          "created": 1723912066,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lilnw73",
          "score": 1,
          "body": "I would say that is green natural gas with Mexican food. Unless you get the blue natural gas. Or the brown natural gas.",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lilnw73/",
          "created": 1723919638,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lim6kku",
          "score": 0,
          "body": "This guy is trying to corner the market!!",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lim6kku/",
          "created": 1723926294,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "likym54",
      "score": 20,
      "body": "They used to call nat gas _specifically_ “the widow maker”.  \n\nGo look at some charts historically. Zoom in though. It can do godawful things to a swing trader. It is not forgiving to momentum traders. It’s just hard mode.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likym54/",
      "created": 1723910877,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil9fpc",
      "score": 15,
      "body": "As someone with 100 acres of land with undrilled but massive NG reserves, please make the price go up so someone drills me (yes, I know, phrasing).",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lil9fpc/",
      "created": 1723914643,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likpvet",
      "score": 31,
      "body": "It’s not easier to store than diesel fuel. Diesel has a shelf life but you can store it unpressurized in a simple tank",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likpvet/",
      "created": 1723907869,
      "depth": 0,
      "replies": [
        {
          "id": "likzc8s",
          "score": 5,
          "body": ">Diesel has a shelf life\n\nThis is probably the biggest challenge, and what OP actually means. I don't know about pressurized tanks and the shelf life of CNG, but maybe it's actually better.",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likzc8s/",
          "created": 1723911128,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lil3osv",
          "score": 3,
          "body": "Where the geology is there, NG can be stored in giant underground caves - natural or developed.\nBut I am not sure, if this is key.\nDiesel is extreemely easy fuel in all aspects. Therefore, it will be the most valuable. NG is not that easy, and therefore cheaper. Also why we tend to use gas, where it IS manageble.\nNG is to be abandoned in Europe, but usage is still in Development in Asia. This is of importance also to US, since the price will also depend on world market for LNG (liquified NG). The LNG market is in development and could result in elevated prices.",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lil3osv/",
          "created": 1723912648,
          "depth": 1,
          "replies": [
            {
              "id": "lil3otu",
              "score": 2,
              "body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
              "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lil3otu/",
              "created": 1723912648,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "likt2fd",
          "score": 4,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likt2fd/",
          "created": 1723908958,
          "depth": 1,
          "replies": [
            {
              "id": "liq78uw",
              "score": 3,
              "body": "Transportation via truck is less efficient and more costly than diesel. It is simply much less energy-dense. If you have a pipeline or nearby well producing gas then it become cheap",
              "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/liq78uw/",
              "created": 1723994358,
              "depth": 2,
              "replies": []
            },
            {
              "id": "limqkr0",
              "score": 2,
              "body": "Not really. Unless it’s high pressure liquid. At scale gas is stored in underground salt caverns",
              "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/limqkr0/",
              "created": 1723933670,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lilb4li",
          "score": 3,
          "body": "It’s easier to store!  Hands down!  You will not get moisture storing nat gas, you will always fight moisture with diesel!  If the tank is not full the part that is empty will condense and drop water in your diesel fuel!  Below freezing is a constant battle with diesel!  You’ll be changing filters and fighting gelling all winter long!",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lilb4li/",
          "created": 1723915227,
          "depth": 1,
          "replies": []
        },
        {
          "id": "linow6z",
          "score": 1,
          "body": "HVO is way easier (but it's lighter so belt tanks need to be filled up a bit more) and it doesn't go off like diesel",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/linow6z/",
          "created": 1723947586,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "likpcx5",
      "score": 8,
      "body": "What is your thesis? It is going up? For sure. Specially if the democrats win  the elections (disclaimer: this is not a political post). On the other hand, if Trump wins it is not a cataclysm because it is still good O&G. As you mentioned, Nat gas is a cleaner energy source because you produce less CO2 for the same amount of energy as compared with other O&G products. The governments that are not that \"green\" but still want to do something for climate change incentivize the use of Nat. Gas. So it is a kind of a win-win. Even if we go to a \"greener\" source, Nat gas will be last thing to go (compared to coal). I do not know what you plan to do, but if you want to invest, just buy shares of gas producers because we do not really know how the economy is doing. China and Europe are in slowdown so their price might go down in the short-medium future.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likpcx5/",
      "created": 1723907689,
      "depth": 0,
      "replies": [
        {
          "id": "liksrm2",
          "score": 2,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/liksrm2/",
          "created": 1723908853,
          "depth": 1,
          "replies": [
            {
              "id": "likxk4s",
              "score": 10,
              "body": "No, read up on contango / read on my other comment. Natgas is a reversal to mean commodity, not buy and hold!",
              "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likxk4s/",
              "created": 1723910509,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "likw3fm",
      "score": 6,
      "body": "The biggest risk with this trade is Putin signing a peace deal or being assassinated because Russian gas will crash the market. I am long on NAT gas.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likw3fm/",
      "created": 1723910006,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil0qzt",
      "score": 5,
      "body": "The problem is supply.  There's too much of it since it's a byproduct of getting oil.  There's so  much excess that they're burned up because transporting them would be more expensive.  So unless the supply side changes, the price won't move.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lil0qzt/",
      "created": 1723911619,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likodly",
      "score": 12,
      "body": "Exports are another big potential opportunity. My buddy bought 20,000 shares of $LNG when it was $5, about 11 years ago. It worked out well. I had some but sold at $70. Silly me. I think the natural gas export business will continue to grow.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likodly/",
      "created": 1723907344,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilad39",
      "score": 3,
      "body": "The global case for gas is very bullish at the moment. The European gas index TTF has created 40 EUR several times this week up from a low of 22.5 in march. In China and Japan demand for gas is also very high at the moment. The current high prices seem to stem from fears that Russia will stop the remaining flow of gas after the Ukrainian invasion of Kursk. \n\nHowever it is difficult for the American gas market to capitalise on these high global prices as gas must first me liquified in order to be exported as LNG, which is a major bottleneck. The main US LNG facilities lie on the coast of Texas and have been hit by several hurricanes this year resulting in less natgas becoming LNG. This is severely reducing the American export of Natgas and driving prices down in the domestic US markets.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lilad39/",
      "created": 1723914964,
      "depth": 0,
      "replies": [
        {
          "id": "lq9a7tv",
          "score": 1,
          "body": "Has this changed as of recent? Price has been going up sharply. Has that been because of the hurricanes knocking out power and driving demand (via generators), or has it been another catalyst?",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lq9a7tv/",
          "created": 1728018835,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lild4nf",
      "score": 3,
      "body": "im a massive natural gas bull. its not just the datacenter electricity demand... the US is currently constructing many LNG export facilities that will enable domestic natural gas to be sold for much higher prices overseas to other countries. this will lead to a much higher % of US natural gas to be exported, causing less supply to remain for domestic consumption, causing prices to go up.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lild4nf/",
      "created": 1723915909,
      "depth": 0,
      "replies": [
        {
          "id": "lq9a9hk",
          "score": 1,
          "body": "Do you know when these facilities will be completed?",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lq9a9hk/",
          "created": 1728018860,
          "depth": 1,
          "replies": [
            {
              "id": "lq9zem7",
              "score": 1,
              "body": "There are many facilities all in different stages of construction.",
              "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lq9zem7/",
              "created": 1728035780,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lilge2d",
      "score": 4,
      "body": "$UNL not $UNG so you significantly reduce the impact of the contango.\n\nWhen in backwardation, $UNG is a fair play.\n\nWatch out for the K1 with $UNG and $UNL.\n\nYou can also buy the natgas related companies.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lilge2d/",
      "created": 1723917020,
      "depth": 0,
      "replies": [
        {
          "id": "lilmj2d",
          "score": 2,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lilmj2d/",
          "created": 1723919165,
          "depth": 1,
          "replies": [
            {
              "id": "limrzfs",
              "score": 5,
              "body": "Also, FWIW, I had the exact same thesis as you months ago. And I traded similarly.\n\n  \nMultiple tech companies walked back their push to be carbon neutral this year. There is a reason.\n\nTo sustain AI's increase (because they know they can't be left behind even if profits are not clear yet), they know they have to increase their energy usage (by a lot). Renewable energy is not deployed fast enough, and nuclear energy is slow to deploy and problematic, especially in the US. Natural gas is one of the least dirty non-clean sources, and some data centers already have natural gas turbines to generate energy.\n\n  \nThe time frame is 1 to 5 years when things will get triggered. A short-term recession would slow down the adoption. One would need to start taking profit after a 2x increase as it will still be volatile.",
              "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/limrzfs/",
              "created": 1723934229,
              "depth": 2,
              "replies": [
                {
                  "id": "linpjp6",
                  "score": 1,
                  "body": "This guy gets it",
                  "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/linpjp6/",
                  "created": 1723947869,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lq9abas",
          "score": 1,
          "body": "What about BOIL?",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lq9abas/",
          "created": 1728018890,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lilgyg9",
      "score": 5,
      "body": "UNG and Boil are not investment vehicles. They will always go down because they trade and roll futures contracts to exxagerate price CHANGES but not price itself. You're meant to day trade them and catch the swings. You are guaranteed to lose money if you hold them long term",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lilgyg9/",
      "created": 1723917216,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilmmzp",
      "score": 3,
      "body": "I got fucked on boil once. I ain’t ever playing with that shit again",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lilmmzp/",
      "created": 1723919203,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilvcrq",
      "score": 5,
      "body": "Don't touch Natural Gas other than for a few days. Contango and the futures based investment vehicles are extremely tricky.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lilvcrq/",
      "created": 1723922299,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likphev",
      "score": 3,
      "body": "Crazy commodity that is trending lower and lower. I lost some money on it last week with BOIL, I was hoping for a short-squeeze (yeah squeeze these nuts AutoMod). Everyone is shorting the crap out of this, why get a loan and pay interest when you can short NatGas and be rewarded for it? Anyway, bullish arguments: Kamala against fracking, potentially bullish for NatGas, Ukraine invading Russia (lol) and disrupting gas production. Bearish argument: Europe less reliant on NatGas after the Russia/Ukraine war and US LNG replacement.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likphev/",
      "created": 1723907732,
      "depth": 0,
      "replies": [
        {
          "id": "linph25",
          "score": 2,
          "body": "Europe will need more gas in mid to short term. Ukraine crisis killed the pipe from Russia, but we're still buying Russian gas via proxies like India and  China. As the only continent still serious about low carbon transition, Europe will need more gas (it's classed as a \"low carbon fuel\" under the EU Taxonomy and is the regarded as the transition fuel whilst we wait for; more batteries, bigger grid, green H2 production and Nuclear to come on line in greater volumes",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/linph25/",
          "created": 1723947836,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "likv03d",
      "score": 3,
      "body": "Natural gas processes release methane which is a “super greenhouse gas.” There’s a case for the ethics of supporting that, but we will need it as a transition fuel. And petro corps are latching onto LNG to prop up their business as demand for oil slackens. All that being said, I wouldn’t be surprised if LNG becomes super regulated in the next 5 years. Depends on the election, too",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likv03d/",
      "created": 1723909628,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil0u5h",
      "score": 3,
      "body": "The u s will not devalue its gold mine resource. \n\n\nAmerica's sitting on the world's largest untapped natural gas reserve.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lil0u5h/",
      "created": 1723911649,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilfdh1",
      "score": 3,
      "body": "I worked in the energy industry amidst changing needs and times the past 5 years. Natural gas is one of the best resources we have. It is the most efficient energy source at creating heat. Further to your point about using nat gas in data centres, AI demands a lot more energy AND water than we can sustain. Nat gas will remain useful to those who use it for heat, as it is far more efficient than other energies. My favourite example is the farmers. To dry grain, corn etc which has to be done right after harvest, to maintain the value of their crops, farms will have to use $50,000 + of natural gas within a short time period. This cannot change and they’re at the mercy of the market. Natural gas is important, useful and will prove itself more valuable if water / energy problems start to hit harder.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lilfdh1/",
      "created": 1723916671,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil155y",
      "score": 4,
      "body": "Natural gas is largely a waste product in the U.S. from unconventional oil production. For example, spot prices in the Permian go negative as producers don't have enough pipeline capacity and can't flare do to corporate environmental commitments. Many hedge funds have gone tits up betting on natural gas prices to rise. Proceed at your own risk.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lil155y/",
      "created": 1723911757,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likrbae",
      "score": 2,
      "body": "Global warming, more efficient homes and appliances as well as abundant supply and storage is what's being priced in. Winters are going to be much milder.\n\nThere's other opportunities that have a higher reward for the same risk level.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likrbae/",
      "created": 1723908362,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil0r2w",
      "score": 2,
      "body": "$CRK",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lil0r2w/",
      "created": 1723911620,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilmey9",
      "score": 2,
      "body": "If NG made more sense for data centers theyd use it. Odds are its a no go because data centers get put in cheap remote places w/no NG distribution. And w/o looking Id wager NG is more expensive to deliver by truck and store. Not to mention we dont even know how often if at all data centers lose power. Id wager power reliability is a huge factor in data center location choice.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lilmey9/",
      "created": 1723919124,
      "depth": 0,
      "replies": [
        {
          "id": "linq0hm",
          "score": 1,
          "body": "Power reliability but also timely delivery. \nIn Europe, majority of locations are waiting 3-5 years for grid. Location of DCs is driven by availablity zones of the hyper scalers so it's limited to FLAP-D in Europe. These tier 1 locations have NG connections but difficult to get timely. Also don't forget the emissions permits too...",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/linq0hm/",
          "created": 1723948073,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "limdrnk",
      "score": 2,
      "body": "last thursday the report was -6 and it dropped like a stone just for fun.. watch out for the big fishes..",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/limdrnk/",
      "created": 1723928829,
      "depth": 0,
      "replies": [
        {
          "id": "lq9arsb",
          "score": 1,
          "body": "What do you mean -6?",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lq9arsb/",
          "created": 1728019155,
          "depth": 1,
          "replies": [
            {
              "id": "lq9ybln",
              "score": 1,
              "body": "instead of expected injection of 43bb they actually taken 6bb .. (aug 9th). natgas dropped instead of skyrocketing.. why do you care a month later?",
              "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lq9ybln/",
              "created": 1728035053,
              "depth": 2,
              "replies": [
                {
                  "id": "lqaveoe",
                  "score": 1,
                  "body": "Bo jestem ciekawy, chcem rozumieć co wpływa na cenę NG. Np teraz, miało totalny sens że zrobiło reverse patrząc na technical analysis, ale byłem ciekawy co się zmieniło w fundamentals. \n\nW zeszłym tygodniu był huracan (co powodował że ceny urosną) a przez następne tygodnie raczej niebeda… ale co więcej to niewiem. \n\n(Jeszcze cena nie zrobiła reverse ale trochę wygląda jak by miała, przez przynajmniej kilka tygodni)",
                  "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lqaveoe/",
                  "created": 1728050476,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "limf7fj",
      "score": 2,
      "body": "As a generator guy, diesel back gen’s are tried and true. They’re the most reliable and stable backup power on the market and have been for a very long time. Natural gas gen’s are slowly coming into the market but their reliability remains unseen. Cummins and CAT will probably profit the most from data centers being built, but who knows.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/limf7fj/",
      "created": 1723929356,
      "depth": 0,
      "replies": []
    },
    {
      "id": "limwgoh",
      "score": 2,
      "body": "When nat gas at historic lows earlier this year everyone knew the price would go up. The contango was 20% per month, so if nat gas goes up 10%  in a month you still loose 10%. UNG only holds the next month futures and rolls mid month. The actual contango hit usually doesn’t happy until Henry Hub rolls at the end of the month. \n\nThe volatility can be spectacular. Personally I trade the volatility and you absolutely cannot hold UNG long term. I typically hold a couple days to a week. Because of the contango drag all time lows on UNG are a common feature. If you perform technical analysis it must be done on the Henry Hub not UNG.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/limwgoh/",
      "created": 1723935995,
      "depth": 0,
      "replies": [
        {
          "id": "lq9avb9",
          "score": 1,
          "body": "What about BOIL?",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lq9avb9/",
          "created": 1728019210,
          "depth": 1,
          "replies": [
            {
              "id": "lqbhrpo",
              "score": 1,
              "body": "Off the top of my head I'm thinking BOIL holds the next 2 months of futures, but it is also leveraged. Most leveraged funds have a daily reset. I'm not sure how BOIL achieves the leverage, I'm not interested in levered funds, especially on something known as the widow maker. If it does have a daily reset then it is really only appropriate for day trading. If you try to swing trade it and the price whipsaws as it moves towards your target that will be an additional drag on performance that stacks the deck against an otherwise correct call in the price movement.",
              "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lqbhrpo/",
              "created": 1728057781,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lin3e0b",
      "score": 2,
      "body": "Buy the transport companies that will benefit no matter what and also pay a sweet dividend. Energy Transfer ($ET)",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lin3e0b/",
      "created": 1723938706,
      "depth": 0,
      "replies": []
    },
    {
      "id": "linoac8",
      "score": 2,
      "body": "From a standby generator perspective, diesel/gas generates higher kw, natural gas slightly less and and it burns out quicker. Also, it's easier to get gasoline or diesel and store it than natural gas/propane simply because propane is not readily available aside from the gas grill requirement. Ideally, get a dual fuel system and store some natural gas tanks \"propane \" to last about a week or so. By that point, you would be able to at least go somewhere and buy gas or diesel. I should say I'm speaking from a rural area and not a populated city.\n\n*edit to fix grammar",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/linoac8/",
      "created": 1723947325,
      "depth": 0,
      "replies": []
    },
    {
      "id": "linwff9",
      "score": 2,
      "body": "If the data centers stay running that for sure means they will need more intel chips 🚀",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/linwff9/",
      "created": 1723950908,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lionkza",
      "score": 2,
      "body": "There is a somewhat likely longterm scenario where nat gas sees negative pricing. \n\nI'm late to it and it's been said already but nat gas prices are inversely correlated to crude prices.  So when the price of oil is up high enough that operations ramp up, the natural bi-product of those operations natural gas sees a supply glut...\n\nThere is only so much storage for this glut in supply, and the technology/demand for conversion to LNG cant keep up as of yet either.  So as the demand for storage increases past the actual price of nat gas, nat gas prices turn negative.  As long as this is a net positive for oil producers, they could care less about the biproduct.\n\nIn the past nat gas would just be burnt off at the wells in these supply glut scenarios... but due to tighter regulation and fines for doing so that becomes an even more costly last  resort.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lionkza/",
      "created": 1723965796,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liotsmf",
      "score": 2,
      "body": "I agree that Natural gas consumption is projected to increase due to its role as a ‘bridge fuel’ in the energy transition. It offers lower emissions than coal, supports renewable energy integration, and meets growing energy demands in developing economies. Additionally, the expansion of LNG infrastructure is opening new markets, further driving global demand for natural gas.\n\nLong-term investment with a 1:1 correlation to natural gas prices is complicated due to the nature of available financial instruments. Most natural gas ETFs and funds invest in futures contracts, which are subject to contango and backwardation effects. These phenomena can cause significant tracking errors over time, as the funds must regularly roll over contracts, often at a loss. Additionally, the inherent volatility of commodity prices and the influence of various external factors like weather, geopolitics, and supply-demand dynamics make it difficult to maintain a consistent long-term correlation with spot prices\n\nSome alternatives:\n\nIntegrated energy companies\n\nNatural gas infrastructure stocks\n\nUtilities with natural gas exposure\n\nNatural gas equipment and services\n\nEnergy ETF",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/liotsmf/",
      "created": 1723969969,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lip0bht",
      "score": 2,
      "body": "Bloom Energy manufactures fuel cells that run on natural gas that power data centres, they have a ~$14bn order backlog but are still pre profitability... That may be a more interesting play if you're bullish on data centre power demand than the gas specifically",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lip0bht/",
      "created": 1723974423,
      "depth": 0,
      "replies": [
        {
          "id": "lip21rd",
          "score": 1,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lip21rd/",
          "created": 1723975583,
          "depth": 1,
          "replies": [
            {
              "id": "lip6l2m",
              "score": 1,
              "body": "NwW they have Intel and AWS as previous customer, and loads of ex Tesla guys working to scale their manufacturing IIRC. Interesting company, but share price performance has been poor",
              "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lip6l2m/",
              "created": 1723978561,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lipbp13",
      "score": 2,
      "body": "If you like gas have a look at Empire Energy (ASX: EEG) moving in to production next year with the largest gas reserve in Australia. They’ve already got supply agreements, government support and gas more broadly I believe will be the key source of energy over the next 10 years as we continue the transition to renewables. I see a long term increase in demand and price, meanwhile stocks are undervalued perhaps because of the negative sentiment against fossil fuels. When reality hits, leaving anti-fossil fuel sentiment in its wake, there’ll be room for good growth.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lipbp13/",
      "created": 1723981503,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lipxvyw",
      "score": 2,
      "body": "[deleted]",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lipxvyw/",
      "created": 1723991083,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lit2tiw",
      "score": 2,
      "body": "Backup power generators start up occasionally to keep the engine from seizing up and to be sure they are in working order. \n\nOtherwise, how much uptime do they have? \n\nIf the primary power source is good, backup power may not be needed for years on end.\n\nBackup power is probably not a driver of the energy markets, unless you have some good data that shows otherwise.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lit2tiw/",
      "created": 1724030809,
      "depth": 0,
      "replies": []
    },
    {
      "id": "llob55z",
      "score": 2,
      "body": "I expect an uptick in spot/futures going into fall/winter.  We’re about to enter the heating season; heating demands more natgas consumption than cooling. Parts of country are still reporting record high temps right now, though, so we’re very early to that season transition. \n\nBecause national supply is still high relative to yearly averages, another mild winter will hurt an uptrend on spot/futures price. Look for a breakdown in futures early to mid winter. \n\nButttt because the FED may start to lower interest rates and inflation re-acceleration is a threat, spot natural gas prices may rise and bring futures up with it. \n\nIf you see bitcoin up past $70k, chances are natural gas has already rallied. \n\n❤️‍🔥",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/llob55z/",
      "created": 1725563546,
      "depth": 0,
      "replies": [
        {
          "id": "lq9dzj3",
          "score": 1,
          "body": "How would Bitcoin price correlate a nat gas rally? Or why would NG front run it?",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lq9dzj3/",
          "created": 1728021072,
          "depth": 1,
          "replies": [
            {
              "id": "lqa1y38",
              "score": 1,
              "body": "Think of the concept of cost of production.",
              "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lqa1y38/",
              "created": 1728037414,
              "depth": 2,
              "replies": [
                {
                  "id": "lqauss7",
                  "score": 1,
                  "body": "Ah you mean people using natural gas generators to power Bitcoin mining?",
                  "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lqauss7/",
                  "created": 1728050267,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lqavcpl",
                      "score": 1,
                      "body": "Sure :)",
                      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lqavcpl/",
                      "created": 1728050458,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "likqliq",
      "score": 3,
      "body": "Most data centers use electricity from the grid.  Is your expectation that the grid will suddenly not be available for significant periods of time?",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likqliq/",
      "created": 1723908118,
      "depth": 0,
      "replies": [
        {
          "id": "liktlap",
          "score": 1,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/liktlap/",
          "created": 1723909139,
          "depth": 1,
          "replies": [
            {
              "id": "lild87i",
              "score": 1,
              "body": "But if you don‘t expect the grid to be less reliable, why would you expect natural gas demand to materially increase?  How much natural gas are you expecting to be used?",
              "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lild87i/",
              "created": 1723915942,
              "depth": 2,
              "replies": [
                {
                  "id": "liluphl",
                  "score": 1,
                  "body": "A significant portion of electrical generation at power plants is from burning natural gas.  This will increase significantly because of data center.  They are using less coal all the time.",
                  "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/liluphl/",
                  "created": 1723922063,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "limds8y",
                      "score": 1,
                      "body": "But that’s not what OP is talking about. \n\nAnd it’s not like the natural gas curve isn’t significantly more in the future (almost like traders are anticipating a demand increase). ",
                      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/limds8y/",
                      "created": 1723928835,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "likzmuq",
      "score": 1,
      "body": "Natural gas prices are pegged to crude oil prices as far as I know",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likzmuq/",
      "created": 1723911231,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil98uk",
      "score": 1,
      "body": "They would have to swap or convert generators.\n\nThey are already signed into diesel fuel contracts.  \n\nAll the stuff that makes nat gas a better option is behind the scenes!  Current diesel levels are monitored by the fueling company, refilled by them.  So price is the only thing that’s factored in. \n\nThe previous company I worked for were in 20 year contracts with un-names but your top tech companies. To follow around their construction crews and fill their machines and after the data center builds, monitor and fill their generators.\n\nI’m not claiming no one is making the change, but diesel prices will have to look grim for a long time for companies to make this change!",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lil98uk/",
      "created": 1723914578,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilut7b",
      "score": 1,
      "body": "You better make sure your president allows more export licenses",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lilut7b/",
      "created": 1723922101,
      "depth": 0,
      "replies": []
    },
    {
      "id": "limjk7f",
      "score": 1,
      "body": "I keep a BOIL position around at lows to sell on spikes.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/limjk7f/",
      "created": 1723930968,
      "depth": 0,
      "replies": []
    },
    {
      "id": "limn9j3",
      "score": 1,
      "body": "What about EQT?\n\nDude got fingers in the data center and LNG pie.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/limn9j3/",
      "created": 1723932381,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lin8cyx",
      "score": 1,
      "body": "This reminds me of a joke I have been thinking of the past few days.  Something my bro told me after a quick pit stop….\n\n“The best Italian food in Las Vegas is on the ceiling of a Bellagio bathroom.”",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lin8cyx/",
      "created": 1723940705,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lineoge",
      "score": 1,
      "body": "UNG? What is this, r/investing ? True regarded way to be long natural gas is BOIL calls.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lineoge/",
      "created": 1723943280,
      "depth": 0,
      "replies": []
    },
    {
      "id": "linjzu1",
      "score": 1,
      "body": "If one of Russia’s LNG facilities were to say, get blown the fuck up, than the price would probs go up.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/linjzu1/",
      "created": 1723945515,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lioa660",
      "score": 1,
      "body": "I’m holding off on playing energy until after the election. If trump wins, he’s gonna wanna get back to energy independence, and that means calls on XLE",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lioa660/",
      "created": 1723957642,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lionf3u",
      "score": 1,
      "body": "10-20% lol calls on diesel",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lionf3u/",
      "created": 1723965691,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liqsy00",
      "score": 1,
      "body": "Hey,\n\nSo NG as a future just dipped to 1.90 now a bit over 2.00.\n\nI know we are all broke but the numbers are interesting.\n\nhttps://preview.redd.it/4o2fgcfehgjd1.png?width=3676&format=png&auto=webp&s=0ffdfe86adea4c56fd108fde9c475ab9bfac13a0\n\nSo if you have 70k it is my opinion that it is basically a win (you can always just rollover to next contract) unless it goes negative like crude did and then you are F’ed.  There maybe a mini or micro for NG to make it possible for all of us who do not have 70k sitting around.\n\nAlso, this chart assumes price will never go below 0.62 which it could go below 0.62 and this would increase your total risk.\n\nWARNING: I think this is right…could be wrong and would be happy to get some feedback.\n\nTHIS IS NOT FINANCIAL ADVICE NOR ADVICE YOU SHOULD TAKE ANY DECISION OR ACTION UPON.\n\nEDIT: made number plural in second sentence. EDIT 2: Actually on the platform I use the margin requirement is $5,084.53 so total margin would drop to $20,338.12.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/liqsy00/",
      "created": 1724001604,
      "depth": 0,
      "replies": [
        {
          "id": "liqsy1k",
          "score": 1,
          "body": "PUT YOUR HANDS UP Cuentacero!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/liqsy1k/",
          "created": 1724001605,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lq9dmvz",
          "score": 1,
          "body": "How is downside 30,000 on entry 4? Shouldn’t it be reversed, 30,000 on entry 1, down to 0 at entry 4? (Assuming it never goes below 0.62)",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lq9dmvz/",
          "created": 1728020859,
          "depth": 1,
          "replies": [
            {
              "id": "lqabaa1",
              "score": 1,
              "body": "Maybe the term I am using is confusing/incorrect.\n\nThe positions are long NG. Downside means unrealized losses. Each 50 cent move down generates $5,000 loss per contract.\n\nSo, a $0.50 drop equals $5,000 unrealized loss on the first position.\n\nThen you enter position 2.\n\nSo, another $0.50 drop equals a $10,000 unrealized loss on position 1 and a $5,000 dollar unrealized loss on position 2.\n\nThen you enter position 3.\n\nSo, another $0.50 drop equals $15,000 unrealized loss on position 1, a $10,000 unrealized loss on position 2, and a $5,000 loss on position 4.\n\nThen you enter position 4.\n\nThere the exercise stops and the total unrealized loss at this point is $15,000 + $10,000 + $5,000 = $30,000.\n\nIf price goes down the unrealized loss continues to grow.\n\n\nEDIT 1: For further clarity, at the point of entry on position 4 the unrealized loss of only position 4 is $0.00, but the accumulated unrealized loss is $30,000.",
              "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lqabaa1/",
              "created": 1728042464,
              "depth": 2,
              "replies": [
                {
                  "id": "lqauovj",
                  "score": 2,
                  "body": "Ahhh I see. Thanks for clarifying. \n\nThat’s a cool sheet you put together. I’ll try to do something like that myself, looks helpful",
                  "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lqauovj/",
                  "created": 1728050228,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lirtw9w",
      "score": 1,
      "body": "Hydrogen gas is free of charge, and so; why choose natural gas as a power backup source?\n\nBuy an electrolyser, fill it with water, collect the \"H2\", store it, then use a Hydrogen fuel cell\n\n#OR\n\nOwn and operate a (very) small hydrogen power plant and generate limitless electrical energy.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lirtw9w/",
      "created": 1724013933,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lismjnm",
      "score": 1,
      "body": "As other people have said, any product that rolls futures (like UNG, a product that goes long front month futures, waits till they get close to expiration then sells the position and puts on a similar position in futures expiring later) is going to have \"negative roll yield\" while the futures curve is in contango.  Basically, you're buying high and selling low.\n\nBut more importantly, natural gas prices are not just supply and demand of natural gas.  Fracking (which is a lot of US oil production) releases natural gas along with the desired oil.  So the supply of natural gas isn't always matched to actual demand.\n\nAlso, do you really want to own a 100% vol asset that isn't a shiny coin that you can make into your personality (aka Bitcoin?). There are more fun ways to give yourself brain damage.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lismjnm/",
      "created": 1724024400,
      "depth": 0,
      "replies": [
        {
          "id": "lq9dveq",
          "score": 1,
          "body": "Where do you see people turning Bitcoin into their personality? \n\nI think I know what you mean but hadn’t noticed it",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lq9dveq/",
          "created": 1728021001,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "likvs9f",
      "score": 1,
      "body": "Nat Gas might be good for in extreme cold climates and for backup power; but, a heat pump is better for climates that generally stay above 0 Fahrenheit because it avoids running gas lines. \n\nHydrogen will probably replace natural gas. Unless the problems with blue hydrogen are solved, natural gas isn't likely to be used for producing hydrogen.\n\nI don't see it as a good long-term investment.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likvs9f/",
      "created": 1723909901,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likvvb6",
      "score": 1,
      "body": "Natural gas is very hard to store, very complex to transport and the final users are limited and even if price drops by half it won’t affect immediate demand for reasons above.\n\nPlus its use is likely to diminish more so over the near term as Japan turns on nuclear power plants and as china and the world’s economy slows down \n\nIts at a 10 year low not because its currently  valuable\n\nAlso, natural gas exporters sink billions into the mining and shipping plants with multi decade outlooks. The price could half and they will not stop production until they cannot produce 1 cent of profit. \n\nUnless something major occurs which it likely wont then the best advice is short or look else where.\n\n\nAlso, a natural gas long is to also have a somewhat bearish view on USD \n\nLook at natural gas prices in CHY,JPY,EURO,GBP (countries importing) it’s not at a 10 year low \n\nShort it.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likvvb6/",
      "created": 1723909930,
      "depth": 0,
      "replies": [
        {
          "id": "lq9e4me",
          "score": 1,
          "body": "Why is a nat gas long, a bearish view on the USD?",
          "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lq9e4me/",
          "created": 1728021157,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "likvtlm",
      "score": 0,
      "body": "My thought is that you should stop coming up theses",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/likvtlm/",
      "created": 1723909913,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilde3q",
      "score": 0,
      "body": "I just had a black coffee and a food truck breakfast burrito. Nat gas is at an all time high. Bullish",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/lilde3q/",
      "created": 1723915998,
      "depth": 0,
      "replies": []
    },
    {
      "id": "linhb32",
      "score": 0,
      "body": "You’re assuming that all these data centers run on backup power.",
      "permalink": "/r/wallstreetbets/comments/1eujrxu/my_natural_gas_thesis_would_like_to_hear_more/linhb32/",
      "created": 1723944384,
      "depth": 0,
      "replies": []
    }
  ]
}