{
  "title": "About to go 80% Bonds",
  "score": 110,
  "selftext": "[deleted]",
  "link_flair_text": null,
  "id": "1euk3wx",
  "num_comments": 272,
  "created_utc": 1723907814,
  "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/",
  "comments": [
    {
      "id": "likroap",
      "score": 139,
      "body": "Makes sense in the surface but my question would be what does 80% of your portfolio represent to you? Like it that the equivalent of a decade of living expenses? More? For example if your portfolio was $10mm and your living expenses are roughly $100k a year I’d say 80% is too much to move into bonds or cash alternatives. It’s obviously a question very specific to all of your own unique circumstances but the counterpoint to security is you very well may live another 30 years or so, so keeping a decent chunk in the market growing faster than bonds can also make sense",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likroap/",
      "created": 1723908485,
      "depth": 0,
      "replies": [
        {
          "id": "likwi3x",
          "score": 40,
          "body": "And this is the key issue.  How long will I live? Will I need long term health care? Will my spouse or i need a bypass one day? \n\nAs you said it comes down to the individual unique circumstances. \n\nMy thinking is 80% bonds might be too much. But I believe the current risks are quite significant so for now I would rather error on the conservative side.",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likwi3x/",
          "created": 1723910148,
          "depth": 1,
          "replies": [
            {
              "id": "lilbnwx",
              "score": 34,
              "body": "The stock market generally recovers within five years of a crash. I'd only sell stocks for bonds if I needed money in the 1-to-5 year timeframe.",
              "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilbnwx/",
              "created": 1723915410,
              "depth": 2,
              "replies": [
                {
                  "id": "limdj0i",
                  "score": 4,
                  "body": "If you are in, or near, retirement it is generally accepted practice to move out of the stock market to a reasonable degree.  That 1-5 years doesn't matter much for 30, 40, or even 50 year olds, but drawing from the principle if you are retired will kill your account in a market downturn. \n\n\nYou shouldn't be chasing major growth if you are fully retired.   Bonds are for preserving wealth you built up leading to retirement, not about growth.  \n\n\nAt four years to retirement, it is a good idea to redistribute your assets to less volatile assets.",
                  "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/limdj0i/",
                  "created": 1723928742,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "likyi2o",
              "score": 45,
              "body": "Just and FYI but in 2019 I hired a wealth manager to manage my money and said “I know something is coming, but I don’t know what, I want to be super low risk”. This was because we’d had ten years of straight growth and were living through an “unpredictable” administration.\n\nSo my wealth manager put me about 45% in to bonds, because he agreed with me that, that at least a correction of some sort was coming, and bonds have been for the last 40 years a safe bet, because people run to them in times of crisis and they they don’t depreciate.\n\nWRONG.\n\nWhile I didn’t fare as bad as those people in just stocks, the bonds shat the bed too, as even they went south. \n\nThe most annoying part as that there were opportunities  to catch the upswing (online retailers, healthcare, pharma etc) but I couldn’t do anything because my money was tied up in bonds and stocks that were deep negative and it meant realizing those losses if so.\n\nI had to weather it out for 9 month months in which time I fired him and got a new company that gave me a mix that’s far more diversified.\n\nSo the moral of the story is diversification is key. Bonds are only slightly more stable than stocks but they are not impervious to the markets either.",
              "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likyi2o/",
              "created": 1723910838,
              "depth": 2,
              "replies": [
                {
                  "id": "lil4quv",
                  "score": 39,
                  "body": "> the bonds shat the bed too\n\nBonds will literally always fully return your principle at maturity and guarantee the yield you bought them at assuming you don't sell until their duration is up.  You only risk losing out on bonds if you panic sell after rates were to increase (as is the case after 2019) as this would make your bonds relatively worth less, but like I said there is no penalty for holding bonds until maturity as you will receive the face value of the bond at the date of the final interest payment and you will still receive all expected interest payments as normal.",
                  "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil4quv/",
                  "created": 1723913021,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lilettc",
                      "score": 12,
                      "body": "Right but you’ll receive your yield in inflation-adjusted terms. While equities will theoretically increase rates of return commensurate to inflation",
                      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilettc/",
                      "created": 1723916485,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lilft67",
                      "score": 2,
                      "body": "Absolutely, but the problem was that even though I had a ladder, I was locked in for no less than 9 months at a time, which as I said sucked because I could get in to anything else.\n\nAnd don’t forget, if that company goes under  their bonds can be worthless. It’s rare but it happens.",
                      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilft67/",
                      "created": 1723916818,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lililw6",
                          "score": 3,
                          "body": "Well firstly I would say unless you are an experienced investor you shouldn't be buying anything other than US treasuries or municipal bonds given your tax circumstance as the risk of the United States going under is comparatively low to any other investment. And even when investing in corporate bonds, unless you are buying Junk bonds (BB and below) the odds of a default are generally very low.\n\nSecondly, you put too much money into long duration bonds given your goals of trying to time a downturn, and if you were concerned about buying a dip you should have had the foresight to allocate however much money you would use to time the market into a money-market account or short duration T-bills.",
                          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lililw6/",
                          "created": 1723917788,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "likzmq5",
                  "score": 16,
                  "body": "Ppl who have been just stocks since 2019 have mostly made good money ?",
                  "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likzmq5/",
                  "created": 1723911230,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lilq2c6",
                      "score": 3,
                      "body": "Pick any year in history, including 2019, and your statement would also be correct. OP has been using Fox News commercial breaks as his portfolio advisor.",
                      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilq2c6/",
                      "created": 1723920399,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lim13hd",
                  "score": 4,
                  "body": "This is the problem with some bond investments - if you are in a bond fund or have a variable rate bond, you likely don’t get the protection you seek. \n\nI’ve started allocating a larger portion of my investments to bonds but I purchase specific company and government bonds that have fixed interest rates and are longer duration (2040+). I’ve locked in quite a few of these at 7-9% rates for high quality bonds which makes me feel significantly better about the protection they offer me.",
                  "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lim13hd/",
                  "created": 1723924367,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lim2x9o",
                      "score": 1,
                      "body": "Yeah, I’d like that too for longer horizon stuff and thats great returns but my issue is that he didn’t leave anything that could be easily and quickly liquidated (per my brief) and I was locked in for minimum 9-18 months for about 40% of my portfolio (again contrary to my instructions because he overconfidently believed bonds would never go down in a downturn).",
                      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lim2x9o/",
                      "created": 1723925013,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "limjo1o",
                      "score": 1,
                      "body": "Honest question here…. I know a rate of 7-9% sounds great, but isn’t inflation likely to take a big bite out of that?  I understood that to be the argument against long term bonds.  Just trying to learn here…",
                      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/limjo1o/",
                      "created": 1723931009,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lil49xp",
                  "score": 4,
                  "body": "I think that we look at % as a way to manage portfolios rather than time. I’m close to retirement and started to sell equities with the plan to have safe money (bonds) for the equivalent of three years worth of withdrawals (so I don’t sell good equities at a low price during a bear market). That’s less than 20% of my portfolio. Might be a different % for someone else. I picked three years because the economy won’t be in the tank that long. I could be totally wrong - let’s chat again in 20 years.",
                  "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil49xp/",
                  "created": 1723912855,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lilpaa0",
                  "score": 2,
                  "body": "Rates were very close to zero in 2019 which is why bonds shat the bed.",
                  "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilpaa0/",
                  "created": 1723920126,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lil8w8a",
                  "score": 3,
                  "body": "“Slightly more stable than stocks” well thats enough reddit for me today.",
                  "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil8w8a/",
                  "created": 1723914457,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lilz5yv",
                  "score": 2,
                  "body": "Firing a wealth manager for doing what you asked is quite funny icl",
                  "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilz5yv/",
                  "created": 1723923677,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lim0rt5",
                      "score": 1,
                      "body": "It would be, if they did what was instructed, which was was to leave a portion of the funds in some low risk vehicle that was easily liquid stable to capitalize on opportunities that arise. Instead they allocated way too much to long term bonds because “bonds have never gone down in a downturn”. \n\nThe bank who referred them also stopped recommending them because they screwed up with a second client in the same period.",
                      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lim0rt5/",
                      "created": 1723924250,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "limiudz",
                          "score": 2,
                          "body": "ah yeah well that makes far more sense with context",
                          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/limiudz/",
                          "created": 1723930705,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lilnr1v",
                  "score": 2,
                  "body": "Never take advice from market predictors.  Clowns.",
                  "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilnr1v/",
                  "created": 1723919589,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lilgij1",
                  "score": 1,
                  "body": "Looking back on it what would rather him to do? You fired him for being low risk, would you have fired him if he went 90% cash and you lost out to inflation?",
                  "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilgij1/",
                  "created": 1723917062,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lilnkl2",
                  "score": 1,
                  "body": "You fired your finance manager for doing what you told him to do? Neat!",
                  "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilnkl2/",
                  "created": 1723919528,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lilp1tg",
                      "score": 1,
                      "body": "It was that he didn’t do what I said. I wanted super low risk and money available to seize specific opportunity if it arose. Instead he got in to corporate bonds so heavily with no effective liquidity (against my initial brief) that we couldn’t be agile for opportunities. \n\nThats exactly what I have now (Tbills for cash) and it’s worked beautifully.",
                      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilp1tg/",
                      "created": 1723920044,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lilppbm",
              "score": 11,
              "body": "I took a little dive into your profile. PLEASE don't make this decision on your own. Your financial knowledge appears to be rudimentary at best, and I believe you're getting some really bad advice from some bad actors.",
              "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilppbm/",
              "created": 1723920272,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lilp0ig",
              "score": 3,
              "body": "You still have a long horizon. I would research 60/40 portfolios and how they have faired over the years. I am retiring next year and am about 70/30. I am long the American economy and diversified. \n\nOne risk you did not list is inflation which would cause significant issues with an 80 percent bond portfolio.",
              "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilp0ig/",
              "created": 1723920031,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lil6li6",
              "score": 1,
              "body": "If you have substantial capital, you could explore some lifetime income annuity products.  Come up with an annual living expense figure and let the actuaries figure it out.  Keep the rest invested or split however you like with a bit more comfort about a guaranteed stable income.  \n\nI know these kinds of products are controversial if you are younger, but if you're actually nearing retirement and concerned about headwinds, they can make a lot of sense.",
              "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil6li6/",
              "created": 1723913661,
              "depth": 2,
              "replies": [
                {
                  "id": "lilahyr",
                  "score": 2,
                  "body": "Agreed on an annuity. OP could look at an indexed or immediate annuity, and never have to worry about it. Assuming he has a pile of cash. He would get the same payout for life potentially.",
                  "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilahyr/",
                  "created": 1723915010,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lim3bzd",
          "score": 2,
          "body": "Good point!",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lim3bzd/",
          "created": 1723925159,
          "depth": 1,
          "replies": []
        },
        {
          "id": "liluual",
          "score": 1,
          "body": "Hmmm I am trying to understand the logic, say if the portfolio in fact is 10MM and expenses are 100k/yr OP will spend only 3MM before kicking the bucket leaving 7MM to his kids. On the other hand a mere 1% return on 10MM will be 100k that means that his kids will inherit 10MM when he leaves this world.",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/liluual/",
          "created": 1723922113,
          "depth": 1,
          "replies": [
            {
              "id": "lilw7kk",
              "score": 2,
              "body": "The logic would be to maximize funds. As you had OP would only spend 3mm over 25-30 years, so why put $8mm (80% of the hypothetical total) into bonds when that seems like pretty clear overkill. It would make more sense to put let’s say half in bonds/cash alternatives which will reasonably provide for the rest of your life expectancy. Then still leave $5 million to grow. That would be left to kids, charity, etc. in the event more unplanned life expenses come up the $5 million in equities would in theory provide extra cushion for the later years",
              "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilw7kk/",
              "created": 1723922605,
              "depth": 2,
              "replies": [
                {
                  "id": "lilwp09",
                  "score": 2,
                  "body": "I see, that makes sense. Thanks!",
                  "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilwp09/",
                  "created": 1723922779,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "likyjek",
      "score": 39,
      "body": "2-3 years away from retirement. \n\nI have 2-3 years of living expenses in cash CD and tbills. This allows me to not care what happens to the market now. \n\nI have 60% of my portfolio in dividend producing ETFs. This generates enough cash to cover a year of expenses. I can reinvest this the dividends or allocate to cash or to growth. \n\nThe remainder is in growth. \n\nThis should help protect me from prolonged market downturns.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likyjek/",
      "created": 1723910850,
      "depth": 0,
      "replies": [
        {
          "id": "lil1f6f",
          "score": 8,
          "body": "This is the way! Came here to say something similar but you covered it nicely. Growth ETFs is the way with enough in cash or cash equivalents to hold through a prolonged recession or downturn.",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil1f6f/",
          "created": 1723911856,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lilgx7c",
          "score": 2,
          "body": "And if a crash happens and you switch to drawing cash, your AGI could be so low that you’ll get free ACA healthcare, that’s a pretty good return on your cash, and you don’t drawdown.",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilgx7c/",
          "created": 1723917203,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lil068w",
      "score": 15,
      "body": "TBH, your 5 reasons not to invest in stocks do not reflect someone who have invest in stocks most of his life.\n\nThere has ALWAYS been a lot of uncertainty. There has been period of even greater uncertainty (COVID, Great Financial Crisis...) and we know what stocks returned after. Uncertainty is a constant in markets and has not prevented stocks to outperform bonds massively over the long term, and even on shorter periods of time.\n\nStocks will not win every year. They may even have bad returns for a few years. But volatility and short term pain is the price to pay for long term gains.\n\nObviously, i do not know your whole financial situation. Low risk investments makes sense for short term needs. But your retirement may last 25+ years, so 80% bonds makes little sense in that regard, unless you plan to time the market which tends to fail for most people. Maybe a 40%-50% would be a better middle ground.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil068w/",
      "created": 1723911418,
      "depth": 0,
      "replies": [
        {
          "id": "lilyums",
          "score": 1,
          "body": "The problem with timing the market is that it's impossible (for just the layman person).  You might get lucky.",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilyums/",
          "created": 1723923565,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "likqpj4",
      "score": 30,
      "body": "My dad is in the same position and this was my advice to him. After Covids dump he became super paranoid that he would lose everything and we came up with this solution for his peace of mind and risk aversion. He definitely left money on the table, but he sleeps so much better.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likqpj4/",
      "created": 1723908157,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likua91",
      "score": 17,
      "body": "You need some stability but 80 percent may be too much in bonds, you don't want to outlive your money, the money needs to last as long as you do.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likua91/",
      "created": 1723909380,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil03fw",
      "score": 14,
      "body": "Just want to say at any point in time you can pick like 5 major reasons for potential market turmoil. Literally any point in history",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil03fw/",
      "created": 1723911391,
      "depth": 0,
      "replies": [
        {
          "id": "lilac7i",
          "score": 3,
          "body": "Yea... this.",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilac7i/",
          "created": 1723914956,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "likvl5q",
      "score": 9,
      "body": "There's always going to be something you can point to and fear monger yourself. Election chaos? In 4 years you'll be well past this election and looking at the next. Ukraine is pretty isolated to just Ukraine and Russia, despite some rhetoric. Recession, maybe? But you've got 4 years. I wouldn't go bonds, but do what you want. I'm a riskier type of person, and if the market wasn't where I wanted it to be, I would just work another year or two until it was - and be much better off than otherwise.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likvl5q/",
      "created": 1723909832,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likqjl3",
      "score": 43,
      "body": "absolutely the right play if you’re nearing retirement regardless of what’s happening in the world IMHO\n\nbesides bonds you can do HYSA or low risk dividends but honestly just go for the former ",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likqjl3/",
      "created": 1723908099,
      "depth": 0,
      "replies": [
        {
          "id": "likvi73",
          "score": 9,
          "body": "80% is too high, if you're about to retire the time horizon of your investments will still have like 20 years given the average life expectancy. About 25%, max 50% is much better (about 5-10 years of spend). You're just leaving too much money on the table.",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likvi73/",
          "created": 1723909803,
          "depth": 1,
          "replies": [
            {
              "id": "likvtn8",
              "score": 0,
              "body": "Honestly depends on withdrawal % if it is too much.",
              "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likvtn8/",
              "created": 1723909914,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lilb0k9",
          "score": 2,
          "body": "Unfortunately as rates get cut the HYSA will as well.",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilb0k9/",
          "created": 1723915189,
          "depth": 1,
          "replies": []
        },
        {
          "id": "liku495",
          "score": 1,
          "body": "The thing about bonds leading up to rate cuts is you are likely to see the value of the bonds go up as the yields go down. So another positive in the current environment with looming rate cuts",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/liku495/",
          "created": 1723909323,
          "depth": 1,
          "replies": [
            {
              "id": "likv4a2",
              "score": 4,
              "body": "Which price movement? There are multiple cuts priced in already..",
              "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likv4a2/",
              "created": 1723909669,
              "depth": 2,
              "replies": [
                {
                  "id": "likz3my",
                  "score": 3,
                  "body": "That may be true. I have a 5 month old and haven’t kept up with anything, let alone bond prices.",
                  "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likz3my/",
                  "created": 1723911045,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lilnxs3",
          "score": 1,
          "body": "Putting money that won’t be used for 20 years in bonds is a bad idea.",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilnxs3/",
          "created": 1723919653,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lil0bv4",
      "score": 4,
      "body": "I’ve bought fed home loan bank agency’s bond before because they pay 6%.   Unfortunately, they are continuously callable.    They ended up handing my money right back to me , even before the first interest payment.   Agency bonds aren’t all they’re cracked up to be.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil0bv4/",
      "created": 1723911472,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil1pqa",
      "score": 3,
      "body": "You are really worrying too much about geopolitical issues. Are you invested in oil? Own lots of Russian Rubles? Yen?\n\nWith the exception of possibly the last item on the list, none of these items will really increase systemic risk to US banks. The only geopolitical conflict that would seriously cause the global economy to meltdown is a confrontation between the U.S. and China (as we learned during Covid all manufacturing runs through the Pearl River Delta and the South China Sea!) and I find it interesting that this didn’t make your list. \n\nRussias economy is the size of Italy and Ukraines is even smaller, nothing is going to change in the U.S. equities market or banking system if they escalate. Ukraine just invaded Russia and nothing happened. “Recession possibilities” have been hyped hysterically for years with absolutely no result. We know the Fed is lowering rates this next quarter and every major bank is revising their economic estimates and removing any risk of recession. \n\nI know I sound too optimistic, but I’ve seen people screaming recession for years when all the economic indicators were worse, and they’ve all improved since then. We had a systemic banking problem create a bank run and the economy shrugged it off. A bunch of Trumpers trying to do Jan 6th 2.0 or Iran and Israel shooting missiles at each other isn’t going to crash the American economy. It’s not the 1970’s anymore. We produce most of our oil and most of the foreign supplies we need don’t even come from the Middle East.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil1pqa/",
      "created": 1723911959,
      "depth": 0,
      "replies": [
        {
          "id": "linlepk",
          "score": 1,
          "body": "Great read.  Thanks",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/linlepk/",
          "created": 1723946097,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "likxin5",
      "score": 12,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likxin5/",
      "created": 1723910495,
      "depth": 0,
      "replies": [
        {
          "id": "likyh8o",
          "score": 2,
          "body": "As I see, bonds are like 5%, sp500 10% avarege(but shit can happen) and his dad has retairement  in few years so it's not really timing the market, just calculation that he is safer in few years and safe bet.\n\nI am from eastern europe an 5% on large sum is ok for sure..",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likyh8o/",
          "created": 1723910830,
          "depth": 1,
          "replies": [
            {
              "id": "lil2psp",
              "score": 2,
              "body": "Anytime you pull out of the market because you think it's going down, you are timing the market. Time in the market beats timing the market.",
              "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil2psp/",
              "created": 1723912312,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lil3xrt",
          "score": 2,
          "body": "For what it's worth, it is typically advisable to move your retirement account out of the stock market as you approach retirement.  This is because market downturns can, and will, drawing from the principal of stock or index investments during market downturns kills your retirement account.  It's not about timing the market, but rather placing your assets into safer, less volatile investments.\n\n\nThe reason she gave are just noise.  The real reason is because the market can be unpredictable,and severe downturns quite possible. And when you are retired you do not want your livelihood centering on a volatile asset.",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil3xrt/",
          "created": 1723912735,
          "depth": 1,
          "replies": [
            {
              "id": "limumya",
              "score": 1,
              "body": "> it is typically advisable to move your retirement account out of the stock market as you approach retirement\n\nwho advises this?",
              "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/limumya/",
              "created": 1723935279,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lilkiak",
          "score": 1,
          "body": "Although I agree with overall what you're saying, rebalancing as you get closer to retirement is the smart thing to do.\n\nWith that being said 80% in bonds is absurdly high unless OP is like 85. If they are 65 they still statistically have 17 years left of life (SSA actuary table), so tying that much into bonds is way too conservative.",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilkiak/",
          "created": 1723918445,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "liku4je",
      "score": 10,
      "body": "80% bonds seems too high imo.  If you are really worried about stock volatility, leave the individual stocks and go to an All Equity etf like AVGE or an all stock etf like ITOT, SCHB or VTI.  That way you don't need to worry about anything if something were to happen that moved stocks one way or another.\n\nA simple all bond etf like IUSB is all you need. If you like to diversify more, the treasury related bond fund GOVT is a good addition.\n\nHave you also considered a CD ladder?",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/liku4je/",
      "created": 1723909325,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likwzzr",
      "score": 8,
      "body": "Nobody will be able to offer real help without knowing your account size and how much you're going to be withdrawing each year",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likwzzr/",
      "created": 1723910317,
      "depth": 0,
      "replies": [
        {
          "id": "lim2j9o",
          "score": 1,
          "body": "To add. None of the concerns you listed actually matter if you have an appropriate assett allocating which is why these two things are so important. The only reason one would need 80% bonds is if they're looking at withdrawing most of their account in the next year or two. \n\nYou are actually more at risk of running out of money if you don't have enough equity to replace your withdrawals in the long term. The SP bond index has a 1.67 return for the past 10 years. In retirement accounts, the primary use of bonds is to liquidate as needed.",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lim2j9o/",
          "created": 1723924874,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "likswe2",
      "score": 11,
      "body": "Did you go with bonds during previous recessions? during covid? during previous Middle East Wars? During previous election chaos? \n\n\n If you didn't did it hurt you or help you?\n\n\nYou might have Decades of life left so exiting out of stocks now might not be a good strategy",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likswe2/",
      "created": 1723908900,
      "depth": 0,
      "replies": [
        {
          "id": "liktget",
          "score": 10,
          "body": "In the past I just held my stocks even 2008. Worked great. But my ability to earn decent money at work is gone now.",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/liktget/",
          "created": 1723909092,
          "depth": 1,
          "replies": [
            {
              "id": "likutdx",
              "score": 5,
              "body": "I'm an early retiree but Social Security and meager pension from a job I had in the 90s and some real estate income can keep me going if my stocks went to zero so it depends what other assets you have. ",
              "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likutdx/",
              "created": 1723909565,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "liktueq",
          "score": 6,
          "body": "The key here is he is near retirement.  \n\n\nAll the things he listed aren't really that big of a deal in the grand scope of things. What is is having to pull from retirement during market downturns.  The stock market isn't guaranteed to increase YoY, every year, without fail.  And a few bad years, which is more than possible, could wipe him out.",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/liktueq/",
          "created": 1723909227,
          "depth": 1,
          "replies": [
            {
              "id": "likvfsz",
              "score": 6,
              "body": "All depends if he has 50k or a million in the stock market",
              "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likvfsz/",
              "created": 1723909780,
              "depth": 2,
              "replies": [
                {
                  "id": "lil2ad0",
                  "score": 1,
                  "body": "Exactly. Too many variables. He could have a pension that with his SS covers his bills and doesn't need to make withdrawals. Or he could need to withdraw 4-5% a year to live on.",
                  "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil2ad0/",
                  "created": 1723912159,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "liky0s7",
      "score": 5,
      "body": "10 years expenses in cash and bonds is probably enough IMO.  Lost decades in the stock market are pretty rare.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/liky0s7/",
      "created": 1723910672,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likxk6f",
      "score": 3,
      "body": "So many events in the Middle East have been unprecedented over the last year plus, and no market has cared. I see why someone who’s looking for doom would put it on the list, but why #1? The top thing that would hit the market is recession possibilities, and you list it as number three. Election chaos, while bad, would not affect the market much. You’re confusing a)bad things with b) things that affect the market.\n\nThat said, for someone headed for retirement with likely more cash in the market than cash yet to be earned, I get it. But 80 seems steep.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likxk6f/",
      "created": 1723910510,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likv15t",
      "score": 2,
      "body": "Municipal Bonds tax free and higher yields on interest. Back when congress had to disclose their spousal purchases and sales there were quite a few NVDA purchases and municipal bonds. Food for thought and I am not a financial advisor. Do your own due diligence. However, when you retire rich I will require lunch and a free game of golf with you 😎😂",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likv15t/",
      "created": 1723909638,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likvrds",
      "score": 2,
      "body": "What about 100% SGOV? I’ve always wondered about this option.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likvrds/",
      "created": 1723909892,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likz1pc",
      "score": 2,
      "body": "Few “new topic” posts contemplate a “middle ground” adjustment. Lots of extremes.  “I’m going 80% bonds!”  First, what percentage are you holding now?  \n\nI mean, if someone is 20% bonds now, why go 80%?  That’s an unnecessarily abrupt move, especially since cash is still a 5% play.  Try 30%, then maybe 40%, et cetera.\n\nI may have missed it, I didn’t identify your current bond position.\n\nI’m retired.  FDVV and SPHQ are my “core”.  I have cash/CDs.  As the CDs mature, I am easing that cash into utilities ETFs (currently RSPU and UTES).\n\nI’ve been afraid of so many things in my mind over my lifetime.  A few of them actually happened.\n\nI am still learning, emotion-driven investments are vastly suboptimal.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likz1pc/",
      "created": 1723911027,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil36eq",
      "score": 2,
      "body": "A few years ago I read Wade Pfau’s “How much can I spend in retirement” and left feeling like 70% was the max in bonds I would feel comfortable with.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil36eq/",
      "created": 1723912473,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil3hkz",
      "score": 2,
      "body": "The faster you capitulate, the better it will be for all of us :)",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil3hkz/",
      "created": 1723912579,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil3nr8",
      "score": 2,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil3nr8/",
      "created": 1723912638,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil3ze5",
      "score": 2,
      "body": "Your on Reddit and going to get advice from a bunch of twenty year olds with a net worth under 100k. Talk to a financial advisor. I think your being way to risk adverse but do what your comfortable with.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil3ze5/",
      "created": 1723912751,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lile2nl",
      "score": 2,
      "body": "Just do schd if you're gonna be a wuss",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lile2nl/",
      "created": 1723916229,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilh87o",
      "score": 2,
      "body": "4 years ago it was an election, Covid, recession looming etc. How’d the market turn out? +80% or something? Glad to have those gains in an inflationary environment.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilh87o/",
      "created": 1723917309,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liljc18",
      "score": 2,
      "body": "I mean from a geopolitical perspective things have never been better.\n\n\nAlso most of these risks are already priced into the respective stock markets, for example even though China or India have the second largest economies in the world, their stock markets only make up about 5% of global market cap.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/liljc18/",
      "created": 1723918039,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liloptu",
      "score": 2,
      "body": "Hard to be against the American consumer. The media makes it sound like turmoil is looming, but I see a booming economy. Everywhere I go is PACKED! Everyone swiping as fast as possible. Everyone keeping up with the jones. 72 month car notes and $1000+ car payments for people making $20 an hour. People are spending money now faster than ever.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/liloptu/",
      "created": 1723919927,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liloxu8",
      "score": 2,
      "body": "The reason for having a large percentage of cash reserve isn’t just to pick up 5% interest it’s to have purchase power if stocks where to go lower due to the reasons you mention.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/liloxu8/",
      "created": 1723920005,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lim88lr",
      "score": 2,
      "body": "Everyone should talk to a financial advisor before entering retirement they have a ton of calculations to predict best case and worse case and figure what should work best for you.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lim88lr/",
      "created": 1723926877,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lim97o2",
      "score": 2,
      "body": "have fun",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lim97o2/",
      "created": 1723927219,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liksuca",
      "score": 6,
      "body": "Alternatively, imagine what stocks would do if all or even some of those concerns you listed (that have largely baked in the downside already) were resolved.\n\nThe point is there’s always something to worry about with stocks. And usually the most worry is at  a good buying opportunity.\n\nLong term bonds can move down just as much as stocks, as seen in 2022. They aren’t risk free either.\n\nTheres a reason 60/40  stocks/bonds is a gold standard.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/liksuca/",
      "created": 1723908880,
      "depth": 0,
      "replies": [
        {
          "id": "liktk8t",
          "score": 1,
          "body": "Anybody nearing retirement should aim to preserve their retirement assets as much as is reasonable, and not chase potential gains.  Severe market downturns can be sudden and unpredictable, and wipe you out hard.  If you need to pull from your retirement accounts during these downturns, it severely hampers you ability to continue on in retirement.  The 2008 housing market crisis totally destroyed a lot of people.\n\n\nThe younger you arez the more ability you have to weather these downturns.  ",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/liktk8t/",
          "created": 1723909129,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lil2v67",
      "score": 3,
      "body": "Consider 35% equity, 10% hedge fund, 5% gold, 20% cash and cash equivalents, and 30% fixed income.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil2v67/",
      "created": 1723912365,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likup2j",
      "score": 2,
      "body": "depending on your actual financial situation, if you want to move into capital preservation rather than accumulation, I always highly recommend to look into the gov bond move + holding enough equities to adjust for inflation until the maturity of bonds\n\nas example: if you go for 20y bonds, they pay some 4.25ish % right now, which is hopefully enough as coupon payments to either live off, or to supplement your SS or other income during retirement - the really is to not touch the other part of the portfolio, i.e. broad market index funds e.g. VTI / VOO + VXUS - at 20y a 80/20 allocation is enough, so that in theory the equities part of the portfolio is accumulating enough to make up for the inflation \"loss\" on the bond part and you can restart the whole thing after maturity of the bonds (accounting 7% average inflation adjusted growth in there)\n\nthe shorter you go, the higher your equity part has to be to actually be able to offset the inflation part\n\nI would \\*highly\\* recommend to take treasury bonds for the sake of safety\n\nI would NOT recommend buying bonds for the reasons you have put up, but for the only reason that really matters - the cutting cycle and economic data\n\nreally tho.. it all depends on your actual financial situation..",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likup2j/",
      "created": 1723909524,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likv52v",
      "score": 1,
      "body": "PDI?",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likv52v/",
      "created": 1723909676,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likvhp3",
      "score": 1,
      "body": "I’d say your current age is how much you should have in bonds. We live a lot longer now so you need equity exposure. A balanced etf would serve you well like this 60/40 etf in Canada \n\nhttps://www.vanguard.ca/en/advisor/products/products-group/etfs/VCNS",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likvhp3/",
      "created": 1723909798,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likykar",
      "score": 1,
      "body": "Where is the money now? Maybe go closer to 50% and keep the other half liquid or in a cd or high yield savings account",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likykar/",
      "created": 1723910859,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likz50m",
      "score": 1,
      "body": "Tlt is a good deal. Great chart formation, great fundamentals behind it, monthly dividends in your case",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likz50m/",
      "created": 1723911058,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likz6ps",
      "score": 1,
      "body": "I’m doing the same but i think we have another run up. I’ll be looking to do same later in the year",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likz6ps/",
      "created": 1723911074,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil0uji",
      "score": 1,
      "body": "Gold, Silver, Uranium, Oil, commodities (those are going to see a big super cycle and be really big when stocks see a decline)",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil0uji/",
      "created": 1723911653,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil19je",
      "score": 1,
      "body": "Just keep enough in cash for 3-4 years. If the market goes down you won't have to sell any equities till it's at least back to where you started. 80% is way too much unless you have so much saved that you don't need the growth from the market. A couple with two great pensions and SS might not even need more money to live on and may not see any reason to take on risk. Somebody else in that situation may feel bullet proof and go all equities. But the majority of us need some growth.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil19je/",
      "created": 1723911800,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil1ko8",
      "score": 1,
      "body": ">4 years away from retirement. I welcome feedback.\n\n>I see too much volatility and downside risk to be stock heavy in the near term:\n\n>Clarity on Isreal, Iran and Gaza\n>Election chaos\n>Recession possibilities\n>Russia Ukraine escalation\n>Japan carry trade\n\nI mean, you could have made a **muuuuch** better case that the markets would tank during the 2020 election -- had you opted to move 80% of your portfolio out of a diversified index to fixed income, (a) what would your real return have been on those notes be and (b) how much money would you have left on the table by exiting equities?\n\nFeels like you're leaning too much on human-based emotions rather than historical price data.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil1ko8/",
      "created": 1723911911,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil1mxl",
      "score": 1,
      "body": "Do commodities, bonds, managed futures and stocks rebalance quarterly.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil1mxl/",
      "created": 1723911933,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil1pvr",
      "score": 1,
      "body": "Don’t forget that you don’t pull all your money out in one year for retirement. Plus look at Covid crash in March 2020, bonds crashed just as much as stocks. The chicken littles of the world always have some fears to worry about when it comes to equities. I believe 80% in bonds is way too high. Maybe 25% max, although they usually perform ok when interest rates are dropping.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil1pvr/",
      "created": 1723911961,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil1qh4",
      "score": 1,
      "body": "Maybe just research “bond tent to reduce sequence of return risk” and set that up now since you’re close to retirement. My plan is for a 3-5 year tent, but not all bonds. Some CDs and HYSA funds as well.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil1qh4/",
      "created": 1723911966,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil23g5",
      "score": 1,
      "body": "Have you looked into precious metals? They tend to hedge against real inflation, since fed will cut interest rates and with how things are looking, probably another round of quantitative easing, Gold is looking attractive right now, at least the dollar value won’t go down.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil23g5/",
      "created": 1723912092,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil319g",
      "score": 1,
      "body": "I think moving into more bonds makes sense if you’re willing to forego more potential upside on stocks. With rates high this is a much better time to own bonds than before.\n\nOne risk with the hypothesis is that long rates could go up as the curve steepens if fears about fiscal lack of discipline become front and center. A continuous reduction in long rates is not a given in my view. \n\nRe: 80% — I have always felt the advice for older people is too conservative. Instead of going all bonds, why not tranche your money? The money you need in the next 10 years in bonds, the rest could be in stocks since your horizon is longer for that money.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil319g/",
      "created": 1723912424,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil3gov",
      "score": 1,
      "body": "I do not envy your decision, and I know I will have to make the same one day. I’m hoping to be working with a pension and SSA by 57, and I’d like to think that I’ll keep my retirement accounts invested. But it’s easy to say that now. ",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil3gov/",
      "created": 1723912571,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil49vx",
      "score": 1,
      "body": "Best time to be a money lender in the last 20+ years",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil49vx/",
      "created": 1723912854,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil4xs8",
      "score": 1,
      "body": "Instead of switching up your portfolio composition so abruptly, I would recommend doing it more gradually. If you're 4 years away from retirement, you can start yourself out on buying a number of bonds that will lock in a few years of income during your time as a fresh retiree. As time goes by, your stock portfolio can keep going up in value. You can then lock in more and more years of income from that appreciation at pre-set portfolio size milestones. A bear market usually doesn't take more than a few years, so the probability of getting in financial trouble is relatively low. If you live another 20 years or so, by that time most of your wealth will be in bonds and the odds of outliving your money becomes close to zero.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil4xs8/",
      "created": 1723913086,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil5mz9",
      "score": 1,
      "body": "Isn’t the bond market going to blow up especially once the other countries drop them in a coordinated attack (brics).      The worse hasn’t even started yet.  You tube is loaded with these guys I know but only a few i do actually trust.  He’s been doing this since 1990s and was in the last crash of 2008.  He’s also a California firefighter.  The economic ninja.    His videos should have info you want about how to protect yourself",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil5mz9/",
      "created": 1723913329,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil6lnk",
      "score": 1,
      "body": "The traditional rule of thumb is ‘100 - your age’ for equity proportion in a portfolio. \n\nSo if you were 60 you’d have 40% of your portfolio in stocks and 60% in a mixture of bonds/HYSA/cash. \n\nBeware that when the market crashes the value of the bonds will too - this doesn’t matter so much if you’re just holding to maturity but it will matter if you want to sell to buy depressed equities. \n\nI also have no idea what the tax implications are in the US for inheritance (in the UK it’s 40% flat tax with a £500k tax free allowance).",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil6lnk/",
      "created": 1723913662,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil6qay",
      "score": 1,
      "body": "We inched up to 30% treasuries, mainly bills. Longer bonds  do not pay enough",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil6qay/",
      "created": 1723913706,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil6sln",
      "score": 1,
      "body": "4 years seems early to stop investing... but if it makes you feel safer\n\nhas to b something better than bonds though...... these are the highest interest rates ill probably see for 50 years",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil6sln/",
      "created": 1723913728,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil71u8",
      "score": 1,
      "body": "Outside of the recession fears, all of these reasons are big nothing burgers. \n\nThere's always Middle East tensions.\nThere's always war.\nThere's always election fears. \n\nI understand your worries, but 50/50 you'll be fine. Maybe covered call ETFs will be more your speed. \n\nEither way, an actual financial advisor will be better than all of us on Reddit.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil71u8/",
      "created": 1723913815,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil7g7r",
      "score": 1,
      "body": "Ladder 2 yrs",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil7g7r/",
      "created": 1723913953,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil7l7g",
      "score": 1,
      "body": "If the US gets a credit downgrade from moodys or s&p, which is very possible given the current debt situation you are gonna take a bath on those bonds.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil7l7g/",
      "created": 1723914001,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil7zbu",
      "score": 1,
      "body": "I don't think there's anything inherently wrong going for safety and yield that close to retirement. \n\nI would suggest not going for super risk free, lower return and I think you're aligned with that. \n\nYou could have a portion of that with preferred stocks and long term growth REITs. I've also dabbled in some riskier yield funds. BIT, O, BANC.PR.F, PDI (less familiar with that one). I wouldn't suggest mortgage REITs like AGNC only because you need to keep an active eye on them.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil7zbu/",
      "created": 1723914138,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil805z",
      "score": 1,
      "body": "I wouldn’t go higher than 75% per Ben Graham",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil805z/",
      "created": 1723914146,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil903t",
      "score": 1,
      "body": "4 years is a bit early in my books being your requirement isnt \"set in stone\" being you can maybe just still keep working (even if you do retire, you likely have to work an extra year to train your replacement)\n\n\nBut if you have enough $$$$ in it, then it wont matter much for the security aspect is worth it for safety.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil903t/",
      "created": 1723914495,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil98h3",
      "score": 1,
      "body": "What about defensive, high-dividend stocks? Think utilities, consumer staples, and energy companies. AT&T, Verizon, Ford, and GM are some examples. They aren’t sexy and they won’t grow a ton. But, they have low PE ratios and Price-to-Book and dish out some healthy dividends.\n\nThese stocks have a great deal of pricing power, making them largely unaffected by the ravages of inflation. Like we saw in 2023, bonds (especially long-dated ones) can get destroyed by high inflation.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil98h3/",
      "created": 1723914574,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil9c3p",
      "score": 1,
      "body": "Bonds can be just as risky as stocks depending on duration. Look what happened to TLT in 2022. If inflation comes back bonds will underperform stocks. With deficits and gov debt where they are, inflation is likely to be high over the next decade, especially asset inflation. ",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil9c3p/",
      "created": 1723914609,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil9djl",
      "score": 1,
      "body": "Not going to comment on whether the percentage is right for you or not since I have no idea what your needs are.\n\n&nbsp;\n\nBut one risk with more bonds is increased inflation risk.\n\nIf there is high inflation or even moderate inflation, bonds may not be able to keep up (which decreases the purchasing power of your portfolio), while stock markets typically will keep up as long as companies have pricing power and the ability to raise prices.\n\n&nbsp;\n\nWhich is to say, everything in investing is a tradeoff, you change one thing, there will be ripple effects elsewhere.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil9djl/",
      "created": 1723914623,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lil9ezi",
      "score": 1,
      "body": "My parents definitely have been following some version of this for the past 15 years in retirement. They've never lost any sleep over market crashes or whatever. They are at peace that they left money on the table for the ability to live their simple lives the way they want.\n\nI don't think current risks are any more significant than usual. We have had one recession a few years ago, and a stock market correction in 2023. Inflation is coming down and interest rate cuts along with the end of quantitative tightening will stimulate the economy. Wars could suddenly end with peace talks! China could pull out of their funk and start growing again. India could kick it up a notch after the slowdown in the last few years. Technology continues to drive more efficiency. So lots of upside as well to balance the risks.\n\nLook into the strategy of a \"bond tent\" - ramp up bonds before retirement, and then spend them down, leaving your equities to grow. Go long with a medium term bond fund. The rates will drop but you'll get appreciation/capital gains. Payments are all taxed at normal income tax rates. I don't know your numbers but you might need to adjust your spending down to account for that. Good luck!",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil9ezi/",
      "created": 1723914636,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilcd3s",
      "score": 1,
      "body": "I would diversify. I'm not sure your age, but I assume early 60's. If you have a large pile of cash, I would suggest a mix of treasuries, Corporate bonds (which currently have some nice yields with very little risk) and some index funds.  I would stay away from single stocks unless you leave yourself with a small amount of play money to invest as you see fit. I would say a mix of 1/3 each in treasuries, corporate bonds, and Index Funds. Even if the market tanks, the index funds will not be affected as heavily as an individual stock would be. 66% of your money would still be safe, and when the markets soar, your index funds will outperform your bonds significantly giving you a nice padding for the down times. \n\nYou could also look at an Index annuity, that would offer you the stability of a minimum rate with the benefit of higher returns when the market does well. However, there will be a cap on returns when the S&P significantly outperforms.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilcd3s/",
      "created": 1723915647,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilckn2",
      "score": 1,
      "body": "There are always major risks and world events happening throughout every few years. Don’t think today is any worse than you let social or mainstream media think it is",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilckn2/",
      "created": 1723915718,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lile231",
      "score": 1,
      "body": "Most of the time we’re in a bull market. A bear market only lasts a quarter or a few weeks and they’re infrequent. This monthly “crash” was not even a real bear market.\n\nIf you kept everything in stocks, I think you’d actually be ok if you could live off a withdrawal limit of 4% of your nest egg. However if you feel bonds are safer, that is valid. If it was up to me I’d transition to bonds a lot more slowly than what you’re doing in your shoes. I’ll switch over most of my portfolio to bonds when I am old crusty narcoleptic and barely able to walk.\n\nI think bonds can crash like stocks too, I remember reading about it in Ken Fisher’s book but I need to reread it. They’re not fully immune.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lile231/",
      "created": 1723916223,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lileenu",
      "score": 1,
      "body": "I use a 60% bonds, 40% stocks. The bonds have helped smooth out the down market. But, 40% still allow for growth in portfolio positions. The stock portions are mutual funds and ETF’s, no individual stocks. It has seemed to work for that last decade.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lileenu/",
      "created": 1723916342,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilfpch",
      "score": 1,
      "body": "Maybe annuities?",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilfpch/",
      "created": 1723916782,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilfqh4",
      "score": 1,
      "body": "Why not 50/50?",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilfqh4/",
      "created": 1723916793,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilg0ey",
      "score": 1,
      "body": "Wendy’s incoming after retirement",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilg0ey/",
      "created": 1723916886,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilg6lb",
      "score": 1,
      "body": "Did you forget about the massive inflation we just had? At least put some inflation hedges in there.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilg6lb/",
      "created": 1723916946,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilg7c6",
      "score": 1,
      "body": "80% bonds can expose you to longterm inflation risk. Inflation risk could turn out to be a much bigger deal if your timeline is 20+ yrs.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilg7c6/",
      "created": 1723916954,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilgju6",
      "score": 1,
      "body": "1. List up all the geopolitical crap that happened over the last 5 years\n\n2. Reflect on what you would have done 5 years ago, if you had that information in advance.\n\n3. Check what markets did over these 5 years and realize that geopolitical risks are irrelevant.\n\n4. Profit",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilgju6/",
      "created": 1723917074,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilgwby",
      "score": 1,
      "body": "The land of the free, only if you are rich",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilgwby/",
      "created": 1723917195,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilhdop",
      "score": 1,
      "body": "Why not 60% and the rest in heavy buyback dividend growth stocks? ",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilhdop/",
      "created": 1723917362,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilhgc2",
      "score": 1,
      "body": "Agency bonds are pretty much all callable. If interest rates go way down they’ll just refinance and pay you off and where does that leave you?",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilhgc2/",
      "created": 1723917387,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilhoh3",
      "score": 1,
      "body": "Bonds are return-free risk.  If you think the above risks are specific to stocks, you are mistaken.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilhoh3/",
      "created": 1723917465,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lili9u6",
      "score": 1,
      "body": "Depends a lot on your specific situation. My wife has a defined benefit pension plan that will pay us about $45k/yr in retirement. I'm also 4 yrs away but that pension allows me to be much more aggressive with my investments. I treat that as $1m in fixed income so my investments are 80% equities.\n\nIf I had no pension I would probably be around half in bonds.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lili9u6/",
      "created": 1723917671,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liljpr4",
      "score": 1,
      "body": "The main issue with agency bonds (I own some) is that most are callable if rates drop. Other than that they are a pretty solid investment. In my experience, they aren't great for retail trading as, even if there is liquidity, bid/ask spreads can eat a ton of gains. \n\nBigger picture, a lot depends on the size of your portfolio. If you want to take the amount you expect to need over the next 5-7 years and move it into safe assets that would make sense, any longer term money I'd probably keep in the stock market, probably in a vanguard or fidelity total market index fund. \n\nFinally, keep in mind wars tend to be inflationary. If we get inflation due to the geopolitical situation, longer duration bond performance will likely lag. \n\n\nA lot depends on how much you need",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/liljpr4/",
      "created": 1723918171,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liljqud",
      "score": 1,
      "body": "Why not money market and get the 5%?",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/liljqud/",
      "created": 1723918181,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liljs7e",
      "score": 1,
      "body": "As long as new don’t have a major inflationary event you’ll be fine.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/liljs7e/",
      "created": 1723918194,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilk1gt",
      "score": 1,
      "body": "My thoughts. First, I don't think these are good reasons to be overly defensive.\n\n1. There have always been international conflicts, and the powers driving the current ones, Russia and Iran, are both extraordinarily weak regimes which would likely crumble if aggressively confronted militarily, which won't fully happen anyway given the current state of leadership in the West. Bottom line, there isn't much unusual here, conflict in the ME has been going on for over a century, nothing has changed much, and nothing will.\n\n2. The election will be over in 3 months, and the outcome won't matter much anyway, given how little power a U.S. president actually has, and how small the shifts in legislative power, one way or the other, typically are in U.S. elections. Most of what happens *after* the election is just more certainty, and for that reason election years have historically been good for stocks, especially Nov, Dec, Jan, Feb.  \n\n3. There are always recession possibilities, and at the moment, if anything, they seem to be lower than normal. GDPNow is still projecting 2% real for Q3, and the last Fed rate hike was more than a year ago, so no reason to expect any significant lagged effects at this point. Plus inflation seems to be already just about defeated, the Fed able to begin cutting if needed, and nominal GDP growth likely to come in at a sustainable rate for Q3 (somewhere ~4.5%). Apart from some slight weakening in labor markets, the data is basically screaming \"soft landing\" at the moment. \n\n4. Russia is losing in Ukraine. They can't afford to expand this conflict. Ukraine expanding it, into Russia, should be seen as bullish.\n\n5. The Yen carry trade normally involves mainly short term trades, and isn't an especially high yield strategy (5-6% annual returns). The losses there were due to a sudden appreciation of the yen. I think this was a one-time thing, in response to one surprise move from Japan's central bank, and that Japan's economy isn't strong enough right now (relative to the U.S.) to expect much continued longer term appreciation of the yen relative to the dollar. \n\nThat all said, if you are < 4 years from retirement, it would make some sense to reduce your stocks to around 60% of your portfolio now, anyway. But I really wouldn't go below half. \n\nAnd in terms of diversifying your risk, beware that one of the biggest risks would be a resurgence of inflation, which tends to be bad for *both* equities and bonds, so there is some significant correlated risk there. For that reason, I prefer inflation protected bonds play a significant role in a balanced portfolio. On top of which, with the 5-year breakeven rate under 2% right now, I'd take the over if I'm betting on what inflation will be, so I think TIPS are probably the slightly better investment now anyway. \n\nIf you are a US citizen, I think one of your best options for your safer bond investments is to open an account with the US treasury at treasurydirect.gov. You can buy bonds directly there, but also can buy up to $10k in Series I Savings bonds, which currently pay 4.28%, but will adjust with inflation, and will basically pay 1.3% over CPI inflation for as long as you hold them. There's a small penalty (3 mos. interest) if you hold them less than 5 years, so don't put your short term funds here. But put $10k yearly into these until you have enough of a buffer that you won't have to touch your stocks within 10 years. \n\nAs for Funds, I can recommend also putting some into Fidelity's Capital and Income Fund (FAGIX). That fund is about 20% equities, but is mostly a bond fund, and is a pretty solid fit in a retirement portfolio (less aggressive than your equities, more aggressive than most of your bonds).\n\nFor shorter term funds you might need within the next 5 years, I think Money Markets are still the best bet. I don't think rates will be cut as much as some expect. I think they'll stay over 4% for the next couple of years, so long as fiscal deficits continue to remain high.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilk1gt/",
      "created": 1723918283,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilk6vc",
      "score": 1,
      "body": "I am also about 4 yrs from retirement. I have just started the process of restructuring the portfolio for retirement.  Goal is to have a sufficient assets in income generating sector (bonds, dividend stocks, other) to satisfy the planned annual $ withdrawal in retirement. The remainder of portfolio would probably in growth stocks.\nI am also wary about market volatility as I approach retirement.\nSo as I start this restructuring process, I have de-risked the portfolio (lowered stock and increased cash)\nBut the de-risking isn’t a relative value decision.\nIt’s more a transition to retirement mode. My goal is to work on reinvesting cash raised on income generating assets (to be completed over next 1 to 2 years)",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilk6vc/",
      "created": 1723918334,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilkh6w",
      "score": 1,
      "body": "Completely reasonable to move majority to bonds before retirement, but not for the reasons your giving",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilkh6w/",
      "created": 1723918434,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilkych",
      "score": 1,
      "body": "There's always risks in the world. The Middle East has been a problem constantly for the last 80 years. A recession is always just right around the corner, newspapers have to write fear generating stories to get our attention. Elections happen every 2 years in the US.\n\nOP listed the Japan carry trade that impacted markets for less than two weeks and markets didn't even fall 10% before they recovered. How horrible!! /s.\n\nAll that said, an 80% bond allocation is likely an over-reaction to watching too much news currently. The same case could be made at any moment over the last 80 years.\n\nBonds come with their own risks and have their own crises like the Great Bond Massacre of 1994.\n\nHow do you think US bonds would do IF the US debt got downgraded because of the massive US deficit spending?\n\nAll that said, it's fine to reduce the risk exposure and volatility of a portfolio, especially when nearing retirement. \n\nHowever, a more prudent approach would be a diverse portfolio that includes more asset classes like real estate, commodities, alternatives, international, etc. As well for stocks, diversification of stock market cap, growth and value, dividend payers, etc.\n\nI personally would never go to 20% equities, might as well sit in cash if OP thinks the crap is going to hit the fan that hard.  Why take the risks with bonds if that is OP's expectation?",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilkych/",
      "created": 1723918600,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilmozz",
      "score": 1,
      "body": "None of your reasons are why I would do it.   My reason would be because the AI is starting to take over and we have started the path to the jobs going away.\n\nThat will be never ending.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilmozz/",
      "created": 1723919222,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilnivz",
      "score": 1,
      "body": "Bonds are good money these days. Cant go wrong",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilnivz/",
      "created": 1723919511,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilnj81",
      "score": 1,
      "body": "Could have got some 10 years when they were over 4%\n\nI think it's fine. As long as that 80% will generate enough income for you to spend for the next 20-30 years.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilnj81/",
      "created": 1723919515,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liloh7m",
      "score": 1,
      "body": "Many have been stepping into some intermediate to longer term treasuries and CDs the last 18 months.  Some jumped more heavily, and missed the stock rebounds.  I tend to agree that the stock market, especially large caps, are overbought, but the machine keeps being fed, so there may be some runway yet.  Its a cliche, but it all comes down to your goals, time horizon and risk tolerance, and a smart tax strategy to minimize taxes. For a while, some of the more bearish folks out there would tell you that you should take 5 percent plus on the six month treasury vs the risk of the market and that is a great plan.  The problem is that simpleton statement doesn't take into account taxes and reinvestment risk.  It would keep \"your powder dry\", and that might be a good plan for some of your funds.  Also, lost many times in the stock/bonds/cash debate is the holding of direct real estate, specially income producing property.  That's where I have shifted my after tax investing over the last few years, and will continue to do so.  Also, bond funds vs individual bonds is a separate analysis, so work with your FA on that carefully.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/liloh7m/",
      "created": 1723919842,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilpfbi",
      "score": 1,
      "body": "Always something to be spooked about. Always. Since the beginning of the history of mankind. Honestly, the stuff right now is probably less spooky than average. \n\nTake a look at this: https://static.twentyoverten.com/5cf521b809715667aa522701/4dyI5W3rte/Wall-of-Worry.pdf\n\nOr this: https://www.humansundermanagement.com/wall-of-worry\n\nJust set aside first couple years of expenses, sell covered calls against the next couple years.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilpfbi/",
      "created": 1723920175,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilpg97",
      "score": 1,
      "body": "Stop looking for monsters under the bed. \n\nThere will always be recessions, that's part of the natural ebb and flow of the Business Cycle. \n\nMarkets didn't crash January 6, 2021.\n\nWhatever happens in Gaza, Ukraine, etc, American defense contractors win either way. This makes number go up.\n\nJapan carry trade.. I mean, this is grasping for straws.\n\nI would speak to a professional before doing something so drastic. You're planning on living at least another 20 years I presume. Has there ever been a 20 years recession, in the history of the markets?",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilpg97/",
      "created": 1723920184,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilr5ox",
      "score": 1,
      "body": "Check out this article and read further down about failure rates.\n\nhttps://www.investopedia.com/articles/personal-finance/121815/buffetts-9010-asset-allocation-sound.asp\n\n\nI’m not sure how that affects you but it sounds like 60/40 or 50/50 would be a better plan.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilr5ox/",
      "created": 1723920785,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilrw4n",
      "score": 1,
      "body": "In the FIRE community, a lot of people will use a bond ladder for the first 3 to 5 years of retirement as a cushion against this scenario.\n\nI'm doing a 5-year protection plan myself.\n\nI haven't actually started my retirement yet, but when I do, I won't even be touching my portfolio for the first 5 years. So, I'm not concerned at all. If we have a bear market lasting longer than 5 years then I might start getting concerned about it",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilrw4n/",
      "created": 1723921046,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lils1ul",
      "score": 1,
      "body": "I have been retired for almost nine years. I have fully funded my retirement from my IRA and will not draw money from my social security for another 4 years. I have more money in my IRA than on the day I retired. That’s only because I stayed mostly invested in stocks. Had I been fully or 80% in bonds I would have perhaps 2/3 of my starting IRA balance. Maybe less. And I’d be worried. \n\nThere have been many issues during the last 9 years which caused me duress, but I stayed invested in stocks. There is always a list of concerns at any moment in time. You need to employ asset allocation, not a trading mentality at this point in your retirement journey. I employ a bucket approach to asset allocation. Cash reserves to cover 2-3 years of expenses (helped me sail through the Covid crash in 2020!). Short duration bonds for years 3-7. S&P 500 index for years 7+. Something like that rather than trying to time an exit and return to stocks.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lils1ul/",
      "created": 1723921103,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liluts9",
      "score": 1,
      "body": "Not popular but you may consider finding a good annuity company for part of your funds.   You got a check coming no matter what.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/liluts9/",
      "created": 1723922107,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilxf03",
      "score": 1,
      "body": "I don't like to give anyone advise, so I will spell out what I am doing.  I am 20 years from retirement and  my current investment is approx 1/3 5% bank CD's and cash yielding 5%, 1/3  gold and 1/3 dividend stocks. My current credit union 12 mo CD just matured yesterday, so I am planning on reinvesting the total CD amount in another 12 mo bank CD's at 5%.  But I am planning on allocating new money into either 3 year US treasuries currently at 3.8% or a similar duration bank CD's.\n\nThe duration is the risk both on the short & long term. I am not convinced we will ever see 2% or lower US interest rates again so I do not want to hold 20-30  yr US bonds. But it is time to push out the duration longer than 12 mos as the free 5% interest on cash and 12 mo T-bills is likely ending soon. \n\nI would maybe suggest staggering out the duration. Check what your local credit unions have.  Yes, you will have to pay taxes, but they may have 12mo, 20 mo and 36mo duration you can split you cash up to minimize duration risk.\n\nGood Luck",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilxf03/",
      "created": 1723923046,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lilzksm",
      "score": 1,
      "body": "You have 20+ years to live.  Thats long enough to recover from whatever financial tragedy that may occur.   \n\nDon’t know what your total NW is but keeping a few years worth of living expenses would be a better approach.  Both me and my wife are retired and I have 25% in cash/bonds right and that’s too much for me.  I want to get down to 15%.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lilzksm/",
      "created": 1723923824,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lim0ysh",
      "score": 1,
      "body": "You may already know this, but if you’re planning on buying bonds directly - many of them are callable. For instance:\n\nI bought new issue AAA FHLB bonds at 6.35% last winter and they just got called. New issue bonds are now 5%+ for same duration.\n\nAgency bonds (Fannie/freddie/ginnie) can be attractive but prepay speeds can vary depending on borrowers in the pool and market rates. I bought a handful of cusips in secondary market last winter where WAC of the pool was 3-3.5% thinking those would appreciate but not prepay fast as long term fed funds rate is likely to settle in 3-4% range more so than 0-2% range.\n\nTl;dr - So depending on how long you are targeting income and returns you need to be, the reinvestment risk is something to be mindful of unless you’re only going to buy long duration bonds without call options (and those typically have lower yields than those with options)",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lim0ysh/",
      "created": 1723924320,
      "depth": 0,
      "replies": [
        {
          "id": "lls7gsy",
          "score": 1,
          "body": "How much you make from Tesla out of interest? Saw an old post",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lls7gsy/",
          "created": 1725624814,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lim13ms",
      "score": 1,
      "body": "I would probably look at managed bond funds like ETFs to keep it on the safer side.  Right now long-term ones are low and have the potential to rise with interest rate cuts.  So things like VGLT.  You could also look at short-term treasury funds like SGOV which has decent dividends that will probably drop some when interest rates drop.  Just my initial thoughts here.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lim13ms/",
      "created": 1723924369,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lim1bef",
      "score": 1,
      "body": "I can appreciate the concerns, but I have to ask how much taxes are going to be occurring if you make that swap?\n\nI would probably lean into bonds, but not so much that I have a massive tax bill now. Perhaps space it out and sell the higher risk stuff and ease out of other stuff over time?",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lim1bef/",
      "created": 1723924444,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lim2272",
      "score": 1,
      "body": "Everything except recession is noise. \n\nAnd recession isn't here yet.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lim2272/",
      "created": 1723924708,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lim3519",
      "score": 1,
      "body": "64 retired 62 I have half in 3 yr annuity and half 100% equity. Advisor recommended",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lim3519/",
      "created": 1723925089,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lim9n5t",
      "score": 1,
      "body": "100-age=stocks/etf\n\nIf you are 65, you should have only 35% in stocks.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lim9n5t/",
      "created": 1723927367,
      "depth": 0,
      "replies": []
    },
    {
      "id": "limcdyh",
      "score": 1,
      "body": "If the fed ends up printing your portfolio is going to get crushed. Buy some sort of hedge assets like gold/reits/real estate",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/limcdyh/",
      "created": 1723928336,
      "depth": 0,
      "replies": []
    },
    {
      "id": "limdxds",
      "score": 1,
      "body": "Wow. Retiring next year and zero bonds.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/limdxds/",
      "created": 1723928887,
      "depth": 0,
      "replies": []
    },
    {
      "id": "limhluj",
      "score": 1,
      "body": "If it’s a lot of money sell it all and sail into the sunset my friend",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/limhluj/",
      "created": 1723930246,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liminbr",
      "score": 1,
      "body": "It is a wise move if you have 4 years left to retirement.\nMarket is very risky.\nI would go with 1-3 years maturity bonds.\nYou may check SHY etf.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/liminbr/",
      "created": 1723930632,
      "depth": 0,
      "replies": []
    },
    {
      "id": "limkmql",
      "score": 1,
      "body": "My parents are a few years away from retirement also, and their advisor has them in like 75% tech stocks.  My jaw dropped.  My parents don’t really know finance like that and I told them that’s risky as fuck",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/limkmql/",
      "created": 1723931370,
      "depth": 0,
      "replies": []
    },
    {
      "id": "limlwcd",
      "score": 1,
      "body": "The problem you will face is deciding when to go back into the market.\n\nI know people that pulled out of the stock market in  March 2020 and then they waited 2+ years before deciding to get back into the market.    They missed out on a lot of gains.\n\nYes, the stock market can be scary.\n\nI find it is better to have an appropriate portfolio allocation to cash+bonds, and then rebalance as needed to maintain that allocation.     So when stock soar, you will sell stocks and add money to your bonds.   When stocks plummet, you will sell some bonds and buy more stock at cheap prices.\n\nAs you are nearing retirement is can be a good idea to have a higher than normal bond allocation to minimize the sequence of returns risk.  Google \"bond tent\" for more info on this.   But 80% bonds is almost certainly an excessive bond allocation.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/limlwcd/",
      "created": 1723931853,
      "depth": 0,
      "replies": []
    },
    {
      "id": "limmp3s",
      "score": 1,
      "body": "If you are 5 years from retirement I am guessing you are around 60, if you are healthy, that means another 20-25 years. IMO that’s too many years to be in 80% bond.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/limmp3s/",
      "created": 1723932162,
      "depth": 0,
      "replies": []
    },
    {
      "id": "limq1kx",
      "score": 1,
      "body": "The SP500 is at risky level considering its high PE ratio with a growth rate that is low by comparison. I sold some to increase my cash/short term treasury position. At the current valuation, the SP500 could be cut down a lot and very quickly. War, another pandemic, or anything we can’t imagine could cause a drastic fall. I still have a lot in the market, but I’m definitely increasing my cash position to prepare for downturns. ",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/limq1kx/",
      "created": 1723933462,
      "depth": 0,
      "replies": []
    },
    {
      "id": "limru80",
      "score": 1,
      "body": "I made several investment choices (timing in or out) based on international issues.  All I can say is DON'T.  They made incredibly small changes in trajectory.. and usually a month or two divergence from the trend. \n\nJapan carry trade has been going on for a few decades already.. nothing to change your fortunes unless you borrow yen, convert, and invest here... Can you read Japanese prospectuses?  Not worth the trouble to consider.\n\nAt 65,  the IRS would obligate a withdrawal of  ±1/30 of your portfolio....  ±3%.  If you can get greater returns, you might still maintain the value for the next year.. but that minimum withdrawal rises (as a %age), and you want to provide for higher expenses later.  Aim for better than 5-6%,  and you'll likely be feeling good next year.\n\nIf you need to withdraw more than  you need,  consider setting up a Roth as your savings account.. there's No tax deduction, but the earnings aren't taxable later.  And (over 65) it's available any time.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/limru80/",
      "created": 1723934172,
      "depth": 0,
      "replies": []
    },
    {
      "id": "limvdbt",
      "score": 1,
      "body": "Not giving financial advice, talk to your advisor... If you saved enough maybe 60% bonds 40% equity... or 60% equity (mostly value managed and some growth positions) and 40% bonds... honestly would depend on how much you saved, what will be your lifestyle and expenses during retirement.. .is the house paid, are you renting etc... talk to your advisor if you don't have one find one.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/limvdbt/",
      "created": 1723935566,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lin043t",
      "score": 1,
      "body": "The world literally ended in March of 2020 and 5 months later we were on a rocket ship to new ATHs",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lin043t/",
      "created": 1723937413,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lin0xjm",
      "score": 1,
      "body": "Just go into NVDA and ride the AI boom",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lin0xjm/",
      "created": 1723937734,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lin4gl6",
      "score": 1,
      "body": "You might consider buying annuities.  You don’t give enough info on your situation.  One strategy is to buy annuities to cover expected living expenses.  Establish a cash balance to cover unexpected expenses.  Then you are not caught in a situation where you need to sell stock in a downturn.  If you are conservative, invest the balance in value stocks and dividend stocks and hold for the long term — rebalancing once a year.\n\nDon’t check the markets every day or even every week or month.  Enjoy retirement!",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lin4gl6/",
      "created": 1723939125,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lio19qu",
      "score": 1,
      "body": "Jesus, why!?   Putler is about to lose, you cant predict the black swan…\nKeep 50% in treasuries and wheel the other 50 in safe assets",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lio19qu/",
      "created": 1723953147,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likuo5h",
      "score": 1,
      "body": "The problem with investing in debt is that inflation can absolutely destroy your purchasing power.\n\nA 30-year 5% bond probably looks like a great deal from where you’re standing but if inflation gets to 10% again during that period, you’re in danger.\n\nA short-term bond is fine, but it does not solve the problem long term and reinvestment will be problematic after rate cuts.\n\nEquity, as rocky as it is, is great in inflationary times. I think going 80% (long term) bonds is probably a good idea now but I’d consider going back into equity if and when we hit a recession, multiple rate cuts and inflation starts looming again.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likuo5h/",
      "created": 1723909515,
      "depth": 0,
      "replies": []
    },
    {
      "id": "likwp54",
      "score": 1,
      "body": "SCHD I think is about as safe as it gets for stocks for the next .. 2 years maybe? Anyone who says they know what to do longer than that is just guessing.",
      "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/likwp54/",
      "created": 1723910214,
      "depth": 0,
      "replies": [
        {
          "id": "lil2pgw",
          "score": 1,
          "body": "SCHD isn't more safe than some S&P 500 index fund",
          "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil2pgw/",
          "created": 1723912309,
          "depth": 1,
          "replies": [
            {
              "id": "lil33yd",
              "score": 1,
              "body": "S&P index is the default, but I feel like today right now SCHD might be safer because the recent outperformance of the magnificent 7 growth stocks, etc. Of course I don't have a crystal ball. But I have significant positions in each of them, and I've certainly done dumber things than holding them both. I basically will hold these 2 forever and I expect to sort of rebalance back and forth over time.",
              "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil33yd/",
              "created": 1723912450,
              "depth": 2,
              "replies": [
                {
                  "id": "lil3mnx",
                  "score": 1,
                  "body": "I don't think there is any dividend focused fund that has outperformed the S&P 500.",
                  "permalink": "/r/stocks/comments/1euk3wx/about_to_go_80_bonds/lil3mnx/",
                  "created": 1723912627,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}