{
  "title": "Starbucks. New CEO.",
  "score": 689,
  "selftext": "As many of you probably already knows, SB is getting a new CEO. Who is the CEO of Chipotle. But do you know exactly what the new CEO will be getting?\n\nSB released their 8-K filing, which outlines the CEO's offer letter.\n\nto quickly break it down, and its a crazy .... (this isnt all of it... i just stopped reading after a bit)\n\n**Salary**\n\n* base salary is $1.6mm/yr\n* reviewed annually. may be increased in discrection of the board\n* base salary may not be decreased without CEO's express written consent.\n\n**Annual incentive**\n\n* annual cash bonus with target of **225% of base salary and max of 450% of base salary**. Meaning he gets a bonus of anywhere $3.6mm to $7.2mm... if he does SHIT performance for 1 year, he is still guaranteed $3.6mm...\n\n\n**Long Term Incentive Plan**\n\n* Starting 2025, Grant of $23mm. vesting 25% / year. (im not 100% sure, but i believe he gets a new grant every year.)\n\n**Signing bonus**\n\n* $10mm signing bonus. a sign on bonus thats 6.25x his base salary\n\n**Replacement Grant**\n\n* Receive a grant of Company equity for leaving Chipotle\n* (has a calculation to determine how much CEO will receive in the event of leaving SB. regardless, its a SHITLOAD) in the $75mm to $80mm range.\n\n**Termination**\n\n* Has severance plan.\n* if he gets terminated, he gets an insane severance plan. Literally enough that even if he didnt have any compensation/salary/Stocks, his severance plan will be enough for him to retire on\n\n**Executive life insurance**\n\n* family coverage\n* equal to 3x annualized based salary. Fully covered by SB\n* pay purchase additional 2x annualized base salary up to max additional LI of $2mm.\n\n(SB states \"As an executive, you and your family have a greater exposure to financial loss resulting from your death. Starbucks recognizes this exposure and has\nprovided for coverage greater\". So i guess his 1 year TC of $10mm+, along with his $10mm signing bonus is not enough for his family in the untimely possibility of his death. SB gives him even MORE additional coverage (which SB pays for) for LI.)\n\n\n**Executive Physical Exam**\n\n(gets special treatment for physical exams. Looks like everyone on the executive team does)\n\n**Work location**\n\n(SB PAYS him to be 100% remote work. gives him his own assistance and full personal office. which SB will also provide and pay for, for maintenance)\n\n* Not required to relocated to HQ (Seattle, WA)\n* from start date until procurment of secondary residence in Seattle (up to 3 months)\nSB will cover temp housing and provide a driver while in seattle\n* If decided to relocated to Seattle, WA, eligible for reimbursement for relocation expenses\n\n**Work conditions**\n\n* starting from the Start Date. company will provide a full remote office for work in Cali.\n* provide assistance of CEO's choosing.\n* Office will be maintained at expense of SB\n\n\nLastly, as CEO, he will be reporting directly to the Board. but get this. he will be appointed to the board of directors as Chairman. (which is usually standard, but still crazy... you report to... yourself)",
  "link_flair_text": "Company Analysis",
  "id": "1euza7s",
  "num_comments": 322,
  "created_utc": 1723950138,
  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/",
  "comments": [
    {
      "id": "linvx3p",
      "score": 636,
      "body": "I’d take that deal too",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/linvx3p/",
      "created": 1723950677,
      "depth": 0,
      "replies": [
        {
          "id": "liooso2",
          "score": 121,
          "body": "I’ll do it for 80%. You know, for the shareholders….",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liooso2/",
          "created": 1723966597,
          "depth": 1,
          "replies": [
            {
              "id": "lip9tdv",
              "score": 36,
              "body": "Don’t sell yourself short. You might have to go into your own personal office once a year for a meeting. You deserve that money.",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lip9tdv/",
              "created": 1723980460,
              "depth": 2,
              "replies": [
                {
                  "id": "liq0ivu",
                  "score": 2,
                  "body": "Corporate jet!",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liq0ivu/",
                  "created": 1723992032,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lisf9gl",
          "score": 19,
          "body": "He 7xed Chipotles profits and doubled sales. How many struggling food chains have you turned around?",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lisf9gl/",
          "created": 1724021617,
          "depth": 1,
          "replies": [
            {
              "id": "lisovbd",
              "score": 16,
              "body": "I would’ve 8xed their profits and tripled their sales",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lisovbd/",
              "created": 1724025309,
              "depth": 2,
              "replies": [
                {
                  "id": "lixzhcg",
                  "score": 2,
                  "body": "Easy, just make the tortillas a little smaller.  Charge $8 for guac.",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lixzhcg/",
                  "created": 1724104611,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lizml1k",
                  "score": 2,
                  "body": "(Or not and you still get big dollarydoos)",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lizml1k/",
                  "created": 1724126309,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "liqf342",
          "score": 6,
          "body": "I guess remote work does pay",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liqf342/",
          "created": 1723997006,
          "depth": 1,
          "replies": []
        },
        {
          "id": "liqivqg",
          "score": 1,
          "body": "I don’t blame ya, damn good deal.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liqivqg/",
          "created": 1723998273,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lio052f",
      "score": 391,
      "body": "You think he would come cheap? They had to poach him from a very successful run at Chipotle. He held all of the cards.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio052f/",
      "created": 1723952627,
      "depth": 0,
      "replies": [
        {
          "id": "liohc3t",
          "score": 149,
          "body": "I'd like to add that apparently he had a lot of unvested stock options at Chipotle (likely in the 10s of millions) that he has to give up with this move. So while this is still an insane amount of money, they had to make a very attractive offer to make up for what he is leaving behind",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liohc3t/",
          "created": 1723961851,
          "depth": 1,
          "replies": []
        },
        {
          "id": "liockyz",
          "score": 128,
          "body": "And he played his cards not in small portion unlike chipotle bowl.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liockyz/",
          "created": 1723958990,
          "depth": 1,
          "replies": []
        },
        {
          "id": "liold6b",
          "score": 93,
          "body": "He did preside over a huge recovery and expansion of Chipotle’s business and share price.  But a more sober assessment would include the fact he’s been presiding over the last 2-3 years in which there’s been a lot of stagnation and declining reputation.  \n\nChipotle today is regarded as being overpriced and perceived as drastically slashing their food quality and portion size.  He did nothing to quell those perceptions.  In fact his recent response to dismiss it was somewhat clownish.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liold6b/",
          "created": 1723964377,
          "depth": 1,
          "replies": [
            {
              "id": "liotm91",
              "score": 51,
              "body": "My first thought was the same. There goes Starbucks quality and friendly staff and in 2-3 years when people stop going because it’s crap he’ll move onto somewhere else.",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liotm91/",
              "created": 1723969849,
              "depth": 2,
              "replies": []
            },
            {
              "id": "liq5ol3",
              "score": 17,
              "body": ">But a more sober assessment would include the fact he’s been presiding over the last 2-3 years\n\nStock price more than doubled from Q2 2021 to Q2 2024. There's been a huge dip recently, but their stock chart doesn't show stagnation.",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liq5ol3/",
              "created": 1723993821,
              "depth": 2,
              "replies": [
                {
                  "id": "liqerya",
                  "score": 20,
                  "body": "It's the same thing as how everyone on Reddit thought Facebook was going to collapse in 2022 because they didn't know anyone who used Facebook. \n\nChipotle continues to see same store restaurant sales rise. It's almost like the vast majority of their customer base aren't chronically online complaining about portion sizes and shoving cameras in workers faces.",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liqerya/",
                  "created": 1723996902,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "liret9b",
                  "score": 2,
                  "body": "Gee I wonder what happened in 2021 to enable that comp growth?  I guess Brian developed and distributed vaccines around the world.",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liret9b/",
                  "created": 1724008887,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lipy96o",
              "score": 6,
              "body": "The day before this announcement I was talking with a group of people about how Chipotle is such a piece of shit restaurant.  Food sucks, overpriced.  I'm really not much of a Starbucks fan anyway but I imagine this will do the same.",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lipy96o/",
              "created": 1723991217,
              "depth": 2,
              "replies": []
            },
            {
              "id": "liq2aha",
              "score": 9,
              "body": "He road Chipotle wave of popularity nothing more.  Chipotle had hiccups along his tenure but those hiccups couldn't stop the wave.  A trued test is how he did last few yrs and now that business is stagnant.   I feel sorry for the next CEO of Chipotle because that shit will have years of declining sales for few more year and will take the blame.\n\nHe jumped ship at the right time and got SB to pay him a guaranteed vesting schedule he had at Chipotle and get more guaranteed no matter what happens at SB.",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liq2aha/",
              "created": 1723992653,
              "depth": 2,
              "replies": [
                {
                  "id": "liqgdfb",
                  "score": 11,
                  "body": ">A trued test is how he did last few yrs and now that business is stagnant.\n\nHow is Chipotle \"stagnant\" at all? The stock is up like 150% in the past two years. The company continues to demonstrate reasonable sales growth at their stores. For Q2 2024, they reported an 11% increase in restaurant sales. By comparison, McDonald's same store sales declined in the same period. I don't even own the stock but it's just bizarre to claim that the business is stagnant.",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liqgdfb/",
                  "created": 1723997434,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lipyvqe",
          "score": 11,
          "body": "I mean there are probably 10,000 people who could do the job at Starbucks. This notion of celebrity ceos is absolutely ridiculous and the money they are all collective stealing from real owners of the business because the boards are corrupted is ridiculous.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lipyvqe/",
          "created": 1723991446,
          "depth": 1,
          "replies": [
            {
              "id": "liq6fbx",
              "score": 3,
              "body": ">I mean there are probably 10,000 people who could do the job at Starbucks.\n\nCould do it and could do it as well are two different things.\n\nThe difference between a CEO and a CEO that's 1% better than the next best guy is over a billion dollars in stock value at Starbucks.\n\n>money they are all collective stealing from real owners of the business because the boards are corrupted\n\nWhy do you think the board is corrupted? Which of the Starbucks board do you think has anything to gain from fucking over Starbucks to personally enrich Brian Niccol?\n\nhttps://investor.starbucks.com/governance/board-of-directors/default.aspx",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liq6fbx/",
              "created": 1723994079,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "liq1i4a",
          "score": 6,
          "body": "This will be a disaster.   This guy road the qave that was chipotle phenomenon.  The wave was there before he got there and now he sees the end is near for it as Chipotle has saturated the markets they are in. \n\nI equatethe move to tbe days when other companieswsre poaching Appleexecutivesfor thier retail failures.  It was the executives it was the Apple brand.  A monkey would have been successful at Apple retail division at that time.  The same is true with Chipotle.   A monkey with juat a little business sense could have run Chipotle.   Or take Marissa Mayer the great success at Google that supposedly made good what it is today.   YAHOO gave here a similar deal being given to the new SB ceo.  She failed miserable.   Wasted billions.  Bailed out friends.  SB will see a similar fate.  This guy has no incentive and no real requirements or accountability. \n\nIf I was in SB id sale right now with that huge pop.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liq1i4a/",
          "created": 1723992376,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lis7lfy",
          "score": 1,
          "body": "Why the fuck did I buy chipotle.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lis7lfy/",
          "created": 1724018701,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lisdtho",
          "score": 1,
          "body": "Cut quality and shrink portions... Some real big brain Harvard MBA wizz stuff they had to poach.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lisdtho/",
          "created": 1724021052,
          "depth": 1,
          "replies": []
        },
        {
          "id": "litmp07",
          "score": 1,
          "body": "You are giving this guy too much credit, he just did some simple cost cutting, the pandemic and inflation did the rest.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/litmp07/",
          "created": 1724039293,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lio2xzu",
      "score": 147,
      "body": "Can’t wait for that to all trickle down to us. ",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio2xzu/",
      "created": 1723953955,
      "depth": 0,
      "replies": [
        {
          "id": "liojldw",
          "score": 18,
          "body": "That's how shares work, if he's successful.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liojldw/",
          "created": 1723963278,
          "depth": 1,
          "replies": [
            {
              "id": "lioxi1m",
              "score": 38,
              "body": "Except if he tanks the company he still gets the money.",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lioxi1m/",
              "created": 1723972494,
              "depth": 2,
              "replies": [
                {
                  "id": "lirjjyh",
                  "score": 4,
                  "body": "Uh....not really (guessing you didn't actually read the filing in the OP)?\n\nThe $10mm he gets to keep, but the [$75mm in share-based comp vests over a three year period](https://imgur.com/a/olMHyoM)",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lirjjyh/",
                  "created": 1724010504,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lipzuzh",
              "score": 5,
              "body": "I suppose you are correct, they make money to pay him if they do well, ie share holders do well. ",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lipzuzh/",
              "created": 1723991798,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "linxhnx",
      "score": 76,
      "body": "This isn't surprising. He's a successful CEO of a similarly large company. Do you think Starbucks would've been able to pull him away for a lower offer?\n\nIf you want the highest quality/highest potential for success, you have to pay for it. Even making 5% better decisions than the next best guy is worth billions of dollars to shareholders.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/linxhnx/",
      "created": 1723951400,
      "depth": 0,
      "replies": [
        {
          "id": "lio5dfv",
          "score": 19,
          "body": "he cant make shit difference for Starbucks, we will find out soon.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio5dfv/",
          "created": 1723955150,
          "depth": 1,
          "replies": [
            {
              "id": "liokd7d",
              "score": 7,
              "body": "Might be already enough to sell the China business and focus on USA as he did for Yum Brands.",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liokd7d/",
              "created": 1723963757,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lionv7w",
              "score": 3,
              "body": "Might be true. But if you're Starbucks, he literally only needs to be 0.1% better than the next best guy you would've hired to break even on him.",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lionv7w/",
              "created": 1723965981,
              "depth": 2,
              "replies": []
            },
            {
              "id": "liu237l",
              "score": 2,
              "body": "He literally already did, and paid for himself. Upon announcement, SBUX went up ~25%, adding billions to their market cap",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liu237l/",
              "created": 1724047861,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lisfugx",
              "score": 1,
              "body": "Do you have a short position?",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lisfugx/",
              "created": 1724021841,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "linwruq",
      "score": 152,
      "body": "Yup, after being in the red for a couple years, I basically broke even with this news and cashed out. Considered keeping the position but everything I've read about this new CEO, I was very unimpressed. We'll see I guess. Just glad I got my money back.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/linwruq/",
      "created": 1723951070,
      "depth": 0,
      "replies": [
        {
          "id": "liny2il",
          "score": 74,
          "body": "What about him is unimpressive? His track record in chain food service is pretty remarkable. \n\nThe last guy was more of an MBA consultant type.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liny2il/",
          "created": 1723951672,
          "depth": 1,
          "replies": [
            {
              "id": "linzgxt",
              "score": 111,
              "body": "Maybe unimpressed isn't the right word. I just dont think he brings anything to the table that will help SB. Taco Bell and Chipotle had room to grow. Literally anybody could have done that job and it was only going to get more popular. SB is in a totally different situation. They've been the dominant cafe for years now and are oversaturated. As they age they're losing popularity. The last couple years, they've been in the news for the wrong reasons. Anecdotally, I hear Gen Z kids prefer Dutch Bros. Consumer stocks in general have been down because of inflation. He's most known for cutting corners at Chipotle. He better have another trick up his sleeve to make this work, or else I see this as a lateral move for SB.",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/linzgxt/",
              "created": 1723952318,
              "depth": 2,
              "replies": [
                {
                  "id": "lio49bt",
                  "score": 54,
                  "body": "This is my take too. Considering Starbucks already has labor issues, and it’s already such a low overhead product I don’t know how many more corners they can cut, I can only expect quality to tank. Considering it’s already being “boycotted”, and from an anecdotal perspective I have to agree that Starbucks simply doesn’t compete with competitors in any ways besides price and convenience. And it barely reaches the first one. With belt tightening across the country coffee is an easy cut for a lot of people. They’re gonna push for cutting costs and viral marketing, I don’t think it will work",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio49bt/",
                  "created": 1723954598,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lir0j6d",
                      "score": 5,
                      "body": "They can cut some non-core products that don't add much value and take up time. Their mobile app situation is ripe to be sorted out.\n\nBelt tightening is a macro issue that affects everyone.",
                      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lir0j6d/",
                      "created": 1724004099,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "liodf04",
                  "score": 24,
                  "body": "This, a new ceo isn't going to magically fix the wage stagnation of it's underlying customers who are being forced to choose between luxuries. He will close locations in poorer areas, change suppliers, packaging, people will get less product, he'll pocket 1.6 mill next year for this.",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liodf04/",
                  "created": 1723959474,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "liokrdh",
                  "score": 33,
                  "body": "Yes anyone could’ve led Chipotle through a food borne illness crisis and reset the company to strong growth…..Some of the comments here are just bizarre.",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liokrdh/",
                  "created": 1723964001,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "liq6cxa",
                      "score": 3,
                      "body": "It’s jealousy, while others just started and don’t remember Chipotle falling off a cliff.",
                      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liq6cxa/",
                      "created": 1723994055,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "liqh6px",
                  "score": 4,
                  "body": "Yes, Taco Bell and Chipotle had opportunity, however, I disagree that anyone would have capitalized on it. It needed the right person to steer the ship.\n\nBoth Taco Bell and Chipotle had flagging sales and reputational damage prior to his joining (Taco Bell and their expensive beef lawsuit and being a punch line for gastric distress inducements, and Chipotle with the E Coli incidents).\n\nI do agree that SBUX is a different beast, as it is larger and more saturated, however, I still think there are some aspects that strong leadership can fix.\n\n* Menu simplification - This \"let's add boba tea and other non-core things to appeal to a subset of Gen Z\" strategy rarely works, It adds complexity to the logistics and ops, with minimal gain.\n* The mobile App - This is their biggest problem. There is no capacity control on it. no limitations on the crazy stuff and no flow management. What this results in is slower turnaround time, people in store waiting forever while someone blocks away is tying up barista time and more.\n\nThe macro issues will, of course, persist. However, unless you believe that SBUX is a dead company with no future, I think Niccol is a good get.\n\n---\n\nAlso, thanks for the detailed answer. Appreciate the discussion!",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liqh6px/",
                  "created": 1723997706,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lisg02b",
                  "score": 4,
                  "body": "> Literally anybody could have done that job and it was only going to get more popular\n\nThat was not the view at the time. Chipotle was declining and had serious quality issues, combined with the ecoli scandal.",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lisg02b/",
                  "created": 1724021899,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "litx2vv",
                      "score": 3,
                      "body": "Redditors generally think that executives are just silver spoon Ivy League MBAs with connections who aren’t actually resourceful, genius level smart and cunning, but are instead just figureheads who say things like “sell more stuff” and it just happens. \n\nIf a company fails, Redditors will say the execs were incompetent. But if the company succeeds, they’ll say the execs were useless. It’s a paradox where you can’t be good at the job because if you do a good job you were useless.",
                      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/litx2vv/",
                      "created": 1724044815,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lipk9bm",
                  "score": 3,
                  "body": "They just opened a 7brew in my area and it seems like it's a lot more popular. \n\nI agree the coffee shop market seems to be oversaturated.",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lipk9bm/",
                  "created": 1723985726,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "liogifr",
                  "score": 5,
                  "body": "Shades of Marissa Mayer being brought on to rescue Yahoo. Completely different challenge in a mature and aging company.",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liogifr/",
                  "created": 1723961338,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "livq4el",
                      "score": 2,
                      "body": "Remember this well.",
                      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/livq4el/",
                      "created": 1724078726,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "liou2sf",
                  "score": 6,
                  "body": "Taco bell has been around for decades also. I disagree with almost everything you said here. Starbucks has tons of potential and room to grow. Their food is trash which I think will. E the first change he makes. I don't have a stake in sb but I think the new CEO has lots of different paths he could go down which will improve the company",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liou2sf/",
                  "created": 1723970163,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "liq5km8",
                      "score": 2,
                      "body": "Their food is actually really good. Very small for the money, but tasty.",
                      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liq5km8/",
                      "created": 1723993784,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "liomjmr",
              "score": 7,
              "body": "While the last guy was MBA type *on paper*, he was actually kind of passionate about the business and coffee, and he did do a six month stint as barista.  Yes, he ultimately flopped, but he definitely had a bum hand.  \n\nSBUX’s new guy got a bit lucky inheriting a decimated CMG but yes he did preside over a large multiple comeback and share price expansion.\n\nBut if one takes off the rose glasses, he has also presided over the last 3 years in which Chipotle’s reputation has declined.  And he’s done nothing about that.  It’s stagnant and, like Starbucks, saturated.\n\nHis handling of the last year’s perception of CMG food quality and value going through the floor has been notably poor.  \n\nSo he may not actually be as good as the CMG share price moves would suggest.",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liomjmr/",
              "created": 1723965128,
              "depth": 2,
              "replies": [
                {
                  "id": "lip791u",
                  "score": 3,
                  "body": "Laxman?  He was also awful at Reckitt before Starbucks",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lip791u/",
                  "created": 1723978965,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "liqkbt7",
                  "score": 2,
                  "body": "He did roll up his sleeves and spend time, which is good. However, a lot of stuff he was doing after 6 months was hardly what I would expect a CEO of a global chain to be doing.  From an article\n\n>For example, Narasimhan said they will begin cutting down on digital communications corporate sends to stores (addressing one common complaint), will get more breakfast sandwiches to stores to address shortages, and they will redesign the bags sous vide eggs come in, as these are oftentimes hard for employees to open, especially when under time pressure\n\nThese are all good ideas, but stuff I would expect Narasimhan to have delegated his Ops team to go handle. The bigger issues, such as menu complexity, idle customer time in store and mobile app chaos are things that will move the needle. \n\nA couple of million dollars is what it cost to have Narasimhan in the store - for that, more breakfast sandwiches is underwhelming.",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liqkbt7/",
                  "created": 1723998758,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lirg6fp",
                      "score": 2,
                      "body": "I agree his execution has been late/weak.  But i raised the point mostly to counter the bullshit someone posted that he was just like every cookie cutter MBA.  Presumably OP just saw McKinsey and extrapolated wrong assumptions.  A secondary point is that a CEO who has no clue and no experience with the actual retail coal face of such a business would typically be a mistake.  Spending half a year to figure out what you or I could in a couple days isn’t great.  \n\nI skipped over detailing his time spent doing first hand international research.  I imagine that could sometimes lead to great and profitable insights.  However his main takeaway from that was apparently the push for “Oleato”, the upcharge for olive oil in your coffee.  It’s an idea that myself and pretty much all North Americans reviled at first mention.  We predicted it would be a flop or worse, but he pushed it hard last year to dismal results.  Then I heard he was going to double down on it again this year on the premise it just needs more time and promotion... except now the commodity itself has ballooned in cost.  That’s what reconfirmed to me he’s probably an idiot.",
                      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lirg6fp/",
                      "created": 1724009354,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lisgb1b",
                  "score": 2,
                  "body": "> he has also presided over the last 3 years in which Chipotle’s reputation had declined.\n\nBut sales, profit and stock have grown significantly.",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lisgb1b/",
                  "created": 1724022014,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "liob5jy",
          "score": 3,
          "body": "I sold at a minor loss, for better options didn’t feel like waiting or risking it- tax harvest will redeem it so eh",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liob5jy/",
          "created": 1723958182,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lipb07u",
          "score": 2,
          "body": "Buy signal right here.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lipb07u/",
          "created": 1723981134,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lio0hwz",
          "score": 4,
          "body": "Dorito tacos, CMG up 750%, seems impressive to me",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio0hwz/",
          "created": 1723952787,
          "depth": 1,
          "replies": [
            {
              "id": "lio0onz",
              "score": 8,
              "body": "Great! Let's make a small Cool Ranch cappuccino!",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio0onz/",
              "created": 1723952872,
              "depth": 2,
              "replies": [
                {
                  "id": "lio1t8q",
                  "score": 7,
                  "body": "Baja Blast Cooler does have a good ring to it ",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio1t8q/",
                  "created": 1723953407,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "linz1dv",
          "score": 5,
          "body": "Did pretty damn good with chipotle",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/linz1dv/",
          "created": 1723952121,
          "depth": 1,
          "replies": [
            {
              "id": "linzwxc",
              "score": 10,
              "body": "Completely different situations.",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/linzwxc/",
              "created": 1723952526,
              "depth": 2,
              "replies": [
                {
                  "id": "liojpxp",
                  "score": 12,
                  "body": "He took over Chipotle when they had court cases because they poisoned people. Most people here tend to forget that it was a dead company when he took over.",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liojpxp/",
                  "created": 1723963355,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lio8p8f",
      "score": 76,
      "body": "It’s unbelievable. I work at a large company where our CEO was considered “very successful” because the company thrived during the pandemic, thanks to increased sales. But when post-pandemic sales dropped, the CEO responded by firing a large number of employees, all while still pocketing millions. If a CEO needs to lay off that many people at once, they’ve essentially failed at their primary responsibility—anticipating future challenges. CEOs are crucial for small businesses and startups, but in a massive global corporation, unless they overhaul the entire management structure, a CEO's impact is limited. I sold this stock a while ago, and it’s permanently on my do-not-touch list, especially after seeing how much they’re paying the new CEO.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio8p8f/",
      "created": 1723956863,
      "depth": 0,
      "replies": [
        {
          "id": "liokakz",
          "score": 18,
          "body": "If the CEO has little to do on the positive side then you can’t really blame him for anything negative either?\n\nI get your point but working at a large company you should know that with each level there is less direct influence on the day to day business but more responsibility and the need to make (difficult) decisions.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liokakz/",
          "created": 1723963711,
          "depth": 1,
          "replies": [
            {
              "id": "lioo0p6",
              "score": 4,
              "body": "Actually, that's where I disagree. The primary role of a leader is to ensure the company is moving in the right direction—otherwise, what's the point of having a CEO? My argument is that in the majority of cases (say, 80%, though that's just an estimate), it's the director-level management that's truly driving the company and facilitating its growth. Of course, there are situations where a company is struggling due to financial issues, and a CEO steps in to fix those—I've seen this happen a few times. But honestly, any finance professional with solid experience and a good head on their shoulders could handle that. Despite my dislike for Elon Musk and the antics he pulls on social media, I do appreciate how closely he monitors operations at Tesla.",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lioo0p6/",
              "created": 1723966079,
              "depth": 2,
              "replies": [
                {
                  "id": "liorcwa",
                  "score": 5,
                  "body": ">Actually, that's where I disagree. The primary role of a leader is to ensure the company is moving in the right direction—otherwise, what's the point of having a CEO?\n\nI think we are talking about the same thing. A CEO is just not involved in the day to the business and overseeing the larger picture. I think it’s most visible when you listen to long interviews with the CEO, when they cover financial detail, those about personal and move to marketing or innovations. They still need to know about everything without getting lost in details. Zuckerberg deciding on cutting jobs is just as important as investing in AI.\n\n>Despite my dislike for Elon Musk and the antics he pulls on social media, I do appreciate how closely he monitors operations at Tesla.\n\nWhat makes you think others don’t do it too. Just because they are not as vocal about it in public? I’m not a fan of the stock but I would assume GME investors would say the same about Cohen.",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liorcwa/",
                  "created": 1723968327,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "liol2ey",
          "score": 23,
          "body": "In his case this is a bit unfair as he turned Chipotle around from a total mess to a leader in the food business. It is not very unbelievable when the previous company he ran the stock went up almost 800%, added new hit menu items, revamped their ordering strategy, and changed the perception of Chipotle from a unhygienic place to a leader in food business.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liol2ey/",
          "created": 1723964189,
          "depth": 1,
          "replies": []
        },
        {
          "id": "liom1va",
          "score": 3,
          "body": "I would argue CEO’s primary responsibility is properly filling the c suite and with successfully liaising between the board and the c’s.  \n\nThat way if reductions in force are going to be a thing, the CEO is well ahead of it so at the very least, there’s no surprises. \n\nI would agree with you that if a ceo’s daily activities or views are somehow moving a company, it means they don’t have the right other chiefs in place.  And in agreeing with you on their limited impact, I don’t mind that he’s mostly “work from home”.  Nor does the comp bother me.  His hiring already made my year in terms of the market cap move.  \n\nBut like you, I also cashed out.  25% in a day is good enough for me.  Should if move another 20, I won’t cry.  I’m skeptical of what he could actually do that’s both quick and effective.  What CEO is going to fix the problems in China?  The saturation?  \n\nI do have ideas of what *I’d* do if I were forced to fix Starbucks.  But I’m not sure even this guy will do them.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liom1va/",
          "created": 1723964808,
          "depth": 1,
          "replies": []
        },
        {
          "id": "liq3krq",
          "score": 2,
          "body": "In its official statement the company expresses confidence in his ability to “deliver long-term, enduring value for our partners, customers and shareholders.” \n\nIt’s the customer comment that gets me - no way in hell will he create any value for the customers. They will be squeezed for every last dollar with classic techniques like upselling, shrinkflation, and a reduction in quality while employees will simultaneously be pushed to the breaking point. That’s how these things work. To pretend anything else is simply disingenuous.\n\nThe other thing that strikes me is how normalized it is for companies to state their goal to “create shareholder value.” With comments like this it seems like the primary goal is no longer to serve customers. The primary goal is now to generate capital for shareholders and partners. I’m just trying to imagine a company putting out a public release talking about the new CEO “creating shareholder value” 50 years ago. It’s crazy to me how far we are pushing this system at the expense of the average person.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liq3krq/",
          "created": 1723993100,
          "depth": 1,
          "replies": []
        },
        {
          "id": "liq76rs",
          "score": 2,
          "body": ">If a CEO needs to lay off that many people at once, they’ve essentially failed at their primary responsibility—anticipating future challenges\n\nThat's not true at all. Business conditions dictate changes.\n\nFor example: in tech, low interest rates led to massive hiring sprees because you could fund low growth for extremely cheap. Once interest rates rose, those workers got fired because they no longer added more value than their cost - which changed because of increased interest rates. Hiring and then firing those workers was the right move, because not hiring them would've meant missing out on a lot of cheap growth that remains even after you fire the workers.\n\nSimply saying that laying people off is a business failure is ignorant.\n\n>a CEO's impact is limited\n\nDisagree. See: Jamie Dimon, JPM vs Citi. Why do you think JPM has thrived since he's been there, whereas Citi stagnated once he left?",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liq76rs/",
          "created": 1723994340,
          "depth": 1,
          "replies": [
            {
              "id": "liq8izu",
              "score": 2,
              "body": "I can see the reasoning behind layoffs being a business necessity at times. However, I think what tech companies did during the pandemic was misguided. They overhired and overpaid their employees, which in my opinion, was a mistake. Hiring two people for the same role and paying them each double their value isn’t going to result in twice the revenue or profit. I recall hearing reports about tech employees who had little to no work and were eventually laid off a year later.",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liq8izu/",
              "created": 1723994794,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lir5uzs",
          "score": 1,
          "body": "Sounds like a lot of CEOs who rode the wave overhired and now have to let go",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lir5uzs/",
          "created": 1724005877,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "linwibq",
      "score": 25,
      "body": "Must be nice",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/linwibq/",
      "created": 1723950946,
      "depth": 0,
      "replies": [
        {
          "id": "lipkv9b",
          "score": 2,
          "body": "\"It's good to be the king.\"  \\~Mel Brooks",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lipkv9b/",
          "created": 1723985999,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lio2xsi",
      "score": 41,
      "body": "My first 100 day plan if I were him: \n\n- spin Starbucks China off like YUMC, get additional cash and an increase in margins that is accretive to this year’s EPS.  \n\nLet the Chinese strategic partner compete with the local competitors. People love Starbucks especially the Roastery. But the buzz right now isn’t at Starbucks even though China is in the grips of a coffee fever. \n\n(See [here](https://www.reddit.com/u/raytoei/s/G0vI5HFWeY) for my post/pix on how Luckin is capturing the youngsters’ hearts and minds) \n\nLuckin and Cotti are selling 1.6 usd latte to a population that can differentiate between good and bad coffee but not good and great coffee. Luckin has started opening shops outside of China, how long do you think it will take for them to open in India ?\n\n- simplify Starbucks to increase velocity . People are taking too long to order and receive their drinks. Some of the customisable stuff works against this balance. \n\n- use innovation to further increase velocity, push for Starbuckslanes much like chipotlanes.  And push for higher digitisation like the Chinese (Luckin is > 95% digital, there are no ordering stations nor cash registers at the stores. Use incentives to push for going  digital)\n\n- relook at how the “3rd- place” concept can be refined further. Consider that people are going as a single more often than meeting friends. \n\n- change the partner in India. TATA is just taking advantage of Starbucks, they have had only 390+ store openings in the last 11 years. \n\nJust saying",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio2xsi/",
      "created": 1723953952,
      "depth": 0,
      "replies": [
        {
          "id": "lionj18",
          "score": 8,
          "body": "I said some similar things.  One, he needs to revamp the coffee in a way that everyone on earth will hear about.  The coffee has long been perceived as burnt and crummy.  McDonald’s went from worst coffee on earth to number 2.  Number 1 in some eyes.  It takes a bold change to make an actual results change.  Change the coffee/supplier.  People like the sugar and other junk in the drinks, the coffee itself is not sacred.  Pull a McCafe or DPZ level change.\n\nAutomate most of the drink production to speed it up dramatically.  If Nespresso and CafeDelux can pump out tasty drinks, surely Starbucks can emulate and improve on that.  Have the barista perform the last step or whatever.  The age of people feeling like they’re treating themselves because a hipster slaves over the drink creation... that’s over.  People just want their lattes now, quickly.  \n\nHave a (perceived) value menu.  Even if it means selling 20 cents of “plain” coffee for $3, re-programming the public that Starbucks isn’t exclusively overpriced and pretentious drinks could be transformative.  And selling 20 cents of water for $3 won’t be a bad thing, especially with traffic going up instead of down.\n\nInternational we could discuss but your ideas are as good as any.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lionj18/",
          "created": 1723965762,
          "depth": 1,
          "replies": [
            {
              "id": "liphtg1",
              "score": 4,
              "body": "Your suggestions sound a lot like \"make Starbucks operate more like Dunkin\". \n\nFor better or worse, Starbucks' brand needs the hipster slave perception to differentiate itself, I think. Otherwise, why not just go to Dunkin? They already have the better tasting beans and quick service.",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liphtg1/",
              "created": 1723984600,
              "depth": 2,
              "replies": [
                {
                  "id": "lire7yj",
                  "score": 2,
                  "body": "If I were forced to take millions of dollars comp to fix Starbucks, I wouldn’t “just go to dunkin”.  But the upward trajectory of dunkin vs the downward trajectory of Starbucks should mean you agree.  Consider also that Starbucks is a very international business whereas Dunkin is domestic. That gives more credence to the ideas presented being able to work.",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lire7yj/",
                  "created": 1724008684,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lioefam",
      "score": 9,
      "body": "Small note on the bonus: \n\nThey are almost never guaranteed. “Target” (the minimum) means he plain and simple has a performance of 100%. He probably has very aggressive targets. They are paying a sizable amount of money for him.\n\nSmall note on the CEO/Chairman:\n\nIt’s done like this normally as the Chairman is typically just a “honorary” title within the board. If he chairs the board he has a bit more administrative duties like call them up and get them together, lead the company presentations, etc. The board will usually vote per curiam or will exclude him/he will excuse himself from voting his own stuff. Actually, it is very possible that there is a committee inside the board handling compensation. \n\nThe weirdest part to me is not relocating to Seattle. I don’t know if he worked remotely at Chipotle, but for a CEO to not have a base of operations in the HQ is weird.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lioefam/",
      "created": 1723960062,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lio75bo",
      "score": 8,
      "body": "> annual cash bonus with target of 225% of base salary and max of 450% of base salary. Meaning he gets a bonus of anywhere $3.6mm to $7.2mm... if he does SHIT performance for 1 year, he is still guaranteed $3.6mm...\n\nA bonus target does not guarantee anything.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio75bo/",
      "created": 1723956073,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lio1p7p",
      "score": 14,
      "body": "This guy could literally do nothing and be set for life",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio1p7p/",
      "created": 1723953354,
      "depth": 0,
      "replies": [
        {
          "id": "liqb265",
          "score": 1,
          "body": "But watch, lay-offs stock buybacks and liquidity assessments all over the world for 3% more profit.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liqb265/",
          "created": 1723995657,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lisgvsp",
          "score": 1,
          "body": "Sure, but people who get to CEO are usually workaholics that aren't content sitting around doing nothing.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lisgvsp/",
          "created": 1724022236,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "liobyvh",
      "score": 7,
      "body": "Bring on the overstuffed Frappuccino-Burrito",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liobyvh/",
      "created": 1723958641,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lio5rmg",
      "score": 5,
      "body": "What a smart guy that CEO is\n\nAlso, target bonus does not mean minimum bonus, bur it is still a lot",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio5rmg/",
      "created": 1723955349,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lio91q9",
      "score": 11,
      "body": "Don’t forget the biggest part, $75m in sign on stock units. So $85m sign on alone, plus an at goal total comp of around $30m.\n\nWith the cash bonus a lot of plans go below goal,\nSo if they suck big time his cash bonus will be less than 225%. Obviously dude is still making insane amounts of money. Executive pay is out of contorl",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio91q9/",
      "created": 1723957042,
      "depth": 0,
      "replies": [
        {
          "id": "liodicz",
          "score": 2,
          "body": "> Don’t forget the biggest part, $75m in sign on stock units.\n\ni believe thats only part of his replacement grant. i.e. if he leaves he gets $75mm in stock units in lieu of his other compensations he's \"giving up\". (theres a bit more caveat to it though)\n\nthis guy is literally set. whether he does great, bad, leaves, gets fired, w/e he's set.\n\nEDIT: nope you are right. i misunderstood the 8-K section on this. he is in fact, getting $75mm (at the minimum. upwards to $80mm) as compensation for leaving Chipotle. Thats the \"giving up\" part it meant. and i misunderstood it. Adding this part to the OP as well now. ty for pointing it out",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liodicz/",
          "created": 1723959527,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lio0tcr",
      "score": 4,
      "body": "I hope they keep my pumpkin spice latte.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio0tcr/",
      "created": 1723952932,
      "depth": 0,
      "replies": [
        {
          "id": "liozuco",
          "score": 2,
          "body": "Sure, but Guacamole will be an extra $2.95",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liozuco/",
          "created": 1723974100,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lio1xgs",
          "score": 3,
          "body": "It isn’t hard to make at home",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio1xgs/",
          "created": 1723953464,
          "depth": 1,
          "replies": [
            {
              "id": "lio2hdz",
              "score": 2,
              "body": "Making your own PSL at home during Fall is criminal…",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio2hdz/",
              "created": 1723953729,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lioe6zn",
              "score": 1,
              "body": "Most fastfood isn’t",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lioe6zn/",
              "created": 1723959928,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lio0war",
      "score": 3,
      "body": "Can I have some extra rice and beans, hmm? 🤤",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio0war/",
      "created": 1723952971,
      "depth": 0,
      "replies": [
        {
          "id": "lioe80x",
          "score": 1,
          "body": "$10 extra",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lioe80x/",
          "created": 1723959945,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lio7unk",
      "score": 3,
      "body": "Starbucks is a multi national multi billion dollar corp \n\nHis pay package is really consistent with the huge ship he will be commanding and the dramatic turn around he needs \n\nI hope he is smart enough to start with HR and hiring \n\nHe has really terrible regional and district managers \n\nUsually CEO’s are to far from the boxes to ever realize this \n\nHe needs to totally re evaluate KPI’s and blah blah blah",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio7unk/",
      "created": 1723956441,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lio3tln",
      "score": 3,
      "body": "is any of this supposed to be surprising? this is all normal, go look at any proxy statement executive comp section of every company worth 100b or more",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio3tln/",
      "created": 1723954380,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liojm7h",
      "score": 2,
      "body": "This is the same as the Musk pay package conversation. If he generates a higher return for investors, everyone is happy.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liojm7h/",
      "created": 1723963292,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lioncnb",
      "score": 2,
      "body": "lol he working remote? Dudes going to be coasting",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lioncnb/",
      "created": 1723965646,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lip7n24",
      "score": 2,
      "body": "I hate that guy after way he handled Chipotle skimping customers.   Will avoid Starbucks as much as possible.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lip7n24/",
      "created": 1723979196,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lipl3px",
      "score": 2,
      "body": "i think its fair",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lipl3px/",
      "created": 1723986103,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lipr546",
      "score": 2,
      "body": "Seems like a fairly standard deal for a company as large as Starbucks.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lipr546/",
      "created": 1723988519,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liq0ct7",
      "score": 2,
      "body": "I dont think anyone can convince the public to buy a 10 dollar coffee in such an economy",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liq0ct7/",
      "created": 1723991973,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lir48u9",
      "score": 2,
      "body": "If you think that’s expensive, compare it to the value erosion under the previous CEO",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lir48u9/",
      "created": 1724005342,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lirled4",
      "score": 2,
      "body": "He is paid in millimetres instead of money, is he dumb or something ?",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lirled4/",
      "created": 1724011122,
      "depth": 0,
      "replies": []
    },
    {
      "id": "linwizk",
      "score": 7,
      "body": "Look at how well the guy managed chipotle. He is likely worth every penny and then some. If he does even half as good a job as he did at chipotle I expect sbux stock will be doing quite well in a few years.\n\nI have a sizeable position in SBUX.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/linwizk/",
      "created": 1723950955,
      "depth": 0,
      "replies": [
        {
          "id": "linxbi2",
          "score": 20,
          "body": "From what I understand he basically made Chipotle more efficient but at the cost of their reputation among their customer base. I think eventually it'll reflect into their stock price. There was even a gross internet trend started by customers about shoving a camera in their employees' face demanding bigger portions. The customer/employee experience is bad and you can only abuse that for so long. He better have a different plan on running SB imo. That strategy wont work with an already oversaturated business.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/linxbi2/",
          "created": 1723951321,
          "depth": 1,
          "replies": [
            {
              "id": "lio1u7c",
              "score": 9,
              "body": "Personally I stopped going to Chipotle because the meat portions are pathetic",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio1u7c/",
              "created": 1723953420,
              "depth": 2,
              "replies": [
                {
                  "id": "lio4nvy",
                  "score": 4,
                  "body": "Yeah. Who wants a 2Lb rice burrito?",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio4nvy/",
                  "created": 1723954798,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "linzdpy",
              "score": 4,
              "body": "I do think there is merit to discussing the portion issues at chipotle. I dont think I would blame that on the ceo though. From what Ive read it appears the portions were supposed to be a specific amount and that amount is not being followed at all locations well. Some locations are putting out a lot more and some a lot less, but most are reasonably close to the target. \n\nMany years ago I worked for a Papa Johns. The local franchise insisted we short everyone on cheese. Standard was supposed to be 2 cups of cheese on a large pizza if i remember correctly and we were doing 1.5 cups. That was enforced by local management and the only time we did standard was when corporate compliance folk came around. I didnt blame the ceo of papa johns for that. I did think it wasn't right, but I was a young college kid and the folks running that location were the ones pushing that. They are still in that location all these years later and still doing fine. I dont know if they still do that though. \n\nIn case of chipotle I see a company that has been doing quite well in the sector. Just like all the other companies in the sector I expect many of the employees aren't happy with their jobs though because most of them want less drama, better pay and that isnt likely to happen working for fast food. I expect the majority of customers are happy with it or they would go elsewhere and the ones who aren't should go elsewhere. If they aren't going elsewhere that doesn't sound like its a chipotle problem so much as a problem they are having with their lives in general. \n\nIn the end we will just have to wait and see how this plays out. If you feel it will be a good outcome buy some stock. If you dont sell the stock if you have it or dont buy it if you dont have it.",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/linzdpy/",
              "created": 1723952276,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "linwrra",
          "score": 1,
          "body": "Increased value for shareholders… while destroying the customer experience and sentiment. Starbucks already on life support… he’ll just milk it dry and it’ll be bankrupt in no time.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/linwrra/",
          "created": 1723951069,
          "depth": 1,
          "replies": [
            {
              "id": "liny1fr",
              "score": 5,
              "body": "so you think he is going to destroy starbucks based on what? \n\nHis prior ceo experience strongly suggests he knows how to improve things for both the customer and the stockholder. The company probably will still struggle with some issues for awhile, but I expect the outcome is going to be better for most everyone involved. What I would be surprised is if he takes a short term approach that wrecks the company value in the long term. \n\nIf you feel strongly about your view are you going to buy puts on sbux?",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liny1fr/",
              "created": 1723951658,
              "depth": 2,
              "replies": []
            },
            {
              "id": "linx9fv",
              "score": 6,
              "body": "Starbucks going bankrupt? Lmao",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/linx9fv/",
              "created": 1723951294,
              "depth": 2,
              "replies": [
                {
                  "id": "liny8u3",
                  "score": 3,
                  "body": "in socal there seems like thousands of coffee shops opening up that are exciting and new. Starbucks is looking mighty stale in comparison so we will see.",
                  "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liny8u3/",
                  "created": 1723951754,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lio57cb",
      "score": 3,
      "body": "Murica",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio57cb/",
      "created": 1723955066,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lioaeax",
      "score": 2,
      "body": "I have never bought anything at Starbucks.\n\n😂",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lioaeax/",
      "created": 1723957767,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lio0g9f",
      "score": 1,
      "body": "Do ceos have agents to negotiate for them?",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio0g9f/",
      "created": 1723952766,
      "depth": 0,
      "replies": [
        {
          "id": "liohly4",
          "score": 2,
          "body": "as /u/Lingotes said.\n\nin their 8-K section under \"Legal fees\"\n\n>The Company shall reimburse you for up to $50,000 in reasonable legal and advisory fees and expenses\nincurred in connection with you entering into (i) this Annex, (ii) the related offer letter, (iii) the Severance\nPlan Participation Agreement and (iv) the LTIP documents with respect to the Replacement Grant.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liohly4/",
          "created": 1723962022,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lio6u7y",
          "score": 2,
          "body": "No, they have a ton of available public info that allows them to negotiate exactly what it takes to get them, and then their personal lawyers go over the agreements. ",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio6u7y/",
          "created": 1723955913,
          "depth": 1,
          "replies": [
            {
              "id": "liof5lp",
              "score": 2,
              "body": "Fun fact: the agreements usually provide reimbursement for the CEOs lawyer fees. Even that they get.",
              "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liof5lp/",
              "created": 1723960500,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lio7w57",
      "score": 1,
      "body": "Im must interested in executive physical exam. What is this? So they get vip treatment at the hospitals, specialist?",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lio7w57/",
      "created": 1723956462,
      "depth": 0,
      "replies": [
        {
          "id": "liodn79",
          "score": 2,
          "body": "not sure. it doenst get outlined in the 8-K. but based on verbiage, its definitely more than what your standard employee gets",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liodn79/",
          "created": 1723959606,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lisnq97",
          "score": 1,
          "body": "Executive physicals are just above and beyond what you get as a plebeian. Lots of executives get all sorts of additional treatments like testosterone therapy (for men) and all sorts of physical supplements.",
          "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lisnq97/",
          "created": 1724024863,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lioh86o",
      "score": 1,
      "body": "1.6+3.6+23/4=$10.95m/yr (first year total is 20.95m). Other factor will increase that but if you use that as baseline, nothing outrageous really considering the CEO pay standards in this country.  Some may even say that is low.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lioh86o/",
      "created": 1723961782,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liohu7q",
      "score": 1,
      "body": "Physical exam? Whats that in this context?",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liohu7q/",
      "created": 1723962168,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lioie3r",
      "score": 1,
      "body": "Wow that’s a lot of coffee",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lioie3r/",
      "created": 1723962518,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liouqis",
      "score": 1,
      "body": "Wonder if he will actually help SB financials",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liouqis/",
      "created": 1723970623,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lip2tu5",
      "score": 1,
      "body": "He probably proposed them an impressive plan. All he need to do is execute these plans and turn around the company.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lip2tu5/",
      "created": 1723976104,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lip6m1c",
      "score": 1,
      "body": "Yeh, but is he happy?",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lip6m1c/",
      "created": 1723978577,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lipao8n",
      "score": 1,
      "body": "A target is a target, it’s not a minimun. Still generous",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lipao8n/",
      "created": 1723980948,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lipgh1f",
      "score": 1,
      "body": "As a lot of CEOs do. It’s commonplace. You want? Go be a CEO. No one is stopping you",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lipgh1f/",
      "created": 1723983948,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lipjpia",
      "score": 1,
      "body": "Starbucks is dying. Can you imagine how many types of drinks to they gave now? That is called marketing gimmicks in our business class. The same ingredients different name just add 1 or 2 variations and charged you with even a higher price than the other one. Folks go to your local cafe",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lipjpia/",
      "created": 1723985477,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lipkd4p",
      "score": 1,
      "body": "Tell me why any company needs someone like him again? This is beyond ridiculous and it’s a disease in today’s capitalist society. I know, I know, globalization, etc. Surely there are cases where smaller companies can thrive instead of these mega corporations.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lipkd4p/",
      "created": 1723985773,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lipl93y",
      "score": 1,
      "body": "Curious to see what happens to CMG's stock price from here.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lipl93y/",
      "created": 1723986170,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lipmmds",
      "score": 1,
      "body": "I have never understood this obsession with CEO’s compensation. CEO is paid to create value, and if he/she succeeds, these compensations are peanuts. Look at the last one year price chart of Chipotle vs Starbucks and decide for yourself.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lipmmds/",
      "created": 1723986672,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lipugp6",
      "score": 1,
      "body": "This guy was behind the Doritos Locos tacos at Taco Bell. He deserves all the money in the world. Let him live.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lipugp6/",
      "created": 1723989814,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lipuhe9",
      "score": 1,
      "body": "Starbucks is ass. You could buy something quality with similar valuation like McDonalds or just go for the highest quality player that is actually taking market, Chipotle.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lipuhe9/",
      "created": 1723989822,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lipx1ch",
      "score": 1,
      "body": "The market confuses the shit out of me. I lucked out, I was building a position in SBUX at 75. It shot up to 93 on this news. Cool, I get that. Then they mention giving him an 85 million dollar bonus. I figured the share price should drop on that? Nope. It went up 2 more dollars.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lipx1ch/",
      "created": 1723990772,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liq0u4m",
      "score": 1,
      "body": "I think giving him the option to work from home is going to bite Starbucks in the ass. How are his workers going to respect him? Because he'll slash and burn? Focus on ice? Focus on China? India? Smells a little bit like desperation...",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liq0u4m/",
      "created": 1723992141,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liq1egg",
      "score": 1,
      "body": "Buybacks, layoffs, golden parachute, next opportunity.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liq1egg/",
      "created": 1723992340,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liq3ail",
      "score": 1,
      "body": "They brought him him to stomp out unions. They figure he can intimidate store workers into being cheap.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liq3ail/",
      "created": 1723993002,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liq4bd6",
      "score": 1,
      "body": "Dude’s got the Mahomes contract without being Mahomes",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liq4bd6/",
      "created": 1723993353,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liq6s5f",
      "score": 1,
      "body": "As is known over here, inverse Reddit.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liq6s5f/",
      "created": 1723994202,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liq792o",
      "score": 1,
      "body": "This stock is a short !",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liq792o/",
      "created": 1723994360,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liqb6bo",
      "score": 1,
      "body": "Normally I would roll my eyes, but this one makes perfect sense. \n\nI watch CNBC months ago when the Starbucks results were reported to great disappointment. Kramer interviewed the CEO and not only expressed his displeasure but kinda reamed him for not forwarding and having no viable plan.I hadn't heard such a rant since he interviewed the buffoons at HPQ a decade ago. Starbucks was screwed. \n\nChipotle was in the same boat when they hired this genius.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liqb6bo/",
      "created": 1723995696,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liqjjvs",
      "score": 1,
      "body": "I would take this job offer from #Starbucks but a drink from #Dunkin’ or #McCafe or #ConvenienceStore or Gas Station. Starbucks drinks will soon cost two figures and quality will be watered down like #Chipotlepotions. \nStarbucks prices were already a highway robbery bringing sleazy CEO for #Chipotleportions it’s all downhill from here. SBUX will go to $50/share by 2025",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liqjjvs/",
      "created": 1723998498,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liqjlcb",
      "score": 1,
      "body": "If coffee wasn’t addictive this company would be worthless. I was doing B2B sales up ‘til Covid and Starbucks was BY FAR the worst business to pitch. The employees are such pricks and take themselves way too seriously. \n\nIf anyone is curious my favorite was 7/11. Some really awesome people work for that company",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liqjlcb/",
      "created": 1723998511,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liqm526",
      "score": 1,
      "body": "Nice perks. Best we get at my job is a pizza party",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liqm526/",
      "created": 1723999367,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liqplwr",
      "score": 1,
      "body": "Don't care. I make better coffee than Starbucks 7-8$ coffee so i aint buying",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liqplwr/",
      "created": 1724000509,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liqq7oa",
      "score": 1,
      "body": "Shouldn’t exist. These people should be forced to wear their job title and income on their forehead when in public.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liqq7oa/",
      "created": 1724000710,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liqx1hr",
      "score": 1,
      "body": "What was his pay at chipotle?",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liqx1hr/",
      "created": 1724002945,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liro70z",
      "score": 1,
      "body": "Sorry, side question - Do all Chiptole's have gristly chicken? I love the vibe and the rest of the food but every single time I order a burrito or bowl I end up with some rubbery popping gristle in a piece of chicken. Like, every single time haha",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liro70z/",
      "created": 1724012046,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lirq1pv",
      "score": 1,
      "body": "This chipotle thing was one off. Starbucks is not going to see anywhere near those kind of returns. Chipotle had a good product for a decent price that’s why it did good. Not because of some inherently genius marketing or advertising. Major L from Starbucks.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lirq1pv/",
      "created": 1724012663,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lirzx3z",
      "score": 1,
      "body": "> if he does SHIT performance for 1 year, he is still guaranteed $3.6mm\n\nThat's not usually what a target bonus means. That's if it's 100% funded.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lirzx3z/",
      "created": 1724015983,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lis3o4k",
      "score": 1,
      "body": "As someone working in corporate lower middle management, and seeing how these people live, I wouldn’t change places with him even for this amount of money.. their entire life revolves around work 24/7 for years (or decades).. not worth it. Unless you have no life otherwise ofc.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lis3o4k/",
      "created": 1724017277,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lishybw",
      "score": 1,
      "body": "Alot of people commenting here saying he's going to tank the company when he hasn't even started his 1st day or develop his road map.\n\nI'm sorry some of you didn't buy in when the stock was in the $70s-$80s range. Maybe there will be a little dip from short term investors taking profits, maybe not.\n\nLol at least give the dude a few months before jumping to all these extreme conclusions.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lishybw/",
      "created": 1724022646,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lisp7ir",
      "score": 1,
      "body": "Well yeah, running a global company is like running a country like a president.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lisp7ir/",
      "created": 1724025442,
      "depth": 0,
      "replies": []
    },
    {
      "id": "list9ab",
      "score": 1,
      "body": "The most hyped ceo",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/list9ab/",
      "created": 1724027009,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liswhhs",
      "score": 1,
      "body": "This is so far away from believeable to the normal person it’s so crazy to fathom that we exist in a world where things like this are real for like 0.1% This is proof that there’s enough money for everyone. It’s as shame that poverty even exists anywhere anymore. Maybe one day someone with that kind of wealth will actually use it to better humanity instead of themselves",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liswhhs/",
      "created": 1724028270,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liswmdj",
      "score": 1,
      "body": "Sounds like he's a great negotiator. No wonder they wanted him. That's an extremely rare skill.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liswmdj/",
      "created": 1724028324,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lit1rj4",
      "score": 1,
      "body": "Is that signing bonus taxed?",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lit1rj4/",
      "created": 1724030383,
      "depth": 0,
      "replies": []
    },
    {
      "id": "litkc55",
      "score": 1,
      "body": "Who cares what they make. Brian Niccol will be great for Starbucks. That said I sold my shares at a 23% bump the first 30 minutes it was announced.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/litkc55/",
      "created": 1724038187,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liu3khq",
      "score": 1,
      "body": "I would have accepted half of that... Stupid SB.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liu3khq/",
      "created": 1724048787,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liuh2ng",
      "score": 1,
      "body": "Ain’t nothing going to help Starbucks. Maybe idiotic fat Americans in outside suburbs. But you know Starbucks are already far and wide. What’s left to grow? Taste like shit and u can literally buy a pound of coffee for 5 bucks.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liuh2ng/",
      "created": 1724057737,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liulnld",
      "score": 1,
      "body": "They better not mess with my Cookie Crumble or heads are going to roll!",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liulnld/",
      "created": 1724060793,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liuqze6",
      "score": 1,
      "body": "So, $1.00 of your overpriced coffee goes to pay for an overpriced CEO 😁",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/liuqze6/",
      "created": 1724064080,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj4evv6",
      "score": 1,
      "body": "Great. And yet another reason I WON'T be going to Starbucks for their overpriced coffee.",
      "permalink": "/r/stocks/comments/1euza7s/starbucks_new_ceo/lj4evv6/",
      "created": 1724195300,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "Starbucks is getting a new CEO from Chipotle with an extensive compensation package.",
    "companies": [
      "Starbucks",
      "Chipotle"
    ],
    "tickers": [
      "SBUX",
      "CMG"
    ],
    "main_ticker": [
      "SBUX"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Discussion of the generous compensation package for Starbucks' new CEO, who previously led Chipotle.",
    "stock_recommendations": "The user is not explicitly recommending to buy or sell any stocks.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": "none",
    "sentiment_summary": "The user is discussing the extensive benefits and salary package for Starbucks' new CEO without expressing a clear stance on Starbucks stock.",
    "sentiment": "neutral"
  }
}