{
  "title": "Deep dive into Chegg - A turnaround story or a company in freefall?",
  "score": 66,
  "selftext": "**1.0 Introduction**\n\nChegg ($CHGG) began as a textbook rental service, ***a*****iming to reduce the high costs of purchasing textbooks**. Over time, it evolved into a company that offers **a** **range of educational services and tools**.\n\nThe education system has plenty of flaws, creating demand for individuals and companies to assist in understanding a certain topic. There are plenty of amazing sources of knowledge, ranging from *Coursera* and *edX* to *Udacity* and even *YouTube*. However, they **do not offer a solution to the homework**, but rather an understanding of a certain topic.\n\nThis is where Chegg comes in. Its primary business is **selling students monthly subscriptions for homework help.** So, is Chegg a ***net positive*** for society?\n\n**Although it can be used for learning, I’d argue that it is an organization that supports academic dishonesty and acts as a cheating database for homework.**\n\nSome universities request data from Chegg to monitor their students and prevent cheating during exams. Chegg provides this information, including *activity timestamps, IP addresses,* and *email details*, which universities use to identify and suspend students involved in misconduct.\n\n\n\n**2.0 The pandemic surge & the beginning of the end**\n\nAs expected, Chegg benefited from the pandemic, and the number of subscribers doubled between 2019 and 2021 (from 3.9 million to 7.8 million).\n\nHowever, the beginning of the end has started, and it can be best illustrated through the following 5 points:\n\n\n\n**2.1 The competitive landscape is significantly different**\n\nGiven the alternatives that exist today for solving homework problems, it is unlikely that the company will return to its growing days.\n\nChatGPT was introduced in November 2022, although the revenue decline already started in Q2-2022. Based on the last quarterly report (Q2-2024), the revenue is **declining at a rate of 10% per year.** Its revenue is down from $776m back in 2021, to $683m for the last twelve months (ending June 2024).\n\nIt is not only ChatGPT, there’s *Caktus AI, Jenni AI, Numerade, Photomath, Course Hero, and many more.*\n\nGoogle Trends paints a great picture of how the demand for Chegg has changed in the last 5 years.\n\n  \n**2.2** **Being profitable is a challenge**\n\nExcept for the pandemic period, the company is struggling to find its way to operating profitability, despite the \\~70% gross margin. If we add up the operating profit / (loss) of the last 7 years (*which includes the pandemic boost*), the company broke even.\n\nWith more competitors, lower demand, and decreasing revenue, it is difficult to make a case that Chegg is a company that will turn things around. It appears that Chegg’s best days are behind it, and the only way to survive longer - is by cutting costs.\n\nBack in April, the company announced Nathan Schultz as the new CEO, and a restructuring plan was shared with the public. Part of the plan was reducing its global headcount by 23% which will lead to **$40-$50m** in savings as of 2025. This is a great decision when facing declining revenue. However, on its own, it is not enough to create long-term shareholder value. It is unclear how the management plans to reinvent the company with fewer employees.\n\n  \n**2.3 Poor capital allocation**\n\nThe previous management has a terrible record in capital allocation.\n\nWe can best illustrate that through the balance sheet of the company between the end of 2017, and June 2024:\n\n||December 2017|June 2024|\n|:-|:-|:-|\n|Cash, short-term, and long-term investments|$229m|$605m|\n|Debt|$0|$617m|\n|Net cash|$229|-$11|\n|Shares outstanding|110m|104m|\n\nDespite generating \\~$1.3 billion in operating cash flow in this period, the company’s net cash position has decreased by $240m.\n\nSo, where did this **\\~$1.5 billion go to?**\n\n1. Acquisitions - **$600 million** (Busuu, Mathway, Thinkful, StudyBlue, WriteLab, Math42)\n2. Capex - **$550 million**\n3. Share buybacks (net of issuance) - **$200 million**\n\nIn Q2-2024, the company reported **$481m in impairments** (mostly in goodwill) - meaning they significantly overpaid for the past acquisitions, especially Busuu *(acquired for $436m).*\n\n\n\n**2.5** **Terrible reviews**\n\nThe reviews of the company have been terrible. (Source: Trustpilot)\n\nRecently, there have been more accusations of customers with difficulties canceling their memberships or having been charged multiple times after they canceled the subscription. The revenue the company reported is likely somewhat inflated and will continue to decrease in the quarters to come.\n\n\n\n**3.0 Valuation**\n\nBased on the above analysis, Chegg is a company with decreasing revenue and a low chance of finding a way to grow and become profitable. With that in mind, the value of the company is its liquidation value (which **IS NOT** its book value).\n\nBased on my estimates, its liquidation value is around \\~$160m (not that far from its market cap of $212m). Therefore, I do think the market is not expecting it to be a turnaround story.\n\n**Could the market be wrong?** Of course!\n\n1. Given the competitive landscape and the 23% employee reduction, as mentioned above, I struggle to envision a path, where the company reinvents itself and increases the number of subscribers. However, there is always a chance that a miracle happens, despite this chance being very low. With the restructuring plan in place, at least the company can survive for many years to come.\n2. The company could get acquired for its customer base. The typical acquisition premium is around 20%, so the 7.7 million subscribers would have an average price of \\~**$33**. I do think acquisition is a more likely scenario than bankruptcy.\n\nI hope you enjoyed this post, feel free to share your thoughts.",
  "link_flair_text": "Company Analysis",
  "id": "1evmkzu",
  "num_comments": 44,
  "created_utc": 1724021961,
  "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/",
  "comments": [
    {
      "id": "liskpsv",
      "score": 117,
      "body": "Chegg was simply used to get answers to homework for college courses. That’s becoming increasingly obsolete and course work is shifting away from old text books to online guided environments. Chegg is going to the ground.",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/liskpsv/",
      "created": 1724023696,
      "depth": 0,
      "replies": [
        {
          "id": "lit86vt",
          "score": 5,
          "body": "They could pivot and adapt, but I doubt they will.",
          "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/lit86vt/",
          "created": 1724032973,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lisifmr",
      "score": 162,
      "body": "Chegg is obsolete now that we have AI LLMs. I doubt its recovery is possible",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/lisifmr/",
      "created": 1724022828,
      "depth": 0,
      "replies": [
        {
          "id": "liv2clw",
          "score": 2,
          "body": "Not yet. Students use Chegg for non-creative homework assignments. I was a student and now train A.I. LLMs. The major models are garbage when it comes to STEM homework. You can ask them the same exact question multiple times and receive different answers.",
          "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/liv2clw/",
          "created": 1724069790,
          "depth": 1,
          "replies": [
            {
              "id": "livf4xa",
              "score": 1,
              "body": "The beauty is that you can guide them through bachelor's level questions and you will get the right answer eventually, most of the time. They are not really that bad and they are free. Additionaly, when you use them you feel like you learn more than when you just copy the answers that someone else produced.\n\nAlso, once again, they are free. Unlike chegg which is pay walled.",
              "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/livf4xa/",
              "created": 1724074892,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "litg6um",
          "score": -2,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/litg6um/",
          "created": 1724036326,
          "depth": 1,
          "replies": [
            {
              "id": "litgt0j",
              "score": 6,
              "body": "LLMs are the real deal, I always have it up while work. Better than any junior engineer I could hire. I just spawn off tasks to it. Or rubber duck session with it. I even use to to do code review on my work before sending a PR. It's incredible and will absolutely be the future. It's best viewed as an assistant while your the driver. It won't just do everything in the world for you. But incredible at batches of focused work.\n\nAnd this is coming from someone who builds AI models.",
              "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/litgt0j/",
              "created": 1724036598,
              "depth": 2,
              "replies": [
                {
                  "id": "litjfkb",
                  "score": 1,
                  "body": "It's great at programming tasks, probably due to the accessibility to train on open source code, but it does fall flat when I ask questions that require some intuitive logic. Personally I haven't had much success with it in domains like statistics and discrete math.",
                  "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/litjfkb/",
                  "created": 1724037771,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "litjovi",
              "score": 3,
              "body": "I have no clue what sort of data security you work in but you better get up to speed buddy. I'm in software security myself (and I'm hands on) LLM's are far from garbage. It's not perfect but its an INCREDIBLE tool.",
              "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/litjovi/",
              "created": 1724037889,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lisiqou",
          "score": -15,
          "body": "Indeed, the market is pricing it as there's no recovery ahead.",
          "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/lisiqou/",
          "created": 1724022944,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lisypn6",
      "score": 30,
      "body": "As someone that used and contributed to Chegg for engineering work the fact that you can no longer sign up to a textbook and search real answers from humans and the user experience is absolutely dog now gets me believing it's going to free fall. It's basically got a LLM strapped to the front with a horrendous chatbot interface now and a lot of their professional contributors were kicked to the curb.",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/lisypn6/",
      "created": 1724029153,
      "depth": 0,
      "replies": [
        {
          "id": "liu1qxt",
          "score": -1,
          "body": "Thank you for sharing. If you were in charge, what would you do?",
          "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/liu1qxt/",
          "created": 1724047649,
          "depth": 1,
          "replies": [
            {
              "id": "liwe5jt",
              "score": 1,
              "body": "Honestly, I don't hate the move to LLM as the primary search for the information. What I dislike is locking the users out from using the old database easily. Putting work into a cleaner UX/UI so a new customer can easily use both intuitively would show them that all the data is there and it's worth their money to continue with the service. \n\nBy driving people away from engaging with their services they have no data to collect. If they want to survive and grow they should pivot to using their existing data and lean more on capturing more from their users to fine time their own LLM",
              "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/liwe5jt/",
              "created": 1724086439,
              "depth": 2,
              "replies": [
                {
                  "id": "liwmmsx",
                  "score": 1,
                  "body": "Thank you for sharing your thoughts. It was a genuine question, and for some reason, it is being downvoted. \n\nI'm curious if the current subscription price can be justified with the move to LLM, given that there are cheaper alternatives.",
                  "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/liwmmsx/",
                  "created": 1724089183,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "litmfwz",
      "score": 12,
      "body": "Chegg has always been dependent on user uploaded materials. It is no longer relevant due to AI",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/litmfwz/",
      "created": 1724039174,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lisr5ae",
      "score": 23,
      "body": "No DD needed, why pay for their services when students can use AI",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/lisr5ae/",
      "created": 1724026197,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liva5cn",
      "score": 7,
      "body": "The only thing that made CHEGG even known in many places was due to the ability to cheat on tests during the pandemic. Now that that's no longer an option, there are much better things available that do what CHEGG does but better and with less stink on it. \n\nI'm not the smartest investor but I wouldn't touch CHEGG with a ten foot pole, no matter the price.",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/liva5cn/",
      "created": 1724073006,
      "depth": 0,
      "replies": []
    },
    {
      "id": "litmojd",
      "score": 3,
      "body": "Its going zero. no one needs it in era of chatgpt",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/litmojd/",
      "created": 1724039287,
      "depth": 0,
      "replies": []
    },
    {
      "id": "litubmx",
      "score": 3,
      "body": "Absolutely no way that chegg will be relevant in a decade or so unless they make massive changes to their business",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/litubmx/",
      "created": 1724043241,
      "depth": 0,
      "replies": [
        {
          "id": "liu1eq3",
          "score": -2,
          "body": "Indeed. What would this massive change look like, in your opinion?",
          "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/liu1eq3/",
          "created": 1724047441,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "liu21zt",
      "score": 3,
      "body": "What I’m still baffled about is Duolingo, close to 9B market cap and all they offer is courses on languages. Granted their app and courses are well-designed, but 9 billion still feels crazy.",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/liu21zt/",
      "created": 1724047839,
      "depth": 0,
      "replies": [
        {
          "id": "liubcwn",
          "score": 2,
          "body": "They're market leaders, big market size, have great marketing, and have gamified their product, which I think helps support their valuation.\n\nThat being said, I'm not super confident that they'll stick around for the long term.\n\nThere's probably a near future in which two individuals can converse with each other via AI translation seamlessly in real world scenarios.. making Duolingo a bit less attractive.",
          "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/liubcwn/",
          "created": 1724053895,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "liwjyvc",
      "score": 3,
      "body": "Chegg is dead and good riddance. It just exists as a way to cheat (they literally have students steal exams and post it there for compensation) and overall AI is a better way to cheat, though not for exactly the same assignments.",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/liwjyvc/",
      "created": 1724088314,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liwvpre",
      "score": 3,
      "body": "Their entire business model depends on undermining the integrity of education. Even before LLMs they were doomed as they played a cat and mouse game against the most prestigious universities in the world. With LLMs their fate is sealed",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/liwvpre/",
      "created": 1724092066,
      "depth": 0,
      "replies": []
    },
    {
      "id": "liuagb6",
      "score": 2,
      "body": "I'd be interested to see their churn from a customer # and dollar amount. \n\nAlso tells you a lot when last time insiders bought the stock was in 2021.",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/liuagb6/",
      "created": 1724053287,
      "depth": 0,
      "replies": [
        {
          "id": "liub4j2",
          "score": 1,
          "body": "They do provide retention rates. If you find this useful, it is available in the investor presentations.",
          "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/liub4j2/",
          "created": 1724053742,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lisl5uw",
      "score": 4,
      "body": "Free fall",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/lisl5uw/",
      "created": 1724023867,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lit0v11",
      "score": 4,
      "body": "TLdR:  company in freefall",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/lit0v11/",
      "created": 1724030015,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lixd6uw",
      "score": 1,
      "body": "You got a lot of haters on this one but I see it up 10% today. Maybe youre right",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/lixd6uw/",
      "created": 1724097533,
      "depth": 0,
      "replies": [
        {
          "id": "lixttf8",
          "score": 3,
          "body": "Regardless of my analysis, I wish all the shareholders nothing but success. The goal of my deep dives is to provide insights into a company and share my line of thinking.",
          "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/lixttf8/",
          "created": 1724102759,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lja25gi",
      "score": 1,
      "body": "AI killed this stock, literally run from it.",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/lja25gi/",
      "created": 1724276288,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljpsxu0",
      "score": 1,
      "body": "In response to point 2.1: Chegg actually provides solutions with proof of work, which is something current AI tools cannot do consistently enough to warrant their use for academics, ChatGPT is very poor at multiple forms of course work, and often provides the incorrect answer with incorrect math, chegg employs real people to do the work step by step and explain. I don’t think Chegg is a superstar stock or anything, but in terms of homework help and learning a topic you’re struggling in, I still believe Chegg is the best paid service for homework. An important note is many students have ways around Cheggs paywall (homeworkify website) which is also damaging to their revenue",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/ljpsxu0/",
      "created": 1724513173,
      "depth": 0,
      "replies": [
        {
          "id": "ljptb6v",
          "score": 1,
          "body": "I do believe at some point AI could be consistent enough for STEM or finance questions, but at its current capacity I wouldn’t even bother with language models",
          "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/ljptb6v/",
          "created": 1724513299,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lisn2vj",
      "score": 1,
      "body": "Wound not chase the equity. The value is with debt holders.",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/lisn2vj/",
      "created": 1724024607,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lisy1zg",
      "score": 1,
      "body": "Ya chegg was a bitch to cancel. Only was worth it for me during covid when large chunks of course were online and submitted. Hell, I was able to basically use the entire thing for a midterm. Then it basically became useless once it moved back to in person. Not to mention, profs really started cracking down on it and bringing it up during syllabus and some even setting basically traps to figure out the students using it. The company has no hope with AI. Only potential is a buyout for a company that could integrate with other subscriptions and try and add more value to existing services imo. In hindsight, I should have shorted it a long time ago.",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/lisy1zg/",
      "created": 1724028891,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lit46ac",
      "score": 1,
      "body": "do you think chegg will be taken over from more AI coming out?",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/lit46ac/",
      "created": 1724031355,
      "depth": 0,
      "replies": [
        {
          "id": "livz00g",
          "score": 1,
          "body": "They will announce CheggAi",
          "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/livz00g/",
          "created": 1724081650,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lita0a3",
      "score": 1,
      "body": "Why would students they pay a subscription fee for something they can get for free elsewhere (chatgpt and other LLMs)? Having just graduated I’ve never seen anybody in my uni even mention or use chegg ever since chatgpt. To sum up, chegg is fucked",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/lita0a3/",
      "created": 1724033715,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lita4i4",
      "score": 1,
      "body": "Great write up. \nBusuu only offers courses for 12 languages whereas Duolingo has 30 languages. They really overpaid for Busuu I cannot stress that enough. \n\n\nI'm curious on what their strategy is other than cost cutting.\n\n\nedit: We need to factor in that less and less students are enrolling in college has a negative impact on their business.",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/lita4i4/",
      "created": 1724033763,
      "depth": 0,
      "replies": [
        {
          "id": "liu1ig3",
          "score": 3,
          "body": "You make a great point that less students enrol in college.",
          "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/liu1ig3/",
          "created": 1724047504,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "litjz9m",
      "score": 0,
      "body": "1.0 was the end of Chegg. You treat your happy willing to pay client base by stabbing them in the back. Once word got out Chegg was cancelled en masse. There are far easier ways now to do what Chegg allowed before… they should have told universities to get bent.",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/litjz9m/",
      "created": 1724038022,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lisp2bn",
      "score": -2,
      "body": "Problem most do not even want to pursue college on 39% Americans attend colleges vs 43% before pandemic.",
      "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/lisp2bn/",
      "created": 1724025386,
      "depth": 0,
      "replies": [
        {
          "id": "lisxpxq",
          "score": 1,
          "body": "What about the other 18%?",
          "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/lisxpxq/",
          "created": 1724028757,
          "depth": 1,
          "replies": [
            {
              "id": "lisz70a",
              "score": 0,
              "body": "Now: 100-39%=61% do not attend college after high school. Many work in tech, sales, some become directors, marketing.  Not a requirement in private industry.",
              "permalink": "/r/stocks/comments/1evmkzu/deep_dive_into_chegg_a_turnaround_story_or_a/lisz70a/",
              "created": 1724029345,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}