{
  "title": "Boeing grounds 777X test fleet",
  "score": 34,
  "selftext": "https://www.reuters.com/business/aerospace-defense/boeing-grounds-777x-test-fleet-failure-engine-mounting-structure-says-report-2024-08-19/\n\nAt least the failures were found during testing and not mid-air in a passenger flight\n\nWhat a mess, they're lucky they're in the too-big-to-fail category with INTC",
  "link_flair_text": "News",
  "id": "1ewjxe9",
  "num_comments": 15,
  "created_utc": 1724119581,
  "permalink": "/r/wallstreetbets/comments/1ewjxe9/boeing_grounds_777x_test_fleet/",
  "comments": [
    {
      "id": "liz5pwt",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 4 | **Previous Best DD** | \n**Account Age** | 4 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1ewjxe9/boeing_grounds_777x_test_fleet/liz5pwt/",
      "created": 1724119585,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lizdeeb",
      "score": 33,
      "body": "Yeah. I'm happy they caught and confident it will be the last and only issue. Stellar leadership.\n\n![img](emote|t5_2th52|18630)",
      "permalink": "/r/wallstreetbets/comments/1ewjxe9/boeing_grounds_777x_test_fleet/lizdeeb/",
      "created": 1724122485,
      "depth": 0,
      "replies": [
        {
          "id": "lizdw1f",
          "score": 14,
          "body": "Oh, that burn... \"Stellar leadership\", after they stranded those astronauts in space. I see, what you did there. ;)",
          "permalink": "/r/wallstreetbets/comments/1ewjxe9/boeing_grounds_777x_test_fleet/lizdw1f/",
          "created": 1724122679,
          "depth": 1,
          "replies": [
            {
              "id": "lize3ou",
              "score": 7,
              "body": "Wow I wasn't even going for that one liner. Nice.\n\nThat one... *Star* Liner...\n\n![img](emote|t5_2th52|31226)",
              "permalink": "/r/wallstreetbets/comments/1ewjxe9/boeing_grounds_777x_test_fleet/lize3ou/",
              "created": 1724122762,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj0effx",
      "score": 19,
      "body": "Bullish.  What doesn't go up, doesn't come down.",
      "permalink": "/r/wallstreetbets/comments/1ewjxe9/boeing_grounds_777x_test_fleet/lj0effx/",
      "created": 1724142505,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lizd60g",
      "score": 5,
      "body": "Boeing is really taking a lot of L's this year.\n\nI was really hoping that this plane would enter service by the end of 2025, but now a 2026 entry date is almost certainly guaranteed.\n\nGenuinely I'm happy that Boeing caught this issue now, rather than later. Since a catastrophic mid-air failure with the engines would have certainly caused a disaster...",
      "permalink": "/r/wallstreetbets/comments/1ewjxe9/boeing_grounds_777x_test_fleet/lizd60g/",
      "created": 1724122394,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj0rfmm",
      "score": 3,
      "body": "At what point do u say the leadership isn’t fully to blame and all the engineers on r/boeing are a whole lot more regarded than we thought",
      "permalink": "/r/wallstreetbets/comments/1ewjxe9/boeing_grounds_777x_test_fleet/lj0rfmm/",
      "created": 1724150795,
      "depth": 0,
      "replies": [
        {
          "id": "lj1er3m",
          "score": 4,
          "body": "Engineers only engineer to what spec they're told.  If left uninhibited they will generally produce a product that will outlast the lifecycle 10X, but will never make it into production for unworkable time and cost overruns.\n\n\nThey have all the incentive in the world to over-engineer:  a better product, more job stability, and less risk if something fails.  The only thing holding them back (into reality) is management that sees a program 5+ years behind and a company losing billions.  \n\n\nIt's also not as simple as management VS engineering.  Selecting and managing sub-vendors for instance is playing a huge role in many of Boeing's troubles.  Likely stems from the technical aspects of the initial contracts as well.  ",
          "permalink": "/r/wallstreetbets/comments/1ewjxe9/boeing_grounds_777x_test_fleet/lj1er3m/",
          "created": 1724160897,
          "depth": 1,
          "replies": [
            {
              "id": "lj2ji6h",
              "score": -4,
              "body": "You make it sound like every single engineer is fully competent and willing to create a perfect plane without restrictions. That not a single one is underskilled, disorganised, apathetic, or simply lazy\n\nHasn't this sub given you even a glimpse of the potential regardness of humanity?",
              "permalink": "/r/wallstreetbets/comments/1ewjxe9/boeing_grounds_777x_test_fleet/lj2ji6h/",
              "created": 1724173928,
              "depth": 2,
              "replies": [
                {
                  "id": "lj458tw",
                  "score": 1,
                  "body": "If the safety of a fucking 737/777 rests on the idea that not one engineer will fuck up, that is 110% and issue with upper level management.  Criminal levels of negligence far beyond what we've seen. Engineering designs not only the hardware, but the processes to manufacture that hardware, the test procedures to qualify, then test procedures to accept that hardware.  They choose not only the tests, but how those tests are conducted, how your equipment is calibrated, and how your technicians are trained.  Every single one of these gets reviewed by a team of subject matter expert engineers who then bring these all to review boards at component, then assembly level.\n\n\n And shit STILL gets missed on every single large scale project.  You figure out how many \"9's\" you want in 99.99XXXX reliability and hopefully you bid/budgeted to that. \n\n\n If you think one engineer who's lazy is the issue here, you should take a look at how System Engineering is conducted in general, then apply that to a project as huge as the next 777.",
                  "permalink": "/r/wallstreetbets/comments/1ewjxe9/boeing_grounds_777x_test_fleet/lj458tw/",
                  "created": 1724191994,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj4ucxh",
                      "score": 1,
                      "body": "I didn't say one engineer being lazy was the issue. I'm simply saying why should we act as if they're perfect and blameless?\n\nI was supporting what the other guy was saying - when do we start laying some blame on the engineers?\n\nMaybe I'm jaded, but my experience with devs shows that often, even with unlimited time and cost given by the business, they'll still fuck something up. It's not aerospace, but same concept - building and testing \n\nSome developers are just bad at coding. Some just design poor testing processes to catch that bad code. Some are terrible at escalating to management, until it's way too late",
                      "permalink": "/r/wallstreetbets/comments/1ewjxe9/boeing_grounds_777x_test_fleet/lj4ucxh/",
                      "created": 1724200888,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lizobqk",
      "score": 0,
      "body": "Boeing isn’t too big to fail, Intel isn’t either. Vanguard and Blackrock are such companies. Boeing and Intel are strategic companies but they can totally fail if a buyer is willing to pick up the pieces. No buyer can afford Blackrock. That’s the difference.\n\nIMO Boeing needs to fail and get absorbed into a company that actually knows how to make planes. Intel can be saved with restructuring but Boeing is in a field where customer trust is king and they have lost that. There’s no saving Boeing, my prognosis is that Lockheed will get them for pennies and return to the civilian aviation sector for a while and probably split them off in 20 years or so.",
      "permalink": "/r/wallstreetbets/comments/1ewjxe9/boeing_grounds_777x_test_fleet/lizobqk/",
      "created": 1724127095,
      "depth": 0,
      "replies": [
        {
          "id": "lizv7y9",
          "score": 3,
          "body": "Lockmart can't have Boeing's military aerospace division for a litany of red tape reasons on the acquisitions side. If Boeing fails, that part is more likely to go to Northrop or RTX or maybe even GD.\n\nThe civilian side is anybody's guess. It's also not unthinkable that USG gets directly involved a la GM circa 2008, which doesn't mean they won't force a sale of business units to other companies but also isn't exactly letting them fail outright.",
          "permalink": "/r/wallstreetbets/comments/1ewjxe9/boeing_grounds_777x_test_fleet/lizv7y9/",
          "created": 1724130537,
          "depth": 1,
          "replies": [
            {
              "id": "lj00gk8",
              "score": 2,
              "body": "Exactly, it will be a managed fail but investors will be screwed while the company itself will be transformed into something hopefully better.",
              "permalink": "/r/wallstreetbets/comments/1ewjxe9/boeing_grounds_777x_test_fleet/lj00gk8/",
              "created": 1724133453,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lizj0gd",
      "score": 0,
      "body": "Will Boeing ever soar again?",
      "permalink": "/r/wallstreetbets/comments/1ewjxe9/boeing_grounds_777x_test_fleet/lizj0gd/",
      "created": 1724124768,
      "depth": 0,
      "replies": []
    }
  ]
}