{
  "title": "RKLB JAN 17 '25 6 Call +100k Hodling ",
  "score": 84,
  "selftext": "",
  "link_flair_text": "YOLO",
  "id": "1ewofbz",
  "num_comments": 23,
  "created_utc": 1724134498,
  "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/",
  "url_overridden_by_dest": "https://i.redd.it/m2u5n392hrjd1.jpeg",
  "comments": [
    {
      "id": "lj027xz",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 14 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/lj027xz/",
      "created": 1724134504,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj03h13",
      "score": 23,
      "body": "If it's good enough to screen shot. It's good enough to sell.\n\nRocketlab is a FANTASTIC company.\n\nIt sucks it got WSB hype so it's about to crash as quick as it went up..just becuase of idiot traders.",
      "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/lj03h13/",
      "created": 1724135275,
      "depth": 0,
      "replies": [
        {
          "id": "lj04a0u",
          "score": 6,
          "body": "100% true, but I just keep my shares for the long term, 3 to 10 years. Derivatives are nice to trade on crazy days like this. But I'm a big believer in Rocket Lab in several years. I'm just not sure if I should sell the options, as I always prefer to sell by the end of a week or month.",
          "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/lj04a0u/",
          "created": 1724135776,
          "depth": 1,
          "replies": [
            {
              "id": "lj06a1b",
              "score": 3,
              "body": "Sell some, to pay to exercise some others and then also hold some? Not financial advice that's just my plan if I get some juicy LEAPS.",
              "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/lj06a1b/",
              "created": 1724137036,
              "depth": 2,
              "replies": [
                {
                  "id": "lj06a1m",
                  "score": 4,
                  "body": "PUT YOUR HANDS UP GreenBean042!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
                  "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/lj06a1m/",
                  "created": 1724137036,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj06bkp",
                      "score": 3,
                      "body": "Ah shit you got me",
                      "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/lj06bkp/",
                      "created": 1724137063,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lj07reg",
                  "score": 2,
                  "body": "Maybe that's the best/ safest idea! Thanks",
                  "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/lj07reg/",
                  "created": 1724138001,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ljawm8l",
                  "score": 2,
                  "body": "When they pop or further out, say 6 months to expiry? I’m trying to figure out how to manage ASTS 2026 LEAPS that are deep ITM now. (I’d hoped to wait until LT cap gains next year but worry about liquidity.)",
                  "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/ljawm8l/",
                  "created": 1724286968,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljc9fll",
                      "score": 2,
                      "body": "Okay so to be honest, I have no juicy LEAPS positions, and the closest I've come to such things is seeing your YOLO update (nicely done btw, beautiful gains!) and vicariously speculate what I would do if I have had the foresight for such things. So really, I have no idea what I'm talking about. \n\nBut here's what I'd do if I had some LEAPS that were nicely up: \n\nSell one of them for some money in the hand - and with that money I'd buy myself some time with an accountant well versed in trading and related tax obligations for your country. Not being facetious here, if I had gains in the 5-6 figures, my first call is going to be to a chartered accountant to get their advice. If you have a lot of calls, then imo 1 of them is worth selling to get that advice. I don't know much about tax laws but I know if I'm up significantly, then I want to have a chat with someone who does! \n\nSecondarily, I'd be thinking about whether I want to lock in those gains and convert them to cash, to use on another position or play, or, if I want to be long on a position, then, in a way that the accountant says is cool, I'd look to sell some of the calls to pay for the exercise of more of the calls into stocks. But it all depends on the ratio of cash to stock you want to see out of it, and your personal strategy. For myself personally, I've always thought if I get some juicy LEAPS I'd: see the accountant, take some profit and put into an SP500-relates fund managed in my country (tax stuff), take some profit and convert to long stock position, save the smallest ratio of calls to hold until close to exp, around 3 months, and then depending on how I feel, sell the rest for profit, or, sell some to pay to exercise the rest. \n\nSorry for the essay! Again, I'm not in this position, purely speculating (I just have long stocks on ASTS, no LEAPS, but I think space is cool.) \n\nMost important thing though, is, if the amount you're up is significant, it's worth seeing a professional accountant about as the first point of call!",
                      "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/ljc9fll/",
                      "created": 1724309089,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljd3bs5",
                          "score": 2,
                          "body": "Thank you so much for your thoughtful response!!!\n\nOk, I am convinced. Fidelity has been calling and I can meet with one of their local advisors for free, at first. My plan was to do that, and get a referral for an accountant, but was thinking that wouldn’t be important until next year. And, I’ve been putting off the Fidelity call, for various reasons. Partly because I’ve got lots going on, partly because I don’t like phone calls, and honestly, maybe, a little bit of embarrassment over what I’ve done. Even though it worked out, it’s kind of nuts (and ohmygosh, also, then I’d have to stop. Eek.)\n\nOk, thanks again. I will leave a message this morning and get some help. (And practice saying “no” to paid services - I tend to just agree to things.)\n\n(I did take my initial and profits along the way, though ASTS is still a large position.)\n\nHave a great day!",
                          "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/ljd3bs5/",
                          "created": 1724327172,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ljdbkox",
                              "score": 2,
                              "body": "Hey you have a great day too! Honestly I totally get all of that! But hey, consider this- you don't have to rush anything! (They don't expire until 2026 right?), so if you've got other stuff going on, you can focus on that while knowing that you've done some awesome stuff on the investing side, and tackle this once you've spent some time figuring out your feelings and your strategy. \n\nSo yeah, don't rush into it, take some time to really feel out where you want to go with your position, and definitely practice saying no to stuff! Get second opinions, and, the one thing I will strongly say, is if anyone tries to instill a \"sense of urgency\" in you before 2026 then be wary of that. But yeah, defs get some professional advice on the best way to manage tax stuff. \n\nAgain, I'm super unqualified, but it's so cool to see your journey and how you're working things out - I'm gonna try build some capital and play some RKLB LEAPS so hopefully I'll get a chance to put my theories into practice 😁",
                              "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/ljdbkox/",
                              "created": 1724330663,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ljdf2d7",
                                  "score": 2,
                                  "body": "Great, thank you! You’ve helped me a great deal this morning!\n\nYes, have until 2026 on those. So will take time and do as you’ve suggested. I think some guidance on what to do with gains will be helpful - I’ve just been adding shares and TLT, but…? And definitely need help with the taxes. \n\nI have some RKLB LEAPS, too! (But just a few, kind of trying to diversify.)\n\n🌞",
                                  "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/ljdf2d7/",
                                  "created": 1724332014,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ljdfsjl",
                                      "score": 2,
                                      "body": "So yeah, take your time, don't rush, and just enjoy the fact you're doing well! Whatever taxes you have to pay, gains are gains right? \n\nAwesome! Look forward to seeing your updates on your journey (and if I get any cool stuff going on I'll definitely share too!) 🚀🌙",
                                      "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/ljdfsjl/",
                                      "created": 1724332285,
                                      "depth": 8,
                                      "replies": [
                                        {
                                          "id": "ljdn0jh",
                                          "score": 2,
                                          "body": "Oh, I am delighted to have taxes to pay, haha. Just really don’t want to make a mistake and wind up in trouble. \n\nI’m excited to see your update! (And when I figure out what to do a bit better overall or just on that YOLO, I will share again.)\n\nAppreciate you!",
                                          "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/ljdn0jh/",
                                          "created": 1724334880,
                                          "depth": 9,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lj1b2wc",
              "score": 3,
              "body": "Sold all my $5 2026 LEAPS and Oct $6 calls. The hype is so big here I couldn’t resist. \n\nI even bought shares and sold covered calls on them ! \nWent from $20K to $98K ! \n\nI’m just waiting patiently now to re enter at a better price, if these ever happens again. \n\nI was never big on “taking profits” but after seeing all my money go EVERY TIME after a WSB pump i just stoped fucking around this time",
              "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/lj1b2wc/",
              "created": 1724159549,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj3l7ap",
              "score": 1,
              "body": "Explore selling way OTM puts and collecting premium IMO.\n\nPick prices you wouldn't mind owning the stock at",
              "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/lj3l7ap/",
              "created": 1724185592,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj0eax8",
          "score": 5,
          "body": "You mean like ASTS hype?",
          "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/lj0eax8/",
          "created": 1724142420,
          "depth": 1,
          "replies": [
            {
              "id": "lj0fj1m",
              "score": 6,
              "body": "Both companies are, in my opinion, amazing. It is good to see some news coverage about the upcoming space industry. This industry will become very important in the coming years. ASTS + RKLB 🔥🚀",
              "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/lj0fj1m/",
              "created": 1724143261,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj1eyrx",
      "score": 2,
      "body": "Is this IBKR ???",
      "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/lj1eyrx/",
      "created": 1724160973,
      "depth": 0,
      "replies": [
        {
          "id": "lj1h8dn",
          "score": 2,
          "body": "Yes, correct!",
          "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/lj1h8dn/",
          "created": 1724161771,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj02bl4",
      "score": 2,
      "body": "What should be my next move on this?\nI personally believe this could go much higher.\n🚀🚀",
      "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/lj02bl4/",
      "created": 1724134564,
      "depth": 0,
      "replies": [
        {
          "id": "lj036y3",
          "score": 2,
          "body": "[deleted]",
          "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/lj036y3/",
          "created": 1724135100,
          "depth": 1,
          "replies": [
            {
              "id": "lj03zz2",
              "score": 3,
              "body": "I have 35,000 shares, so maybe I can buy some more...\nI'm not thinking about selling those. Are you invested in RKLB?",
              "permalink": "/r/wallstreetbets/comments/1ewofbz/rklb_jan_17_25_6_call_100k_hodling/lj03zz2/",
              "created": 1724135603,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}