{
  "title": "European Union slashes planned tariffs on China-made Tesla EVs, other Chinese firms ",
  "score": 191,
  "selftext": "The European Union on Tuesday said planned tariffs on Tesla vehicles being imported from China would be cut to 9% from 20.8%, while also reducing a number of planned import duties on other Chinese electric vehicle firms.\n\nIn June, the EU said it would slap higher tariffs on Chinese electric vehicle imports, which it found benefit “heavily from unfair subsidies” and pose a “threat of economic injury” to EV producers in Europe.\n\nThe European Commission, the executive arm of the EU, announced a preliminary conclusion that the battery-electric vehicles value chain in China “benefits from unfair subsidisation” and pronounced that it is in the EU’s interest to impose “provisional countervailing duties” on BEV imports from China.\n\nSource: https://www.cnbc.com/2024/08/20/european-union-slashes-planned-tariff-on-china-made-tesla-evs.html",
  "link_flair_text": null,
  "id": "1ewsihm",
  "num_comments": 79,
  "created_utc": 1724151277,
  "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/",
  "comments": [
    {
      "id": "lj0sbkq",
      "score": 1,
      "body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj0sbkq/",
      "created": 1724151278,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1506r",
      "score": 108,
      "body": "Politicians promise one thing and then do the opposite. Classic move",
      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj1506r/",
      "created": 1724157157,
      "depth": 0,
      "replies": [
        {
          "id": "lj16kaw",
          "score": 42,
          "body": "It was a stupid thing to promise, so doing the opposite is good in this instance. European auto manufacturers would have gotten their lunch eaten in the rest of the world if they had a closed garden at home. The protectionism would have hurt the Europeans way more than the Chinese. Chinese auto manufacturers were looking at setting up assembly factories in Hungary to bypass the tariffs anyway.",
          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj16kaw/",
          "created": 1724157801,
          "depth": 1,
          "replies": [
            {
              "id": "lj2ny6w",
              "score": 15,
              "body": ">Chinese auto manufacturers were looking at setting up assembly factories in Hungary to bypass the tariffs anyway.\n\nThat would mean tarrifs are working and beneficial.",
              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj2ny6w/",
              "created": 1724175304,
              "depth": 2,
              "replies": [
                {
                  "id": "lj30f86",
                  "score": 4,
                  "body": "Any other country maybe but Hungary is like the 5th column of EU.",
                  "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj30f86/",
                  "created": 1724179130,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lj1bq32",
              "score": 23,
              "body": "I guess it's still protectionism when China slaps enormous subsidies on their car exports to the EU, and you want to block that. Though, I feel like it'd have been a fair choice. Especially as we need to protect our own, European, production system. \n\n  \nBut our political leaders are so invested in China, that this is basically impossible. We'll be paralyzed for quite a while if a military conflict occurs.",
              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj1bq32/",
              "created": 1724159790,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj576cb",
          "score": 1,
          "body": "i wanna buy something cheap and reliable.\n\ni don't care who makes it.\n\nis that so wrong?",
          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj576cb/",
          "created": 1724205594,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj1wjp6",
      "score": 29,
      "body": "ITT: People only reading the headline.\n\nTesla is the only manufacturer getting a significant tariff cut.\n\nFrom the end of the article:\n\n“BYD, the Warren Buffett-backed EV firm, saw its tariff rate reduced from 17.4% to 17%; Geely from 19.9% to 19.3%, SAIC from 37.6% to 36.3%. BYD, Geely and SAIC did not immediately respond to a request for comment outside of working hours in China.\n\nOther companies cooperating with the EU in its investigation into China’s heavy subsidization of EVs, will face tariffs of 21.3%, the commission said. This is higher than the 20.8% rate cooperating companies would have faced under the EU’s previous July decision.\n\nFor those not cooperating, they will be slapped with 36.3% import duties. That is down from 37.6% previously.”",
      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj1wjp6/",
      "created": 1724166779,
      "depth": 0,
      "replies": [
        {
          "id": "lj2sl89",
          "score": 3,
          "body": "Why do they want such high tariffs on Chinese EVs?",
          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj2sl89/",
          "created": 1724176720,
          "depth": 1,
          "replies": [
            {
              "id": "lj3g70x",
              "score": 23,
              "body": "Because European competitors didn't develop low cost EV and they want the customers to buy more expensive cars from them.",
              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj3g70x/",
              "created": 1724184040,
              "depth": 2,
              "replies": [
                {
                  "id": "lj3l2c2",
                  "score": 12,
                  "body": "Europeans can't make affordable EVs because China cornered the battery supply-chain, a result of China's anticompetitive, discriminatory practices and trade violation past 10 years.",
                  "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj3l2c2/",
                  "created": 1724185551,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj3nof8",
                      "score": 10,
                      "body": "Have any specific examples? It feels like no other country even bothered competing.",
                      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj3nof8/",
                      "created": 1724186360,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj3qf8r",
                          "score": 5,
                          "body": "It's not for lack of trying.  In pre-2015, it was widely expected that the Japanese and Koreans battery makers would dominate the battery manufacturing with some European, eg, BASF, in the mix.  Remember that Japan pioneered and dominated the lithium ion battery industry since SONY's first successful commercialization in the early 90's; then followed by South Korea (eg, LG, Samsung, SK). Most EV OEMs around the world were already working with them when China locked foreign battery makers out of their market and forced all EV OEMs, local or foreign, to use locally made batteries by local Chinese companies only.   Take this WSJ article from 2018\\[1\\]:\n\n>... China requires auto makers to use batteries from one of its **approved suppliers** if they want to be cleared to mass-produce electric cars and plug-in hybrids and to **qualify for subsidies.** **These suppliers are all Chinese,** so such global leaders as South Korea’s LG Chem Ltd[ ](https://archive.li/o/REbZq/quotes.wsj.com/KR/XKRX/051910?mod=chiclets)and Japan’s Panasonic Corp. **are excluded**.  \n... Foreign batteries aren’t officially banned in China, but auto executives say that **since 2016 they have been warned by government officials that they must use Chinese batteries in their China-built cars, or face repercussions.**  That has forced them to spend **millions of dollars to redesign** cars to work with **inferior Chinese batteries**, they say.  \n... “We want to comply, and we have to comply,” said one executive with a foreign car maker. “**There’s no other option**.”\n\nThe EU's antisubsidy finding 2024/1866 likewise found China's \"Regulation on the Standards of the Automotive Power Battery Industry\" policy designed to keep out foreign competition since 2015\\[2\\].   And China's anticompetitive practices against foreign battery competitors were continued under different fiscal/EV subsidies scheme to keep de-subsidizing foreign batteries\\[3\\] until fairly recently -- ie, China had to stop these practices as they started exporting EVs to the world last couple of years under the false (and laughable) pretense that China always complies with all international trade rules and their subsidies are fair.\n\n1. [Power Play: How China-Owned Volvo Avoids Beijing’s Battery Rules Car maker is allowed to use high-end foreign technology,](https://archive.li/REbZq) while rivals are squeezed into buying local, Trefor Moss, May 17, 2018 6:12 am ET, WSJ\n2. Paragraph (229) of [EU Implementation of Regulation 2024/1866](https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=OJ:L_202401866), July 03, 2024, the EU.\n3. Section 3.6.2. Fiscal Subsidy Policy for the Promotion and Application of New Energy Vehicles, ibid",
                          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj3qf8r/",
                          "created": 1724187204,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lj9ruy2",
                              "score": 4,
                              "body": "As a European (Dane) it is expensive, but I refuse to buy Chinese cars for the reason you summarized. \n\nI am all for free trade, but in this case, I am really disappointed the tariff is not even greater.",
                              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj9ruy2/",
                              "created": 1724273031,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lj4x8vn",
                      "score": -3,
                      "body": "They are certainly competitive. They are just competitive in ways you don’t appreciate",
                      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj4x8vn/",
                      "created": 1724201925,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lj6c1fw",
              "score": 1,
              "body": "Mainly because of chinese government subsidies for the chinese carmakers. They view these subsidies as a way to outcompete the european and american carmakers operating in europe and gain majority marketshare over time. With majority marketshare comes less competition, higher prices, etc. The EU is therefore seeking to leveo the playing field by cancelling out these subsidies with tariffs, and create a betyer environment for fair competition",
              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj6c1fw/",
              "created": 1724225873,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj1evea",
      "score": 46,
      "body": "subsidies chinese carmakers is unfair，but subsidies tesla is ok",
      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj1evea/",
      "created": 1724160940,
      "depth": 0,
      "replies": [
        {
          "id": "lj1vtrs",
          "score": 9,
          "body": "The US gives a tax write off to US taxpayers that buy certain lower priced EV’s. The company receives no direct subsidy.\n\nTeslas bought in Europe will not be subsidized.",
          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj1vtrs/",
          "created": 1724166552,
          "depth": 1,
          "replies": [
            {
              "id": "lj2cgt9",
              "score": 4,
              "body": "he's probably talking about the Chinese subsidies that Tesla got in Shanghai (waaaay below market price land for the giga-factory, 15% preference tax rate, employment credits, corporate COVID relief from 2020-2022, etc.)",
              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj2cgt9/",
              "created": 1724171734,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj5n5yv",
              "score": 1,
              "body": ">The company receives no direct subsidy.\n\nThis is no longer true, not since 2022.  The rest of the world has chosen to \"emulate\" China's success by copying their subsidies violation -- eg, US IRA which requires local sourcing/manufacturing would be one example.",
              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj5n5yv/",
              "created": 1724211953,
              "depth": 2,
              "replies": [
                {
                  "id": "lj5ovu8",
                  "score": 2,
                  "body": "For the purchaser of the car in America to get a tax credit on their personal taxes it has to have X amount of American content. Europeans of course would not get that credit.",
                  "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj5ovu8/",
                  "created": 1724212737,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj6iznc",
                      "score": 1,
                      "body": "Sure, that's post-IRA rule -- there was no such local sourcing/content requirement prior to 2022  because any subsidy based on \"local content requirement\" is in violation of the WTO SCM (Subsidies & Countervailing Measures) Agreement.\n\nChina had been getting away with that since 2015 and, as a reciprocal counter measure against China's EVs imports, many including the US, France, Turkey\\[??\\] passed laws requiring local sourcing/manufacturing only recently.",
                      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj6iznc/",
                      "created": 1724230513,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lj32503",
              "score": -2,
              "body": "most chinese EVS doubled its price to enter EU market，and do you believe the China gives subsidies to those vehicles bought in Europe?",
              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj32503/",
              "created": 1724179651,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj1uz54",
          "score": 4,
          "body": "They cut the tarrifs on Chinese EVs also. Not nearly as much as Tesla though.",
          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj1uz54/",
          "created": 1724166285,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj3lj7o",
          "score": 1,
          "body": "Not necessarily.   A sizeable chunk of batteries in Tesla's EVs export to EU from China actually come from LG, a Korean battery maker.  Foreign EV battery makers have been barred from receiving subsidies or access to China's local EV market in 2015.",
          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj3lj7o/",
          "created": 1724185694,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj0ze46",
      "score": 23,
      "body": "Tariffs are a tax for the citizens of the country that impose them. So no problem if they go ahead and reduce them.",
      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj0ze46/",
      "created": 1724154713,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj13yfh",
      "score": 14,
      "body": "its obviously not a secret that the chinese government gave chinese car makers an unfair economical advantage with all the subsidies over the last decade and yet it feels like cope, trying to keep them out while the european car makers just dont seem to be great at keeping up with the necessary innovation.",
      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj13yfh/",
      "created": 1724156713,
      "depth": 0,
      "replies": [
        {
          "id": "lj1qugq",
          "score": 21,
          "body": "Tesla got over [$325M in subsidies in China](https://www.teslarati.com/tesla-dominates-china-ev-incentives-tsla/).\n\n> Tesla China received CNY 2.1 billion ($325 million) in government subsidies for new energy vehicles, the highest amount granted to a carmaker in the country.",
          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj1qugq/",
          "created": 1724164979,
          "depth": 1,
          "replies": [
            {
              "id": "lj21339",
              "score": 5,
              "body": "peanuts",
              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj21339/",
              "created": 1724168183,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj3mhfa",
              "score": 1,
              "body": "If CSIS is right, China's EV subsidies between 2009 and 2023 were over $230B.  Tesla's $325M seems tiny (and we know that Tesla received way more than that in China).",
              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj3mhfa/",
              "created": 1724185989,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj2ek28",
          "score": 4,
          "body": "And? Good! Let the Chinese pay for my car.",
          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj2ek28/",
          "created": 1724172389,
          "depth": 1,
          "replies": [
            {
              "id": "ljfof3u",
              "score": 1,
              "body": "Yes, please let them pay for my car.\n\n30-50 years later, European and American car makers are non-existant.\n\nDo you think the Chinese government still requires the Chinese citizens to pay for your car, or could one, in ones wildest imagination, see a future where Chinese manufacturers increase prices in a market where they largely have a monopoly?",
              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/ljfof3u/",
              "created": 1724357774,
              "depth": 2,
              "replies": [
                {
                  "id": "ljh6hrg",
                  "score": 1,
                  "body": "They can’t subsidize to infinity, A, B, if that happens people will start building cars domestically again. This isn’t all or nothing. \n\nChinese car makers aren’t a monolith either.",
                  "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/ljh6hrg/",
                  "created": 1724376629,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lj17p1b",
          "score": 6,
          "body": "What unfair economical advantage did they give?",
          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj17p1b/",
          "created": 1724158254,
          "depth": 1,
          "replies": [
            {
              "id": "lj18k00",
              "score": -1,
              "body": "pumping a lot of money into the car maker industry - substantial subsidies to consumers purchasing EVs, tax exemptions, charging infrastructure paid by the government and especially their battery strategy was just a winning shot imo (e.g giving certain subsidies only if a manufacturer reaches a certain battery standard). Im not saying they did the wrong thing, imo it was the way to go and they were to notice it earlier than Europe or the US. In the way we see global economics car makers in europe or the us didnt have a chance to keep up because without the subsidies, substantial societal pressure wouldve been necessary to achieve the same. And in Germany at least, a huge chunk of people still think that combustion engines are the way to go.",
              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj18k00/",
              "created": 1724158589,
              "depth": 2,
              "replies": [
                {
                  "id": "lj19jjj",
                  "score": 48,
                  "body": "The US and many other countries give subsidies to their car industries, what makes this unfair?\n\nCharging infrastructure paid for by the government is unfair? Its unfair to provide citizens with resources they can use?",
                  "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj19jjj/",
                  "created": 1724158967,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj1bgmp",
                      "score": 35,
                      "body": "It’s only unfair if it’s China, it’s almost as if the government should be spending that money on war instead of funding innovation and infrastructure. The double standard goes crazy",
                      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj1bgmp/",
                      "created": 1724159691,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj1bq2b",
                          "score": 32,
                          "body": "A lot of people don't realize just how deeply their anti-China rhetoric is ingrained, and they don't even know why they hate China, they just think anything China does is unfair and wrong.",
                          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj1bq2b/",
                          "created": 1724159790,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lj25pij",
                              "score": 12,
                              "body": "Yeah they’ll look at Russians listening to Russian media telling them all this bad stuff about the US and think “yeah they are brainwashed” and then in the same breath they’ll just throw accusations at China for doing absolutely anything ordinary. It’s like some would only be happy if China gave up trying to be a country. \n\nSome people seriously have it so engrained in them that only *their* country is allowed to be a dominant superpower and use their economic weight.",
                              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj25pij/",
                              "created": 1724169609,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lj1jn5j",
                              "score": 22,
                              "body": "This hits the nail on the head. It's everywhere on reddit. \n\nIf you see any sort of video/article about China, there's always someone to spin it off and make them look bad no matter what.\n\nTake the swimming in this year's Olympics. The Chinese swimmer broke the world record, despite being tested for doping 3x times more than the average swimmer, but the Weatern world still complains of cheating.\n\nAn car accident in America? Meh\nAn car accident in China? OmG it's made from Temu, bad quality cheap material etc",
                              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj1jn5j/",
                              "created": 1724162598,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lj2kwfq",
                              "score": 1,
                              "body": "Its not rhetoric. I'm close with people with top security clearance that constantly get briefs on chinese dangers. To downplay this is just you putting your head in the sand and saying no one knows.   \nYou just dont know.",
                              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj2kwfq/",
                              "created": 1724174367,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lj4uj82",
                                  "score": -2,
                                  "body": "What are these dangers?",
                                  "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj4uj82/",
                                  "created": 1724200951,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lj3ow3x",
                      "score": 0,
                      "body": "not all subsidies are the same.  And as the EU antisubsidy findings stated clearly:\n\n>(111)  Not all subsidies are countervailable under the SCM Agreement, and the present investigation is limited to subsidies provided in China for the benefit of exporting producers of the product concerned. ",
                      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj3ow3x/",
                      "created": 1724186736,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj4vxem",
                          "score": -1,
                          "body": "Not all subsidies are the same, isn't a response to which subsidies are you claiming are unfair? \n\nThe US uses tariffs to counteract foreign subsidied manufacturers; that fact doesn't show that the subsidies themselves are unfair.",
                          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj4vxem/",
                          "created": 1724201451,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lj563ex",
                              "score": 1,
                              "body": ">The US uses tariffs to counteract foreign subsidied manufacturers; that fact doesn't show that the subsidies themselves are unfair.\n\nNo worries.  China's long had anticompetitive, discriminatory policies against foreign EV battery competitors since 2015 up until the end of the EU's investigation period in various shapes and terms.\n\nThe US's response is slightly different, but is likewise allowed under their own laws to protect themselves however they see fit from China's violations -- eg, Section 301.",
                              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj563ex/",
                              "created": 1724205195,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lj5505d",
                              "score": 0,
                              "body": "not unfair, but prohibited.  There are two very specific types of subsidies prohibited under China's WTO obligation.\n\nThe WTO SCM (Subsidies Countervailing Measures) Agreement prohibits:\n\n>PART II: PROHIBITED SUBSIDIES\n\n>Article 3, Prohibition\n\n>3.1 Except as provided in the Agreement on Agriculture, the following subsidies, within the meaning of Article 1, shall be prohibited:\n\n>(a) **subsidies contingent, in law or in fact, whether solely or as one of several other conditions, upon export performance,** including those illustrated in Annex I;\n\n>(b) subsidies contingent, whether solely or as one of several other conditions, upon the use of domestic over imported goods.",
                              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj5505d/",
                              "created": 1724204797,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lj7qptj",
                                  "score": 0,
                                  "body": "You might enjoy this: https://foreignpolicy.com/2023/03/24/economy-trade-united-states-china-industry-manufacturing-supply-chains-biden/",
                                  "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj7qptj/",
                                  "created": 1724250416,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ljg6wmt",
                                      "score": 1,
                                      "body": "Not sure why you feel that Posen's pro-trade/subsidy policy recommendation for the US is relevant to the the EU's CVD imposed against Chinese EVs,  You clearly haven't read the blog; or understood the points he's making, which I agree in principle, sans his lack of any specificity wrt the subject matter -- ie, EV.  Worse yet, you still have no clue what the underlying trade issues with China's EV policies are.",
                                      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/ljg6wmt/",
                                      "created": 1724363705,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lj1skwb",
                  "score": 3,
                  "body": "You know what's funny?  Why didn't the US do an investigation before they implemented their tariffs like the EU did?  \n\nWhy didn't they have to prove China's 'unfair' subsidies?",
                  "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj1skwb/",
                  "created": 1724165528,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj3oau2",
                      "score": 1,
                      "body": "because they can under the existing US law, Section 301 of the Trade Act of 1974.",
                      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj3oau2/",
                      "created": 1724186554,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lj1xjy1",
                  "score": 0,
                  "body": "You just described Tesla lol",
                  "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj1xjy1/",
                  "created": 1724167091,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lj2f0c9",
                  "score": -1,
                  "body": "Dont forget environmental standards are expensive so they dont have any of those.",
                  "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj2f0c9/",
                  "created": 1724172529,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lj3mowb",
              "score": 0,
              "body": "It's all in the EU's antisubsidy findings: see 3.4.   Subsidies and subsidy programmes for which the Commission makes findings in the current investigation of [EU Implementation of Regulation 2024/1866.](https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=OJ:L_202401866#ntr65-L_202401866EN.000101-E0065)",
              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj3mowb/",
              "created": 1724186052,
              "depth": 2,
              "replies": [
                {
                  "id": "lj4utom",
                  "score": 2,
                  "body": "Which of those subsidies are unfair?",
                  "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj4utom/",
                  "created": 1724201055,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj5joql",
                      "score": 1,
                      "body": "Why don't you read the decision cited above?  It lists out individual components, legal basis, and how much they contribute to the final figures for each individual company sampled.",
                      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj5joql/",
                      "created": 1724210467,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj7niqh",
                          "score": 0,
                          "body": "I did read it, or at least I skimmed it, it still is not clear on what part of this is unfair, and it seems like you can't answer that either.\n\nOf course, there are going to be subsidies from foreign governments that we don't like. Is that the same thing as unfair?",
                          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj7niqh/",
                          "created": 1724249364,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lj7y06n",
                              "score": 1,
                              "body": "No. we generally don't care how your gov't pisses away your taxpayers $$$ locally, so long as it's not used to promote export subsidies to hurt trade with other nations or cripple foreign competition in local market (aka, local content requirement).  That's the standard we use to define \"unfair\" in international trade, which is what the EU's decision is based on.\n\nGo back and read the EU's decision and let me know what part you find \"unclear.\"",
                              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj7y06n/",
                              "created": 1724252719,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lj10rqy",
      "score": 4,
      "body": "This isn't great for my VOW3.",
      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj10rqy/",
      "created": 1724155327,
      "depth": 0,
      "replies": [
        {
          "id": "lj112mn",
          "score": 7,
          "body": "Not many developments the past few years were great for VW. Those guys are going from world leaders to bankrupt almost as fast as Blockbuster did...",
          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj112mn/",
          "created": 1724155464,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj15xkg",
      "score": 9,
      "body": "[removed]",
      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj15xkg/",
      "created": 1724157545,
      "depth": 0,
      "replies": [
        {
          "id": "lj1eo82",
          "score": 11,
          "body": "[removed]",
          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj1eo82/",
          "created": 1724160868,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj6j1vu",
      "score": 1,
      "body": "The tariff rate for the company BYD was reduced from 17.4% to 17%; Geely from 19.9% to 19.3%, and SAIC from 37.6% to 36.3%.\n\nThe European Commission has said that other companies that cooperate with the EU's investigation into China's high subsidies for electric cars will face tariffs of 21.3 percent. That rate is higher than the 20.8 percent that cooperating companies would have faced in the EU's previous ruling in July.\n\nIn other words, only Tesla's tariffs went down, with little adjustment for other companies.",
      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj6j1vu/",
      "created": 1724230552,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj2emd5",
      "score": 1,
      "body": "This is objectively good. Tarifs bad. Let the Chinese pay for my car",
      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj2emd5/",
      "created": 1724172409,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj0y4t5",
      "score": -13,
      "body": "Politicians bought by the CPP",
      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj0y4t5/",
      "created": 1724154141,
      "depth": 0,
      "replies": [
        {
          "id": "lj18dhf",
          "score": 10,
          "body": "No, EU car industry is heavily present in China, such tarifs would cause China to retaliate. \n\nEU is in a a tough position, between US and China and without Russian resources, with US leading in software, and China in goods, and EU getting more and more unable to compete in either one. So cutting the Chinese market is not a smart thing to do, especially with Chinese opening plants in Hungary.",
          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj18dhf/",
          "created": 1724158518,
          "depth": 1,
          "replies": [
            {
              "id": "lj1cchh",
              "score": 2,
              "body": "Yes. People don’t think about retaliation. Volkswagen Group, Mercedes, BMW would take a massive hit if China finds a way to retaliate.",
              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj1cchh/",
              "created": 1724160020,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj15rs4",
          "score": 5,
          "body": "or the politicians are just shortsighted idiots",
          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj15rs4/",
          "created": 1724157478,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj0ztbr",
          "score": 0,
          "body": "well that and many suspect that the damage it would cause the German auto industry in the short term played a major part.",
          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj0ztbr/",
          "created": 1724154901,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj1o71r",
          "score": 0,
          "body": "The EU car lobby is against the tariffs since they import parts from China.",
          "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj1o71r/",
          "created": 1724164121,
          "depth": 1,
          "replies": [
            {
              "id": "lj1swe8",
              "score": 2,
              "body": "The EU car lobby is against manufacturing in the EU cus its cheaper to import from a jurisdiction with non existent environmental and labour laws. \n\nImpose tariffs to make it more cost efficient to manufacturer in the EU. \n\nYes this will raise costs, but it'll also bring jobs and tax revenues.",
              "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj1swe8/",
              "created": 1724165628,
              "depth": 2,
              "replies": [
                {
                  "id": "lj1uh2h",
                  "score": 1,
                  "body": "I'm just explaining the situation.\n\nPersonally I'm in the invest in public transit and bike lanes to reduce car use camp.",
                  "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj1uh2h/",
                  "created": 1724166125,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lj1lh8j",
      "score": -8,
      "body": "Just europeans bending over to their ccp overlords",
      "permalink": "/r/stocks/comments/1ewsihm/european_union_slashes_planned_tariffs_on/lj1lh8j/",
      "created": 1724163226,
      "depth": 0,
      "replies": []
    }
  ]
}