{
  "title": "Will Kamala Harris' proposal to hike corporate income from 21% to 28% significantly affect stock prices?",
  "score": 820,
  "selftext": "With our current corporate tax rate at 21%, this is a tremendous increase she is proposing. On Predictit, the political gambling site, this morning they have Harris at 57¢ and Trump 46¢. Won't this proposed tax hike hit corporate profits hard and shouldn't Harris' likelihood of getting elected be reflected in lower stock prices?",
  "link_flair_text": "Broad market news",
  "id": "1ewu1d8",
  "num_comments": 419,
  "created_utc": 1724156292,
  "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/",
  "comments": [
    {
      "id": "lj13zt8",
      "score": 1677,
      "body": "All I can say for sure, is that no matter what happens to the stock market, the biggest hike will always be my losses",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj13zt8/",
      "created": 1724156729,
      "depth": 0,
      "replies": [
        {
          "id": "lj1ru35",
          "score": 167,
          "body": "I suggest you open a secret new account and inverse your own portfolio",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1ru35/",
          "created": 1724165294,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj16r8n",
      "score": 2901,
      "body": "Corporate tax rate was 35% in 2017. Corporate tax rate 100 year average is like 32%. \n\nAny tax rate “scare” is a joke. The market will be fine.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj16r8n/",
      "created": 1724157878,
      "depth": 0,
      "replies": [
        {
          "id": "lj18cqd",
          "score": 688,
          "body": "Not to mention that the President doesn't even write tax code. The only way she can deliver on this is with a Congress on her side.",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj18cqd/",
          "created": 1724158510,
          "depth": 1,
          "replies": [
            {
              "id": "lj1s8ze",
              "score": 126,
              "body": "Worth noting that tax rates can be changed through budget reconciliation and don’t require 60 votes to overcome the senate philibuster ",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1s8ze/",
              "created": 1724165422,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj1wi70",
              "score": 29,
              "body": "Does the current 21% tax rate expire with the tax cuts and jobs act?\n\nThat would change how much leverage a President would have at getting the tax rate they want without congress on their side, if it were to default to something higher after a certain point in time.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1wi70/",
              "created": 1724166766,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj1ikj1",
              "score": 152,
              "body": "Ding ding. The market is predicting a kamala win,  but not a congressional sweep. So, gridlock... aka predictability; nothing will change and their current models remain.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1ikj1/",
              "created": 1724162230,
              "depth": 2,
              "replies": [
                {
                  "id": "lj1x26s",
                  "score": 26,
                  "body": "No, it’s not.",
                  "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1x26s/",
                  "created": 1724166938,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lj1key8",
              "score": 12,
              "body": "Technically true, but a new president often carries her party into majority, and holds sway over legislation.  \n\nSo it's a bit of both.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1key8/",
              "created": 1724162863,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj1910v",
          "score": 231,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1910v/",
          "created": 1724158770,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj1uyw5",
          "score": 41,
          "body": "Yep unless you're a kindergartener, you've lived your life under higher tax rates and everything went on as usual. This isn't a big deal at all in my mind.",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1uyw5/",
          "created": 1724166282,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj1s6bx",
          "score": 5,
          "body": "Plus, there really is no such thing as a corporate tax. Taxes to a corporation are just another expense. Raising corporate taxes is like hiking their electric bill. The increased expenses will just be passed on to the consumer. If anything this will just have an inflationary effect.",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1s6bx/",
          "created": 1724165399,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj1bb25",
          "score": 43,
          "body": "Nah, Reddit is in denial. The stock market inflated a LOT since the Trump presidency to reflect the lower tax rate. We will absolutely pay a portion of it back. \n\nNot to mention I predict interest rates will remain higher during a Harris administration (as it is now with Biden). Trump will raise a big stink like last time. The Fed isn’t supposed to fold to pressure but honestly i think they do/did. \n\nIt’s not all sunshine and roses with Trump. We will probably return to rampant inflation. So our stock earnings will be partially offset by skyrocketing/COVID inflation. Pick your poison.",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1bb25/",
          "created": 1724159634,
          "depth": 1,
          "replies": [
            {
              "id": "lj1eg8c",
              "score": 126,
              "body": "The Fed is rightfully keeping rates higher from an economics perspective. We had inflation due to an overheated economy and the Fed raised rates, the aspect of monetary policy they control. The Fed chair, Jerome Powell was a Trump appointee btw, not a Biden appointee. Biden didn’t replace him. \n\nOur legislative branch rarely does their end of policy when the economy overheating though (increase taxes or decrease spending) as it would be political suicide.\n\nFor all the flak Jpow gets, he “printed money” during COVID to keep things afloat and raised rates after to combat inflation. Imo I think he did his job as well as he could.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1eg8c/",
              "created": 1724160788,
              "depth": 2,
              "replies": [
                {
                  "id": "lj1prb4",
                  "score": 62,
                  "body": "Jpow was given a virtually impossible situation IMO \n- a global pandemic that shutdown the world and killed non-remote jobs\n- a president who attacked him before and during the pandemic\n- a president that downplayed the pandemic\n- an economy that was gifted 10 years of rock bottom interest rates\n- (and to tie this to the topic) a corporate tax rate being slashed 14% the year he became the Fed chair",
                  "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1prb4/",
                  "created": 1724164630,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj1py10",
                      "score": 20,
                      "body": "Totally agree. And I feel like he and the rest of the fed did the best job they could with a shit situation :)",
                      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1py10/",
                      "created": 1724164690,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lj1gozv",
                  "score": 30,
                  "body": "He could’ve raised rates a little sooner, instead of saying inflation was “transitory”.",
                  "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1gozv/",
                  "created": 1724161584,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj1igz4",
                      "score": 63,
                      "body": "Hindsight is 20/20. You work with the data you have at the time and make educated guesses. He should be commended for reversing course instead of being bullheaded and never changing. \n\nThat said, the Fed chair also has to be VERY careful with how they speak. They have to remain positive/neutral so as to not throw the markets/economy into chaos.\n\nI will stand by the fact that Jpow has done a good job as chair.",
                      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1igz4/",
                      "created": 1724162196,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lj1w8pj",
                  "score": 26,
                  "body": "The mistake Jpow made was folding to Trump's pressure and cutting rates in 2019 when there was no reason to.  That doubled the affects of the pandemic because they couldn't cut rates to save markets since rates were already so low, so they had to go straight to \"we will print unlimited money to support the market\".",
                  "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1w8pj/",
                  "created": 1724166683,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj1x2xw",
                      "score": 18,
                      "body": "To be fair, I think he was responding to Trumps threats of a Trade War with China and needed to counteract the negative effect that was having on the economy. He couldn’t predict that COVID was going to happen. Again, he worked with the info he had available to him.",
                      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1x2xw/",
                      "created": 1724166944,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lj1jxnc",
              "score": 21,
              "body": "If the tax rate increases and interest rates stay higher than they’ve been in the last 20 years on average, those two tools will tamp down inflation. The two things that attack inflation most productively are interest rates and taxation. Right now the government (the Fed really) is only sparingly using marginally higher interest rates to combat inflation. If democrats get a trifecta and increase taxes on the highest income brackets while extending programs keeping the lower classes spending power relatively intact, inflation won’t be an issue. It incentivizes corporations reinvestment in growth based activity due to the deduction in tax rate associated with that type of spending, as opposed to reinvesting in things like stock buybacks. Stock buybacks don’t expand productivity, they line shareholders pockets while incentivizing shrinking workforces. \n\nPeople really need to understand how the economy works. Taxation and interest are the two most productive tools we have to combat inflation. Biden wasn’t suffering from bad inflation until well into 2022, and by then he couldn’t pass a tax rate hike due to the lack of political capital. Dems should’ve used some foresight and repealed the 2017 TCJA and reinstated the 28-35% corporate tax rate while also increasing taxes on those earning over 400k/year, that alone would’ve likely mitigated a lot of the inflation we suffered at the end of 2022 and into 2023. Alas, they instead focused on infrastructure and keeping American families afloat and the economy revving. If the dems get a trifecta expect some tax on corporations and the highest income brackets, which will ensure lower classes maintain purchasing power and that corporations are incentivized to keep production sky high to deduct losses, which will in turn lower inflation.\n\nEdit: a word.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1jxnc/",
              "created": 1724162697,
              "depth": 2,
              "replies": [
                {
                  "id": "lj1tcno",
                  "score": 4,
                  "body": "In your second sentence you said inflation is attacked effectively by inflation and taxation. I think you mean interest rates if you'd like to edit",
                  "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1tcno/",
                  "created": 1724165769,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lj1wkol",
              "score": 11,
              "body": "> Nah, Reddit is in denial. The stock market inflated a LOT since the Trump presidency to reflect the lower tax rate. We will absolutely pay a portion of it back.  \n\nOrrr those higher tax rates force businesses to invest more in their own growth, to hire talent. Then they don't have to pay those taxes.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1wkol/",
              "created": 1724166787,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj1i4m7",
              "score": 11,
              "body": "Yeah, it's weird to not think that corporate tax cuts would help stock prices. Stock prices are supposed to be proportional to forward earnings. If forward earnings are 7% lower, wouldn't stock prices be about 7% lower too?\n\nThat being said, the stock market is not the economy.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1i4m7/",
              "created": 1724162079,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj1dv3a",
              "score": 14,
              "body": "I’ll be amazed if Trump wins.\n\nBetween abortion and the dislike that people have for him. Kamala should just do what Biden did last election, let Trump shit talk his way to another loss.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1dv3a/",
              "created": 1724160573,
              "depth": 2,
              "replies": [
                {
                  "id": "lj1qiki",
                  "score": 14,
                  "body": "I’d say slight Kamala edge. If Kamala says nothing. Like no press conferences, no speeches, very little she will win. She’s pulling a Biden and running as a general democrat. If she talks, no matter what someone won’t like it and she will lose voters. The base is energized enough to vote against Trump.",
                  "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1qiki/",
                  "created": 1724164873,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj1r561",
                      "score": 3,
                      "body": "Sadly I agree with you. Best bet is to say as little as possible, be optimistic and let Trump shit talk his way to defeat as he did in 2020. \n\nThat being said we do need good policies in this country and hoping she can deliver on them to the extent that the office allows for it. \n\nI feel like Biden has gotten us back on track and hoping she can continue it.",
                      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1r561/",
                      "created": 1724165073,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lj1u2op",
              "score": 1,
              "body": "Some stocks will adjust upward to reflect the new allocations of capital.   \n\nBe flexible in your allocation, do not expect current trends to hold. \n\nA balanced portfolio of stocks and bonds will be fine.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1u2op/",
              "created": 1724165998,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj1g0ri",
              "score": 1,
              "body": "Pick your poison is as accurate as it gets.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1g0ri/",
              "created": 1724161348,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj1m7dz",
          "score": 2,
          "body": "This \n\n\nAnd businesses generally don't care, as long as they can PLAN for a stable and slowly changing tax program, they'll be fine. \n\nThere are always a few greedy CEOs who think they can do much better elsewhere.. but I challenge you to document a successful move for tax purposes",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1m7dz/",
          "created": 1724163467,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj1fr4t",
      "score": 195,
      "body": "It's not really a tremendous increase, it's more of a return to normal . \n\nSecondly, companies have been very good at dodging taxes regardless of the rate.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1fr4t/",
      "created": 1724161254,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj187xj",
      "score": 469,
      "body": "Everyone needs to put their biases aside and realize how bad of a deficits we have that taxes are going to go up for virtually everyone the next 1-2 cycles no matter who wins . \n\nWe have a 0% chance of cutting spending because we are degenerates",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj187xj/",
      "created": 1724158457,
      "depth": 0,
      "replies": [
        {
          "id": "lj1lr8a",
          "score": 201,
          "body": "That's a false dichotomy. Inflating the debt away is the more likely third option.",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1lr8a/",
          "created": 1724163320,
          "depth": 1,
          "replies": [
            {
              "id": "lj1ovgp",
              "score": 75,
              "body": "I'm surprised how low you are getting upvoted.  It's easily the best response.\n\nWe will likely target some reasonable amount of inflation after many cycles where inflation got very low but the older generation abused that and ran up the debt.\n\nThey now hold tremendous amounts of wealth fueled by recklessly taxing the future.  We will shoulder most of this burden to try our best to protect future generations.  Above average inflation is the only logical and fair way out.\n\nAlso, we will spend around trillion in interest payments alone this year.  Cutting rates will go a long way to reducing the portion of the deficit that is purely debt service.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1ovgp/",
              "created": 1724164341,
              "depth": 2,
              "replies": [
                {
                  "id": "lj1uiwa",
                  "score": 9,
                  "body": "> I'm surprised how low you are getting upvoted.\n\nI've never seen anyone say it that way.  I have no idea what that means but I like it.",
                  "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1uiwa/",
                  "created": 1724166141,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lj1iuz6",
          "score": 59,
          "body": "Before Trump corporate tax rate was 35%",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1iuz6/",
          "created": 1724162329,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj1i3lf",
          "score": 40,
          "body": "So you think Harris' tax hike will go to deficit reduction instead of new spending?",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1i3lf/",
          "created": 1724162069,
          "depth": 1,
          "replies": [
            {
              "id": "lj1j1v6",
              "score": 72,
              "body": "No remote chance it goes to deficit reduction. That would be far too logical",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1j1v6/",
              "created": 1724162393,
              "depth": 2,
              "replies": [
                {
                  "id": "lj1ou5e",
                  "score": 13,
                  "body": "Why not? Every dem president since Clinton has reduced the deficit while they were in office.",
                  "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1ou5e/",
                  "created": 1724164329,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj1q33i",
                      "score": 2,
                      "body": "[deleted]",
                      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1q33i/",
                      "created": 1724164735,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj1r642",
                          "score": 13,
                          "body": "Btw, looks like I wa incorrect on Biden. After the first year - he has grown the deficit.\n\nhttps://www.statista.com/statistics/200410/surplus-or-deficit-of-the-us-governments-budget-since-2000/",
                          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1r642/",
                          "created": 1724165082,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lj1q9ec",
                          "score": 11,
                          "body": "Are you conflating deficit and debt?",
                          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1q9ec/",
                          "created": 1724164791,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lj1se3g",
                              "score": 12,
                              "body": "Everyone does and states so confidently",
                              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1se3g/",
                              "created": 1724165467,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lj1ka89",
              "score": 18,
              "body": "No. If she wins and hikes taxes, they are going to spend more than ever in deficit spending. The proper thing to do is to cut the spending and start paying down the debt. Any other option is going to decimate working people.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1ka89/",
              "created": 1724162819,
              "depth": 2,
              "replies": [
                {
                  "id": "lj1rp0l",
                  "score": 18,
                  "body": "I don’t think it’s that simple. If you have programs that are designed to help the middle-class and have corporations and the wealthy pay for it then that won’t “decimate working people“ will it?",
                  "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1rp0l/",
                  "created": 1724165248,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj1spt4",
                      "score": 3,
                      "body": "You’re making a giant assumption that the corporation is going to just pay the higher tax for your benefit. They’re not they’re going to find ways around it like they’ve always done just the way Apple kept hundreds of billions overseas to avoid bringing it in for tax purposes. If they raise taxes on corporations, they are going to do more deficit spending, and that is going to hurt working people the most. It is very easy for a large corporation to shift money around and do accounting tricks. The tax rate used to be higher and guess what were you getting social programs from those tax dollars? No. You weren’t no. The companies just found clever ways to avoid taxes. The wealthy will NEVER pay as high of a tax rate as lower income individuals because of the way the entire system is structured. Also, most of the policies being proposed like higher taxes, price controls, rent control, etc. have been tried in countries like Argentina, Cuba, Venezuela, etc. and none of the benefits the government claimed would come from it did. Instead, the burden fell on working people to deal with the inflation it caused when they started doing all the deficit spending. We are very much going down that same route since Covid and it’s not gonna get us to a good place. It may be all well-intentioned but it’s going to hurt a lot more than it helps.",
                      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1spt4/",
                      "created": 1724165571,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lj1ocpj",
              "score": 2,
              "body": "lol if you really think that",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1ocpj/",
              "created": 1724164171,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj1qgki",
          "score": 22,
          "body": "Would be a shame if the gov just did their job and spent responsibly /s",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1qgki/",
          "created": 1724164855,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj1gun3",
          "score": 11,
          "body": "Sir, this is Reddit. How dare you speak so poorly of the politicians we worship.",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1gun3/",
          "created": 1724161639,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj148i4",
      "score": 167,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj148i4/",
      "created": 1724156831,
      "depth": 0,
      "replies": [
        {
          "id": "lj1dgk9",
          "score": 14,
          "body": "What it used to be doesn't really matter much. It's what corporations will do to offset this lose that matters. Everything gets passed to consumers. \n\nSo higher prices or more layoffs...",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1dgk9/",
          "created": 1724160426,
          "depth": 1,
          "replies": [
            {
              "id": "lj1hciz",
              "score": 9,
              "body": "Higher prices plus layoffs driven by automation",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1hciz/",
              "created": 1724161811,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj17tp6",
          "score": 13,
          "body": "We also had crazy low interest rates. Market is not going to like high interest rates with high taxes.",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj17tp6/",
          "created": 1724158304,
          "depth": 1,
          "replies": [
            {
              "id": "lj1bwmm",
              "score": 45,
              "body": "It's not a high tax. The rate was 35 percent from 1993 and 2017, which was both a successful period for the market and included comparable rates through the 90s and part of 00s.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1bwmm/",
              "created": 1724159858,
              "depth": 2,
              "replies": [
                {
                  "id": "lj1c609",
                  "score": -2,
                  "body": "You realize that period had the lost decade through the heart of it right?  Where international markets outperformed American ones for like 15 years?\n\nYea the sky didn’t fall. But returns since 2017 have massively out performed, and that could be tied to lower rates and higher earnings.",
                  "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1c609/",
                  "created": 1724159955,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj1n2lo",
                      "score": 8,
                      "body": "Am I the only one that’s ok with corporations having to pay taxes to support the country and people that make them successful?\n\nAlso, that period included the dot com bust.  Of course it’s going to be a lower performance period.",
                      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1n2lo/",
                      "created": 1724163754,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lj1bx3i",
              "score": 7,
              "body": "You can lower rates with higher taxes. They both pull money out of the supply.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1bx3i/",
              "created": 1724159863,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj170a5",
      "score": 95,
      "body": "Companies are currently buying back stock because they view it as a better way to reward shareholders than investing that cash in growth. That's as good and indication of \"excess cash\" as one could probably find.\n\nSo the stock prices may fall but that would merely reflect the markets determining the price rather than the C-Suite manipulating it.\n\nThe corresponding reduction in Federal deficit spending should help improve consumer confidence, assuming that they can actually collect those taxes given the loop holes and legal maneuvers companies have to avoid taxes already.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj170a5/",
      "created": 1724157980,
      "depth": 0,
      "replies": [
        {
          "id": "lj1ku59",
          "score": 10,
          "body": "That really depends on the sector.  It's absolutely not true in tech - who are spending like fucking CRAZY on AI right now.",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1ku59/",
          "created": 1724163011,
          "depth": 1,
          "replies": [
            {
              "id": "lj1ldil",
              "score": 12,
              "body": "Depends on the company more than the sector, https://poole.ncsu.edu/thought-leadership/article/apples-planning-a-110b-stock-buyback-heres-why/",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1ldil/",
              "created": 1724163192,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj15zek",
      "score": 110,
      "body": "It probably won’t have much effect on the stocks that you actually own. While the tax rate is currently 21%, most corporations are pay much less or nothing due to their massive tax incentives.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj15zek/",
      "created": 1724157565,
      "depth": 0,
      "replies": [
        {
          "id": "lj1iqk5",
          "score": 50,
          "body": "This is the kind of hard hitting financial analysis I expect from Reddit. You got a source for that? \n\nI don’t know what “stocks you actually own” means, but assuming you have a position in the sp500, the top 5 highest weighted companies are Apple, Microsoft, nvidia, Amazon, and Meta. They paid $16.7B, $16.9B, $0.1B, $7.1B, and $8.3B in taxes in 2023, respectively. And the one outlier there, NVIDIA, has run out of tax credits after using the tax breaks to take on losses and grow (which is how it’s supposed to work). They have already paid $2.4B just in the first quarter of 2024. \n\nI’m not arguing either way whether or not 28% is a good idea, but acting like this won’t be a change to the tune of billions is ignorant.",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1iqk5/",
          "created": 1724162287,
          "depth": 1,
          "replies": [
            {
              "id": "lj1kkjn",
              "score": 28,
              "body": "This thread is being raided by r politics, so don't expect intelligent conversation.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1kkjn/",
              "created": 1724162921,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj1cpsf",
          "score": 8,
          "body": "Interesting tax law: at the same time, it will raise revenues, but nobody will actually pay it.",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1cpsf/",
          "created": 1724160156,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj17gpi",
          "score": 4,
          "body": "maybe just keep it at 21 and eliminate a number of the incentives so they are actually paying.",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj17gpi/",
          "created": 1724158162,
          "depth": 1,
          "replies": [
            {
              "id": "lj17qcc",
              "score": 25,
              "body": "That doesnt sound nearly as powerful as cracking down on corp greed thru tax hikes tho",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj17qcc/",
              "created": 1724158268,
              "depth": 2,
              "replies": [
                {
                  "id": "lj18dg7",
                  "score": 8,
                  "body": "ya, I get it.  Let them have their call for higher taxes but hopefully work on other aspect of the tax code as well.  Then later they can say, look, we found a way to not raise corporate taxes, but also a way for corps to pay their fair share.  It could bea messaging win and something that says we are not actually at war with businesses.",
                  "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj18dg7/",
                  "created": 1724158518,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lj1g5bb",
                  "score": 3,
                  "body": "In what world does corporate greed get cracked down by more taxes?\n\nIt just means the consumer pays even more to offset the tax hikes.",
                  "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1g5bb/",
                  "created": 1724161393,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lj1hw6e",
              "score": 2,
              "body": "Because usually the incentives require them to do all the things people\"love\" like LIHTC.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1hw6e/",
              "created": 1724161998,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj1iutt",
          "score": 1,
          "body": "Which goes to show how the whole thing is just pandering to the general public 😐",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1iutt/",
          "created": 1724162328,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj18w2m",
      "score": 51,
      "body": "It will affect earnings, so yes.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj18w2m/",
      "created": 1724158718,
      "depth": 0,
      "replies": [
        {
          "id": "lj1a9j8",
          "score": 41,
          "body": "It has to. \n\nAll the people in the politics sub claiming this will bring manufacturing jobs back to the US are delusional. ",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1a9j8/",
          "created": 1724159243,
          "depth": 1,
          "replies": [
            {
              "id": "lj1bmpy",
              "score": 28,
              "body": "Manufacturing jobs are coming back to the US regardless as the world diversifies away from China and things like the Chip Act roll out.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1bmpy/",
              "created": 1724159756,
              "depth": 2,
              "replies": [
                {
                  "id": "lj1dy3p",
                  "score": 13,
                  "body": "Mexico maybe \n\nYou really think the american poor will work for near minimum wage?",
                  "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1dy3p/",
                  "created": 1724160603,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj1eyu1",
                      "score": 9,
                      "body": "Multiple car factories are opening in the US, the money has already been invested. Manufacturing jobs do not pay minimum wage.",
                      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1eyu1/",
                      "created": 1724160974,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lj1g5wq",
                      "score": 9,
                      "body": "Yes? Most people in America will work for 15 and 20 dollars an hour. Manufacturing is not a minimum wage job anyway.\n\n7.25? No, but who ever is still trying to keep that standard alive isn't serious about hiring good people.",
                      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1g5wq/",
                      "created": 1724161399,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj1gzpg",
                          "score": 2,
                          "body": "What do you think theyre paying the people in china?",
                          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1gzpg/",
                          "created": 1724161687,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lj1iq4a",
                              "score": 2,
                              "body": "Why would I care? I live in NY.\n\nWho has ever tried to justify American salaries based on what someone in China makes.",
                              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1iq4a/",
                              "created": 1724162282,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lj1v1pk",
                                  "score": 5,
                                  "body": "Certain jobs do not exist in america due to pay expectations and cost of living. For example, cheap retail clothing and toy manufacturing could never exist in the US.",
                                  "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1v1pk/",
                                  "created": 1724166307,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lj1luze",
                  "score": 3,
                  "body": "I’m certain you are correct, but this will hurt them coming back. I grew up doing accounting for manufacturing. I’d love to do that again. ",
                  "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1luze/",
                  "created": 1724163354,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lj1d799",
      "score": 13,
      "body": "I would worry more about taxes on unrealized capital gains.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1d799/",
      "created": 1724160331,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1e9yj",
      "score": 4,
      "body": "For this to pass you need democrats to win presidency senate and house. It is unlikely they win all 3, even if they eke out house/senate it will be difficult to go against waves of lobbying against this. As of now highly improbable this gets passed.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1e9yj/",
      "created": 1724160723,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1hjtj",
      "score": 11,
      "body": "In the **best** case scenario, it would have no effect.\n\nLong term, indirectly, it would raise the price of products to consumers, which would hurt sales, which would hurt stock prices.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1hjtj/",
      "created": 1724161881,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1fv4h",
      "score": 3,
      "body": "Marginally maybe but it’s not something I would concern myself with. They are historically low and arguably should be higher. My bigger concern is long term they won’t stop there.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1fv4h/",
      "created": 1724161293,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj13p4g",
      "score": 18,
      "body": "My guess, it probably won’t make a big difference. Maybe see a dip upon the announcement but that’s about it",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj13p4g/",
      "created": 1724156605,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1bagn",
      "score": 5,
      "body": "Just remember, companies don’t pay taxes; companies collect taxes as a pass through from consumers to the government. It will have some impact on spending, but it’s probably not easily separately identifiable without a really complex analysis due to the number of moving parts.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1bagn/",
      "created": 1724159628,
      "depth": 0,
      "replies": [
        {
          "id": "lj1lw5w",
          "score": 1,
          "body": "Sure but margins aren't static and several large retailers like Amazon are saying consumers are presently balking at paying higher prices.",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1lw5w/",
          "created": 1724163364,
          "depth": 1,
          "replies": [
            {
              "id": "lj1ns7s",
              "score": 1,
              "body": "It’s a quite complex analysis because the impact of taxes is different for every good or service based on different elasticities. The other complication here is the cash tax piece. There are both temporary and permanent differences in cash taxes. They could raise the statutory rate and offset by allowing other permanent differences or change the timing. That’s why I said it would be a really complicated analysis.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1ns7s/",
              "created": 1724163987,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj1fx6r",
      "score": 4,
      "body": "Well obviously this is bad news for value. How that effects price is different matter but in the long term yes.\n\nPeople saying corporations will just pass on the tax to the consumer are coping. Yes tax incidence is a thing, no not all of it will go the consumer. Some of it will go to the shareholder, some of it to the workers and some of it to the consumer.\n\nYes taxes were historically higher, but market right now have historically low P/Es, Implied ERPs, GDP to Market Cap, ... (Your valuation metric of choice)\n\nTax loop holes were always a thing and always will be a thing. Corporation still pay the effective tax rate, which will dilute the effect of this policy change. I think it's a pretty hard sell to say the two are unrelated though. We will probably see deferred earnings grow again. Which is bad for the US.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1fx6r/",
      "created": 1724161313,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1n0y2",
      "score": 4,
      "body": "There is no such thing as a business tax.  It is really a consumer tax",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1n0y2/",
      "created": 1724163738,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1n98d",
      "score": 5,
      "body": "Sigh, why wouldn’t we lower the rate to promote growth and discourage companies storing money overseas?\n\nNope, typical short term thinking.  Let’s heavily the companies that create jobs, causing them to leave money overseas and therefore not investing in the US economy.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1n98d/",
      "created": 1724163814,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj15zy1",
      "score": 9,
      "body": "It’s a net negative for sure but do want to add that this increases the value of debt tax shields\n\nYou’ll see more companies switch to LIFO and you’ll likely see more reinvestment with all else equal.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj15zy1/",
      "created": 1724157572,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1azyf",
      "score": 8,
      "body": "Market will be fine. With the monopolies and oligopolies in most US industries, any tax increases are just passed on as price increases.\n\nIn other words, since the US companies don't have competition, it doesn't matter what the tax rate is.  The companies are free to raise prices to compensate.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1azyf/",
      "created": 1724159519,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1im1y",
      "score": 13,
      "body": " You're not gonna get an accurate answer from Reddit considering the massive left bias",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1im1y/",
      "created": 1724162245,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1jbem",
      "score": 5,
      "body": "Of course it will affect prices. So will higher personal taxes, higher capital gains tax, higher regulation, etc.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1jbem/",
      "created": 1724162485,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1nqes",
      "score": 3,
      "body": "Not sure about stock prices by I hope it significantly affects her ability to get elected…",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1nqes/",
      "created": 1724163970,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1tl0u",
      "score": 4,
      "body": "Her price controls will affect stock prices by turning the USA into Venezuela ",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1tl0u/",
      "created": 1724165842,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1gdrp",
      "score": 5,
      "body": "It will be pushed onto the consumer through higher prices, we’ve been here before. Markets will be largely unaffected.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1gdrp/",
      "created": 1724161477,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1s54i",
      "score": 5,
      "body": "So far her plans are more spending, less productivity, more income redistribution and more frictions. Together they are inflationary and anti-growth. Expect stagflation.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1s54i/",
      "created": 1724165389,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj15g22",
      "score": 6,
      "body": "Companies will just charge us more at the end of the day.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj15g22/",
      "created": 1724157342,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj15zse",
      "score": 2,
      "body": "Most analysts value off ebitda for this exact reason",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj15zse/",
      "created": 1724157570,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj181vp",
      "score": 2,
      "body": "There will be an initial pull, but after a while, everyone will get tired of their money sitting on the sidelines, and it'll return to normal. People still like putting money in the stock market.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj181vp/",
      "created": 1724158392,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1f8kp",
      "score": 2,
      "body": "It depends on the deductions/expenditures factored tax rate which [pre-Trump](https://www.npr.org/2017/08/07/541797699/fact-check-does-the-u-s-have-the-highest-corporate-tax-rate-in-the-world) was 18% vs the statutory rate of 37%. A 28% tax rate absent deductions/expenditures would be a huge increase, but with taxes the devil is in the details. Some sectors like green energy will probably get substantial breaks, oil and other non-Democrat leaning industries will see substantial hikes. All in all the biggest losers will be retail and small businesses as they will do not have the credits or the ability to obfuscate their earnings like large corps do.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1f8kp/",
      "created": 1724161072,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1hw4w",
      "score": 2,
      "body": "In the past corporations such as Apple found countries with lower taxes rates and avoided paying taxes in US. When they had an opportunity to move profits to the US at special lower taxes rates they move billions to the US at the lower special tax rate.\nI think if the tax rate for the wealthy is raised to high they will move to countries with lower taxes. In CA Ohtani’s contract was designed to avoid paying CA State income taxes which is high. Bezos moved to Florida and Musk to TX.\nThe rich have the resources to hire the best people to help them reduce their tax bill.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1hw4w/",
      "created": 1724161998,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1m8j5",
      "score": 2,
      "body": "Yeah good luck passing this",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1m8j5/",
      "created": 1724163478,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1oq74",
      "score": 2,
      "body": "The thing we do know is regardless of who wins, they will spend too much money.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1oq74/",
      "created": 1724164293,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1p6pu",
      "score": 2,
      "body": "They would probably increase deductions anyway. Trump lowered the rates and took away deductions.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1p6pu/",
      "created": 1724164444,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1ah5w",
      "score": 4,
      "body": "They will just pass the higher taxes on to the consumer…",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1ah5w/",
      "created": 1724159323,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1cjab",
      "score": 4,
      "body": "she is not hiking income. she is hiking tax. two different things.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1cjab/",
      "created": 1724160090,
      "depth": 0,
      "replies": [
        {
          "id": "lj1myhp",
          "score": 1,
          "body": "Sorry. Meant to write income taxes. Thanks for catching this.",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1myhp/",
          "created": 1724163716,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj1urhp",
      "score": 3,
      "body": "They won't go through.  The market will always want a Democrat president and deadlocked Congress.  That is maximum liquidity.\n\nRepublicans have massive district advantages in the house elections.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1urhp/",
      "created": 1724166218,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj13wtf",
      "score": 12,
      "body": "Won’t make a huge difference. Especially when you consider Trump’s tariffs would have a huge negative effect.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj13wtf/",
      "created": 1724156694,
      "depth": 0,
      "replies": [
        {
          "id": "lj14s0e",
          "score": 10,
          "body": "Trump's tariffs would be a disaster if implemented. Do his supporters actually believe tariffs on China are paid by the Chinese?",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj14s0e/",
          "created": 1724157061,
          "depth": 1,
          "replies": [
            {
              "id": "lj16fgr",
              "score": 5,
              "body": "Trump himself has stated that he loves the poorly educated, and the saying goes “If you tell a lie big enough and keep repeating it, people will eventually come to believe it.”, so the belief among his supporters that the Chinese pay for the tariffs he implemented probably stems from that.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj16fgr/",
              "created": 1724157746,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj1kok8",
              "score": 2,
              "body": "A tariff discourages imports so if businesses see a case in increasing domestic manufacturing it could actually work. \n\nThe reason for that is a strong pre-existing skilled workforce and large amounts of available capital to keep trade going. The key disadvantage is high labour costs, but a reasonable tariff structure taking that into account can make domestic production price competitive.\n\nIt's important to understand that if domestic manufacturing in the US does not increase now, its repercussions will be felt in another 20 years as your experienced and skilled labour pool will start dying out and knowledge transfer to newer generations will not take place.\n\nIndia has been maintaining or introducing tariffs in key sectors to give domestic industry an opportunity to grow, and it has shown some results. Similarly China maintains a very restrictive import policy while getting freedom to export to free markets.\n\nTrump is terrible for many reasons but the kind of ridicule he has faced while he was in office for several economic policy decisions was way overboard.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1kok8/",
              "created": 1724162959,
              "depth": 2,
              "replies": [
                {
                  "id": "lj1ofio",
                  "score": 1,
                  "body": "Trump has proposed a 10% tariff on all foreign imports. Here's one take on this:\n[But that proposal would likely backfire, effectively acting as a tax on U.S. consumers, economists spanning the political spectrum say. If the tariffs are enacted — with Trump also proposing a levy of 60% or more on Chinese imports — a typical middle-class household in the U.S. would face an estimated $1,700 a year in additional costs, according to the non-partisan Peterson Institute for International Economics.](https://www.cbsnews.com/news/trump-tariffs-proposal-10-percent-1700-cost-per-us-household/)",
                  "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1ofio/",
                  "created": 1724164196,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lj1d05r",
      "score": 2,
      "body": " Not really. Corporate will just hike the prices to ensure they have the same or higher profits, so Stock price likely fly higher. \n\nConsumers are the ones who suffer the most.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1d05r/",
      "created": 1724160260,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1efb4",
      "score": 2,
      "body": "Raise the corporate rate and watch companies flee the US for more friendly Countries set up headquarters and pay their taxes there instead of here.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1efb4/",
      "created": 1724160778,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1hav5",
      "score": 2,
      "body": "It will absolutely hit the market in the short-term. Longer-term, eh - the inflation caused by our rapidly growing debt and the higher rates to issue US debt notes, is a much larger concern - an existential one. Also, the corporate tax rate is the least of corporate worries. In a Kamala administration, the federal agencies will pulverize our corporations and put small caps at an even larger disadvantage relative to large caps as the federal agencies look to move people from independent jobs and businesses into dependency on longer-term government programs and government jobs. The corporate tax rate conversation is sensational because that's where politicians (both sides) want the public to be looking. No one wants to talk about the real policies of our government deficit spending and our insane debt issuance that is putting us in a financial death spiral and also the federal agencies circumventing congress with their ever increasing burden on businesses for the aforementioned reason.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1hav5/",
      "created": 1724161795,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1njrl",
      "score": 2,
      "body": "So far all her economic proposals have been attempted before and have been colossal failures. Especially price controls.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1njrl/",
      "created": 1724163910,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj146rk",
      "score": 3,
      "body": "No, I don’t really think so.\n\nThe truth is, many of the major companies can easily make accounting changes and make this work.\n\nBig companies coming out against this obviously will have something to gain by not allowing it to pass.  Companies will claim that this is going to negatively affect their bottom line, but something tells me Amazon or Koch Industries could figure out a way to still be profitable and pay this increased taxes—tho it may have to come from some of those hundreds of VP and exec salaries they pay for ;)\n\nBut for the average US citizen, this would only have a net positive effect.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj146rk/",
      "created": 1724156811,
      "depth": 0,
      "replies": [
        {
          "id": "lj1700u",
          "score": 5,
          "body": "Amazon only pays 6 percent iirc, so I doubt they'll see anything close to a true 8 percent home, unless it's 8 percent increase of the six which puts them at 6.48",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1700u/",
          "created": 1724157977,
          "depth": 1,
          "replies": [
            {
              "id": "lj1f8eq",
              "score": 2,
              "body": "No each additional percent of tax is harder to deduct than the last one. They may go from 6 to 6+7, but will probably find some ways to soften the blow and keep it a bit lower.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1f8eq/",
              "created": 1724161070,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj15gcn",
          "score": 3,
          "body": "Every company that is profitable will be able to be profitable and pay the tax.\n\nThat’s what the tax is…",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj15gcn/",
          "created": 1724157345,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj16jmx",
          "score": 6,
          "body": "Do you know what you are talking about at all?",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj16jmx/",
          "created": 1724157794,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj17180",
          "score": 5,
          "body": "The sad reality is that in order to maintain the companies earnings they will likely just increase prices on the consumer to offset the additional tax cost. This drives up inflation.",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj17180/",
          "created": 1724157991,
          "depth": 1,
          "replies": [
            {
              "id": "lj1fdfa",
              "score": 3,
              "body": "Not really, companies basically already raised prices as much as consumers are willing to pay, just to pad profits. They won't raise prices if it lowers sales.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1fdfa/",
              "created": 1724161119,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj1ei7d",
              "score": 2,
              "body": "It usually affects the workers more than the customers.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1ei7d/",
              "created": 1724160808,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj1l3w4",
          "score": 1,
          "body": "It’s more likely they will just layoff employees instead of taking money away from the executives",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1l3w4/",
          "created": 1724163102,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj19mjg",
      "score": -1,
      "body": "Would Trump’s tariffs, incompetency, and attempts to overthrow our government result in lower stock prices?\n\nYour question presupposes that Harris’s higher probability of winning should lower stock prices, but you’re not accounting for every variable. It’s possible that Harris’s probability of winning would *increase* stock prices.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj19mjg/",
      "created": 1724158999,
      "depth": 0,
      "replies": [
        {
          "id": "lj1lg0j",
          "score": 1,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1lg0j/",
          "created": 1724163215,
          "depth": 1,
          "replies": [
            {
              "id": "lj1lyj1",
              "score": 3,
              "body": "Because Americans have an incorrect belief that Republicans are “good” for the economy and Democrats are “bad” for the economy. It couldn’t be further from the truth.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1lyj1/",
              "created": 1724163386,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj1ko1v",
          "score": 1,
          "body": "I see your point especially given Trump's cockamamie ideas on tariffs.",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1ko1v/",
          "created": 1724162955,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj19zyp",
      "score": 2,
      "body": "Yes it will",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj19zyp/",
      "created": 1724159144,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj18acn",
      "score": 1,
      "body": "All that will happen is company's will bonus out of reinvest more.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj18acn/",
      "created": 1724158484,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1bukl",
      "score": 1,
      "body": "It’s already priced in.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1bukl/",
      "created": 1724159837,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1c1ja",
      "score": 1,
      "body": "Companies will probably reinvest profits if that tax hike is an issue, focusing on growing stock price potential over profits.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1c1ja/",
      "created": 1724159908,
      "depth": 0,
      "replies": [
        {
          "id": "lj1mrt9",
          "score": 1,
          "body": "A move from 21% to 28% represents a 33% raise in taxes. When corporations evaluate new investments, won't a 1/3 increase in taxes affect the economic viability of some new projects?",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1mrt9/",
          "created": 1724163655,
          "depth": 1,
          "replies": [
            {
              "id": "lj1n0wf",
              "score": 1,
              "body": "A 1/3 increase in a 1/5 tax. That's a total of 1/15 increase on the total cost. While significant, it seems you've arranged the numbers to fit your argument.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1n0wf/",
              "created": 1724163738,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj1c5io",
      "score": 1,
      "body": "It is a proposal to hike tax on those small and mid size corporations which don't have ways and resources to use loop holes to pay less or pay no tax. Silicone Valley companies like Apple and Amazon have nothing to worry about.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1c5io/",
      "created": 1724159949,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1cb6u",
      "score": 1,
      "body": "Cost of doing business.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1cb6u/",
      "created": 1724160007,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1cg44",
      "score": 1,
      "body": "This simply has to happen...",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1cg44/",
      "created": 1724160057,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1cna8",
      "score": 1,
      "body": "No because they never actually do it. It's lip service.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1cna8/",
      "created": 1724160130,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1cox1",
      "score": 1,
      "body": "No.\n\n1) earnings are more important to stock prices than the tax rate.\n\n2) Taxes on corporations are voluntary.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1cox1/",
      "created": 1724160147,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1feuc",
      "score": 1,
      "body": "If it goes down gives a good opportunity to buy. Follow what the Democrats in congress do if she is elected if trump is elected do what the Republicans in congress do. There is really no downside except if you are dumb enough to sell everything in a panic",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1feuc/",
      "created": 1724161133,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1fg63",
      "score": 1,
      "body": "Technically yes, corporate earnings would go from 89 to 82c so a roughly 8pc decline, so stocks on average should decline 8pc assuming flat multiples",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1fg63/",
      "created": 1724161146,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1flt1",
      "score": 1,
      "body": "It might and even if it does it will be temporary. Just like every other thing that ever happends on this planet",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1flt1/",
      "created": 1724161202,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1h8b4",
      "score": 1,
      "body": "It won’t affect speculative stocks so much as dividend paying stocks.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1h8b4/",
      "created": 1724161770,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1iiz0",
      "score": 1,
      "body": "Higher interest rates are supposed to kill stocks. Didn't happen.  Many companies have tax avoidance departments. They'll figure out how to minimize the impact, like they always do.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1iiz0/",
      "created": 1724162214,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1iksu",
      "score": 1,
      "body": "Democrats would also need to keep the senate which is a lot less than 50/50 odds",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1iksu/",
      "created": 1724162232,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1iwlj",
      "score": 1,
      "body": "Two ways to slow/reduce the deficit: less spending, higher taxes. Republicans talk about reducing spending but didn’t when they had white house and both houses of congress in 2017. Just reduced taxes (mainly for corporations and wealthy) leading to stock buybacks and pushing the stock market higher.  The recent spike in the U.S. stock market (2023/24) has mainly to do with  promise of AI which has nothing to do with corp tax rates that I can see.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1iwlj/",
      "created": 1724162344,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1juki",
      "score": 1,
      "body": "Tax rate is secondary to income. The deductions are what matters more not the rate. Delete the carried interest deduction and you’d see some real influence in income.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1juki/",
      "created": 1724162668,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1jxnt",
      "score": 1,
      "body": "Higher corp tax rates will cause some businesses to pursue different investment and tax strategies. For example, if profits and holding cash will cost 33% more (from 21% to 28%), then corps may be more motivated to invest in salaries, research, innovation, consultants, etc hoping they will get an ROI on top of the tax deduction. To some degree, a higher tax rate can help with greater cash flow throughout the economy and less pooling amongst the richest corporations. Yes, it will impact buybacks and dividends, but on a positive note greater cash flow in the economy creates more opportunity on a wider scale. In other words, the richest will benefit less and there will be new winners as a result of greater cash flow.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1jxnt/",
      "created": 1724162697,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1kkyt",
      "score": 1,
      "body": "Lower tax rates doesn’t mean lesser income collected. There are multiple ways a corporation can keep income away from USA… look at the figures, the total collected amount increased when taxes was lowered…",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1kkyt/",
      "created": 1724162925,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1kylt",
      "score": 1,
      "body": "Gonna bring a welcomed dip so hoard some bands to buy the bottom.......",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1kylt/",
      "created": 1724163053,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1lpix",
      "score": 1,
      "body": "DCA don’t care.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1lpix/",
      "created": 1724163303,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1lpst",
      "score": 1,
      "body": "Is the US still a better nation for your business? Then, no.\n\nAnd even if it drives many away, there's some momentum in the EU to subject all businesses to a minimum tax ... regardless how or where you're organized, your operations there will be obligated to a minimum.\n\nWe should get on board with that",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1lpst/",
      "created": 1724163306,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1mawx",
      "score": 1,
      "body": "If anything it should only affect the profitable ones",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1mawx/",
      "created": 1724163500,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1naou",
      "score": 1,
      "body": "OP posted this in 4 different stock subs lol",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1naou/",
      "created": 1724163827,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1np65",
      "score": 1,
      "body": "Stocks will still grow, it's just a slower growth rate than 21%. There could be an initial correction, it's hard to say really. What I'm a little disappointed with her in is not targeting the billionaires. If we're going to solve the wealth inequality equation, wealthy people need to pay a higher tax rate. This isn't people who have a few million dollars and convince themselves they're rich, that's working class. Wealthy people are different story. 50, 100 million plus. The people who are buying portfolios of single-family homes, the people who are buying the majority of the stocks, the people buying every asset they can.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1np65/",
      "created": 1724163959,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1pop5",
      "score": 1,
      "body": "Sigh!   Not going to make any difference.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1pop5/",
      "created": 1724164606,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1psqa",
      "score": 1,
      "body": "Im waiting for someone to hit them hard. 95% corporate tax",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1psqa/",
      "created": 1724164643,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1taas",
      "score": 1,
      "body": "With corporate taxes being only 6.5% of the total government tax revenue and individual taxes being 45.3%…",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1taas/",
      "created": 1724165748,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1g4cm",
      "score": 1,
      "body": "The sad thing is rich people shoot themselves in the foot and they are too stupid and greedy to look at the entire picture. \n\nCorporate profits often go to stock buybacks, which mostly give rich people more money, which sits in the stock market and does nothing for the economy or the businesses and REALLY does nothing to help low income people. \n\nDemocrat policies that give non-rich people more money (student loan forgiveness, cheap child care, etc) generally means they can spend more money, at companies you own stock in.  So it helps people, they enjoy life more, and the stock market still goes up. \n\nIf you look at history the stock market goes up in times of low tax and times of high tax. The biggest difference is what fraction of the population has a high quality of life.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1g4cm/",
      "created": 1724161383,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj15423",
      "score": 1,
      "body": "My guess, and I have no actual clue but I think you might see an initial dip because people think that it would be bad and the stock market runs on sentiment too....and then it'll go back up to higher then ever before, as the stock market always tends to do. These are not companies that can't afford 7%.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj15423/",
      "created": 1724157202,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj18r4n",
      "score": 2,
      "body": "It's just a proposal.  First, she has to be elected.  Next the proposal has to become a bill.  Then the bill has to become law, which is probably the part that has the lowest probability.  Then, the law has to go into effect.  So even if she wins and the Dems win the House and Senate, and this proposal becomes law, companies will have a few years to plan for it.  Most valuations are based on EBITDA, anyway, since the various twistings and turnings of corporate taxes are truly byzantine in nature and sorted out years after the tax year.\n\nTLDR: No effect",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj18r4n/",
      "created": 1724158665,
      "depth": 0,
      "replies": [
        {
          "id": "lj1nwto",
          "score": 1,
          "body": "Correct answer imo. It truly doesn't affect investment cases for moat investors as those tax event are ever changing, and there exist ways to work around them somewhat. Nothing also stops other government to change it back later, too. EBITDA is used anyway.",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1nwto/",
          "created": 1724164029,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj1apa9",
      "score": 1,
      "body": "lol so they will go from paying 0% to 0%?\n\nTax hike is meaningless and the scare tactic around it is such bullshit. Greedy fucking vultures some of these billionaires.\n\nThey already have 1 million loopholes to use to reduce taxes to near 0. It doesn't matter.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1apa9/",
      "created": 1724159408,
      "depth": 0,
      "replies": [
        {
          "id": "lj1lda1",
          "score": 1,
          "body": "In this case she's not talking about billionaires but corporations.",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1lda1/",
          "created": 1724163189,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj149zo",
      "score": -7,
      "body": "More likely to cause layoffs and offshoring ",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj149zo/",
      "created": 1724156848,
      "depth": 0,
      "replies": [
        {
          "id": "lj15xmu",
          "score": 10,
          "body": "what else is there to offshore? there's no manufacturing in the US except for military and space!",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj15xmu/",
          "created": 1724157546,
          "depth": 1,
          "replies": [
            {
              "id": "lj17elo",
              "score": 2,
              "body": "That's a popular cliche. Fact is, US is the 2nd largest mfg in the world producing $2.3T in 2022. The notion we don't make anything anymore is misplaced.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj17elo/",
              "created": 1724158139,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj16dgr",
          "score": 10,
          "body": "did companies start bringing jobs back onshore when the corporate tax rate was lowered under Trump?",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj16dgr/",
          "created": 1724157724,
          "depth": 1,
          "replies": [
            {
              "id": "lj1broe",
              "score": 3,
              "body": "Your question exposed him lmao. Some of these ill informed people will vote based on some weird thinking and their votes mean as much as yours",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1broe/",
              "created": 1724159807,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj153h5",
          "score": 6,
          "body": "At this point that’s already baked in. Every large company is doing that every chance they get.",
          "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj153h5/",
          "created": 1724157196,
          "depth": 1,
          "replies": [
            {
              "id": "lj173a1",
              "score": 2,
              "body": "There is a very specific calculus the big companies do to determine just how much of the corporation is offshored and how much of the workforce is offshored. Any significant tax code change will change that calculus.",
              "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj173a1/",
              "created": 1724158014,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj18byd",
      "score": 1,
      "body": "Nah. It used to be a higher rate and there were plenty of bull markets. Raising corporate rates 7%, IMO, would have little, to no impact, on stock prices.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj18byd/",
      "created": 1724158501,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1ffi2",
      "score": 1,
      "body": "It was way way higher before trump cut it for his buddies. It’ll be okay.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1ffi2/",
      "created": 1724161140,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj146ks",
      "score": 1,
      "body": "There are many factors which may/may not affect stock prices. This specific issue, there's no guarantee if she wins it will get through House and Senate. Other things either candidate would do will impact stock prices in other ways. Russia and China have dictatorships and weak stock markets compared to the U.S., so if Trump wins faux Christian fascism may be horrible for stocks.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj146ks/",
      "created": 1724156808,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj18sb7",
      "score": 1,
      "body": "The market is relatively smart, and understands that there are multiple ways to be profitable. Raising corporate taxes will inevitably mean two things: 1. more capital investment to avoid paying taxes on the profits, and it long overdue as we haven't seen a large boom of capital investment in awhile. 2. more money in consumers hands and a healthier economy as a whole meaning greater consumer purchasing power.\n\nObviously the most direct way to more profit is lower taxes and regulations, however these things are not sustainable under Trump and the GOP as they erode consumer purchasing power and housing demand which in turn forces corporations to lower prices and downsize despite their lower taxes and reduced regulations.\n\nEverything is cyclical, and corporations benefit from both sides of the coin. I think if anything the market appreciates stability more than anything else heading into this election.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj18sb7/",
      "created": 1724158678,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1fslz",
      "score": 1,
      "body": "Has to pass the senate and house. \n\nThe president has very little actual power besides supreme court",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1fslz/",
      "created": 1724161268,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1gett",
      "score": 1,
      "body": "Lowering the corp tax rate would allow companies to sell products for less.  It’s a way to reduce the effects of inflation, assuming the government doesn’t print more money than it loses via the reduced income from tax revenue.\n\nRaise the corp tax would force companies to sell products for more.  It would have a similar effect on the cost of goods as inflation.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1gett/",
      "created": 1724161486,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1gpx8",
      "score": 1,
      "body": "No. Corporations will keep trying to make more money. It’s America, there is governance and the rule of laws. If they wanna invest in China or Venezuela instead, good luck with holding onto your assets when those governments decide they want you out.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1gpx8/",
      "created": 1724161594,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1u1gl",
      "score": 1,
      "body": "Nope. I hate the Republicans, but Dems have corporate taxes all wrong. Tax it at the \"individuals/shareholders receiving actualized income\" level, not at the corporate profit level. Corporate expenses are always just passed into the consumer - tax hikes included.",
      "permalink": "/r/stocks/comments/1ewu1d8/will_kamala_harris_proposal_to_hike_corporate/lj1u1gl/",
      "created": 1724165987,
      "depth": 0,
      "replies": []
    }
  ],
  "stockTickers": {
    "post_summary": "Kamala Harris' proposal to increase corporate tax rates may affect stock prices.",
    "companies": [],
    "tickers": [],
    "main_ticker": []
  }
}