{
  "title": "Lowe's cuts full-year outlook as it expects weaker home improvement sales ",
  "score": 101,
  "selftext": "Lowe’s on Tuesday cut its full-year forecast, as the retailer’s quarterly sales declined and it projected weak home improvement spending in the second half of the year.\n\nThe company said it now projects total sales of between $82.7 billion and $83.2 billion for the full year, compared with the $84 billion to $85 billion that it previously expected. It said it expects comparable sales to fall by 3.5% to 4%, compared with its prior forecast of a decline of 2% to 3%. It anticipates adjusted earnings per share will be about $11.70 to $11.90, compared with the prior outlook of between $12 and $12.30.\n\nIn an interview with CNBC, CEO Marvin Ellison said consumers are waiting for the Federal Reserve to cut interest rates. He added shoppers also under pressure from the economic backdrop.\n\n“Inflation remains high,” he said. “And big-ticket purchases are being delayed as customers sit back and wait for interest rates to fall.”\n\nFed Chair Jerome Powell has signaled a rate cut could come as soon as September, but Ellison said it’s difficult to predict how soon home improvement activity would gain momentum again after that.\n\nAbout 90% of Lowe’s customers are homeowners and most have a fixed 30-year mortgage rate of less than 4%, he said. That explains customers’ hesitance to get a new mortgage or take out a loan for a major home project with higher interest rate, he added.\n\nHe said Lowe’s has not seen “a dramatic shift one way or another in overall consumer sentiment,” but is waiting for housing turnover to go up.\n\nHere’s what the company reported for the fiscal second quarter compared with what Wall Street was expecting, based on a survey of analysts by LSEG:\n\nEarnings per share: $4.10 adjusted vs. $3.97 expected\n\nRevenue: $23.59 billion vs. $23.91 billion expected\n\nIn the three-month period that ended Aug. 2, Lowe’s net income fell to $2.38 billion, or $4.17 per share, compared with $2.67 billion, or $4.56 per share, in the year-ago period.\n\nLowe’s got a $43 million pretax gain from the sale of its Canadian retail business in 2022, which lifted its earnings in the second quarter. That boosted the company’s earnings per share in the period by 7 cents. Excluding the gain, the company earned $4.10 per share.\n\nNet sales dropped from $24.96 billion in the prior year. Lowe’s posted a year-over-year sales decline for the sixth straight quarter.\n\nComparable sales, an industry metric that takes out one-time factors like store openings and closures, dropped 5.1%, as the company said customers took on fewer discretionary home projects and unfavorable weather hurt sales of outdoor and seasonal items. It said those declines were partially offset by growth in its online business and sales to home professionals, such as contractors and electricians.\n\nLowe’s shared its quarterly results and outlook at a time when investors and economists are watching consumer spending particularly closely. Recent economic data and corporate earnings have given mixed indications about American households’ financial health, as the Federal Reserve weighs a much-awaited rate cut.\n\nJobs growth in July came in much lower than expected. Yet on the other hand, Walmart’s CFO, John David Rainey, told CNBC that the largest U.S. retailer does not “see any additional fraying of consumer health.” Goldman Sachs also cut the odds of a recession to 20%.\n\nFor home improvement retailers, the strain may be greater because of higher mortgage rates and elevated costs for borrowing. Lowe’s rival, Home Depot, last week beat Wall Street’s quarterly expectations for earnings and revenue. Yet the company said it expects the back half of the year to be weaker than anticipated as consumers continue to have a “deferral mindset.”\n\nIn an interview with CNBC, Home Depot CFO Richard McPhail said customers are not only putting off projects because of higher interest rates. He said they also have “a sense of greater uncertainty in the economy,” even though most of Home Depot’s customers own homes and have seen sharp property value gains.\n\nShares of Lowe’s closed Monday at $243.21. As of Monday’s close, the company’s stock is up about 9% year to date, trailing behind the nearly 18% gains of the S&P 500.\n\nSource: https://www.cnbc.com/2024/08/20/lowes-low-q2-2024-earnings.html",
  "link_flair_text": null,
  "id": "1ewvbdw",
  "num_comments": 24,
  "created_utc": 1724159871,
  "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/",
  "comments": [
    {
      "id": "lj1kgow",
      "score": 50,
      "body": "Who has the cash to remodel a kitchen for 30k? Ya nty",
      "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj1kgow/",
      "created": 1724162881,
      "depth": 0,
      "replies": [
        {
          "id": "lj3tf82",
          "score": 4,
          "body": "Just yolo it on a 10 percent APR HELOC",
          "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj3tf82/",
          "created": 1724188134,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj4kn6v",
          "score": 2,
          "body": "That’s a small one too. Mine is small and overall I spent 18k with some appliances and I did the whole work, back in 22",
          "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj4kn6v/",
          "created": 1724197331,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj546gt",
          "score": 1,
          "body": "30k is a basic kitchen. Most spending closer to 60,000 I would assume",
          "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj546gt/",
          "created": 1724204498,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj1dwvd",
      "score": 25,
      "body": "I am one of them waiting for lower interest rates to do a full home remodel. Been saving up cash too for peace of mind because I plan on taking out a fat loan",
      "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj1dwvd/",
      "created": 1724160590,
      "depth": 0,
      "replies": [
        {
          "id": "lj1exaq",
          "score": 12,
          "body": "Yeah, they’re saying on their earnings call now that that’s basically all of the driving factor \n\nPro sales are up ~5% and online sales are up 3%",
          "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj1exaq/",
          "created": 1724160959,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj1ina6",
          "score": -2,
          "body": "Interest rates?  This m************ give you free year with no payments",
          "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj1ina6/",
          "created": 1724162256,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj1qi0f",
      "score": 22,
      "body": "I used to go to lowes more often but jeez even plants are ridiculously overpriced now.",
      "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj1qi0f/",
      "created": 1724164868,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj2jr8s",
      "score": 12,
      "body": "They quoted me $3,900 to install a new 30 gallon water heater for a one bedroom apartment. I get fighting the city of Seattle for written permission to replace a water heater and dealing with condo associations and water cutoffs is a pain, but wow. That is ridiculous. I used to install water heaters with my grandfather for $20. $20 we split. ",
      "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj2jr8s/",
      "created": 1724174008,
      "depth": 0,
      "replies": [
        {
          "id": "lj54bpc",
          "score": 3,
          "body": "Greed pure and simple. I got quotes of $7000 for a basement plumbing project. Found a local guy to do it for a fraction of that price",
          "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj54bpc/",
          "created": 1724204550,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj5xje5",
      "score": 4,
      "body": "lowe's is garbage. home depot is more reasonable",
      "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj5xje5/",
      "created": 1724217091,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1tvyu",
      "score": 12,
      "body": "They’d have more sales if they used their pricing power and reduced costs on things.  And no, it’s not just tariffs.  It’s def greed.",
      "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj1tvyu/",
      "created": 1724165939,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj1zy5v",
      "score": 7,
      "body": "Buy Whirlpool instead. Thank me later",
      "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj1zy5v/",
      "created": 1724167830,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj29khj",
      "score": 5,
      "body": "NOBODY has any money!!!",
      "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj29khj/",
      "created": 1724170815,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj2sq9o",
      "score": 1,
      "body": "Or - it sucks going to Lowe’s. \n\nNo one knows where anything is located or is knowledgeable on home improvement or their products. \n\nI went this last weekend and 3 of the 4 items I had picked up didn’t have the right barcode stickers on them so I had to wait for an employee to go get me new items.  \n\nFirst, the lady who just stands around the self-checkouts asked me to go get new products. I refused because I don’t work there and they should appropriately label their items. \n\nI also can’t stand that they only have self-checkout open - I DONT WORK HERE.",
      "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj2sq9o/",
      "created": 1724176763,
      "depth": 0,
      "replies": [
        {
          "id": "lj4kt6f",
          "score": 4,
          "body": "Actually Home Depot is worse in my area",
          "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj4kt6f/",
          "created": 1724197391,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj4mn2d",
          "score": 3,
          "body": "YMMV when it comes to this.  I definitely have lowes I love and lowes I avoid",
          "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj4mn2d/",
          "created": 1724198053,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj4svcm",
          "score": 2,
          "body": "This is anecdotal biased nonsense. If they changed how they did business in the past few years, sure, but this is a comparison of sales they’ve done so not a factor in how they set up their stores with product locations.",
          "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj4svcm/",
          "created": 1724200349,
          "depth": 1,
          "replies": [
            {
              "id": "lj4tb6e",
              "score": -1,
              "body": "I am complaining about the entire  customer experience where they have entirely gotten rid of cashiers and no one is knowledgeable about the products they sell. This is anecdotal across 4 stores in my experience.",
              "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj4tb6e/",
              "created": 1724200510,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj1iktl",
      "score": -4,
      "body": "Oh my God!  Only 83.2 billion instead of 84 billion \n\n\nFuck \nFuck\nFuck \n\nThe economy! 😭😭",
      "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj1iktl/",
      "created": 1724162233,
      "depth": 0,
      "replies": [
        {
          "id": "lj1kk7u",
          "score": 5,
          "body": "Someone doesnt understand valuations",
          "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj1kk7u/",
          "created": 1724162917,
          "depth": 1,
          "replies": [
            {
              "id": "lj1nbfw",
              "score": -2,
              "body": "I think you're searching for a different word here",
              "permalink": "/r/stocks/comments/1ewvbdw/lowes_cuts_fullyear_outlook_as_it_expects_weaker/lj1nbfw/",
              "created": 1724163834,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}