{
  "title": "Eli Lilly nears all-time high on weight loss success",
  "score": 37,
  "selftext": "Lilly tested its drug tirzepatide on patients with prediabetes and obesity. after three years, the patients were 94% less likely to develop type 2 diabetes compared to the placebo group. In addition, they lost an average of 22.9 percent of their body weight, compared with 2.1 percent in the placebo group. These data further confirm the potential clinical benefit of long-term treatment for patients with obesity and prediabetes.\n\nAlthough tirzepatide is relatively new to the market (first approved in 2022), it's already a profitable drug. Last year, it generated $5.34 billion in sales. This year, it's on track to reach nearly $18 billion in sales!\n\nLilly's stock is closely tied to the company's efforts to expand the use of tirzepatide. The company is testing the efficacy of tirzepatide for a variety of conditions thought to be caused by obesity, including heart disease, sleep apnea and Alzheimer's disease.\n\nNearly 900 million adults worldwide are at risk for complications from obesity.\n\nEli Lilly also advocates long-term use of tizepatide. During a 17-week follow-up period, patients stopped treatment and some began to regain weight and develop type 2 diabetes. This resulted in an overall 88% reduction in the risk of developing diabetes.",
  "link_flair_text": "Company News",
  "id": "1ex190x",
  "num_comments": 10,
  "created_utc": 1724174085,
  "permalink": "/r/stocks/comments/1ex190x/eli_lilly_nears_alltime_high_on_weight_loss/",
  "comments": [
    {
      "id": "lj2o0hw",
      "score": 10,
      "body": "Thanks to all fast food companies",
      "permalink": "/r/stocks/comments/1ex190x/eli_lilly_nears_alltime_high_on_weight_loss/lj2o0hw/",
      "created": 1724175323,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj3v0ug",
      "score": 6,
      "body": "Take a look at r/zepbound if you want to see real users. Some amazing things happening over there",
      "permalink": "/r/stocks/comments/1ex190x/eli_lilly_nears_alltime_high_on_weight_loss/lj3v0ug/",
      "created": 1724188646,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj31y5g",
      "score": -4,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1ex190x/eli_lilly_nears_alltime_high_on_weight_loss/lj31y5g/",
      "created": 1724179592,
      "depth": 0,
      "replies": [
        {
          "id": "lj3e2kv",
          "score": 2,
          "body": "If they don't have to take the treatment for life why even sell it? ",
          "permalink": "/r/stocks/comments/1ex190x/eli_lilly_nears_alltime_high_on_weight_loss/lj3e2kv/",
          "created": 1724183386,
          "depth": 1,
          "replies": [
            {
              "id": "lj3g42r",
              "score": 3,
              "body": "I mean, you don't have to take antibiotics for life when you get a random infection, but there are companies that still make those antibiotics. There's always an incentive to make better products. If someone could make a weight loss drug that you only had to take one pill of and you'd be normal BMI forever, why would anyone take the drugs that you have to take for life? It's supply and demand...",
              "permalink": "/r/stocks/comments/1ex190x/eli_lilly_nears_alltime_high_on_weight_loss/lj3g42r/",
              "created": 1724184015,
              "depth": 2,
              "replies": [
                {
                  "id": "lj3um44",
                  "score": 2,
                  "body": ">If someone could make a weight loss drug that you only had to take one pill of and you'd be normal BMI forever, why would anyone take the drugs that you have to take for life?\n\nFinding a workable drug is nightmare process ! It is like taking $1000 into options trading and making it 1 Millions level !\n\nI work on drug research industry, it normally takes 5 to 7 years to test a drug and get it approved by FDA. Most of the drugs not getting approved and shelved half-way through.",
                  "permalink": "/r/stocks/comments/1ex190x/eli_lilly_nears_alltime_high_on_weight_loss/lj3um44/",
                  "created": 1724188514,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lj3ilt8",
                  "score": 0,
                  "body": ".....? ",
                  "permalink": "/r/stocks/comments/1ex190x/eli_lilly_nears_alltime_high_on_weight_loss/lj3ilt8/",
                  "created": 1724184787,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lj3n7s6",
                  "score": 0,
                  "body": "The government has to subsidize heavily antibiotic creation due to the lower incentive of non-chronic use. There are relatively few new antibiotics being developed, which is increasingly a problem due to antibiotic resistant microbes.",
                  "permalink": "/r/stocks/comments/1ex190x/eli_lilly_nears_alltime_high_on_weight_loss/lj3n7s6/",
                  "created": 1724186215,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lj3hof6",
          "score": 2,
          "body": "They said some did.  Shows 6% difference.",
          "permalink": "/r/stocks/comments/1ex190x/eli_lilly_nears_alltime_high_on_weight_loss/lj3hof6/",
          "created": 1724184501,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj3nh91",
          "score": 1,
          "body": "Anyone have a link the study? Was it random who came off the drug or everyone? Otherwise seems like survivorship bias (e.g. ppl who didn’t do good with the drug, went off the drug and had bad effects.)",
          "permalink": "/r/stocks/comments/1ex190x/eli_lilly_nears_alltime_high_on_weight_loss/lj3nh91/",
          "created": 1724186298,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljbxey6",
      "score": 1,
      "body": "Crazy to think this is what’s driving the companies success.  Ig I’m not super surprised all in all",
      "permalink": "/r/stocks/comments/1ex190x/eli_lilly_nears_alltime_high_on_weight_loss/ljbxey6/",
      "created": 1724302065,
      "depth": 0,
      "replies": []
    }
  ]
}