{
  "title": "Opinion: move to machinery/metrology sector of microchips to avoid bubble/correction threat ",
  "score": 31,
  "selftext": "As new chips tech is constantly being developed like Nvidia Blackwell (200 billion transistors) and Amd Zen5 (8billion transistors) there’s upside to be had in the machinery sector, particularly smaller companies with dominance in memory (CAMT), and gate all around packaging (NVMI). Nova supplies every top ten chip manufacturer and has new gen machines being tested by top chip companies, mainly TSM, Intel, Nvidia, amd. CAMT has fewer top customers and high growth potential if they get one.  Both small companies entirely vital to all chip production but getting little to no mainstream attention. They both always beat earnings estimates. \n\nPositions: 775 NVMI avg buy price 178",
  "link_flair_text": "Discussion",
  "id": "1ex4nk5",
  "num_comments": 18,
  "created_utc": 1724182260,
  "permalink": "/r/wallstreetbets/comments/1ex4nk5/opinion_move_to_machinerymetrology_sector_of/",
  "comments": [
    {
      "id": "lj3aiwz",
      "score": 1,
      "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 5 months ago\n**Total Comments** | 9 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
      "permalink": "/r/wallstreetbets/comments/1ex4nk5/opinion_move_to_machinerymetrology_sector_of/lj3aiwz/",
      "created": 1724182264,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj3gxxa",
      "score": 8,
      "body": "I don't hate this idea.",
      "permalink": "/r/wallstreetbets/comments/1ex4nk5/opinion_move_to_machinerymetrology_sector_of/lj3gxxa/",
      "created": 1724184272,
      "depth": 0,
      "replies": [
        {
          "id": "lj3ks04",
          "score": 9,
          "body": "It makes sense. I'm in metrology and the company I'm at has a ton of contracts with the big players in our industry (not microchips). We basically can't keep up with growth and have a hard time finding qualified people to do the work. I can definitely see this being similar in other industries. It won't be a rocketship to the moon play, but it would likely lead to long term sustained growth.",
          "permalink": "/r/wallstreetbets/comments/1ex4nk5/opinion_move_to_machinerymetrology_sector_of/lj3ks04/",
          "created": 1724185463,
          "depth": 1,
          "replies": [
            {
              "id": "lj3uby1",
              "score": 5,
              "body": "So long AMAT is what you’re saying?",
              "permalink": "/r/wallstreetbets/comments/1ex4nk5/opinion_move_to_machinerymetrology_sector_of/lj3uby1/",
              "created": 1724188423,
              "depth": 2,
              "replies": [
                {
                  "id": "lj3v8q2",
                  "score": 3,
                  "body": "Yes but NVMI better. Their machines have a longer lifespan bc of an ai model that lets them be adapted to new kinds of chips. That’s why nvmi has all top chip customers and Amat only has some.",
                  "permalink": "/r/wallstreetbets/comments/1ex4nk5/opinion_move_to_machinerymetrology_sector_of/lj3v8q2/",
                  "created": 1724188716,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lj6910i",
              "score": 2,
              "body": "What company are you in? I'm looking for work in metrology and I'd like to know which places are hiring.",
              "permalink": "/r/wallstreetbets/comments/1ex4nk5/opinion_move_to_machinerymetrology_sector_of/lj6910i/",
              "created": 1724223900,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj3nem6",
      "score": 9,
      "body": "Makes sense in theory, but I don't love the pricing. NVMI is near its all-time high, up 95% this year, and has a 48 P/E. CAMT is off its ATH but still up about 100% in a year with a 50 P/E. So might be overstating it to say they're not getting any attention. \n\nDo they have a moat that makes them hard to compete with? Can they scale rapidly? What's behind your comment about CAMT's high growth potential? Things I'd dig into.",
      "permalink": "/r/wallstreetbets/comments/1ex4nk5/opinion_move_to_machinerymetrology_sector_of/lj3nem6/",
      "created": 1724186275,
      "depth": 0,
      "replies": [
        {
          "id": "lj3s3rj",
          "score": 5,
          "body": "That kind of proves the OP point though. These stocks are not on the front pages, but those in the know already buy them. So the question is, if retail will pick up at some point. As for the high pricing: It is. But this was true for Nvidia as well. And that simply went from high pricing on to a rally. Point is, if anybody wants to build more chips, they need those companies.",
          "permalink": "/r/wallstreetbets/comments/1ex4nk5/opinion_move_to_machinerymetrology_sector_of/lj3s3rj/",
          "created": 1724187720,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj3tg91",
          "score": 1,
          "body": "Per novas q2 report they will have enough production capacity by years end to accommodate their 1billion revenue plan. Also that’s about average pe in tech maybe even a little under. Also sugma is a big factor in addition to them both having a high buyout potential which would put them both to the moon.",
          "permalink": "/r/wallstreetbets/comments/1ex4nk5/opinion_move_to_machinerymetrology_sector_of/lj3tg91/",
          "created": 1724188143,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj61f97",
      "score": 3,
      "body": "NVMI is headquartered in Rehovat, Israel, which was built on the depopulated ruins of the ancient village of Zernuqa. It's like buying a company built on a Native American burial ground. Your calls will be cursed.\n\n\nAccording to Wikipedia:\nhttps://en.m.wikipedia.org/wiki/Zarnuqa\n\n\n>Zarnuqa was depopulated on 27–28 May by the Givati Brigade during the 1948 Arab–Israeli War. One account in Al HaMishmar described how a soldier fired with a Sten gun at three people (one old man, old woman and a child) and how the villagers were taken out from the houses and had to stay in the sun, in hunger and thirst, until they surrendered the weapons they claimed they did not have. They were then expelled towards Yibna. In total, six died and 22 were taken prisoners. The day after, the inhabitants returned and recounted that the Yibna villagers saw them as traitors. The Zarnuqa villagers saw their village being ransacked by Jewish soldiers and nearby settlers. They were expelled again and the houses were demolished the month after.[32]\n\n\n>The family of the Shaqaqi brothers, Fathi (one of the founders of the Palestinian Islamic Jihad) and the political scientist Khalil Ibrahim, was from Zarnuqa.[33] They fled in the face of rumours of massacres of Palestinians by Yishuv troops and expected to return after the hostilities ended. They were not permitted to come back.[5] Haidar Eid, Associate Professor at al-Aqsa University in Gaza, states that his parent were evicted from the village by members of the Haganah and Stern gang who told them: \"Leave your homes or we will kill and rape you\".[34]",
      "permalink": "/r/wallstreetbets/comments/1ex4nk5/opinion_move_to_machinerymetrology_sector_of/lj61f97/",
      "created": 1724219251,
      "depth": 0,
      "replies": [
        {
          "id": "lj68zmj",
          "score": 5,
          "body": "Bullish",
          "permalink": "/r/wallstreetbets/comments/1ex4nk5/opinion_move_to_machinerymetrology_sector_of/lj68zmj/",
          "created": 1724223874,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj85r4b",
          "score": 1,
          "body": "Humanities people trying to analyze a stock=fish climbing trees. 80% institutional ownership buddy. And aside from oil and slave built construction there’s not much Arab money in the investing world. You really think anyone’s gonna pull their money/not invest over that?",
          "permalink": "/r/wallstreetbets/comments/1ex4nk5/opinion_move_to_machinerymetrology_sector_of/lj85r4b/",
          "created": 1724255123,
          "depth": 1,
          "replies": [
            {
              "id": "lj9yyq4",
              "score": 1,
              "body": "Curses are as good at predicting stocks as any \"financial analysis\". If you are going to gamble, might as well do it with good karma.\n\n\n>80% institutional ownership\n\n\nLOL as if wall street analysts are any good at beating the S&P500",
              "permalink": "/r/wallstreetbets/comments/1ex4nk5/opinion_move_to_machinerymetrology_sector_of/lj9yyq4/",
              "created": 1724275256,
              "depth": 2,
              "replies": [
                {
                  "id": "lja2otb",
                  "score": 1,
                  "body": "Just say you’re an efficient market theory cuck already. And financial analysis got me to the level to buy 775 shares so sugma.",
                  "permalink": "/r/wallstreetbets/comments/1ex4nk5/opinion_move_to_machinerymetrology_sector_of/lja2otb/",
                  "created": 1724276461,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lj52ell",
      "score": 0,
      "body": "SOXS is about to rocket, wait until Friday or maybe next week. Play around NVDA earnings.",
      "permalink": "/r/wallstreetbets/comments/1ex4nk5/opinion_move_to_machinerymetrology_sector_of/lj52ell/",
      "created": 1724203843,
      "depth": 0,
      "replies": []
    }
  ]
}