{
  "title": "Alphabet share buyback & investing cash flow",
  "score": 48,
  "selftext": "Alphabet has the best 'value' benchmark among the Magnificent 7 from earning multiple perspective. Accordingly to past financial reports since '22, Alphabet has been dedicating almost 100% of its free cash flow in share buyback. \n\nThe number is huge considering that its net income in '22 is $60B, $73.8B for '23, and trailing 4 quarters is at $87.7B. Share buyback amounted to $59B, $62B, and most recently $63B.\n\nAlphabet uses free cash flow calculation as derived by \\[Cash flow from operation minus purchases in plants & equipment\\]. Numbers are compiled at [http://gotrader.xyz/](http://gotrader.xyz/)\n\nConsidering that we're now in the accelerated AI era since the launch of killer app ChatGPT back in late 22, there appears to be no slowing in share buyback. I was curious given the lackluster spending of AI equipment, since protecting Alphabet's moat (i.e., dominant position in search) is more important than share buyback.\n\nTake a look at investing cash flow. It's hovering at some $20B annually. One can presume these expenses are inclusive of its custom TPU accelerators (all other major tech companies use Nvidia's). Why don't Alphabet spend more on TPU purchases?\n\nWhat do you think?",
  "link_flair_text": "Company Discussion",
  "id": "1exkgbu",
  "num_comments": 27,
  "created_utc": 1724229478,
  "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/",
  "comments": [
    {
      "id": "lj989a8",
      "score": 9,
      "body": "They are going to spend $48 billion on AI infrastructure are they not?\n\nWhich I absolutely love.    They are going to have more capacity than anyone.   Which is the position you want to be in.\n\nThey are now the third largest data center chip designer and will take #2 before the end of the year.\n\nhttps://blog.svc.techinsights.com/wp-content/uploads/2024/05/DCC-2405-806_Figure2.png",
      "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj989a8/",
      "created": 1724266982,
      "depth": 0,
      "replies": [
        {
          "id": "ljbnasm",
          "score": 2,
          "body": "The outgoing CFO did mention in the latest earnings call that their next quarter will see capex no less than $12b. If so then yes it is $48b annualized. \n\nFrom an accounting standpoint, these numbers should be reflected in the investing cash flow section, which at this point is hovering around $20b.\n\nWe might see some increase in that number, but I guess some of that costs are meant for compensation to technical cloud expertise (i.e., salaries), so the amount spent for actual hardware purchase will be lesser.",
          "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/ljbnasm/",
          "created": 1724297270,
          "depth": 1,
          "replies": [
            {
              "id": "ljbroaz",
              "score": 2,
              "body": "correction: the $12B quarterly capex is reported under 'R&D' segment of cash flow, then yes we're in line with that approx $48B annual spend. To give a context, R&D spend for '22 and '23 were $39B and $45B.",
              "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/ljbroaz/",
              "created": 1724299229,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lja7oxb",
          "score": 3,
          "body": "Sick chart, but that's not really because they grew, it's because INTC cratered.  These bags are heavy.  Sorry nana!",
          "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lja7oxb/",
          "created": 1724278127,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj6on8h",
      "score": 30,
      "body": "One item I’d love to see as an investor is a significant reduction in stock based compensation. The dilution is annoying and quite the drag on these buybacks.\n\nLove the buybacks nonetheless.",
      "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj6on8h/",
      "created": 1724234118,
      "depth": 0,
      "replies": [
        {
          "id": "lj70vow",
          "score": 33,
          "body": "Why do you think the buybacks exist in the first place?  It’s so they can offer stock-based compensation (which they will always do so get used to it!).",
          "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj70vow/",
          "created": 1724240618,
          "depth": 1,
          "replies": [
            {
              "id": "lj7ce91",
              "score": -4,
              "body": "It is just a very dirty trick, they do the buybacks mostly to disguise the SBC.",
              "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj7ce91/",
              "created": 1724245408,
              "depth": 2,
              "replies": [
                {
                  "id": "lj7pq9u",
                  "score": 9,
                  "body": "If they pay that same fcf as dividend it's taxed. Share buybacks are a loophole to avoid dividend withholding tax",
                  "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj7pq9u/",
                  "created": 1724250098,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lj7m6fh",
              "score": -6,
              "body": "I get all of that. I’m a fairly conservative leaning person, but it could be tightened up if the SBC had equivalent tax implications as salary. \n\nThe company would then be motivated to not use SBC and use salary unless it was a start up company (which would need some prevision for tax purposes) \n\nThat would be in the best interest of the shareholders - most times. \n\nI’m still an idealist. Well a cynic… so a disappointed idealist. Just because I align with you that it likely won’t change, doesn’t mean I cannot see an ideal state. 🙂‍↕️",
              "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj7m6fh/",
              "created": 1724248901,
              "depth": 2,
              "replies": [
                {
                  "id": "lj7tf4u",
                  "score": 5,
                  "body": "What are you even talking about, SBC is taxed as normal income.\n\nNot to mention all other benefits to the company in paying in stocks that do not vest immediately as opposed to cash every month.\n\nUnless you just want to say that Alphabet should stop paying in RSUs and not make up for that in more cash. In which case you can watch Alphabet become worse than Intel in a year.",
                  "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj7tf4u/",
                  "created": 1724251282,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj886ly",
                      "score": -3,
                      "body": "SBC is taxed for the earner as income - but the company doesn’t pay their end of the income taxes is what I was saying.\n\nI understand retaining talent and motivating share price growth. But when is it too excessive… \n\nMerely a philosophical challenge to their and many’s status quo",
                      "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj886ly/",
                      "created": 1724255867,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lj7sm90",
          "score": 2,
          "body": "Depends, companies like Apple and Aflac for example do buybacks right.\n\nTheir share count goes down even with share based compensation.\n\nNow companies who do a large share based compensation and have buybacks but share count rises. That is bad for investors.",
          "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj7sm90/",
          "created": 1724251024,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj6ir1d",
      "score": 6,
      "body": "I would have to agree. I dont see anyone rivalling this company within the next 10 years.",
      "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj6ir1d/",
      "created": 1724230357,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj6s2zx",
      "score": -22,
      "body": "yes, unfortunately they give away soo many shares as compensation for the employees, that the amount of net buybacks is actually pretty low. I still like the company, but I would love if they kept the stock compensation in check",
      "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj6s2zx/",
      "created": 1724236143,
      "depth": 0,
      "replies": [
        {
          "id": "lj72sgv",
          "score": 18,
          "body": "Dumbest comment since I opened reddit today.",
          "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj72sgv/",
          "created": 1724241475,
          "depth": 1,
          "replies": [
            {
              "id": "lj7e0uc",
              "score": 9,
              "body": "Don’t worry, it will get worse.",
              "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj7e0uc/",
              "created": 1724246016,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj7vgfl",
              "score": -2,
              "body": "They're not wrong though... The impact of Google's buybacks are quite low because most of the shares they're buying back are just to offset share based compensation. \n\nDo employees actually prefer getting paid in shares instead of cash? It can be argued that it might be better to allow employees to opt to be paid cash instead of shares. Would help with recruiting and with reducing diluton.\n\nThen there's also the fact that Google's compensation is well above industry norms, which is an opportunity for them to fix.",
              "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj7vgfl/",
              "created": 1724251927,
              "depth": 2,
              "replies": [
                {
                  "id": "lj8nsxs",
                  "score": 8,
                  "body": "Some figures from Alphabet's 2023 annual report and their Q2 report this year:\n\nIn 2023 they spent 22,4 billions on stock based compensation expenses and 61,5 billions on repurchasing stock. In 2022 those figures were 19,4 and 59,3 respectively. This year they have spent 11,1 billions on SBC and 31,4 billions.\n\nThey are absolutely spending a lot on SBC, not arguing that. And it would be great if they could bring it down, which they have to some extent this (or at least it is levelling off). But it's not true that most of the buybacks are done to offset SBC. Alphabet spends roughly 3 times as much on buybacks as they do on SBC.",
                  "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj8nsxs/",
                  "created": 1724260691,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lj8eotj",
          "score": 9,
          "body": "You don't want employees - especially information workers - completely divorced from the performance of the company. Paying them more in cash does that. \n\nPaying them less overall is not going to work either.",
          "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj8eotj/",
          "created": 1724257887,
          "depth": 1,
          "replies": [
            {
              "id": "lj92z82",
              "score": -4,
              "body": "they already are one of the best company to work for, have I think more than 20 qualified applicants for every position open, and even with all that the turnover is less than 2 years (I think 1.1). Its the worse of both world, but the company is soo good they can afford that",
              "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj92z82/",
              "created": 1724265321,
              "depth": 2,
              "replies": [
                {
                  "id": "lj971ph",
                  "score": 3,
                  "body": "If Google didn't offer stock comp they'd lose a ton of talent",
                  "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj971ph/",
                  "created": 1724266598,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lj98odw",
          "score": 3,
          "body": "I am struggling with you are actually being serious here?\n\nI spend a lot of time on Reddit and this is easily the dumbest thing I have read this week.\n\nNo offense.",
          "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj98odw/",
          "created": 1724267115,
          "depth": 1,
          "replies": [
            {
              "id": "lj9s85t",
              "score": 1,
              "body": "Do you think they should increase thier stock based compensation plan?\n\nIts already eating over 30% of Google's free cash flow. I think its excessive, but you are free to disagree",
              "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj9s85t/",
              "created": 1724273142,
              "depth": 2,
              "replies": [
                {
                  "id": "lja0qqp",
                  "score": 4,
                  "body": "I think it is perfect right now and they should resume.\n\nTalent is critical.\n\nSo I want to see Google continue to lead the world in AI research.\n\nWe are seeing they have been the clear leader for well over a decade now.\n\nEvery single year for the last 10+ Google has lead in papers accepted at NeurIPS.\n\nMost years they took first and second as they use to break up DeepMind from Google Brain.\n\nNow they do together and the last one they had twice the papers accepted as next best.\n\nSo the SBC is working really, really well.\n\nIf you see them starting not to lead then you increase.  Otherwise status quo. \n\nYou do NOT stop what is working so well.",
                  "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lja0qqp/",
                  "created": 1724275829,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lj96jlc",
      "score": -7,
      "body": "Have you used perplexity.ai?  I havent used google since it came out.  Perplexity and many other ai company are creating browsers on top of open source browser projects.",
      "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj96jlc/",
      "created": 1724266441,
      "depth": 0,
      "replies": [
        {
          "id": "lj98yhq",
          "score": 11,
          "body": "Way, way too slow compared to Google.  Plus it does NOT have up to date info.\n\nI am speeding to the airport to pickup someone and need to know the terminal and gate.\n\nI type SW483 into Google and get exactly what I want.  Can't get the same with perplexity.ai.\n\nYou will never see an LLM replace search.",
          "permalink": "/r/stocks/comments/1exkgbu/alphabet_share_buyback_investing_cash_flow/lj98yhq/",
          "created": 1724267204,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ]
}