{
  "title": "Waymo now provides 100k weekly rides - 100% sequential growth from last quarter ",
  "score": 437,
  "selftext": "Alphabet’s Waymo said on Tuesday it had doubled its paid rides to 100,000 per week in just over three months as the autonomous ride-hailing firm expanded its areas of service and allowed more people to ride its robotaxis.\n\nWaymo, which has about 700 vehicles in its fleet, is the only U.S. firm operating uncrewed robotaxis that collect. The company opened its service to everyone in San Francisco in June without joining a waitlist while expanding its operations in metro Phoenix\n\nhttps://www.fastcompany.com/91176079/waymo-doubles-weekly-paid-robotaxi-rides-100000-three-months.\n\nIn 2023, Waymo completed a total of 700k rides. Their current annualized rate stands at 5 million rides.  \n\nIn January and February 2024, Waymo reported roughly 100k rides per month with a fleet of 250 vehicles, implying roughly **14.5 daily trips per vehicle** \n\nIn this same article, Waymo announced their current fleet size is 700. At 100k weekly rides, this implies roughly **20.4 daily trips per vehicle**\n\n",
  "link_flair_text": "Company News",
  "id": "1exmz7r",
  "num_comments": 170,
  "created_utc": 1724239101,
  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/",
  "comments": [
    {
      "id": "lj7i0ik",
      "score": 423,
      "body": "That's waymo than last quarter",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7i0ik/",
      "created": 1724247458,
      "depth": 0,
      "replies": [
        {
          "id": "ljapreu",
          "score": 21,
          "body": "Have my upvote and kindly get lost.",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljapreu/",
          "created": 1724284484,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj9ne6l",
          "score": 4,
          "body": "😂",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9ne6l/",
          "created": 1724271674,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj7n7ka",
      "score": 98,
      "body": "Imagine if this was Tesla. The stock would be up 30% on this news. \n\nGoogle has some amazing long term bets and is undervalued imo",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7n7ka/",
      "created": 1724249255,
      "depth": 0,
      "replies": [
        {
          "id": "ljcrjdx",
          "score": 5,
          "body": "Yes but monopolies and lawsuits",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljcrjdx/",
          "created": 1724320878,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj7470l",
      "score": 156,
      "body": "I honestly dont think the stock price currently reflects the potential of Waymo. Alphabet is going to make huge profits on Waymo worldwide in the future.",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7470l/",
      "created": 1724242090,
      "depth": 0,
      "replies": [
        {
          "id": "lj76u92",
          "score": 86,
          "body": "Robotaxi is a race to the bottom and once it gets ‘solved’ it will be easy to implement for large cap companies.\n\nJust like GPT-4 was a game changer and now everyone and their dog has an LLM that’s similar.\n\nWaymo won’t be able to expand globally faster than the technology is implemented by competitors.",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj76u92/",
          "created": 1724243201,
          "depth": 1,
          "replies": [
            {
              "id": "lj7abit",
              "score": 92,
              "body": "One big difference to LLMs would be regulation, Waymo is the first mover in terms of getting permits from cities, and Musk pisses off a lot of politicians. If Waymo is first to be licensed in many areas it could be a game changer. Lots of car companies are scaling back their autonomous driving programs and might be forced to license from Waymo (or Tesla or whomever else) in the future.",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7abit/",
              "created": 1724244605,
              "depth": 2,
              "replies": [
                {
                  "id": "lj8izmb",
                  "score": 26,
                  "body": "Can we just have better, more efficient public transit in large and mid-size cities countrywide?",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8izmb/",
                  "created": 1724259209,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj9lgqq",
                      "score": 9,
                      "body": "Exactly lol. Whenever people talk about the advantages of self driving I always chime in with \"Great idea. Maybe we could have things that take many people at once, you know that goes to the most popular destinations and costs a fraction of car ownership? We could call it something like transport for the public?\"",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9lgqq/",
                      "created": 1724271083,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lj9cm0a",
                      "score": 10,
                      "body": "At this point, they’re banking on AI electric cars coupled with AI street lights.",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9cm0a/",
                      "created": 1724268353,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lj8kj56",
                      "score": 18,
                      "body": "Good luck convincing Americans to vote for that. The personal vehicle transport is more sacred than the bible here.",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8kj56/",
                      "created": 1724259679,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljc1rgk",
                          "score": 3,
                          "body": "Most voting Americans (parents) want to a cheaper way to Uber their kid for cheaper whether or not still driving their own cars themselves.\n\nIt’ll work out.\n\nAnd then when the next generation is the voting majority that had this freedom of asking for a cheap autonomous car rather than asking their parents to drive them, forget it. It’s a gold mine.",
                          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljc1rgk/",
                          "created": 1724304442,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ljarwv5",
                      "score": 3,
                      "body": "This would be a better solution, but capitalism goes for profit, not quality of life.",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljarwv5/",
                      "created": 1724285264,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ljat7dd",
                      "score": 1,
                      "body": "Amen brother",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljat7dd/",
                      "created": 1724285731,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ljc4f3x",
                      "score": 1,
                      "body": "It's not a replacement for public transit, it's a replacement for personal car ownership. Especially if you can take public transit along popular routes but need cars occasionally.",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljc4f3x/",
                      "created": 1724305997,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ljbv5ml",
                      "score": 1,
                      "body": "But why? Small, autonomous, electric (powered by renewable energy) cars/pods that can go from point to point seem like a win-win that’s better for everyone than mass transit.",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljbv5ml/",
                      "created": 1724300917,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ljazubl",
                      "score": 0,
                      "body": "I really don’t think autonomous vehicles are going to replace public transportation. A taxi and a bus serve different purposes for different groups of people. Individuals who rely on public transportation are probably not the target market for a private self driving taxi.",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljazubl/",
                      "created": 1724288151,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljb04hd",
                          "score": 2,
                          "body": "I'm not advocating for full replacement just better, more accessible, better public opinion and investment for cheaper mass transit.",
                          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljb04hd/",
                          "created": 1724288254,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ljb1xnz",
                              "score": 1,
                              "body": "It’s a totally different conversation. Cheaper and better public transportation options can happen even if self driving taxi services become a reality at scale. \n\nUnfortunately, creating a better public transportation system that’s cheaper and more efficient is an extremely complicated task. Public transportation generally does not make a profit from its riders. A lot of the time the cost of operating a public transit service is subsidized by government dollars.",
                              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljb1xnz/",
                              "created": 1724288931,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ljb6pqm",
                                  "score": 1,
                                  "body": "How do other developed nations do it? Places like France, Japan, China, have better options for mass transit. Not everything needs to make a profit to be successful and useful. If it moves more people to their jobs, stores etc. it should be a net benefit to the overall local economy.",
                                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljb6pqm/",
                                  "created": 1724290732,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ljb96x8",
                                      "score": 2,
                                      "body": "First I want to clarify… we want the same thing. I work for a transportation company writing software for transit agencies.\n\nI actually already told you how other countries do it. Other countries have allocated more public funds to ensure better public transportation. It’s really that simple. \n\nSo, how do we get to a world where the US invests more in public transit to make it better? First our entire system of government needs fixed so policy makers actually make policy to pay for the improved services you are imagining. Considering that the US system of government and democracy is barely holding on … I’m not very optimistic about getting the bullet trains I want.",
                                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljb96x8/",
                                      "created": 1724291656,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lj8nur9",
                      "score": -6,
                      "body": "no, public transit is awful",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8nur9/",
                      "created": 1724260706,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lj7cwda",
              "score": 40,
              "body": "Completely different. You need X% market share for it to make sense to operate in a market, given the infrastructure (in market employees or support, space for parking to charge or clean the vehicles) and permit processing costs needed to run. It's not economical for many competitors to join late and operate with the left over scraps.",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7cwda/",
              "created": 1724245597,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj7u17l",
              "score": 28,
              "body": "I think with the way Waymo has approached self driving there is going to be an Atlantic Ocean sized moat for someone to repeat what they have done. Google has the mapping data, they have the hardware, they have the financial backing of Google to scale if and when they want to, and they have the undeniable lead on the AI itself. It's easy enough to get 90% of the way there, but are regulators going to approve something that is only 90% of the way there?\n\nMaybe someone will come along with a completely different approach that solves the same problem, but repeating what Waymo has done is not the same as creating another LLM especially when there are life and safety issues.",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7u17l/",
              "created": 1724251477,
              "depth": 2,
              "replies": [
                {
                  "id": "ljaix6a",
                  "score": -7,
                  "body": "The hardware is the car and that is provided by a third party.  Google has the mapping data which is getting cheaper and cheaper to create and they have the software which is getting easier and easier to make.",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljaix6a/",
                  "created": 1724282042,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lj8kc58",
              "score": 12,
              "body": "You're thinking the only monetization stream is driving. It's an app and a physical car. You have ads monetization space in both. You can sell services like tours, etc",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8kc58/",
              "created": 1724259620,
              "depth": 2,
              "replies": [
                {
                  "id": "ljatgmf",
                  "score": 3,
                  "body": "This is a fun thought experiment especially with a company like Google involved.  There could be a ton of unique revenue streams involved.\n\n‘I’m feeling lucky’ but for thai restaurants 😂",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljatgmf/",
                  "created": 1724285822,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lj8esmf",
              "score": 19,
              "body": "Huh? How is it easy to implement? You need an entirely custom hardware platform, and tens, if not hundreds of thousands of them. You need the infrastructure to store and maintain them. The mapping data, the application, the remote support.",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8esmf/",
              "created": 1724257920,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj7d0ej",
              "score": 9,
              "body": "But Waymo now has the large cap company of Google to help it scale. It’s not on its own anymore. If this does explode, Google will want to make sure their subsidiary is the one that takes up the largest market share and becomes a staple. That is money google would definitely invest in if it gets to stage where rapid expansion is needed quickly",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7d0ej/",
              "created": 1724245640,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj7r54u",
              "score": 8,
              "body": "Safety is a huge issue that won’t be ignored. No competitor can just throw their dick in the race and expect to be successful. Just look at Cruise. GM completely lost their contract with San Francisco because of one catastrophic incident. This isn’t low stakes like some LLM.",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7r54u/",
              "created": 1724250551,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj92yaa",
              "score": 3,
              "body": "Is The tech behind waymo open source/published?. With Ilm tech, the transformer model and innovations related to that were open sourced/published by Google and many people built off that.",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj92yaa/",
              "created": 1724265313,
              "depth": 2,
              "replies": [
                {
                  "id": "ljaqheu",
                  "score": 2,
                  "body": "It doesn’t matter.  It’s a processing bottleneck.",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljaqheu/",
                  "created": 1724284743,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lja7b8r",
              "score": 1,
              "body": "I agree with the point you're trying to make, but the waymo endgame plan is to license the tech to other operators.  Why spend billions in r&d when you can simply pay a licensing fee to waymo?",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lja7b8r/",
              "created": 1724277996,
              "depth": 2,
              "replies": [
                {
                  "id": "ljaqohs",
                  "score": -4,
                  "body": "Why spend a licensing fee to waymo and run your own fleet of Volvos when you can just purchase a fleet of teslas?",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljaqohs/",
                  "created": 1724284813,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljar958",
                      "score": 3,
                      "body": "Teslas self driving is light years behind Waymo and Cruise.  A distant third.",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljar958/",
                      "created": 1724285023,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljasinq",
                          "score": 0,
                          "body": "What do you think is the bottleneck for them?  It’s not hardware since they have the cars.  It’s not data since they have the data and are in a great position to improve the data.\n\nIt’s compute.  I’m not saying that robotaxi will be a huge boon for them either, I’m just saying that this industry will be a race to the bottom.\n\nIt’s like how one brand of scooters showed up in every city one year and the next year there were 3-5 brands.  That will be robotaxis except ‘maybe’ on a 2-3 year scale.  The hardware isn’t the bottleneck, the software isn’t the bottleneck, the regulation isn’t the bottleneck, the compute is.\n\nThis means Google, Uber, Tesla, Alibaba, BYD, and even Microsoft can all throw their hats in the ring in the next couple years followed up by local cab companies a couple years later.\n\nAll while competing with traditional cap companies.  You’re never going to get like 90% profit off of this so it’s not an exponential growth industry.\n\nGoogles cloud profits are way more important than the future of robotaxi because they make bank off that currently and will in the future too.",
                          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljasinq/",
                          "created": 1724285485,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ljb5mkx",
                              "score": 2,
                              "body": "I don’t see the scooters comparison at all. There was no regulatory hurdle to get a scooter share going. Or at least not a big one. You just needed some basic apps and capital to buy scooters. \n\nNew entrants are going to have to take years to prove their software is safe enough to do rides with hundreds of thousands of hours or real world data. I don’t think that’s as easy as just solving their ‘compute bottleneck’ as you’re putting it. \n\nMaybe I’m missing something that you see but basically everyone else in the self driving space has ducked up massively already and google just keeps moving forward without much drama. I think this is a harder problem than you are giving credit for and that plus Waymos headset is the moat. Really Tesla is the only other company that I think can throw their hat in the ring, and I’m sure they will at some point. But I’m not confident Tesla will breeze through the regulatory process.\n\nWhy do you not think the software is the bottleneck?",
                              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljb5mkx/",
                              "created": 1724290323,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ljbofh5",
                                  "score": 1,
                                  "body": "From 2025 and onwards software will never be the bottleneck for any concept.",
                                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljbofh5/",
                                  "created": 1724297764,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "ljbwwp3",
                                      "score": 1,
                                      "body": "Ehhhh, gonna have to agree to disagree there. Sounds you’re in the in 2 years human built software will be obsolete cause of AI camp which I am not in. But that’s a different discussion.",
                                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljbwwp3/",
                                      "created": 1724301803,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "ljbiumm",
                              "score": 1,
                              "body": "The software absolutely is the bottleneck, as well as the V&V. Software capable of safe autonomous driving at this scale is extraordinarily complex. It's taken them 15 years to build it and they've likely accumulated dozens of small advantages and institutional know-how in that time that will add up to an enormous moat. And as the sibling comment pointed out, just proving the safety requires a massive investment, it takes years and millions of miles of driving with a safety driver.\n\nThe best comparison is Google Search back in its early days. PageRank was a public paper. And everyone knew how to crawl and index the web. On the surface, with your line of thinking, it should have been a race to the bottom for search. Yet it wasn't, Google built up a huge moat over the others. Cruise and others are more like AltaVista. I think this is the likely outcome with any sufficiently complex system, small advantages from being the industry leader compound over time. And Waymo has been the industry leader for a long long time.",
                              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljbiumm/",
                              "created": 1724295401,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ljbps5e",
                                  "score": 1,
                                  "body": "There is no moat once another company starts self driving they will sell their services at a loss to gain market share.\n\nI use Google over Altavista because it’s a better product.  I don’t care about the product when it’s a cab I just want to get from point a to point b in a moderately clean vehicle\n\nWaymo is operating at a loss right now and competing with Uber and conventional taxis.\n By the time they start being profitable robotaxis will be solved and they will be competing with other companies in different markets that are doing it better with different models.\n\nIt doesn’t have to even happen in the next 5 years.  Tesla will solve robotaxi at some point in the future and Waymo won’t have the opportunity to be profitable because they will still be competing with traditional taxis in the meantime.  It’s also not something that users will be loyal to, they will be either price, time, or location sensitive.\n\nThere are already other robotaxi companies successfully doing trips in other cities for other companies.",
                                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljbps5e/",
                                  "created": 1724298359,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ljartvl",
              "score": 1,
              "body": "Is Waymo's tech open source? If not, it seems like they'd have a massive advantage over their competitors.",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljartvl/",
              "created": 1724285233,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljbrzp3",
              "score": 1,
              "body": "Uhhh that’s because most of that shit is built with ChatGPT. They’re literally openAI customers. This is like saying people are just gonna start copying Nvidia chips.",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljbrzp3/",
              "created": 1724299378,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj7dl4t",
              "score": -13,
              "body": "I think Waymo's bigger problem is their methodology for solving self driving is simply never going to scale to work on a nationwide level. It's only ever going to work in a few small geofenced areas (i.e. select big cities) due to the massive amount of data and programming that they need to do in each new area. Worse yet that data will need to be updated overtime as the roads/etc. change.\n\nYou're never going to be able to jump in a Waymo and ride from anywhere on the East coast to anywhere on the West coast.\n\nIMO too many companies trying to solve self driving are being way too laser focused on one tiny market (robotaxis) without looking at all the other economic opportunities for the technology, opportunities that simply won't work when the vehicle can only drive in a few tiny geo-fenced areas.",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7dl4t/",
              "created": 1724245855,
              "depth": 2,
              "replies": [
                {
                  "id": "lj7l97w",
                  "score": 15,
                  "body": "Most of the profit is concentrated in geographically small and distinct areas. Geofencing is an advantage as it avoids going into areas where the system knows it doesn't have adequate data. \n\nRobotic systems update orders of magnitude faster than human systems. If I hit a pot hole, no one else knows about it unless I call it in and other drivers are listening to the same traffic station I listen to. If a robot hits a pot hole, every other robot in the same fleet is updated in real-time. \n\nRobotic networks can tell each other when and where traffic is bad.\n\nCross country interstate driving is actually easier because of the uniform nature of the interstate highway system. The bots don't ever have to do city driving, just travel from one terminal on the outskirts to another and back. \n\nThat tech is on the road now. Regulation and insurance are the only hold ups.\n\nhttps://en.wikipedia.org/wiki/Self-driving_truck\n\nRobots don't fall asleep at the wheel, DUI, steal from the company, finish training and move to the competition, call in sick, or sexually assault passengers. \n\nThis is going to happen.",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7l97w/",
                  "created": 1724248588,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj7pf7q",
                      "score": 4,
                      "body": "Waymo also actually signals unlike my uber and lift drivers.\n\n\nI could see pairing up with a ride hailing service so when your destination is within an area you get driverless and when it goes beyond you get a driver. Easy enough. ",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7pf7q/",
                      "created": 1724249998,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj7qbey",
                          "score": 1,
                          "body": "Good point. Synergy improves service quality and profitably.",
                          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7qbey/",
                          "created": 1724250287,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lj7ep8l",
                  "score": 5,
                  "body": "I've been thinking that the first step should be to make trucks that go from one depot to another at uncomplicated highways.",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7ep8l/",
                  "created": 1724246266,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj7r2fz",
                      "score": 2,
                      "body": "There are many companies who are working on that and quite a few running loaded fully loaded semis right now on our highways",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7r2fz/",
                      "created": 1724250527,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj81gx4",
                          "score": 1,
                          "body": "Cool to hear.  \nIMO it makes much more sense than to navigate buzzy city streets.",
                          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj81gx4/",
                          "created": 1724253791,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lj7kt8y",
                  "score": 4,
                  "body": "I work in automotive, and companies are never going to make it profitable to go beyond geofenced areas. The problem is not the tech but the regulations.\n\nYou need to dump so much money in reviewing safety and cybersecurity that it's just not going to work.",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7kt8y/",
                  "created": 1724248436,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lj82z9n",
                  "score": 1,
                  "body": "The select few cities are where the money is for robot taxi. The rest can be left to FSD.",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj82z9n/",
                  "created": 1724254250,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lj7pblv",
                  "score": 1,
                  "body": "They're geofenced because they're still developing it, not because that's the only way it will ever work. They do still run test cars with drivers all around to train the general model. Their long term goal is both to run their taxis and license the tech broadly. They're doing both full self driving and driver assist.",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7pblv/",
                  "created": 1724249965,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lj99t84",
              "score": -3,
              "body": "Not just that but the sheer amount of money they have spent on it (not to mention the ongoing operational costs) means that even if they were doing 5m rides a week, it still won't be profitable.\n\nThere's also a large swathe of people (myself being one) who will never take a ride in a driverless car.\n\nIn fairness, I don't think they're doing Waymo to become the biggest robotaxi business in the world. It's a data and AI play.",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj99t84/",
              "created": 1724267474,
              "depth": 2,
              "replies": [
                {
                  "id": "lj9lt1l",
                  "score": 4,
                  "body": "Hard disagree. Waymo appeals to the most important demographic which is the female demographic who feel CONSIDERABLY safer with Waymo than Uber.\n\nBy extension it will include couples and then mass adoption. Costs will go down with scale",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9lt1l/",
                  "created": 1724271186,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj9mtim",
                      "score": 1,
                      "body": "The cars have cost an absolute fortune and I think you're vastly over estimating uptake. If this really bit in to that demographic, Uber and Lyft could easily finessed around it by offering a vetted service or female only rides. The advantage you think doesn't exist and I'd bet you the data now for Waymo passenger's isn't women who want to feel safe, it's male tech nerds who love to embrace new tech.",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9mtim/",
                      "created": 1724271498,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj9tcid",
                          "score": 1,
                          "body": "I live in SF and it's anecdotal but almost all my female friends use it over Uber\n\n\nNow can the average non tech female afford 2x the price Uber offers? Not sure.",
                          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9tcid/",
                          "created": 1724273482,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lja4nt6",
                              "score": 2,
                              "body": "SF is the single most tech savvy enclave of the western world. It's also sadly one of the craziest in terms of crime/drugs/homeless issues so I can see why that specific demographic in that specific city would lean towards it. \n\nIt's not representative of the USA whatsoever.",
                              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lja4nt6/",
                              "created": 1724277101,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ljbk31s",
                                  "score": 0,
                                  "body": "Same thing seems to be happening in Phoenix. What's the excuse there?",
                                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljbk31s/",
                                  "created": 1724295911,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lj85z5n",
          "score": 4,
          "body": "How much do you think it's worth today? Alphabet is a $2T stock, so unless you think Waymo is already worth hundreds of billions it's hard to know that it isn't being priced in.",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj85z5n/",
          "created": 1724255192,
          "depth": 1,
          "replies": [
            {
              "id": "lj9cofs",
              "score": -1,
              "body": "How much would you pay to have 100% share of the US taxi market? That is probably the approximate upper limit of what Waymo would be worth. \n\nNow back out fixed and variable costs, risks associated with getting sued / locked out of markets if your car runs somebody over, etc...\n\nI just don't think this business is worth very much, even if the technology ends up working. It is a rounding error compared to search, cloud, etc.",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9cofs/",
              "created": 1724268374,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj93c6x",
          "score": 3,
          "body": "Worldwide??  You joke\n\nWhere outside the US?\n\nEurope won't allow\n\nChina or India won't allow\n\nSo where?",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj93c6x/",
          "created": 1724265433,
          "depth": 1,
          "replies": [
            {
              "id": "lj9gljm",
              "score": 5,
              "body": "Everybody will allow with time, because this is inevitable. If it works, capitalism will force it to spread.",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9gljm/",
              "created": 1724269604,
              "depth": 2,
              "replies": [
                {
                  "id": "lja7ose",
                  "score": 5,
                  "body": "You have not seen the 'roads' in other countries outside US and Europe.",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lja7ose/",
                  "created": 1724278126,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljaf58k",
                      "score": 3,
                      "body": "Never mind how people drive in those countries... yikes...",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljaf58k/",
                      "created": 1724280719,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ljgbm1c",
                      "score": 1,
                      "body": "Well, that is another issue. Still, the market is all developed \n countries and the best parts of development.\n\nRoads where I live are not that good BTW, and pretty horrible in the capital specifically.",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljgbm1c/",
                      "created": 1724365326,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lj7bszt",
          "score": -7,
          "body": "At some stage Google **stopped highlighting the potential of Waymo in their quarterly reports**, that is a worrisome signal (specially in a company expert in burying projects).",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7bszt/",
          "created": 1724245183,
          "depth": 1,
          "replies": [
            {
              "id": "lj8pjky",
              "score": 3,
              "body": "Google just gave them another 5B. They are not giving up on them",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8pjky/",
              "created": 1724261227,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj8jfe5",
      "score": 45,
      "body": "After trying Waymo, I'll use it over Uber/Lyft any day\n\n1. It's cheaper\n2. It's really not that scary. What's scary is having an Uber driver texting and driving.\n3. I have experience with iffy Uber drivers/cars. Poor air conditioning. The driver not matching the profile. They can't speak the primary language (English where I live and work). They are texting & driving. I don't know how they are always \"5-star\" Uber drivers.\n4. Waymo cars are comfortable\n\n  \nI know Waymo/Robotaxis are not perfect. And with technology, perfection should always be the goal. But I'm just saying at this point, I already trust them more than human driven cars. \n\nHumans go over the speed limit, drive under the influence, don't know how to drive,drive irresponsibly etc.",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8jfe5/",
      "created": 1724259344,
      "depth": 0,
      "replies": [
        {
          "id": "ljc03nt",
          "score": 8,
          "body": "I really enjoy Waymo too, better than the cruise versions as well, but I sometimes don’t find it cheaper. I do a quick scan for Uber, Lyft, and Waymo before calling and maybe 20%-25% of the time Waymo is slightly cheaper. However, the guaranteed Jags and just doing whatever you want (on a phone call, just relax, etc) while on the ride is very nice. But once they do start to match the prices especially during off hours of Uber/Lyft I expect them to increase ridership more. But there are definitely those paying a premium for the nice car and not having to talk to a driver. \n\nMy only qualm is that it does sometimes stop suddenly at a yellow, it seems programed to not go through a yellow at all and i’ve had a couple quick halts there. But I agree the driving is pretty good",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljc03nt/",
          "created": 1724303505,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj74ahy",
      "score": 160,
      "body": "Bearish for Tesla tbh",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj74ahy/",
      "created": 1724242132,
      "depth": 0,
      "replies": [
        {
          "id": "lj7pqf5",
          "score": 53,
          "body": "More bearish for Uber than Tesla.",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7pqf5/",
          "created": 1724250099,
          "depth": 1,
          "replies": [
            {
              "id": "lj9duqk",
              "score": 1,
              "body": "Not unless you think there cannot be a couple competitors in a very big market",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9duqk/",
              "created": 1724268746,
              "depth": 2,
              "replies": [
                {
                  "id": "lj9qog3",
                  "score": 1,
                  "body": "Yeah but assuming Waymo will be much cheaper than a human driver they can immediately start reducing Uber’s margins until they have a competing product.",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9qog3/",
                  "created": 1724272673,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljachx0",
                      "score": -6,
                      "body": "There’s quite literally 0% chance Waymo or any Robotaxi is ever cheaper than “contractor” human drivers. \n\nUber is the dominant monopoly. It’s Lyft and Tesla that really suffer from Waymo becoming widespread.",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljachx0/",
                      "created": 1724279794,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljb5gde",
                          "score": 2,
                          "body": "Cost of human labor. Have you seen a Waymo at work? They are all over SF now.",
                          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljb5gde/",
                          "created": 1724290258,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lj79pm6",
          "score": -90,
          "body": "They use an entirely different type of self driving. Not quite an even comparison",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj79pm6/",
          "created": 1724244364,
          "depth": 1,
          "replies": [
            {
              "id": "lj7b54g",
              "score": 157,
              "body": "Hell yeah they do. One that doesnt work.",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7b54g/",
              "created": 1724244927,
              "depth": 2,
              "replies": [
                {
                  "id": "lj7ckyl",
                  "score": -50,
                  "body": "Waymo's approach will simply never scale to work nationwide. It takes WAY too long and requires constant updates as roads/etc. change. I don't see how Waymo ever recoups all the tens of billions pumped into it overtime with their current approach.\n\nWaymo can only ever be a robotaxi in a few tiny geographic areas, they can't diversify into other uses for self driving (which IMO will prove far more lucrative long term then a mere taxi service).",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7ckyl/",
                  "created": 1724245478,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj7d0ak",
                      "score": 80,
                      "body": "> It takes WAY too long and requires constant updates as roads/etc. change.\n\nOne might say this is the only way self driving will ever work.\n\n>Waymo can only ever be a robotaxi in a few tiny geographic areas,\n\nThis is how the majority of people live, and how the majority of people travel daily.",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7d0ak/",
                      "created": 1724245639,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj7jxsq",
                          "score": 35,
                          "body": "These guys thinking people take 3h rides in taxis, nah dude that gets super expensive so you take the bus, taxis are for local transportation.",
                          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7jxsq/",
                          "created": 1724248137,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lj8rj1i",
                      "score": 5,
                      "body": "Waymo only has to hit the top 20-30 cities in the US to capture the majority of the ride share market. Ride share is much more common in major metros than in the boonies. \n\nAs for \"other uses for self driving\". Who are you to say that? Who is to say Waymo can't develop an ADAS system like Tesla that can be deployed on legacy auto vehicles in partnership? It's a much simpler problem TBH.",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8rj1i/",
                      "created": 1724261833,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lj7hn3c",
                      "score": 17,
                      "body": "This is a cope. \n\nIt is blindingly cheap to offshore data entry and labeling for this sort of thing. Especially when you think about the manpower needed for that compared to the manpower needed to man a fleet of vehicles. \n\nDouble points if and when they get very specific trucking corridors brought online.",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7hn3c/",
                      "created": 1724247325,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lj8kuej",
                      "score": 9,
                      "body": "> Waymo can only ever be a robotaxi in a few tiny geographic areas,\n\nFacebook will only ever be a social media site at a few select Ivy League campuses",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8kuej/",
                      "created": 1724259775,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lj8dqus",
                      "score": 2,
                      "body": "How do you know that Waymo's tech without geofencing isn't as capable as Tesla's FSD? Maybe Waymo is using geofencing and lidar just to handle the edge cases where FSD would fail? I am not saying this is the case but just asking how are you so sure that this is not the case?",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8dqus/",
                      "created": 1724257593,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj8r1z8",
                          "score": 6,
                          "body": "Exactly. Tesla fanboys don't understand that Waymo geofences and generates high definition maps to increase reliability. If they wanted to remove those extra 9s of reliability like Tesla then they could. And their data collection is ramping up quite quickly now they are ramping up rides. So any much simpler camera only model will be copied quite easily.",
                          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8r1z8/",
                          "created": 1724261688,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lj8osqa",
                          "score": 0,
                          "body": "...because we know what tech both companies are using.",
                          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8osqa/",
                          "created": 1724260994,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lj8wekj",
                              "score": 1,
                              "body": "We don't know how capable Waymo's tech is without using geofencing.",
                              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8wekj/",
                              "created": 1724263309,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lj98il6",
                      "score": 1,
                      "body": ">tiny geographic areas\n\nI see them all over my tiny geographic area (Los Angeles). There's no market here",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj98il6/",
                      "created": 1724267063,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lj8pom2",
                      "score": -5,
                      "body": "I like how when you say something positive about tesla it's downvoted and called 'fanboy', but the people blindly downvoting aren't considered 'mindless anti-tesla' people somehow.\n\nThis guy is correct, Waymo will never be able to scale like Tesla.  That said, does this mean they won't be successful?  no, Waymo might just kick Tesla's ass in pop-dense areas for a long time, but eventually automation in every industry wins out, so an approach like Tesla's or similar will scale better, could take decades though.",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8pom2/",
                      "created": 1724261269,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj9fefi",
                          "score": 1,
                          "body": "Tesla refuses to use lidar or radar. Teslas Fsd suck compared to peers. *Shocked Pikachu face*",
                          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9fefi/",
                          "created": 1724269237,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lj7cm64",
              "score": 20,
              "body": "How it works is secondary to \"if\" it works.",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7cm64/",
              "created": 1724245491,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj7mgxp",
              "score": 16,
              "body": "I love down voting mindless Tesla fanboys.",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7mgxp/",
              "created": 1724248999,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj7nj6z",
              "score": 6,
              "body": "Yes a better, more successful form of self driving.",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7nj6z/",
              "created": 1724249369,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj8knc0",
              "score": 2,
              "body": "why was this downvoted mercilessly?  lol",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8knc0/",
              "created": 1724259715,
              "depth": 2,
              "replies": [
                {
                  "id": "lj8tnri",
                  "score": 1,
                  "body": "Delusional refusal to accept the facts.",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8tnri/",
                  "created": 1724262482,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lj7tw62",
              "score": 1,
              "body": "Damn...... Elmo bootlickers are in full force!",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7tw62/",
              "created": 1724251433,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj7qv1q",
      "score": 43,
      "body": "I use Waymo multiple times a week and I have to say I am extremely bullish. \n\nThe cars are driving advertisements. The product is excellent. It’s cheaper than Uber.",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7qv1q/",
      "created": 1724250462,
      "depth": 0,
      "replies": [
        {
          "id": "lj87fnn",
          "score": 14,
          "body": "Yeah people don’t realize how big the OOH advertising market is… they focus on the deal economics of rides without considering that. I know of several companies that spend 7-figures per quarter on Uber’s in-app ABM and are *happy* to do so based on the brand lift they get. Same with billboards. Waymo ads would be better than both…",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj87fnn/",
          "created": 1724255639,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj8r0j6",
          "score": 15,
          "body": "They can literally charge more than Uber right now just for the cool factor. We're in SF right now and as soon as we saw them, we had to get a ride.\n\n\nI would've priced that right into the business model. Bigger fares up front, roll them off as demand falls.\n\n\nI don't think they did, though, as the price has been essentially equal to or less than Uber plus tip.\n\n\nI fix luxury cars for a living and the tech impressed the fuck out of me. This company knows what the fuck is up- if they can successfully roll this into other cities with this level of execution, this is 100% the future.",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8r0j6/",
          "created": 1724261676,
          "depth": 1,
          "replies": [
            {
              "id": "ljbdpx3",
              "score": 1,
              "body": "If you’re scared of people, or foreign aggressive men as Uber drivers…might be worth more",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljbdpx3/",
              "created": 1724293374,
              "depth": 2,
              "replies": [
                {
                  "id": "ljbezox",
                  "score": 2,
                  "body": "It's absolutely worth more. It is essentially a 'professional driver' whereas Uber is all the smelly cabbies of old. Plus random old ladies and others that have decided to try the 'gig economy.'\n\n\nI don't normally rave about this kinda shit, but man, they got me. I'm a believer. People driving cars is dumb. It's going to go away.",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljbezox/",
                  "created": 1724293866,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljrqe25",
                      "score": 1,
                      "body": "Word dog sometimes the future is alright",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljrqe25/",
                      "created": 1724537117,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ljegl72",
          "score": 2,
          "body": "It works in San Fran now but how feasible is expansion across the States and outside the country?",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljegl72/",
          "created": 1724344245,
          "depth": 1,
          "replies": [
            {
              "id": "ljenr8i",
              "score": 3,
              "body": "I think there’s a lot of market on the west coast and central USA for sure. Some eastern cities might be harder currently with the older road networks. NYC or Boston, for example, I feel like would be a nightmare.\n\nIt’s going to take further advancement of the tech to get it to work in some of these other places too. But it doesn’t seem to be a stagnant product. Continuous innovation is a necessity to keep growing it and it definitely seems they want to trend that way. \n\nBy starting in Phoenix and SF I think they can gather a *lot* of data and largely improve moving forward. \n\nThe expansion into LA will be a big proving ground imo. If it works there then some of the more sprawling cities like Dallas and Houston become options. \n\nLas Vegas is another no brainer which I’m sure is around the corner. \n\nInternationally, there are a lot of large cities it would work well in. Seoul, any large Australian city, *some* Europe.\n\nI could definitely see some Italian or Hungarian taxi unions lighting these things on fire though if they infiltrate the wrong market. \n\nWhile certain markets may be impossible to penetrate, but I don’t think that would mean the product and brand isn’t sustainable — just not universal.",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljenr8i/",
              "created": 1724346452,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj74uq8",
      "score": 32,
      "body": "The daily trips per vehicle is truly impressive. Uber typically averages out 15-25 trips per day, and if people push it only slightly above 25 for 16 hours day. Curious to know the revenue of the segment, do OP have any numbers here?",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj74uq8/",
      "created": 1724242373,
      "depth": 0,
      "replies": [
        {
          "id": "lj76ah4",
          "score": 29,
          "body": "I have not seen anything published except them saying that these are 100k paid rides. Very roughly speaking, Waymo fares are priced similarly to Uber fares. I found some estimates of the average Uber ride in SF costing just above USD 20. Assuming a range between USD 15-25 for Waymo would result in monthly revenue of 6.5m - 10.8m, or annualized revenue run rate of  78 - 130m (very quick and dirty estimate). That’s only about 2% of Lyfts annual revenue, but of course Waymo is active in very few areas.",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj76ah4/",
          "created": 1724242975,
          "depth": 1,
          "replies": [
            {
              "id": "lj8d5jm",
              "score": 12,
              "body": "If a car costs lets say 100k to purchase and 25k per year to maintain (hopefully high estimates), 125k initial + 25k annual; 700 cars do your 75m/year, would we not be looking at 107k/car/year? \n\nWaymo might be paying off its car investment in 2 years, and making profit per car of 50k/year thereafter. This is of course discounting what I am sure is a large amount of computational costs to keep these things running. Kind of fun to think about. At some economy of scale it is profitable; but how profitable; and how quickly can google scale?",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8d5jm/",
              "created": 1724257408,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj79yxh",
              "score": 11,
              "body": "Thanks for checking up! Interesting numbers introduced for assumption. Definitely Waymoo will be small segment, but the scale-up potential is definitely there. I am very curious to see if these robotaxi will become profitable, I think it is odd the explosion of TSLA due to this. The global taxi market size is valued at USD 203B in 2022, so I mean, of course there can be carveout for robotaxis, but with this many players - I doubt we will see a single robotaxi company grabbing more than 10% of this (absolute best case scenario imo).",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj79yxh/",
              "created": 1724244466,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj70twr",
      "score": 83,
      "body": "Hmm I thought it would be way mo than that.   \n\nI'll see myself out.    Thanks.",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj70twr/",
      "created": 1724240594,
      "depth": 0,
      "replies": [
        {
          "id": "lj72odu",
          "score": 2,
          "body": "Mo money dawg!",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj72odu/",
          "created": 1724241425,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj761gj",
      "score": 13,
      "body": "Will Google spin them off? If not, will this have a major impact on their stock? After all, this is essentially their Robotaxi, albeit with much more *infrastructure* building requirements. How quickly can they scale this?",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj761gj/",
      "created": 1724242871,
      "depth": 0,
      "replies": [
        {
          "id": "ljal482",
          "score": 3,
          "body": "They could license the technology.",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljal482/",
          "created": 1724282818,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj8m515",
      "score": 6,
      "body": "That's a drop in the bucket compared to monsters numbers from Lyft and Uber. \n\nQuite frankly Google has the money, tech and manpower to nuke Lyft and Uber with bargain fare rates and higher number of robot cars vs lyft/uber's human ones. They could easily dominate the ride share market within the year if they commit their cash war chest at it. \n\nBut google's focus is all in on AI and fighting a War against MSFT. Waymo is still in beta prototype stages and we're years away from it being a cash cow.",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8m515/",
      "created": 1724260176,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj8dcu8",
      "score": 4,
      "body": "presumably with their userbase growing the answer is yes, but has their reliability improved? i know a  year or so ago there were concerns/articles where the cars were getting confused and would get stuck.\n\nthis is inevitably the future, with the only question being when (which is one part tech, and one part politics). uber/lyft being natural entrants into that market probably helps bring it sooner rather than later though given they won't be the political roadblock the traditional taxi industry would be trying to get laws passed to prevent it from taking off.",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8dcu8/",
      "created": 1724257471,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj8xtwa",
      "score": 3,
      "body": "Sometimes I see like 5 Waymos in a row waiting at a traffic light nowadays. Craycray.",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8xtwa/",
      "created": 1724263740,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj7br9a",
      "score": 5,
      "body": "So if I understand it we have fully autonomous taxis, that charge and make money. Why isn’t this bigger news and why isn’t it being rolled out to other cities/countries?",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7br9a/",
      "created": 1724245164,
      "depth": 0,
      "replies": [
        {
          "id": "lj9hz7g",
          "score": 3,
          "body": "Regulation and detailed city mapping needed",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9hz7g/",
          "created": 1724270024,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljoe2af",
          "score": 1,
          "body": "I think this is typical Google caution and lack of ambition. I totally believe it will work but Google is really good at failing to deliver a product because they're over thinking it.",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljoe2af/",
          "created": 1724488352,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj7bkt3",
      "score": 8,
      "body": "BUT ELoN HaS THe RObOtAXi.......\n\nYank yank....🤏",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7bkt3/",
      "created": 1724245097,
      "depth": 0,
      "replies": [
        {
          "id": "lj7cz5c",
          "score": -14,
          "body": "bro is a professional elon hater",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7cz5c/",
          "created": 1724245627,
          "depth": 1,
          "replies": [
            {
              "id": "lj7d8p0",
              "score": -8,
              "body": "Rent free",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7d8p0/",
              "created": 1724245726,
              "depth": 2,
              "replies": [
                {
                  "id": "lj7dday",
                  "score": -7,
                  "body": "bro is currently experiencing psychosis",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7dday/",
                  "created": 1724245775,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj7di72",
                      "score": -3,
                      "body": "Takes one to know one",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7di72/",
                      "created": 1724245826,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj7dlx1",
                          "score": -6,
                          "body": "bro really got me. Done did the no u",
                          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7dlx1/",
                          "created": 1724245863,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lj7e1cv",
                              "score": 2,
                              "body": "No yooooo",
                              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7e1cv/",
                              "created": 1724246021,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lj7e51w",
                              "score": 2,
                              "body": "Now kiss!",
                              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7e51w/",
                              "created": 1724246059,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lj7eb06",
                                  "score": 0,
                                  "body": "aight im in. let me ask first though: is psychosis contractible?",
                                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7eb06/",
                                  "created": 1724246120,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lj7syrz",
      "score": 3,
      "body": "This is very impressive.   Love to see them really scale out the service.\n\nIt is really all about scale.  Scale is how you dramatically lower the per mile cost and greatly increase your market.\n\nI believe we will get to a point where the per mile is cheaper than owning the car.\n\nThat is when the market really, really grows.\n\nThis is not about just replacing Uber or Taxis.  It is about a completely change in the behavior of people.",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7syrz/",
      "created": 1724251136,
      "depth": 0,
      "replies": [
        {
          "id": "lj936qz",
          "score": 1,
          "body": "Except costs scale almost linearly. I guess they get some discount for a large car or lidar order but I don't see where the scale matters except from a network effect.",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj936qz/",
          "created": 1724265385,
          "depth": 1,
          "replies": [
            {
              "id": "lj93oww",
              "score": 2,
              "body": "This type of service the cost is going to drop like a stone as you scale out.\n\nThey are going to automate just about everything possible.  That investment will drop cost a ton.\n\nYou are going to see cars handled a lot more like planes are handled today.\n\nWhere they are recycled over and over again.  You might see a car frame go 2+ million miles for example.\n\nYou are going to see them squeezing cost out endlessly over the next 20 years.\n\nYou will see them automate things like rotating tires and such.    The cars will drive themselves to the center to have it done.\n\nYou will see them change the cars over time to make automated things a lot easier to do versus what you have today.\n\nWHen you have a million plus cars you have a ROI to do things that nobody really has done before.\n\nBecause today the company that sells the car does not make any money from the sale.  Less than $200 on average.\n\nInstead they make their money from maintenance costs.  Where this is the opposite.  That is going to change the calculus like nothing before.",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj93oww/",
              "created": 1724265545,
              "depth": 2,
              "replies": [
                {
                  "id": "lj9gjym",
                  "score": 1,
                  "body": "Don't dealerships capture the majority of maintenance profits?\n\n waymo also has a high fixed because they need to remap any new area they expand to",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9gjym/",
                  "created": 1724269591,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lja1f5j",
                      "score": 2,
                      "body": "Yes.  The person selling the car makes basically nothing selling it.\n\nWhy cars need so much maintenance.  There is no incentive to change but the exact opposite.\n\nA robot taxi service completely changes the calculus of the industry.\n\nWe should see some amazing results.",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lja1f5j/",
                      "created": 1724276048,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lj9djsb",
                  "score": 0,
                  "body": "I guess I am going to disagree. I do think some scaling things (bringing new cities online) will get better, the cost of new customers will decrease (as long as Alphabet isn't broken up; the bundling into Google Maps would be insanely lucrative) I don't see the ROI on changing tires being worthwhile. The things you need people for, you will need them for regardless. \n\nI think the promise of automation is false. Look at Tesla, they wanted to fully automate, then they realized it's not a thing for a reason. It's extremely complex. And automation takes space, which is at a premium in a Waymo area. A garage can fix anything. A tire changing bay is a one trick pony especially since you might only have a few thousand cars in an area.",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9djsb/",
                  "created": 1724268649,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj9etby",
                      "score": 2,
                      "body": "These things will be a heck of a lot easier to automate.\n\nBut the biggest savings with be the cars and how they are handled like planes today.\n\nThis type of business is all about scale.  The cost just does not work without scale.\n\nThe most obvious one is the cost of the software if far less per car when you have a ton of cars.\n\nDo not really think it is very complicated.\n\nBTW, it is not about replacing Uber or taxis.  It is about scaling out triggering a big enough reduction in cost to make it far cheaper to use a Robot taxi than owning your own car.\n\nThat is when the market gets really, really big.",
                      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9etby/",
                      "created": 1724269052,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lj8djax",
      "score": 2,
      "body": "RemindMe! 5 years",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8djax/",
      "created": 1724257526,
      "depth": 0,
      "replies": [
        {
          "id": "lj8dpg7",
          "score": 1,
          "body": "I will be messaging you in 5 years on [**2029-08-21 16:25:26 UTC**](http://www.wolframalpha.com/input/?i=2029-08-21%2016:25:26%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8djax/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1exmz7r%2Fwaymo_now_provides_100k_weekly_rides_100%2Flj8djax%2F%5D%0A%0ARemindMe%21%202029-08-21%2016%3A25%3A26%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201exmz7r)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8dpg7/",
          "created": 1724257580,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj8fm6h",
      "score": 3,
      "body": "Tesla no where to be seen.",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8fm6h/",
      "created": 1724258174,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj8i1yu",
      "score": 1,
      "body": "Is it any cheaper than Lyft or Uber?",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8i1yu/",
      "created": 1724258924,
      "depth": 0,
      "replies": [
        {
          "id": "lj8jknl",
          "score": 1,
          "body": "In my experience, yes. But also, where I was, it only drives within the city. It would not take you on the highway.",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8jknl/",
          "created": 1724259388,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj9a6hw",
          "score": 1,
          "body": "From what I've observed, it depends on supply/demand. Sometimes it's cheaper, and sometimes it's more expensive. At least in Phoenix, they seem to target their prices close to Lyft and Uber.",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9a6hw/",
          "created": 1724267590,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj9j1rc",
      "score": 1,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9j1rc/",
      "created": 1724270347,
      "depth": 0,
      "replies": [
        {
          "id": "lj9mzsw",
          "score": 2,
          "body": "There are some subtle differences between the two that you can look up, but for normal people buying Google it really doesn’t matter, pick either one",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9mzsw/",
          "created": 1724271553,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lja1arw",
      "score": 1,
      "body": "Just waiting for GoogleEats and then Uber will disappear overnight",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lja1arw/",
      "created": 1724276009,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljamhg9",
      "score": 1,
      "body": "That’s like waymo rides than before! 🚘",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljamhg9/",
      "created": 1724283310,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljap0qg",
      "score": 1,
      "body": "Friendship ended with exponential, now sequential is my best friend",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljap0qg/",
      "created": 1724284219,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj7azb4",
      "score": 1,
      "body": "Sounds great, I wonder if they'll continue scaling up to more cities and maybe even different countries, or will they use this a way to sell their tech to other companies. A lot more to figure out if they go worldwide but things are looking good.",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7azb4/",
      "created": 1724244866,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj7n0hh",
      "score": 1,
      "body": "What is Cruise up to now",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7n0hh/",
      "created": 1724249185,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj8jkyx",
      "score": 1,
      "body": "Did the fix the parking lot issue?\nhttps://abc7news.com/post/waymo-responds-honking-vehicles-san-francisco-parking-lot-after-abc7-news-report/15183779/",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8jkyx/",
      "created": 1724259390,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj7mcae",
      "score": 0,
      "body": "Meanwhile musk postpones robotaxi yet the stock pumps all the time.",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7mcae/",
      "created": 1724248956,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj7myts",
      "score": -8,
      "body": "The issue with Waymo is that they have to literally start over every single time they want to go to a new city. Their method of self driving requires learning a city from the ground up.\n\nTesla's approach to self driving is teaching a car how to **see** and drive, not just what to do at the cross streets of Chestnut and Filmore in San Francisco.",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7myts/",
      "created": 1724249168,
      "depth": 0,
      "replies": [
        {
          "id": "lj9suhg",
          "score": 1,
          "body": "Two different use cases right? Tesla is still pretty far behind on self driving being fully usable but waymo is already at a production level. \n\nI guess scale is what's needed to be profitable but if waymo focuses on big cities it's probably not too bad.",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj9suhg/",
          "created": 1724273330,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljalo36",
          "score": 1,
          "body": "That's the idea except Tesla can't do either. Will it ever? Who knows.",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljalo36/",
          "created": 1724283016,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj7ohpe",
      "score": 0,
      "body": "Cars are the solution to the car problem. What a farce.",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7ohpe/",
      "created": 1724249692,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj7bgrl",
      "score": -8,
      "body": "This thing will never be profitable. It's nothing but R&D on wheels.",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7bgrl/",
      "created": 1724245054,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj7kwph",
      "score": -1,
      "body": "Wowza",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7kwph/",
      "created": 1724248469,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj7ge7u",
      "score": -6,
      "body": "Self driving is a money pit. Hard pass from me.",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7ge7u/",
      "created": 1724246874,
      "depth": 0,
      "replies": [
        {
          "id": "lj7kgd4",
          "score": 5,
          "body": "all the easy problems are already solved... if you want to make money you have to solve the hard problems.\n\nSomeone is going to solve this problem and become incredibly successful... there will be countless failed companies on the way though.",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7kgd4/",
          "created": 1724248315,
          "depth": 1,
          "replies": [
            {
              "id": "lj7qnay",
              "score": -4,
              "body": "Why are we even trying to solve this problem for cities? The best most liveable cities are walkable/good public transport/ good cycling infrastructure. Self driving in these places would be prohibitively expensive to even attempt to solve.\n\n\nIt would make much more sense to focus on highway only, fewer variables and you can actually attain L4/5 and would have a lot of commercial use cases",
              "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7qnay/",
              "created": 1724250393,
              "depth": 2,
              "replies": [
                {
                  "id": "lj7sa2c",
                  "score": 3,
                  "body": "You can do both",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7sa2c/",
                  "created": 1724250914,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lj7sc8y",
                  "score": 1,
                  "body": "you must not live in the US. Our city's public transport are shit compared the europe and lots of asia.\n\nMy guess is that the math works out that making cars self driving would be easier/cheaper than revamping the infrastructure and building more dense housing.",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj7sc8y/",
                  "created": 1724250934,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lj8c8hq",
                  "score": 1,
                  "body": "Some Metro areas that are very walkable are huge, also in markets with poor public transportation (like most the large cities i.e Dallas) this will be a huge success. \n\nCities like Dallas, Houston, and Atlanta are huge and are not walkable. People rely on the very limited bus and train transport or Uber/Taxis. \n\nPaying a few people to keep up to date mapping is way cheaper than paying hundreds of drivers.",
                  "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/lj8c8hq/",
                  "created": 1724257123,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ljav79t",
      "score": -3,
      "body": "Why isn’t anyone questioning the data?\nThe company is saying that they have 700 cars doing an average of more than 20 rides per car/ per day….\n\nAnd it’s the company self reporting….\n\nWhat if it’s bullshit? Fraud similar to the US jobs data of the last 8 months or 15 fucking years\n\nDo you damn bots and actual humans, see this many waymo cars ?\nAre they driving this much? Moving this amount on the roads?\n\nWhy doesn’t anyone question the data? Or information",
      "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljav79t/",
      "created": 1724286453,
      "depth": 0,
      "replies": [
        {
          "id": "ljc0sly",
          "score": 3,
          "body": "How do you know that this isn’t just a simulation and that reality doesn’t exist as you know it?",
          "permalink": "/r/stocks/comments/1exmz7r/waymo_now_provides_100k_weekly_rides_100/ljc0sly/",
          "created": 1724303894,
          "depth": 1,
          "replies": []
        }
      ]
    }
  ],
  "stockTickers": {
    "post_summary": "Waymo has doubled its weekly paid rides to 100,000 in three months, expanding its autonomous ride-hailing operations.",
    "companies": [
      "Waymo",
      "Alphabet"
    ],
    "tickers": [
      "GOOGL"
    ],
    "main_ticker": [
      "GOOGL"
    ]
  },
  "sentimentAnalysis": {
    "post_summary": "Waymo has doubled its weekly paid rides to 100,000 by expanding services in San Francisco and Phoenix.",
    "stock_recommendations": "The post does not recommend buying or selling any stocks.",
    "is_recommending_stock_buying_or_selling": false,
    "buy_or_sell": null,
    "sentiment_summary": "The sentiment is neutral as the post provides an update on Waymo's growth without recommending any stock trades.",
    "sentiment": "neutral"
  }
}