{
  "title": "Macy’s cuts sales forecast as department stores struggle to draw shoppers ",
  "score": 53,
  "selftext": "Macy’s cut its full-year sales forecast Wednesday, as the department store operator said it is contending with selective shoppers and more promotions.\n\nThe retailer posted a mixed quarter, as it topped Wall Street’s earnings expectations but missed on revenue.\n\nMacy’s said it now anticipates net sales of between $22.1 billion and $22.4 billion, which is lower than the $22.3 billion to $22.9 billion range it had previously anticipated. That also would be a year-over-year decline from the $23.09 billion it reported in fiscal 2023.\n\nMacy’s expects comparable sales, which take out the impact of store openings and closures, to range from a decrease of about 2% to a decline of about 0.5%. It had previously expected comparable sales to range from a decline of about 1% to a gain of 1.5%. That metric includes owned and licensed sales, which encompasses merchandise that Macy’s owns and items from brands that pay for space within its stores, along with Macy’s third-party online marketplace.\n\nThe department store operator said in a news release that the new outlook range “gives the flexibility to address the ongoing uncertainty in the discretionary consumer market.”\n\nHere’s what Macy’s reported for the fiscal second quarter compared with what Wall Street expected, based on a survey of analysts by LSEG:\n\nEarnings per share: 53 cents adjusted vs. 30 cents expected\n\nRevenue: $4.94 billion vs. $5.12 billion expected\n\nShares fell about 8% in premarket trading.\n\nThe iconic department store is pushing to get back to steadier footing and sustained growth. Spring announced in February that the retailer would shutter about 150 – or nearly a third – of its namesake stores and invest in the roughly 350 locations that remain. It plans to close the locations by early 2027. \n\nIt is also opening new, smaller Macy’s stores in suburban strip malls and adding new locations of its better-performing brands, Bloomingdale’s and Bluemercury.\n\nYet Macy’s results in the recent quarter revealed its struggles to pull off that comeback at a time when consumers have been pickier about purchases – especially items that are wants rather than needs. \n\nNet sales fell from $5.13 billion in the year-ago period.\n\nThe namesake Macy’s brand continued to be the company’s weakest performer. Comparable sales fell 3.6% on an owned-plus-licensed basis, including the third-party marketplace. \n\nAt Bloomingdale’s, comparable sales declined 1.4% on an owned-plus-licensed basis, including the third-party marketplace. And Bluemercury comparable sales rose 2%, marking the 14th consecutive quarter of comparable sales growth for the beauty brand.\n\nIn the three-month period that ended Aug. 3, Macy’s net income was $150 million, or 53 cents per share, compared with a loss of $22 million, or 8 cents per share, in the year-ago period.\n\nMacy’s stressed it has made progress in its turnaround plan, which it unveiled in February soon after Spring stepped into the company’s top role. At the first 50 of its stores to get additional investment, comparable sales were up 1% on an owned-plus-licensed basis. It marked the second consecutive quarter of positive comparable sales at those stores since the plan started.\n\nYet even when excluding the weaker stores that Macy’s is shutting, sales were lackluster. Comparable sales for its go-forward namesake brand – which includes the Macy’s stores that will remain open and online sales – declined 3.3% on an owned-plus-licensed basis, including the third-party marketplace. \n\nAlong with a choppy sales environment, Macy’s leaders had also faced a bid by an activist group to take the company private. Macy’s said last month that its board had unanimously decided to end negotiations with Arkhouse Management and Brigade Capital.\n\nShares of Macy’s closed on Tuesday at $17.74, bringing the company’s market cap to $4.9 billion. As of Tuesday’s close, the company’s stock is down about 12% so far this year. That trails behind the approximately 17% gains of the S&P 500 during the same period.\n\nSource: https://www.cnbc.com/2024/08/21/macys-m-q2-2024-earnings.html",
  "link_flair_text": null,
  "id": "1exmsk9",
  "num_comments": 32,
  "created_utc": 1724238464,
  "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/",
  "comments": [
    {
      "id": "lj6zs39",
      "score": 31,
      "body": "They are all shopping at Target",
      "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj6zs39/",
      "created": 1724240102,
      "depth": 0,
      "replies": [
        {
          "id": "ljaih4f",
          "score": 4,
          "body": "Target and walmart have groceries.\n\nMacy needs groceries to compete.",
          "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/ljaih4f/",
          "created": 1724281885,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljc8bth",
          "score": 1,
          "body": "My mom got all of her clothes and ours from Macy’s and Nordstrom when we were kids \n\nMy wife and all her friends shops all her and the kids clothes from idk what online sites but apparently they are better and she’s happy.",
          "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/ljc8bth/",
          "created": 1724308398,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj71m8s",
      "score": 28,
      "body": "I think about Macy’s only one time a year.",
      "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj71m8s/",
      "created": 1724240953,
      "depth": 0,
      "replies": [
        {
          "id": "lj72fe5",
          "score": 10,
          "body": "I honestly barely even think about them at Christmas.  I don't understand the point of going there when I can see the exact same selection at kohls and other generic store at the mall.",
          "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj72fe5/",
          "created": 1724241314,
          "depth": 1,
          "replies": [
            {
              "id": "lj7bwfz",
              "score": 11,
              "body": "I was thinking more along the lines of Thanksgiving because of the parade.",
              "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj7bwfz/",
              "created": 1724245220,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj81us8",
              "score": 6,
              "body": "Macy's is just one of many old retail stores that I don't understand how they haven't gone out of business already.\n\nThere's not a thing I could ever conceivably need to buy that would make me say to myself \"I'm going to go to Macy's for that\". My first, second, and third thought on where to go will always be one of Amazon, Costco, Walmart, and/or Target, unless it's something particularly niche (like say a computer part), in which case I'll go to a specialty store or website, not Macy's. \n\nI'd probably be more likely to walk into a Macy's if it had a different name on the store that I had never heard of and I was curious as to what they sold.",
              "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj81us8/",
              "created": 1724253909,
              "depth": 2,
              "replies": [
                {
                  "id": "ljap1bu",
                  "score": 2,
                  "body": "I imagine their higher end “anchors” in places like NYC are keeping them in the game.\n\nUnless you’re going to a “anchor” somewhere like New York, Chicago or LA there isn’t any reason to go there, IMO.",
                  "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/ljap1bu/",
                  "created": 1724284225,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ljaos67",
              "score": 1,
              "body": "In all fairness, when Macys has sales they’re pretty good. That’s about the only time it’s worth it though.",
              "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/ljaos67/",
              "created": 1724284135,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj76m8g",
      "score": 26,
      "body": "Macys sells 22 something billion a year? How is that even possible?",
      "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj76m8g/",
      "created": 1724243110,
      "depth": 0,
      "replies": [
        {
          "id": "lj79nta",
          "score": 6,
          "body": "Yeah,  that was my first thought as well lmao",
          "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj79nta/",
          "created": 1724244343,
          "depth": 1,
          "replies": [
            {
              "id": "ljd68sh",
              "score": 1,
              "body": "Same lol",
              "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/ljd68sh/",
              "created": 1724328453,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj70umc",
      "score": 12,
      "body": "I don’t know anyone under 40 who goes to Macys. Some of it may be cultural. There’s definitely younger black and Hispanic shoppers, but they seem to have completely lost certain target markets.",
      "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj70umc/",
      "created": 1724240604,
      "depth": 0,
      "replies": [
        {
          "id": "lj7beu0",
          "score": 4,
          "body": "i do lol but i also like most things older people like tooo lol. It's a good mid range store with good prices with coupons and clearance.",
          "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj7beu0/",
          "created": 1724245033,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj72gmq",
      "score": 3,
      "body": "Macy's bonds --> [https://www.junkbondinvestor.com/p/macys-buyout-buzz-breaking-down-the](https://www.junkbondinvestor.com/p/macys-buyout-buzz-breaking-down-the)",
      "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj72gmq/",
      "created": 1724241329,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj7fbij",
      "score": 3,
      "body": "They should bring in DJs.",
      "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj7fbij/",
      "created": 1724246491,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj7usu6",
      "score": 3,
      "body": "How do people here feel about Nordstrom compared to Macy’s? Nordstrom reports earnings on Tuesday.",
      "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj7usu6/",
      "created": 1724251721,
      "depth": 0,
      "replies": [
        {
          "id": "lj8dpsg",
          "score": 4,
          "body": "Nordstrom is doing quite well. Mostly because of their Rack outlets",
          "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj8dpsg/",
          "created": 1724257584,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj7fb2g",
      "score": 8,
      "body": "I can't understand how Macy's is still in business.\n\nTheir stores are massive and the associated costs for lighting, HVAC, maintenance, etc must be significant. Every time I walk through the Macy's at my local mall - I park at Macy's because their parking lot is always empty - it's completely dead. Far more workers than customers, perfume salespeople just standing around, cashiers looking busy, etc. And their prices are extremely high! It seems to me like they should have gone away 5 years ago.",
      "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj7fb2g/",
      "created": 1724246486,
      "depth": 0,
      "replies": [
        {
          "id": "lj7uomk",
          "score": 6,
          "body": "In spite of that their net income is $50m a month.",
          "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj7uomk/",
          "created": 1724251684,
          "depth": 1,
          "replies": [
            {
              "id": "lj7v88d",
              "score": 3,
              "body": "I absolutely do not understand 🤷‍♂️",
              "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj7v88d/",
              "created": 1724251856,
              "depth": 2,
              "replies": [
                {
                  "id": "lj7we7i",
                  "score": 4,
                  "body": "Imagine how they’ll perform once FED cuts the rate and people begin to worry less about how expensive everything is. \nPeople have been saying for decades how brick and mortar is dying, especially department stores. Some have died but many have endured and honestly to me it seems Macy’s will survive for a long time still. I don’t know.. personally I feel like I’m on my phone so much (for Reddit, YouTube etc) that it’s too exhausting to also do shopping on my phone. Like, I can use my phone for everything if I want to- get groceries, take away, clothes etc. But it’s a nice change of pace to do some of them without my phone. If that makes sense. Maybe that’s why stores like Macy’s survive- people go there to make a trip. Something to do to get off their phones.",
                  "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj7we7i/",
                  "created": 1724252220,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj8s8l9",
                      "score": 5,
                      "body": "I definitely get that tech exhaustion. I've always hated shopping and would always buy most things except groceries online. \nLately, I've just sick of spending so much time on my phone/laptop that it feels  almost enjoyable to buy something in a store ",
                      "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj8s8l9/",
                      "created": 1724262051,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lj7dojc",
      "score": 4,
      "body": "TIL that Macys is still around.\n\nTo be fair, the only time I go near the mall is passing through on the way to the doctors office. I sometimes stop at the B&N and buy a book, but they are a stand alone store, so I don’t actually have to go in the mall.",
      "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj7dojc/",
      "created": 1724245890,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj8deo5",
      "score": 2,
      "body": "People who bought calls are out of their mind. Every Macys I've been into in recent months has been an absolute graveyard. I go there and walk around sometimes just because it's so quiet. Literally like Zero employees or customers. Would've bought puts but I forgot.",
      "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj8deo5/",
      "created": 1724257487,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj71z7s",
      "score": 1,
      "body": "I used to go take a look at clearance racks every so often, but now even those prices are laughable.",
      "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj71z7s/",
      "created": 1724241114,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljbu66m",
      "score": 1,
      "body": "Macys has been struggling for a long time",
      "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/ljbu66m/",
      "created": 1724300424,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljc8ep3",
      "score": 1,
      "body": "Maybe its just that macy’s sucks",
      "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/ljc8ep3/",
      "created": 1724308447,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljds060",
      "score": 1,
      "body": "It’s only a matter of time before Macy joins Radio Shack and Kmart in retail purgatory",
      "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/ljds060/",
      "created": 1724336564,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj77ono",
      "score": 0,
      "body": "Macys just shut down already.",
      "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj77ono/",
      "created": 1724243548,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj83vla",
      "score": 0,
      "body": "Everything is made in china.",
      "permalink": "/r/stocks/comments/1exmsk9/macys_cuts_sales_forecast_as_department_stores/lj83vla/",
      "created": 1724254538,
      "depth": 0,
      "replies": []
    }
  ]
}