{
  "title": "How does this make sense in the spirit of cost cutting?",
  "score": 350,
  "selftext": "The new Starbucks CEO is supposedly going to be commuting from California to Seattle everyday : https://www.cnbc.com/2024/08/20/starbucks-new-ceo-brian-niccol-will-supercommute-to-seattle-instead-of-relocating.html \n\nGiven that cost cutting is going to be one of his  goals as he joins as the new CEO, how does help? Won't it be orders of magnitude cheaper for him to relocate and won't it be better for company/employee morale to have the CEO work out of HQ?",
  "link_flair_text": "Company Question",
  "id": "1exqg1q",
  "num_comments": 174,
  "created_utc": 1724248973,
  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/",
  "comments": [
    {
      "id": "lj7ncnf",
      "score": 407,
      "body": "I mean you know it is do what I say not what I do when it comes to executives right?\n\nHow did his $10M Signing bonus fit in with cost cutting?\n\nAlso, btw, the entire cost cutting strategy needs to be reevaluated as that is probably a reason customers have moved away. Been inside a starbucks recently? What unfriendly and uninviting places they have become.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7ncnf/",
      "created": 1724249303,
      "depth": 0,
      "replies": [
        {
          "id": "lj7rr2m",
          "score": 150,
          "body": "Cost cutting when done correctly is fine (i.e. through increased efficiency). Cost cutting when it comes to quality is generally a short sighted move. \n\nStarbucks has a deeper issue in that whole premise they were founded on (the 3rd place) died with mobile ordering. I'll pay $6 for a quality drink and nice cafe/patio, but not to pick up a coffe as I walk to work. The success of mobile ordering destroyed the brand, so its a big problem to tackle. \n\nThey also have to contend with customers realizing so many of their products are effectively a diabetes laced dessert, not coffee. \n\nMy guess is he'll simplify the menu, close some stores (I have 4 within a half mile of me - in a city but still) as a starting point, but he needs to contend with this \"Premium Brand but non-premium product\" vision. \n\nAs far as his bonus fitting, well if he delivers, its worth it. He had a strong track record between Taco Bell and Chipotle",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7rr2m/",
          "created": 1724250746,
          "depth": 1,
          "replies": [
            {
              "id": "lj89j9d",
              "score": 31,
              "body": "Same problem with Target, being a better shopping experience than Walmart is what made them but now online shopping options are harming the in-store experience while still being substandard compared to Amazon/Walmart and killing margins. I’m wondering when companies will just give up and lean back into the physical experience vs chasing the online market they’ll never win long term.",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj89j9d/",
              "created": 1724256285,
              "depth": 2,
              "replies": [
                {
                  "id": "lj8doul",
                  "score": 28,
                  "body": "When leadership changes.\n\nThe current crop of executives at a lot of these companies have no original ideas. They just chase trends, which is why so many businesses try the same thing and end up floundering. There’s nothing to differentiate them when they all rely on the same MBA ivory tower driven group think.\n\nI’m not saying there isn’t a place for that but that place isn’t every place.",
                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8doul/",
                  "created": 1724257575,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj8qniv",
                      "score": 15,
                      "body": "This exactly, I wish more people were aware of that most executives are being pulled from the same pool. And the worst part is that this practice is exalted as a virtue of pedigree rather than the rampant nepotism that it actually is.",
                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8qniv/",
                      "created": 1724261566,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj9wp5z",
                          "score": 8,
                          "body": "In this day and age everyone has so much access to information that this “group think” sentiment hardly applies anymore. Pull from executive pools all over the world and they will tell you there’s only the same 5-10 ways to turn a struggling franchise around. \n\nThe real challenge is how that individual can effectively build a team and connect with all the working level employees in the company to achieve that goal. Why do executives end up coming from similar places? Because those are the best places to build connections. If you need 20 business managers with 15 years of experience, do you think you’ll have an easier time finding them on Wall Street or randomly all over the US?",
                          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj9wp5z/",
                          "created": 1724274530,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ljfyguy",
                      "score": 1,
                      "body": "Too many executives now haven't spent any time living as a normal person, so they really have no idea what their customers want.",
                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljfyguy/",
                      "created": 1724360913,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ljbke7y",
                      "score": 1,
                      "body": "It’s not necessarily about the CEO but the board in a publicly traded company.  Shareholders want profits, and most boards are made up of finance/accounting/legal execs.  They strip out all the positive qualitative things because you can’t put those into a spreadsheet.",
                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljbke7y/",
                      "created": 1724296042,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lj8e7zk",
                  "score": 13,
                  "body": "Target hurt themselves with too many empty shelves and by locking up too many items. Also, you feel like a sucker waiting to pay when you see someone walk out without paying. ",
                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8e7zk/",
                  "created": 1724257742,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj8uaej",
                      "score": 2,
                      "body": "Inventory management can be fixed but how is Target supposed to fight shrink in areas where social justice means letting rampant criminals run free?",
                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8uaej/",
                      "created": 1724262674,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lja9eel",
                          "score": 8,
                          "body": "By having security guards and no self-checkout, plus appropriate levels of staffing.",
                          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lja9eel/",
                          "created": 1724278714,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ljaiivp",
                              "score": 4,
                              "body": "Security guards who won't do anything and added labor that won't precent shoplifting. I can't believe the dumb MBA leadership hasn't thought of this.",
                              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljaiivp/",
                              "created": 1724281903,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ljarf65",
                                  "score": 6,
                                  "body": "They have, they just found it was cheaper to lock up certain items instead.",
                                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljarf65/",
                                  "created": 1724285084,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lj8pwba",
                  "score": 9,
                  "body": "Target lost a good chunk of customers going all in on weird alphabet swimwear for kids.",
                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8pwba/",
                  "created": 1724261334,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ljaip7n",
              "score": 8,
              "body": "Mobile ordering is not destroying the brand. Many successful chains have rewards systems and customer-facing digital platforms these days. MOP has driven a lot of volume growth for Sbux in recent years.\n\nWhat's challenging Starbucks right now is poor management. They have a real crony problem when it comes to filling managerial positions. People aren't elevated in the company based on performance or merits, but how many friends you make within leadership teams. And they're also contending with the same issue they faced back in 2008, and that's tighter customer spending when it comes to the staples that are priced at a premium. They're not insurmountable issues. I think the company is just going through a shit cycle.",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljaip7n/",
              "created": 1724281965,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljc9b10",
              "score": 2,
              "body": ">My guess is he'll simplify the menu, close some stores (I have 4 within a half mile of me - in a city but still) as a starting point, but he needs to contend with this \"Premium Brand but non-premium product\" vision.\n\nDo you think he'll open more reserves?",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljc9b10/",
              "created": 1724309011,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljdxa8r",
              "score": 1,
              "body": "I mean the diabetes deserts is what the ppl want, thats why they order it.",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljdxa8r/",
              "created": 1724338262,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj7rgml",
          "score": 13,
          "body": "I own no sbux nor do I ever order from there.\n\nHowever, didn't they shift their economic model towards being dominant in the drive through arena? IIRC its basically Chick-Fil-A and Sbux crushing the drive through market",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7rgml/",
          "created": 1724250653,
          "depth": 1,
          "replies": [
            {
              "id": "lj920fw",
              "score": 10,
              "body": "Was just saying this the other day. They are just drive-thru terminals now. CFA is huge with drive-thru, but a far better customer experience on the inside imo.",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj920fw/",
              "created": 1724265025,
              "depth": 2,
              "replies": [
                {
                  "id": "lj9byvu",
                  "score": 4,
                  "body": "CFA also has a superior chicken sandwhich, nuggets, fries, and milkshakes.  The super driver thru is partially due to demand.",
                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj9byvu/",
                  "created": 1724268152,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lj8kjo9",
              "score": 10,
              "body": "You mean you don’t like $8 bland coffee?",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8kjo9/",
              "created": 1724259684,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj9v4yu",
          "score": 5,
          "body": "To be fair, most Chipotles in my area are complete wrecks to. Nobody stocks anything, no ice in the drink machine and every table needs a wipedown.  It has been that way since the pandemic and it hasn't hurt them. Maybe this guy will bring that magic to Starbucks?",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj9v4yu/",
          "created": 1724274030,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj7p2h3",
          "score": 2,
          "body": "I was long SBUX and it is part of my long term\nportfolio. I have to rethink this for the reasons you are mentioning. \n\nThey need a breath of new leadership who can be creative and run a lean and efficient business. This message needs to come from the top. \n\nIf the $10M bonus is pegged on performance, I have no issues as a stockholder. Let them prove their mettle and take the wins.",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7p2h3/",
          "created": 1724249881,
          "depth": 1,
          "replies": [
            {
              "id": "lj7s8x5",
              "score": 21,
              "body": "They've given so much to bring him on.  SB matched his future vesting at Chipotle, which i believe was 78m. Then guaranteed bonuses of 200-400% of salary.  Then, the performance bonuses kick in.  On top of this, the millions to get his satellite office setup and private plane rides.\n\nThis guy brings nothing new to the table.  Chipotle decor is like a prison cafeteria.  Sheet metal everywhere.   SB decor is the same. \n\n There are two things wrong with SB.  First is the mobile app ordering process and pick up.  Pickup window or area is too small.  They need to add another section where people can pickup their drinks.   Second is the decor.   It needs to go back to what it was.  Inviting feeling is gone.  It's like going imto a play area of McDonalds",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7s8x5/",
              "created": 1724250904,
              "depth": 2,
              "replies": [
                {
                  "id": "ljewpfr",
                  "score": 1,
                  "body": "It’s too expensive when I can get an iced coffee from McDonald for $1.50.",
                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljewpfr/",
                  "created": 1724349171,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "lj807w8",
              "score": 9,
              "body": "I mean just pause and think for a second. Who has leverage, Niccol or Starbucks? It’s obviously Niccol, so he gets whatever he wants. Starbucks can choose to not pay, but then they won’t get him. Very obviously they want him specifically.\n\nWhen you are that good (or at least perceived to be that good) and that in demand, you can ask for whatever you want.",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj807w8/",
              "created": 1724253405,
              "depth": 2,
              "replies": [
                {
                  "id": "ljcu9ko",
                  "score": 2,
                  "body": "CEOs have not been shown to have really any link to performance of the company.  They are just grasping at straws to make the stock price go up. \n https://www.inc.com/will-yakowicz/study-finds-ceos-might-noteffect-company-performance-greater-than-chance.html\n\nhttps://boardagenda.com/2021/03/23/do-we-overestimate-impact-ceos-on-company-performance/",
                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljcu9ko/",
                  "created": 1724322522,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljd8xqr",
                      "score": 1,
                      "body": "Well the people with money and power certainly don’t agree. If you listen to venture capitalists talk, one of the single most important founders is who the founder himself is, as a person.",
                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljd8xqr/",
                      "created": 1724329593,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ljdbof5",
                      "score": 1,
                      "body": "@John_Crypto_Rambo\n\n“I do not think that word means what you think it means”",
                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljdbof5/",
                      "created": 1724330704,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lj88rl8",
                  "score": 0,
                  "body": "I agree he's good. Why can't he be better by setting the right example?\n\nAlso though he's good; is he the only guy in this entire country for the job?",
                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj88rl8/",
                  "created": 1724256046,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj892bs",
                      "score": 9,
                      "body": "Because he’s obviously looking out for himself. He lives in California and has a family.\n\nAnd Starbucks thought he was the only one they wanted, perhaps you could suggest someone better or similar?",
                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj892bs/",
                      "created": 1724256138,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj8c5ml",
                          "score": 0,
                          "body": "I wish I knew somebody better who I could suggest.\nI am hypothesizing that the board and leadership could convince him to work out of HQ or appoint another willing leader who could work out of HQ.",
                          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8c5ml/",
                          "created": 1724257098,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lj8mola",
                              "score": 6,
                              "body": "But reality shows they couldn’t…",
                              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8mola/",
                              "created": 1724260346,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "ljdbt1r",
                              "score": 1,
                              "body": "It’s 250k for the jet….that’s it….he is also following the same Hybrid work from home policy everyone else gets.\n\nWhat are you whining about?",
                              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljdbt1r/",
                              "created": 1724330756,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ljaa6yd",
                      "score": 3,
                      "body": "Starbucks had to offer him a better deal than he was getting from Chipotle already. He’s not going to cut his own wages and reduce his own conditions because he didn’t need this job. \n\nAs for why Starbucks was willing to pay so much for him, there are very few people with a similar level of experience or success at leading a major fast food chain as him.",
                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljaa6yd/",
                      "created": 1724278987,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lj7yhb8",
              "score": 4,
              "body": "Also it looks like coffee production will be drastically affected by climate change. It's a bleak future for Starbucks for sure.",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7yhb8/",
              "created": 1724252868,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj931w3",
              "score": 1,
              "body": "SBUX isn't going anywhere. Share prices are down, but still astronomically higher than they were 10-20 years ago. Like McDonald's, they need to return to core product offerings (no need to have 30 items on the menu) within a stable and affordable price range.",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj931w3/",
              "created": 1724265343,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljas97k",
          "score": 0,
          "body": "Great, did you see the company market cap increase?",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljas97k/",
          "created": 1724285389,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj9uri3",
          "score": -1,
          "body": "Yet this sub won't stop pandering, worshiping, and being cucked into policy decisions the benefit these fucks, all at the cost of the long term health of our country.",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj9uri3/",
          "created": 1724273915,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj7z4p5",
      "score": 79,
      "body": ">When he is not traveling for work, however, Niccol will still be expected to work from the Seattle office at least three days a week in alignment with Starbucks’ hybrid work policies>\n\n\nThis isn't that uncommon for executive teams. Fly in late Monday or early Tuesday and leave Thursday night. This was common pre-COVID honestly.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7z4p5/",
      "created": 1724253069,
      "depth": 0,
      "replies": [
        {
          "id": "lj97gwv",
          "score": 31,
          "body": "[deleted]",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj97gwv/",
          "created": 1724266730,
          "depth": 1,
          "replies": [
            {
              "id": "lj9x80v",
              "score": 6,
              "body": "what size of a company you work in, or worked with that had such standarts? genuine question",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj9x80v/",
              "created": 1724274697,
              "depth": 2,
              "replies": [
                {
                  "id": "ljaoru4",
                  "score": 14,
                  "body": "[deleted]",
                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljaoru4/",
                  "created": 1724284131,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljcf8db",
                      "score": 5,
                      "body": "And as a bonus, they have the entire apartment free for shaving interns.",
                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljcf8db/",
                      "created": 1724312838,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ljd63q2",
                      "score": 1,
                      "body": "Where do you pay 2k for second place in Bay Area?",
                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljd63q2/",
                      "created": 1724328393,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ljainqo",
                  "score": 1,
                  "body": "I know a guy who works in LAPD but lives in Idaho. He flies every week for work, stays in LA and back Friday night",
                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljainqo/",
                  "created": 1724281950,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljcfb9h",
                      "score": 3,
                      "body": "People in the LAPD make enough to afford that habit?",
                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljcfb9h/",
                      "created": 1724312891,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ljb6a2g",
              "score": 1,
              "body": "Because it doesn't make any fucking sense",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljb6a2g/",
              "created": 1724290568,
              "depth": 2,
              "replies": [
                {
                  "id": "ljc8yb2",
                  "score": 1,
                  "body": "Commuting airline crew members in shambles",
                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljc8yb2/",
                  "created": 1724308789,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lj9mph1",
          "score": 3,
          "body": "I used to do that when my company was acquired, every week for 2 years until my required contract was complete.  Expect I didn't do it in private jets and had to use commercial airlines.",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj9mph1/",
          "created": 1724271464,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj85on0",
      "score": 28,
      "body": "It’s not every day, read the article you posted",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj85on0/",
      "created": 1724255101,
      "depth": 0,
      "replies": [
        {
          "id": "lj93qfa",
          "score": 17,
          "body": ">read the article you posted\n\nlol tall order, boss. This same article was posted yesterday and it was a thousand angry comments from people who also thought would be a daily event. This is not an uncommon practice at the corporate-level of any organization. Whether he works from home base or another state, they operate worldwide.",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj93qfa/",
          "created": 1724265558,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj7p5be",
      "score": 80,
      "body": "Chipotle moved its HQ to New Port Beach to get him as CEO in 2018. He’s holding all the cards right now.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7p5be/",
      "created": 1724249907,
      "depth": 0,
      "replies": [
        {
          "id": "lj7xm6b",
          "score": 55,
          "body": "This dude is just a boss. Good for him. If I could make my employer open an office across the street from my house I would.",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7xm6b/",
          "created": 1724252598,
          "depth": 1,
          "replies": [
            {
              "id": "lj87ew2",
              "score": -36,
              "body": "Why would you celebrate how memey and cool this guy is without criticizing the ridiculous cost of commuting in a private jet? Is it because you care about Boss Dudes but not real stuff?\n\n\nObviously, you know what the better answer is here. Sometimes, people react badly to simple situations with a clearly correct answer. It's tribalism.",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj87ew2/",
              "created": 1724255633,
              "depth": 2,
              "replies": [
                {
                  "id": "lj88y8l",
                  "score": 21,
                  "body": "I have a couple issues with private jet travel but it being expensive for shareholders isn't one of them. The shareholders voted on this guy and he negotiated this deal. I'm sorry it upsets you but good for him. \n\nNot really sure what point you were trying to get at after the first question but let's just assume it was salient.",
                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj88y8l/",
                  "created": 1724256103,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lj9yel4",
                  "score": 7,
                  "body": "The cost of the private jet is **insignificant** if he can turn the company around! We're talking about a $10 million cost per year versus a potential $10 billion increase in the company's value. That's literally just 0.1%!!!  That's literally like VOO expense rate.",
                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj9yel4/",
                  "created": 1724275075,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lj898ha",
                  "score": -8,
                  "body": "This; he is obviously good. No doubt. However  this is act that seems like stepping across good self confidence to over confidence.\n\nAlso, I would argue the company is a bigger entity with real impact on people's lives. Such an entity needs a more responsible person.",
                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj898ha/",
                  "created": 1724256191,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lja408n",
                      "score": 4,
                      "body": "Out of pure curiosity, what’s the argument that Starbucks has more of an impact on people’s lives than Chipotle?",
                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lja408n/",
                      "created": 1724276887,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lja4km3",
                          "score": 5,
                          "body": "Apologies if that's how you interpreted what I said. I didn't intend to compare Starbucks and Chipotle. My intention was to state that Starbucks the company has a bigger impact that the CEO the individual.",
                          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lja4km3/",
                          "created": 1724277072,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ljlieco",
                  "score": 1,
                  "body": "Probably because the present value added by employing new CEO >>> present value of costs to lure new CEO away from his previous employer?\n\nInvesting isn’t about winning some internet virtue signaling contest. It’s about making positive risk adjusted returns on invested capital.",
                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljlieco/",
                  "created": 1724442399,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lj7nbig",
      "score": 63,
      "body": "No one cares about a few thousand bucks the CEO spends a day. This is a hundred-billion dollar company.\n\nThis guy did nothing but get a job and increased Starbucks' valuation by almost 20 billion dollars over night.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7nbig/",
      "created": 1724249292,
      "depth": 0,
      "replies": [
        {
          "id": "lj7woik",
          "score": 24,
          "body": "The people who give a shit about this don't care about stock performance. They just feel like it's unfair and therefor they need to bash it for some reason. Shareholders are happy and the CEO is happy. Salty redditors are the only losers.",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7woik/",
          "created": 1724252308,
          "depth": 1,
          "replies": [
            {
              "id": "lj9v4qa",
              "score": 6,
              "body": "Let's see him move the actual fundamentals that impact the long term valuations of a company before we celebrate...",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj9v4qa/",
              "created": 1724274028,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj83yif",
              "score": 10,
              "body": "Whiny Redditors and being a loser. Name a more iconic duo",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj83yif/",
              "created": 1724254564,
              "depth": 2,
              "replies": [
                {
                  "id": "lj8q6bb",
                  "score": 3,
                  "body": "B B But capitalism maaaan!",
                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8q6bb/",
                  "created": 1724261419,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj8sexd",
                      "score": 3,
                      "body": "“Capitalism is a plague on society”\n\n- posted from my iPhone",
                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8sexd/",
                      "created": 1724262104,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj94nu2",
                          "score": 4,
                          "body": "I got downvoted big time the other day for saying the same thing in the antiwork sub . This sub makes plenty of great points and there's a lot of good conversation...but...Reddit is a publicly traded company...there's an irony to the whole thing that rarely gets acknowledged.",
                          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj94nu2/",
                          "created": 1724265849,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ljb3vhr",
                              "score": 2,
                              "body": "It wasnt one before",
                              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljb3vhr/",
                              "created": 1724289658,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lja93er",
                              "score": 1,
                              "body": "Especially when you consider that there *are* open source alternatives to Reddit.\n\nLike, people could be on Lemmy, but they prefer the convenience that a corporate platform offers.",
                              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lja93er/",
                              "created": 1724278608,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ljb3u9u",
                          "score": 1,
                          "body": "iPhone sucks",
                          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljb3u9u/",
                          "created": 1724289645,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ljb3le4",
          "score": 1,
          "body": "No that's the rumor, buy the rumor sell the news they said, they would care if the performance or company earnings news is bad ",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljb3le4/",
          "created": 1724289552,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj7olnj",
          "score": 1,
          "body": "Few 100ks per day on one individual; I know there is sarcasm in here. \n\nBut this to me is the problem with the stock. It has been unrealistically high when the product is not doing too well (expensive sugar drinks and uninviting retail stores). It's the message they should be sending from the top: that they want to run a fit efficient and lean business. Not be wasting money like this. There will be trickle down in such a culture. How long before the mid-managers are taking their teams on expensive offsites because the CEO can fly private everyday and all this while retails workers are slogging it out in the store?",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7olnj/",
          "created": 1724249728,
          "depth": 1,
          "replies": [
            {
              "id": "lj7ouri",
              "score": 10,
              "body": ">Few 100ks per day on one individua\n\nThat one daily trip isn't costing a few 100k per day, I'm pretty sure. You're probably talking about his salary? In which case, again, hundred-billion dollar company. CEOs of them get paid a lot and this CEO in particular seems to be very valuable.\n\nConcerning the second paragraph... I feel like that's conjecturing a whole lot based on one guy's commute.",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7ouri/",
              "created": 1724249810,
              "depth": 2,
              "replies": [
                {
                  "id": "lj7phek",
                  "score": 1,
                  "body": "No issues with him getting paid reasonable money as long as pay is pegged against performance. \n\nLet him prove his mettle before taking the wins. \n\nDespite the remuneration, why should he fly private every day on company's account? It's not his private hedge fund.It's a publicly traded company.",
                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7phek/",
                  "created": 1724250018,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj8eeyr",
                      "score": 9,
                      "body": "He proved his mettle at chipotle",
                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8eeyr/",
                      "created": 1724257802,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljcri1p",
                          "score": 2,
                          "body": "Time will tell. Please check what happened to JC  Penney when “a successful”  corporate individual on others companies was brought to run it.\n\nhttps://chiefexecutive.net/5-critical-errors-that-triggered-ron-johnsons-removal-at-jc-penney/amp/\n\nJC Penney ended in bankruptcy and the shareholders were left penny less. Just saying.",
                          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljcri1p/",
                          "created": 1724320855,
                          "depth": 5,
                          "replies": []
                        },
                        {
                          "id": "lj8fiwe",
                          "score": 0,
                          "body": "And he should be rewarded at Chipotle for that like he was. This is a different business and environment. Let him prove it here.",
                          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8fiwe/",
                          "created": 1724258146,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lj9a5qs",
                              "score": 9,
                              "body": "You can scale that argument down as well. Should your future employer give you less pay/benefits than what you are getting now?\n\nAfter all, the future employer just wants you to prove yourself at the new job before they give you a better pay package.",
                              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj9a5qs/",
                              "created": 1724267583,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lj9v3f5",
                              "score": 5,
                              "body": "You don't seem to understand that this guy already had a very lucrative contract with Chipotle and SBX consequently had to give a even better one to make him switch. \n\nHe didn't hold a gun to anyone head or went to SBX to prove himself. The company added nearly 20 billion dollars in value merely by him accepting the offer.",
                              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj9v3f5/",
                              "created": 1724274017,
                              "depth": 6,
                              "replies": []
                            },
                            {
                              "id": "lj8gme8",
                              "score": 3,
                              "body": "lol sure man",
                              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8gme8/",
                              "created": 1724258484,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lj7ts2r",
                      "score": 7,
                      "body": "Probably because people think he's worth that much, idk. CEOs get elected by the board who get elected by shareholders, so I can only assume this decision was made in the interest of shareholders ¯\\\\\\_(ツ)\\_/¯\n\nAll in all I don't care about his commute. You can argue about his pay or whatever, but his commute is pretty much irrelevant to most people.",
                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7ts2r/",
                      "created": 1724251397,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj89hvi",
                          "score": 2,
                          "body": "I would argue otherwise. He can commute in a space shuttle on his own dime for all I care as a stockholder.",
                          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj89hvi/",
                          "created": 1724256273,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lj8v330",
                      "score": 5,
                      "body": "> Despite the remuneration, why should he fly private every day on company's account?\n\nBecause he negotiated it and the people that own the company agreed. If his compensation is measured in dollars, equity or private jets what's it matter? Would you feel better if rather than spend money on his private jet travel the company instead just added that amount to his salary and stock allotments? \n\nDo you even on shares in SBUX? Did you vote when it was time?",
                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8v330/",
                      "created": 1724262912,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj8w4e0",
                          "score": 3,
                          "body": "Yes I voted as part of the annual shareholder meeting. This wasn't disclosed then. Look, I am not against the appointment of this person as the CEO. They have a good track record.\n\nI am for good and tight governance of the company; lean and cost efficient operations which will benefit me as a stock holder of the company in the long run. And I think this act of not working from the HQ and flying to HQ everyday is not setting the right example.",
                          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8w4e0/",
                          "created": 1724263222,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lj91vy7",
                              "score": 3,
                              "body": "My understanding is that he isnt flying daily, but instead he works remotely 2 days a week (Monday and Friday) and instead of working from his home office in Seattle, he works from his home office in California so that he can also spend the weekend in the same place and in Seattle he either stays at a hotel, or rents/owns a smaller apartment just for himself and not his family. \n\n\nI do not own Starbucks or Chipotle, but after the announcement Chipotle dropped about 7%, and Starbucks went up by about 24% almost instantly. People seem to have a lot of faith in this guy, and based on what he did with both tacobell and chipotle, if I was a shareholder in Starbucks like you are, I would be happy to have this guy on my side. Him joining made the market cap go up about 20billion, and his salary plus plane usage will most likely end up being less than 0.25%  of that over his stay at the company assuming he stays about 5 years and meets results to get bonuses.",
                              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj91vy7/",
                              "created": 1724264986,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lj93te3",
                                  "score": 3,
                                  "body": "The article also mentions that they will pay for 3 months of this arrangement, and that they expect him to move once he finds a new house in Seattle. It seems extremely reasonable to me. \n\n\nI work a random shitty office job, and my company paid for a nice hotel room for 2 weeks while I found an apartment to rent, I was also an entry level 23 year old at the time, so I do expect that the new star CEO would get better relocation package than that, so given he is staying at a hotel room for 1 person for 2 nights a week (Tuesday and Wednesday) instead of 7 days a week for a full family, you as the shareholder might be even saving money by just paying for the private plane that Starbucks already owns.",
                                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj93te3/",
                                  "created": 1724265582,
                                  "depth": 7,
                                  "replies": []
                                },
                                {
                                  "id": "lj92qw0",
                                  "score": 1,
                                  "body": "> if I was a shareholder in Starbucks like you are, I would be happy to have this guy on my side\n\n100%. He has a great track record.\n\n> Starbucks went up by about 24% almost instantly. Him joining made the market cap go up about 20billion\n\nThis is market jingo-ism. One bad quarter alone can wipe out market cap by double the gain here. I am in for the long. I would like to see sustainable leadership that can deliver steady growth over time minus the troughs and peaks.",
                                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj92qw0/",
                                  "created": 1724265250,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lj8zqnl",
                              "score": 2,
                              "body": "> And I think this act of not working from the HQ and flying to HQ everyday is not setting the right example.\n\nI mean I don't disagree but basically no one employed at any company anywhere in the US looks to the CEO as an example of anything except for maybe at something like Ramsey Solutions. I personally don't take leads from Bill Stone.",
                              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8zqnl/",
                              "created": 1724264325,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lj91uzy",
                                  "score": 2,
                                  "body": "I have quite the opposite experience where I have seen the CEO & senior exec team being the champions of the company's culture. Would I look up to them as examples for my day to day job: no. In fact I think I am better at my day to day job than them. But I sure as hell look up to them as examples as stewards of the company's culture.",
                                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj91uzy/",
                                  "created": 1724264978,
                                  "depth": 7,
                                  "replies": [
                                    {
                                      "id": "lj95ohd",
                                      "score": 1,
                                      "body": "> But I sure as hell look up to them as examples as stewards of the company's culture.\n\nI truly cannot relate to this. I always look at them as the people that make the rules and guide the company take it or leave it. I don't think I have ever considered them as examples.",
                                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj95ohd/",
                                      "created": 1724266169,
                                      "depth": 8,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lj825yq",
                      "score": 3,
                      "body": "you have to convince him to leave, and that was one way to do it.",
                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj825yq/",
                      "created": 1724254005,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lj7t77z",
              "score": 5,
              "body": ">expensive sugar drinks and uninviting retail stores\n\nStarbucks has never been cheap, and it has never been inviting. They're elitist and condescending by design, and that should be obvious by the fact that they still refuse to use conventional names for sizes. That always sounds like a nitpicky thing to point out, but it represents a core part of their brand identity. Their drinks are meant to be ordered with such a unique specificity that it feels elitist as hell to the average person, but that's all on purpose and part of their foundation. \"Learn our language, and become one of us. These drinks are part of a lifestyle. Do you want to fit in here, or are you just passing through to say the word 'large' in exchange for a condescending eyeroll from the whole staff?\" \n\nSo if you're *just now* seeing them as uninviting, I'm not sure what to say. That should've popped up before you even got to minute 1 of DD on them, no matter when you bought.",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7t77z/",
              "created": 1724251212,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj8geh8",
      "score": 14,
      "body": "Immaterial costs in a multi billion dollar corporation, who cares. The value he brought to shareholders just by being hired is worth more than any costs he plans to cut.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8geh8/",
      "created": 1724258417,
      "depth": 0,
      "replies": [
        {
          "id": "lj8gztz",
          "score": -10,
          "body": "As a shareholder who is holding SBUX in my long portfolio, I must respectfully disagree. I am more interested in the quarterly reports going up to 2026. I am not into day trading. Will this new leadership be able to provide sustained growth and maintain the baseline as opposed to spiking and taking based on sensationalism?",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8gztz/",
          "created": 1724258599,
          "depth": 1,
          "replies": [
            {
              "id": "lj9cu5d",
              "score": 20,
              "body": "you dont own enough shares to be this concerned with him flying",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj9cu5d/",
              "created": 1724268424,
              "depth": 2,
              "replies": []
            },
            {
              "id": "ljbwehk",
              "score": 1,
              "body": "Don’t forget that we will have to pay more taxes when we sell thanks to this poor hiring decision.",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljbwehk/",
              "created": 1724301547,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj8a2lw",
      "score": 5,
      "body": "SBUX owns a jet and maintains a staff for it, so while I'm sure this will probably increase the budgeted hours of flight from last year, it's probably not going to be by much.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8a2lw/",
      "created": 1724256454,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj7n04z",
      "score": 19,
      "body": "it is example of: “you need to spend money to make money”. if he increase profits, whatever they spend on him was worth it. \n\nthe only way to find out is to wait and see.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7n04z/",
      "created": 1724249181,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj8h0r5",
      "score": 6,
      "body": "Every single Starbucks share owner is celebrating this hire\n\nWhatever it takes \n\nHe actually took less than I thought",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8h0r5/",
      "created": 1724258607,
      "depth": 0,
      "replies": [
        {
          "id": "lj8k077",
          "score": -2,
          "body": "FWIW, I am one and I am not celebrating.",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8k077/",
          "created": 1724259519,
          "depth": 1,
          "replies": [
            {
              "id": "lj8n00x",
              "score": 5,
              "body": "You stole the best young CEO in the world from hugely successful CMG",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8n00x/",
              "created": 1724260443,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj8lony",
              "score": 3,
              "body": "You got a 25% bump in one day\nWhat are you complaining about? \nSell and make a nice profit",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8lony/",
              "created": 1724260036,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lja9s18",
              "score": 1,
              "body": "How much do you own?",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lja9s18/",
              "created": 1724278844,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj7zf5v",
      "score": 5,
      "body": "When it dipped to $73, I bought a fuck ton. Got lucky, sold the moment it hit $95",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7zf5v/",
      "created": 1724253158,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj80cuo",
      "score": 8,
      "body": "You understood wrong. It's cut spendings of others.\nNot him of course",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj80cuo/",
      "created": 1724253448,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj9nzdb",
      "score": 3,
      "body": "I see you haven't met 'two jet' Jeff Immelt who used to work over at GE.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj9nzdb/",
      "created": 1724271855,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj7np4d",
      "score": 4,
      "body": "With how much they’re paying him, quibbling over whatever is like putting a sign out sheet for pens",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7np4d/",
      "created": 1724249428,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj7mrrf",
      "score": 5,
      "body": "Hes got his own pilot prob, its chump change to him",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7mrrf/",
      "created": 1724249102,
      "depth": 0,
      "replies": [
        {
          "id": "lj89h8i",
          "score": 4,
          "body": "SBUX has their own jet and staff for it, did a double take when I saw  \"pilot\" and \"flight attendant\" postings on their site job hunting one time.\n\nThat's another thing about this, there is already a budget for \"x\" amount of flight hours per year and while I'm sure this will exceed that, the difference won't be much of an impact to the the bottom line.",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj89h8i/",
          "created": 1724256267,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj7mw9j",
          "score": 1,
          "body": "Won't it be part of the CEO remuneration package?",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7mw9j/",
          "created": 1724249144,
          "depth": 1,
          "replies": [
            {
              "id": "lj7o0ru",
              "score": 3,
              "body": "Ya. Its ok tho, they will just raise those mocha frappé chocolates cold brew foam from 7.25 to 7.50$ and cover his flights",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7o0ru/",
              "created": 1724249534,
              "depth": 2,
              "replies": [
                {
                  "id": "lj7r9t6",
                  "score": -1,
                  "body": "Or fire more employees at corporate because 1.7 billion quarterly profit isnt nearly enough (looking at you John Deere).",
                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7r9t6/",
                  "created": 1724250593,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lj7u16s",
      "score": 4,
      "body": "Yeah but he won't in reality be physically making that commute. Its just primary office. He will work from where ever he wants or needs depending on the business.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7u16s/",
      "created": 1724251477,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj8243r",
      "score": 3,
      "body": "Starbucks does 36,000 million in revenue each year. The cost of this guy flying around won’t even register as a rounding error. If his efforts save each store just one gallon of milk per month, it’ll pay for his entire package. \n\nThe entire package is actually quite reasonable. \n\nWhat Starbucks needs to focus on is not cost cutting efficiency but productivity. The “kitchen” is a complete train wreck with slow order taking and chaotic production processes. \n\nThere’s five employees, a line of 30 people and someone orders a lemonade.  The only order taker leaves to go make it. Meanwhile how many people looked at the line and said “fuck that”. \n\nMeanwhile the people filling orders are bouncing from one machine to the next on intersecting paths and producing orders in the order received rather than producing all the sodas at once, etc.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8243r/",
      "created": 1724253989,
      "depth": 0,
      "replies": [
        {
          "id": "lj8cx13",
          "score": 1,
          "body": "You make a very interesting point. Thinking along those lines: don't productivity and lean / cost efficient operations go hand in hand?\nIf I wanted to speed things up: I could invest in the best machines and pay the best wages to remain competitive. But then I would also have to pass these costs on to the customer which would make me an unpopular business.\nAt such scale, does it make sense to think about productivity isolated from cost efficiency?\n\nThe metrics you point out and the issues you raise are on the point.",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8cx13/",
          "created": 1724257336,
          "depth": 1,
          "replies": [
            {
              "id": "lj8w7qu",
              "score": 1,
              "body": "You’re not improving efficiency if you “have to pass the costs off to the customer”. Efficiency is exactly the opposite. \n\nBut efficiency isn’t just “do more with less”. Just “do more” is an improvement in efficiency and that’s what Starbucks needs to do.let \n\nAlso Starbucks already has generally high quality employees. They’re not scraping the bottom of the pay scale. They just have shit processes for those employees to follow. \n\nThis isn’t terribly surprising given the rapid growth, but at this point the restaurants are so chaotic with commonly long queue that they can grow revenue and profit faster by making the restaurants serve more customers than they can by opening more restaurants. \n\nIt’s also not easy to do.  Even a small change means retraining 1,000,000 employees",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8w7qu/",
              "created": 1724263251,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj8zo5t",
              "score": 1,
              "body": "Also, more expensive employees won’t solve the problem. There is a process in place - rules for what employees should do when x or y happens or when x or y is ordered. \n\nThey don’t need new machines. They need better processes that allow the same employees to take and prepare more orders. .",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8zo5t/",
              "created": 1724264304,
              "depth": 2,
              "replies": [
                {
                  "id": "lj926bj",
                  "score": 1,
                  "body": "And what happens when employees don't follow rules or processes? If you are interested, I am happy to share multiple such experiences from my limited personal experience alone.",
                  "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj926bj/",
                  "created": 1724265075,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljb3zje",
                      "score": 1,
                      "body": "Then those employees get disciplinary action or are released. That’s the same in any business and every business has issues like that especially when your employee count is literally millions. Examples of such problems are meaningless on that scale. \n\nThat situation, in itself, has a process to address it. \n\nThe thing is that a company of that size survives off of established, documented processes that apply to everything they do.  A coffee should be consistent from one location to the next. Service should be consistent from one location to the next. Ordering should be consistent from one location to the next. You have managers that teach and enforce the process and identify areas that don’t have an adequate process and communicate these voids to corporate management. \n\nYeah, employees hate processes. They hate being robots. They hate being told to be robots. And, frankly, my guess is that Starbucks is far less rigid in enforcing process than most - just based on watching the chaos that happens behind the counter. \n\nThat’s probably about to change. And it’ll be up to the new guy to effect that change without destroying the culture and contentment of the team. \n\nThis is WAAAY more difficult than it sounds. \n\nIf he succeeds, they should pay him well. If he can make each location only 5% more productive, that’s $2B in growth without opening a single new location.  It’s hard to extrapolate to locations across the world, but I would be disappointed if he can’t generate a 10% improvement in productivity at least for US locations.\n\nStart thinking a LOT bigger than just what’s going on at a single counter or single location. If one location manager murdered a customer’s baby and threw its severed head into a car in the drive though before setting the location on fire and killing 20 people, the stock will go down a point or two. If every location sells 10% more coffee and food per hour, the stock will go up 30%.",
                      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljb3zje/",
                      "created": 1724289700,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lj8nxxs",
      "score": 2,
      "body": "I am so glad Starbucks cares about environment and eliminated plastic straws to decrease carbon dioxide emissions.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8nxxs/",
      "created": 1724260733,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj7zqic",
      "score": 1,
      "body": "Is cost cutting actually one of his primary goals?",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7zqic/",
      "created": 1724253255,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj84xom",
      "score": 1,
      "body": "SBUX has a major problem! It has been boycotted in so many countries around the world due to its support to Israel… SBUX stores in my home country are shutting down one after the other… \nI live in Atlanta , and I have a store next to my condo… it used to be packed around 10 am … now lucky if I see 2 clients in",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj84xom/",
      "created": 1724254870,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj89uki",
      "score": 1,
      "body": "How long will it take for him to fly from California to Seattle? Isn't that like a 3 hour flight? How is that worth it for this guy to commute 6 hours a day or is there some sort of super fast jet he will be using?",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj89uki/",
      "created": 1724256384,
      "depth": 0,
      "replies": [
        {
          "id": "lj8hkg1",
          "score": 1,
          "body": "I doubt he'll do it every day. Article says he will be in the office  3 days a week when not traveling for work. \n\nHe'll probably arrive Tuesday morning and leave Thursday night.  Spend 2 nights in a hotel or corporate housing.",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8hkg1/",
          "created": 1724258775,
          "depth": 1,
          "replies": [
            {
              "id": "lj8ksl9",
              "score": 1,
              "body": "That makes sense TONY",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8ksl9/",
              "created": 1724259760,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj8spg2",
          "score": 1,
          "body": "Typically around 90 minutes from Sacramento to Seattle.",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8spg2/",
          "created": 1724262193,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj8jmkj",
      "score": 1,
      "body": "Rules for thee and not for me!",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8jmkj/",
      "created": 1724259404,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj8p0cf",
      "score": 1,
      "body": "The same way that Al Gore was carbon neutral flying on his private jet while telling the rest of us shlubs not to use AC",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8p0cf/",
      "created": 1724261061,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj8pguv",
      "score": 1,
      "body": "So green.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8pguv/",
      "created": 1724261204,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj8w7ok",
      "score": 1,
      "body": "Not for him cost cutting for everyone else",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8w7ok/",
      "created": 1724263251,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj8ytxp",
      "score": 1,
      "body": "Considering how big Starbucks is it's going to be a drop in the bucket. It's a bad image but it's not enough to make any impact on the bottom line",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8ytxp/",
      "created": 1724264045,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj969c4",
      "score": 1,
      "body": "He’s going to move the HQ or at least split it between Seattle or Newport Beach, give it 6 months for that announcement.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj969c4/",
      "created": 1724266351,
      "depth": 0,
      "replies": [
        {
          "id": "lj97k4z",
          "score": 1,
          "body": "This seems like a whistleblower comment :-)",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj97k4z/",
          "created": 1724266759,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj9epg0",
      "score": 1,
      "body": "He is a union buster. Look at his work at Chipotle. If he does his job his flight costs will be worth it.\n\nPs I think it is insane this is a thing when your company has a section of your web page all about being about sustainability. Comical",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj9epg0/",
      "created": 1724269018,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj9nbdu",
      "score": 1,
      "body": "People in here are acting like the CEO of a $100B company isn't worth shit but the 24 year old local barista whose life is a complete mess is irreplaceable.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj9nbdu/",
      "created": 1724271650,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljai00v",
      "score": 1,
      "body": "Even more reason to unionize",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljai00v/",
      "created": 1724281717,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljaxo8u",
      "score": 1,
      "body": "Spare me with this take/title. He’s flying in Monday and flying out Friday. This is super common with everyone from 1st year consultants up to senior executives (granted commercial v private but still). He is not “commenting from California to Seattle” that’s patently false if you just read the article",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljaxo8u/",
      "created": 1724287353,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljazxsy",
      "score": 1,
      "body": "Peasant whining about rich travel expenses",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljazxsy/",
      "created": 1724288186,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljbewtb",
      "score": 1,
      "body": "There is no state income tax in Washington.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljbewtb/",
      "created": 1724293836,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljbmgsy",
      "score": 1,
      "body": "CEO's don't care about employee morale",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljbmgsy/",
      "created": 1724296908,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljbq78f",
      "score": 1,
      "body": "If you have a problem with that sell the shares. If you dont then why are you complaining? \n\nI have a large position in SBUX. I'm fine with the deal they negotiated with him. It basically was this. They have a big problem. They know this guy has a good chance of solving it and wanted to poach him from a cushy position. He wasn't open to moving at all and they either had to make it work or find someone else. They found a solution that they think will work and he has agreed to it. If they hadn't poached him they might have found someone else, but it would have been a bigger risk albeit the compensation would have likely been lower. \n\nDo I think SBUX will return to its rapid growth story? No. I think it will settle into a decent dividend provider that eventually becomes a highly stable mature company with minimal to modest growth. \n\nI think the new ceo probably sees that as well and I won't be surprised if his tenure as ceo puts it squarely on that path. They will still open new stores, but the rate of new stores will drop quite a bit. I wont be surprised if they spend a bunch to improve the menu or to improve the store as a location to hang out. I won't be surprised if cost cutting removes some locations. In fact I suspect a lot of locations near office buildings will probably go away, but I also expect those will be rapidly replaced with more suburbia locations. \n\nFor the record I started building my position after the terrible earnings call several months ago. After listening to the call I was certain the ceo was going to be sent packing. I wasn't sure who would replace him, but I was willing to take a chance that would happen inside the next few quarters and the replacement would be well received by the markets.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljbq78f/",
      "created": 1724298547,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljc69kd",
      "score": 1,
      "body": "Starbucks now offers burritos on the go. Stocks bound for the moon",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljc69kd/",
      "created": 1724307113,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljc6nqu",
      "score": 1,
      "body": "CEO:Cost cutting for thee but not for mee",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljc6nqu/",
      "created": 1724307358,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljcgvf7",
      "score": 1,
      "body": "It's the same time zone so if the rest is better why not?",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljcgvf7/",
      "created": 1724313921,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljcld6d",
      "score": 1,
      "body": "Venti is about to get rebranded as Sedici",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljcld6d/",
      "created": 1724316869,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljcolar",
      "score": 1,
      "body": "I believe his package was 3 days a week, not every day.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljcolar/",
      "created": 1724318973,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljczylm",
      "score": 1,
      "body": "Man it’s crazy how successful some folks become.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljczylm/",
      "created": 1724325571,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljd4w7f",
      "score": 1,
      "body": "They cant change the culture. GenZ baristas are entitled, unfriendly and lack work ethics. Thats majority of their talent pool and paying them more money wont change that. They expect to get paid more.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljd4w7f/",
      "created": 1724327869,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljd9kdh",
      "score": 1,
      "body": "What’s the issue?  He will conform to the hybrid work from home policy everyone loves…be in the office at least 3 days a week…just fly there. We do that in my family. We live in Florida and work for companies headquartered in different states.  Zoom meetings from home office…fly to sites that manufacture, fly to home office when needed, etc.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljd9kdh/",
      "created": 1724329852,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljdaqps",
      "score": 1,
      "body": "It’s only 250k dollars….its not that much money. Read the contract, the value of the use of the Corporate Jet for all travel business and personal is not to exceed 250k in value.\n\nIt’s no big deal…time is money.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljdaqps/",
      "created": 1724330329,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljf0e0f",
      "score": 1,
      "body": "No one is worth the amount of money these executives make.  JS",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljf0e0f/",
      "created": 1724350299,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljhe72p",
      "score": 1,
      "body": "Not that uncommon. My company has executives that commute from Chicago to Detroit once or twice a week",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/ljhe72p/",
      "created": 1724379557,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj86hww",
      "score": 1,
      "body": "Nobody who is rich and living in Newport Beach will ever take a new job if it means moving to Seattle. No slight to Seattle but the weather alone makes that move impossible, not to mention if he has kids. \n\nAlso, as a former CEO who was hired in a city different from the HQ the Board told me \"the company HQ is where the CEO is - live where you want\".",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj86hww/",
      "created": 1724255352,
      "depth": 0,
      "replies": [
        {
          "id": "lj8bk7p",
          "score": 0,
          "body": "With all due respect; I don't think this is going to bode well for governance of a publicly traded and well regarded company. Given the current RTO policies the CEO should be front in line. This is what Andy Jassy did with Amazon (lead by example). CEO needs to stay connected beyond office hours with top employees in the HQ. \n\nSee the recent references to outgoing CEO saying he won't work beyond 6 and Eric Schmidt talking at Stanford about going above and beyond.",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8bk7p/",
          "created": 1724256916,
          "depth": 1,
          "replies": [
            {
              "id": "lj8dxw1",
              "score": 1,
              "body": "I am not saying he should fly in for three hours and fly out. My point simply is living somewhere other than the Starbucks HQ is not a big deal. Look at the results at Chipotle - think the Board would not be happy with that? My guess is the expectation is he will fly to Seattle and work 3 consecutive days each week - I dont think he is flying back and forth each day. Even if that is allowed it would be pretty draining.",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8dxw1/",
              "created": 1724257655,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj9ocli",
      "score": 1,
      "body": "Celebrities and politicians tell regular people they should drive electricity cars and eat more veggies to cut down carbon emissions, while themselves are riding their own private jets which can create carbon emissions of 500 people driving their pickup trucks for a year in a flight of  300 miles. And they are going to eat steaks and drink champagne so you need eat veggies to reduce carbon emissions.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj9ocli/",
      "created": 1724271966,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj8jf4u",
      "score": 0,
      "body": "SBUX needs to die already… My puts aren’t printing",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8jf4u/",
      "created": 1724259341,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj8lgrh",
      "score": 0,
      "body": "Just more vulture capitalism. Extracting the maximum amount of wealth at any cost. Couldn't happen to a better company",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8lgrh/",
      "created": 1724259968,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj8m2mv",
      "score": 0,
      "body": "The OP is earning janitorial salary and worries about how CEO should conduct his work.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8m2mv/",
      "created": 1724260156,
      "depth": 0,
      "replies": [
        {
          "id": "lj91dek",
          "score": 0,
          "body": "I am proud to be part of this great country that let's me 1) be a part of the free and open market system on my janitorial salary and 2) have a small and indirect say on the governance of a large publicly traded company on my janitorial salary.\n\nI wish more people on janitorial salaries would educate themselves and participate in the system.",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj91dek/",
          "created": 1724264829,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj8mcud",
      "score": 0,
      "body": "Somebody should introduce him to work from home.\n\nYou know, it's almost like these billionaires didn't have to live through 2020 like the rest of us.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8mcud/",
      "created": 1724260243,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj8yhqi",
      "score": 0,
      "body": "His job is to get paid a lot to close stores, reduce headcount, and cut costs. It doesn’t make sense if you think his job is to make Starbucks “better”. \n\nAlso, I’ve hated Starbucks for like 10 years for how much sugar they pump into people. I bought a thousand dollar machine for my home and office and found the best beans for my taste. It probably saves me money but even if it didn’t, I like my coffee better than theirs and don’t waste any time going to their store. \n\nSadly, I am not rooting for this company. They have gone from premium to lower than McDonald’s in all aspects. Seems like the worst place to work, food is inedible, stores and store experience suck. There’s just nothing I like about it anymore.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8yhqi/",
      "created": 1724263941,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj89n4m",
      "score": -1,
      "body": "Dude lied about chipotle portions so someone else hired him with this fucking absurdity? $30 million a year. You can move. 🤣",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj89n4m/",
      "created": 1724256319,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj8cldb",
      "score": -1,
      "body": "It's unbelievable they are going to be paying this guy over $25m a year to basically come in and slash prices.\n\nDo you know why SB sales keep dropping? It's because no one wants to pay $8 for a drink.  Cut that back down to $6.  Problem solved.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8cldb/",
      "created": 1724257234,
      "depth": 0,
      "replies": [
        {
          "id": "lj9qr04",
          "score": 1,
          "body": "Pal, those MBAs at Starbucks know exactly what you pointed out, they just don't want to admit because the bubbles of stock price will bust if they get real. So they are going to come up a million reasons why the store sales can't grow further, so they can create projects for themselves to get paychecks for another 24 to 48 months, before they can get jobs somewhere else.",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj9qr04/",
          "created": 1724272694,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj7vzff",
      "score": -5,
      "body": "We live in a time where a company is nothing more than an organizational shell driven to generate the product of investor and executive value. Any services or goods sold are merely a vehicle for that end. Because of this corporate philosophy , goods and services are overlooked and customers are often less delighted. Total cart before the horse approach. This is just my opinion so who cares",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7vzff/",
      "created": 1724252091,
      "depth": 0,
      "replies": [
        {
          "id": "lj84dbu",
          "score": 5,
          "body": "Wait a minute. Are you telling me that the whole purpose of a for-profit publicly traded company is to make money? This is groundbreaking.",
          "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj84dbu/",
          "created": 1724254693,
          "depth": 1,
          "replies": [
            {
              "id": "lj8hceo",
              "score": 1,
              "body": "I know right?",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj8hceo/",
              "created": 1724258705,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lj95avr",
              "score": 1,
              "body": "seriously. everyone here is against these companies, but offer any of them $25m to do a job and watch what they do...",
              "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj95avr/",
              "created": 1724266050,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj7pivr",
      "score": -3,
      "body": "Cost cutting, what me must do; not for *me*, just for *you*.",
      "permalink": "/r/stocks/comments/1exqg1q/how_does_this_make_sense_in_the_spirit_of_cost/lj7pivr/",
      "created": 1724250032,
      "depth": 0,
      "replies": []
    }
  ]
}