{
  "title": "Payrolls downward revisions of 818,000 fewer which would likely push the Fed interest rate to drop in September.",
  "score": 145,
  "selftext": "Payrolls downward revisions of 818,000 fewer jobs (an average of 68,167 fewer net jobs added per month) created between April 2023 and March 2024 put great pressure on the Fed to go down either 25 to 50 basis points on September 17th and 18th as the previous rosy picture of employment was overblown.\n\nThis will likely cause Powell to be less hawkish on the outlook and the Fed has to pivot speedier to ensure a soft landing instead of a recession.\n\nCurrently, there is a 69.5% likelihood of a 25 basis-points interest rate cut by the Fed in September, with a 30.5% chance of a super-sized 50 bps cut.  It is 69.5% +30.5% = 100% of probable rate cut in September, and the revision should only increase the 50 bps of 30.5% even higher.\n\nThis is ahead of Chair Jerome Powell's speech at the Jackson Hole economic symposium on Friday\n\nThis revision should not spook the market as Goldman Sachs already expected 600,000 to 1 million fewer jobs created between April 2023 and March 2024.",
  "link_flair_text": "Industry News",
  "id": "1exrc98",
  "num_comments": 53,
  "created_utc": 1724251238,
  "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/",
  "comments": [
    {
      "id": "lj8sebl",
      "score": 39,
      "body": "Every time the Fed pivots and cut rates, it’s usually a tad too late and the death spiral begins. \n\nWhat will happen this time?",
      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj8sebl/",
      "created": 1724262099,
      "depth": 0,
      "replies": [
        {
          "id": "lj9fvon",
          "score": 27,
          "body": "They have learned the way of the money printer since then 🤓",
          "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj9fvon/",
          "created": 1724269382,
          "depth": 1,
          "replies": [
            {
              "id": "ljb4yg2",
              "score": 5,
              "body": "Ah yes \"quantitative easing........cough........ infinitely\"",
              "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljb4yg2/",
              "created": 1724290071,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljbiw4z",
          "score": 6,
          "body": "fucking layoffs everywhere man. i feel like we're in a while-e-coyote moment: fed will cut when the critter is well off the cliff.\n\nmy company has never laid off before, the CEO prided himself in that. after more than a decade we did our first round recently.\n\nwe all got assigned training material which we have to all do tests on soon. i'm guessing anyone that doesn't pass goes on a PIP.",
          "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljbiw4z/",
          "created": 1724295418,
          "depth": 1,
          "replies": [
            {
              "id": "ljnjkhc",
              "score": 2,
              "body": "There actually... Aren't that many layoffs. I don't doubt you and I'm sure what you're seeing is real. But not in aggregate - it's not showing up in the data. Companies seem to be hoarding employees after having so much trouble hiring during COVID.",
              "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljnjkhc/",
              "created": 1724470131,
              "depth": 2,
              "replies": [
                {
                  "id": "ljqpqjz",
                  "score": 2,
                  "body": "[https://www.reddit.com/r/Layoffs/](https://www.reddit.com/r/Layoffs/) started the year with about 10k members, and is up to 54k now. the stories there also have a common theme: it's months to get rehired.",
                  "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljqpqjz/",
                  "created": 1724524130,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljqxprs",
                      "score": 2,
                      "body": "It's possible those are bots or more layoffs are hitting industries with reddit-aged users in them.\n\nBut check out the *top row*, below. June is the most recent data available. The amount and rate of layoffs has been stable all year and actually FELL in June.\n\nhttps://www.bls.gov/news.release/jolts.t05.htm",
                      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljqxprs/",
                      "created": 1724526802,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljryq97",
                          "score": 1,
                          "body": "dude the BLS has only one job to do and they get revised by more than 50% all the time. if i was 50% wrong at my one job, i'd have been fired long ago.\n\ntech is hit more. i work with a good chunk of the fortune 500, many of them have been laying off all year.",
                          "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljryq97/",
                          "created": 1724540360,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lj7wsb2",
      "score": 44,
      "body": "The consensus was around 600k. JPM was predicting 400k. I don't know if it'll spook the market or not, but this is definitely a decent amount worse than expected (around 22k less job a month last year). If we assume the labor market has decelerated since March 2024, and that the \"breakeven\" nonfarm payroll is around 100k historically, that means there's less \"runway\" for the soft landing, or the no landing scenario that the market has been pricing for months now.\n\nSept cut has already been confirmed since last week, especially when the hawks like Kashkari and Bostic came out and said open to rate cut in Sept. Don't think they're gonna start with a 50 basis point cut though because they will have a lot of hawks dissent on that decision. Remember in Mar 2022 when it was obvious they were late to the inflation fight, and they still started with 25 basis point hike. So if your first decision to cut just a month before an election has a lot of committee members dissent, that's just an easy target for either Trump or Harris to accuse the Fed of playing politics.",
      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj7wsb2/",
      "created": 1724252340,
      "depth": 0,
      "replies": [
        {
          "id": "lj8taha",
          "score": 23,
          "body": "Yea, 50bps to start a cycle simply wont happen outside a clear emergency.",
          "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj8taha/",
          "created": 1724262370,
          "depth": 1,
          "replies": [
            {
              "id": "lj8yjef",
              "score": 7,
              "body": "yeah probably outside of 1995 and maybe 2019 (if COVID never happened), half of the rate cuts started out as precautionary rate cuts before recession started. However, typically within 2-3 months after the first cut, they realized the recession already occurred, and started cutting a lot more. \n\nThe 1995 soft landing scenario was almost a luck scenario where they saw a negative nonfarm payroll number that later got revised to positive. Then they freaked out and cut rates, and ended with a soft landing.\n\nAs for the 2019 cuts, I guess we'll never know if a recession would've occurred on its own without a global lockdown.",
              "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj8yjef/",
              "created": 1724263955,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "lj801k6",
          "score": 9,
          "body": "WSB predicted 1M+, closer than JPM",
          "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj801k6/",
          "created": 1724253350,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj7wj4z",
      "score": 26,
      "body": "He’ll cut 25 bp only",
      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj7wj4z/",
      "created": 1724252263,
      "depth": 0,
      "replies": [
        {
          "id": "lj8a7f2",
          "score": -5,
          "body": "Its going to be 50",
          "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj8a7f2/",
          "created": 1724256495,
          "depth": 1,
          "replies": [
            {
              "id": "lj8mtbf",
              "score": 12,
              "body": "Why don’t they do 37.5?    It’s half joke and half a real question",
              "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj8mtbf/",
              "created": 1724260387,
              "depth": 2,
              "replies": [
                {
                  "id": "lj9ldl6",
                  "score": 4,
                  "body": "One quick answer is the rate we're all talking about is really the upper limit of a 25 basis point *range* so any 12.5 bp adjustment could be enacted via open market (the 'OM' of FOMC) operations.\n\nI'm definitely not an expert though it was interesting to have just learned that the federal funds rate only became a range in December 2008 as part of the GFC response. Actually if I hadn't read that I would have erroneously responded that it's always been a range!",
                  "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj9ldl6/",
                  "created": 1724271056,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj9oth4",
                      "score": 4,
                      "body": "Thank you for clarifying!!  I appreciate it!!  \nI watch and listen to many podcasts and commentators on cnbc , Bloomberg and fox financial.  For some reason , no one ever explains this.  As if the only options are 25 , 50 , 75. Quite honestly, for anyone using their head, the question would normally arise.   But the media and perhaps the fed have convinced most people that it is all or nothing. \n    Thank you for emphasizing the range.  It helps to understand that point more now.",
                      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj9oth4/",
                      "created": 1724272109,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ljbjadg",
          "score": -3,
          "body": "he has to do 25 or he'll spook the market. but he really needs to do 100. too little too late. good thing JPow was never an ambulance driver...",
          "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljbjadg/",
          "created": 1724295582,
          "depth": 1,
          "replies": [
            {
              "id": "ljbkbbc",
              "score": 3,
              "body": "Also, the optics of 50 right before election won’t fly.",
              "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljbkbbc/",
              "created": 1724296007,
              "depth": 2,
              "replies": [
                {
                  "id": "ljfz9i0",
                  "score": 2,
                  "body": "That would spook the market and convince everyone there is something structurally wrong.",
                  "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljfz9i0/",
                  "created": 1724361173,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lj86038",
      "score": 11,
      "body": "It will be interesting to see what happens when rates do start to drop. There is so much dry powder on the sidelines in MMFs. Any significant drop and those funds may be pushed out into other assets.",
      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj86038/",
      "created": 1724255200,
      "depth": 0,
      "replies": [
        {
          "id": "lj87r50",
          "score": 4,
          "body": "Buying power is consumed both by buying and shorting. So if sentiment changes to negative on the economy, I would expect a massive rotation into Treasuries, and then a sharp drop in equities within the recession-vulnerable sectors (banks, leisure, discretionary).",
          "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj87r50/",
          "created": 1724255736,
          "depth": 1,
          "replies": [
            {
              "id": "lj8vi2d",
              "score": 4,
              "body": "Leisure and discretionary have already seen pretty huge drops",
              "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj8vi2d/",
              "created": 1724263037,
              "depth": 2,
              "replies": [
                {
                  "id": "lj9buhe",
                  "score": 3,
                  "body": "I'm not so sure. I think the highly leveraged leisure have dropped due to interest rates. Things like PK (hotel REIT) have dropped, but things like HLT are at ATHs; and PK is rising strong today. Discretionary like BOOT, ANF, TJX, and so forth are way up. I think what we've seen is the interest rate scare, and what we haven't seen is the recession scare.",
                  "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj9buhe/",
                  "created": 1724268113,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lj82jul",
      "score": 7,
      "body": "Technically speaking, this doesn’t change the outlook unless unemployment gets revised big in the upcoming months. Outside the political shenanigans, and how people will run with X cooking the numbers, it would be really insightful to get a proper reasoning for that unless its one of those employers been back trackingz\n\nFeds were going to cut, now the argument is cooling labor market, less demand, salaries going down, so inflation under control. Either way, Feds did a great job crushing wage growth so all rosy anyways",
      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj82jul/",
      "created": 1724254120,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj852vi",
      "score": 13,
      "body": "BLS counts jobs based on employee weights. So a 600lbs employee counts as having 3 to 4 jobs. It's why America's unemployment is so low.",
      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj852vi/",
      "created": 1724254914,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj7z22z",
      "score": 7,
      "body": "The Fed has started cutting cycles with 50 bps cuts going back 25 years I believe. 50 BPS rate cut incoming in a few weeks.",
      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj7z22z/",
      "created": 1724253046,
      "depth": 0,
      "replies": [
        {
          "id": "lj84fxd",
          "score": 24,
          "body": "That’s because all cuts over the last 25yrs have been reactionary (see a clear slowdown in growth). This is a proactive cut. Not saying a 50bp cut is impossible in Sep., but it’s unlikely.",
          "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj84fxd/",
          "created": 1724254716,
          "depth": 1,
          "replies": [
            {
              "id": "lj8hvvp",
              "score": 2,
              "body": "Lol proactive? The Feds have literally never been  proactive for one simple reason: all the data they use to inform their policy decision is lagging. \n\nYou can’t use last months data or last quarter’s data to be proactive. That literally just doesn’t make sense.",
              "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj8hvvp/",
              "created": 1724258872,
              "depth": 2,
              "replies": [
                {
                  "id": "lj8lot8",
                  "score": 1,
                  "body": "You can. If you KNOW you're using data that is always lagging data, you can account for this lag period in order to be proactive. If you see a trend, you can extrapolate and then proactively make a decision earlier.",
                  "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj8lot8/",
                  "created": 1724260038,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lj8thqe",
                      "score": 2,
                      "body": "Kinda. But then we woulda cut hard on the bad report before the yensplosion, and then said oopsies a week later.",
                      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj8thqe/",
                      "created": 1724262431,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lj9bis9",
                      "score": 2,
                      "body": "I don’t think you know what proactive means. Look throughout history to see if the Fed has ever been proactive. Their policy decisions have always been reactive to LAGGING data.",
                      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj9bis9/",
                      "created": 1724268012,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lj9hybz",
                          "score": -2,
                          "body": "If you KNOW you're using data that is always lagging data, you can account for this lag period in order to be proactive.",
                          "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj9hybz/",
                          "created": 1724270017,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ljapz7b",
                              "score": 4,
                              "body": "What he's saying is that the Fed \\_could\\_ be proactive, but historically (and looking at current behavior), they're not.  A proactive Fed would have recognized the unemployment numbers trending up months ago, or the inflation rate trending down for months (including the fact some 80+% of the remaining inflation is housing, which is known to have crazy amounts of lag, standing in direct contrast to current-day rent and housing price data which is available).  If the Fed \\_was\\_ accounting for lagging data, they would have cut at least one meeting ago, if not two.  Now they're at least a full half point of cuts behind where they should have been months ago, and can't cut a half point in September without freaking out the market.",
                              "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljapz7b/",
                              "created": 1724284561,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lj9dck0",
                          "score": -5,
                          "body": "I’m a doctor lol. So pretty smart. I know what proactive means. Surgeons need to be proactive all the time on the operating table \n\nAgain, I’m an actual doctor. I know almost everything in general.",
                          "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj9dck0/",
                          "created": 1724268586,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lj84qb0",
          "score": 3,
          "body": "Seriously, seriously doubtful without another huge payrolls miss occurring, and probably isn't bullish if it does occur.\n\nThey do not want to admit they made a mistake in June and July.",
          "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj84qb0/",
          "created": 1724254805,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj91bo1",
      "score": 3,
      "body": "Isn't it common knowledge that the numbers always get revised down? Shouldn't that be priced in already? Like everything else...",
      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj91bo1/",
      "created": 1724264814,
      "depth": 0,
      "replies": [
        {
          "id": "ljzuv88",
          "score": 2,
          "body": "Not by this much tho",
          "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljzuv88/",
          "created": 1724670751,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lji2u42",
      "score": 1,
      "body": "If you take 800k off this chart the civilian labor force still looks ok. \n\nhttps://fred.stlouisfed.org/graph/?g=1sZNO\n\nIf that starts to fall off then they are already too late.",
      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lji2u42/",
      "created": 1724390939,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljioh4d",
      "score": 1,
      "body": "I honestly don't know how this can affect the market. Hasn't the stock market already priced in 3 or 4 round of rate cuts?",
      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljioh4d/",
      "created": 1724404634,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj8q4l5",
      "score": 1,
      "body": "Also worth pointing out the Fed can cut around 150 points before they even get to neutral. That means if they go big and hit 50 in September, still restrictive, hit 50 again the next time, still restrictive, hit 50 again, now we might be getting close to neutral but I think neutral is probably still a little bit lower, there's a ongoing debate where the neutral rate is right now but it's somewhere between 3 and 4% and quickly trending down with inflation. I think there's the possibility if this continues to get worse that we might see the Fed do a reverse of what they did raising rates and if that's the case, those of you holding a good deal of TLT are going to be smiling",
      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj8q4l5/",
      "created": 1724261404,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj9qt9b",
      "score": 1,
      "body": "That number is nothing",
      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj9qt9b/",
      "created": 1724272713,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj91a81",
      "score": -1,
      "body": "Sell and see you in a year. Recession is incoming.",
      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj91a81/",
      "created": 1724264802,
      "depth": 0,
      "replies": [
        {
          "id": "ljab7v3",
          "score": 5,
          "body": "Hmmm selling before rate cuts, let’s see how that works out for them Cotton.",
          "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljab7v3/",
          "created": 1724279345,
          "depth": 1,
          "replies": [
            {
              "id": "ljafses",
              "score": -3,
              "body": "Let’s see 12 months.",
              "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljafses/",
              "created": 1724280946,
              "depth": 2,
              "replies": [
                {
                  "id": "ljdld1b",
                  "score": 1,
                  "body": "!RemindMe 12 months",
                  "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljdld1b/",
                  "created": 1724334302,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljdli7r",
                      "score": 1,
                      "body": "I will be messaging you in 1 year on [**2025-08-22 13:45:02 UTC**](http://www.wolframalpha.com/input/?i=2025-08-22%2013:45:02%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljdld1b/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1exrc98%2Fpayrolls_downward_revisions_of_818000_fewer_which%2Fljdld1b%2F%5D%0A%0ARemindMe%21%202025-08-22%2013%3A45%3A02%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201exrc98)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljdli7r/",
                      "created": 1724334352,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "llwrcwb",
                      "score": 1,
                      "body": "Well guys how’s it look so far? So far I posted that back Aug 21 and basically nailed the top of the double top on SPY. We have broken down now below 21 EMA 2nd time in a couple months. Jobs reports looked nasty this week… rates cuts will be dribbled out to slow. ",
                      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/llwrcwb/",
                      "created": 1725683050,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lj93udl",
      "score": 0,
      "body": "JPow will cut in Sept. Wall Street said this a month ago.",
      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/lj93udl/",
      "created": 1724265591,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljb2ua4",
      "score": 0,
      "body": "how can they get this wrong so often.",
      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljb2ua4/",
      "created": 1724289268,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljbt2tt",
      "score": 0,
      "body": "Of course they’ll lower rates prior to the elections. You can bet money on that.",
      "permalink": "/r/stocks/comments/1exrc98/payrolls_downward_revisions_of_818000_fewer_which/ljbt2tt/",
      "created": 1724299891,
      "depth": 0,
      "replies": []
    }
  ]
}