{
  "title": "What's up with SOFI?",
  "score": 127,
  "selftext": "This company has had consistently been growing and has a good product, but their stock has been a choppy mess and can't seem to find a bullish trend and stick with it. Why is this? Does anyone have any insight as to why SOFI is not performing? It makes no logical sense to me.",
  "link_flair_text": "Rule 3: Low Effort",
  "id": "1ey0hjq",
  "num_comments": 102,
  "created_utc": 1724273031,
  "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/",
  "comments": [
    {
      "id": "lja4ggl",
      "score": 145,
      "body": "A couple reasons I think, with the theme being SoFi is playing conservative and the street doesn’t buy their long term guidance. SoFi chose to take a conservative approach to lending this year in this unpredictable rate environment and also diluted a bit with their convertible note deal. The tech platform is also only ~20% of revenue, which will need to come up for SoFi to achieve the multiples necessary for rapid stock appreciation. \n\nManagement is projecting for 0.55-0.80 EPS in 2026, and the street estimates don’t believe them. SoFi has always underguided, so it seems likely they’ll hit this target which makes me feel bullish. Customer growth has also been tremendous - they’re really stealing market share from legacy institutions and this should only accelerate in a lower rate environment as SoFi will be able to maintain higher savings rates for longer.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja4ggl/",
      "created": 1724277035,
      "depth": 0,
      "replies": [
        {
          "id": "ljaic79",
          "score": 41,
          "body": "Well if they continue to dilute nothing will change",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljaic79/",
          "created": 1724281838,
          "depth": 1,
          "replies": [
            {
              "id": "ljcl2xt",
              "score": 15,
              "body": "I for one hate dilution. The offering they gave though was less about dilution, and more about restructuring debt. Saved shareholders roughly $100m annually in interest expense. CEO is also buying up shares, always a good sign. \n\nIt’s still a growth start up - dilution is an unfortunate side effect. \n\nMost bullish for me though is that they are the only bank I heard reduce accrual for assumed losses on lending. This shows the strength of their brand. \n\nExcited about our future. 💪 💰",
              "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljcl2xt/",
              "created": 1724316687,
              "depth": 2,
              "replies": [
                {
                  "id": "ljcp4no",
                  "score": 2,
                  "body": "Maybe they are trying to acquire top talent for their bank tech. Give them a bit of equity, the company grows they become millionaires. All you gotta do is increase your banking tech before all the HYSA are basically even or give slight below t bonds",
                  "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljcp4no/",
                  "created": 1724319334,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lja58i3",
      "score": 51,
      "body": "Fintech been in a downtrend since 2021. Haven’t seen any recovery yet. Just look at Square, PayPal and all the others struggling not to make new all time lows, lmao",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja58i3/",
      "created": 1724277293,
      "depth": 0,
      "replies": [
        {
          "id": "lja7m61",
          "score": 29,
          "body": "Nubank is an obvious exception but its exposure is to the LATAM markets, not the US. I think the fintech sector is oversaturated in the US market.",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja7m61/",
          "created": 1724278101,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lja85wl",
      "score": 55,
      "body": "TTM Net Income / Customer:\n\n  \nJP Morgan: $52.216 billion / 80 million = $652 / customer, PE = 11.97\n\nBank of America: $22.832 billion / 69 million = $331 / customer, PE = 13.63\n\nWells Fargo: $17.563 billion / 70 million = $251 / customer, PE = 11.38\n\nMorgan Stanley: $9.853 billion / 15 million = $657 / customer, PE = 16.57\n\nGoldman Sachs: $10.571 billion / 14 million = $755 / customer, PE = 15.94\n\n  \nSofi currently has about 8.8 million customers, up 41% YoY. Even assuming 25% YoY growth for the next 2 years would result in almost 14 million customers. Assuming they can eventually make $50 of net income per customer (easier said than done obviously), this would result in total net income of $700 million. With a PE ratio of 20 (which I think is reasonable given customer growth rates and EPS growth), this would give SOFI a stock value of $20.\n\nThe most difficult thing for SOFI in the future will be increasing their revenue per customer and attracting higher net worth individuals.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja85wl/",
      "created": 1724278289,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lja8kwd",
      "score": 35,
      "body": "Full disclosure I’m long 2k shares. Right now 22% rev growth for a bank+ forgotten stepchild tech business isn’t great considering they’re trying to escape being called a bank. They’ve only recently reached profitability and right now growth has been contracting because they’ve cut back on lending with rates high. \n\nNow as rate cuts happen and their loans on their balance sheet become worth more and they start lending more you will see revenue growth accelerate EPS accelerate and the stock price reflect that. The market isn’t going to prematurely take Noto’s guidance on that they’re going to wait and see- from my perspective this is mgmt that has guided conservatively and always beat and raised so I’m not concerned. I’m becoming increasingly bullish in spite of this stocks retail popularity because those rate cut catalysts are coming- the company has been trading in a range for a long time and tangible book value is like 4 bucks a share. You’re paying 3 bucks for a business that is about to see massive catalysts and will see EPS grow dramatically over next two years. \n\nIf recession doesn’t happen this stock will appreciate massively when and IF those catalysts play out- I think we won’t see recession and that the growth will happen but understand the market wants to see proof.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja8kwd/",
      "created": 1724278430,
      "depth": 0,
      "replies": [
        {
          "id": "ljam081",
          "score": 3,
          "body": "Can you expand on \"escape being called a bank\"? That was true when they weren't a bank (aka, didn't have a charter) but now they do. I'd think the reverse. They can lead the way in the neo-bank space and already have lending products.\n\n\nI'm also long on them and even worked at a neo-bank competitor. SoFi is crushing the space, imo, but they IPO'd way too high.",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljam081/",
          "created": 1724283137,
          "depth": 1,
          "replies": [
            {
              "id": "ljaphc8",
              "score": 5,
              "body": "I think people just view banking as a non sexy lower multiple sector you can even see it in comments here when it’s compared to large legacy banks trading at 10ish PE’s. Sofi claims to be the AWS of fintech with their tech business and they’ve really done a lot to diversify their business between financial services lending and tech biz which they’ve called out frequently but to many investors they just call it a bank and think it’s worth a lower multiple.\n\nGrowth acceleration and a highlight on the tech business which hopefully accelerates and that can change over time. To me whether it’s intentional or not, I interpret the AWS comments and focus on diversification as them trying to say they’re more than a bank but maybe that’s just me.",
              "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljaphc8/",
              "created": 1724284386,
              "depth": 2,
              "replies": [
                {
                  "id": "ljaxgcb",
                  "score": 2,
                  "body": "Right. Makes sense. They do want to be a tech stock not bank stock. Gotcha.",
                  "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljaxgcb/",
                  "created": 1724287273,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ljeu94v",
          "score": 1,
          "body": "Won’t you want to lend when rates are high as your margin will be higher?",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljeu94v/",
          "created": 1724348430,
          "depth": 1,
          "replies": [
            {
              "id": "ljhcgar",
              "score": 1,
              "body": "You would think so but mgmt has basically communicated that they’ve wanted to de risk in an uncertain macro environment and not go crazy with personal loans and be very prudent. With future rate uncertainty and yield volatility they just wanted to be cautious and cut back on lending until they had a better view of rate cuts. \n\nIf you loan out a bunch of money and rates stay elevated or even get raised and the consumer ends up getting crushed you’re in a world of hurt, they could’ve been riskier and been more aggressive with  lending but mgmt is conservative and in my eyes justifiably so even if in hindsight they could have grown more this year.",
              "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljhcgar/",
              "created": 1724378890,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lj9zjd1",
      "score": 26,
      "body": "I think it's being priced as a bank/financial institution, whereas you may think it's a tech company.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lj9zjd1/",
      "created": 1724275440,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj9wdbj",
      "score": 46,
      "body": "Simplest answer is that Sofi doesn’t make much profit (any until extremely recently) and has spent time growing its balance sheet and user base as well as investing in its product suite. However it’s still priced more like a tech company than like a bank. I hold shares and see a solid future for the company but I absolutely don’t expect it to explode like some of the tech we’ve seen, which allows for a solid argument that’s it’s over priced or at best fairly valued right now",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lj9wdbj/",
      "created": 1724274423,
      "depth": 0,
      "replies": [
        {
          "id": "ljajj3c",
          "score": 8,
          "body": "Price to TBV is less than 2. Priced about right for growing bank. Then get Galileo for free",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljajj3c/",
          "created": 1724282256,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj9vr7f",
      "score": 14,
      "body": "Glad I sold at $15.  Like the CEO but i did not see the expected growth",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lj9vr7f/",
      "created": 1724274226,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lja83ex",
      "score": 11,
      "body": "i sell covered calls and puts on it. the constant oscillations work wonderfully.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja83ex/",
      "created": 1724278265,
      "depth": 0,
      "replies": [
        {
          "id": "ljdsvb0",
          "score": 2,
          "body": "that was a surprise when I did that; I sold covered calls not caring if I got assigned as it didn't pop when I thought it would; IV was low as well. Thinking of continuing the trend with 3/4/6 months out as soon as the IV goes back up. How do you approach it?",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljdsvb0/",
          "created": 1724336847,
          "depth": 1,
          "replies": [
            {
              "id": "ljdupa8",
              "score": 1,
              "body": "i am doing it as a hobby on the side. make a few dollars each week.",
              "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljdupa8/",
              "created": 1724337438,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljanlxy",
          "score": 0,
          "body": "Preach",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljanlxy/",
          "created": 1724283715,
          "depth": 1,
          "replies": [
            {
              "id": "ljap619",
              "score": 0,
              "body": "the church of sofi options is here to aid the poor, to feed the hungry and to pronounce to the world the joy!",
              "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljap619/",
              "created": 1724284271,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljb4wxr",
          "score": 0,
          "body": "I gotta learn these methods!!",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljb4wxr/",
          "created": 1724290055,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljbqebg",
      "score": 2,
      "body": "Seems to be doing quite well. Why not look at this as a great opportunity to buy more if you believe in it. If it keeps growing like this, the price will have to rise.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljbqebg/",
      "created": 1724298636,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljgzwzo",
      "score": 2,
      "body": "Overlay SOFI stock price with the XLF and you will find their movements are pretty much the same.\n\nSOFI is not a “tech disruptor” - that’s what the sellers want you to think.\n\nSOFI is just another bank, doing the same bank things that banks have been doing for millenias.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljgzwzo/",
      "created": 1724374165,
      "depth": 0,
      "replies": [
        {
          "id": "ltnzxty",
          "score": 1,
          "body": "It runs the Galileo platform, which is similar to Block. Are you going to claim Block isn't a tech company?",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ltnzxty/",
          "created": 1729855424,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lja6gx4",
      "score": 5,
      "body": "Is it really a “good product?” What makes it better than its competitors? Not much. Definitely not the tech side of things, its app is a slow buggy mess filled with ads. Being an all in one place for all your finances is not something novel either: Fidelity, Wealthfront provide the same and Robinhood is pretty much at that point too with a much nicer app",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja6gx4/",
      "created": 1724277708,
      "depth": 0,
      "replies": [
        {
          "id": "ljaiv6k",
          "score": 9,
          "body": "I've always had a local bank and decided to open a Sofi account simply because the savings interest rate was good. I like Sofi. I've never had a problem with the app like many others have. I didn't even notice the ads until you mentioned it. I like the vaults a whole lot, and cash back on the credit card is decent. Trading/stocks kinda sucks on it, but I just take the rewards from credit card and accrued interest in savings and buy SPY. \n\nOverall I'm happy. The app makes my money work for me better because, and a big part of that is because it's so easy setup and automate things. Before Sofi I was getting a laughable amount back in interest on savings, and on my Amazon cc I was usually blowing the rewards on stupid shit. Now I get $200 free dollars a month to invest. I get that other financial institutions might offer more, but for an everyday Joe I find Sofi very approachable to becoming better financially versed.",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljaiv6k/",
          "created": 1724282023,
          "depth": 1,
          "replies": [
            {
              "id": "ljayihr",
              "score": 3,
              "body": "I think that’s all very great and I use SoFi as well, but we’re talking about stock valuations here and this company has a lot of competition that will provide you all of this while having much better apps and more features, with no ads. You can’t compare SoFi to brick and mortar banks while trying to price it as a tech company, you need to compare it to other fintech stocks. This is why the comparisons to like Bank of America or a local credit union are basically useless unless we want to price SoFi similarly to them",
              "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljayihr/",
              "created": 1724287661,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljbt1tv",
          "score": 2,
          "body": "It's a dime a dozen financial product with slightly better advertising and social medial presence.",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljbt1tv/",
          "created": 1724299878,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljafuhf",
      "score": 3,
      "body": "What technical advantage does SOFI have that deserves its current valuation?",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljafuhf/",
      "created": 1724280966,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj9zcwj",
      "score": 0,
      "body": "sofi bagholders can't seem to wrap their heads around the fact that it's overvalued\n\nStock is trading at 7.30. SOFI's own projected EPS for next year is 0.08-0.09. Forward PE is 81x. There's no bank on the planet earth that deserves that premium.\n\n  \nfor reference, NVDA\"s PE is 47x",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lj9zcwj/",
      "created": 1724275383,
      "depth": 0,
      "replies": [
        {
          "id": "lja2uua",
          "score": 76,
          "body": "PE is a horrible metric to use for a company just turning the corner of profitability",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja2uua/",
          "created": 1724276515,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lja5dmc",
          "score": 30,
          "body": "If your goal was to compare apples to oranges you nailed it",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja5dmc/",
          "created": 1724277340,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lja88nk",
          "score": 30,
          "body": "I am not a Sofi investor but this is a terrible comparison. Sofi is a 7 billion dollar company with a forward P/E of 81 while Nvidia is a 3.16 trillion dollar company with a forward P/E of 47. The market cap makes a big difference as it’s much easier to grow when you’re a 7 billion dollar company vs a 3 trillion dollar company. A forward P/E of 47 on a 3 trillion dollar company is a much higher valuation than a forward P/E of 81 on a 7 billion dollar company. \n\nNot saying Sofi isn’t undervalued, fairly valued, or overvalued.",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja88nk/",
          "created": 1724278315,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lja44k9",
          "score": 13,
          "body": "Sofi only just barely started turning net profits within the last year. \n\nLooking at PE values around that period for companies isn't really that useful due to how the PE dynamic works right when a company shift from being unprofitable to profitable.",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja44k9/",
          "created": 1724276926,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lja084q",
          "score": 17,
          "body": "You're not wrong about SOFI having a high PE, but you are wrong to compare PE between two vastly different industries. ",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja084q/",
          "created": 1724275661,
          "depth": 1,
          "replies": [
            {
              "id": "lja60lu",
              "score": 2,
              "body": "Why? The rebuttal will eventually be sofi is an amazing tech company so let’s compare it to an actual amazing tech company y \n\nIf it’s a bank with a forward PE of 10x they’ll just say it’s not fair",
              "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja60lu/",
              "created": 1724277555,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lja84ud",
              "score": 1,
              "body": "He compared a banking PE to a tech PE. That’s providing a generous benefit of the doubt and makes the comparison even stronger.",
              "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja84ud/",
              "created": 1724278278,
              "depth": 2,
              "replies": [
                {
                  "id": "lja9d4z",
                  "score": 0,
                  "body": "He compared a nascent fintech bank to a semi conductor company that has had one of the most blistering stock market rises in history.\n\n\nIt's ludicrous. ",
                  "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja9d4z/",
                  "created": 1724278701,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljackn6",
                      "score": -1,
                      "body": "Yes, to demonstrate the fintech bank has a higher forward PE than a stock in the most explosive sectors. That makes the comparison more apt, not less.",
                      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljackn6/",
                      "created": 1724279820,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljdsjhl",
                          "score": 1,
                          "body": "you have no idea what u are talking about. Go buy Ford",
                          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljdsjhl/",
                          "created": 1724336740,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ljf28cm",
                              "score": 1,
                              "body": "SOFI bag holder alert 🚨 🚨",
                              "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljf28cm/",
                              "created": 1724350865,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "ljf2pmz",
                                  "score": 1,
                                  "body": "Im up 14% on sofi",
                                  "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljf2pmz/",
                                  "created": 1724351011,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ljbdlyr",
          "score": 3,
          "body": "That's the guidance for this year. If you take the midpoint of 2026 guidance as the 'forward' PE it's more like 12x. Taking a company's first profitable year and trying to extrapolate using that singular data point is pointless. \n\nMy concerns are more about the tech platform missing guidance and the likelihood of more dilution if they want to expand lending as rates drop. I think their tech platform is overemphasized by most and that the banking 40% y/y member growth is a much better indication of where their growth is going to come from.\n\nI bought most of my shares in the $4s, so I'm actually fine with how the stock itself has been doing. If they can meet or exceed their forward guidance, which they seem to do every quarter, I think it'll do even better. \n\nBut that'll take years to play out. So I'm perfectly happy if it takes 2-3 years to break back into the 10s",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljbdlyr/",
          "created": 1724293331,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lja7o9h",
          "score": 2,
          "body": "Tell me about revenues and cash flow next.",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja7o9h/",
          "created": 1724278120,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljanjcb",
          "score": 1,
          "body": "I see a post about SOFI once a week asking the same questions. Of the hundreds of publicly traded companies this is certainly one of them…",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljanjcb/",
          "created": 1724283689,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljb5w8o",
          "score": -2,
          "body": "I remember when I thought PE meant something...lol what a joker",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljb5w8o/",
          "created": 1724290423,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljb2dl8",
      "score": 2,
      "body": "They started doing secured loans over personal loans while the interest rates were high. When interest rates come down SOFI will fly higher as will paypal but seems people are on to paypal.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljb2dl8/",
      "created": 1724289095,
      "depth": 0,
      "replies": [
        {
          "id": "ljb5dsi",
          "score": 4,
          "body": "PayPal is like the older brother with stable job. SoFi is the younger sibling trying to figure things out haha",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljb5dsi/",
          "created": 1724290231,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lja7ktk",
      "score": 2,
      "body": "First sentence is all that matters. Buy more. If it keeps doing this, buy more.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja7ktk/",
      "created": 1724278088,
      "depth": 0,
      "replies": [
        {
          "id": "ljb5gip",
          "score": 1,
          "body": "I like sub 7 levels, if it gets sub 6, then I'll double down",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljb5gip/",
          "created": 1724290259,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljb8ae7",
      "score": 1,
      "body": "I don't know but with an average cost of $12 and 4800 shares...I'd really enjoy more green days. \n\nFigure I'm holding this long term either way.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljb8ae7/",
      "created": 1724291316,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljb8pxd",
      "score": 1,
      "body": "Fintech is doing poorly.  Paypal and its subsidary story kind tells me it is not the right place. AI or not.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljb8pxd/",
      "created": 1724291478,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljbt176",
      "score": 1,
      "body": "I’ve been wondering the same thing.  It’s crazy because I feel like it should be so much higher",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljbt176/",
      "created": 1724299869,
      "depth": 0,
      "replies": [
        {
          "id": "lk039u6",
          "score": 1,
          "body": "Based on the financials it really shouldn't be so much higher",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lk039u6/",
          "created": 1724674777,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljbtuvb",
      "score": 1,
      "body": "Because it’s no AI. Banking is old news.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljbtuvb/",
      "created": 1724300269,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljbzioy",
      "score": 1,
      "body": "They had some innovative but not great performing ETFs because they couldn't get people to buy them, mostly because the expense ratio was way too high. They just don't have enough products which customers want. Another example is they stopped doing cryptocurrency and sent people to another company.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljbzioy/",
      "created": 1724303189,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljcirxd",
      "score": 1,
      "body": "They should change their name to SoAI and watch the stock skyrocket.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljcirxd/",
      "created": 1724315152,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljctchf",
      "score": 1,
      "body": "This is only a theory, but I doubt the big cats want more competition and will short any chance they get",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljctchf/",
      "created": 1724321981,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljde6km",
      "score": 1,
      "body": "The truth is the economy is getting worse and we may be at bottom but no one knows.\n\nThe fear i see with sofi is loan defaults. We all know the consumer is about to default on debt and those holding that  debt will be wiped out.\n\nUntil you know that the debt they have is going to be paid back I would be cautious here. If they end up with people who pay this stock is a winner.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljde6km/",
      "created": 1724331677,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lje7ao0",
      "score": 1,
      "body": "Held down by options…lots of call volume around $7-8.  Traders sell there and drive down the price.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lje7ao0/",
      "created": 1724341384,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljanioj",
      "score": 1,
      "body": "Sell covered calls",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljanioj/",
      "created": 1724283682,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljaog7c",
      "score": 1,
      "body": "First time?",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljaog7c/",
      "created": 1724284016,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljbdk49",
      "score": 1,
      "body": "Because it was raised by a Chamath SPAC and Chamath is a POS",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljbdk49/",
      "created": 1724293312,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj9t2c1",
      "score": 1,
      "body": "I might be delusional because I bought back when it was still a pre-ipo SPAC, but the way SOFI has been trading for the past couple years reminds me of AMD and TSLA trading in a pretty tight range before having their huge breakouts. \n\nSeems to be held down in price so large players can accumulate and shake out retail, and should eventually rip. \n\nI’ve been buying small amounts consistently. Original purchase was 100 shares at 21/share in 2021. \nMy average cost is now down to 9.24 and I have 1300 shares. \n\nI think long term, Noto will deliver. But it’s a slow play.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lj9t2c1/",
      "created": 1724273397,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj9ta7a",
      "score": -16,
      "body": "Shitty online only bank, designed for poor people.\n\nDime a dozen.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lj9ta7a/",
      "created": 1724273462,
      "depth": 0,
      "replies": [
        {
          "id": "lj9ucff",
          "score": 13,
          "body": "not even remotely close",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lj9ucff/",
          "created": 1724273786,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljef07r",
          "score": 2,
          "body": "Well this is the quality DD I came for!",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljef07r/",
          "created": 1724343754,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lja0d48",
          "score": 2,
          "body": "The only thing dime a dozen are all the nonsensical posts people make, such as yours.",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja0d48/",
          "created": 1724275706,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj9w2x1",
          "score": 3,
          "body": "Cringe take.",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lj9w2x1/",
          "created": 1724274331,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj9ttv6",
          "score": 2,
          "body": "Designed for poor people? Their client base is notoriously well heeled. ",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lj9ttv6/",
          "created": 1724273629,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj9vyu7",
          "score": -1,
          "body": "You say online only like it’s a bad thing. That’s a pretty big advantage for a bank being that brick and mortar is a major expense and doesn’t add much if anything to profitability\n\nEdit: I’m getting a kick out of the responses to this comment. It is an objective fact that brick and mortar are money losers for banks. It’s a huge cost, and has a lot of additional regulation. If you could attract the same dollars without the branch, that’s a lot more profit going back to the bank",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lj9vyu7/",
          "created": 1724274294,
          "depth": 1,
          "replies": [
            {
              "id": "lj9yq3y",
              "score": 3,
              "body": "Not true.  Young people like online experience but they also don’t have money.  Older richer people like branches because they like to talk to the people handling their money.",
              "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lj9yq3y/",
              "created": 1724275178,
              "depth": 2,
              "replies": [
                {
                  "id": "lja0h5d",
                  "score": 3,
                  "body": "Older rich person here. I disagree with your comment. I hate dealing with b&m banks and tellers.",
                  "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja0h5d/",
                  "created": 1724275742,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lja40iu",
                      "score": 1,
                      "body": "How do you handle your financial planning?",
                      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja40iu/",
                      "created": 1724276889,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljaeu1u",
                          "score": 2,
                          "body": "I have a diversified portfolio of investments including stocks, bond, crypto, pre-ipo companies, real estate and high yield savings. I primarily use Sofi for savings and Fidelity for investing. I have an estate planner who I check in with every five years or so, just to stay on track. I also keep track of every investment on a monthly basis so that I can see high level overview of everything all in one place.",
                          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljaeu1u/",
                          "created": 1724280610,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "ljajxei",
                              "score": -2,
                              "body": "So you like to manage it mostly yourself.  A lot of Rich people I.e. doctors don’t so they outsource it but meet with their financial/wealth planner in person",
                              "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljajxei/",
                              "created": 1724282395,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lja6p6k",
                      "score": 1,
                      "body": "Sounds like an anecdote",
                      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja6p6k/",
                      "created": 1724277786,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lja2kos",
                  "score": 1,
                  "body": "What are you basing that on?",
                  "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja2kos/",
                  "created": 1724276424,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lja4nq0",
                      "score": 2,
                      "body": "https://www.bai.org/wp-content/uploads/2021/04/banking-attitudes-generation-by-generation.pdf",
                      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja4nq0/",
                      "created": 1724277100,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lja5h2f",
                          "score": 2,
                          "body": "Oh ok from your statement I thought you meant that a bit more universally. A little over half of boomers want to use a physical branch to open an account. I can believe that. It’s also something that should be expected to continue diminishing as older boomers die off and todays gen x becomes the old generation",
                          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja5h2f/",
                          "created": 1724277373,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lja6i8l",
                              "score": 0,
                              "body": "I’m not talking about using branches for basic banking services.  I’m more talking about branches to to meet with your financial advisor, personal banking or loan officer",
                              "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja6i8l/",
                              "created": 1724277720,
                              "depth": 6,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lj9xkrr",
          "score": 0,
          "body": "\n\nI love its ease of use. I use their bank for play money and use their investment system for the same. To just mess around",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lj9xkrr/",
          "created": 1724274811,
          "depth": 1,
          "replies": []
        },
        {
          "id": "lj9thuu",
          "score": -9,
          "body": "They aren't just a bank though. They are a fintech company, with actual b2b products..",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lj9thuu/",
          "created": 1724273528,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lj9xkf8",
      "score": 0,
      "body": "I'd like to see it get back down under 7, for now. I sold a bunch of shares when it peaked in July 2023 and then I started accumulating again by selling puts, but I didn't sell when it peaked again in December. But both of those peaks were around 10.5 and so that's the level that I'm looking for it to sort of revalue at in the next year. But for now, I'd like to see it get back down under 7.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lj9xkf8/",
      "created": 1724274808,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljb2l2j",
      "score": 0,
      "body": "If looking for a financial/bank stock….Don’t sofi but do NU instead",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljb2l2j/",
      "created": 1724289173,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lj9ybse",
      "score": -12,
      "body": "Company is likely to go bankrupt to be honest. Check back in 10 years. If you’re going long this company, your analysis is not good and you should just index.\n\nLet’s break down your bull points: “good product” doesn’t necessarily mean the stock is a good investment. This company’s growth is stalling but let’s argue the growth remains high as they move into riskier and riskier clients: high growth is a recipe for bankruptcy in banks. And why is the stock not performing? Because the market is forward looking and the price action seems mostly logical to me.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lj9ybse/",
      "created": 1724275050,
      "depth": 0,
      "replies": [
        {
          "id": "lj9yk4r",
          "score": 6,
          "body": "Why do you think they will go bankrupt?",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lj9yk4r/",
          "created": 1724275124,
          "depth": 1,
          "replies": [
            {
              "id": "lj9ywrs",
              "score": -9,
              "body": "Edited my original comment:\n\nLack of risk management is the #1 reason why banks go bankrupt. Look back 50 years and especially look back during the dot com bubble. The graveyard for banks is piled ridiculously high and Sofi exhibits a lot of these same symptoms. \n\nI am not currently short Sofi but in the past, I would short it every time it ran up. I’m retired from shorting now so I probably won’t enter a position.",
              "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lj9ywrs/",
              "created": 1724275238,
              "depth": 2,
              "replies": [
                {
                  "id": "lja0fdl",
                  "score": 12,
                  "body": "Where’s the lack of risk management in Sofi? Which symptoms are you referring to? Genuinely trying to understand. Banks are not typically high growth, which is why I can certainly see the argument for Sofi having too high of a valuation. But you totally lost me at a growing bank has poor risk management",
                  "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja0fdl/",
                  "created": 1724275726,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lj9ztoc",
                  "score": 8,
                  "body": "Why would you retire from shorting unless it wasn't going well? ",
                  "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lj9ztoc/",
                  "created": 1724275532,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lja0l8m",
                      "score": 3,
                      "body": "You answered your own question",
                      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja0l8m/",
                      "created": 1724275779,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "lja0ofj",
                      "score": -4,
                      "body": "I just hit the jackpot with RILY puts. Ended up turning 3.2m into almost 12m. I’m quitting shorting now and before that, I went in huge on CONN, taking stupid risk by overallocating into a short. If I got short squeezed, I could have lost millions. CONN’s bankruptcy was straightforward so I got lucky. \n\n**Building a short thesis is fucking ridiculous. I have to look at so many filings such as the NT-10q and sift through several hundreds of pages to understanding revolvers, critical audit matters, bullshit accounting, debt structure, adverse opinions from their auditors, and stupid business practices. I am not an accountant so I need to consult several people to build my thesis.**\n\nBuilding a short thesis takes forever but is such a high risk high reward activity. You almost have you live and breathe it. You can feel the drama of the management team as they milk their shareholders. It is addicting when you watch a company you’ve been pounding the table about finally drop 60% in a single day as it bleeds to death.\n\nAll that said, shorting leads to insanely quick returns. I want a simple life that I can enjoy so now I’m long only. I could probably go for 9 figures if I kept shorting, but I just want to live off my distributions.",
                      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja0ofj/",
                      "created": 1724275808,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lja7zv2",
                          "score": 1,
                          "body": "Congrats on going from 150k to 20m, I always hear about biotech being boom or bust but I always from the perspective of someone going long. There’s always someone on the other side.",
                          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja7zv2/",
                          "created": 1724278231,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lja37jz",
                  "score": 4,
                  "body": "Dude SoFi is notoriously conservative",
                  "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja37jz/",
                  "created": 1724276628,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "lja3guh",
                      "score": -4,
                      "body": "If you mean the credit scores, I don’t think you understand the nature of personal loans.",
                      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja3guh/",
                      "created": 1724276711,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljbhm8v",
                          "score": 1,
                          "body": "Discover seems to be doing well",
                          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljbhm8v/",
                          "created": 1724294899,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lja18uq",
          "score": 2,
          "body": "!Remindme 10 years",
          "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja18uq/",
          "created": 1724275991,
          "depth": 1,
          "replies": [
            {
              "id": "lja1ez1",
              "score": 1,
              "body": "I will be messaging you in 10 years on [**2034-08-21 21:33:11 UTC**](http://www.wolframalpha.com/input/?i=2034-08-21%2021:33:11%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja18uq/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1ey0hjq%2Fwhats_up_with_sofi%2Flja18uq%2F%5D%0A%0ARemindMe%21%202034-08-21%2021%3A33%3A11%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201ey0hjq)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
              "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/lja1ez1/",
              "created": 1724276047,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ljajx3a",
      "score": -4,
      "body": "Sold it a long time ago because I lost hope. Any stock backed by SPAC probably is overpriced.",
      "permalink": "/r/stocks/comments/1ey0hjq/whats_up_with_sofi/ljajx3a/",
      "created": 1724282392,
      "depth": 0,
      "replies": []
    }
  ]
}