{
  "title": "Snowflake Gives Outlook That Fails to Calm Investors on AI",
  "score": 83,
  "selftext": "Snowflake Inc. gave a sales outlook that failed to reassure investors that the company will gain ground in the market for artificial intelligence software tools. The shares fell in extended traded.\n\nProduct revenue, which makes up the bulk of Snowflake’s business, will be $850 million to $855 million in the period ending in October, the company said Wednesday in a statement. Analysts, on average, predicted $848 million, although some estimates exceeded $900 million, according to data compiled by Bloomberg. The company also raised its fiscal year product sales forecast to $3.36 billion from $3.3 billion.\n\nUnder Chief Executive Officer Sridhar Ramaswamy, Snowflake has launched products focused on generative AI and other new ways to analyze large sets of data. The strategy is fueled in part by increased pressure from rivals including Databricks Inc. and cloud infrastructure providers like Microsoft Corp. Snowflake offers software that helps customers find, organize and use huge amounts of information from a variety of sources.\n\nRamaswamy touted “product delivery, and great traction in the early stages of our new AI products.”\n\nStill, Snowflake is navigating a challenging environment between a recent CEO change, security breaches of its customers and some market shift to products outside its traditional wheelhouse, wrote Derrick Wood, an analyst at TD Cowen, ahead of the results.\n\nIn the fiscal second quarter, total revenue rose 29% to $868.8 million — coming in under 30% for the first time in Snowflake’s history as a publicly traded company.\n\nThe shares declined about 7% in extended trading after closing at $135.06 in New York. The stock has dropped 32% this year, as investors have been concerned about Snowflake’s ability to catch up in AI-oriented tools.\n\nClients including AT&T Inc., Live Nation Entertainment Inc.’s Ticketmaster and LendingTree Inc. had their Snowflake accounts breached as part of a hacking campaign beginning in May. Snowflake has said its own systems weren’t infiltrated and has added features for customers to implement better security settings.\n\n“We obviously had some rough headlines in the quarter,” Ramaswamy said of the customer breaches during a conference call after the results were released. “The issue wasn’t on the Snowflake side.”\n\nProduct revenue increased 30% to $829 million in the quarter, compared with the $813 million expected by analysts. Adjusted profit, excluding some items, was 18 cents a share, just ahead of the average estimate of 16 cents a share.\n\nSnowflake now has 510 customers that spent more than $1 million over a trailing 12-month period, up from 485 the previous quarter. Remaining performance obligations — another key benchmark of growth — were $5.2 billion in the period ended July 31, topping analysts’ average estimate of about $5 billion.\n\nThe company has added about 1,000 workers over the last year in a period when many peers were shedding employees or selectively hiring. Snowflake said it had 7,630 employees as of the second quarter.\n\nhttps://www.bloomberg.com/news/articles/2024-08-21/snowflake-outlook-fails-to-ease-investor-fears-of-competition",
  "link_flair_text": "Company News",
  "id": "1ey5mp4",
  "num_comments": 42,
  "created_utc": 1724286371,
  "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/",
  "comments": [
    {
      "id": "ljaxmue",
      "score": 67,
      "body": "“Investors” that expect ROI from AI investment in the next two years either A) Don’t understand AI or B) Breathe predominantly through their mouth.",
      "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljaxmue/",
      "created": 1724287339,
      "depth": 0,
      "replies": [
        {
          "id": "ljaysjv",
          "score": 17,
          "body": "I think the concern is twofold: 1) Snowflake is facing competition from Databricks and potentially their hyperscaler partners; 2) Companies would rather spend less on software if means being able to spend more money on training AI models.",
          "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljaysjv/",
          "created": 1724287764,
          "depth": 1,
          "replies": [
            {
              "id": "ljaywwe",
              "score": 7,
              "body": "Magically, we’re in agreement!",
              "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljaywwe/",
              "created": 1724287809,
              "depth": 2,
              "replies": []
            },
            {
              "id": "lje18pw",
              "score": 2,
              "body": "How would companies train their AI models without a data warehouse?",
              "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/lje18pw/",
              "created": 1724339508,
              "depth": 2,
              "replies": [
                {
                  "id": "ljgv0o1",
                  "score": -1,
                  "body": "Data lakes/open source options",
                  "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljgv0o1/",
                  "created": 1724372379,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljh4k1a",
                      "score": 1,
                      "body": "what are you talking about? data lakes mean someone is building a massive datacenter with tons of servers. You think companies want to bear the capex themselves?",
                      "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljh4k1a/",
                      "created": 1724375894,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ljbgvbd",
      "score": 15,
      "body": "CEOs don't typically resign without a well-orchestrated PR campaign and a well-documented succession plan. Slootman's abrupt exit was telling.",
      "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljbgvbd/",
      "created": 1724294600,
      "depth": 0,
      "replies": [
        {
          "id": "ljbhbxz",
          "score": 8,
          "body": "Berkshire selling for only a small gain says a lot too. But you know, that sort of stuff isn't uncommon. Like Starbucks' most recent CEO was fired and let go immediately. Though the reasons for that guy's firing are better known than Slootman's exit.",
          "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljbhbxz/",
          "created": 1724294784,
          "depth": 1,
          "replies": [
            {
              "id": "ljbi1e1",
              "score": 4,
              "body": "Slootman was different than the Starbucks guy, who by all accounts was a McKinsey-trained empty suit. I do think the Berkshire sale had a lot to do with the CEO change. I recall reading somewhere Todd Coombs, who is one of Berkshire's investment managers was close to Slootman.",
              "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljbi1e1/",
              "created": 1724295071,
              "depth": 2,
              "replies": [
                {
                  "id": "ljbj392",
                  "score": 1,
                  "body": "Why do you think that Slootman resigned?",
                  "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljbj392/",
                  "created": 1724295500,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljcvs37",
                      "score": 5,
                      "body": "I imagine he was forced out bc of his irresponsible decisions, both economic and business. The stock based compensation is WILD. He just hired cronies, lined their pockets, and watched them deteriorate the business. GTM team was ruined, momentum slipped, and he’s not a smart technologist so he couldn’t keep up like maybe a Muglia would have; see RelationalAI. Also, look at Slootman’s payday on Snowflake. His compensation package was so irresponsible by the board. \n\nLuckily, they have great founders, a great product that customers love, and a new CEO who is in the same circle as the OG AI crowd that paved the way for the young AI technologists. It’s clear they are going to push forward based on their projected hiring. This can align well with rate cuts and their AI products taking in revenue while they expand globally. Hopefully, Slootman’s folly doesn’t hurt the long term prospects bc he’s definitely ruined the reputation of a great company.",
                      "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljcvs37/",
                      "created": 1724323396,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ljayvqc",
      "score": 22,
      "body": "Snowflake has obscene stock-based compensations and adding 1,000 new workers when everyone else is trimming headcount shows how out of touch this new CEO seems to be, SNOW is toast when you consider they're chasing Databricks (who actually has AI products) and the AWS and Azure who are already offering competitive products, often for no extra cost. \n\nSnowflake is rudderless, they've been chasing some AI companies like Reka but that fell through, while Databricks was successful in acquiring Tabular. Berkshire sold their ENTIRE stake for a reason, they have a lot more insight than the typical investor or the average institutional or hedge fund.",
      "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljayvqc/",
      "created": 1724287796,
      "depth": 0,
      "replies": [
        {
          "id": "ljb5eyc",
          "score": 24,
          "body": "Imagine thinking Redshift or whatever new vaporware DB Microsoft is pushing lately are competitive products. Agreed about Databricks but they’re spending like crazy to be competitive. Databricks has been doing insanely expensive acquisitions whereas Snowflake has been doing smaller ones. Also you failed to mention the only reason Databricks acquired Tabular is because Snowflakes push towards Iceberg basically forced them too or they’d get left in the dust. Why fire employees when they’re in growth mode? Also agreed about the stock based comp it’s absolutely bonkers but maybe they’ll reign it down at some point.",
          "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljb5eyc/",
          "created": 1724290243,
          "depth": 1,
          "replies": [
            {
              "id": "ljb95fi",
              "score": 0,
              "body": "I'm not a data engineer or anything, but it seems like a crowded space with AWS, Google Cloud, and Microsoft potentially offering \"good enough\" data warehousing tools as a bundle with their cloud services. \n\nDatabricks spending like crazy means that margins are going to compress for Snowflake as customers shop around. You can have a great product but with a UI that people love but most companies focus on value and people use whatever their company gives them.",
              "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljb95fi/",
              "created": 1724291641,
              "depth": 2,
              "replies": [
                {
                  "id": "ljbc41p",
                  "score": 7,
                  "body": "It's not that crowded. There's only a few to pick and many companies have multiple.",
                  "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljbc41p/",
                  "created": 1724292761,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "lje1u7k",
                  "score": 3,
                  "body": "1) admits to knowing nothing about the market itself\n\n2) goes on to speculate about the market they know nothing about\n\nThe Reddit special!!",
                  "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/lje1u7k/",
                  "created": 1724339695,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ljbc7yj",
                  "score": 4,
                  "body": "We recently did this evaluation recently, went with Databricks > SNOW, Redshift.\n\n1. Databricks has the better partner integration momentum, which is a good indicator of \"best in class\" in a space\n2. Databricks has _consistently_ delivered on the roadmap they've promised during rollout. If you're familiar w/ the enterprise software space, that is very rare, almost unheard of.\n3. They're making good choices with their acquisitions. They're not quite there on BI dashboarding yet, but they've effectively created a fully integrated vertical data stack that you can move into piecemeal. Their approach encourages you to use multiple pieces without tripping the \"vendor lock-in\" fears that can hold up projects.\n4. Their GenAI approach includes multiple model options, including their own. That will make them less fragile as the space matures. Their differentiator is how they're defining hooks to feed warehouse data into GenAI w/o a lot of wrangling.\n\nOverall very happy with the selection ~1yr in, and I don't see an obvious path for SNOW to reclaim momentum within the space.",
                  "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljbc7yj/",
                  "created": 1724292802,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljdevca",
                      "score": 5,
                      "body": "I work for one of the largest private companies in the world and we use Snowflake. \n\nSnowflake is a buy",
                      "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljdevca/",
                      "created": 1724331940,
                      "depth": 4,
                      "replies": []
                    },
                    {
                      "id": "ljbdeqj",
                      "score": 2,
                      "body": "Anecdotally reading some old posts from here on Snowflake from people way more knowledgeable about the data warehousing/data engineering space than I, it seems like more people like Databricks more than Snowflake. \n\nPlus watching some videos on the subject, it seems like Microsoft's Fabric could be a threat to both companies. But then again, it seems like most companies pay for a variety of tools in this space so perhaps the FUD about SNOW is potentially unfounded. But still, I think valuation in the face of competition and margin pressure is a concern.",
                      "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljbdeqj/",
                      "created": 1724293254,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ljb2r06",
          "score": 3,
          "body": "Snowflake did an interview recently (in response to the Tabular acquisition) that they were most concerned about Google BigQuery. Snowflake is in a super competitive space, and everyone is coming for them.",
          "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljb2r06/",
          "created": 1724289234,
          "depth": 1,
          "replies": [
            {
              "id": "ljb4aoq",
              "score": -6,
              "body": "Yeah, I'd imagine it doesn't take much to clone what Snowflake does... seems like on the surface, it eases the joining of tables from databases with different primary keys without modifying the underlying data.",
              "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljb4aoq/",
              "created": 1724289819,
              "depth": 2,
              "replies": [
                {
                  "id": "ljb672t",
                  "score": 10,
                  "body": "That’s pretty naive these products are very sticky you aren’t building a tech stack dependent on a DB then switching to another on a whim. In fact other companies like Accenture and Deloitte make hundreds of millions a year alone in assisting companies with migration plans.",
                  "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljb672t/",
                  "created": 1724290536,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljbahr7",
                      "score": -2,
                      "body": "Data stacks last only as long as the leadership over it lasts.  When they change it changes.",
                      "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljbahr7/",
                      "created": 1724292144,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "lje1mg5",
                          "score": 1,
                          "body": "There has been crazy exec turnover across all companies these days. How often do you hear about tech stacks getting replaced?",
                          "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/lje1mg5/",
                          "created": 1724339628,
                          "depth": 5,
                          "replies": [
                            {
                              "id": "lje2pd5",
                              "score": 0,
                              "body": "By tech stacks I mean things like snowflake, data bricks, synapse, redshift.  It happens quite a bit in healthcare",
                              "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/lje2pd5/",
                              "created": 1724339964,
                              "depth": 6,
                              "replies": [
                                {
                                  "id": "lje9sa8",
                                  "score": 1,
                                  "body": "give me some examples. I find it hard to believe that large enterprises with all their mission critical data carefully organized and tagged would be willing to throw it all away and start over again with a new vendor just to save 10% on the bill. The migration costs and business risks far outweigh the benefit",
                                  "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/lje9sa8/",
                                  "created": 1724342140,
                                  "depth": 7,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ljb8pq6",
                  "score": 2,
                  "body": "[removed]",
                  "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljb8pq6/",
                  "created": 1724291476,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljba250",
                      "score": 1,
                      "body": "I acknowledge my ignorance on the subject. But even if competitors' products aren't as competitive or as good as Snowflake's, they can always offer a discount on volume or force Snowflake to lower their prices so that Snowflake can retain them as a customer. Margin compression for a company that isn't profitable on GAAP basis with huge SBC and is priced at 10x revenue doesn't mean the stock has much room to run.",
                      "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljba250/",
                      "created": 1724291981,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljczmv3",
                          "score": 3,
                          "body": "Good, I’m glad you at least rolled that one back. And yes, competitors can always offer discounts and it’s a great tactic especially for the cloud vendors. Luckily for Snowflake, AWS doesn’t have a great product for the largest enterprises to use so the customer would have to switch to GCP or Azure. If you’re a global company, I find it unlikely you’re successfully running on BQ or Fabric at scale although the technology on both has improved. I read from an insider that Google are actually shifting away from BQ product investments to focus fully on AI which is good for SNOW. Regardless, GCP and Azure are far behind in the cloud race compared to AWS.\n\nCompletely agree on SBC. Slootman ruined the progress and momentum of the company with this and bad hiring. 10x revenue valuation is tiny in the big data/AI space so I don’t get the concern there when they are on the high side of growth rates and customer satisfaction. Also, they haven’t projected their new product revenue into their guidance yet. This could add an additional $100M+ to revenue this year. Might not be a moonshot but it’s certainly not the downfall of a company like the short sellers want you to believe so you sell the stock.",
                          "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljczmv3/",
                          "created": 1724325411,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ljekbel",
          "score": 1,
          "body": "If you think Snowflake has crazy stock based compensation wait until you see Databricks’ balance sheet.",
          "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljekbel/",
          "created": 1724345397,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljc7wln",
      "score": 0,
      "body": "I don't think Snowflake can survive on its own as a standalone company. It's just too limited in its offerings and would be much better off as a division of a larger software company.",
      "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljc7wln/",
      "created": 1724308132,
      "depth": 0,
      "replies": [
        {
          "id": "ljhf2yw",
          "score": 1,
          "body": "Exactly. Snowflake is a feature of a cloud provider, not a standalone company. The only questions are which hyperscaler will acquire them, when, and at what cost?",
          "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljhf2yw/",
          "created": 1724379902,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljdoapa",
      "score": 2,
      "body": "Snowflake currently has a revenue multiple of 10.4x, which is on the higher end for SaaS companies. In comparison, Adobe has a revenue multiple of 11.1x despite growing revenue at a slower 10.2% YoY pace: [Public SaaS Companies - SNOW](https://publicsaascompanies.com)\n\nSnowflake's high valuation comes despite facing increasing competition from the hyperscalers and Databricks in the AI/data warehousing space. The company is also navigating a CEO change and recent security breaches. With the stock already down 32% YTD, Snowflake may have further downside if it fails to gain traction with its new AI products and margins compress from competitive pressures.",
      "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljdoapa/",
      "created": 1724335315,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljee4g4",
      "score": 1,
      "body": "Lot of competition in this space.",
      "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljee4g4/",
      "created": 1724343481,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljcu7ck",
      "score": 1,
      "body": "AI Hype  = Self driving cars hype",
      "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljcu7ck/",
      "created": 1724322485,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljb6r37",
      "score": -4,
      "body": "[deleted]",
      "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljb6r37/",
      "created": 1724290746,
      "depth": 0,
      "replies": [
        {
          "id": "ljcfcwz",
          "score": 1,
          "body": "Lmao you sir should not invest in stocks if you dont understand the difference between the companies.",
          "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljcfcwz/",
          "created": 1724312922,
          "depth": 1,
          "replies": [
            {
              "id": "lje5pam",
              "score": 1,
              "body": "I deleted my comment but my original idea holds, SNOW is not an AI stock, they are struggling in face of competition and the dilution from management is borderline give-away at cost of investors. I was only proposing another company that actually has AI upside but anyway my comments were misconstrued :) SNOW has no moat, neither strong indicators of growth, they were just jumping on AI bandwagon.",
              "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/lje5pam/",
              "created": 1724340895,
              "depth": 2,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ljddh8l",
      "score": 0,
      "body": "Wasn’t planning on ever touching Snowflake again and… looks like that’s still true!",
      "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljddh8l/",
      "created": 1724331408,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljcdzk9",
      "score": -1,
      "body": "rather than focusing on cutting significant operating cost, they instead tryhard 2.5bil buybacks with massive positive keywords in earnings call.\n\nand the stock still dumps… without earnings call algo keyword manipulation and buyback announcement, they are definitely worth <$100/share",
      "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljcdzk9/",
      "created": 1724312010,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljbtrfi",
      "score": -2,
      "body": "That’s an all time low. Damn.",
      "permalink": "/r/stocks/comments/1ey5mp4/snowflake_gives_outlook_that_fails_to_calm/ljbtrfi/",
      "created": 1724300223,
      "depth": 0,
      "replies": []
    }
  ]
}