{
  "title": "TD Bank swings to quarterly loss after $2.6 billion hit tied to US probe",
  "score": 75,
  "selftext": "TD Bank missed quarterly earnings estimates on Thursday and reported a rare loss after it set aside a further $2.6 billion to prepare for fines from U.S. regulators following investigations into the Canadian lender's anti-money laundering (AML) measures.\n\nThe bank's U.S. business, which accounts for about a quarter of TD's profit, reported a 5.6% fall in net income hurt by lower deposit volumes and loan margins.\n\nThe U.S. has been a key growth market for the bank where it has invested billions over the past two decades to acquire smaller regional banks on the east coast, building a network of 1,100 branches, more than it has across Canada.\n\nThe regulatory probe was disclosed last year shortly after TD terminated its $13.4 billion First Horizon acquisition that would have added about 400 branches to its network in the southeast U.S.\n\nTD said a provision of $3 billion it has taken so far reflects its estimate of the total fines it would have to pay, but it could also face non-monetary penalties from U.S. regulators.\n\n\"These may include an asset cap that would restrict loan growth... If growth here is restricted, TD could deliver sub-par earnings growth relative to peers over the next several years,\" National Bank analyst Gabriel Dechaine wrote.\n\nThe $2.6 billion provision announced on Wednesday comes on top of $450 million it set aside in April.\n\nThe probes have been a major overhang on TD's stock over the last year, with investors concerned about the resolution timeline and potential cost. The clarification of the direct financial impact of the bank's AML issues could result in a short-term \"relief rally,\" Dechaine said.\n\nThe stock has fallen 5% so far this year, underperforming the TSX banking index's 8.6% growth.\n\nIn Canada, personal and commercial banking recorded a 13% rise in net income driven by new account openings and volume growth. TD's wealth management and insurance earnings were flat, reflecting impact from severe weather events.\n\nThe net loss was C$181 million, or 14 Canadian cents per share, in the three months ended July 31, compared with a profit of C$2.88 billion, or C$1.53 per share, a year earlier.\n\nOn an adjusted basis, TD earned C$2.05 ($1.51) per share, 2 Canadian cents short of analysts' estimates, according to LSEG data.\n\nProvision for credit losses rose to C$1.07 billion, compared with C$766 million a year ago.\n\nTD kicks off the earnings season for Canadian banks with others slated to report their results next week.\n\nSource: https://ca.finance.yahoo.com/news/td-bank-swings-quarterly-loss-101701381.html",
  "link_flair_text": null,
  "id": "1eyiyce",
  "num_comments": 9,
  "created_utc": 1724332281,
  "permalink": "/r/stocks/comments/1eyiyce/td_bank_swings_to_quarterly_loss_after_26_billion/",
  "comments": [
    {
      "id": "ljeg5b8",
      "score": 26,
      "body": "This is what happens when bad management is allowed to continue on.  The ceo should be terminated.  \n\nInstead he offered a salary decrease.  Mind blowing that someone can keep their job after this kind of gross incompetence by bribing his way back into a job.  ",
      "permalink": "/r/stocks/comments/1eyiyce/td_bank_swings_to_quarterly_loss_after_26_billion/ljeg5b8/",
      "created": 1724344108,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljhlptl",
      "score": 8,
      "body": "I just can't bring myself to invest directly in banks because I feel like I have absolutely no insight into what their actual risk exposures are.  There's always some irresponsible scheme brewing that blows up eventually.",
      "permalink": "/r/stocks/comments/1eyiyce/td_bank_swings_to_quarterly_loss_after_26_billion/ljhlptl/",
      "created": 1724382602,
      "depth": 0,
      "replies": [
        {
          "id": "ljig1un",
          "score": 1,
          "body": "I refuse to touch them, agree totally irresponsible.  My worst loss was dipping my toes into one, overnight crash never to recover then went zero within the span of a few weeks and it was at a profit with an industry standard PE.  Worst then irresponsible criminal stuff seems to always be involved, and you will never get real details they lie to investors worst then Enron and get away with it.",
          "permalink": "/r/stocks/comments/1eyiyce/td_bank_swings_to_quarterly_loss_after_26_billion/ljig1un/",
          "created": 1724399086,
          "depth": 1,
          "replies": [
            {
              "id": "ljrma7y",
              "score": 0,
              "body": "[removed]",
              "permalink": "/r/stocks/comments/1eyiyce/td_bank_swings_to_quarterly_loss_after_26_billion/ljrma7y/",
              "created": 1724535559,
              "depth": 2,
              "replies": [
                {
                  "id": "ljrwinh",
                  "score": 1,
                  "body": "And right to stalking across sub reddit with added personal insults as expected.",
                  "permalink": "/r/stocks/comments/1eyiyce/td_bank_swings_to_quarterly_loss_after_26_billion/ljrwinh/",
                  "created": 1724539506,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lkexcmh",
      "score": 1,
      "body": "\n\nWhat are the chances TD bank collapses due to the AML saga? I have my $85k RDSP with TD and I don't want to lose it. I don't think it will collapse as the TD share price is stable. Markets are forward looking so if there was risk of collapse TD share price would be in the mid teens or low 20s a share to reflect the risk and that is not happening. Back in 2008-2010 when CIBC had lost $10 billion USD on the US housing crash during the GFC, it was on the brink of collapse and it share price reflected that. It fell from over $100/share to $35-$40 a share. That's just not happening with TD.",
      "permalink": "/r/stocks/comments/1eyiyce/td_bank_swings_to_quarterly_loss_after_26_billion/lkexcmh/",
      "created": 1724886092,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lje4ovf",
      "score": 0,
      "body": "Great timing to reduce bonus for front line employees",
      "permalink": "/r/stocks/comments/1eyiyce/td_bank_swings_to_quarterly_loss_after_26_billion/lje4ovf/",
      "created": 1724340581,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljdxv4d",
      "score": -7,
      "body": "Lol lol",
      "permalink": "/r/stocks/comments/1eyiyce/td_bank_swings_to_quarterly_loss_after_26_billion/ljdxv4d/",
      "created": 1724338446,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljds2bq",
      "score": -15,
      "body": "The only bank stock u should own is Chase thh",
      "permalink": "/r/stocks/comments/1eyiyce/td_bank_swings_to_quarterly_loss_after_26_billion/ljds2bq/",
      "created": 1724336583,
      "depth": 0,
      "replies": []
    }
  ]
}