{
  "title": "Peloton shares rise more than 10% as turnaround plan takes hold, losses shrink ",
  "score": 38,
  "selftext": "Peloton said Thursday it is digging itself out of the red and eked out a slight sales increase for the first time in nine quarters as it slashed its overall losses. \n\nThe beleaguered connected fitness company, which is currently being run by two board members after former CEO Barry McCarthy resigned earlier this year, saw sales grow by 0.2% during its fiscal fourth quarter. While only a modest uptick, it’s the first time Peloton posted year-over-year revenue growth since its 2021 holiday quarter. \n\nThe company also indicated it’s ready to focus on profitability over growth with significant cuts to its marketing and sales spending and meaningful increases to free cash flow and adjusted EBITDA. Those cuts helped Peloton narrow its quarterly losses to $30.5 million from $241.1 million in the year-ago period.\n\nThe company’s shares rose more than 10% in premarket trading.\n\nHere’s how the Bike and Tread maker performed compared with what Wall Street was anticipating, based on a survey of analysts by LSEG:\n\nLoss per share: 8 cents vs. 17 cents expected\n\nRevenue: $644 million vs. $631 million expected\n\nFor the three-month period that ended June 30, Peloton significantly narrowed its losses. The company posted a loss of $30.5 million, or 8 cents per share, compared with a loss of $241.8 million, or 68 cents per share, a year earlier. \n\nSales rose to $643.6 million, up about 0.2% from $642.1 million a year earlier. That’s only a $1.5 million increase, but Peloton did it at a time when sales are typically a bit slower for the company, because the quarter bleeds into the summer when people are more focused on going out and traveling than working out. The last time Peloton delivered year-over-year sales growth was during its holiday season in 2021, which is typically the company’s strongest quarter.\n\nSecondary market gains\n\nDuring the quarter, sales for Peloton’s pricy connected fitness hardware fell about 4%, continuing a trend for the company. But subscription revenue rose by 2.3%, and the segment’s gross margin increased by 1 percentage point.\n\nThough hardware sales were down, Peloton is growing its subscription revenue through the secondary market where people can buy used stationary bikes for a fraction of the cost of a new one. During the quarter, subscription revenue from hardware purchased on the secondary market grew 16% year over year.\n\n“We believe a meaningful share of these subscribers are incremental, and they exhibit lower net churn rates than rental subscribers,” the company said in a letter to shareholders.\n\nWhile hardware sales have hurt Peloton’s overall performance, sales for its Tread are growing after it overcame a costly recall. During the quarter, sales from Peloton’s treadmill portfolio grew 42% year over year.\n\nThe company is also seeing some positive signs in its Bike rental program, which allowed it to clear through a glut of inventory. During the quarter, average net monthly paid subscription churn for rentals was down 1.1 percentage points. Demand has been so steady, it no longer has the refurbished inventory levels necessary to supply that side of the program. The company ceased offering its original Bike rental program on Aug. 1 and since then, has seen demand grow for its Bike+ rental, refurbished original Bike sales and financed new Bike sales.\n\n“These alternative programs have stronger unit economics than original Bike rental, with more cash paid upfront and a stronger retention profile,” the company said in its shareholder letter.\n\nEver since Peloton’s pandemic heyday came to an end, the company has struggled to generate free cash flow and ensure it has enough assets on its balance sheet to cover its many liabilities. Earlier this year, it announced a sprawling restructuring plan that included cutting 15% of the company’s global workforce to achieve $200 million in annualized cost savings by the end of fiscal 2025.\n\nThose efforts are starting to bear fruit.\n\nDuring the quarter, Peloton delivered adjusted EBITDA and free cash flow for the second consecutive quarter – a feat it had not pulled off since the height of the Covid-19 pandemic. It posted $70 million of adjusted EBITDA, far more than the $53 million that analysts had expected, according to StreetAccount. \n\nThat metric was up $105 million compared with the year-ago period and $64 million quarter over quarter.\n\nPeloton also generated $26 million in free cash flow, compared with negative $74 million in the year-ago period and $8 million in the prior quarter.\n\nImprovements to Peloton’s balance sheet come after the company completed massive refinancing of its debt that staved off a looming liquidity crunch and pushed out its debt maturities by several years.\n\nPeloton noted that the search for its next CEO is “top of mind for all stakeholders.” “The process is well underway and we look forward to sharing more when we have an announcement,” it said.\n\nProfit over growth\n\nFor the year ahead, Peloton is planning to invest in its hardware and software to deliver a better user experience, among other initiatives. However, its guidance assumes that investments in these new initiatives “will not deliver subscriber growth within the fiscal year,” indicating Peloton may finally be shifting its focus away from growth in favor of profitability and free cash flow generation.\n\nThat’s evidenced by its reductions to sales and marketing spending — an expense that has long dragged down Peloton’s balance sheet and has been criticized as being too high for the company’s size.\n\nDuring the quarter, Peloton cut sales and marketing spending by $25.5 million, or 19% year over year. It said it expects to continue to make reductions to its marketing budget throughout fiscal 2025.\n\nFor the current quarter, Peloton is projecting sales to be worse than Wall Street expected but is guiding to higher-than-forecast adjusted EBITDA. The company said it anticipates sales to be between $560 million and $580 million, compared with estimates of $609 million, according to LSEG. It’s expecting to post adjusted EBITDA of $50 million to $60 million, compared with estimates of $45 million, according to StreetAccount.\n\nStreetAccount analysts had expected the number of connected fitness subscribers to be 2.96 million during the current quarter, but Peloton projects a range of 2.88 million to 2.89 million instead.\n\nFor the full year, Peloton expects sales to be between $2.4 billion and $2.5 billion, compared with estimates of $2.7 billion, according to LSEG.\n\nSource: https://www.cnbc.com/2024/08/22/peloton-pton-earnings-q4-2024.html",
  "link_flair_text": null,
  "id": "1eyiujm",
  "num_comments": 31,
  "created_utc": 1724331988,
  "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/",
  "comments": [
    {
      "id": "ljdi9l4",
      "score": 39,
      "body": "I’ve been watching pton for a while wondering if there was an opportunity and each time decides it wasn’t worth it. I stand by that. Shrinking losses and few growth drivers are not motivation for me to buy",
      "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljdi9l4/",
      "created": 1724333193,
      "depth": 0,
      "replies": [
        {
          "id": "ljdoia7",
          "score": 14,
          "body": "The only way I can see peloton becoming a good investment is if we get hit with another lockdown. Even then it’ll still be short term growth",
          "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljdoia7/",
          "created": 1724335387,
          "depth": 1,
          "replies": [
            {
              "id": "ljemsu5",
              "score": 8,
              "body": "Bingo.  \nPeloton only did well because it gained traction when spin class folks couldn't go in person.\n\nIt became the cool thing to do.   It came and went.   \n\nNow it's just another exercise bike collecting clothes in the corner of a bedroom.",
              "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljemsu5/",
              "created": 1724346156,
              "depth": 2,
              "replies": [
                {
                  "id": "ljghzcs",
                  "score": 10,
                  "body": "It's not. They have a really healthy operating margin, especially on subscriptions. They just have way too much over head that they are actively trying to reduce. You should really read a financial statement.",
                  "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljghzcs/",
                  "created": 1724367639,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ljdwdpt",
              "score": 2,
              "body": "They're probably a decent acquisition target. Their brand name and foothold in the fitness sector probably gives it value.",
              "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljdwdpt/",
              "created": 1724337972,
              "depth": 2,
              "replies": [
                {
                  "id": "ljdzrtk",
                  "score": 1,
                  "body": "I'm pretty sure you can buy the subscription by itself now, too, for like $13/month without also needing their ~$2000 stationary bike.\n\nHonestly a little surprised that hasn't been more popular because the video style \"classes\" or whatever seemed like the entire selling point from the get-go.",
                  "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljdzrtk/",
                  "created": 1724339044,
                  "depth": 3,
                  "replies": []
                }
              ]
            },
            {
              "id": "ljdt59o",
              "score": 1,
              "body": "There won't be another lockdown in our lifetime unless WW3 breaks out or there is massive civil unrest. PTON, like many pandemic darlings, was grossly overvalued (something like $65b in market cap at its peak), it just went down to its true value.",
              "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljdt59o/",
              "created": 1724336937,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljdyae7",
          "score": 3,
          "body": "I love to shake the hands of anyone that sold at 200 but who the f*** would buy an exercise bike with an iPad to tape to it",
          "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljdyae7/",
          "created": 1724338578,
          "depth": 1,
          "replies": [
            {
              "id": "ljdymfu",
              "score": 1,
              "body": "Yea some serious money was definitely made, and lost, on this one",
              "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljdymfu/",
              "created": 1724338683,
              "depth": 2,
              "replies": []
            }
          ]
        },
        {
          "id": "ljguqpc",
          "score": 3,
          "body": "Never bet on Americans exercising.",
          "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljguqpc/",
          "created": 1724372278,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljghf1q",
          "score": 2,
          "body": "Agreed. I think it will end up being a profitable company and have been following it over the last 6 months. Almost pulled the trigger when it went below $3 but it coincided with better opportunities elsewhere so I didn't buy. It's just valued too high to take on the risk.",
          "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljghf1q/",
          "created": 1724367436,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljdqojz",
          "score": 1,
          "body": "It probably will go down. Same stuff that happened with RIVN. I got some as I enjoy their products but any growth will take time. I need to buy more.",
          "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljdqojz/",
          "created": 1724336127,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "ljdmo8v",
      "score": 18,
      "body": "Up 12% and I’m still down 95% lol. My worst investing mistake ever.\n\n2% sales growth YoY, still a high churn rate, and lowered Q1 2025 and FY 2025 guidance gives me no hope. \n\nGuess I’ll just hang on to this stock until something miraculous happens (it wont).",
      "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljdmo8v/",
      "created": 1724334764,
      "depth": 0,
      "replies": [
        {
          "id": "ljdwhvk",
          "score": 4,
          "body": "If you don't believe in the stock you might as well just take the capital loss and move on.",
          "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljdwhvk/",
          "created": 1724338009,
          "depth": 1,
          "replies": [
            {
              "id": "ljdxivk",
              "score": 6,
              "body": "I don’t agree. The 1% chance of a significant increase is far more rewarding that cashing out.\n\n$PTON makes up 0.4% of my portfolio. It’s Pennie’s relative to my other positions. I don’t need that money so may as well let it sit",
              "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljdxivk/",
              "created": 1724338338,
              "depth": 2,
              "replies": [
                {
                  "id": "lje0f1g",
                  "score": 7,
                  "body": "I'd eat the loss, let it sit in a better stock and take some tax benefits along the way, personally.",
                  "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/lje0f1g/",
                  "created": 1724339249,
                  "depth": 3,
                  "replies": []
                },
                {
                  "id": "ljei771",
                  "score": 2,
                  "body": "You do realize how the math works against you here right?\n\nThe stock may have fallen 95% from where you bought in, but in order for you to just break even on your investment you need Peleton to shot up 2,000%. A mere 95% rise from it's lows won't even be close to enough for you to just break even on it.\n\nAnd that's ignoring how things like shareholder dilution will make it even harder for the stock to rocket up that much.",
                  "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljei771/",
                  "created": 1724344748,
                  "depth": 3,
                  "replies": [
                    {
                      "id": "ljemwkd",
                      "score": 1,
                      "body": "You’re absolutely right. But what I’m saying is the $800 that I would sell now isn’t even worth putting in the market. If anything it’s a good daily reminder to not to chase trends and to choose proven, strong companies and to DCA over time.",
                      "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljemwkd/",
                      "created": 1724346189,
                      "depth": 4,
                      "replies": [
                        {
                          "id": "ljh8q81",
                          "score": 2,
                          "body": "I mean $800 worth of NVDA seems better than $800 worth of PTON (on which you’re already down 95% on), but that’s just me personally.\n\nIt’d be different if your PTON were worth like $5 or even $50 now because yeah that’s pennies. But $800 can still buy a few shares of a decent stock.",
                          "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljh8q81/",
                          "created": 1724377483,
                          "depth": 5,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ljetpta",
                      "score": 0,
                      "body": "Actually this doesn't paint the whole picture. Stock market gains are binomial. \n\n  \nMeaning that a 10% drop, that subsequently requires a higher value 11% gain to break even, both have the same probability of happening.",
                      "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljetpta/",
                      "created": 1724348267,
                      "depth": 4,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ljdmw3c",
          "score": 1,
          "body": "Also pretty far from profitability so even still they are pricing in a lot of growth",
          "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljdmw3c/",
          "created": 1724334838,
          "depth": 1,
          "replies": []
        },
        {
          "id": "ljdyf0a",
          "score": 0,
          "body": "Can I ask what price you bought at and why you thought it was a good deal at that time I mean I could have just given you my DD of 40 years watching parents and loved ones buy exercise equipment that become clothes hangers. \n\nAnd I already have an iPad",
          "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljdyf0a/",
          "created": 1724338618,
          "depth": 1,
          "replies": []
        }
      ]
    },
    {
      "id": "lje9khz",
      "score": 7,
      "body": "Probably would have been better if they existed as a private company.",
      "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/lje9khz/",
      "created": 1724342075,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljfguvq",
      "score": 4,
      "body": "The chart of this thing is so dangerous. There are just no good probabilities on the long side. It doesn't mean it won't work, it doesn't mean it's not going to pull a carvana. But the statistics are against you \n\nYou just look at that pandemic top, what an epic short",
      "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljfguvq/",
      "created": 1724355431,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljdy751",
      "score": 1,
      "body": "🤣🫨",
      "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljdy751/",
      "created": 1724338550,
      "depth": 0,
      "replies": []
    },
    {
      "id": "ljvqgw1",
      "score": 1,
      "body": "I heard peloton initiated the covid virus...",
      "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljvqgw1/",
      "created": 1724604807,
      "depth": 0,
      "replies": []
    },
    {
      "id": "lje8ov6",
      "score": 0,
      "body": "I would buy a discounted one but I'm tired of subscription services... I want a buy it for life option",
      "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/lje8ov6/",
      "created": 1724341808,
      "depth": 0,
      "replies": [
        {
          "id": "ljegtgq",
          "score": 2,
          "body": "There's just no way that model would ever work, paying for licensed music and trainers posting new stuff every day means a subscription is pretty mandatory. That or a really heavy AD model",
          "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljegtgq/",
          "created": 1724344317,
          "depth": 1,
          "replies": [
            {
              "id": "ljeuyzp",
              "score": 1,
              "body": "I found a post of a guy removing the screen and using another monitor / ipad... It's probably the better way to go for video/music.",
              "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljeuyzp/",
              "created": 1724348647,
              "depth": 2,
              "replies": [
                {
                  "id": "ljh8yoy",
                  "score": 2,
                  "body": "Then you don’t peloton for that. Just buy any cheap stationary bike and slap a tablet on it.",
                  "permalink": "/r/stocks/comments/1eyiujm/peloton_shares_rise_more_than_10_as_turnaround/ljh8yoy/",
                  "created": 1724377571,
                  "depth": 3,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}