{
  "title": "July home sales break a four-month losing streak as supply rises nearly 20% over last year",
  "score": 31,
  "selftext": "[https://www.cnbc.com/2024/08/22/july-home-sales-break-4-month-losing-streak-as-supply-rises-nearly-20percent.html](https://www.cnbc.com/2024/08/22/july-home-sales-break-4-month-losing-streak-as-supply-rises-nearly-20percent.html)\n\nClosed sales of previously owned homes rose 1.3% in July compared with June to a seasonally adjusted, annualized rate of 3.95 million units, according to the National Association of Realtors. That was the first gain in five months.\n\nSales were 2.5% lower compared with the same time last year.\n\nSales saw the biggest gains in the Northeast and were flat in the Midwest. Prices also rose the most in the Northeast.\n\n“Despite the modest gain, home sales are still sluggish,” said Lawrence Yun, NAR’s chief economist, in a release. “But consumers are definitely seeing more choices, and affordability is improving due to lower interest rates.”\n\nThese sales are based on contracts that were likely signed in May and June, when mortgage rates were well over 7% on the popular 30-year fixed loan. Rates began dropping in July and are now hovering around 6.5%.\n\nAll-cash offers made up 27% of July sales, up from 26% the year before and far higher than the historical norm.\n\nThe supply of homes for sale continued to move higher in July. At the end of the month, there were 1.33 million homes on the market, an increase of 0.8% from June and 19.8% higher than in July 2023. At the current sales pace, that represents a four-month supply, slightly lower than it was in June.\n\nThe increase in supply did not, however, help to cool home prices. The median price of an existing home sold in July was $442,600, an increase of 4.2% year-over-year.\n\nFirst-time buyers made up 29% of sales in July, unchanged from June but down from 30% in July 2023. Historically, these buyers make up closer to 40% of home sales, but affordability has been hit hard in the last two years due to fast-rising home prices and higher mortgage rates.\n\nWith rates now slightly lower, demand is starting to pick up. A separate report from Redfin, a real estate brokerage, found requests for tours and other buying services from Redfin agents rose 4% over the last week to its highest level in two months.\n\n",
  "link_flair_text": null,
  "id": "1eylzgh",
  "num_comments": 1,
  "created_utc": 1724339930,
  "permalink": "/r/stocks/comments/1eylzgh/july_home_sales_break_a_fourmonth_losing_streak/",
  "comments": [
    {
      "id": "ljk88eq",
      "score": 1,
      "body": "If you believe the housing market will get an instant boost from an interest rate cut then the hypersensitive market will react by rising stock prices for builders and home improvement retailers. Though retailers like Home Depot & Lowes have already been bid up from the expected rate cut next month.",
      "permalink": "/r/stocks/comments/1eylzgh/july_home_sales_break_a_fourmonth_losing_streak/ljk88eq/",
      "created": 1724427668,
      "depth": 0,
      "replies": []
    }
  ]
}